{
  "url": "https://www.seriouseats.com/30-minute-pressure-cooker-split-pea-soup-recipe",
  "image_url": null,
  "tags": [
    "Soups",
    "Pressure Cooker",
    "Split Peas",
    "Ham",
    "Quick Dinners"
  ],
  "title": "30-Minute Pressure Cooker Split Pea and Ham Soup Recipe",
  "full_text": "30-Minute Pressure Cooker Split Pea and Ham Soup Recipe\nJump to recipe\nCook\n30 mins\nActive\n10 mins\nTotal\n30 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n1\nmedium\nonion\n, finely diced (about\n6\nounces\n;\n170\ng\n)\n1\nlarge rib\ncelery\n, finely diced (about\n4\nounces\n;\n125\ng\n)\n6\nounces\n(\n170\ng\n)\nham steak\n, diced (see note)\n2\nmedium cloves\ngarlic\n, minced\n1\npound\n(\n450\ng\n)\ndried green split peas\n6\ncups\n(\n1.5\nL\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n, or water\n2\nbay leaves\nKosher salt\nand freshly\nground black pepper\nDirections\nMelt butter in a pressure cooker over medium heat. Add onion, celery, and ham and cook, stirring, until softened but not browned, about 3 minutes. Add garlic and cook until aromatic, about 30 seconds.\nAdd peas, chicken stock or water, and bay leaves. Stir to combine, then cover pot and bring to high pressure. Cook for 20 minutes, then rapidly release pressure by opening the air valve. Open pot lid, stir contents until smooth, season to taste with salt and pepper, and serve. Carefully clean the pressure cooker's gasket and valves as soon as the pot is cool enough to handle; pea soup can easily clog valves, which can cause your cooker to over-pressurize the next time you use it. Soup can be stored in the refrigerator for up to 1 week.\nNotes\nYou can use a whole cured or smoked ham hock in place of the diced ham, or bacon or pancetta, if you prefer. If you use a hock, pick off the meat after cooking in step 2 and add it back to the soup, discarding the bone.\nSpecial Equipment\nElectric countertop pressure cooker or stovetop pressure cooker\nRead More\nSplit Pea and Ham Soup\nSoups\nPressure Cooker\nSplit Peas\nHam\nQuick Dinners"
}