{
  "url": "https://www.seriouseats.com/ackee-and-saltfish",
  "image_url": null,
  "tags": [
    "Jamaican",
    "Fish",
    "Caribbean",
    "Cod",
    "Breakfast & Brunch"
  ],
  "title": "Ackee and Saltfish",
  "full_text": "Ackee and Saltfish\nJump to recipe\nPrep\n5 mins\nCook\n75 mins\nActive\n20 mins\nSoaking Time\n60 mins\nTotal\n2 hrs 20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(\n225\ng\n)\nsalt cod\n2\ntablespoons\n(\n30\nml\n) neutral\noil\n, such as\ncanola\nor\nvegetable\n2\ntablespoons\n(\n1\nounce\n;\n30\ng\n)\ndiced yellow onion\n, from\n1/4\nonion\n2\nheaping tablespoons\n(\n1\nounce\n;\n30\ng\n) diced\nbell pepper\n, from\n1/2\nbell\npepper\n1/2\nScotch bonnet\nchile\n, stemmed, seeded, and minced\n2\ngarlic\ncloves\n, minced\n1\nsmall\ntomato\n(about\n2\nounces\n;\n56\ng\n), cored and diced\n1\nscallion\n(\n10\ng\n), thinly sliced\n2\ntablespoons\n(\n3\ng\n)\nfresh thyme leaves\nand tender stems, chopped\nOne\n18–20-\nounce\ncan\nackee\nKosher salt\nand freshly\nground black pepper\nSliced\navocado\n, for serving\nDirections\nRinse salt cod under cold running water until any salt on its surface is washed away. Transfer to a medium bowl and cover with fresh water. Soak at room temperature for 1 hour, or cover and refrigerate overnight. Drain salt cod, discard soaking water, transfer fish to a small saucepan, and cover with fresh water. Bring to a boil over medium-high heat, and cook until fish flakes easily when prodded with a fork, about 40 minutes. Taste, and if the cod is still too salty—it should have a similar salinity to bacon—drain and discard cooking water, return fish to saucepan, cover with a fresh change of water, and boil for an additional 20 minutes. Once the salt cod is cooked and seasoned to your liking, drain and flake fish into 1/2- to 1-inch pieces, discarding any bones and silvery membranes. Set aside.\nIn a 12-inch skillet, heat oil over medium heat until shimmering. Add onion, bell pepper, Scotch bonnet, and garlic and cook, stirring occasionally, until softened, about 5 minutes.\nAdd the flaked salt cod and cook, stirring occasionally, until fish is heated through, about 5 minutes.\nAdd tomato, scallion, and thyme, stir to combine, and cook until vegetables are tender and mixture is aromatic, about 5 minutes.\nAdd ackee, stir gently to incorporate, taking care not to over-mix which can cause the ackee to become mushy, and cook until ackee is heated through, about 3 minutes. Season with salt and pepper to taste, and serve immediately with sliced avocado alongside.\nSpecial Equipment\nSmall saucepan\n,\n12-inch skillet\nMake-Ahead and Storage\nAckee and saltfish is best served immediately. The salt cod can be soaked, cooked, flaked, and stored in an airtight container in the refrigerator for up to one week. Prepared salt cod can also be frozen in an airtight container and kept in the freezer for up to three months.\nRead More\nHow to Stock a Jamaican Kitchen\nJamaican Peas and Rice Recipe\nSalt Fish Fritters (Stamp and Go) Recipe\nJamaican Escovitch Fish Recipe\nJamaican Pickled Herring Recipe\nJamaican Pan Chicken Recipe\nJamaican\nFish\nCaribbean\nCod\nBreakfast & Brunch"
}