{
  "url": "https://www.seriouseats.com/acquacotta-maremmana-8781400",
  "image_url": "https://www.seriouseats.com/thmb/IaC_zHbaX89f18zHidoS0C6exQQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250128-Aquacotta-Maremmana-AmandaSuarez-hero-90a43a1ff5f04e70b02e98a5515bd299.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Italian",
    "Vegetarian"
  ],
  "title": "Aquacotta Maremmana (One-Pot Tuscan Vegetable Soup)",
  "full_text": "Aquacotta Maremmana (One-Pot Tuscan Vegetable Soup)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nTotal\n60 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, plus more for serving\n4\nmedium\nred\nor\nyellow onions\n(\n2\npounds\n;\n900\ng\n), thinly sliced\n5\nmedium cloves\ngarlic\n(\n25\ng\n), 4 cloves smashed and 1 left whole, divided\n3\nribs\ncelery\n(\n6\nounces\n;\n170\ng\n), thinly sliced crosswise on a bias\n1/2\nteaspoon\nred pepper flakes\nor more if desired\nKosher salt\n1\nquart\n(\n1\nL\n) hot\nvegetable broth\nor\nwater\n, plus more if needed\nOne\n28-ounce\n(\n794\ng\n)\ncan whole peeled tomatoes\nin their juices\n2\nmedium sprigs\nfresh basil\n6\nto\n8\nlarge\neggs\nToasted slices of\nrustic bread\n(or stale bread), for serving\nGrated\nParmigiano-Reggiano\n, for serving\nFreshly\nground black pepper\nDirections\nIn a large sauté pan or braiser, heat olive oil over medium-high heat until shimmering. Add onion, smashed garlic, celery, and red pepper flakes along with a large pinch of salt and cook, stirring often, until softened and just beginning to brown, about 8 minutes. Add broth or water in small additions (about 1/4 or 1/2 cup at a time) to moisten vegetables and prevent browning, and continue to cook, stirring often and adding more liquid only after it has cooked off and vegetables have begun to fry again, until vegetables are meltingly tender, about 25 minutes.\nSerious. Eats / Amanda Suarez\nAdd canned tomatoes and their juices, crushing them either by hand just before adding or in the pan using a potato masher, making sure to leave some tomato chunks remaining. Thin with additional broth or water as needed (roughly 1 cup) to make a chunky but brothy soup, add basil, and season lightly with salt. Simmer until flavors meld and soup thickens up again, about 15 minutes. Season once more with salt, if needed.\nSerious Eats / Amanda Suarez\nCrack eggs and gently slide into simmering soup. Season eggs lightly with salt, cover pan, and cook until whites are set and yolks are still runny, about 5 minutes. Discard basil sprigs.\nSerious Eats / Amanda Suarez\nMeanwhile, rub toasts with remaining clove of garlic, then arrange toasts in serving bowls. When eggs are ready, gently ladle soup and eggs (it will be thick and chunky, more stew than soup) onto toasts. Garnish with a drizzle of olive oil, grated cheese, and freshly ground black pepper. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nlarge sauté pan or braiser\nMake Ahead and Storage\nSoup can be prepared through step 2, cooled, and stored in an airtight container in the refrigerator for up to 3 days. Reheat gently and proceed with the recipe at step 3.\nLeftovers do not store or reheat well, but in a pinch, they can be safely stored in an airtight container in the refrigerator for up to 3 days and gently reheated on the stovetop or in the microwave.\nSoups\nThe Latest\nItalian\nVegetarian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/aquacotta-maremmana-one-pot-tuscan-vegetable-soup.webp?"
}