{
  "url": "https://www.seriouseats.com/adobo-marinated-grilled-pork-chops-recipe",
  "image_url": null,
  "tags": [
    "Pork Chop",
    "Filipino",
    "Gluten-free Mains",
    "Grilled Pork",
    "Pork Mains"
  ],
  "title": "Adobo-Marinated Grilled Pork Chops Recipe",
  "full_text": "Adobo-Marinated Grilled Pork Chops Recipe\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n60 mins\nMarinating Time\n8 hrs\nTotal\n8 hrs 45 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n120\nml\n)\ncane vinegar\n, preferably Datu Puti brand\n1/3\ncup\n(\n80\nml\n)\nsoy sauce\n1/2\ncup\n(\n120\nml\n)\nwater\n3\nmedium cloves\ngarlic\n, crushed\n1/2\nteaspoon\nwhole black peppercorns\n1\nbay leaf\nTwo\n(\n12-ounce\n;\n334 g\n)\nbone-in pork chops\n, about 1 1/2 inches thick\nWarm\ncooked sticky rice\n, for serving (see note)\nDirections\nIn a medium saucepan, combine vinegar, soy sauce, water, garlic, peppercorns, and bay leaf and bring to a boil. Let marinade cool to room temperature.\nPlace pork chops in a heavy-duty zipper-lock bag and pour marinade on top. Seal, pressing out air from bag, and refrigerate at least 8 and up to 24 hours.\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate.\nGrill pork chops over direct heat, turning occasionally, until well browned outside and 135°F (57°C) in the center for medium, about 10 minutes. If pork chops threaten to burn before they're done in the center, move them to cooler side of grill to finish cooking. Let rest 5 minutes before serving with sticky rice.\nSpecial equipment\nGrill\n,\ninstant-read thermometer\nNotes\nIf you feel ambitious, you can make a batch of sticky rice a day ahead, chill it in the refrigerator, then form it into large, handball-sized balls when you're ready to cook the pork chops. Brush the rice balls with the marinade, then grill them, turning, until browned all over; brush occasionally with more marinade as they cook.\nThis Recipe Appears In\nGrilling With Vinegar: Filipino-Style Adobo-Marinated Pork Chops\nPork Chop\nFilipino\nGluten-free Mains\nGrilled Pork\nPork Mains"
}