{
  "url": "https://www.seriouseats.com/agghiotta-di-pesce-spada-sicilian-braised-swordfish-with-tomatoes-and-olives-5212333",
  "image_url": "https://www.seriouseats.com/thmb/OubkniTZwD8m6R3AYcxmjK9mNM0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-braised-swordfish-steaks-vicky-wasik-16-7be76a6ea0d041a6a11b724df64fc96b.jpg",
  "tags": [
    "Ingredients",
    "Italian",
    "Seafood Guides",
    "The Latest"
  ],
  "title": "Agghiotta di Pesce Spada (Sicilian Braised Swordfish With Tomatoes and Olives)",
  "full_text": "Agghiotta di Pesce Spada (Sicilian Braised Swordfish With Tomatoes and Olives)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nTotal\n30 mins\nServes\n4 Servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n910\ng\n)\nswordfish steaks\n, 1 to 1 1/2 inches thick, divided into\nfour\n8-ounce (225 g) portions\n1/4\ntsp\nsalt and freshly ground black pepper\nAll-purpose flour\n, for dredging (about\n1/2\ncup\n)\n5\ntablespoons\n(\n75\nml\n)\nextra virgin olive oil\n1\nmedium\n(\n8\n-\nounce\n;\n225\ng\n)\nred onion\n, diced\n1 1/2\npounds\n(\n680\ng\n)\nsmall tomatoes\n, quartered, or\none\n28-ounce can\nwhole peeled tomatoes with juices\n, tomatoes roughly chopped (see note)\n2\ntablespoons\n(\n3/4\nounce\n,\n21\ng\n)\nsalted capers\n, rinsed of excess salt (see note)\n1/2\ncup\n(\n2\nounces\n;\n57\ng\n) pitted mild\ngreen olives\n, such as Castelvetrano, halved lengthwise\n2\ntablespoons\n(\n1\nounce\n;\n28\ng\n)\npine nuts\n, toasted (see note)\n2\ntablespoons\n(\n1/4\nounce\n;\n8\ng\n) minced\nflat-leaf parsley\nleaves and tender stems\nRed wine vinegar\nand/or\ngranulated sugar\n, to taste (optional)\nDirections\nSeason swordfish all over with salt and pepper. Spread flour on a plate in an even layer. Working one piece at a time, dredge swordfish steaks all over, shake off excess flour, then transfer to a platter.\nSerious Eats / Vicky Wasik\nIn a large 12-inch stainless-steel skillet or saute pan, heat 2 tablespoons (30ml) oil over medium-high heat until shimmering. Working in batches if necessary, add swordfish steaks and cook until well browned on first side, about 5 minutes. Flip swordfish steaks and cook until an instant-read thermometer inserted in the center registers 130°F (54°C) for medium, 135°F (57°C) for medium-well, or 140 to 145°F (60 to 63°C) for well-done, about 2 minutes (the timing will depend on the thickness of the swordfish steaks; note that it's important to get good color on at least one side, hence the longer cooking time on the first side). Return swordfish to the platter.\nSerious Eats / Vicky Wasik\nWipe out skillet and return to medium-high heat. Add remaining 3 tablespoons (45ml) oil to the skillet along with the onion. Cook, stirring and scraping the bottom of the pan, until onion has softened but not browned, about 4 minutes. Add tomatoes, capers, and olives and cook, stirring, until tomatoes have broken down and their liquid has thickened, about 5 minutes. Season with salt. If desired, add 1 or 2 teaspoons red wine vinegar and a pinch or two of sugar to balance the sauce's flavor; whether or not you decide to do this will depend on the flavor of the tomatoes you're using, and how far into agrodolce (\"sweet-sour\") territory you want to push the sauce.\nSerious Eats / Vicky Wasik\nReduce heat to medium. Stir in pine nuts and parsley, then return swordfish to the pan, nestling it into the sauce and cook until warmed through. Serve hot, warm, room temperature, or chilled.\nSerious Eats / Vicky Wasik\nNotes\nWe recommend fresh tomatoes for this dish, if you can find decently ripe ones. If not, canned tomatoes work well as a substitute.\nSalted capers should be washed free of any salt clinging to them and then soaked for at least 15 and up to 30 minutes in ample fresh water before draining and using.\nTo toast pine nuts, place on a microwave-safe plate and microwave at 1-minute intervals, stirring in between, until golden brown and toasty, about 3 minutes total. Alternatively, toast by tossing the nuts over medium-low heat in a dry skillet, stirring constantly, until toasted, about 5 minutes total.\nMake-Ahead\nThis recipe can be prepared up to 1 day in advance and kept refrigerated in an airtight container; it's delicious chilled or at room temperature. Longer storage can lead to a decline in the quality of the swordfish's texture, even if it's technically still safe to eat, so we don't recommend it.\nIngredients\nItalian\nSeafood Guides\nThe Latest"
}