{
  "url": "https://www.seriouseats.com/air-fryer-chicken-breasts-recipe-8653599",
  "image_url": "https://www.seriouseats.com/thmb/BDQ4Kg8Q-ErrQrnnou1UnCTtEk4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240520-SEA-SeriousEats_PerfectAirFryerChickenBreasts_Glaze_Beauty_3x4_088-78cc6f22185d4fbb86c393a5af5795a2.jpg",
  "tags": [
    "Chicken Breast",
    "The Latest",
    "Chicken",
    "Air Fryer Recipes"
  ],
  "title": "Air-Fryer Chicken Breasts",
  "full_text": "Air-Fryer Chicken Breasts\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nBrining Time\n4 hrs\nTotal\n4 hrs 35 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nbone-in, skin-on\nchicken breasts\n(\n900\ng\n), trimmed of excess fat (see notes)\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nbaking powder\n1 1/2\nteaspoons\nextra virgin olive oil\nFreshly\nground black pepper\nDirections\nBrine Chicken:\nPlace chicken breasts on a wire rack set in a rimmed baking sheet. Using paper towels, pat chicken dry. Rub chicken all over with salt and baking powder. Refrigerate skin-side up, uncovered, for at least 4 and up to 24 hours.\nSerious Eats / Morgan Hunt Glaze\nPreheat a 6-quart air fryer to 370°F (190ºC) for 3 minutes. Rub chicken all over with olive oil, black pepper, and desired seasoning, if using (see below for variations).\nSerious Eats / Morgan Hunt Glaze\nPlace chicken in preheated basket, skin-side down, and cook until chicken has reached an internal temperature of 110°F (43ºC), about 15 minutes. Using tongs, flip chicken skin-side up, and continue cooking at 370°F until chicken skin is golden-brown and crackly and internal temperature is 155°F (68ºC), 15 to 20 minutes. Transfer from air fryer to a cutting board and let rest about 10 minutes before slicing and serving. (Temperature of chicken will continue to rise to 165°F.)\nSerious Eats / Morgan Hunt Glaze\nVariations\nLemon-Pepper\n: In a small bowl, whisk together 1 1/2 teaspoons finely grated lemon zest (from 1 large lemon), 1 teaspoon coarsely ground black pepper, 1/2 teaspoon garlic powder, 1/4 teaspoon onion powder until combined. Rub all over chicken before cooking.\nMiso-Ginger\n: In a small bowl, whisk together 4 teaspoons white miso paste, 4 teaspoons freshly grated ginger, and 1 tablespoon finely grated garlic until combined. Rub all over chicken before cooking.\nDijon-Thyme\n: In a small bowl, whisk together 4 teaspoons Dijon mustard, 2 teaspoons minced fresh thyme, and 1/2 teaspoon finely grated lemon zest until well-combined. Rub all over chicken before cooking.\nZa’atar-Mint\n: In a small bowl, whisk together 2 tablespoons za’atar (\nhomemade\nor store-bought), 4 teaspoons minced fresh mint, 1 teaspoon granulated garlic, and 2 tablespoons (30ml) extra-virgin olive oil until well-combined. Rub all over chicken before cooking.\nChipotle-Lime:\nIn a small bowl, whisk together 4 teaspoons chipotle chile powder, 2 teaspoons finely grated lime zest (from 2 limes), 2 teaspoons light brown sugar, and 1 teaspoon ground cumin until well-combined.  Rub all over chicken before cooking.\nNotes\nChicken breast sizes vary. Depending on what's available where you are shopping, you may end up two to four pieces. The recipe will work as long as you have about two pounds total, although cooking times might change (larger breasts will take longer to cook through than smaller ones).\nSpecial Equipment\nWire rack\n,\nrimmed baking sheet\n,\n6-quart air fryer\n,\ninstant-read thermometer\n,\ntongs\nMake-Ahead and Storage\nChicken breasts can be refrigerated in an airtight container for up to four days.\nChicken Breast\nThe Latest\nChicken\nAir Fryer Recipes"
}