{
  "url": "https://www.seriouseats.com/air-fryer-pork-chops-recipe-8653723",
  "image_url": "https://www.seriouseats.com/thmb/S0Thdvq6l9w1Ll892E1M2aEDtBY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240524-SEA-Serious-Eats-AirFryerPorkChops-Causey-hero-01-3051-b7090f2b71dc43289010f10563978a6d.jpg",
  "tags": [
    "Pork Chop",
    "The Latest",
    "Pork",
    "Air Fryer Recipes"
  ],
  "title": "Air-Fryer Pork Chops",
  "full_text": "Air-Fryer Pork Chops\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nBrining and Resting Time\n70 mins\nTotal\n105 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\ndark brown sugar\n1\nteaspoon\nground mustard\n1\nteaspoon\nsmoked paprika\n1/2\nteaspoon\nground black pepper\n2\nthick-cut (about 1 1/2 -inch) bone-in\npork chops\n(about\n15 ounces; 425 g\neach)\n2\ntablespoons\n(\n30\nm\nl)\nextra-virgin olive oil\n2\ntablespoons\nteriyaki sauce\n,\nhomemade\nor store-bought (such as Bachan’s Original Japanese Barbecue Sauce)\n2\nteaspoons\nthinly sliced\nchives\n(optional)\nSmoked flaky\nsea salt\n(optional)\nDirections\nSet a wire rack inside a rimmed baking sheet. In a small bowl, stir together kosher salt, brown sugar, ground mustard, paprika, and black pepper. Place pork chops on a wire rack and, using paper towels, pat dry. Season both sides evenly with the salt mixture. Refrigerate, uncovered, for at least 1 and up to 24 hours.\nSerious Eats / Jen Causey\nPreheat a 6-quart air fryer to 230°F (110ºC). If needed, pat pork chops dry with paper towels. Brush both sides evenly with olive oil. Place in air fryer basket and cook, flipping halfway through, until an instant-read thermometer registers 110°F (43ºC) for medium, 15 to 18 minutes. Remove pork chops from air fryer and place on a plate (pork will not be cooked through).\nSerious Eats / Jen Causey\nPlace an air fryer trivet in basket of air fryer and preheat to 400°F (205ºC) for 3 minutes. Brush one side and edges of the pork chops with half of the teriyaki sauce. Place pork chops, sauced-side down, on trivet in air fryer. Brush top side and edges of pork chops with remaining teriyaki sauce. Cook, without flipping, until sauce has caramelized and pork chops are nicely browned and register 130ºF (54ºC) for medium, about 7 minutes. Remove pork chops to serving plates and let rest for 10 minutes before serving. Garnish with chives and smoked flaky salt, if desired, and serve.\nSerious Eats / Jen Causey\nSpecial Equipment\nWire rack, rimmed baking sheet, 6-quart air fryer, air fryer trivet, pastry brush, instant read thermometer\nMake-Ahead and Storage\nPork chops can be dry brined up to 24 hours in advance.\nCooked pork chops can be stored in an airtight container for up to 1 day and reheated in the air fryer or microwave until warmed through.\nPork Chop\nThe Latest\nPork\nAir Fryer Recipes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/air-fryer-pork-chops.webp?"
}