{
  "url": "https://www.seriouseats.com/air-fryer-green-beans-recipe-8666794",
  "image_url": "https://www.seriouseats.com/thmb/JMOIV_Cc3sgyyxm1fxMFy8PDUJg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240620SEA-AirfryerGreenbeans-MorganHuntGlaze-00-874059cb79084987a3edb6cf517ddd6d.jpg",
  "tags": [
    "Air Fryer Recipes",
    "The Latest",
    "Vegetarian Sides",
    "Vegetable Sides",
    "Green Beans"
  ],
  "title": "Air-Fryer Green Beans",
  "full_text": "Air-Fryer Green Beans\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nTotal\n15 mins\nServes\n4 Servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nfresh green beans\n, trimmed (\n4\ncups\n;\n454\ng\n)\n2\ntablespoons\n(\n30\nml\n)\nextra virgin olive oil\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nfreshly ground black pepper\nDirections\nPreheat a 6-quart air fryer to 400°F (205ºC) for 5 minutes. Meanwhile, in a large bowl, toss green beans with oil, salt, and pepper to evenly coat. Pour green beans into preheated air-fryer basket and cook until they begin to brown, about 5 minutes.\nSerious Eats / Morgan Hunt Glaze\nRemove basket from air fryer and shake to toss green beans. Return basket to air fryer and continue to cook until crisp-tender and charred in spots, about 2 more minutes. Transfer green beans to a serving platter or individual plates and serve.\nSerious Eats / Morgan Hunt Glaze\nVariations\nLemon-Parmesan:\nToss air fried green beans with 1 teaspoon fresh lemon zest and top with 1 tablespoon grated Parmigiano-Reggiano. Serve with lemon wedges.\nRed Curry-Cashew:\nIn a large microwave-safe bowl, microwave 1 tablespoon ghee and 1 teaspoon Thai red curry powder on medium-high heat (70% power) until melted, hot, and fragrant, 30 to 60 seconds. Toss the raw green beans with the curry-ghee mixture before transferring to the preheated air fryer basket. Air fry as directed. Top with 2 tablespoons (10 g) chopped roasted, salted cashews.\nGruyère-Fried Shallot:\nIn a small nonstick skillet, sprinkle 1 ounce (28g) shredded cave-aged Gruyère evenly and cook over low heat, undisturbed, until golden brown and starting to crisp, about 8 minutes. Transfer to a cutting board and let sit for 1 minute. Chop and sprinkle over air fried green beans. Top with 2 teaspoons fried shallots.\nKewpie-Furikake:\nToss cooked green beans with 1 tablespoon Kewpie or other store-bought or\nhomemade Japanese-style mayonnaise\nand sprinkle with 1 teaspoon furikake before serving.\nSpecial Equipment\n6-quart air fryer\nMake Ahead and Storage\nCooked green beans can be stored in an airtight container in the refrigerator for up to four days.\nAir Fryer Recipes\nThe Latest\nVegetarian Sides\nVegetable Sides\nGreen Beans"
}