{
  "url": "https://www.seriouseats.com/air-fryer-baked-potato-recipe-8622160",
  "image_url": null,
  "tags": [
    "Russet Potatoes",
    "The Latest",
    "Vegetable Sides",
    "Potatoes",
    "Air Fryer Recipes"
  ],
  "title": "Air-Fryer Baked Potato",
  "full_text": "Air-Fryer Baked Potato\nJump to recipe\nCook\n40 mins\nTotal\n40 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\nTwo\n8-ounce (227g)\nrusset potatoes\n, unpeeled\nCanola\n,\nvegetable\n, or\nolive oil\n, for rubbing\nKosher salt\nFreshly ground black pepper\n4\ntablespoons\n(57\ng\n)\nbutter\n, softened\nToppings of your choice, such as grated\ncheddar cheese\n, crispy diced\nbacon\nbits, minced\nchives\n, sliced\nscallions\n, and/or\nsour cream\nDirections\nUsing a fork or paring knife, lightly prick each potato all over several times. Rub each potato with oil. Sprinkle evenly with salt and pepper.\nSerious Eats / Jen Causey\nPlace potatoes in air fryer basket, spaced evenly apart. Place basket in air fryer and cook at 400°F (205°C) until the potato skin is crispy and a paring knife inserted into the center of the potatoes meets little to no resistance, about 45 minutes. (Center of potatoes should register between 205 to 210°F [96 to 99°C] with an instant-read thermometer.)\nSerious Eats / Jen Causey\nTransfer potatoes to a plate and let rest for 5 minutes. Slice each open lengthwise and scoop flesh into a mixing bowl. Add butter, season with salt and pepper, and roughly mash, just until butter is incorporated but potatoes are still chunky.\nSerious Eats / Jen Causey\nScoop mashed potatoes back into skins. (You can refill each skin, making 2 potatoes, or use all the mashed potato to refill only one skin, making 1 overstuffed potato.) Using your hands, reshape each stuffed potato back into a classic baked potato shape.\nAdd toppings of your choice. To melt cheese, add it first, then return potatoes to the air fryer set at  400°F oven until cheese melts, about 30 seconds to 1 minute; alternatively, use a torch to melt cheese. Serve right away.\nSpecial Equipment\nAir fryer\nRusset Potatoes\nThe Latest\nVegetable Sides\nPotatoes\nAir Fryer Recipes"
}