{
  "url": "https://www.seriouseats.com/air-fryer-southern-fried-chicken-recipe-8657913",
  "image_url": "https://www.seriouseats.com/thmb/rW8rE9g_0PbdZPLzqMczvQ0MfLk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240520Serious-Eats-AirFryerSouthernFriedChicken-Causey-HERO-dcd71aa2b7e145699e2559abb20d76cf.jpg",
  "tags": [
    "Air Fryer Recipes",
    "The Latest",
    "Chicken",
    "Soul Food & Southern"
  ],
  "title": "Air-Fryer Southern Fried Chicken",
  "full_text": "Air-Fryer Southern Fried Chicken\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nBrining Time\n4 hrs\nTotal\n5 hrs 5 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n480\nml\n)\nwhole buttermilk\n2\nlarge\neggs\n1/4\ncup\n(\n60\nml\n)\ndill pickle brine\n, drained from\n1\njar\nof\npickles\n, plus pickle slices for serving\n2\ntablespoons\n(\n30\nml\n)\nLouisiana-style hot sauce\n(such as Crystal)\n2\ntablespoons\n(\n30\nml\n)\nhoney\n4\ntablespoons\n(\n36\ng\n) Diamond Crystal\nkosher salt\n, divided, plus more to taste; for table salt, use half as much by volume or same weight\n4\nsmall\nbone-in, skin-on chicken thighs\n(\n5 to 7\nounces\n;\n141 to 198\ng\neach)\n2\nmedium\nbone-in, skin-on chicken breast halves\n(about\n1\npound\n;\n454\ng\neach)\n1 1/2\ncups\nall purpose flour\n(\n6 3/4\nounces\n;\n192\ng\n)\n1\ncup\nwhite rice flour\n(about\n5 1/4\nounces\n;\n150\ng\n), see note\n1\ntablespoon\nonion powder\n1\ntablespoon\ngranulated garlic\n2\nteaspoons\nsmoked paprika\n1 1/2\nteaspoons\nbaking powder\n1\nteaspoon\nfreshly\nground black pepper\n2\ntablespoons\n(\n30\nml\n)\ncanola oil\n, divided\nCooking spray\nDirections\nIn a large bowl, whisk buttermilk, eggs, pickle brine, hot sauce, honey, and 3 tablespoons (27g) of the salt together until well-combined. Add chicken thighs and breasts and turn to coat. Cover and refrigerate for at least 4 hours and up to 12 hours. Remove chicken from refrigerator 30 minutes before cooking.\nSerious Eats / Jen Causey\nWhen ready to cook, line two baking sheets with wire racks. In a large bowl, whisk together all-purpose flour, rice flour, onion powder, granulated garlic, smoked paprika, baking powder, pepper, and remaining 1 tablespoon (9g) salt until well-combined.\nSerious Eats / Jen Causey\nPour about 1/4 cup (60ml) of the buttermilk marinade from bowl with chicken into flour mixture, using your hands or a flexible spatula, stir to form small clumps (most of flour should be dry).\nSerious Eats / Jen Causey\nWorking with one or two pieces at a time, remove chicken from marinade, allowing excess to drip back into the bowl, and pat excess marinade from chicken using paper towels. Place chicken into the bowl with flour mixture and turn, pressing to coat chicken evenly in flour mixture.\nSerious Eats / Jen Causey\nDrizzle more buttermilk mixture, 1 tablespoon at a time, over breaded chicken in bowl and turn once more so additional craggy bits of coating stick to chicken.\nSerious Eats / Jen Causey\nTransfer breaded chicken to one of the prepared baking sheets (leave one of the baking sheets empty for cooked chicken). Let chicken sit on wire rack for 15 minutes before cooking. Adjust oven rack to middle position and preheat oven to 225°F (110ºC). Using a fork or a sharp knife, pierce a piece of heavy duty aluminum foil large enough to wrap the basket of a 6-quart air fryer all over, then wrap the basket tightly with foil.\nSerious Eats / Jen Causey\nDrizzle 1 tablespoon of the canola oil over foil and set the prepared basket in the air fryer. Preheat air fryer to 380°F (195ºC) for 3 minutes. Once preheated, place 4 thighs or 2 breasts, skin-side down, in the air fryer. Spray all over with a generous amount of cooking spray until no dry flour is visible.\nSerious Eats / Jen Causey\nCook chicken until golden-brown and crispy on both sides, and an instant-read thermometer registers 170°F (77ºC) for chicken thighs and 155°F (68ºC) for chicken breasts, about 22 to 25 minutes for the chicken thighs and 30 minutes for the chicken breast, flipping and spraying the top side of the chicken with more cooking spray halfway through.\nTransfer the cooked chicken to the clean baking sheet and season to taste with salt. Place in oven to keep warm while preparing the remaining chicken. Brush now-empty foil-lined basket with remaining tablespoon of oil and repeat cooking with remaining chicken. (Let chicken rest 10 minutes.) Serve with your favorite sides.\nSerious Eats / Jen Causey\nSpecial Equipment\n2 rimmed baking sheets, 2 wire racks, 6-quart air fryer, instant-read thermometer\nNotes\nRice flours can vary widely in texture and consistency. We recommend Bob’s Red Mill white rice flour, which is readily available in grocery stores and online.\nMake-Ahead and Storage\nCooked chicken safely be refrigerated in an airtight container for up to four days, but it will lose its crunchiness.\nAir Fryer Recipes\nThe Latest\nChicken\nSoul Food & Southern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/air-fryer-southern-fried-chicken.webp?"
}