{
  "url": "https://www.seriouseats.com/air-fryer-doritos-recipe-8707817",
  "image_url": "https://www.seriouseats.com/thmb/w7fojkjsYFSBRObb7s8htivTIRE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240906-SEA-AirFryerDoritos-JackieAlpers-hero-4b872d81736a4751baff5e21c816ad98.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest"
  ],
  "title": "Air-Fryer Bake & Shake “Doritos”",
  "full_text": "Air-Fryer Bake & Shake “Doritos”\nClose\nJump to recipe\nPrep\n5 mins\nCook\n12 mins\nTotal\n17 mins\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Nacho Cheese “Doritos” Seasoning Mix:\n1/2\ncup\n(80g) cheddar\ncheese powder,\nsuch as\nHoosier Hill Farm Cheddar\n(see notes)\n1/4 cup (\n40\ng)\ntomato powder,\nsuch as\nBurlap & Barrel\n2 tablespoons (\n20\ng)\nbuttermilk powder\n2 tablespoons\n(20\ng)\ndried onion flakes\n2\ntablespoons\n(20g)\nDiamond Crystal kosher salt;\nfor table salt use half as much by volume\n1 tablespoon\n(10\ng)\ngarlic powder\n1 tablespoon\n(10\ng)\nsmoked paprika\n1\ntablespoon\n(10g) monosodium glutamate\n(MSG)\n1 tablespoon\n(10\ng)\ngranulated sugar\nFor the “Doritos”:\nSix\n6-inch\ncorn tortillas\nCooking\nspray\nor neutral\noil\nsuch as vegetable or canola oil for brushing the tortillas\n1/2\ncup\nnacho cheese “Doritos”\nseasoning mix\nfrom above\nDirections\nFor the Nacho Cheese Seasoning Mix:\nIn a bowl, add all of the ingredients and whisk to combine. Transfer 1/2 cup of the mix to a quart-size resealable bag; set aside. Reserve the remaining 1/2 cup seasoning mix in a separate airtight container for a later batch.\nSerious Eats / Jackie Alpers\nFor the “Doritos”:\nPreheat a 6-quart air fryer at 350°F for 3 minutes. Place 1 tortilla on cutting board and spray lightly with cooking spray or brush top lightly with oil. Flip tortilla over and spray the second side lightly with cooking spray or brush lightly with oil. Repeat brushing the remaining tortillas with oil, stacking the oiled tortillas together. Using a chef’s knife, quarter all of the tortillas.\nSerious Eats / Jackie Alpers\nSpread all of the cut chips into an even layer (some chips will overlap; this is OK) in the preheated air-fryer basket and cook, shaking the basket every few minutes, until chips are lightly browned and crispy, 12 to 14 minutes. The tortilla chips may start to flip around inside the air fryer and make a sound like corn popping when they are almost done.\nSerious Eats / Jackie Alpers\nUsing tongs, immediately add the warm chips to the bag with the prepared seasoning mix. Seal and vigorously shake the bag until the chips are thoroughly coated. Transfer chips to a serving bowl, gently shaking excess seasoning mix back into the bag, (Excess seasoning can be added to the remaining blend to reserve for later use.) Serve.\nSerious Eats / Jackie Alpers\nFlavor Variations\nCool Ranch Doritos Flavor:\nAdd one .4 ounce (11g) packet Hidden Valley Ranch Restaurant Style Dressing powder to the dried seasoning mix in step 1.\nTaco Doritos Flavor:\nAdd one 1-ounce (28g) packet Lawry’s Taco Spices and Seasoning Mix to the dried seasoning mix in step 1 and reduce the salt to 1 tablespoon (10g).\nSpecial Equipment\n6-quart air fryer\n,\nsilicone-coated tongs\n, quart-size resealable bags\nNotes\nYellow Cheddar Cheese Powder\nwas the closest match both visually and in flavor to Doritos. King Arthur Baking’s white cheese\nBetter Cheddar\nis also excellent.\nOf the four taco seasoning blends I tested,\nLawry’s Taco Seasoning Mix\ntasted the closest and had the most pronounced taco flavor overall. Of all the varieties of Hidden Valley Ranch powder available, The\nRestaurant Style Dressing Mix\nproduced the closest match to Cool Ranch Doritos.\nMake-Ahead and Storage\nThe seasoning mix is shelf stable and can be stored at room temperature in an airtight container for up to 1 month. The seasoning blend makes about 1 cup, which will make at least 2 batches of chips. Any excess powder left in the bag after shaking can be returned to the storage container.\nThe seasoned chips can be stored in an airtight container at room temperature for up to 2 days.\nSnacks & Appetizers\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/air-fryer-bake-shake-doritos.webp?"
}