{
  "url": "https://www.seriouseats.com/air-fryer-roast-potatoes-recipe-8612615",
  "image_url": "https://www.seriouseats.com/thmb/i6bj2oLPJygvIAXd0ORBGa7W4Kg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240320-SEA-AirfryerRoastedPotatoes-JenCausey-herocropped-f941f7b3f86c425ea3ef96a0810b74a3.jpg",
  "tags": [
    "Russet Potatoes",
    "The Latest",
    "Air Fryer Recipes"
  ],
  "title": "Air-Fryer Roast Potatoes",
  "full_text": "Air-Fryer Roast Potatoes\nClose\nJump to recipe\nPrep\n20 mins\nCook\n50 mins\nPreheating Time\n10 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n1\nkg\n)\nrusset potatoes\n1/4\nteaspoon\nbaking soda\n1\ntablespoon\nplus\n1 1/4\nteaspoon\nDiamond Crystal\nkosher salt\n, divided, plus more to taste; for table salt, use half as much by volume or the same amount by weight\n3\ntablespoon\ns (\n45\nml\n) extra-virgin\nolive oil\n,\nduck fat\n,\ngoose fat\n, or\nbeef fat\n2\nmedium\ncloves\n(\n10\ng\n)\ngarlic\n, finely chopped\n1 1/2\nteaspoons\nfinely chopped\nfresh rosemary\nor\nthyme\nleaves\n1/2\nteaspoon\nfreshly\nground black pepper\n, divided, plus more to taste\n2\ntablespoons\nfinely chopped fresh\nflat-leaf parsley\nDirections\nIn a large pot, bring 2 quarts (2L) water to a boil over high heat. Add potatoes, baking soda, and 1 tablespoon salt and stir to combine. Return to a boil, then reduce to a simmer over medium-low. Simmer, adjusting heat as needed, until a knife meets little resistance when inserted into a potato chunk, 8 to 10 minutes.\nSerious Eats / Amanda Suarez\nMeanwhile, in a small saucepan, cook garlic, oil or other fat, rosemary or thyme, and 1/4 teaspoon pepper over medium heat, stirring and shaking pan constantly, until garlic just begins to turn golden, about 3 minutes. Immediately strain oil through a fine mesh strainer set over a large bowl. Reserve the strained garlic and herb solids for later.\nSerious Eats / Jen Causey\nWhen potatoes are cooked; drain well. Place back into the pot and let rest off heat for about 30 seconds to allow excess moisture to evaporate. Transfer potatoes to the bowl with the reserved infused oil. Add remaining 1 1/4 teaspoons salt and 1/4 teaspoon pepper and toss while shaking bowl roughly, until a thick layer of mashed potato–like paste has built up on potato chunks and seasoning is evenly distributed, 15 to 20 seconds.\nSerious Eats / Jen Causey\nSet air fryer to  400°F (205℃) and preheat for 10 minutes. Add potatoes to basket in even layer, and cook until potatoes are golden brown and crisp all over, removing and shaking the basket a few times during cooking, 20 to 25 minutes.\nSerious Eats / Jen Causey\nTransfer potatoes to a large bowl and add parsley and reserved garlic-herb mixture. Toss to coat and season with additional salt and pepper to taste. Serve immediately.\nSerious Eats / Jen Causey\nSpecial Equipment\nAir fryer\nNotes\nThe potatoes will be cut into quarters, sixths, or eighths depending on their size.\nIf using Yukon gold potatoes, cook them for 1 to 2 minutes longer so they are softer when tossed, which helps create the starchy slurry so essential to the potatoes’ crispiness.\nRusset Potatoes\nThe Latest\nAir Fryer Recipes"
}