{
  "url": "https://www.seriouseats.com/ajiaco-colombian-chicken-and-potato-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-bNSGtLxPSHmwJHTYr5YdKs8Xxk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ajiaco-colombian-potato-soup-hero-24ae1887fec444b5870127bed64f6ce6.jpg",
  "tags": [
    "Soups",
    "Potatoes",
    "Colombian",
    "Stovetop Chicken",
    "Chicken Breast"
  ],
  "title": "Ajiaco (Colombian Chicken and Potato Soup) Recipe",
  "full_text": "Ajiaco (Colombian Chicken and Potato Soup) Recipe\nClose\nJump to recipe\nCook\n90 mins\nActive\n20 mins\nTotal\n90 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\nhomemade\nchicken stock\n(or\nlow-sodium\ncanned stock)\n1\nwhole bone-in, skin-on chicken breast\n, split (\n12 to 16\nounces\ntotal)\n1\nlarge\nonion\n, split in half\n2\nbay leaves\n2\npounds\nrusset potatoes\n(about\n2\nmedium\n) peeled and cut into rough 1-inch chunks\n2\npounds\npapas Criollas\n(about\n20\npotatoes\n), peeled (see note)\n1\npound\nRed Bliss potatoes\n(about\n2\nsmall\n), peeled, split into quarters lengthwise, and cut into 1/2-inch slices\n1/4\ncup\ndried guascas\n(see note)\n2\nears\ncorn\n, shucked and broken into 3 pieces each\n1\nsmall\nonion\n, finely diced (about\n3/4\ncup\n)\n2\ntablespoons\nchopped cilantro\n1\nserrano\nor\n1/2\njalapeño\n, seeded and finely minced\nKosher salt\nand freshly\ncracked black pepper\n1/2\ncup\nsour cream\n, thinned with 1 tablespoon milk\n1/2\ncup\ncapers\n, rinsed, drained, and roughly chopped\n1\nripe avocado\n, preferably smooth, light-green fuerte variety, sliced into wedges\nDirections\nCombine chicken stock, chicken breast, onion, bay leaves, potatoes, and guascas in a large saucepot or Dutch oven. Add more water if necessary to cover solids by 1-inch. Bring to a boil over high heat. Reduce to a simmer and cook until chicken breast is cooked through, about 10 minutes. Transfer chicken breast to plate and set aside until cooled to room temperature.\nSerious Eats / Mariel De La Cruz\nContinue to simmer potatoes until russets and papas Criollas are completely tender and falling apart, about 45 minutes longer, adding more water as necessary. Discard onion and bay leaves. Using whisk, mash potato pieces against side of pot and stir vigorously to thicken soup. The soup should be thick, with large chunks of potatoes still remaining.\nSerious Eats / Mariel De La Cruz\nAdd corn cobs and continue to cook, stirring occasionally, until corn is cooked and soup is thickened to the consistency of thick heavy cream, about 15 minutes longer. Remove from heat.\nSerious Eats / Mariel De La Cruz\nWhile soup is cooking, make the\naji\n: Combine onion, cilantro, and chile pepper in small serving bowl and add water until just covered. Season generously with salt and stir to combine. Set aside. Discard chicken skin and bones. Shred meat into bite-size pieces and set aside in serving bowl.\nSerious Eats / Mariel De La Cruz\nSeason soup to taste with salt and pepper. Serve immediately, passing picked chicken, chopped capers, sour cream, and aji table-side for diners to add to their bowl. Serve avocado slices on the side.\nNotes\nPapas Criollas are small, creamy yellow Colombian potatoes with a unique buttery flavor and texture. They can occasionally be found frozen in Latin markets. If unavailable, substitute small Yukon Golds or yellow fingerling potatoes, peeled and cut into 1-inch chunks.\nGuascas is a Colombian herb. It can be found in some Latin markets, or ordered online from\namigofoods\n. If unavailable, replace with an extra 2 bay leaves (remove along with other bay leaves in step 2), plus 2 tablespoons of fresh chopped parsley leaves.\nSoups\nPotatoes\nColombian\nStovetop Chicken\nChicken Breast",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ajiaco-colombian-chicken-and-potato-soup-recipe.webp?"
}