{
  "url": "https://www.seriouseats.com/ajitsuke-tamago-japanese-marinated-soft-boiled-egg-recipe",
  "image_url": null,
  "tags": [
    "Boiled Eggs",
    "Japanese",
    "Stovetop Eggs",
    "Ramen",
    "Sides"
  ],
  "title": "Ajitsuke Tamago (Marinated Soft-Boiled Eggs for Ramen)",
  "full_text": "Ajitsuke Tamago (Marinated Soft-Boiled Eggs for Ramen)\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n10 mins\nMarinating Time\n4 hrs\nTotal\n4 hrs 25 mins\nServes\n6 eggs\nMakes\n6 eggs\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n120\nml\n)\nwater\n1/2\ncup\n(\n120\nml\n)\nsake\n1/4\ncup\n(\n60\nml\n)\nsoy sauce\n1/4\ncup\n(\n60\nml\n)\nmirin\n1/4\ncup\nsugar\n(about\n1 3/4\nounces\n;\n50\ng\n)\n6\nlarge\neggs\nDirections\nIn a medium bowl, whisk together water, sake, soy, mirin, and sugar until sugar is dissolved. Set aside.\nSerious Eats / Mateja Zvirotic Andrijanic\nIn a medium saucepan, bring 2 quarts of water to a boil over high heat. Pierce the fat end of each egg with a thumbtack to make a tiny hole. (This prevents them from cracking and eliminates the air bubble at the end.) Using a spider or slotted spoon, carefully lower eggs into water. Reduce heat to maintain a bare simmer (about 190°F/88°C). Cook for exactly 6 minutes for a liquid egg yolk and 7 minutes for jammy egg yolk. Drain hot water and carefully peel eggs under cold running water. (The whites will be quite delicate.)\nSerious Eats / Mateja Zvirotic Andrijanic\nTransfer eggs to a bowl that just barely fits them all. Pour marinade on top until eggs are covered or just floating. Place a double layer of paper towels on top and press down until completely saturated in liquid to help keep eggs submerged and marinating evenly. Refrigerate and marinate at least 4 hours and up to 12 hours. Discard marinade. Store eggs in a sealed container in the fridge for up to 3 days. Reheat in ramen soup to serve.\nSerious Eats / Mateja Zvirotic Andrijanic\nSpecial Equipment\nSpider\nor\nslotted spoon\n,\n3-quart stainless steel saucier\n,\ndigital thermometer\nNotes\nIf you have made\nchashu pork belly\n, you can use the leftover chashu broth to marinate the eggs instead of the marinade described in this recipe.\nRead More\nThe Food Lab Redux: How to Make the Perfect Bowl of Tonkotsu Ramen\nBoiled Eggs\nJapanese\nStovetop Eggs\nRamen\nSides"
}