{
  "url": "https://www.seriouseats.com/alfajores-vanilla-shortbread-milk-toffee-caramel-recipe",
  "image_url": "https://www.seriouseats.com/thmb/wjdIgHzhSIqOcMhT9PnxDmOr7Ds=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__04__20160329-alfajores-cookies-vicky-wasik-12-f4a6ba68bfdc49f1b8b3015ff2e237c7.jpg",
  "tags": [
    "Cookies",
    "Central American",
    "Mexican",
    "South American",
    "Baking"
  ],
  "title": "Alfajores Con Cajeta (Vanilla Shortbread With Goat's-Milk Toffee) Recipe",
  "full_text": "Alfajores Con Cajeta (Vanilla Shortbread With Goat's-Milk Toffee) Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nActive\n25 mins\nTotal\n45 mins\nServes\n25 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nvanilla bean\n, preferably Mexican\n4\nounces\nall-purpose flour\n(\n3/4\ncup\nplus\n1\ntablespoon\n;\n115\ng\n)\n3\nounces\ntapioca starch\n(\n3/4\ncup\n;\n85\ng\n)\n2\nounces\npowdered sugar\n(\n1/2\ncup\n;\n55\ng\n), plus more for dusting\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n1/4\nteaspoon\n(\n1\ng\n)\nbaking powder\n4\nounces\ncold\nunsalted butter\n(\n1\nstick\n;\n115\ng\n), cut into 1/4-inch pieces\n2\nlarge\negg yolks\n, cold\n1\nrecipe\ncajeta casera\n(see notes)\nDirections\nSplit vanilla bean lengthwise with a paring knife and scrape out seeds with the flat of the blade; reserve empty pod for cajeta or another use. Combine vanilla seeds with flour, tapioca starch, powdered sugar, salt, baking powder, and butter in the bowl of a food processor. Pulse to form a fine and sandy meal, then add egg yolks and continue processing until the dough balls up around the blade. Divide in half and proceed to step 2, or wrap tightly in plastic and refrigerate up to 1 week.\nSerious Eats / Vicky Wasik\nAdjust oven rack to middle position and preheat to 350°F (180°C). Turn a portion of dough onto a powdered sugar–dusted surface and dust more powdered sugar on top. Roll dough until roughly 6 inches across, then dust with powdered sugar, flip upside down, and dust again. Continue rolling until dough is just shy of 1/4 inch thick. Slide a thin offset spatula under dough to loosen any places that might have stuck and cut dough into 2-inch rounds. Arrange cutouts on a parchment-lined aluminum half-sheet pan, leaving about 1/2 inch between cookies. Gather the scraps, briefly knead, and re-roll and cut as before. Repeat with remaining dough, for a total of 50 pieces. Bake until just beginning to brown around the edges, about 15 minutes, and cool to room temperature directly on sheet pan.\nSerious Eats / Vicky Wasik\nTransfer cajeta to a pastry bag fitted with a plain 1/4-inch tip. Flip half the cookies bottom side up and pipe a generous dollop of cajeta into the very center, up to 1/2 ounce (4 teaspoons; 14g), or less if you prefer. Alternatively, this can be done with a spoon. Top with remaining wafers and press gently to secure. Dust with powdered sugar and serve. In an airtight container, alfajores will keep 24 hours at room temperature or up to 1 week in the fridge.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n,\nrolling pin\n,\n2-inch cookie cutter\n,\noffset spatula\n,\naluminum half-sheet pan\nNotes\nCajeta can be prepared and refrigerated up to a month in advance. Not only does that make alfajores a breeze to bake and assemble, it ensures that the cajeta has a chance to thicken and cool.\nRead More\nCajeta Casera (Homemade Goat's Milk \"Caramel\")\nAlfajores de Chocolate (Argentine Chocolate-Dulce de Leche Sandwich Cookies)\nLemon Meltaways\nCrispy Lemon-Ginger Sandwich Cookies\nEL Fudge-Style Chocolate and Vanilla Sandwich Cookies\nCookies\nCentral American\nMexican\nSouth American\nBaking"
}