{
  "url": "https://www.seriouseats.com/all-american-eggplant-parmesan-recipe",
  "image_url": "https://www.seriouseats.com/thmb/gjqTQ2c32TWGtNmii5XwGFyBHKA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-QiAi-all-american-eggplant-parmesan-recipe-hero-75b076af64244afc9466aa89ed0ee8f6.jpg",
  "tags": [
    "Italian-American",
    "Vegetarian Mains",
    "Savory",
    "Mozzarella",
    "Parmesan"
  ],
  "title": "All-American Eggplant Parmesan",
  "full_text": "All-American Eggplant Parmesan\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs 20 mins\nActive\n90 mins\nTotal\n2 hrs 40 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\nItalian\neggplant\n(about\n3 or 4\nmedium\n), sliced into 1/2-inch slices lengthwise\nKosher salt\n2\n(28-ounce) cans\nwhole peeled tomatoes packed in juice\n1/4\ncup\nextra-virgin olive oil\n2\ntablespoons\nbutter\n6\ncloves\ngarlic\n, grated on a microplane grater\n4\nteaspoons\ndried oregano\n1/2\nteaspoon\nred pepper flakes\n1\nlarge\nonion\n, peeled and split in half\n1/4\ncup minced\nfresh parsley\nleaves\n1/4\ncup minced\nfresh basil\n1 1/2\ncups\nall-purpose flour\n3\neggs\n, thoroughly beaten\n6\nounces\npanko-style bread crumbs\n4\nounces\nfinely\ngrated parmesan\n(about\n2\ncups\n)\n1 1/2\ncups\nvegetable oil\n1\npound\ngrated whole milk mozzarella\n(about\n4\ncups\n)\nDirections\nSeason eggplant slices lightly on both sides with salt. Place a double layer of paper towels or clean kitchen towel on a large plate and lay a single layer of eggplant slices on top. Top with 2 more layers paper towels or clean kitchen towel. Top with second large plate and place another layer of paper towels and eggplant on top. Top with third large plate. Microwave on high power until eggplant is easily compressed, about 3 minutes (be careful, plates will be hot). To prepare eggplant in oven, see notes.\nSerious Eats / Qi Ai\nWorking one piece of eggplant at a time, press firmly between paper towels until compressed. Set aside on a large tray. Repeat microwaving and pressing steps until all eggplant slices are compressed.\nSerious Eats / Qi Ai\nPurée tomatoes and their juice in a food mill, blender, or food processor until no pieces larger than 1/16th of an inch remain. Heat olive oil and butter in a large saucepan over medium-high heat until butter is melted. Add garlic, 2 teaspoons oregano, and pepper flakes and cook, stirring constantly until fragrant, about 2 minutes. Add tomatoes, onion, half of parsley, and half of basil, bring to a simmer, turn heat to low, and cook until reduced by half, about 1 hour. Stir in parsley and basil and season to taste with salt. Remove onion and discard. Set aside.\nSerious Eats / Qi Ai\nPlace flour in one wide mixing bowl, eggs and 1 teaspoon salt in second wide mixing bowl, and breadcrumbs, remaining 2 teaspoons oregano, and 1/4 cup parmesan in third bowl. Working with one slice at a time, dredge eggplant in flour, dip in egg, and coat in seasoned bread crumbs. Transfer breaded eggplant to a rimmed baking sheet.\nSerious Eats / Qi Ai\nPreheat oven to 375°F (190°C) and adjust oven rack to center position. Line clean rimmed baking sheet with double layer of paper towels. In a 12-inch nonstick or cast iron skillet, heat oil to 375°F. Carefully slide 3-4 eggplant slices into hot oil in a single layer. Cook, shaking pan occasionally until first side is golden brown and crisp, about 2 1/2 minutes. Using tongs, carefully flip eggplant and continue cooking, stirring occasionally until second side is crisp, about 1 1/2 minutes longer. Transfer slices to paper-towel lined baking sheet and season immediately with salt. Repeat with remaining eggplant slices.\nSerious Eats / Qi Ai\nIn a 9- by 13-inch glass baking dish, spread 1/4 of tomato sauce over bottom. Add 1/3 of eggplant slices in single layer (they may overlap a little bit). Press down to form even layer. Add 1/4 of tomato sauce and spread evenly. Evenly spread 1/3 of mozzarella and 1/3 of remaining parmesan over sauce. Repeat with 2 more layers each of eggplant, sauce, and cheese, reserving 1/4 cup of parmesan at the end.\nSerious Eats / Qi Ai\nCover with foil and bake for 20 minutes. Remove foil and bake until light golden brown and bubbly on surface, about 20 minutes longer. Sprinkle with remaining 1/4 cup parmesan and serve immediately.\nSerious Eats / Qi Ai\nSpecial Equipment\nLarge\nnonstick\nor\ncast iron skillet\n, 9- by 13-inch\nbaking dish\n, microwave (optional)\nNotes\nTo purge eggplant without using microwave, preheat the oven to 375°F (190°C). Line a rimmed baking sheet with a double layer of paper towels. Shingle the eggplant slices on top of the towels and top with another double layer of paper towels. Place a second rimmed baking sheet on top. Bake until eggplant slices are easily compressed, about 30 minutes. Remove from oven. Working one slice at a time, press between paper towels until compressed. Continue with step 3.\nRead More\nMelanzane alla Parmigiana (Italian-Style Eggplant Parmesan)\nItalian-American\nVegetarian Mains\nSavory\nMozzarella\nParmesan",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/all-american-eggplant-parmesan.webp?"
}