{
  "url": "https://www.seriouseats.com/almond-anise-biscotti-cookies",
  "image_url": "https://www.seriouseats.com/thmb/dfTWog-gqvp0p3PIEt2iD681vg0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__12__20181127-biscotti-vicky-wasik-32-3e7fc1367d414080bf051e907fb9c81b.jpg",
  "tags": [
    "Cookies",
    "Italian",
    "Almonds",
    "Christmas Cookies"
  ],
  "title": "Almond Biscotti With Anise Recipe",
  "full_text": "Almond Biscotti With Anise Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nActive\nAbout 15 mins\nCooling Time\n10 mins\nTotal\n75 mins\nServes\n25 servings\nCook Mode\n(Keep screen awake)\nIngredients\n10\nounces\nall-purpose flou\nr (about\n2 1/4\ncups\n, spooned;\n285\ng\n), plus more for dusting\n8 3/4\nounces\nsugar\n(about\n1 1/4\ncups\n;\n245\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1 1/4\nteaspoons\nbaking powder\n5 1/4\nounces\nwhole almonds\n, toasted and roughly chopped (about\n1\nheaping cup\n;\n150\ng\n)\n2 1/4\nteaspoons\nwhole anise seeds\n, roughly chopped\n3\nlarge\neggs\n, straight from the fridge (about\n5 1/4\nounces\n;\n150\ng\n)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\nDirections\nAdjust oven rack to lower-middle position and preheat oven to 350°F (180°C). In the bowl of a stand mixer fitted with a paddle attachment, combine flour, sugar, salt, baking powder, chopped toasted almonds, and chopped anise seeds. Mix on low until homogeneous, then add eggs and vanilla; continue to mix just long enough to form a soft dough.\nSerious Eats / Vicky Wasik\nTransfer dough to a lightly floured surface. Knead lightly to bring dough together into a ball, then shape into a roughly 8-inch log. Transfer dough log to a parchment-lined half-sheet pan and continue rolling the log by hand until it is approximately 16 inches long. Gently flatten dough by hand until log is about 4 inches wide and just over 1/2 inch thick (see notes).\nSerious Eats / Vicky Wasik\nBake dough until puffed and firm to the touch and just beginning to brown around the very edges (though still pale overall), about 25 minutes. Cool directly on baking sheet for about 5 minutes, then transfer to a cutting board and let cool 5 minutes more. While dough is still warm, use a long, thin, and very sharp serrated knife to cut log at a slight angle into about 25 pieces, each just over 1/2 inch wide (see notes).\nSerious Eats / Vicky Wasik\nArrange biscotti, cut sides up, on a parchment-lined baking sheet and continue baking until dry to the touch and lightly browned, about 12 minutes. Flip biscotti over and continue baking for another 12 minutes. It's normal for the timing to vary according to the biscotti's size and thickness, as well as differences in oven temperature and airflow, so keep a close eye on them and adjust the bake time as needed.\nSerious Eats / Vicky Wasik\nCool biscotti to room temperature before serving. If desired, dip in\ntempered chocolate\n(be sure to brush crumbs from each piece before dipping). With or without chocolate, the biscotti will keep for about 3 months in an airtight container at cool room temperature.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nhalf-sheet pan\n, pastry brush,\nserrated knife\nNotes\nThe biscotti dough can be shaped to any length, width, and thickness, then cut to any size, but these details will affect the yield and suggested baking times of this recipe. If you're experimenting with other shapes and sizes, follow the visual and textural cues given here, rather than the specific timetables.\nMake-Ahead and Storage\nIn an airtight container, the biscotti will keep for about three months at cool room temperature.\nRead More\nThe Best Way to Temper Chocolate\nLemon Pine Nut Biscotti\nOlive Oil Pistachio Biscotti\nCranberry Almond Biscotti\nCornmeal Cherry Biscotti\nCookies\nItalian\nAlmonds\nChristmas Cookies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/almond-biscotti-with-anise-recipe.webp?"
}