{
  "url": "https://www.seriouseats.com/almond-olive-oil-cake-recipe-torta-di-mandorla-italian-desserts",
  "image_url": "https://www.seriouseats.com/thmb/SQPOjdRSGxJOsd625Wsw9vNF-7w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090209-cake2-928ee2b0e1624a149fa5750ed776eb10.jpg",
  "tags": [
    "Cakes",
    "Italian",
    "Baking",
    "Almonds"
  ],
  "title": "Almond Olive Oil Cake for Valentine's Day Recipe | Seriously Italian",
  "full_text": "Almond Olive Oil Cake for Valentine's Day Recipe | Seriously Italian\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nCooling Time\n60 mins\nTotal\n2 hrs 5 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nall-purpose flour\n1/2\ncup\nblanched or natural\nalmond flour\n1 1/2\nteaspoons\nbaking powder\n1\nteaspoon\nkosher salt\n3\nlarge\neggs\n3/4\ncup\ngranulated sugar\n1/2\ncup\nplus\n1\ntablespoon\nextra-virgin olive oil\n1/2\nteaspoon\npure\nvanilla extract\n1/4\nteaspoon\npure\nalmond extract\nGrated zest\nof\n1\nmedium\nlemon\nor\n1/4\na\nmedium\norange\n1/2\ncup\norange juice\nFor the Glaze:\n2\ntablespoons\nunsalted butter\n1\ncup\nconfectioners' sugar\n3\ntablespoons\nwhole milk\nA few\ndrops\nof\nfresh lemon juice\n1/2\ncup sliced\n, blanched\nalmonds\n, toasted and cooled\nDirections\nPreheat oven to 350°F (180°C). Grease and flour 9-inch round cake pan or springform pan and set aside.\nIn a medium bowl, whisk together flour, almond flour, baking powder, and salt to thoroughly combine them and set aside.\nCrack eggs into large mixing bowl and whisk them lightly to break up yolks. Add sugar to bowl and whisk it in thoroughly in both directions for about 30 seconds. Add olive oil and whisk until mixture is a bit lighter in color and has thickened slightly, about 45 seconds. Whisk in extracts and zest, followed by orange juice.\nAdd dry ingredients to bowl and whisk until they are thoroughly combined; continue whisking until you have a smooth, emulsified batter, about 30 more seconds.\nPour batter into prepared pan, and bake cake for 30 to 45 minutes, rotating cake pan halfway through the cooking time to ensure even browning. Cake is done when it has begun to pull away from the sides of the pan, springs back lightly when touched, and a cake tester inserted in the center comes out clean.\nAllow cake to cool for ten minutes in the pan, then gently remove it from pan and allow it to cool completely on a rack.\nWhile cake cools, make the glaze. Melt butter over medium heat in a small, heavy saucepan. When bubbles subside, lower heat and watch butter carefully, swirling it in the pan occasionally to distribute the heat. When butter begins to turn a light tan color and smells slightly nutty, turn off heat and let butter sit. It will continue to darken as it sits.\nWhile butter cools, sift confectioner's sugar into a medium bowl. Whisk in milk until completely smooth but thick, then slowly whisk in butter. Taste the glaze and add a few drops of lemon juice to balance the sweetness. Stir in toasted almonds. Spread almonds and glaze onto the top and sides of cake and let it sit until set and dry.\nThis Recipe Appears In\nSeriously Italian: Where to Find Gianduja Outside Italy\nCakes\nItalian\nBaking\nAlmonds",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/almond-olive-oil-cake-for-valentines-day-recipe-seriously-italian.webp?"
}