{
  "url": "https://www.seriouseats.com/almond-rolls-recipe-11701148",
  "image_url": "https://www.seriouseats.com/thmb/kXI6TzZyP0hjeoNau25ZJBt8h5Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250311-SEA-AlmondFrangipaneRolls-DebbieWee-Beauty1-35-144008f35cae427aa58b07ee9efc5287.jpg",
  "tags": [
    "Baking",
    "The Latest",
    "Breakfast & Brunch",
    "Almonds"
  ],
  "title": "Almond Rolls",
  "full_text": "Almond Rolls\nClose\nJump to recipe\nPrep\n65 mins\nCook\n45 mins\nProofing Time:\n2 hrs 30 mins\nTotal\n4 hrs 20 mins\nServes\n7\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Almond Cream:\n4\nounces\nblanched or natural\nalmond flour\n(\n113\ng\n;\n1\ncup\n)\n3\nounces\nunsalted butter\nat room temperature (\n85\ng\n;\n1/2\ncup\n)\n3 1/2\nounces\ngranulated sugar\n(\n100\ng\n;\n1/2\ncup\n)\n1/2\nteaspoon\norange zest\nfrom\n1\nmedium\norange\n, optional\n1/2\nounce\nall-purpose flour\n(\n14\ng\n;\n2\ntablespoons\n)\n1\nlarge\negg\n, room temperature\n1\ntablespoon\n(\n15\nml\n)\nbrandy\nor dark rum, optional\n1 1/2\nteaspoons\nalmond extract\n1 1/2\nteaspoons\nvanilla extract\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Tangzhong:\n1/2\nounce\nbread flour\n(\n14\ng\n;\n2\ntablespoons\n)\n2 3/4\nounces\nwhole milk\n(\n80\ng\n;\n1/3\ncup\n)\nFor the Dough:\n4 1/4\nounces\nwhole milk\n(\n120\ng\n;\n1/2\ncup\n)\n11 3/4\nounces\nbread flour\n(\n330\ng\n;\n2 1/2\ncups\n)\n2\nounces\nunsalted butter\n, room temperature (\n56\ng\n;\n4\ntablespoons\n), plus more for greasing\n1\nlarge\negg\n1 1/3\nounce\ngranulated sugar\n(\n38\ng\n; about\n3\ntablespoons\n)\n2\nteaspoons\ninstant\nyeast\n1 1/4\nteaspoons\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume)\nTo Assemble:\n1\nrecipe\nalmond cream\n, room temperature, from above\n1\nounce\nsliced almonds\n(\n28\ng\n;\n1/4\ncup\n)\nFor the Glaze:\n3 1/2\nounces\nconfectioners’ sugar\n(\n100\ng\n;\n1\ncup\n)\n1\nounce\nunsalted butter\n, melted (\n28\ng\n;\n2\ntablespoons\n)\n1\ntablespoon\n(\n15\nml\n)\nwhole milk\n, plus more as needed\n1/2\nteaspoon\nvanilla extract\n1/8\nteaspoon\nalmond extract\nPinch\nkosher salt\nDirections\nFor the Almond Cream:\nAdjust oven rack to middle position and preheat to 350°F (175ºC). Add almond flour to a parchment-lined rimmed baking sheet and spread into a thin, even layer. Toast, stirring every 3 minutes, until the almond flour is fragrant and light golden brown, about 10 minutes. Remove from oven and let cool to room temperature, about 20 minutes.\nSerious Eats / Debbie Wee\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter, sugar, and orange zest, if using, on low speed to roughly incorporate. Increase to medium-high speed and beat until smooth and creamy, about 3 minutes, pausing to scrape down bowl and beater with a flexible spatula as needed. Add almond flour, all-purpose flour, egg, brandy (if using), almond extract, vanilla extract, and salt. Mix on medium-high speed until smooth, thick, and creamy, pausing to to scrape down bowl and beater halfway through, about 2 minutes. Using a flexible spatula, scrape bowl and beater to ensure that no streaks of unmixed butter remain. (Almond cream can also be prepared in a large bowl with an electric hand mixer.) Set aside.\nSerious Eats / Debbie Wee\nFor the Tangzhong:\nIn a small saucepan, whisk milk and flour to combine. Cook over medium heat, whisking constantly, until mixture thickens to a stretchy pudding-like consistency, 2 to 3 minutes.\nSerious Eats / Debbie Wee\nFor the Dough:\nUsing a flexible spatula, scrape hot tangzhong into the now-clean bowl of a stand mixer fitted with the dough hook attachment; let cool until just warm to the touch, about 10 minutes. Add cold milk to tangzhong, followed by the flour, butter, egg, sugar, yeast, and salt. Mix on low speed until dough is smooth, supple, and elastic, 12 to 15 minutes. (The dough should pass the “windowpane” test: Pull off a golf ball-sized piece of dough and, using two hands, gently flatten and stretch it until it’s a thin, translucent window of dough that resists tearing. Though all dough will eventually tear if you stretch it too much, you should be able to stretch it quite thin before that happens. If dough does not pass windowpane test, continue kneading until dough resists tearing when stretched, another 2 to 4 minutes.)\nSerious Eats / Debbie Wee\nLoosely cover bowl with plastic wrap or a damp towel and let sit at warm room temperature (75 to 80ºF; 24 to 27ºC) until dough is puffy and doubled in size, 60 to 90 minutes.\nSerious Eats / Debbie Wee\nGrease a 9-inch aluminum cake pan with butter. Line the pan with two 15-inch by 3-inch strips of parchment paper, overlapping them to form an “X” in the bottom of the pan. (There should be about 3 inches of overhang on the edges.)\nSerious Eats / Debbie Wee\nTurn dough out onto a lightly floured surface and, using a rolling pin, roll it into a 10-by 14-inch rectangle about 1/2-inch thick. Using an offset spatula, spread frangipane over dough into an even layer, leaving a 1/2-inch border along each side. Starting with the long end, roll dough into a tight log. Carefully pinch dough together along the seam to seal, and gently pat log to ensure even thickness. Brush off any excess flour from the dough. Divide dough evenly into 7 slices, each about 2-inches thick: Slide an 8-inch strand of thread, unflavored dental floss, or butcher’s twine under the dough; cross the ends over the top and pull tight to slice dough. (Alternatively, you can use a serrated bread knife to portion dough.) Arrange rolls inside prepared pan: Place 6 rolls around the perimeter and one in the center, evenly spaced apart. Loosely cover with plastic wrap or a damp towel and let rise in a warm place until about doubled in size, 30 to 60 minutes. (To test if the dough is fully proofed, gently press the dough with the flat of your finger; it should leave an indent and gently spring back.)\nSerious Eats / Debbie Wee\nAdjust oven rack to middle position and preheat to 350°F (175°C). Scatter sliced almonds evenly over proofed buns. Bake until rolls are golden brown and have an internal temperature of at least 190°F (88°C), 30 to 35 minutes. If the rolls begin to get overly dark before they’re finished cooking, lightly tent the pan with foil.\nSerious Eats / Debbie Wee\nMeanwhile, prepare the glaze:\nIn a medium bowl, whisk confectioners’ sugar, melted butter, milk, vanilla extract, almond extract, and salt until a smooth, glossy glaze forms. It should be thick but pourable; add additional milk, 1 teaspoon at a time, to loosen as needed.\nRemove rolls from the oven and pour glaze over them while still hot. Let cool in pan for 15 to 20 minutes before serving. Enjoy warm.\nSerious Eats / Debbie Wee\nSpecial Equipment\nStand mixer or hand mixer, small saucepan, whisk, flexible spatula, 9-inch aluminum pan, rolling pin, offset spatula\nNotes\nThe final proof can be done overnight in the refrigerator, if desired. Arrange rolls in prepared pan, cover, and let rise until just beginning to puff, about 20 minutes. Refrigerate for up to 12 hours. When ready to bake, remove rolls from refrigerator and let rise in a warm place until double their original size. Proceed with step 7 of recipe.\nMake-Ahead and Storage\nThe almond cream can be made up to 4 days in advance and refrigerated in an airtight container. Once cold, the almond cream becomes very firm—be sure to let it come to room temperature before attempting to spread it over the dough.\nOnce cooled, leftover rolls can be stored in an airtight container at room temperature for up to 3 days. Rolls can be tightly wrapped in plastic and frozen for up to 1 month. Thaw overnight in fridge. To reheat, wrap rolls loosely in foil and place in a preheated 350°F (180°C) oven for 5 to 10 minutes or until warmed through.c\nBaking\nThe Latest\nBreakfast & Brunch\nAlmonds"
}