{
  "url": "https://www.seriouseats.com/aloo-gobi-recipe-5220973",
  "image_url": "https://www.seriouseats.com/thmb/gTVjyFHq-N3iyv08113cBQWCTv8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220303-aloo-gobi-vicky-wasik-35-c9afccd574534761886e5964f34586e1.jpg",
  "tags": [
    "Potatoes",
    "The Latest"
  ],
  "title": "Aloo Gobi",
  "full_text": "Aloo Gobi\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nTotal\n75 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\nYukon Gold potatoes\n(\n12\nounces\n;\n350\ng\n), peeled, quartered, and cut into 1/2-inch-thick slices\n2\ntablespoons\n(\n18\ng\n) plus\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n, divided, plus more to taste; for table salt, use half as much by volume or the same weight\n2\ntablespoon\ns (\n30\nml\n)\ndistilled white vinegar\n2\nquarts\n(\n1.9\nL\n)\nvegetable oil\n, for frying\n1\nmedium head\ncauliflower\n(\n1\npound\n;\n450\ng\n), trimmed and\ncut into 2-inch florets\n2\nteaspoons\ncumin seeds\n1\nsmall\nyellow onion\n(\n4\nounces\n;\n110\ng\n), diced\nOne\n2-inch knob\nfresh ginger\n(\n1/3\nounce\n;\n10\ng\n), peeled and cut into matchsticks\n2\nmedium\ngarlic cloves\n, minced\n2\nhot green chiles\n, sliced\n1 1/2\nteaspoons\nturmeric\n2\nteaspoons\nkasuri methi\n(dried fenugreek leaves), crushed lightly (see note)\n2\nplum tomatoes\n(\n7\nounces\n;\n200\ng\n), cored and diced\n10 to 12\nsprigs\ncilantro\nincluding stems, cut into 1-inch pieces\nDirections\nLine a rimmed baking sheet with paper towels. In a 3-quart saucepan, combine potatoes, 2 tablespoons salt, vinegar, and 2 quarts cold water. Bring to a boil over high heat, then reduce heat to maintain a simmer. Cook until potatoes are tender and offer little resistance when pierced with a paring knife, about 11 minutes. Drain potatoes, transfer to prepared baking sheet, and let cool for at least 20 minutes.\nVicky Wasik\nLine a separate rimmed baking sheet with paper towels. In a large Dutch oven or wok, heat oil over high heat to 375°F (190°C). Add half of the cauliflower florets and cook, stirring gently with a spider or tongs, until florets are lightly browned and fully tender, about 2 minutes. Transfer florets to prepared baking sheet and season lightly with salt. Return oil to return to 375°F and repeat with remaining florets.\nVicky Wasik\nReturn oil to 375°F. Add potatoes and cook, stirring occasionally, until lightly browned and crisp on the outside, about 2 minutes. Transfer potatoes to baking sheet with cauliflower and set aside. Carefully transfer oil to a large heatproof bowl.\nVicky Wasik\nReturn 3 tablespoons oil to now-empty Dutch oven or wok and heat over medium-high heat until shimmering. Add cumin seeds and cook until seeds start to spit, about 10 seconds. Add onion and cook, stirring frequently, until onions just start to brown, about 8 minutes. Add ginger, garlic, and chiles and cook until fragrant, about 20 seconds. Mound vegetables in center of pan, add turmeric and dried fenugreek leaves on top, and stir to combine. Stir in chopped tomatoes and remaining 1 teaspoon salt and cook until tomatoes break down slightly and release their liquid, about 2 minutes.\nVicky Wasik\nStir in 1 cup water, increase heat to high heat, and cook until liquid reduces slightly, 2 to 3 minutes. Add reserved cauliflower and potatoes and fold gently to evenly coat vegetables with sauce. Off-heat, stir in cilantro. Serve immediately.\nVicky Wasik\nSpecial Equipment\nWok\nor\nDutch oven\nNotes\nIt helps to crush the dried fenugreek leaves lightly before cooking with them to release their aroma; you can do this by cupping the leaves in your palm and crushing them with your thumb.\nIf you cannot find or do not have dried fenugreek leaves, you can substitute with 1 teaspoon fenugreek seeds, finely ground in a spice grinder.\nMake-Ahead and Storage\nAloo gobi can be refrigerated in an airtight container for up to 1 week.\nPotatoes\nThe Latest"
}