{
  "url": "https://www.seriouseats.com/aloo-samosas-5205059",
  "image_url": "https://www.seriouseats.com/thmb/4HxqFS6SHsh1XBCXWWHbsyrGOxI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210909-SAMOSAS-ANDREWJANJIGIAN-86-ca872c2eae8e4e7eb4e7b47cfad8715e.jpg",
  "tags": [
    "South Asian",
    "Indian",
    "Russet Potatoes",
    "Pastries",
    "Snacks & Appetizers"
  ],
  "title": "Aloo Samosa (Samosa Stuffed With Spiced Potato and Peas)",
  "full_text": "Aloo Samosa (Samosa Stuffed With Spiced Potato and Peas)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n80 mins\nResting and Cooling Time\n55 mins\nTotal\n2 hrs 45 mins\nMakes\n20 samosas\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pastry Dough:\n2\ncups\n(\n280\ng\n)\nall-purpose flour\n, such as King Arthur, plus extra for shaping and rolling out the pastry\n1 1/2\nteaspoons\nkosher salt\n1\nteaspoons\ncaraway seeds\n, lightly cracked (optional)\n1/4\ncup\n(\n60\nml\n) neutral oil, such as\ngrapeseed\n1/3\ncup\nplus\n3\ntablespoons\n(\n80\nml\nplus\n45\nml\n) chilled\nwater\n, divided\nFor the Potato and Pea Filling:\n1 1/2\npounds\n(\n680\ng\n) medium\nrusset potatoes\n, cleaned and scrubbed\nKosher salt\n1/2\ncup\n(\n60\ng\n)\nfrozen peas\n, thawed and drained\n2\ntablespoons\n(\n30\nml\n) neutral oil, such as\ngrapeseed\n2\nteaspoons\nground coriander\n1\nteaspoon\ncumin seeds\n1\nteaspoon\nground turmeric\n1/2\nteaspoon\ngaram masala\n1/2\nteaspoon\nKashmiri\nchile\npowder (see note)\n1\nteaspoon\nground black pepper\n1 to 2\nfresh\ngreen chiles\nsuch as jalapeño or serrano, stemmed and finely chopped\n1\n(2-inch; 5 cm) piece\nfresh ginger\n, peeled and minced\n1/4\ncup\n(\n15\ng\n) tightly packed chopped fresh\ncilantro leaves\nand tender stems\nMaggi’s\nHot and Sweet Ketchup\nor\nmint\n, cilantro, or\ntamarind chutney\n, for serving\nDirections\nFor the Pastry Dough:\nIn the bowl of a stand mixer, combine flour, salt, and caraway seeds (if using) and mix by hand to evenly disperse the ingredients. Drizzle oil over the flour and rub it in with your fingertips. Once the fat is completely incorporated into the flour, the mixture will take on a crumbly appearance.\nAndrew Janjigian\nSet bowl on stand mixer, and fit with dough hook attachment. Add 1/3 cup (80ml) of chilled water and mix on low speed until dough comes together in a ball, adding extra water 1 tablespoon (15ml) at a time as needed to form a cohesive dough; it should not be unduly sticky or wet, nor should it be dry and crumbly. Stop the mixer, scrape down sides of bowl with a rubber spatula, then continue to knead on low speed until dough is smooth and slightly elastic to the touch, pliable and resistant to tearing, but not tough, about 5 minutes. Alternatively, the dough can be prepared by hand (see note).\nAndrew Janjigian\nThe dough should weigh about 1 pound (455g). Wrap dough in plastic, and let it rest at cool room temperature, around 70°F (21°C), until dough is pliable, and jumps back when gently pressed, at least 30 minutes, or up to 4 hours. For a longer rest, it can be refrigerated for up to 24 hours, then brought to cool room temperature, around 70°F (21°C), before use.\nAndrew Janjigian\nFor the Potato and Pea Filling:\nPlace potatoes in a medium saucepan, cover with enough water so they are fully submerged, and add 1 teaspoon (4g) salt. Bring to a boil over high heat, reduce heat to a simmer, cover with a lid, and cook until potatoes are tender, offering little resistance when poked with a paring knife, about 20 minutes. Drain potatoes and allow to cool until easy to handle; wipe out saucepan and return to stovetop.\nAndrew Janjigian\nOnce cool, peel and discard skins, and transfer potatoes to a large bowl. Using a fork, mash potatoes until flaky and no visible chunks remain, about 1 minute. The texture should not resemble smooth mashed potatoes. Add peas and stir gently to combine.\nAndrew Janjigian\nIn now-empty saucepan, heat oil over medium heat until shimmering. Add coriander, cumin, turmeric, and garam masala, and cook, stirring constantly, until fragrant, 30 to 45 seconds. Remove from heat and add chile powder.\nAndrew Janjigian\nPour contents of saucepan over potato mixture. Add black pepper, green chiles, ginger, cilantro, and 1 teaspoon (4g) salt. Using a rubber spatula, fold until well combined. Taste and adjust seasoning with more salt if needed. If making samosas right away, let filling cool to room temperature, between 68°F and 77°F (20°C to 25°C), before using. Alternatively, transfer filling to an airtight container and refrigerate until ready to use. Allow to come to room temperature before stuffing into dough.\nAndrew Janjigian\nFor Filling, Frying and Serving the Samosas:\nDivide dough into 10 equal portions by weight, and shape each into a ball over a cool and dry surface using minimal flour. If the kitchen is warm, read up on our\nhot-weather baking tips\nto ensure no problems with the dough. Transfer dough balls to a lightly floured baking sheet and cover loosely with plastic wrap. Fill a small bowl with water.\nAndrew Janjigian\nWorking with one ball of dough at a time, roll out dough to form a 7-inch (17cm) circle. Using a sharp knife, cut the circle in half; return to the baking sheet. Repeat with remaining dough balls.\nAndrew Janjigian\nWorking with one semicircle at a time, wet a fingertip in the bowl of water and dab halfway down the straight edge, and then fold the wet end over the dry side, pressing gently to seal. This will form a triangular pocket. Hold the pocket open like a little waffle cone, and gently spoon in 40g (about 3 tablespoons) potato filling. Dab the tip of a finger in water and moisten the inner flap of dough, then fold it over the filling, and press gently to seal it against the dough on the other side, then gently pinch each corner of the samosa to ensure all three points are well sealed.\nAndrew Janjigian\nTransfer samosa to a lightly floured baking sheet and cover loosely with plastic wrap. Repeat the process with remaining dough and filling. Prior to frying, if the dough seems to have warmed up too much and feels too soft, briefly refrigerate samosas until dough is just firm. (If allowed to chill completely, the interiors may not properly cook through.)\nAndrew Janjigian\nAdjust oven rack to middle position and preheat oven to 200°F (95°C). Set a wire rack in a rimmed baking sheet, and set aside. In a large Dutch oven, add enough oil to reach a depth of at least 2 inches (5cm), leaving a few inches to spare at the top. Heat oil to 340°F (171°C) over medium-high heat. When oil comes to temperature, brush any excess flour from the samosas (see note). Fry samosas, 5 at a time, turning them occasionally, until golden brown and puffed on all sides, 10 to 12 minutes (the oil temperature will drop significantly once the samosas are added; adjust heat to maintain temperature between 325-340°F/165-171°C). Avoid overcrowding the pot, as too many samosas will reduce the temperature of the oil and make the finished pastry soggy. Using a spider or slotted spoon, transfer cooked samosas to prepared baking sheet, and transfer to oven to keep warm.\nAndrew Janjigian\nSkim any browned bits from oil and discard. Return oil to 340°F (171°C), and repeat with remaining samosas. Serve warm with either Maggi’s Hot and Sweet ketchup or chutney, such as mint, cilantro, or tamarind.\nAndrew Janjigian\nSpecial Equipment\nStand mixer, Dutch oven, instant-read thermometer.\nNotes\nTo mix the dough by hand, whisk the flour, salt, and caraway seeds (if using) in a large bowl until combined. Drizzle in oil and rub with fingertips. Using rubber spatula, fold 1/3 cup water into flour mixture, scraping up dry flour and pressing dough until cohesive and shaggy ball forms. Add extra water, 1 tablespoon (15ml) at a time as needed. Transfer dough to lightly floured counter and knead by hand to form smooth ball, 5 to 7 minutes.\nWhether freshly made, or made in advance and refrigerated, let the samosa filling come to room temperature prior to use (between 68°F and 77°F (20°C to 25°C). When too warm, it may melt the dough, and when too cold it may not cook through while frying.\nTake care not to let excess flour get into the oil, or else it will continue to cook and burn, leaving an unpleasant flavor in the oil and samosas alike.\nIf Kashmiri chile powder is unavailable, blend 3/4 teaspoon smoked paprika powder and 1/4 teaspoon cayenne powder together. Measure out 1/2 teaspoon of this mixture to use as a substitute.\nMake Ahead and Storage\nThe potato and pea filling and the samosa wrapper dough can be made up to one day in advance of assembly and frying. Fried samosas can be stored, when completely cool, in a sealed ziptop bag with the air pushed out and placed in the freezer for up to 3 months. To reheat, place in a pre-heated 350°F (175°C) oven, either frozen or thawed, for 20-30 minutes.\nSouth Asian\nIndian\nRusset Potatoes\nPastries\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/aloo-samosa-samosa-stuffed-with-spiced-potato-and-peas.webp?"
}