{
  "url": "https://www.seriouseats.com/aloo-paratha",
  "image_url": "https://www.seriouseats.com/thmb/tRWGfWOQV3O7P1YveeDtNRS1JBY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__01__20210106-aloo-parathas-nik-sharma-13-52b77ba4cbad4c4f844f2f88910b2b53.jpg",
  "tags": [
    "Indian",
    "Bread",
    "Russet Potatoes",
    "Sides"
  ],
  "title": "Aloo Paratha With Spiced Potato Filling Recipe",
  "full_text": "Aloo Paratha With Spiced Potato Filling Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n105 mins\nActive\n60 mins\nTotal\n2 hrs 25 mins\nServes\n8 pieces\nMakes\n8 parathas\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Paratha Dough:\n2\ncups\n(\n11 1/4\nounces\n;\n320\ng\n)\natta\n, or a combination of\n1 1/2\ncups\n(\n7 1/2\nounces\n;\n210\ng\n)\nall-purpose flour\n, such as Gold Medal Blue Label, and\n1/2\ncup\n(\n2 1/2\nounces\n;\n70\ng\n)\nwhole wheat flour\n1\nteaspoon\n(\n4\ng\n)\nDiamond Crystal kosher salt\n; if using table salt, use half as much by volume or the same weight\n2\ntablespoons\n(\n30\nml\n) neutral cooking oil, such as\ngrapeseed\nor\ncanola\n, or\nmelted ghee\n1\ncup\nwater\n(\n240\nml\n), warmed to 160°F (70°C)\nFor the Filling:\n4\nmedium\nRusset potatoes\n(about\n1 3/4\npounds\n;\n800\ng\n), peeled and cut into 1-inch (5-cm) chunks\n1\nteaspoon\n(\n4\ng\n)\nDiamond Crystal kosher salt\n; if using table salt, use half as much by volume or the same weight\n1\nshallot\n(\n60\ng\n), peeled and minced\nOne\n1-inch (2.5cm) piece\nfresh ginger\n, peeled and cut into thin matchsticks\n2\ntablespoons\nminced\nfresh cilantro\nleaves and tender stems\n1\nfresh green\nchile\n, such as\nserrano\n, minced\n1\nteaspoon\nground cumin\n1\nteaspoon\nground coriander\n1\nteaspoon\nsmoked paprika\n1/2\nteaspoon\nfreshly ground black pepper\n1/4\nteaspoon\nground cayenne\nTo Assemble and Cook:\nNeutral cooking\noil\n, such as\ngrapeseed\nor\ncanola\n, or\nmelted ghee\n, for brushing dough rounds and cooking parathas (about\n1/2\ncup\n;\n120\nml\n)\nDirections\nFor the Paratha Dough:\nIn the bowl of a stand mixer, combine atta (or, alternatively, all-purpose flour and wheat flour) and salt and whisk until thoroughly mixed, about 30 seconds. Add 2 tablespoons of oil to the dry ingredients and, using clean fingers, massage oil into dough to achieve a crumbly texture, about 1 minute.\nSerious Eats / Nik Sharma\nSet bowl in stand mixer fitted with paddle attachment. With the mixer at the lowest speed, slowly add water 1 to 2 tablespoons (15-30ml) at a time, until dough starts to come together; you may need to use the entire amount of water. Turn off stand mixer. Remove paddle attachment and, using a bowl scraper or flexible spatula, scrape down bowl and paddle attachment.\nSerious Eats / Nik Sharma\nAttach the dough hook and set mixer to low speed, allowing machine to knead dough until it becomes soft and pliable; for atta-based dough, about 10 minutes; for dough with all-purpose flour and whole wheat flour, about 5 minutes. Transfer dough to a clean, dry, lightly floured surface, and knead by hand for 1 minute, then shape it into a large ball. Wrap dough tightly with plastic wrap or a damp kitchen towel and store it in an airtight container for 30 minutes before proceeding to Step 5.\nSerious Eats / Nik Sharma\nFor the Filling:\nIn a large saucepan, combine potatoes and salt, cover with cold water, and bring to rolling boil over high heat. Reduce heat to low and cook until potatoes are tender but not falling apart, and a paring knife inserted into a potato chunk experiences little resistance, about 8 minutes. Drain potatoes thoroughly, then transfer to a large mixing bowl or large plate and allow to cool to room temperature. Using a fork, mash the potatoes roughly (the final texture should be slightly flaky), then fold in shallot, ginger, cilantro, green chile, cumin, coriander, paprika, black pepper, and cayenne. Season with salt; it should be slightly saltier than you'd like, as it will be stuffed into the bread.\nTo Assemble and Cook the Parathas:\nLine a baking sheet or large tray with a clean lint-free kitchen towel (cotton is best) that’s been dusted with a little flour. Prepare a second kitchen towel similarly and place it over the first towel on the sheet. This setup will be used to hold the formed parathas.\nOn a lightly flour a work surface, divide the rested dough into 8 equal portions, forming each into an even ball. Working with one piece of dough at a time and keeping the rest covered with plastic wrap or a damp kitchen towel to prevent drying out, use a rolling pin to roll dough out into a 6-inch (15cm) round; use as little flour as possible to prevent sticking. Brush surface of dough circle with 1/2 teaspoon oil or ghee. Place 3 to 4 generous tablespoons of spiced potato filling in center of circle. Wrap the filling up by grabbing the outer sides of the circle, folding them over top, and pressing gently to form a flat disc. Alternatively, you can pinch the folds together as you would a dumpling, and then press them down into a circular disc. Roll disc out once more to form a 6-inch (15cm) circle, dusting disc, work surface, and rolling pin with as little flour as needed to prevent the dough from sticking. Place paratha between the two prepared kitchen towels on baking sheet. Repeat process with remaining dough and filling.\nSerious Eats / Nik Sharma\nTo Cook the Parathas:\nLine a plate with clean kitchen towel. In a 10-inch stainless-steel or cast iron skillet, heat 1/2 teaspoon oil or ghee over medium-low heat. Using teaspoon or small spoon, spread an additional 1/2 teaspoon of oil or ghee over one side of paratha and place it in the hot skillet, greased side down. Cook until base starts to turn golden brown and develops light brown blisters, about 5 minutes. Spread 1/2 teaspoon oil or ghee on uncooked side, then, using spatula, carefully flip paratha and cook on second side until bottom starts to turn golden brown and develops blisters, about 5 minutes. If parathas develop blisters or brown too quickly, reduce heat. Transfer cooked paratha to towel-lined plate and cover. Carefully wipe pan down with clean, wadded paper towel or kitchen towel to remove any flour remaining in pan, which can burn. Repeat with remaining parathas. Serve immediately.\nSerious Eats / Nik Sharma\nSpecial Equipment\nStand mixer\nMake-Ahead and Storage\nThe paratha dough can be made up to 1 week in advance. Wrap the dough tightly in plastic wrap or a clean, damp cloth towel in an airtight container. Remove from refrigerator and allow to come to room temperature for at least 30 minutes before using.\nThe spiced potato filling can be prepared up to 1 day in advance. Store spiced potato in an airtight container in the refrigerator; remove from refrigerator and allow to come to room temperature for at least 30 minutes before using.\nTo store leftover parathas, wrap them in kitchen towels and store them in an airtight ziptop bag or container in the refrigerator for up to 3 days. To reheat, warm them in a skillet over medium heat or heat them in a toaster oven at 300°F (150°C) until the fat in the paratha starts to sizzle and the bread is warm, about 5 minutes. If the paratha feels a bit dry after storage, sprinkle a few drops of water over the bread and then reheat it.\nIndian\nBread\nRusset Potatoes\nSides"
}