{
  "url": "https://www.seriouseats.com/amaretto-sour-lemon-bars-recipe-8758631",
  "image_url": "https://www.seriouseats.com/thmb/ZIOizba8S7309V739x_djM366KA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241126-SEA-AmarettoSourLemonBars-VyTran-Hero-19-2835ac6f33704cee82ef667425359b0f.jpg",
  "tags": [
    "Dessert Bars",
    "The Latest",
    "Baking",
    "Lemon",
    "Desserts"
  ],
  "title": "Amaretto Sour Lemon Bars",
  "full_text": "Amaretto Sour Lemon Bars\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nCooling and Chilling Time\n4 hrs 30 mins\nTotal\n5 hrs 35 mins\nCook Mode\n(Keep screen awake)\nIngredients\n160g\nall-purpose flour\n(about 5 1/2 ounces;\n1 1/4\ncups\n)\n50g\ngranulated sugar\n(\n1 3/4\nounces\n; 1/4 cup)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n140\ng\nunsalted butter\n(5 ounces; 10 tablespoons), melted\n275g\ngranulated sugar\n(\n9 3/4\nounces\n; about 1 1/3 cups)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3\nlarge\neggs\n3\nlarge\negg yolks\n, whites reserved\n2/3\ncup\n(160ml)\nfresh lemon juice\nfrom 5 medium lemons\n1/4\ncup\n(50g)\namaretto liqueur\n(see notes)\nFor the Meringue:\n150g\ngranulated sugar\n(\n5 1/4\nounces\n; 3/4 cup)\n1/3\ncup\n(80ml)\nwater\n3\nlarge\negg whites\n(from above)\n1/4\nteaspoon\ncream of tartar\nTo Garnish:\n16\nAmarena\ncherries\nDirections\nFor the Crust\n: Adjust oven rack to middle position and preheat to 350°F (175°C). Line an 8- by 8-inch aluminum baking pan with two 8-inch wide strips of parchment long enough to overhang pan’s edges by 2 inches; set aside.\nIn a medium mixing bowl, whisk flour, sugar, and salt to combine. Pour melted butter into flour mixture and, using a rubber spatula or dough scraper, incorporate butter into dry ingredients, gently stirring and pressing to combine, until a cohesive dough just forms and no dry bits remain, about 1 minute. (Be careful not to overwork the dough.)\nSerious Eats / Vy Tran\nScrape dough into prepared baking pan and, using an offset spatula or the flat bottom of a glass or measuring cup, press dough into an even layer. Bake until fragrant, firm, and golden, about 25 minutes. Allow shortbread to cool completely in the baking pan, about 30 minutes.\nSerious Eats / Vy Tran\nFor the Curd\n: In a medium saucepan, whisk sugar, salt, whole eggs, and yolks to combine. Add lemon juice and amaretto and whisk until smooth. Cook over low heat, using a whisk to stir frequently, until frothy, about 3 minutes. Increase heat to medium and continue cooking, stirring constantly, until curd thickens and registers 170ºF (77ºC) on an instant-read thermometer, about 8 minutes. Using a fine-mesh sieve, immediately strain curd onto the prepared crust. Using an offset spatula, smooth curd into an even layer, and cover pan with aluminum foil. Bake until smooth and just starting to set along the edges, about 10 minutes. Remove foil and cool to room temperature, about 90 minutes. Then cover again with foil and refrigerate until cold and the curd is firm without any jiggle, about 2 hours and up to 5 days.\nSerious Eats / Vy Tran\nFor the Meringue:\nIn the bowl of a stand mixer fitted with a whisk attachment, combine egg whites and cream of tartar. With the mixer on medium speed, whisk egg whites until soft peaks form, 10 to 13 minutes. (When lifted, there should be gentle peaks that very slowly collapse back into themselves.)\nSerious Eats / Vy Tran\nIn a small saucepan, combine sugar and water. Bring to a boil and cook until sugar syrup registers 240°F (116°C) on an instant-read or candy thermometer, about 4 minutes.\nSerious Eats / Vy Tran\nWith the mixer running on medium speed, carefully and slowly drizzle hot sugar syrup into the bowl along the side, avoiding hitting the whisk attachment. Increase speed to high and whip until stiff peaks form and meringue is no longer hot, about 10 minutes.\nSerious Eats / Vy Tran\nFor Assembling the Bars:\nLine a rimmed baking sheet with foil. Run an offset spatula or butter knife around edges of baking pan, then carefully lift parchment overhang to gently remove bars. Place bars on a cutting board and, using a sharp knife, cut bars into sixteen 2- by 2-inch squares. (For cleaner cuts, run knife under warm water and dry knife with a clean kitchen towel before portioning each slice.)\nSerious Eats / Vy Tran\nPlace the cut lemon squares on prepared baking sheet. Spoon a generous dollop of meringue on top of a lemon square and, using the back of the spoon, make an indent just deep enough to hold an Amarena cherry. Repeat with remaining lemon bars. Using a kitchen blowtorch, torch meringue 1 to 2 inches away from surface until evenly browned. (See notes for broiler instructions if you do not own a blowtorch.) Refrigerate until cold, about 30 minutes. Top each bar with a single cherry before serving.\nSerious Eats / Vy Tran\nSpecial Equipment\n8- by 8-inch aluminum baking pan, medium  saucepan, fine-mesh sieve, instant-read thermometer or candy thermometer\nNotes\nTake note of the ingredients in your amaretto for allergen purposes. Some are derived from almonds but most are made with the kernels of stone fruit such as apricots.\nTo use the broiler instead of a kitchen torch: Adjust oven rack to 2 inches from broiler and preheat broiler on low. Broil meringue, rotating baking sheet halfway through, until lightly brown and toasted for about 2 minutes.\nMake-Ahead and Storage\nThe shortbread can be made up to 48 hours in advance. Once cooled, shortbread can be stored in an airtight container at room temperature for up to 1 week.\nThe lemon curd can be stored in an airtight container in the refrigerator for up to 2 weeks.\nThe assembled lemon bars can be stored in an airtight container in the refrigerator for up to 3 days. If pre-assembling, refrain from putting the cherries on top until right before serving. Allow bars to come to room temperature before serving.\nDessert Bars\nThe Latest\nBaking\nLemon\nDesserts"
}