{
  "url": "https://www.seriouseats.com/american-wheat-ale-for-intermediate-homebrewers-summer-ale-recipe",
  "image_url": "https://www.seriouseats.com/thmb/U3GQ8N-3zbOhV8lzY0-40wDq-lU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110521-153016-Homebrewing-American-Wheat-bc791ac734c14d1cabc20b241459588f.jpg",
  "tags": [
    "Beer"
  ],
  "title": "American Wheat Ale (For Intermediate Homebrewers) Recipe",
  "full_text": "American Wheat Ale (For Intermediate Homebrewers) Recipe\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n7 hrs 35 mins\nFerment\n336 hrs\nTotal\n345 hrs 35 mins\nCook Mode\n(Keep screen awake)\nIngredients\n3 pounds Two-Row malt, crushed\n4 pounds Malted Wheat, crushed\n0.6 pound Munich malt, crushed\n1 ounce Magnum hops - 60 minutes\n1/2 ounce Sorachi Ace hops - 15 minutes\n1/2 ounce Sorachi Ace hops - 5 minutes\n1 Liter starter of American Ale yeast, either White Labs WLP051 or Wyeast 1272\nDirections\nLine the 7.5 gallon kettle with the mesh bag, fill with 2.5 gallons of tap water and bring to 165°F (74°C). Remove from heat.\nMash-in by slowly adding all 7.6 pounds of grain into the water and inside the bag. Stir for 2 minutes to prevent balls of grain from clumping together, creating a consistent mash. The temperature should equalize to about 154°F (68°C).\nCover the mash, only uncovering to briefly stir every 20 minutes. Heat 3 more gallons of water to 185°F (85°C).\nAfter 60 minutes, mash-out by carefully pouring the 185°F water into the mash, stirring to equalize temperature to about 170°F (77°C).\nSlowly raise the grain bag out of the liquid, allowing the wort to drain from the grain. Hold the grain bag above the kettle for 5 to 10 minutes as the wort drains. Top the wort off with water to 6 gallons.\nBring wort to a vigorous boil. When the boil begins, add 1 ounce Magnum hops in a mesh bag.\nAfter boiling for 45 minutes, add 1/2 ounce Sorachi Ace hops in a mesh bag.\nAfter boiling a for a total of 55 minutes, add 1/2 ounce Sorachi Ace hops in a mesh bag.\nAfter total of 60 minutes of boil, remove from heat. Warning: After wort cools below 180°F (82°C) everything that touches it should be sanitary, and exposure to open air should be limited as much as possible.\nCool wort by placing pot in ice bath or by using a wort chiller until it is below 70°F (21°C). Transfer to sanitized fermentor (either a carboy or a fermentation bucket).\nUse a sanitized auto-siphon racking cane to remove enough wort to take a gravity reading with your hydrometer. Make a note of this number, since you will be using it to calculate the actual alcohol content when it's done fermenting. The reading should be around 1.043.\nCarefully pour yeast into cooled wort (it should be below 70°F), and agitate vigorously. Cover fermentor with a sanitized stopper and airlock. Ferment in dark place, keeping ambient temperature consistent, preferably between 65 and 68°F (18 and 20°C).\nBottle after 1 to 2 weeks when fermentation is complete,\nusing enough priming sugar for a medium level of carbonation.\nSpecial Equipment\n7.5 gallon kettle (or bigger), large mesh grain bag, and the\nbasic homebrewing equipment setup\nRead More\nAmerican Pale Ale (For Beginners)\nHomebrewing: Introduction to Mashing and All-Grain Brewing\nHomebrewing Basics: Carbonation and Bottling\nBeer"
}