{
  "url": "https://www.seriouseats.com/anadama-bread-recipe-8783221",
  "image_url": "https://www.seriouseats.com/thmb/kemhovt5xWHS5IcmzhZ9RRnA9No=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250129-SEA-AnadamaBread-DebbieWee-Beauty2-24-538335cc8ae94e79a563006ff9be44f3.jpg",
  "tags": [
    "Baking",
    "The Latest",
    "Bread",
    "Yeast Breads",
    "New England"
  ],
  "title": "New England Anadama Bread",
  "full_text": "New England Anadama Bread\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n35 mins\nCooling TIme:\n60 mins\nTotal\n3 hrs 35 mins\nServes\n8\nto 10\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\nCooking spray\n2 1/2\ncups\nall-purpose flour\n(\n11 1/4\nounces\n;\n320\ng\n), plus more for work surface\n2\nteaspoons\ninstant or\nrapid-rise yeast\n2\nteaspoons\n(\n9\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1 1/4\ncups\n(\n300\nml\n)\nwater\n1/2\ncup\nfine\nyellow cornmeal\n(\n2 1/2\nounces\n;\n70\ng\n)\n1/4\ncup\nmolasses\n(\n60\nml\n;\n80\ng\n)\n1 1/2\ntablespoons\n(\n21\ng\n)\nunsalted butter\n, divided\nDirections\nGrease a large bowl with cooking spray. In a medium bowl, whisk together flour, yeast, and salt. Set aside.\nSerious Eats / Debbie Wee\nIn a small saucepan, bring water to boil over medium heat. Reduce heat to medium-low and stream in cornmeal, whisking constantly, until incorporated. Cook, whisking often, until mixture thickens into porridge and cornmeal is softened, about 1 minute.\nSerious Eats / Debbie Wee\nOff heat, add molasses and 1 tablespoon butter. Whisk until well combined and butter is melted. Transfer to the bowl of a stand mixer or large bowl and let cool, stirring occasionally, until below 110°F (43°C), about 20 minutes. Make sure that the cornmeal mixture has cooled to just warm/below 110°F (43°C) before adding the flour mixture; higher temperatures risk killing the yeast.\nSerious Eats / Debbie Wee\nFor Making Dough in a Stand Mixer:\nFit stand mixer with dough hook attachment. Start mixer on medium-low speed and add flour mixture 1/2 cup at a time, mixing until each addition is incorporated. After final addition, continue mixing on medium-low until cohesive dough forms and no dry flour remains, about 2 minutes.\nSerious Eats / Debbie Wee\nIncrease mixer speed to medium. Knead until dough is smooth and elastic, about 8 minutes.\nSerious Eats / Debbie Wee\nSprinkle clean work surface lightly with additional flour. Use greased dough scraper or rubber spatula to transfer dough to floured work surface. Knead by hand for a few turns to form smooth, taut ball.\nSerious Eats / Debbie Wee\nFor Kneading Dough By Hand:\nWith cornmeal mixture in a large bowl, use a rubber spatula to incorporate the first few additions of the flour mixture into dough, then switch to kneading the remaining flour mixture into the dough with your hands until all of dry flour is incorporated (the dough will seem dry and stiff, but still add all flour).\nTransfer to a clean work surface and knead by hand until smooth and elastic, about 20 minutes, adding flour to the surface as needed as the dough becomes stickier. Knead by hand for a few more turns to form smooth, taut ball.\nFor Proofing and Baking:\nPlace dough ball in greased bowl and cover with plastic wrap or clean kitchen towel. Let dough rise at room temperature until doubled in volume, 45 to 75 minutes.\nSerious Eats / Debbie Wee\nGrease an 8 1/2 by 4 1/2-inch loaf pan with cooking spray. Gently deflate dough and transfer to lightly floured work surface. Pat dough into 7-inch square and form into tight log, pinching seam and ends together to close. Nestle into greased loaf pan, seam-side down, and cover loosely with greased plastic wrap. Let rise at room temperature until center of loaf reaches 1 inch above rim of pan, 1 to 1 1/2 hours.\nSerious Eats / Debbie Wee\nNear end of rising time, adjust oven rack to middle position and preheat oven to 350°F (175°C). When dough is ready, remove plastic wrap. Bake until deep golden brown and center of loaf registers 190°F (88°C), 35 to 40 minutes.\nSerious Eats / Debbie Wee\nTransfer loaf pan to wire rack. Let cool for 15 minutes. Use a butter knife or small offset spatula to spread top with remaining 1/2 tablespoon butter until melted and evenly coated. Remove bread from pan and let cool for at least 45 minutes. Serve warm or at room temperature.\nSerious Eats / Debbie Wee\nSpecial Equipment\nWhisk, instant-read thermometer, stand mixer with dough hook attachment, dough scraper or rubber spatula, 8 1/2 by 4 1/2-inch metal loaf pan, wire rack, butter knife or small offset spatula\nNotes\nYou can use light or dark molasses in this recipe, but don’t use\nblackstrap molasses\n, which will make the bread too bitter.\nMake-Ahead and Storage\nThe fully cooled loaf can be wrapped tightly in plastic wrap or sealed in a bread bag and kept at room temperature for up to 3 days or frozen (whole or sliced) wrapped tightly in plastic then aluminum foil for up to 2 months.\nBaking\nThe Latest\nBread\nYeast Breads\nNew England"
}