{
  "url": "https://www.seriouseats.com/anchovy-croutons",
  "image_url": "https://www.seriouseats.com/thmb/m2CTj_4IHk5G6Etge2U_MN83DOk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__05__20200526-anchovy-croutons-sasha-marx6-6ebf48027a4f41f9bc81bd7a89a55dc5.jpg",
  "tags": [
    "Yeast Breads",
    "Anchovies",
    "Snacks & Appetizers"
  ],
  "title": "Sourdough Anchovy Croutons",
  "full_text": "Sourdough Anchovy Croutons\nClose\nJump to recipe\nCook\n35 mins\nActive\n5 mins\nCooling Time\n10 mins\nTotal\n45 mins\nServes\n16 servings\nMakes\n4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n6\nsalt- or\noil-packed anchovy\nfillets\n(\n20\ng\n)\n9\nounces\n(\n255\ng\n)\nsourdough bread\n, cut into 3/4- to 1-inch pieces (about\n6\nheaping\ncups\n; see notes)\nDirections\nIf Baking Croutons:\nAdjust oven rack to middle position, and preheat oven to 375°F (190°C).\nIn a large skillet, combine olive oil and anchovies. Cook over medium-low heat, stirring and breaking up anchovies occasionally with a wooden spoon, until anchovies have dissolved, about 5 minutes for oil-packed anchovies, and 10 minutes for salt-packed anchovies.\nAdd bread to skillet, toss to thoroughly coat pieces with oil on all sides, and arrange in a single layer in the pan.\nIf Cooking Croutons on Stovetop:\nCook over medium-low heat, turning and moving bread pieces every 5 minutes (you want to cook bread pieces on all sides so they crisp and color evenly, and you also need to move pieces around in the pan to adjust for hot spots and uneven heating of the skillet), until golden brown and crisp on all sides, 25 to 30 minutes.\nIf Baking Croutons:\nTransfer skillet to the oven, and bake until golden brown and crisp, rotating pan and turning bread pieces over halfway through cooking, 15 to 20 minutes.\nTransfer croutons to a rimmed baking sheet, and using a rubber spatula, scrap any remaining oil and bits of anchovy in the skillet over the croutons. Let croutons cool to room temperature, 5 to 10 minutes. Once croutons have cooled, they can be used right away or stored in an airtight container at room temperature for up to 7 days.\nSpecial Equipment\nLarge skillet,\nrimmed baking sheet\nNotes\nWhile this recipe was developed using leftover sourdough bread, it will work with any type of hearty bread, and works with both fresh and stale bread. If the loaf of bread you are using is very stale and difficult to initially cut into pieces, you can dampen the loaf briefly under cool running water just until it softens enough for slicing.\nMake-Ahead and Storage\nCroutons can be stored in an airtight container at room temperature for up to 7 days. Depending on humidity, after a few days you may need to lightly re-toast croutons to revive their crunch.\nYeast Breads\nAnchovies\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sourdough-anchovy-croutons.webp?"
}