{
  "url": "https://www.seriouseats.com/angel-biscuits-recipe",
  "image_url": null,
  "tags": [
    "Sides",
    "Biscuits",
    "Breakfast & Brunch",
    "Thanksgiving Side Dishes",
    "Easter Side Dishes"
  ],
  "title": "Yeast-Raised Angel Biscuits Recipe",
  "full_text": "Yeast-Raised Angel Biscuits Recipe\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n20 mins\nProofing Time\n2 hrs\nTotal\n2 hrs 35 mins\nServes\n14 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\nall-purpose flour\n, such as Gold Medal (about\n2 2/3\ncups\n, spooned;\n340\ng\n)\n1\nounce\nsugar\n(about\n2\ntablespoons\n;\n30\ng\n)\n1/4\nounce\n(about\n2\nteaspoons\n;\n7\ng\n)\ninstant dry yeast\n, such as SAF; not RapidRise or active dry (see notes and also more info\nhere\n)\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight as kosher salt\n1/2\nteaspoon\nbaking soda\n5 1/4\nounces\ncold,\nunsalted butter\n, cut into 1/2-inch cubes (about\n10 1/2\ntablespoons\n;\n145\ng\n)\n9\nounces\nmilk\n, any percentage will do (about\n1\ncup\nplus\n2\ntablespoons\n;\n255\ng\n)\nDirections\nSift flour into a medium bowl, then add sugar, instant dry yeast, salt, and baking soda; whisk until well combined (this may take up to 1 minute). Add butter, toss to break up the pieces, and, using your hands, smash each cube flat. Continue smashing and rubbing until the butter has mostly disappeared into a floury mix, although a few larger, Cheerio-sized pieces may remain. This can also be done with 4 or 5 pulses in a food processor, just take care not to overdo it. The prepared mix can be refrigerated up to 3 weeks in an airtight container, then used as directed below.\nAdd milk, and stir with a flexible spatula until the flour has been fully absorbed. When the dough forms a rough ball, cover with plastic and set aside at cool room temperature until roughly doubled in bulk, about 2 hours. At temperatures significantly above or below 70°F (21°C), this process will proceed at a different rate, so use visual cues rather than a specific timetable.\nSerious Eats / Vicky Wasik\nAfter proofing, turn dough onto a lightly floured surface. With lightly floured bare hands, gently pat the dough into a squarish shape about 1/2 inch thick, then fold in half; repeat twice more for a total of 3 folds, using only enough flour to keep your hands from sticking. Finish by patting the dough to a thickness of 3/4 inch. If needed, dust away any excess flour, then cut into 1 3/4-inch rounds and arrange in a 10-inch cast iron skillet. Gather scraps into a ball, pat and fold a single time, then cut as many more biscuits as you can. The final round of scraps can be gathered and shaped into a single biscuit by hand. Cover tightly with foil and refrigerate overnight, between 8 and 12 hours.\nSerious Eats / Vicky Wasik\nAdjust oven rack to lower-middle position and preheat to 400°F (200°C). Brush the cold dough with melted butter, and bake until the biscuits are well-risen and golden brown, about 20 minutes. Let the biscuits cool about 5 minutes to help set their crumb, then serve as desired, whether alongside soups and stews or split for shortcake or breakfast sandwiches. Leftovers can be stored up to a week in an airtight container. To serve, split the stale biscuits in half, brush with melted butter, arrange on a baking sheet, and broil until golden brown, then serve with jam.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n1 3/4-inch\nround cutter\n(or similar),\n10-inch cast iron skillet\nNotes\nThis recipe works best with instant dry yeast such as SAF, which does not require hydration or proofing before use. Rapid rise or quick rise styles cannot be used as a replacement, as they are not designed to function in long-term/cold-rise recipes. Plain, active dry or bread machine yeast can be used instead, though the recipe will need to be modified in order to hydrate the yeast. In this event simply follow the package directions, using a portion of milk from the recipe rather than water to hydrate the yeast.\nRead More\nLight and Fluffy Biscuits\nThe Food Lab's Buttermilk Biscuits\nThe Serious Eats Guide to Biscuits\nSides\nBiscuits\nBreakfast & Brunch\nThanksgiving Side Dishes\nEaster Side Dishes"
}