{
  "url": "https://www.seriouseats.com/apple-hand-pies-recipe-8706227",
  "image_url": "https://www.seriouseats.com/thmb/6U1qjxE_Ph7Buopq8MV-UWDUwNk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240903-SEA-DebbieWee-AppleHandPIes-Hero00-15e1e2f73eef447b864fac3d30088931.jpg",
  "tags": [
    "Pies",
    "The Latest",
    "American",
    "Desserts",
    "Apple"
  ],
  "title": "Apple Hand Pies",
  "full_text": "Apple Hand Pies\nClose\nJump to recipe\nPrep\n30 mins\nCook\n60 mins\nResting and Cooling\n45 mins\nTotal\n2 hrs 15 mins\nServes\n8\nMakes\n8 Hand Pies\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(120ml) fresh a\npple cider\n(see notes)\n1/3\ncup packed\nbrown sugar\n1\ntablespoon\n(15ml) fresh\nlemon juice\nfrom 1/2 lemon\n1\ntablespoon\n(8g)\ncornstarch\n1\nteaspoon\nground cinnamon\n1/2\nteaspoon\nground ginger\n1/4\nteaspoon\nground nutmeg\n1/4\nteaspoon\nground allspice\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\ntablespoons\nunsalted butter\n2\nGranny Smith apples\n, peeled, cored, and chopped into 1/2-inch pieces (about 9 1/2 ounces, 275g prepped)\n2\nGolden Delicious apples\n, peeled, cored and chopped into 1/2-inch pieces (about 9 1/2 ounces, 275g prepped)\n1\nrecipe\nButtery, Flaky Pie Crust\n, made through step 2, rolled into 2 (6-inch) rounds, tightly wrapped, and chilled for 2 to 24 hours\nAll-purpose flour\n, for work surface\n1\nlarge egg\n, beaten with 1 tablespoon water and pinch salt\n1\ntablespoon\nturbinado sugar\n, for sprinkling\nDirections\nIn a medium bowl, whisk together apple cider, brown sugar, lemon juice, cornstarch, cinnamon, ginger, nutmeg, allspice, and salt until sugar is dissolved and mixture is smooth.\nSerious Eats / Debbie Wee\nIn a 12-inch skillet, melt butter over medium heat. Add apples and cook, stirring occasionally with a rubber spatula, until softened and beginning to caramelize, 12 to 15 minutes.\nSerious Eats / Debbie Wee\nPour cider mixture over apples and stir until well coated. Cook, stirring and scraping bottom of pan, until bubbling and thickened, about 1 minute. Remove pan from heat. Transfer apple mixture to a shallow rimmed dish and let cool to room temperature, about 45 minutes.\nSerious Eats / Debbie Wee\nMeanwhile, line a rimmed baking sheet with parchment paper. Remove pie dough from refrigerator; if needed, let stand at room temperature until slightly softened, 5 to 10 minutes.\nSerious Eats / Debbie Wee\nLightly flour work surface and use a rolling pin to roll one dough disk to a 12-inch circle, about 1/8-inch thick.\nUse a 4-inch circle cutter to cut 6 rounds\nfrom dough (see notes). Transfer rounds to parchment-lined baking sheet. Gather scraps together and reroll to 9-inch long, 5-inch wide oval and cut out 2 more rounds. Discard dough scraps or save for another use.\nRepeat rolling and cutting with second disk of pie dough for\n16 dough\nrounds total (rounds can overlap on sheet). Cover baking sheet with plastic wrap and refrigerate to chill until filling has fully cooled.\nSerious Eats / Debbie Wee\nWhen ready to assemble hand pies, arrange 8 dough rounds on lightly floured work surface. Using a #20 portion scoop or 1/4 cup dry measuring cup, add scant 1/4-cup cooled filling to center of each dough round, mounding in center and leaving clear 1/2-inch border around edges.\nSerious Eats / Debbie Wee\nTop pies with remaining dough rounds, and use your hands to gently bend and cup them around filling. (If dough is stiff and begins to crack, let stand for a few minutes to warm and soften before proceeding. If dough rounds become too soft, refrigerate until firm again.) Use your fingers to press top and bottom dough edges together to seal, then crimp with a floured fork. Use a small pastry wheel or sharp paring knife to trim and discard 1/4 inch of ragged edges of pastry from each pie.\nSerious Eats / Debbie Wee\nTransfer assembled pies to parchment-lined baking sheet, cover loosely with plastic wrap, and refrigerate for at least 30 minutes\nor up to 1 day.\nSerious Eats / Debbie Wee\n30 minutes before you are ready to bake, adjust oven rack to lower-middle position and preheat oven to 400°F (200°C). When oven reaches temperature, brush chilled hand pies with egg wash, then sprinkle with turbinado sugar.\nSerious Eats / Debbie Wee\nBake until hand pies are golden brown, 22 to 30 minutes. Transfer baking sheet to wire rack and let hand pies cool on sheet for at least 15 minutes.\nServe warm or at room temperature.\nSerious Eats / Debbie Wee\nSpecial Equipment\n12-inch skillet, rimmed baking sheet, parchment paper, rolling pin, ruler, 4-inch circle cutter, pastry wheel, pastry brush, wire rack\nNotes\nFresh, unfiltered apple cider (usually found in the refrigerated produce section at the grocery store) lends extra apple flavor to this recipe, but you can substitute 100% apple juice if you can’t find it.\nA mix of tart Granny Smith and sweet Golden Delicious apples bring a balance of flavors and optimal texture for the pie filling, but you can use all Golden Delicious or swap in Gala or Braeburn as acceptable substitutes for the Golden Delicious.\nIf you don’t have a 4-inch circle cutter, use a paring knife to cut around an overturned 4-inch diameter small bowl or other round container to cut out the dough rounds.\nA heaping #20 portion scoop or slightly under-filled ¼-cup dry measuring cup both work well for adding the filling to the pies, keeping it in a neat mound in the center before adding the top pastry.\nMake-Ahead and Storage\nThe apple filling can be made through step 3 and refrigerated for up to 3 days in an airtight container before assembling the hand pies. Chiling it ahead of time makes the filling firmer and the pies easier to shape.\nThe assembled hand pies, made through step 9, can be frozen on the baking sheet until solid, at least 8 hours, then transferred to a zipper-lock bag or other airtight container and frozen for up to 3 months. You can bake them as directed straight from frozen, with no need to extend the baking time.\nLeftover baked hand pies can be stored covered at room temperature for up to 3 days.\nPies\nThe Latest\nAmerican\nDesserts\nApple"
}