{
  "url": "https://www.seriouseats.com/apple-pie-pancakes-recipe-8752129",
  "image_url": "https://www.seriouseats.com/thmb/F-fK8tUDt5k0cWpECBB-GsTbNx8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241121-SEA-ApplePiePancakes-RobbyLozano-Hero3-58-329096fcd0aa495ca1bd7d996499d46a.jpg",
  "tags": [
    "Apple",
    "The Latest",
    "Breakfast & Brunch",
    "Fall",
    "Fall Breakfast & Brunch"
  ],
  "title": "Apple Pie Pancakes",
  "full_text": "Apple Pie Pancakes\nClose\nJump to recipe\nPrep\n25 mins\nCook\n35 mins\nMacerate\n20 mins\nTotal\n80 mins\nServes\n2\nto 4\nMakes\n4 pancakes per person for 2 servings or 2 pancakes per person for 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pancakes:\n1 1/3\ncups\nall purpose flour\n(\n6\nounces\n;\n170\ng\n)\n1\nteaspoon\nbaking powder\n1\nteaspoon\nground cinnamon\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nbaking soda\n1/4\nteaspoon\npumpkin pie spice\n1\ncup\npeeled and grated Golden Delicious apples\n(about\n6 1/4\nounces\n;\n180\ng\n) from\n1\nmedium\napple\n4\ntablespoons\nlight brown sugar\n(\n2\nounces\n;\n57\ng\n)\n1\nlarge\negg\n, at room temperature\n1/2\ncup\n(\n120\nml\n)\nwhole milk\n, at room temperature\n1/3\ncup\nsour cream\n(\n2 1/2\nounces\n;\n70\ng\n), at room temperature\n3\ntablespoons\nunsalted butter\n(\n1 1/2\nounces\n;\n42\ng\n), melted\n1\nteaspoon\nvanilla extract\nChopped toasted pecans\n, for topping\nFor the Apple Topping:\n2\ntablespoons\nunsalted butter\n(\n1\nounce\n;\n28\ng\n)\n2\ncups\nFuji apples\n, unpeeled and chopped into 1/2-inch pieces (\n9 1/2\nounces\n;\n270\ng\n)\n3\ntablespoons\nlight brown sugar\n(\n1 1/2\nounces\n;\n42\ng\n)\n1/2\nteaspoon\nground cinnamon\n1/8\nteaspoon\npumpkin pie spice\n(see notes)\n1/4\ncup\n(\n60\nml\n)\nmaple syrup\n, plus more for serving\nFor the Maple Whipped Cream:\n1\ncup\n(\n240\nml\n)\nheavy cream\n3\ntablespoons\n(\n45\nml\n)\nmaple syrup\nDirections\nPrepare the Pancakes:\nIn a medium bowl, whisk flour, baking powder, cinnamon, salt, baking soda, and pumpkin pie spice to combine. In a separate medium bowl, toss apples with brown sugar to evenly coat; let stand, stirring occasionally, until apples have released some liquid and broken down slightly, 20 to 30 minutes.\nSerious Eats / Robby Lozano\nSerious Eats / Robby Lozano\nFor the Apple Topping:\nWhile the apples macerate, melt butter in a medium saucepan over medium heat. Add apples, brown sugar, cinnamon, and pumpkin pie spice and cook, stirring frequently, until apples are tender and can be pierced easily with a knife, 10 to 15 minutes. Remove from heat and stir in maple syrup; set aside, covered, in a warm place.\nSerious Eats / Robby Lozano\nFor the Maple Whipped Cream:\nIn a large bowl, combine heavy cream and maple syrup. Using an electric hand mixer, whip on medium speed until medium peaks form, about 2 minutes.  Cover and refrigerate until ready to use. (Whipped cream can also be prepared in the bowl of a stand mixer fitted with a whisk attachment.)\nSerious Eats / Robby Lozano\nWhisk egg, milk, sour cream, melted butter, and vanilla into macerated apple mixture until well combined. Add apple mixture to flour mixture; using a whisk or flexible spatula, stir just until combined. Set a wire rack inside a rimmed baking sheet; set aside.\nSerious Eats / Robby Lozano\nSerious Eats / Robby Lozano\nHeat a large nonstick griddle to medium heat (350°F/175ºC) or large nonstick skillet over medium. Using a 1/3 cup scoop, scoop batter onto griddle or skillet to form pancakes. Spread into 4-inch discs spaced 1/2- to 1-inch apart. Cook until bubbles start to appear on top of batter and bottoms are golden brown, 2 to 4 minutes, adjusting heat as needed to prevent overbrowning. Carefully flip pancakes and cook until bottoms are lightly golden and pancakes are cooked through, 2 to 4 minutes. Transfer to prepared wire rack. Repeat with remaining batter.\nSerious Eats / Robby Lozano\nServe pancakes immediately; garnish with apple topping, chopped toasted pecans, maple syrup, and maple whipped cream.\nSerious Eats / Robby Lozano\nSpecial Equipment\nElectric hand mixer, griddle, wire rack, rimmed baking sheet\nNotes\nIf you’d prefer to mix your own pumpkin pie spice, sift 1 teaspoon ground cinnamon,  1/4 teaspoon ground ginger, 1/4 teaspoon ground nutmeg, 1/4 teaspoon ground allspice, and 1/8 teaspoon ground cloves into a small bowl. Whisk until well combined. Use immediately or store in an airtight container in a cool, dark place for up to 6 months. Yields about 2 teaspoons spice mix.\nMake-Ahead and Storage\nThe pancakes are best enjoyed fresh.\nThe apple topping is best eaten the day it’s made. Leftovers can be refrigerated in an airtight container for up to 2 days. Gently reheat in the microwave until warmed through before using.\nThe maple whipped cream is best enjoyed fresh. Leftovers can be refrigerated in an airtight container for up to 1 day. Whisk to bring back together if needed; whisk in additional heavy cream, 1 tablespoon at a time, to adjust consistency if needed.\nApple\nThe Latest\nBreakfast & Brunch\nFall\nFall Breakfast & Brunch"
}