{
  "url": "https://www.seriouseats.com/apple-cider-doughnut-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/jePMLHW8HyZA_GihE5gnCfBVGn0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-AppleCiderDoughnutCake-FredHardy-Hero-ea012104de834e6888fa00b4eddf4f68.JPG",
  "tags": [
    "Cakes",
    "Apple",
    "Fall Desserts"
  ],
  "title": "Apple Cider Doughnut Cake Recipe",
  "full_text": "Apple Cider Doughnut Cake Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n60 mins\nActive\n30 mins\nCooling Time\n60 mins\nTotal\n2 hrs 30 mins\nServes\n10\nto 12 servings\nMakes\n1 bundt cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n9\ntablespoons\n(\n4 1/2\nounces\n;\n135\ng\n)\nunsalted butter\nat room temperature, divided\n2\nsmall\nGranny Smith apples\n(about\n6\nounces\n/\n170\ng\neach), peeled, cored, and roughly chopped (about\n2\ncups\n)\n1 1/2\ncups\n(\n355\nml\n) fresh\napple cider\n1/2\ncup\nwhole milk\n, at room temperature, plus more as needed\n2 1/2\ncups\nall-purpose flour\n(\n11 1/4\nounces\n;\n319\ng\n)\n1 1/2\nteaspoons\nbaking powder\n1/2\nteaspoon\nbaking soda\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n1/4\nteaspoon\nground nutmeg\n1/4\nteaspoon\nground mace\n3/4\ncup\nsugar\n(\n5 1/4\nounces\n;\n149\ng\n)\n1/2\ncup packed\nlight brown sugar\n(\n3 1/2\nounces\n;\n99\ng\n)\n3\nlarge\neggs\n, at room temperature\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n1\nteaspoon\n(\n4\nml\n)\npure vanilla extract\nFor the Cinnamon Sugar Coating:\n6\ntablespoons\ngranulated sugar\n(\n2 2/3\nounces\n;\n75\ng\n)\n1\nteaspoon\nground cinnamon\n1/8\nteaspoon\nground nutmeg\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F (180°C). Grease a large (10- to 12-cup capacity) Bundt pan with 1 tablespoon butter.\nSerious Eats / Fred Hardy\nIn a medium saucepan, bring chopped apple and cider to a boil over medium-high heat. Reduce heat to medium and simmer until most of the cider has been absorbed and apples are easily smashed with a fork, 10 to 15 minutes. Remove pan from heat, cool 5 minutes, then process  in food processor until puréed, 60 to 90 seconds, stopping to scrape down the sides as needed. Measure out 1 cup apple mixture (if you have less than 1 cup apple mixture, add additional milk to reach 1 cup). Stir apple mixture into milk, set aside.\nSerious Eats / Fred Hardy\nIn a medium bowl, whisk together flour, baking powder, baking soda, salt, nutmeg, and mace; set aside.\nSerious Eats / Fred Hardy\nIn the bowl of a stand mixer fitted with the paddle attachment, beat remaining 8 tablespoons butter, sugar, and brown sugar on medium speed until light and fluffy, about 3 minutes. Add eggs, one at a time, beating well after each addition, about 20 seconds. Add oil and beat until incorporated, about 45 seconds.\nSerious Eats / Fred Hardy\nDecrease mixer speed to low and add flour mixture in 3 additions, alternating with apple mixture, scraping down sides and bottom of bowl with a rubber spatula as needed. Increase speed to medium and beat mixture just until combined, about 20 seconds. Add vanilla and beat once more, just to combine, about 10 seconds.\nSerious Eats / Fred Hardy\nScrape batter into prepared pan, smooth surface with a spatula. Bake in preheated oven until a cake tester inserted in cake comes out with just a few crumbs, 45 to 50 minutes. Transfer cake to wire cooling rack set inside baking sheet and cool in pan 15 minutes, then invert directly onto wire cooling rack (see notes).\nSerious Eats / Fred Hardy\nFor the Cinnamon Sugar Coating:\nCombine sugar, cinnamon, nutmeg, and salt in a small bowl. While cake is still hot, sprinkle with cinnamon sugar, using fingers to rub it onto sides. Cool cake completely, about 1 hour, then serve\nSerious Eats / Fred Hardy\nSpecial Equipment\nFood processor\n,\nBundt pan\n,\nstand mixer\n,\nsilicone spatula\n,\nwire cooling rack\nNotes\nTo unmold the cake from the Bundt pan after cooling, use your fingers to gently pull the cake away from the side of the pan. Next, place the wire cooling rack on top, then quickly flip the whole thing over, using oven mitts to protect your hands. Once it's flipped, let the cake sit a moment or two. Then remove the Bundt pan carefully.\nRead More\nThe Best Apple Cider Doughnuts\nCakes\nApple\nFall Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/apple-cider-doughnut-cake-recipe.webp?"
}