{
  "url": "https://www.seriouseats.com/apple-cinnamon-sugar-recipe",
  "image_url": "https://www.seriouseats.com/thmb/UN-oROGsvx13nEptacYIHrGsu_0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__10__20191021-apple-cider-donuts-sarah-jane-webb-22-fdcf82a7293e4a868afd55a78312e2bc.jpg",
  "tags": [
    "Pastries",
    "Apple",
    "Fall Desserts"
  ],
  "title": "Apple Cinnamon Sugar",
  "full_text": "Apple Cinnamon Sugar\nClose\nJump to recipe\nPrep\n5 mins\nActive\nAbout 3 mins\nTotal\n5 mins\nServes\n20 servings\nMakes\n1 1/4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\nounce\nfreeze-dried apples\n(about\n1 1/3\ncups\n, although volume will vary by brand;\n30\ng\n); see note\n7\nounces\nplain\nor\ntoasted sugar\n(about\n1\ncup\n;\n200\ng\n), or more to taste\n1/2\nteaspoon\ncinnamon\n, or more to taste\n1/4\nteaspoon\nfennel pollen\n, such as Pollen Ranch fennel pollen (optional)\n1/8\nteaspoon\n(\n0.5\ng\n) Diamond Crystal\nkosher salt\n, or more to taste; for\ntable salt\n, use about half as much by volume or the same weight\nDirections\nIn the bowl of a food processor, grind freeze-dried apples into a fine powder, with no visible bits of fruit remaining. Add sugar, cinnamon, fennel pollen (if using), and salt and pulse until well combined. If you like, continue grinding to create a finer, less granular powder.\nSeason mixture to taste with additional salt or spice, or add more sugar to dilute the intensity of the apples if you find their flavor too strong. Use immediately or store in an airtight container. Due to the presence of freeze-dried fruit, this mixture is very hygroscopic and will readily absorb moisture from the air, causing it to clump over time.\nNotes\nMany supermarkets carry their own house brand of freeze-dried fruit, including freeze-dried apples (try Trader Joe's freeze-dried Fuji slices). Other major groceries may carry products such as Natierra Organic Freeze-Dried Apples and Mother Earth freeze-dried apples. When in doubt, call ahead or shop online.\nSpecial Equipment\nFood processor\nMake-Ahead and Storage\nDue to the nature of freeze-dried apples, the spiced apple sugar will readily absorb moisture from the environment. However, when carefully stored in a truly airtight container, it will keep for several weeks at cool room temperature.\nRead More\nApple Cider Doughnuts That Taste Like Apples Fall\nPastries\nApple\nFall Desserts"
}