{
  "url": "https://www.seriouseats.com/apple-pie-muffin-recipe-8749759",
  "image_url": "https://www.seriouseats.com/thmb/YV1JvSa8T5d9BbSc5qkcVRCPmbQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241108-SEA-ApplePieMuffins-RobbyLozano-Hero1-21-5191b2e0d1d0498092902fae3d67cdd2.jpg",
  "tags": [
    "Muffins",
    "The Latest",
    "Breakfast & Brunch",
    "Apple"
  ],
  "title": "Apple Pie Muffins",
  "full_text": "Apple Pie Muffins\nClose\nJump to recipe\nPrep\n25 mins\nCook\n60 mins\nCooling Time:\n30 mins\nTotal\n115 mins\nServes\n12\nMakes\n12 muffins\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spiced Apples:\n3\ntablespoons\n(42g)\nunsalted butter\n1 medium sweet\napple\nsuch as Honeycrisp (about 6 ounces;\n160\ng\n), cut into 1/4-inch pieces (1 1/4 cups chopped)\n1\nsmall\ntart\napple\nsuch as Granny Smith (about 4 ounces; 120g), cut into 1/4 inch pieces (1 cup chopped)\n1/4 cup packed\nlight brown sugar\n( 2 ounces;\n55\ng)\n3/4\nteaspoon\nground cinnamon\n1/4\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt use half as much by volume\n1/4\nteaspoon\npumpkin pie spice (see notes)\nFor the Muffins:\n1/2\ncup\n(4 ounces; 113g) packed\nlight brown sugar\n3/4\nteaspoon\npumpkin pie spice\n(see notes)\n2 1/4\ncups\nall-purpose flour,\ndivided (10.12 ounces; 287g)\n2 1/2\nteaspoons\nground cinnamon, divided\n2/3 cup\n(150\ng)\n, plus 4 tablespoons (57g)\nunsalted butter,\nsoftened, divided\n3/4\ncup\ngranulated sugar\n(5.5 ounces; 155g)\n2\nlarge\neggs, at room temperature\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1/2\ncup\n(120ml)\nsour cream\n, at room temperature\n1/3\ncup\n(80ml)\napple cider,\nat room temperature\n1/4\ncup\nold-fashioned oats\n(0.9 ounces; 26g)\nDirections\nFor the Spiced Apples:\nIn a 10-inch skillet, melt butter over medium heat. Once melted, add apple pieces, brown sugar, cinnamon, salt, and pie spice and cook, stirring frequently, until apples are tender, about 10 minutes.\nSerious Eats / Robby Lozano\nTransfer apple mixture to a fine mesh strainer set over a medium bowl. Thoroughly strain, gently stirring to remove as much excess moisture from apples as possible; set aside to let apples strain until they reach room temperature, about 15 minutes. Spread strained apples in an even layer on a large plate and refrigerate uncovered until cooled, 15 to 20 minutes. Reserve strained sauce for use as a glaze.\nSerious Eats / Robby Lozano\nFor the Muffins:\nAdjust oven rack to middle position and preheat oven to 400°F (205℃). Line a 12-cup muffin tin with paper liners. Stir together brown sugar, pie spice, 1/2 cup (2.25 ounces; 64g) of the flour, and 1 1/2 teaspoons of the cinnamon in a medium bowl until well combined. Work in 4 tablespoons (2 ounces; 57g) of the butter using fingertips until mixture is well combined and resembles wet sand. Set aside.\nSerious Eats / Robby Lozano\nIn a large bowl with an electric mixer, beat granulated sugar and remaining 2/3 cup butter on medium speed until fluffy, 3 to 4 minutes, stopping to scrape down sides as needed. Add eggs, one at a time, beating until combined after each addition, about 30 seconds.\nSerious Eats / Robby Lozano\nIn a medium bowl, whisk together salt, baking powder, baking soda, remaining 1 3/4 cups flour, and remaining 1 teaspoon cinnamon in a medium bowl. In a small measuring cup with a spout, whisk together sour cream and cider until well combined.\nSerious Eats / Robby Lozano\nStir flour mixture into butter mixture in 3 additions, alternating with sour cream mixture, until flour mixture is moistened but large flour streaks remain. Fold cooled apples into batter until evenly dispersed and batter is just combined. (Do not overmix.)\nSerious Eats / Robby Lozano\nSpoon 2 tablespoons batter into bottom of each paper liner. Sprinkle 1 packed teaspoon brown sugar mixture evenly over batter in each muffin liner; top with remaining batter (about 3 tablespoons per well) spreading into an even layer. (Liners will be very full.)\nSerious Eats / Robby Lozano\nStir oats into remaining brown sugar mixture; sprinkle evenly over batter (about 2 packed teaspoons per muffin), and press gently to adhere.\nSerious Eats / Robby Lozano\nBake for 5 minutes. Reduce oven temperature to 375°F and continue baking until a wooden pick inserted in center comes out clean, 12 to 18 minutes, rotating pan halfway. Let cool in pan 10 minutes.\nSerious Eats / Robby Lozano\nCarefully remove from pan and serve warm or at room temperature, drizzling with reserved strained apple juices from step 2 just before serving.\nSerious Eats / Robby Lozano\nSpecial Equipment\n10-inch skillet, One 12-cup muffin tin\nNotes\nIf you’d prefer to mix your own pumpkin pie spice, in a small bowl combine 1 teaspoon ground cinnamon, 1/4 teaspoon ground ginger, 1/4 teaspoon ground nutmeg, 1/4 teaspoon ground allspice, and 1/8 teaspoon ground cloves. Use immediately or store in an airtight container in a cool, dark place for up to 6 months. Yields about 2 teaspoons spice mix.\nMake-Ahead and Storage\nThe muffins can be baked, cooled, and stored in an airtight container at room temperature for up to 5 days or they can be wrapped individually in plastic and aluminum foil and frozen for up to 2 months.\nMuffins\nThe Latest\nBreakfast & Brunch\nApple"
}