{
  "url": "https://www.seriouseats.com/apple-fritters-recipe-8772353",
  "image_url": "https://www.seriouseats.com/thmb/ZSzdP1tsCb6XpwQ1DEMGjgoMhSo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241101-SEA-AppleFritters-RobbyLozano_Hero1-12-d5be39677bbe4b85aa133e72fb587983.jpg",
  "tags": [
    "Apple",
    "The Latest",
    "Frying"
  ],
  "title": "Apple Fritters",
  "full_text": "Apple Fritters\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nCool\n15 mins\nTotal\n65 mins\nServes\n8\nto 16 servings\nMakes\n8 fritters\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Apple Fritters:\n42\ng\nunsalted butter\n(\n1 1/2\nounces\n;\n3\ntablespoons\n), cut into pieces\n2\nlarge\nGranny Smith apples\n(about\n8\nounces\n;\n226\ng\neach), peeled and cut into 1/4-inch pieces\n2\nteaspoons\nfresh\nlemon juice\nfrom 1 medium lemon\n130\ng\ngranulated sugar\n(\n4 1/2\nounces\n;\n1/2\ncup\nplus\n2\ntablespoons\n), divided\n1\nteaspoon\nplus a pinch Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nCanola oil\n, for frying\n355\ng\nall-purpose flour\n(\n12 1/2\nounces\n;\n2 3/4\ncups\n)\n2\nteaspoons\nbaking powder\n3/4\nteaspoons\napple pie spice\n2\nl\narge eggs\n, lightly beaten\n1/2\ncup\n(\n120\nml\n)\nwhole milk\n1/3\ncup\nsour cream\n(\n3\nounces\n;\n85\ng\n)\n1\nteaspoon\nvanilla extract\nFor the Glaze:\n285\ng\nconfectioners’ sugar\n(\n10\nounces\n;\n2 1/2\ncups\n)\n5\ntablespoons\n(75ml)\napple cider\nPinch\nkosher salt\nDirections\nFor the Apple Fritters:\nIn a large skillet, melt butter over medium heat. Cook, whisking constantly with a wooden spoon, until milk solids sink to the bottom of the skillet and turn light golden brown, 3 to 4 minutes. Add apples and stir to evenly coat in butter. Cook, stirring occasionally, until apples are crisp-tender and still hold their shape, about 5 minutes. Add lemon juice, 2 tablespoons of the sugar, and a pinch of salt. Cook, stirring constantly, until sugar dissolves and apples are glazed in sugar mixture, about 2 minutes. Transfer apples to a large plate and refrigerate until cool, about 20 minutes.\nSerious Eats / Robby Lozano\nSet a wire rack inside a 13- by 18-inch rimmed baking sheet; set aside. Fill a large Dutch oven with 1 1/2 inches of canola oil and heat over medium-high until oil is 375ºF (190ºC).\nSerious Eats / Robby Lozano\nIn a large bowl, whisk flour, baking powder, apple pie spice, remaining 1/2 cup sugar, and 1 teaspoon salt to combine; set aside. In a medium bowl, whisk eggs, milk, sour cream, and vanilla to combine. Add sour cream mixture and cooked apples to dry ingredients, and, using a flexible spatula, fold together until a thick batter forms.\nSerious Eats / Robby Lozano\nWorking in batches of 3, carefully drop about 1/2 cup of batter into hot oil and, using the back of a spoon, immediately press fritter until fritter is about 4-inches in diameter. Fry, adjusting heat as needed to maintain temperature, and use a spider skimmer or slotted spoon to flip fritters halfway through. Cook until fritters are browned, puffed, and cooked through, about 5 minutes. Transfer finished fritters to prepared wire rack and repeat with remaining fritters.\nSerious Eats / Robby Lozano\nFor the Glaze:\nIn a medium bowl, whisk confectioners’ sugar, apple cider, and salt until smooth. Working with one fritter at a time, dip top of fritter into glaze, allowing excess glaze to drip off. Return fritter to wire rack, glaze side up. Repeat with remaining fritters. Serve warm or at room temperature.\nSerious Eats / Robby Lozano\nSpecial Equipment\nLarge skillet, wire rack, 13- by 18-inch rimmed baking sheet, large Dutch oven, spider skimmer or slotted spoon\nNotes\nIf apple pie spice is not available, you can use pumpkin pie spice or 1/2 tsp cinnamon and 1/4 tsp nutmeg in the fritter batter instead.\nMake-Ahead and Storage\nApple fritters are best served immediately, but in a pinch (...or if you're taking them on an airplane), you can store them in a paper bag at room temperature for up to a day.\nApple\nThe Latest\nFrying"
}