{
  "url": "https://www.seriouseats.com/apple-pecan-bourbon-caramel-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Kv6pJYiiPFv5o2EqlXm7dFzYmwQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221110-Apple-Peacon-Burbon-Carmel-Pie-Fred-Hardy-hero-f204c61a7ee14eda882bcfe4f91fdb28.JPG",
  "tags": [
    "Thanksgiving Desserts",
    "Baking",
    "Apple",
    "Pecans",
    "Thanksgiving Desserts"
  ],
  "title": "Apple-Pecan Bourbon-Caramel Pie",
  "full_text": "Apple-Pecan Bourbon-Caramel Pie\nClose\nJump to recipe\nPrep\n20 mins\nCook\n105 mins\nActive\n50 mins\nCooling and Macerating Time\n2 hrs 35 mins\nTotal\n4 hrs 40 mins\nServes\n8\nto 10 servings\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n1\nrecipe\nbuttery, flaky\npie crust\n, prepared following recipe directions as a single-crusted pie in a 9-inch pie plate\n1\nlarge\negg white\n1\ntablespoon\n(\n15\nml\n) heavy\ncream\nGranulated sugar\n, for filling pie shell to blind bake\nDemerara sugar\n, for sprinkling\nFor the Apple Filling:\n3 1/2\npounds\n(\n1.6\nkg\n)\ntart baking apples\n, such as Braeburn, Golden Delicious, Jonathan, or Jonagold\n2\ntablespoons\n(\n30\nml\n)\nfresh juice\nfrom\n1\nwhole\nlemon\n4\nteaspoons\n(\n11\ng\n)\ncornstarch\n1/3\ncup\ndark brown sugar\n(\n2 1/4\nounces\n;\n64\ng\n)\n2\ntablespoons\ngranulated sugar\n(\n1\nounce\n;\n28\ng\n)\n1/4\nteaspoon\nground cinnamon\n1/4\nteaspoon\ngrated\nfresh ginger\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nPinch\nground\nallspice\nPinch\nof freshly grated\nnutmeg\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\nFor the Pecan Bourbon-Caramel:\n1/2\ncup\ngranulated sugar\n(\n3 1/2\nounces\n;\n100\ng\n)\n1/4\ncup\nunsalted butter\n(\n1/2\nstick\n;\n2\nounces\n;\n113\ng\n)\n1/3\ncup\n(\n79\nml\n)\nheavy cream\n2\ntablespoons\n(\n30\nml\n)\nlight corn syrup\n1\ntablespoon\n(\n15\nml\n) maple syrup or\nsorghum syrup\n1\ntablespoon\n(\n15\nml\n)\nbourbon whiskey\n1/2\ntablespoon\n(\n8\nml\n)\nblackstrap molasses\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\ncups\nwhole\npecans\n(\n1/2\npound\n;\n227\ng\n), toasted\nDirections\nFor the Crust:\nPreheat oven to 350°F (180°C). Whisk egg with cream, set aside. Using a large sheet of aluminum foil, press into the pie crust so it conforms to curves of plate. (A second sheet of foil may be needed for full coverage.) Fill to brim with granulated sugar (see note), transfer to a half sheet pan, and bake until fully set and golden around the edges, 60 to 75 minutes, brushing crimped edge with egg wash and sprinkle with demerara sugar after 40 minutes. Fold long sides of foil toward middle, gather short sides, and use both hands to carefully transfer sugar to heat-safe bowl. Let sugar cool to room temperature. If needed, continue baking crust a few minutes more to brown along the bottom. Let cool for 30 minutes.\nSerious Eats / Vicky Wasik\nMeanwhile, for the Apple Filling:\nPeel apples partially in a spiral pattern, starting at the stem and proceeding towards the bottom, removing about half the skin while leaving a stripe of skin on each apple. Core apples and cut into 1/4-inch slices. In a large mixing bowl, toss together apple slices, lemon juice, cornstarch, brown sugar, granulated sugar, cinnamon, ginger, salt, allspice, and nutmeg until well combined. Let stand at room temperature, stirring occasionally, for 30 minutes (liquids will be released during this time, preventing a wet pie filling later).\nSerious Eats / Fred Hardy\nMelt butter in a large, wide-bottomed pot and heat over medium heat; add apple mixture and any juices in the bottom of the bowl. Cook, stirring often, until apples are soft but not falling apart, about 20 minutes. Allow apples to cool for 30 minutes, then scrape into pre-baked pie crust.\nSerious Eats / Fred Hardy\nFor the Pecan Bourbon-Caramel:\nWhile apples are cooling, place granulated sugar, butter, heavy cream, corn syrup, maple syrup, bourbon, molasses, and salt in a heavy-bottomed saucepan and cook over medium heat, stirring, until ingredients are fully combined, about 2 minutes. Stop stirring, turn heat to medium-high, and cook until mixture reaches 236°F (113°C) on a candy thermometer, about 5 minutes. Off heat, allow caramel to cool to 190°F (88°C), about 3 minutes. Mix in toasted pecans, then spoon the caramel-pecan mixture over apples, patting and shaping to form an even coating. Let pie cool to room temperature, at least 30 minutes, then slice and serve.\nSerious Eats / Fred Hardy\nSpecial Equipment\n9-inch\npie plate\n,\nthermometer\nNotes\nIt's very important to use sugar to weigh down the pie crust as directed in this recipe and not pie weights or beans; this is because this crust can retract if not fully weighed down, and sugar accomplishes this better than the other options. Also make sure to fill the pie shell all the way to the very, very top with sugar, lest the crimped edge retract. Bonus: The\nbaked sugar\nis a versatile ingredient that can be saved to act as a weight for future pies and/or used in any recipe calling for granulated sugar, even if it darkens.\nThanksgiving Desserts\nBaking\nApple\nPecans\nThanksgiving Desserts"
}