{
  "url": "https://www.seriouseats.com/aquafaba-cardamom-meringue-cookies-5184210",
  "image_url": "https://www.seriouseats.com/thmb/fwVDndIeX_X_R0khOpNuipFxYLg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210518-aquafaba-meringue-cookies-nik-sharma-seriouseats-5-c693bc82dfc945f6bff663b571dd6600.jpg",
  "tags": [
    "Vegan Desserts",
    "Cookies",
    "Chickpeas",
    "The Latest"
  ],
  "title": "Vegan Meringue Cookies",
  "full_text": "Vegan Meringue Cookies\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nCooling Time\n30 mins\nTotal\n2 hrs 15 mins\nServes\n40 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n120\nml\n;\n130\ng\n)\naquafaba\n(see note)\n1/2\ncup\n(\n100\ng\n)\nsuperfine sugar\n1/4\nteaspoon ground\ngreen cardamom\n1/4\nteaspoon\ncream of tartar\nDirections\nPreheat oven to 200°F (95°C) and set oven racks to middle positions; line two rimmed baking sheets with parchment paper. In the bowl of a stand mixer fitted with the whisk, combine aquafaba, sugar, cardamom, and cream of tartar.\nNik Sharma\nWhisk at medium speed for 1 minute, then increase speed to high and whisk, stopping once or twice to scrape sides and bottom to ensure sugar is fully incorporated, until meringue reaches satiny, stiff white peaks, about 10 minutes (see note).\nNik Sharma\nUsing a 1-tablespoon measuring spoon or a pastry bag fitted with the 1/2-inch (1.27cm) round tip, spoon or pipe the meringue into 2-inch (5cm) circles spaced 1 inch (2.5cm) apart on the prepared baking sheets.\nNik Sharma\nBake the meringues without opening the oven door for 1 hour. Swap the baking sheet positions and rotate them front to back, then bake until the meringues are white in color and dry and firm to the touch, about 30 minutes longer (note that baking times can vary, and it may take up to 2 hours total baking time). Remove the sheets from the oven and let the meringues cool on the baking sheets.\nServe, or transfer the cooled meringues to an airtight container and store for up to 3 days.\nSpecial Equipment\nStand mixer\nNotes\nAquafaba is the cooking liquid collected from beans (in this case chickpeas). Canned liquid is best for reliable and consistent results, but you can also use the liquid from beans cooked at home. Please note that while home-cooked chickpeas can produce aquafaba that works, you may end up with varying results depending on how much water was used to cook the beans and how they were cooked. One 15-ounce (425g) can of chickpeas gives about 2/3 cup (160g) aquafaba.\nThe time taken to form stiff peaks tends to vary depending on the aquafaba source and viscosity. For this reason, it is better to use visual cues as an endpoint. Stiff peaks can appear anywhere between about 4 mins to 12 minutes.\nMake-Ahead and Storage\nThe baked meringues can be stored in an airtight container at room temperature for up to 3 days. Depending on the ambient humidity in your room, the meringues can absorb moisture from air. You can reheat them at 150°F/65.5°C for 10 minutes to get rid of the absorbed moisture before serving. You can also drop a packet of food-safe silica gel beads along with the meringues in the airtight container; it will help prevent the cookies from absorbing too much moisture.\nVegan Desserts\nCookies\nChickpeas\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/vegan-meringue-cookies.webp?"
}