{
  "url": "https://www.seriouseats.com/arancini-rice-balls-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0QtaNzyf8PN81XmETuzu92eLN7A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__10__20141020-arancini-daniel-gritzer-15-6e920c37d2f44a599e7d35ecc05c77a0.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Christmas Appetizers",
    "Italian",
    "Pressure Cooker",
    "White Rice"
  ],
  "title": "Rich and Creamy Saffron Arancini With Mozzarella Recipe",
  "full_text": "Rich and Creamy Saffron Arancini With Mozzarella Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n75 mins\nActive\n2 hrs\nCooling and Chilling Time\n70 mins\nTotal\n2 hrs 45 mins\nServes\n12\nto 15 rice balls\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(1-pound) loaf\ncrusty Italian bread, crusts removed and bread cut into 1-inch cubes, or\n2\ncups\npanko bread crumbs\n, finely ground in a food processor\n3 3/4\ncups\nhomemade chicken stock or store-bought\nlow-sodium chicken broth\n, divided (see notes)\n2\npackets\n(\n1/2\nounce\n)\nunflavored gelatin\n(only if using store-bought chicken broth or homemade broth that remains watery when chilled; see notes)\n2\ntablespoons\nextra-virgin olive oil\n1\nmedium\nyellow onion\n, finely diced (about\n1\ncup\n)\n2\ncups\nshort-grain Asian rice\n(see notes)\n1\ncup\ndry white wine\n2\npinches\nsaffron\n, divided\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\nunsalted butter\n1/4\ncup\nplus\n2\ntablespoons\nall-purpose flour\n, divided\n1/4\ncup\nmilk\n2\nlarge\neggs\n, beaten\n1\npound\nlow-moisture mozzarella\n, diced\nVegetable, canola, or other neutral\noil\n, for frying\nDirections\nPreheat oven to 300°F (150°C). Place bread cubes on a rack set in a rimmed baking sheet and bake in oven until completely dried out, about 30 minutes.\nIf using store-bought chicken broth or homemade broth that remains watery when chilled, place stock in a large liquid measuring cup and sprinkle gelatin over the top. Set aside.\nIf Making Rice in a Pressure Cooker:\nHeat oil in pressure cooker over medium-high heat until shimmering. Add onion and cook, stirring occasionally, until onion is softened and translucent, about 4 minutes. Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3-4 minutes (rice grains should start to look like tiny ice cubes—translucent around the edges and cloudy in the center). Add wine and cook, stirring, until raw alcohol smell has cooked off and wine is almost fully evaporated, about 2 minutes. Stir in 3 cups broth and 1 pinch saffron, scrape any grains of rice or pieces of onion from side of pressure cooker so that they are fully submerged; season with salt. Close pressure cooker and bring up to low pressure (10 psi on most units). Cook at low pressure for 6 minutes, then depressurize cooker either by running it under cold water if it is not electric, or using the steam-release valve if it is electric. Return to heat and stir rice until it forms the texture of a thick porridge. Season with salt and pepper.\nIf Making Rice on Stovetop:\nHeat oil in large saucier pan or Dutch oven over medium-high heat until shimmering. Add onion and cook, stirring occasionally, until onion is softened and translucent, about 4 minutes. Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3-4 minutes (rice grains should start to look like tiny ice cubes—translucent around the edges and cloudy in the center). Add wine and cook, stirring, until raw alcohol smell has cooked off and wine is almost fully evaporated, about 2 minutes. Stir in 2 cups stock and 1 pinch saffron, scrape any grains of rice or pieces of onion from side of pressure cooker so that they are fully submerged; season with salt. When liquid has mostly evaporated, stir in 1 more cup stock and cook, stirring frequently, until liquid has mostly evaporated. Stir in water 1/4 cup at a time until rice is just tender and has formed the texture of a thick porridge. Season with salt and pepper.\nMeanwhile, in a small saucier or saucepan, melt butter over medium-high heat until foaming. Stir in 2 tablespoons flour to form a paste, lower heat to medium, and cook, stirring constantly, until raw-flour smell is gone but flour has not browned, 2 to 3 minutes. Whisk in milk and remaining 3/4 cup stock until smooth, and add remaining 1 pinch saffron. Bring to a simmer, and continue to cook, stirring, until bechamel sauce is thick enough to coat the back of a spoon, about 4 minutes. Season with salt and pepper. Let cool slightly, then whisk in eggs.\nScrape rice into large mixing bowl along with bechamel sauce and stir until thoroughly incorporated. Line 2 rimmed baking sheets with parchment and scrape rice filling onto each one, spreading it in a thin, even layer. Refrigerate rice filling until thoroughly chilled and thickened, at least 1 hour.\nSerious Eats / Daniel Gritzer\nMeanwhile, if making homemade bread crumbs, transfer dried bread cubes to a food processor and process until finely ground. Transfer homemade breadcrumbs or ground panko to a plate.\nIn a shallow bowl, whisk remaining 1/4 cup flour with 1/4 cup water to form a smooth paste, then whisk in an additional 1/4 cup water to form a slurry.\nSerious Eats / Daniel Gritzer\nTransfer chilled rice filling to a large mixing bowl and re-line rimmed sheets with fresh parchment paper. Scoop a small handful (about 1/4 cup) of rice filling in one hand (avoid wetting hands with water even though filling is sticky) and form it into a flat disk. Place a few small pieces of mozzarella in center of disk and fold rice filling around it to form a sphere with the cheese in the center. It may be difficult to form a perfect sphere at this point, but that's okay.\nRoll rice ball in flour slurry, then transfer to breadcrumbs and roll to coat. The rice ball may feel a little soft at this point, but you should be able to coat it in the crumbs and just manage to maintain a roughly spherical shape. Transfer to parchment and repeat with remaining rice filling, cheese, and coatings.\nFill a saucepan at least 4 inches deep with vegetable oil and heat to 375°F (190°C). Pick up one breaded rice ball and re-form it into a sphere (it should now more easily take that shape). Gently set it on a slotted spoon and lower it into the oil. Repeat with remaining rice balls, working in batches and topping up oil as needed. Fry rice balls until golden brown, then, using a slotted spoon or spider, lift them one by one from the oil, allowing excess oil to drip off, then transfer to paper towel-lined baking sheets or plates. Let cool slightly, then serve. Rice balls can be allowed to cool, then stored in the refrigerator. Reheat in a 350°F (180°C) oven.\nSerious Eats / Daniel Gritzer\nSpecial Equipment\npressure cooker\n,\nDutch oven\n, or\nlarge saucier pan\n; slotted spoon;\ninstant-read thermometer\n;\nrimmed baking sheets\nNotes\nIf your homemade chicken stock remains watery even when chilled, or if you are using store-bought chicken broth, be sure to add the unflavored gelatin for best results; if your homemade stock is gelatin-rich and solidifies when chilled, you do not need to add additional gelatin.\nShort-grain Asian rice, such as sushi rice, produced the best results in our tests; however, you can use risotto rice such as arborio or carnaroli and still get good results.\nRead More\nHow to Deep-Fry at Home Without a Deep-Fryer\nA Comprehensive Guide to Rice Varieties\nBaked Saffron Risotto With Mozzarella and Crispy Topping Recipe\nSnacks & Appetizers\nChristmas Appetizers\nItalian\nPressure Cooker\nWhite Rice"
}