{
  "url": "https://www.seriouseats.com/argentine-cheese-empanadas-recipe-7724732",
  "image_url": "https://www.seriouseats.com/thmb/lJZLVS09vY7SPWNg-qOmz-lUZBc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230821-SEA-SaltaEmpanadas-TwoBites-031-8a7826b9e1b54a469fc5f073bc431309.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Cheese",
    "Savory",
    "Frying"
  ],
  "title": "Empanadas de Queso (Argentine Cheese Empanadas)",
  "full_text": "Empanadas de Queso (Argentine Cheese Empanadas)\nClose\nJump to recipe\nPrep\n40 mins\nCook\n20 mins\nResting Time\n30 mins\nTotal\n90 mins\nMakes\n20\nto 24\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n100\ng\nunsalted butter\n(\n3 1/2\nounces\n; about\n7\ntablespoons\n)\n1\nteaspoon\nSpanish\npaprika\n(pimentón dulce)\n1\nteaspoon\ncrushed red pepper flakes\n2\ntablespoons\n(\n18\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n220\nml\n(\n7 1/2\nfluid ounces\n) warm\nwater\n500\ng\nall-purpose flour\n(\n18\nounces\n; about\n3 3/4\ncups\nplus\n2\ntablespoons\n)\nFor the Filling:\n1\nmedium\nyellow onion\n(\n7\nounces\n;\n200\ng\n), cut into 1/4-inch dice\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1\nsmall\nrusset potato\n(\n100\ng\n), peeled and cut into 1/4-inch dice\n150\ng\ntybo\ncheese\n(\n5 1/2\nounces\n;\n1\ncup\n), cut into 1/4-inch dice (see notes)\n100\ng\nfontina cheese\n(\n3.5\nounces\n;\n1\ncup\n), shredded\n100\ng\nsemi-hard\ngoat cheese\n, like garrotxa,\n(3.5\nounces\n;\n1\ncup\n), shredded\n1\ntablespoon\nof finely minced pickled\nchile pepper\n, like serrano or chiltepin, plus\n1\ntablespoon\n(\n15\nml\n) of the pickle juice\n1\ntablespoon\ncrushed red pepper flakes\nFor the Llajwa (Hot Sauce):\n3\nlarge\n-sized ripe\nplum tomatoes\n(\n1 pound\n;\n454 g\n)\n2\nScotch bonnet peppers\n, very finely diced (see notes)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(\n15\nml\n)\nextra virgin olive oil\nNeutral oil\n, for frying\nDirections\nFor the Dough:\nIn a medium saucepan, melt the butter over medium heat. Add Spanish paprika and crushed red pepper flakes and whisk until the paprika infuses the butter, about 20 seconds. Remove from heat and set aside.\nSerious Eats / Two Bites\nIn a measuring cup, whisk salt into the warm water until it dissolves. In a large mixing bowl, add flour. Make a well in the center about 4 inches wide. Add the melted butter to the well and, using a fork, mix butter into the flour until you have a sandy texture. Gradually add water and, using your hands, mix until a smooth dough forms, 2 to 3 minutes. (Be careful not to over-knead, as developing too much gluten will create hard empanada shells.). Cover dough with a damp towel and rest until the dough is soft and pliable, 30 minutes at room temperature.\nSerious Eats / Two Bites\nFor the Filling:\nWhile the dough rests, in a medium saucepan, combine onions, olive oil, and a pinch of salt and cook over medium-low heat until soft and translucent, 8 to 10 minutes; set aside.\nSerious Eats / Two Bites\nIn a medium saucepan, combine potatoes, 3 cups water, and 1/2 teaspoon salt. Bring to a boil over high heat, then reduce heat to maintain a simmer. Cook until potatoes are tender and offer little resistance when pierced with a paring knife, about 3 minutes. Drain potatoes, transfer to a heatproof bowl along with the onions and set aside to cool. Once onions and potatoes have cooled, stir in tybo, fontina, and goat cheeses, pickled peppers and their juices, and crushed red pepper flakes.\nSerious Eats / Two Bites\nFor the Llajwa (Hot Sauce):\nSplit tomatoes in half horizontally. Place a box grated into a large bowl. Rub cut faces of tomatoes over the large holes of a box grater, using the flattened palm of your hand to move the tomatoes back and forth. The flesh should be grated off, while the skin remains intact in your hand. Discard skin. Stir hot peppers, sea salt, and extra virgin olive oil into grated tomatoes. Add additional salt, olive oil, and hot pepper to taste, as necessary. Set aside.\nSerious Eats / Two Bites\nForm and Fill the Empanadas:\nAfter 30 minutes, divide the dough in half; return one half of the dough to the bowl and cover with a damp towel. Using your fists or the palm of your hand, press dough down until it’s about 1/2-inch thick. Lightly dust with flour and, using a pasta sheeter or rolling pin, roll dough to 2mm thick. (Do your best to create an even, rectangular shape, which will help you get the most out of the dough with your cutter.)\nSerious Eats / Two Bites\nUsing a 4-inch-wide (13cm) circular cookie cutter, cut discs out of the dough. You should have a total of 20 to 24 discs, with each weighing 25 to 28 grams. Cover discs with a damp towel or plastic wrap to avoid drying out. Repeat the process with the remaining half of the dough. If necessary, repurpose and roll out any leftover dough once to punch out additional discs as needed. Cover discs with a damp towel or plastic wrap to avoid drying out.\nSerious Eats / Two Bites\nHolding a disc of dough in the palm of your hand, pinch one end to create a tulip shape. Place a generous tablespoon of filling (about 25g) in the center of the disc. Fold the dough over the filling to enclose, forming a half-moon shape. Use your fingers, dampening with water if necessary, to gently seal the edges together while making sure to push out any air bubbles (see notes).\nSerious Eats / Two Bites\nFold the right corner of the empanada in towards the center and pinch to crimp. Working from that corner, continue crimping to form points along the edge so that the empanada looks like half of a sun with rays. (Be sure to work the dough gently to avoid air bubbles or tearing, and use your index finger to squeeze the filling in if necessary.) Repeat with remaining dough and filling, placing formed empanadas on a baking sheet lined with parchment.\nSerious Eats / Two Bites\nTo Fry the Empanadas:\nSet a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels. In a large Dutch oven, heat 2.5 inches oil over medium-high heat to 350°F (177°C). Working in batches of 6, carefully add empanadas to hot oil, dropping them from as close to the oil’s surface as possible to minimize splashing. Fry, using a spider or slotted spoon to flip the empanadas halfway through, until golden brown on both sides, about 4 minutes. Transfer empanadas to prepared wire rack.\nSerious Eats / Two Bites\nReturn oil to 350° and repeat frying process with remaining empanadas, continuing to work in batches of 6. Serve hot with the llajwa.\nSerious Eats / Two Bites\nSpecial Equipment\nPasta roller or rolling pin, 4-inch (10cm) circular cookie cutter, slotted spoon or spider\nNotes\nThis recipe can be easily doubled, tripled, or quadrupled, if desired.\nIf unable to find tybo cheese, substitute with Monterey Jack.\nIf unable to find Scotch bonnet pepper, substitute with a habanero pepper.\nYou may have to dip your finger in water and run it around the edge of the dough before pressing to seal the empanadas shut.\nThe empanadas can also be baked. To bake the empanadas, adjust oven rack to middle position and preheat oven to 400ºF (205ºC). Line a rimmed baking sheet with parchment and bake empanadas for 15 minutes until golden brown.\nIf making a larger batch, be sure to keep extra empanada dough rounds tightly wrapped in plastic in the refrigerator to avoid drying out.\nFor a more pronounced flavor in the dough, prepare empanadas a day ahead, reserve tightly covered in plastic wrap in the fridge, and fry the following day.\nMake-Ahead and Storage\nEmpanadas are great for freezing for up to three months preserved in tightly sealed tupperware or plastic bags. Place empanadas on a lightly floured plate, baking sheet or baking pan that fits in your freezer, being careful not to let them touch. Once frozen, they can be stored in a plastic bag and shouldn’t stick to one another.\nPrepping the empanadas the day before will allow the chile pepper flavor in the dough to become more pronounced and less muted by the frying.\nSnacks & Appetizers\nThe Latest\nCheese\nSavory\nFrying"
}