{
  "url": "https://www.seriouseats.com/armenian-pizza-5211329",
  "image_url": "https://www.seriouseats.com/thmb/9nBO2oz_MNK-omvTapQIEKZEZQk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211115-OONI-PIZZA-ARMENIAN-ANDREW-JANJIGIAN-45-6aa167d433f24a31bb6413e8cdd01d8b.jpg",
  "tags": [
    "Pizza",
    "Italian",
    "Cheese",
    "Savory",
    "Ground Lamb"
  ],
  "title": "\"Armenian\" Pizza With Spiced Lamb Sausage, Armenian String Cheese, and Sumac",
  "full_text": "\"Armenian\" Pizza With Spiced Lamb Sausage, Armenian String Cheese, and Sumac\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nRising Time\n60 mins\nTotal\n100 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\nfor\noutdoor pizza oven pizza dough\n8\nounces\n(\n225\ng\n)\nground lamb\nor\n85% lean ground beef\n1\npacked cup\n(\n15\ng\n)\nfresh parsley leaves\nand tender stems, roughly chopped, divided\n2\ntablespoons\n(\n30\ng\n) mild or hot\nbiber salçasi pepper paste\n(see note)\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n1\nclove\ngarlic\n(\n5\ng\n), finely minced\n1\nteaspoon\nground allspice\n1\nteaspoon\nsweet paprika\n1/2\nteaspoon\nground cumin\nKosher salt and freshly ground pepper\n1\n(28-ounce; 795 g) can\nwhole peeled tomatoes\n, drained, juices reserved\n8\nounces\n(\n225\ng\n)\nArmenian string cheese\n, pulled into medium threads\nExtra virgin olive oil\n2\nteaspoons\nground sumac\nDirections\nRemove dough from refrigerator and allow to rest in proofing containers, covered, at room temperature for 1 to 2 hours before baking. Dough temperature should reach 60°F (15.5°C) before stretching and baking; exact timing will depend upon ambient temperature.\nSerious Eats / Melissa Rivard\nMeanwhile, in a small bowl, combine 4 teaspoons parsley, biber salçasi, tomato paste,  garlic, allspice, paprika, cumin, 1 teaspoon salt, and 1/4 teaspoon pepper. Stir with spatula until smooth paste forms. Add lamb and knead gently with hands until thoroughly combined. Cover and refrigerate until needed; mixture can be refrigerated for up to 24 hours.\nSerious Eats / Melissa Rivard\nUsing a countertop or immersion blender, process tomatoes until a coarse but evenly blended sauce forms, about 10 seconds. Transfer to a 2-cup liquid measuring cup; if needed, add reserved tomato liquid to yield 2 cups (475ml) sauce. Season to taste with salt and pepper and set aside.\nSerious Eats / Melissa Rivard\nPreheat pizza oven to 800°F (425°C). When ready to bake, coat one dough ball generously on both sides with flour and place on well-floured surface, seam side down. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough into a 10- or 12-inch circle (final dimension depends upon the size of your oven) about 1/4-inch thick by draping over knuckles and gently stretching. Transfer to floured wooden or perforated metal pizza peel.\nSerious Eats / Melissa Rivard\nWorking quickly, spread an even layer of tomato sauce over pizza, leaving outer 1/2-inch rim untopped. Spread string cheese evenly over sauce, then dollop meat mixture over pizza in small chunks. Drizzle with olive oil.\nSerious Eats / Melissa Rivard\nTransfer pizza to oven and bake, rotating pie regularly with a metal peel for even cooking, until rim is lightly charred and bottom is crisp, 90 to 180 seconds total. Retrieve pizza with a metal peel and transfer to a cutting board. Sprinkle with parsley and sumac, slice, and serve immediately.\nSerious Eats / Melissa Rivard\nRepeat steps 5 through 7 for remaining pizzas.\nSpecial Equipment\nHigh-temperature outdoor pizza oven\n,\nwooden or perforated metal pizza peel\n, metal pizza peel.\nNotes\nBiber salçasi can be found in Middle Eastern grocery stores or online. If unavailable, increase tomato paste to 3 tablespoons, paprika to 4 teaspoons, and add 1/8 to 1/4 teaspoon cayenne.\nIf Armenian string cheese is unavailable, substitute 8 ounces (225g) low-moisture mozzarella, shredded, tossed with 1/4 teaspoon nigella seeds (if available).\nGround sumac can also be found at Middle Eastern markets or online.\nMake-Ahead and Storage\nLamb sausage mixture can be made in advance and refrigerated in an airtight container for up to 24 hours.\nPizza\nItalian\nCheese\nSavory\nGround Lamb"
}