{
  "url": "https://www.seriouseats.com/arroz-con-gandules-recipe-7152325",
  "image_url": "https://www.seriouseats.com/thmb/szpg1foU8VyyjprGvMT-zm7-YOk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230301-Puerto-Rican-Arroz-con-Gandules-VickyWasik-hero-2a3ce858bd23443f8cbe0907c692e7c3.JPG",
  "tags": [
    "Puerto Rican",
    "The Latest",
    "White Rice",
    "Rice & Grain Mains",
    "Caribbean"
  ],
  "title": "Arroz con Gandules (Puerto Rican Rice With Pigeon Peas)",
  "full_text": "Arroz con Gandules (Puerto Rican Rice With Pigeon Peas)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nTotal\n50 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Puerto Rican Sofrito:\n1\nmedium\nyellow onion\n, cut into chunks\n1/2\npepper\ngreen bell pepper\n, cleaned and chopped\n1/2\npepper\nred bell pepper\n, cleaned and chopped\n6\nlarge\ngarlic cloves\n1\ncup packed\ncilantro\n, roughly chopped\n3\ngreen onions\n, trimmed and chopped\n2\nají dulce peppers\n(optional)\n1/4\ncup packed\nculantro\n(optional)\nLarge\npinch\nsazón seasoning\nFor the Arroz con Gandules:\n2\ntablespoons\nneutral cooking oil, like\ngrapeseed\nor\ncanola oil\n1/2\ncup\nsmoked ham steak\n, diced\n1/4\ncup\nfresh\nsofrito\n(see provided recipe)\n2\ntablespoons\ndiced\npimento peppers\n, drained\n2\ntablespoons\ncapers\n, drained\n2\nteaspoons\nsazón spice blend\n(see note)\n1\nteaspoon\nadobo spice blend\n(see note)\n1\nchicken bouillon cube\n, crumbled\n1\nlarge\nbay leaf\nOne\n15-ounce can\ngreen pigeon peas\n, drained and liquid reserved (see note)\n1\ncup\njasmine\nor\nlong-grain rice\n, rinsed and drained\nWater\n, enough for\n1 1/2\ncups\ntotal\nKosher salt\n, to taste\nCracked black pepper\n, to taste\nFresh or frozen\nbanana leaf\n, for steaming (optional; see note)\nDirections\nFor the Sofrito:\nIn a food processor or blender, combine all of the ingredients together and pulse, adding 1 to 2 tablespoons of water if needed to create sauce, similar to pesto or salsa. Refrigerate for up to 5 days or portion into ice cube trays or containers and freeze for up to 6 months.\nSerious Eats / Vicky Wasik\nIn a medium-sized pot or Dutch oven, over medium heat, add 2 tablespoons neutral cooking oil. Once hot and shimmering, add the 1/2 cup smoked ham cubes and cook until crisp around the edges, about 7-10 minutes, stirring often.\nSerious Eats / Vicky Wasik\nNext, add the ¼ cup fresh sofrito, 2 tablespoons diced pimento peppers, 2 tablespoons capers, 2 teaspoons sazón spice blend, 1 teaspoon adobo spice blend, 1 crumbled chicken bouillon cube, and 1 large bay leaf. Stir well to combine everything and cook until the sofrito is fragrant, about 3 minutes.\nSerious Eats / Vicky Wasik\nAdd the drained pigeon peas and stir. Cook the peas with the ham and sofrito mixture for 5 minutes, stirring occasionally. Then, add 1 cup rinsed and drained rice, stirring to toast the rice and make sure all the grains are evenly coated with the seasoned pea mixture for another 5 minutes.\nSerious Eats / Vicky Wasik\nOnce the rice is toasted, add the water and the reserved pigeon pea liquid. Taste and adjust seasoning with kosher salt and black pepper to your liking.\nSerious Eats / Vicky Wasik\nWhen the rice and liquid are both rapidly boiling and the water has mostly evaporated (you should see little bubble pockets in the pot), turn the heat down to low, stir the rice to fold it over on itself, cover the rice with the banana leaf, cover the pot with a tight-fitting lid, and let the rice steam for 20 minutes.\nSerious Eats / Vicky Wasik\nOnce your timer is done, fluff the rice using a fork and serve immediately with sliced ripe avocado and tostones (twice-fried plantains).\nSerious Eats / Vicky Wasik\nSpecial Equipment\nCaldero or\nDutch oven\nNotes\nUsing dry or canned pigeon peas for the recipe is definitely personal preference. During the holiday season when making this in large batches, I prefer using dry pigeon peas that get sent to me from my family back home in Puerto Rico. To prep those, I pressure cook them with fresh sofrito, a smoked ham hock, and other aromatics until they’re tender and store them in plastic deli containers and freeze until I’m ready to cook with them. At that point, I portion what I need and then continue the recipe. Canned pigeon peas are just as good and definitely save on time in the kitchen!\nDepending on which brand of sazón or adobo spice blends you use, the saltiness will vary. Keep that in mind while making this recipe and adjust accordingly to your liking to avoid oversalting the rice. I prefer to make my blends at home to control the salt level, so if using store-bought blends, start with 1 teaspoon and work from there.\nFrozen banana leaves can be found in most international grocery stores and I always keep them on hand for steaming rice and proteins. Simply cut out a portion of the leaf that will fit into the pot you’re using by tracing the edge of the pot lid on the leaf to get the right size.\nIf wanting to make pegao, which is the often coveted scorched rice at the bottom of the pot, let the rice continue to cook for another 15-20 minutes, carefully adjusting the heat as needed to avoid burning the rice. It’s easier to make this using a Dutch oven or heavy-bottomed pot instead of nonstick pots. When serving pegao, it’s traditionally served on the side to accompany the rice itself.\nMake-Ahead and Storage\nUsing dry or canned pigeon peas for the recipe is definitely personal preference. If using dry pigeon peas, pressure cook them with fresh sofrito, a smoked ham hock, and other aromatics until they’re tender and store them in plastic deli containers and freeze until ready to cook. At that point, simply portion what’s needed and then continue the recipe as written.\nThe finished rice dish can be kept in the refrigerator for up to 2 days, and leftovers are great topped with a fried egg.\nRead More\nJamaican Rice and Peas Recipe\nHoppin' John Recipe\nNew Orleans–Style Red Beans and Rice Recipe\nWarm Pigeon Pea Salad With Roasted Butternut Squash and Spice Onions Recipe\nBharazi (Pigeon Peas in Coconut Cream) Recipe\nPuerto Rican\nThe Latest\nWhite Rice\nRice & Grain Mains\nCaribbean",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/arroz-con-gandules-puerto-rican-rice-with-pigeon-peas.webp?"
}