{
  "url": "https://www.seriouseats.com/as-sam-bornean-bamboo-cooked-rice-with-chicken-recipe-8549523",
  "image_url": "https://www.seriouseats.com/thmb/Puar95MURifiXHbM6aUn9L0AX54=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-As-am-MichelleYip-22-c8996e92479640cda3452fe7fcc28638.jpg",
  "tags": [
    "Malaysian",
    "The Latest",
    "Chicken",
    "White Rice",
    "Rice & Grain Mains"
  ],
  "title": "As-sam (Bornean Bamboo-Cooked Rice With Chicken)",
  "full_text": "As-sam (Bornean Bamboo-Cooked Rice With Chicken)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n90 mins\nCooling Time\n50 mins\nTotal\n2 hrs 30 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\ncups\n(\n500\ng\n) white medium-grain\nrice\n, such as Bario or arborio\n1 3/4\npounds\n(\n795\ng\n) bone-in, skin-on\nchicken\ncut into 2-inch cubes (see notes)\n2\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core roughly chopped\n1\n(2-inch)\npiece\n(\n25\ng\n) peeled\nfresh ginger\n, pounded\n5\nmedium\ncloves garlic\n, pounded into a paste in a mortar and pestle\n3\nteaspoons\nDiamond Crystal\nkosher salt\n, divided, plus more to taste; for table salt, use half as much by volume\nFreshly\nground black pepper\n, to taste\n3\npandan\nleaves\n(if cooking in a bamboo culm) or\n1\npandan\nleaf\n(if cooking in a baking dish)\n1\nbamboo culm\n(optional; see note)\nDirections\nIn a rice cooker or saucepan, cook rice according to package instructions. Once cooked, set aside to cool to room temperature with the lid off, about 30 minutes, then fluff with a spatula or spoon.\nSerious Eats / Michelle Yip\nMeanwhile, in a large bowl, thoroughly mix together chicken, lemongrass, ginger, and garlic with 1 1/2 teaspoons salt.\nSerious Eats / Michelle Yip\nAdd the fluffed rice, black pepper, and the remaining 1 1/2 teaspoon kosher salt to the chicken and rice mixture, stirring the filling well with a spatula or your hands to make sure everything is well incorporated and the rice is no longer in clumps.\nSerious Eats / Michelle Yip\nTo Cook in Bamboo:\nBuild a live wood fire. Rinse the bamboo culm. Using your hands, gently stuff the bamboo culm with the filling until either the bamboo is filled almost to the brim or no more filling remains.\nSerious Eats / Michelle Yip\nRoll the pandan leaves into a tight ball and stuff them into the bamboo culm opening to plug it (it won't be an airtight plug, but will help trap some heat).\nSerious Eats / Michelle Yip\nCarefully set the filled bamboo over the live fire, leaning it at an angle so that the open (pandan-leaf-stuffed) end is on top, the closed end is on the bottom, and the flames are licking the central section of the bamboo. Cook, rotating bamboo every 5 to 10 minutes for even heating and to prevent any section from burning, and shifting the bamboo as needed to also expose each end to the flames, until a steady steam escapes from the bamboo's opening, about 1 hour; feed fire as needed to maintain a live flame. Remove the bamboo culm from the fire until cool enough to handle.\nSerious Eats / Michelle Yip\nUsing a heavy-duty knife or cleaver and tapping its spine with a heavy object, carefully split the bamboo vertically from the open end, then pry open the bamboo and scoop out the filling into a large bowl. Serve warm.\nSerious Eats / Michelle Yip\nTo Cooking in a Baking Dish: Preheat oven to 325°F (160°C). Spread rice mixture into a 9- by 13-inch baking dish, smoothing the surface without packing the rice too tightly. Tie 1 pandan leaf into a knot and place on top of the rice mixture. Cover baking dish tightly with foil. Cook until chicken is fully cooked through, 30 to 45 minutes.\nSerious Eats / Michelle Yip\nSpecial Equipment\nOne or more bamboo culms large enough to hold filling (see headnote for more details) or one 9- by -13-inch baking dish\nNotes\nFeel free to use half of a roughly 4-pound chicken, or bone-in, skin on chicken legs or thighs. Use a cleaver or pair of quality kitchen shears to cut through the bones when cutting the chicken into smaller pieces, or ask the butcher to do it for you.\nIf desired, you can marinate the chicken and seasonings for 2 to 3 hours before mixing with the cooked rice to allow the flavors to meld.\nMake-Ahead and Storage\nThis rice dish is best when freshly made.\nMalaysian\nThe Latest\nChicken\nWhite Rice\nRice & Grain Mains"
}