{
  "url": "https://www.seriouseats.com/asam-laksa-fish-noodle-soup-recipe-8551167",
  "image_url": "https://www.seriouseats.com/thmb/YxSNssLM-l9OiyWXgr9VLPei_YA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240129SEA-AsamLAska-MichelleYip-00-8a246d22253e4e929cfe963e644db56a.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Rice Noodles",
    "Fish",
    "Malaysian"
  ],
  "title": "Asam Laksa (Spicy and Sour Noodle Soup) Recipe",
  "full_text": "Asam Laksa (Spicy and Sour Noodle Soup) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs\nTotal\n2 hrs 10 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Soup:\n2\npounds\n(\n1\nkg\n)\nchub mackerel\n,\nsardines\n, or other small, oily fish, gutted and cleaned (keep the heads on)\n10 1/2\ncups\n(\n2.5\nL\n)\nwater\n1\npound\n(\n450\ng\n) dried thick rice noodles, or\n21\nounces\n(\n600\ng\n) fresh thick\nrice noodles\n(see note)\n10\nAsian\nshallots\n(about\n5\nounces\n;\n150\ng\n), peeled and sliced\n12\ndried Kashmiri chiles\n, stemmed and sliced, soaked in hot water\n2\nfresh\nmedium-hot\nred chiles\n, such as fresnos, stemmed and sliced\n2\ntorch ginger flower buds\n(about\n3 1/2\nounces\n/\n100\ng\n; see note)\n4\nstalks\nlemongrass\n, pale bulbous bottom part only, outer leaves discarded, tender core thinly sliced (about\n1 1/2\nounces\n;\n40\ng)\n1/2\nounce\n(\n15\ng\n) fresh or frozen\ngalangal\n, peeled and thinly sliced\n2\ntablespoons\n(\n30\ng\n)\nshrimp paste\n, preferably Malaysian-style belacan\n5\ng\nfresh\nturmeric\n, peeled and thinly sliced (see note)\n2\nmedium\ngarlic\ncloves\n, peeled and smashed\n2\ntablespoons\n(\n30\nml)\ntamarind concentrate\n4\npieces\nasam gelugur\nor\nkokum\n(optional; see note)\nAbout\n1\ncup\n(\n50\ng\n) Vietnamese\nmint leaves\n(see note)\n2 1/2\ntablespoons\ngranulated sugar\n, plus more as needed\n1\ntablespoon\nkosher salt\n, plus more as needed\nNeutral oil,\nsuch as\nvegetable\nor\ncanola oil\n, as needed for noodles\nFor Serving: (all garnish are optional)\nPicked fresh\nspearmint leaves\nPineapple\n, sliced into thin chunks (preferably fresh)\n3 to 5\nAsian\nshallots\n, peeled and thinly sliced\nFresh chiles\n, such as fresnos, stemmed and thinly sliced\nTorch ginger flower buds\n, thinly sliced (see note)\n3\ncalamansi oranges\nor\nPersian limes\n, halved\nPetis udang\n, thinned with hot water to make about\n1/2\ncup\nof a thick, pourable consistency (see notes)\nDirections\nFor the Soup:\nIn a medium stock pot, bring the water to a boil over high heat. Add fish and cook for 5 minutes. Remove from heat. Using wire skimmer, transfer fish to a bowl and let cool for 10 minutes. Using a measuring cup, measure out 2 cups fish stock and set aside; leave remaining stock in pot. Debone fish, reserving heads and bones separate from fish meat.\nSerious Eats / Michelle Yip\nIn a food processor, combine fish heads and bones with 1 cup reserved stock. Process until it becomes a thick slurry, about 1 minute. Stir slurry back into stock, bring to a boil over medium-high heat, and cook, adjusting heat as needed to maintain simmer, for 30 minutes.\nSerious Eats / Michelle Yip\nIf using dried rice noodles, soak them in hot water and set aside while preparing spice paste and soup.\nSerious Eats / Michelle Yip\nWhile fish stock is cooking, in a clean food processor, add shallots, soaked dried chiles, red chiles, torch ginger flower buds, lemongrass, galangal, fresh turmeric, garlic, shrimp paste, and remaining 1 cup measured fish stock. Process, scraping down sides as necessary, until the mixture becomes a smooth paste, about 1 minute.\nSerious Eats / Michelle Yip\nStrain fish-bone stock through a fine-mesh strainer into a large non-reactive bowl; discard crushed fish bones. Rinse stock pot clean, then pour strained stock back into pot. Add processed spice paste along with tamarind concentrate, asam gelugur (if using), Vietnamese mint leaves, and deboned fish meat. Stir. Bring to a simmer over medium heat and simmer, stirring occasionally, until broth is slightly viscous and intensely flavored, for 1 hour. Stir in 2 1/2 tablespoons sugar and 1 tablespoon kosher salt then adjust seasoning to taste.\nSerious Eats / Michelle Yip\nWhile broth is cooking, finish preparing the rice noodles.\nIf using dried rice noodles:\nDrain soaked noodles, place in a large saucepan, add water to cover by about 1 inch, then bring to boil over high heat. Cook until the noodles are cooked through, about 20 minutes. Immediately plunge into ice water to stop the cooking process, then drain again. Toss with 1 teaspoon neutral oil to prevent the noodles from clumping and set aside.\nIf using fresh rice noodles:\nBlanch in boiling water for about 30 seconds, then drain. Toss with 1 teaspoon neutral oil to prevent the noodles from clumping and set aside.\nSerious Eats / Michelle Yip\nFor Serving:\nDivide noodles among serving bowls. Pour 2 to 3 ladles of soup straight over noodles, making sure to include chunks of fish. Garnish each serving with any combination of spearmint leaves, pineapple, shallots, chiles, and torch ginger flower buds. Squeeze half a calamansi lime and drizzle 1 tablespoon of petis udang over each bowl. Serve.\nSerious Eats / Michelle Yip\nSpecial Equipment\nFood processor\n,\nfine-mesh strainer\nNotes\nTorch ginger flower buds are available at Southeast Asian grocery stores under the names “bunga kantan” or “kecombrang,” and usually still on the stem. Choose buds that are bright pink and firm. Remove the thick stem from right underneath the bud before using. If you can't find torch ginger flower buds, you can use additional galangal in its place in the stock and omit it as a garnish.\nFresh turmeric can be found in South Asian and Southeast Asian grocery stores. It gives an almost medicinal scent when fresh, and keeps well in the freezer for up to 3 months. If unavailable, omit entirely (do not use dried turmeric powder).\nAsam gelugur is the dried slices of the\nGarcinia atroviridis\nfruit, native to Peninsular Malaysia. This is available in Southeast Asian grocery stores, also under the name “asam keping.” If asam gelugur is unavailable, substitute with the same amount of kokum (a fruit distantly related to asam gelugur, available at South Asian grocers), or 1 more tablespoon of tamarind concentrate.\nVietnamese mint is available at Southeast Asian grocery stores, and is also (confusingly) called “Vietnamese coriander,” “Cambodian mint,” “phak phai,” or “laksa leaf.” It wilts relatively quickly on the counter, so put it in the fridge as soon as you get it home from the market.\nRice noodles are available dried or fresh in East Asian and Southeast Asian grocery stores. Look for a high percentage of rice flour (at least 80 percent) with no wheat fillers.\nPetis udang is available at Southeast Asian grocery stores or online. It’s also referred to as “shrimp paste” but is not the same thing as belacan or Filipino patis; petis udang is much sweeter in flavor, darker in color, and almost molasses-like in texture.\nMake-Ahead and Storage\nStore the prepared noodles and fish soup in airtight containers in the fridge for no longer than 1 week.\nSoups\nThe Latest\nRice Noodles\nFish\nMalaysian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/asam-laksa-spicy-and-sour-noodle-soup-recipe.webp?"
}