{
  "url": "https://www.seriouseats.com/asian-gado-gado-tofu-bean-sprouts-street-food",
  "image_url": "https://www.seriouseats.com/thmb/MeXISS3CWDKEude0NONaaWPAqM8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100924-gadogado-610-7d84c82978fa4900a0b5fab9fc9b9aba.jpg",
  "tags": [
    "Tofu"
  ],
  "title": "Gado Gado Recipe",
  "full_text": "Gado Gado Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nCooling Time\n15 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Javanese Peanut Sauce:\n1 1/2\ncups\nunsalted skinned\nroasted peanuts\n1 1/2\nteaspoons\ndried\nshrimp paste\n1\nfresh red Holland or green\nthai chile\n, or fresno, cayenne, or serrano\n2\nmedium\ncloves garlic\n, coarsely chopped\n3 to 4\ntablespoons\npalm sugar\n, thinly sliced, or dark brown sugar\n3/4\ncup\nunsweetened coconut milk\n1\ntablespoon\ncider or\nrice vinegar\n3/4\nteaspoon\nkosher salt\n3/4\ncup\nwater\nFor the Gado Gado:\n3\ncups\nmung bean sprouts\n1\ntablespoon\nvegetable oil\n6\nounces\ncotton\ntofu\n, drained and sliced into 1/4 inch cubes\n1\nlarge\ncucumber\n, cut into 2-inch long matchsticks, 1/4 inch on each side\n1/2\nhead\nleafy green\nlettuce\n, torn into large bite-size pieces\nDirections\nFor the peanut sauce:\nHeat a 12-inch nonstick skillet over medium heat until hot, about 1 minute. Add the peanuts and toast, shaking the pan every few seconds, until golden brown, 3 to 5 minutes. Transfer to bowl and allow to cool completely.\nPlace shrimp paste in the center of a small square of foil. Fold edges of the foil over to enclose the shrimp paste. Using a pair of tongs, place foil over direct heat of burner set to medium-high. Toast on both sides until fragrant, about 1 minute total. Using a spoon, scrape paste into a small bowl and allow it to cool.\nTransfer peanuts to food processor and pulse until they are the consistency of sand, about 12 one-second pulses. Add toasted shrimp paste, chile, garlic, and sugar to the peanuts in the food processor. Pulse until mixture is grainy, about 8 to 10 one-second pulses.\nReturn mixture to skillet. Add coconut milk and bring to gentle simmer over medium-low heat. Continue to cook, stirring constantly, until the milk is thick and will coat the back of a wooden spoon, about 5 to 7 minutes. Add vinegar and salt and stir well to combine. Add water. Sauce should have consistency of thick cream.\nSet aside to cool before using.\nStores well in fridge for up to a week, reheat briefly, then allow to cool to room temp . If sauce becomes too thick, stir in a little water.\nTo assemble gado gado:\nFill saucepan 3 quarts water and bring to a boil over high heat. Add the bean spouts and blanch just until they begin to soften, 10 to 20 seconds. Using a slotted spoon, transfer the bean sprouts to a colander and run cold water over them until cool.\nHeat oil in nonstick 12 inch skillet over medium-high heat until shimmering. Add tofu and cook until golden brown on all sides, 2 to 3 minutes total.\nPlace the bean sprouts, cucumbers, lettuce, and tofu into large mixing bowl. Add the peanut sauce and toss thoroughly. Serve immediately to retain the crispness of the vegetables.\nThis Recipe Appears In\nGado Gado\nTofu",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gado-gado-recipe.webp?"
}