{
  "url": "https://www.seriouseats.com/asparagus-quiche-recipe-11711495",
  "image_url": "https://www.seriouseats.com/thmb/7IrXdE2hHv_6k0iOvJZukcRQYQA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250408-SEA-AsparagusQuiche-JenCausey-hero-cc755cce6d24478ea6b489ffd019a281.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Breakfast & Brunch",
    "Easter",
    "Vegetarian"
  ],
  "title": "Asparagus Quiche",
  "full_text": "Asparagus Quiche\nClose\nJump to recipe\nPrep\n20 mins\nCook\n75 mins\nChill, Cooling, and Freezing Time:\n2 hrs 5 mins\nTotal\n3 hrs 40 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n5 3/4\nounces\nall-purpose flour\n(\n160\ng\n;\n1 1/4\ncups\n)\n1\nteaspoon\ngranulated sugar\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n4\nounces\ncold unsalted butter\n(\n113\ng\n;\n8\ntablespoons\n), cut into 1/2-inch cubes)\n3\ntablespoons\n(\n45\nml\n)\nice water\nFor the Filling:\n1\nbunch\nfresh\nasparagus\n(\n12\nounces\n;\n340\ng\n), woody ends trimmed\n1\nteaspoon\nextra-virgin olive oil\n3/4\nteaspoon\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume\n4\nounces\n(\n113\ng\n)\ngoat cheese\n, crumbled (about\n1\ncup\n)\n1\nounce\n(\n28\ng\n)\nGruyère cheese\n, shredded (about\n1/4\ncup\n)\n3/4\ncup\n(\n175\nml\n)\nheavy cream\n1/2\ncup\n(\n120\nml\n)\nwhole milk\n3\nlarge\neggs\n2\ntablespoons\n(\n6\ng\n) chopped fresh\nchives\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\ngarlic powder\nDirections\nFor the Crust:\nIn the bowl of a food processor, pulse flour, sugar, and salt until combined, about 3 pulses. Scatter butter over top of flour mixture, and pulse until mixture resembles coarse crumbs, 8 to 10 pulses. Add ice water, 1 tablespoon at a time, and pulse until mixture starts to clump together, about 8 pulses total. (You may not need all the water.) Transfer onto a lightly floured surface, and gently press until dough just comes together, 2 or 3 times. Flatten dough into a 6-inch disk. Wrap tightly in plastic wrap, and refrigerate until firm, at least 1 hour or up to 24 hours.\nSerious Eats / Jen Causey\nAdjust oven rack to middle position, and preheat oven to 350°F (175ºC). On a lightly floured work surface, roll out dough into a 12-inch round. Carefully transfer to a 9-inch pie plate. Press dough into bottom and up sides of pie plate. Using scissors, trim excess dough, leaving a 1-inch overhang. Fold overhang over itself to create a thick border that sits on top edge of pie plate; crimp or shape as desired. Freeze until firm, about 30 minutes.\nSerious Eats / Jen Causey\nLine the pie crust with parchment paper, and fill with pie weights, dried beans, or uncooked rice. Bake until edges are just dry and set, about 20 minutes. Remove the parchment and pie weights; continue to bake until light golden brown, about 15 minutes. Remove from the oven, and set aside.\nSerious Eats / Jen Causey\nFor the Filling:\nIncrease oven temperature to broil. Cut asparagus tips into 2-inch-long pieces; slice stalks into 1/4-inch rounds. On a 13- by 18-inch rimmed baking sheet, toss asparagus, oil, and 1/4 teaspoon salt together. Roast until asparagus is browned on edges and crisp-tender, 5 to 7 minutes. Let asparagus stand until cool, about 5 minutes. Remove asparagus tips; set aside. Reduce oven temperature to 350°F (175ºC).\nPlace goat cheese, Gruyère, and roasted asparagus stalks in bottom of pie crust. In a medium bowl, whisk cream, milk, eggs, chives, pepper, garlic powder, and remaining 1/2 teaspoon salt to combine; pour over asparagus mixture in crust. Top with reserved asparagus tips. Bake until filling registers 170°F (77°C) on an instant-read thermometer and edges of filling are set but the center still jiggles slightly, 35 to 40 minutes. (If crust becomes too brown before center is set, loosely cover crust edges with aluminum foil, .) Let cool for at least 30 minutes, and serve.\nSerious Eats / Jen Causey\nSpecial Equipment\nFood processor; rolling pin; 9-inch pie plate; scissors; parchment paper; pie weights, dried beans, or uncooked rice; 13- by 18-inch rimmed baking sheet; instant-read thermometer\nMake-Ahead and Storage\nThe crust can be blind-baked up to 2 days in advance. Once cooled, wrap crust tightly in plastic wrap and store at room temperature.\nOnce cooled, the finished quiche can be wrapped tightly in plastic and refrigerated for up to 3 days. Before serving, let quiche come to room temperature, then gently reheat in a 325°F (165°C) oven until warmed through.\nThe Latest\nRecipes\nBreakfast & Brunch\nEaster\nVegetarian"
}