{
  "url": "https://www.seriouseats.com/asparagus-chorizo-fried-eggs-smoked-paprika-aioli-allioli-mayonnaise-recipe",
  "image_url": null,
  "tags": [
    "Fried Eggs",
    "Gluten-free Breakfast & Brunch",
    "Gluten-free Mains",
    "Stovetop Eggs",
    "Asparagus"
  ],
  "title": "Sautéed Asparagus With Chorizo, Fried Eggs, and Smoked-Paprika Allioli",
  "full_text": "Sautéed Asparagus With Chorizo, Fried Eggs, and Smoked-Paprika Allioli\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Smoked Paprika Allioli:\n1\nlarge\negg\n1\nteaspoon\nDijon mustard\n1\nteaspoon\nfresh\njuice\nfrom\n1\nlemon\n1\nmedium clove\ngarlic\n, minced\n1\nteaspoon\nmild (dulce)\nsmoked paprika\n1/2\ncup\ncanola oil\n1/4\ncup\nextra-virgin olive oil\nKosher salt\nand freshly\nground black pepper\nTo Assemble:\n2\ntablespoons\nextra-virgin olive oil\n4\nounces\nSpanish-style dry-cured chorizo\n, finely diced\n3/4\npound\nthin asparagus\n, trimmed and cut into 2-inch lengths\n2\nmedium cloves\ngarlic\n, finely sliced\n1/2\nteaspoon\nsherry\nor\nred wine vinegar\n2\nlarge\neggs\nDirections\nFor the Smoked Paprika Allioli:\n(see note) Combine egg, mustard, lemon juice, garlic, and smoked paprika in the bottom of a cup that just fits the head of an immersion blender. Carefully pour in canola oil. Place head of blender in bottom of jar. Start blender and slowly pull it up through the mixture. A thick, creamy emulsion should form. Transfer mixture to a bowl. Whisking constantly, slowly drizzle in olive oil. Season to taste with salt and pepper.\nTo Assemble:\nHeat olive oil and chorizo in a large cast iron or non-stick skillet over medium heat. Cook, stirring, until chorizo is crisp, about 3 minutes. Transfer chorizo and rendered fat to a small bowl. Return 2 teaspoons of fat to the skillet and heat over medium-high until shimmering. Add asparagus and cook, stirring and tossing, until bright green, about 1 minute. Add garlic and continue to cook until asparagus is tender and garlic is fragrant, about 45 seconds. Season to taste with salt and pepper, add vinegar and toss to coat. Transfer asparagus to serving plates.\nAdd remaining chorizo fat to skillet (there should be about 2 tablespoons) and heat over high heat until shimmering. Add eggs, season with salt and pepper, and cook, spooning the hot fat over the top of the eggs so they set rapidly. Continue to cook until whites are barely set and frizzled around the edges, but yolk is still runny. Top asparagus with fried eggs, chorizo bits, and chorizo fat. Serve with smoked paprika allioli.\nSpecial Equipment\nImmersion blender\n,\nlarge cast iron skillet\nor large\nnonstick skillet\nNotes\nYou can also make a cheaty allioli by whisking 1 minced garlic clove, 3/4 teaspoon smoked paprika, 1/2 teaspoon lemon juice, and 2 tablespoons extra-virgin olive oil into 1/4 cup prepared mayonnaise. If you don't have a hand blender, allioli can be made with a bowl. Combine the egg, mustard, lemon juice, garlic, and paprika in a bowl. Whisking constantly, slowly drizzle in the canola oil followed by the olive oil. Season to taste with salt and pepper.\nRead More\nBreakfast Tacos With Crispy Potatoes, Chorizo, and Fried Egg\n26 Asparagus Recipes to Put a Little Spring in Your Step\nPut an Egg on It: 18 Great Ways to Eat Fried or Poached Eggs\nFried Eggs\nGluten-free Breakfast & Brunch\nGluten-free Mains\nStovetop Eggs\nAsparagus"
}