{
  "url": "https://www.seriouseats.com/avgolemono-soup-greek-lemon-egg-chicken-soup",
  "image_url": null,
  "tags": [
    "Greek",
    "Stovetop Chicken",
    "Chicken",
    "Lemon",
    "White Rice"
  ],
  "title": "Avgolemono Soup (Greek Lemon-Egg Chicken Soup)",
  "full_text": "Avgolemono Soup (Greek Lemon-Egg Chicken Soup)\nJump to recipe\nCook\n90 mins\nActive\n25 mins\nTotal\n90 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nboneless, skinless chicken breast\nhalves\n(about\n1\npound\n;\n450\ng\n)\n2\nquarts\nhomemade\nchicken stock\nor\nlow-sodium\nbroth\n1/2\ncup\nrice\nor\norzo\n(about\n3 1/2\nounces\n;\n100\ng\n)\n5\nlarge\neggs\n1/4 to 1/2\ncup\n(\n60 to 120\nml\n)\nfresh lemon juice\nKosher salt\nMinced dill\n, for garnish\nDirections\nIn a 3-quart saucepan, combine chicken breast halves with chicken stock. Heat gently, using an instant-read thermometer to keep the temperature of the stock around 150°F (65°C). Cook until the chicken breast reaches an internal temperature of 145°F (63°C), about 1 hour, then remove from stock.\nWhen chicken is cool enough to handle, dice or shred the meat and set aside.\nAdd rice or orzo to stock and cook until just tender, about 20 minutes for rice and 13 minutes for orzo. Lower heat to a bare simmer.\nSerious Eats / Vicky Wasik\nMeanwhile, in a heatproof bowl, combine eggs with 1/4 cup (60ml) lemon juice and beat until lightly foamy.\nWhile whisking constantly, ladle in about 1/2 cup of the hot chicken broth into the eggs (it's okay if some rice or orzo comes along for the ride). Ladle in three or four more 1/2-cup additions of the hot chicken broth while whisking, then whisk the egg-broth mixture back into the broth in the saucepan. Season with salt.\nSerious Eats / Vicky Wasik\nCook the chicken soup over low heat, whisking and scraping the sides constantly, until thickened by the eggs. Taste soup, then, if desired, whisk in remaining lemon juice until your desired level of lemon flavor is reached. Season with salt again, if needed.\nAdd chicken meat, then ladle into bowls. Garnish with dill and serve.\nSpecial Equipment\n3-quart saucepan\n,\ninstant-read thermometer\nNotes\nIf you want, you can use two quarts of a\nbasic chicken soup\nwith the meat already in it, but without the finishing aromatics like carrot and celery. Simply thicken as described in the recipe with eggs, then flavor with lemon and finish with dill.\nRead More\nHow to Temper Eggs\nTomato Avgolemono Soup\nGreek\nStovetop Chicken\nChicken\nLemon\nWhite Rice"
}