{
  "url": "https://www.seriouseats.com/awendaw-souffle-grits-souffle-recipe-8698959",
  "image_url": "https://www.seriouseats.com/thmb/rH2GW0MZo9B8DXrYRwCxTMDfIc0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201209-awendaw-grits-souffle-jillian-atkinson-10-494587eb9bbc44639cb4a4792bc2dfe2.jpg",
  "tags": [
    "Cornmeal",
    "Soul Food & Southern",
    "Grits"
  ],
  "title": "Awendaw Soufflé",
  "full_text": "Awendaw Soufflé\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nSoftened\nunsalted butter\nor nonstick cooking spray, for greasing baking vessel(s)\n2\ntablespoons\n(\n18\ng\n)\nfine cornmeal\n, plus more for dusting ramekins\n5 whites plus 3 yolks from\n5\nlarge\neggs\n, separated\nOne\nrecipe\nsmooth and creamy grits\n(about\n1\npound\n;\n450\ng\ncooked grits\n), slightly cooled but still warm and smooth\n3/4\ncup\ngrated mild or medium\nCheddar cheese\n(\n2 1/4\nounces\n;\n65\ng\n)\n1\ntablespoon\nfinely sliced\nchives\n1\nteaspoon\nDiamond Crystal\nkosher salt\n(\n4\ng); for table salt use half as much by volume or the same weight\nDirections\nSet oven rack to middle position and preheat to 350°F (or 375°F if at high elevation). Grease four 12-ounce ramekins (or, alternatively, one 8- by 8-inch baking dish) generously with butter or cooking spray, making sure to cover bottoms and sides all the way up to the rims. Dust with an even coating of cornmeal, making sure to cover bottoms and sides all the way up to the rims; tap out excess cornmeal.\nSerious Eats / Jillian Atkinson\nIn a stand mixer fitted with the whisk attachment (or in a medium bowl and using a hand mixer), beat egg whites at low speed until foamy, then increase speed to high and beat until stiff peaks form (or, if at a high altitude, until soft peaks form). Set aside.\nSerious Eats / Jillian Atkinson\nFold the 2 tablespoons cornmeal into the grits along with the cheese, chives, and salt until well combined. Add egg yolks 1 at a time, stirring until each is fully incorporated before adding next.\nSerious Eats / Jillian Atkinson\nWorking in 3 additions, carefully fold beaten egg whites into the grits mixture just until well combined.\nSerious Eats / Jillian Atkinson\nThe resulting mixture should be light and airy, not heavy or thin.\nSerious Eats / Jillian Atkinson\nFill prepared ramekins 3/4 of the way full with the grits mixture. Set ramekins on a rimmed baking sheet.\nSerious Eats / Jillian Atkinson\nBake on middle rack until soufflés have risen and are just starting to brown on top, about 30 minutes. Remove carefully and serve immediately. The soufflés should remain risen for about 10 minutes after removing from the oven, and are just as good after they fall.\nSerious Eats / Jillian Atkinson\nSpecial Equipment\nFour 12-ounce ramekins or one 8-inch square baking dish; stand mixer or hand mixer\nNotes\nSoft peaks are essential for baking soufflé at high elevation. If the peaks are too stiff, the air in the egg whites will expand too quickly, causing an extremely high rise and then a very dramatic fall. The temperature also needs to be raised so that the egg, grits, and cornmeal all can begin to set more quickly and at the same time. Without raising the heat, the mixture won't rise but the inside will cook through, becoming much more dry.\nMake-Ahead and Storage\nAwendaw is best prepared right before serving.\nCornmeal\nSoul Food & Southern\nGrits",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/awendaw-souffl.webp?"
}