{
  "url": "https://www.seriouseats.com/bacalaitos-puerto-rican-cod-fish-fritters-recipe-8764149",
  "image_url": "https://www.seriouseats.com/thmb/B-9sJ_fG6DYu6rpgieQZO1o75fQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241210-SEA-Bacalaitos-MelatiCitrawireja-Hero3-18-fe1b52c71fc64f57bc6391d4c25e08b6.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Fried Seafood",
    "Fish",
    "Cod"
  ],
  "title": "The Crispy Fried Fish Fritters I'm Making for All My Friend's This Holiday Season",
  "full_text": "The Crispy Fried Fish Fritters I'm Making for All My Friend's This Holiday Season\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nResting Time\n5 mins\nTotal\n75 mins\nServes\n8\nto 10\nMakes\n17 Fritters\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\ndried,\nsalted cod fish\nor pollock (see notes)\n1\n/2\ncup\n(120ml) tap\nwater\nplus water for boiling the fish\n2\ncups\n(480ml) neutral cooking oil such a vegetable or canola oil f\nor frying\n2 cups (\n255\ng)\nall-purpose flour\n1\nteaspoon\nno-salt-added\nsazón spice\nblend (see notes)\n1\nteaspoon\nfreshly ground black pepper\n1\nteaspoon\ngarlic powder\n1\ntablespoon dried\nsofrito spice blend (see notes)\n4\nsprigs\nculantro or\ncilantro,\nleaves and tender stems finely chopped (see notes)\nDirections\nIn a large Dutch oven, add the dried salted cod and enough water to cover the fish by 1 inch. Cover and bring to a boil over medium-high heat, reduce heat to medium and simmer until the fish is slightly tender and starting to curl up at ends, about 15 minutes. After 15 minutes, break a small piece of the fish off and taste it to check for saltiness. If the fish is still excessively salty, use a spider skimmer to remove fish and transfer to a large plate, then discard water, return the fish to pot, and add fresh water to cover again. Bring back to a boil, simmer for 5 minutes, then taste again. Repeat again if necessary until desired salt level is achieved, then remove from heat (see notes). Use a spider skimmer or large slotted spoon to transfer the fish to large plate and reserve 2 cups of the bacalao water for the batter. Set fish and cooking liquid aside and allow to cool completely before proceeding.\nSerious Eats / Melati Citrawireja\nSet a wire rack in a rimmed baking sheet and line with paper-towels; set aside. In a 10-inch inch cast iron skillet, add the neutral cooking oil (oil should measure about 1 inch deep) and heat over medium heat until oil registers 350ºF (175℃).\nSerious Eats / Melati Citrawireja\nFor the fritter batter:\nWhile the oil is preheating, in a large bowl whisk together the flour, sazón spice blend, pepper, garlic powder, sofrito, and culantro or cilantro.\nSerious Eats / Melati Citrawireja\nPour reserved 2 cups bacalao water and 1/2 cup fresh water into the dry ingredients and whisk until fully combined. The mixture should have the consistency of a very loose pancake batter.\nSerious Eats / Melati Citrawireja\nUsing clean hands, flake the cooled rehydrated salted cod into the batter in nickel-size pieces, making sure to remove any bones you may find during the process. Stir to evenly combine.\nSerious Eats / Melati Citrawireja\nOnce oil is at temperature, working in batches of 3 at a time, carefully scoop 1/4 cup (60ml) portions of batter into the oil to form each fritter. Fry the fritters without touching until bottoms start to turn light golden and edges turn crisp, 2 to 3 minutes. At this time, the bacalaitos should release themselves from the skillet bottom. Using a thin metal spatula, carefully flip them over and continue to cook until golden brown all over, 2 to 3 minutes. Use a thin metal spatula to transfer to prepared paper-towel lined wire rack. Repeat frying the fritters in batches of 3, about 6 batches total, until all bacalaitos are made. Serve.\nSerious Eats / Melati Citrawireja\nVariations\nYou can substitute\nsalted fish with canned tuna, chopped shrimp, sliced sausage, or sweet corn kernels.\nSpecial Equipment\nLarge Dutch oven, 10-inch cast iron skillet, instant read thermometer, thin metal spatula, rimmed baking sheet, wire rack\nNotes\nBacalao is often sold in the the seafood department in many grocery stores and specialty Italian and Caribbean grocers, either in bags or a wooden box. It is also often labeled as salt cod, salted cod, or salted pollock. Either fish works great for this recipe.\nLook for a salt-free version of sazón, such as Goya or Badia brands, since the cod fish is salty enough.\nDried sofrito blends are available online at vendors such as Spice Tribe or Amazon. It’s also sometimes in the international section of grocery stores.\nInstead of using dried sofrito, 1 tablespoon of\nfresh sofrito\ncan be added to the batter when the liquids are added.\nCulantro is often sold in international markets as recao or sawtooth herb. Cilantro is a great substitute if you aren’t able to find it.\nThe 1/4 cup (2 ounces) of batter called for per fritter in the recipe will make fairly thin fritters with slightly dense, chewy centers. If you want a larger and thicker fritters, use 1/2 cup (4 ounces) batter for each fritter and cook about 3 minutes longer.\nMake-Ahead and Storage\nThe fritters can be held warm in a 200℉ (93℃) oven for up to 1 hour before serving.\nThe prepared batter can be covered and refrigerated for up to 1 day. The batter may separate, which is normal. Simply stir to recombine. Thin with additional water if needed to achieve a pancake batter–like consistency.\nSnacks & Appetizers\nThe Latest\nFried Seafood\nFish\nCod",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-crispy-fried-fish-fritters-im-making-for-all-my-friends-this-holiday-season.webp?"
}