{
  "url": "https://www.seriouseats.com/baccala-alla-napoletana-neapolitan-style-braised-salt-cod-5212995",
  "image_url": "https://www.seriouseats.com/thmb/CE10Ldmg1sTKFbEtr0N4NmwAJlU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-baccala-alla-napoletana-vicky-wasik-26-8579c581d3e743eda4367b9fb847da58.jpg",
  "tags": [
    "Christmas",
    "Italian",
    "The Latest"
  ],
  "title": "Baccalà alla Napoletana (Neapolitan-Style Braised Salt Cod With Tomatoes, Olives, and Capers)",
  "full_text": "Baccalà alla Napoletana (Neapolitan-Style Braised Salt Cod With Tomatoes, Olives, and Capers)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nSalt Cod Cure and Soak\n96 hrs\nTotal\n96 hrs 40 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salt Cod:\n2\npounds\n(\n910\ng\n) boneless, skinless\ncenter-cut cod fillets\n(see note)\nKosher salt\nFor the Sauce and Finishing:\n2\ntablespoons\n(\n30\nml\n)\nextra virgin olive oil\n2\nmedium\ngarlic cloves\n(\n10\ng\n), thinly sliced\nPinch\nred pepper flakes\nOne\n28-ounce (795 g) can\nwhole peeled tomatoes with juices\n, tomatoes roughly chopped\n1/2\ncup\n(\n70\ng\n)\npitted black olives\n, such as\nGaeta\nor\nKalamata\n1\ntablespoon\n(\n15\ng\n)\ncapers\n, drained\n1/4\nteaspoon\ndried oregano\n1/2\ncup\n(\n10\ng\n) tightly packed fresh\nparsley leaves\nand tender stems, roughly chopped\nDirections\nFor the Salt Cod (Four Days Before Serving):\nPat cod dry with paper towels.\nIn a tall-sided nonreactive container large enough to hold the cod fillets in a single layer, spread an even 1/2-inch layer of salt. Place cod fillets on top and cover them completely with salt, using your hands to pat salt around sides of cod to make sure it's completely covered. Cover and refrigerate for 48 hours, checking occasionally to discard any accumulated liquid in the container and adding extra salt as needed to keep cod completely covered.\nSerious Eats / Vicky Wasik\nOnce cod has cured for 48 hours, remove from salt and rinse fillets under cold water; discard salt and rinse out container. Return cod to container and cover with cold water. Cover and refrigerate for at least 36 hours and up to 48 hours, changing the water several times during that period (at least once every 12 hours). Drain salt cod and pat dry with paper towels. Using a sharp knife, cut fillets crosswise into six equal portions. Set aside.\nSerious Eats / Vicky Wasik\nFor the Sauce and Finishing:\nAdjust oven rack to middle position and preheat oven to 400°F (200°C). In a 12-inch skillet or sauté pan, combine olive oil and garlic, and cook over medium-low heat, stirring occasionally, until garlic just begins to turn pale golden, 2 to 3 minutes. Add red pepper flakes and cook until aromatic, about 30 seconds. Add tomatoes, olives, capers, and oregano. Bring to a simmer and cook, stirring occasionally, until sauce is thickened slightly, about 10 minutes.\nSerious Eats / Vicky Wasik\nAdd cod to skillet, nestling portions into the tomato sauce. Transfer skillet to the oven and cook until thickest parts of fillets register 130° to 135°F (54.5° to 57°C) on an instant-read thermometer, 8 to 10 minutes. Sprinkle with parsley, and serve.\nSerious Eats / Vicky Wasik\nNotes\nWhile we prefer the more delicate texture and salinity of homemade thick-cut salt cod fillets for this recipe, it can also be made with store-bought salt cod. Use 1 pound (455g) salt cod fillets, ideally thick, center-cut pieces. Rinse the cod and soak in water in a large container, changing the water every 12 hours, for 4 days. Cut cod into equal portions and proceed with step 3 of the recipe.\nMake-Ahead and Storage\nThe salt cod needs to be started four days before you plan to serve the dish. The finished dish is best enjoyed right away, but leftovers can be refrigerated in an airtight container for up to 2 days. Reheat gently before serving.\nChristmas\nItalian\nThe Latest"
}