{
  "url": "https://www.seriouseats.com/bacon-egg-mazemen",
  "image_url": "https://www.seriouseats.com/thmb/5GLFKzdk2mwmQ-MSqUE68vn9iPc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__03__20200316-carbonara-mazeman-sho-spaeth-2-7457f72c892e46beaefbeffd2bb02f60.jpg",
  "tags": [
    "Japanese",
    "Boiled Eggs",
    "Ramen",
    "Bacon",
    "Comfort Food"
  ],
  "title": "Bacon and Egg Mazemen Recipe",
  "full_text": "Bacon and Egg Mazemen Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n7 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nounces\n(\n85\ng\n) slab bacon, cut into lardons (small batons), or\nthick-cut bacon\n(about\n4\nslices\n)\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n3\ntablespoons\n(\n45\nml\n)\nsoy sauce\n2\nteaspoons\n(\n10\nml\n)\nmirin\n2\nteaspoons\n(\n10\nml\n)\nrice wine vinegar\n1\nteaspoon\n(\n4\ng\n)\nsugar\n2\nportions\nramen noodles\n, store-bought or\nhomemade\nTo Serve:\n2\nonsen tamago\n2\nscallions\n, thinly sliced\n1/8\nounce\n(\n4\ng\n)\nkatsuobushi\n(optional; see note)\nDirections\nIf using slab bacon, add lardons and vegetable oil to a 10-inch nonstick skillet set over medium heat. Cook, stirring occasionally, until fat has rendered and bacon is evenly browned, 3 to 5 minutes. Using a slotted spoon, transfer bacon to paper towel–lined plate and reserve rendered fat. Set aside.\nIf using sliced bacon, cook whole bacon slices until quite crisp\naccording to your preferred method\n. Transfer bacon slices to paper towel–lined plate and, when cool enough to handle, crumble into bite-size bits; reserve rendered bacon fat. Set aside.\nIn a large mixing bowl, combine soy sauce, mirin, vinegar, and sugar. Using a whisk or fork, stir mixture until sugar is completely dissolved, about 1 minute. Stir in 2 tablespoons (30ml) reserved bacon fat. Set aside.\nBring a small pot of water to a boil over high heat. Add noodles and cook according to package or recipe directions.\nWhen noodles are cooked, drain briefly, then add to bowl with soy sauce–bacon fat mixture. Using tongs or chopsticks, rapidly toss and stir noodles vigorously in liquid at the bottom of the bowl, until the liquid emulsifies and turns creamy, about 30 seconds.\nTo Serve:\nTransfer noodles to a serving bowl, and using a rubber spatula, scrape any remaining sauce over noodles. Garnish with onsen egg, scallions, and katsuobushi (if using). Serve immediately.\nSpecial Equipment\n10-inch\nnonstick skillet\nNotes\nKatsuobushi is a Japanese pantry staple, but it isn't strictly necessary for this recipe. However, it does add a smoky, savory complexity that makes the dish especially delicious. We prefer to use hana katsuobushi, where the shavings of the dried, fermented, smoked, and cured skipjack tuna are quite large and fluffy; to use them in this recipe, just crush them lightly before garnishing the bowl. You can also use the smaller shavings of katsuobushi in a pinch.\nIf you don't have katsuobushi around, you can omit it entirely, but you may want to add a drop or two more of vinegar or lemon juice to make up for the acidity katsuobushi provides to the finished dish.\nMake-Ahead and Storage\nMazemen is best eaten immediately.\nRead More\nVegetarian Mazemen With Beans and Egg\nHiyashi Chuka (Cold Ramen) With Shrimp, Ham, and Vegetables\nGuide to Ramen Varieties\nJapanese\nBoiled Eggs\nRamen\nBacon\nComfort Food"
}