{
  "url": "https://www.seriouseats.com/bacon-egg-and-cheese-breakfast-burrito",
  "image_url": "https://www.seriouseats.com/thmb/I9ax6n2ZbYXGKN0082OuqWvNJcU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__07__20200706-bacon-egg-potato-hash-breakfast-burrito-daniel-gritzer-21-295e5268b8884d879c93e0a8bbbbc215.jpg",
  "tags": [
    "Cheddar Cheese",
    "Scrambled Eggs",
    "Bacon",
    "Avocado",
    "Hash Browns"
  ],
  "title": "Bacon, Egg, and Cheese Breakfast Burrito Recipe",
  "full_text": "Bacon, Egg, and Cheese Breakfast Burrito Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n45 mins\nTotal\n35 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\neggs\nKosher salt\n1/4\ncup\n(\n60\nml\n)\ncanola\n,\nvegetable\n, or other neutral\noil\n1\npound\n(\n450\ng\n)\nRusset potatoes\n(about\n2\nmedium potatoes\n), peeled and cut into 1/2-inch dice\n1/2\nmedium (8-ounce; 225g\n)\nyellow onion\n, cut into 1/2-inch dice\nFreshly\nground black pepper\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n4\nrashers\ncrisply cooked bacon\n, broken into pieces\n2\nounces\n(\n55\ng\n)\nshredded cheddar cheese\n2\nlarge (10-inch)\nflour tortillas\n, warmed through on a dry griddle or cast iron pan\n2\ntablespoons\n(\n1\nounce\n;\n30\ng\n)\nsour cream\n, divided\n1/4\ncup\n(\n2\nounces\n;\n55\ng\n)\nguacamole\n, divided\nHot sauce\nof your choice (optional)\nDirections\nIn a medium bowl, whisk eggs with a large pinch of salt until homogenous and no visible egg whites remain. Set aside.\nIn a medium cast iron or stainless steel skillet, heat oil over medium-high heat until shimmering. Add potatoes, season with salt, and cook, stirring only occasionally, until beginning to brown, about 8 minutes. Lower heat to medium, stir in onion, and continue to cook, stirring occasionally to prevent scorching, until potatoes are golden and crisp and onions are browned and tender, about 10 minutes longer. Season with additional salt and pepper to taste and set aside.\nIn a medium nonstick skillet, melt butter over medium heat until foaming. Add eggs and cook, stirring constantly with a rubber spatula, until eggs have formed curds but are still runny, 1 to 2 minutes. Stir in cheese and continue to cook, stirring constantly, until cheese is melted and eggs are soft and fluffy, about 1 minute longer. Remove from heat.\nWorking with one just-warmed tortilla at a time, lay tortilla on a work surface. Spread 1 tablespoon (15g) sour cream in a thin, even layer on center of tortilla, leaving about 2 inches of border on either side and 3 inches of border above and below. Top with 2 tablespoons (30g) guacamole and spread it around on top of the sour cream. Arrange half the bacon on top of the guacamole.\nSerious Eats / Daniel Gritzer\nPile half the potatoes on top of the bacon, followed by half the eggs and cheese. Douse with as much hot sauce as you want.\nSerious Eats / Daniel Gritzer\nFold the tortilla sides in over the filling. Then roll the bottom flap of tortilla up over the filling, holding the sides tight as you roll. Continue rolling until the burrito is sealed. Repeat with remaining tortilla and filling ingredients. Serve right away.\nSerious Eats / Daniel Gritzer\nSpecial Equipment\nMedium cast iron skillet\n,\nmedium nonstick skillet\nMake-Ahead and Storage\nThe burrito is best prepared shortly before serving, though some components, like the guacamole and potatoes, can be prepared a few hours in advance and refrigerated until ready to use; make sure to press plastic wrap directly against the surface of the guacamole to prevent oxidation, and reheat and re-crisp the potatoes in a skillet before using.\nRead More\nBreakfast Burrito With Scrambled Egg, Chorizo, and Refried Beans Recipe\nBreakfast Tacos with Crispy Potatoes, Chorizo, and Fried Egg Recipe\nMigas With Scrambled Eggs, Tortilla Chips, & Chiles Recipe\n13 Burrito Styles Everyone Should Know\nCheddar Cheese\nScrambled Eggs\nBacon\nAvocado\nHash Browns",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bacon-egg-and-cheese-breakfast-burrito-recipe.webp?"
}