{
  "url": "https://www.seriouseats.com/bacon-wapped-shrimp-recipe-8766097",
  "image_url": "https://www.seriouseats.com/thmb/V2KyDOMyUBeWUgSMIAeAdC-_jJQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241218-SEA-BaconWrappedShrimp-RobbieLozano-Hero1-39-9370300bbea44fb48c12106e995e5534.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Bacon",
    "Holidays & Seasons",
    "Shrimp"
  ],
  "title": "The Must-Have Appetizer for Every Festive Occasion",
  "full_text": "The Must-Have Appetizer for Every Festive Occasion\nClose\nJump to recipe\nPrep\n25 mins\nCook\n18 mins\nTotal\n43 mins\nCook Mode\n(Keep screen awake)\nIngredients\n12\nraw peeled and deveined 13/15\nshrimp\n, tail on (about 11 to\n12\nounces\n; 312 to\n340\ng\n), see notes\n1/2\nteaspoon\nDiamond Crysta\nl kosher salt; for table salt use half as much by volume\n1/4\nteaspoon\nbaking soda\n2\nteaspoons\n(\n10\nml\n)\nextra-virgin olive oil\n1/4\nteaspoon\ngarlic powder\n1/4\nteaspoon\nsmoked paprika\n1/4\nteaspoon\nfreshly\nground black pepper\n12\nslices\ncenter-cut bacon\n(\n12\nounces\n;\n340\ng\n), see notes\n4\nteaspoons\n(\n28\ng\n)\nhot honey\n, such as Mike’s), see notes\n2\nteaspoons\n(\n10\nml\n)\nsoy sauce\nChopped\nfresh chives\n, for garnish (optional)\nLime wedges\n, for serving\nDirections\nSerious Eats / Robbie Lozano\nAdjust oven rack to middle position and preheat oven to 400°F (205°C) and position oven rack about 8 inches from broiler element. Line a 13- by 18-inch rimmed baking sheet with foil and set a wire rack inside; set aside. In a medium bowl, toss shrimp with salt and baking soda; set aside to brine at room temperature for at least 15 and up to 30 minutes.\nSerious Eats / Robbie Lozano\nMeanwhile, lay bacon slices in a single layer on wire rack in prepared baking sheet. Bake until bacon is partially rendered and just starting to brown, but still pliable, 12 to 20 minutes. Transfer bacon to a paper towel-lined plate to drain until cool enough to handle, about 3 minutes. Set rack and baking sheet aside.\nSerious Eats / Robbie Lozano\nAdd olive oil, garlic powder, paprika, and pepper to shrimp; toss to evenly coat. Starting from the tail-end, wrap 1 slice of bacon around each shrimp, slightly overlapping if necessary. Use a wooden pick to secure the bacon. Place bacon-wrapped shrimp on reserved rack in baking sheet.\nSerious Eats / Robbie Lozano\nIn a small bowl, whisk hot honey and soy sauce until smooth. Using a pastry brush, brush tops of shrimp lightly with honey mixture. Bake for 4 minutes (the bacon will begin to shrink slightly but you won't see much visual change other than that). Remove baking sheet from oven and turn oven to broil. Flip shrimp and brush again with honey mixture. Return to oven and broil until bacon is crisped on edges, 1 to 2 minutes. Flip shrimp again and brush with remaining honey mixture. Broil until bacon is crisped on edges, 1 to 2 minutes.\nSerious Eats / Robbie Lozano\nCarefully remove wooden picks, transfer shrimp to a serving plate, and garnish with chopped chives (if using). Serve immediately with lime wedges.\nSerious Eats / Robbie Lozano\nSpecial Equipment\nRimmed baking sheet, foil, wire rack, wooden toothpicks, pastry brush\nNotes\n13/15 refers to the number of shrimp per pound—shrimp with this label will have 13 to 15 shrimp per pound. You might also see these labeled as \"extra jumbo\" or \"colossal.\"\nMake sure to get regular thin, sliced bacon and not thick-cut rashers.\nIf you don't have hot honey, you can make your own by adding a couple drops of a vinegar-based hot sauce (such as Tabasco or another Louisiana-style sauce) to plain honey. Taste as you add it—you want it to be a little spicier than you think since the soy will dull the heat a little. Alternatively, make the honey–soy sauce mixture without the spice.\nMake Ahead and Storage\nBacon-wrapped shrimp do not store well and should be served immediately.\nSnacks & Appetizers\nThe Latest\nBacon\nHolidays & Seasons\nShrimp"
}