{
  "url": "https://www.seriouseats.com/bacon-wrapped-turkey-breast-cornbread-stuffing-recipe",
  "image_url": "https://www.seriouseats.com/thmb/CVZBpmnGpdILJSEYLwdGgtk7euE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__11__20131112-273476-bacon-wrapped-turkey-breast-9ac46307155d473ba66523e1726a6137.jpg",
  "tags": [
    "Turkey Breast",
    "Thanksgiving Stuffings",
    "Grilled Turkey",
    "Bacon",
    "Thanksgiving Dinner"
  ],
  "title": "Bacon-Wrapped Turkey Breast With Cornbread Stuffing Recipe",
  "full_text": "Bacon-Wrapped Turkey Breast With Cornbread Stuffing Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n60 mins\nBrining/Chilling Time\n2 hrs 15 mins\nTotal\n2 hrs 50 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nskinless, boneless turkey breasts\nFor the Brine:\n2\nquarts\nice cold\nwater\n1/3\ncup\nkosher salt\n1/4\ncup\nwhite sugar\nFor the Stuffing:\n2\ntablespoons\nbutter\n1/4\npound\nbreakfast sausage\n1/2\ncup\nfinely chopped\nyellow onion\n(about\n1\nsmall\nonion\n)\n1/3\ncup\nfinely chopped celery\n(about\n1\nsmall stalk\n)\n1/3\ncup\npeeled and finely chopped\nGranny Smith apple\n(about\n1/2\nmedium\napple\n)\n2\nteaspoons\nfinely chopped\nfresh sage leaves\n1\nteaspoon\nfinely chopped\nfresh thyme\n3\ncups\ncrumbled cornbread\n1/2\ncup\nchicken stock\n1\nteaspoon\nkosher salt\n1/2\nteaspoon\nfreshly ground black pepper\n24\nslices\nbacon\n(about\n1 1/2\npounds\n)\nDirections\nTo make the brine:\nCombine water, salt, and sugar in a large bowl and whisk to dissolve. Submerge turkey breasts in brine and place in refrigerator for 1 hour.\nTo make the stuffing:\nWhile turkey is brining, melt butter in a medium skillet over medium heat. When foaming subsides, add in sausage and cook until browned, about 5 minutes. Add in onions, celery, and apple and cook until softened, about 5 to 7 minutes, stirring occasionally. Place sausage mixture in a large bowl along with cornbread, chicken stock, sage, 1 teaspoon of salt, and black pepper. Mix to thoroughly combine.\nCreate a bacon weave by laying 6 strip of bacon out horizontally side by side. Interlace 6 more pieces of bacon vertically with horizontal bacon, as you would making a lattice-top pie. Repeat with remaining 12 slices of bacon to make a second weave.\nRemove turkey breasts from brine and pat dry with paper towels. Butterfly turkey breasts open and pound out to a square of even thickness. Lay each breast on one bacon weave. Spread half of the stuffing in an even thickness over each of the breasts, leaving about 1/2 an inch edge with no stuffing. Roll tightly into a cylinder with bacon on the outside. Wrap turkey rolls tightly in plastic wrap and place in the refrigerator to firm up, about 1 hour to overnight.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. Place turkey rolls on cool side of grill, cover, and cook until an instant read thermometer reads 150°F degrees when inserted into the thickest part of the turkey. If bacon has not colored or crisped sufficiently, quickly sear over hot side of grill until desired doneness. Remove from grill and let rest for 15 minutes. Cut turkey into 3/4-inch slices and serve immediately.\nSpecial Equipment\nGrill\nTurkey Breast\nThanksgiving Stuffings\nGrilled Turkey\nBacon\nThanksgiving Dinner"
}