{
  "url": "https://www.seriouseats.com/bacon-tomato-avocado-grilled-cheese-recipe",
  "image_url": "https://www.seriouseats.com/thmb/U_TPreaCmovkMJNoFLotDKq-IGs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__04__20130416-grilled-cheese-variations-2-18-e476a2383943440c8bea72ff64291f2f.jpg",
  "tags": [
    "American",
    "Stovetop",
    "Cheese",
    "Bacon",
    "Avocado"
  ],
  "title": "Grilled Cheese With Bacon, Tomato, and Avocado Recipe",
  "full_text": "Grilled Cheese With Bacon, Tomato, and Avocado Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n20 mins\nTotal\n30 mins\nServes\n1 sandwich\nCook Mode\n(Keep screen awake)\nIngredients\n2\nslices\nbacon\n, sliced in half crosswise\n2\nslices\nhearty white bread\n, such as Pepperidge Farm or Arnold\n2\nteaspoons\nbutter\n2\nslices\nAmerican or\ncheddar cheese\n2\nslices\nripe\nbeefsteak tomato\n1/2\nripe\navocado\n, thinly sliced\nKosher salt\nDirections\nPlace bacon in a large nonstick or cast iron skillet and cook over medium-low heat, turning occasionally, until crisp all over, about 8 minutes. Transfer bacon to a paper towel-lined plate and bacon fat to a small bowl.\nWipe out skillet and return to medium heat. Melt butter until foaming subsides. Add both bread slices and cook, swirling occasionally, until pale golden brown on bottom side, about 2 minutes.\nTransfer to a cutting board toasted-side-up. Place one cheese slice on top of one slice, followed by bacon, tomato, and avocado. Top with second cheese slice and close sandwich.\nAdd half of reserved bacon fat to skillet and heat over medium-low heat. Add sandwich and cook, swirling occasionally, until deep, even golden brown, about 5 minutes. Remove sandwich using a flexible metal spatula. Add the remaining bacon fat. Return sandwich to skillet cooked-side up. Season with salt. Cook, swirling occasionally, until second side is deep, even golden brown and cheese is thoroughly melted, about 5 minutes. Serve immediately.\nThis Recipe Appears In\nGrilled Cheese with Bacon, Tomato, and Avocado\nAmerican\nStovetop\nCheese\nBacon\nAvocado"
}