{
  "url": "https://www.seriouseats.com/bacon-cheese-and-kale-strata-5217605",
  "image_url": "https://www.seriouseats.com/thmb/mgX9b689LTfVlH8I0ew6zt7gC1M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Bacon-Cheese-and-Kale-Strata-Recipe-Hero-Horz-01-ee5df2bf3a004707b39924450360e9b0.jpg",
  "tags": [
    "Breakfast & Brunch",
    "American",
    "Baked Eggs",
    "Savory",
    "The Latest"
  ],
  "title": "Bacon, Cheese, and Kale Strata",
  "full_text": "Bacon, Cheese, and Kale Strata\nClose\nJump to recipe\nPrep\n55 mins\nCook\n100 mins\nCooling Time\n10 mins\nTotal\n2 hrs 45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(\n226\ng\n) supermarket-style\nFrench\nor\nItalian bread\n, or a\nquality white sandwich loaf\n, cut into 1-inch cubes\n4\nounces\n(\n115\ng\n; about\n1/2\ncup\n)\nthick-cut bacon\n, cut into 1/2-inch strips\n4\nounces\n(\n115\ng\n; about\n3\ncups\n)\ncurly kale\n, stemmed and roughly chopped\nDiamond Crystal\nkosher salt\n6\nlarge\neggs\n1\ncup\n(\n240\nml\n)\nwhole milk\n1\ncup\n(\n240\nml\n)\nheavy cream\n1 1/2\nteaspoons\nDijon mustard\n1\nteaspoon\nfresh thyme\n, finely chopped\n1/8\nteaspoon\nfreshly\nground black pepper\n1/8\nteaspoon\nfreshly grated\nnutmeg\nUnsalted butter\n, softened, for greasing baking dish\n4\nounces\n(\n115\ng\n; about\n1\ncup\n)\nshredded Gruyère cheese\nDirections\nAdjust oven rack to middle position and preheat oven to 275°F (135°C). Spread bread in an even layer on a rimmed baking sheet, and bake until completely dried, about 35 minutes, rotating baking sheet and stirring bread cubes several times during baking. Remove from oven and allow to cool.\nSerious Eats / Liz Voltz\nIn a 12-inch cast iron skillet, cook bacon over medium heat, stirring frequently, until golden and crisp, about 10 minutes. Using a slotted spoon, transfer bacon to a paper towel-lined plate to drain. Drain and discard all but 1 tablespoon (15ml) bacon fat from the skillet. Add kale, season lightly with salt, and cook, stirring occasionally, until kale is wilted but still vibrant in color, about 3 minutes. Remove from heat and allow to cool.\nSerious Eats / Liz Voltz\nIn a large bowl, whisk together eggs, milk, heavy cream, Dijon, thyme, 3/4 teaspoon salt, pepper, and nutmeg until well combined. Add the dried bread and fold gently to combine. Let soak until bread is softened and slightly puffed, folding occasionally with a flexible spatula, at least 15 and no more than 30 minutes.\nSerious Eats / Liz Voltz\nGrease an 8-inch square ceramic or anodized aluminum baking dish (see note) with butter. Using a slotted spoon, add half of the soaked bread to the prepared baking dish, spreading it in an even layer. Top with half of the kale, half of the bacon, and half of the Gruyère. Repeat with remaining bread, kale, bacon, and cheese. Pour any remaining custard over the layered strata. Using a flexible spatula, gently press down the top of the strata so that all the layers are submerged in the custard, but take care not to compress the bread. Cover tightly with aluminum foil. Allow strata to stand at room temperature for 30 minutes. Meanwhile, increase oven temperature to 325°F (160°C).\nSerious Eats / Liz Voltz\nBake strata until cheese is slightly melted, about 20 minutes. Remove foil, return baking dish to oven and continue to bake until strata is puffed and the center no longer jiggles when shaken, about 30 minutes. Remove from oven.\nSerious Eats / Liz Voltz\nAdjust oven rack to 6 inches below broiler element and preheat broiler on high. Broil until surface of strata is lightly browned in spots, about 2 minutes. Transfer to heatproof surface and allow to cool for 10 minutes. Cut into portions and serve.\nSerious Eats / Liz Voltz\nSpecial Equipment\nRimmed baking sheet\n, 8-inch square\nceramic baking dish\n, slotted spoon,\nrubber spatula\nNotes\nBefore broiling the strata, please check that your baking dish is broiler-safe. Many baking dishes produced by popular brands, such as Pyrex, are not, so don’t take anything for granted and please refer to the manufacturer’s website for more information. Bear in mind that the timing may vary depending on the cookware involved, so pay close attention to the visual cues instead.\nThis recipe can be doubled and baked in a 9- by 13-inch baking dish.\nMake Ahead and Storage\nBread cubes can be dried up to 4 days in advance. Spread dried bread on a sheet pan, cover loosely with aluminum foil, and store at room temperature.\nThe cooked bacon and kale can be refrigerated separately in airtight containers for up to 4 days.\nAfter covering the uncooked strata with foil, it can be refrigerated overnight. When ready to bake, remove the strata from the refrigerator and let sit at room temperature for 1 hour; this will help the strata bake more evenly.\nLeftovers can be stored in the baking dish covered with foil and refrigerated for up to 5 days. Reheat in the microwave in 45-second intervals.\nTo freeze, wrap individual portions tightly in plastic, transfer to a resealable freezer bag, and store in the freezer for up to 3 months. Allow to thaw in the refrigerator overnight before reheating.\nBreakfast & Brunch\nAmerican\nBaked Eggs\nSavory\nThe Latest"
}