{
  "url": "https://www.seriouseats.com/bacon-egg-and-cheese-sandwich-recipe-8602392",
  "image_url": "https://www.seriouseats.com/thmb/Jw51qbtg89WKmYMX3F-bHSDHPG0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240301-SEA-BEC-AmandaSuarez-hero-6f228860d4b544799961b97935ce08f6.jpg",
  "tags": [
    "Breakfast Sandwich",
    "The Latest",
    "American",
    "Bacon",
    "Eggs"
  ],
  "title": "Bacon, Egg, and Cheese Sandwich",
  "full_text": "Bacon, Egg, and Cheese Sandwich\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nTotal\n45 mins\nServes\n1\nMakes\n1 Sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\n6 slices\nthick-cut bacon\n(about 6 ounces;\n170\ng\n)\n1 tablespoon (\n14\ng\n)\nunsalted butter\n2\nlarge eggs\n(\n110\ng\n)\n2\nslices\namerican cheese\nKosher\nsalt\nand f\nreshly ground black pepper\n1\nkaiser roll\nor bulkie\nroll\n(see notes)\n1\ntablespoon\nmayonnaise, optional\nDirections\nAdjust oven rack to middle position and heat oven to 400°F (205°C). Line a rimmed baking sheet with aluminum foil. Cut 3 slices of bacon in half crosswise and set aside.\nSerious Eats/Amanda Suarez\nPlace 3 whole slices of bacon side-by-side on the prepared baking sheet running parallel to counter edge, forming three rows. Fold over half of the center bacon strip halfway. Place 1 half-slice bacon across the 1st and 3rd row, running perpendicular to counter edge, then unfold the center slice over top the perpendicular strip. The half-slice should be woven between every other slice. Fold over 1st and 3rd whole slices until flush with perpendicular half-slice and lay another perpendicular half-slice of bacon across the center row. Repeat, alternating between folding back the center then the 1st and 3rd strips and laying remaining half strips across until all 6 half-slices of bacon have been used to create an interwoven pattern.\nSerious Eats/Amanda Suarez\nBake bacon until crisp, 25 to 35 minutes. Using 2 spatulas, transfer bacon, flat bottom side up, to a paper-towel lined plate to drain. Pour rendered bacon fat into a small bowl and set aside (you should have about 2 tablespoons/30g). Once bacon is cooled, use a sharp knife to cut bacon into 2 equal squares; set aside.\nSerious Eats/Amanda Suarez\nIn a small bowl, use a fork to beat eggs until they are just combined but still streaky, about 10 seconds. In a 10-inch nonstick skillet, melt butter over medium heat until it starts to foam and sizzle gently. Pour eggs into skillet, and tilt pan to distribute eggs evenly. Cook eggs, gently pushing sides of egg toward center, tilting pan to fill any gaps, until eggs are nearly cooked but surface is barely wet, 60 to 90 seconds. Reduce heat to low and place one slice of cheese in center of eggs. Using a flat spatula, with the cheese as a guide, fold edges of eggs over cheese, creating a square packet. Gently press eggs to adhere to cheese, then carefully flip the packet over. Place remaining cheese slice on top of eggs, cover, and cook until cheese is melted, about 60 seconds longer. Season with salt and pepper to taste. Transfer eggs to plate with bacon. Wipe skillet clean with paper towels.\nSerious Eats/Amanda Suarez\nIn now-empty skillet, heat 1 tablespoon reserved bacon fat over medium heat until shimmering. Place one bread half in pan, cut-side down and cook, pressing and swirling bread around pan with hand, until bread is golden brown and evenly toasted, 60 to 90 seconds. Transfer toasted bread to cutting board, toasted side up. Repeat with remaining 1 tablespoon bacon fat and bread half.\nSerious Eats/Amanda Suarez\nTo Assemble:\nSpread mayonnaise, if using, evenly over both toasted bun halves. Place bacon squares on bottom bun and top with egg-cheese packet. Top with bun half and gently press to adhere. Wrap sandwich in foil sandwich wrap and let sit for up to 5 minutes. Serve.\nSerious Eats/Amanda Suarez\nSpecial Equipment\nRimmed baking sheet\n,\n10-inch nonstick skillet\n, foil sandwich wrap or aluminum foil\nNotes\nThis recipe was developed and tested with the recommended kaiser and bulkie roll, but feel free to substitute with your preferred bread.\nThis recipe can be scaled up to make more sandwiches. If you're making more than one sandwich, consider cooking the egg-cheese squares while the bacon finishes cooking. (Leaving the sandwiches wrapped for 2 to 3 minutes will reheat the eggs and cheese.)\nThere is no salt in the eggs; this is intentional, as the bacon lends the sandwich plenty of savory flavor.\nMake-Ahead and Storage\nThe bacon weave can be shaped, covered, and refrigerated raw overnight.\nBreakfast Sandwich\nThe Latest\nAmerican\nBacon\nEggs",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bacon-egg-and-cheese-sandwich.webp?"
}