{
  "url": "https://www.seriouseats.com/baechu-kimchi-5184676",
  "image_url": "https://www.seriouseats.com/thmb/m16sray_HxYpJebVbXMxv906bhk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210527-baechu-kimchi-vicky-wasik-seriouseats-seriouseats-3-18a2d6d7d1d74a7a82cb13ed350218be.jpg",
  "tags": [
    "Korean",
    "Vegetable Sides",
    "Cabbage",
    "The Latest"
  ],
  "title": "Baechu Kimchi (Napa Cabbage Kimchi)",
  "full_text": "Baechu Kimchi (Napa Cabbage Kimchi)\nClose\nJump to recipe\nPrep\n25 mins\nCook\n5 mins\nFermentation Time\n132 hrs\nTotal\n132 hrs 30 mins\nServes\n48 servings\nMakes\n3 quarts\nCook Mode\n(Keep screen awake)\nIngredients\nFor Brining the Cabbage:\n1 head (about\n3\npounds\n; 1.3kg)\nNapa cabbage\n2\nquarts\n(1.9L; 1.9kg) filtered or\nbottled water\n4 3/4 ounces (\n135\ng\n; about 2/3 cup plus 1 1/2 teaspoons) Diamond Crystal kosher salt or\nsea salt\nFor Making the Kimchi:\n1 cup (\n110\ng\n) coarse ground\ngochugaru\n(Korean chile powder)\n3 tablespoons (\n24\ng\n)\nglutinous rice flour\n2 tablespoons (\n30\ng\n)\nsugar\n1/2 cup (\n120\nml\n)\nfish sauce\n2 tablespoons (\n40\ng\n) saeujeot (\nKorean salted shrimp\n), with its brine, minced\n8\ngarlic cloves\n(\n40\ng\n), finely chopped\nOne 2-inch piece (about 1 ounce;\n30\ng\n)\nfresh ginger\n, peeled and finely chopped\n1 small\nAsian pear\n(about 6 ounces;\n170\ng\n), peeled, cored, and cut into 1/4- by 1/4- by 2-inch batons (yielding about 3 1/2 ounces; 100g total)\n4\nounces\n(115g)\ndaikon radish\n, peeled and cut into 1/4- by 1/4- by 2-inch batons (yielding about 3 1/2 ounces; 100g total)\n1\nmedium\ncarrot\n(about 4 ounces; 115g), peeled and cut into 1/4- by 1/4- by 2-inch batons (yielding about 3 1/2 ounces; 100g total)\n16\nscallions\n(about 4 ounces;\n115\ng\ntotal), root end trimmed and discarded, scallions halved lengthwise and cut crosswise into 2-inch pieces\nDirections\nFor Brining the Cabbage:\nRemove and discard any blemished outer leaves from cabbage head. Using a sharp knife, trim root end, then cut through bottom quarter of cabbage head lengthwise, as if to halve it, but stopping where core meets leafy part. Using your hands, tear cabbage head in half lengthwise. Repeat process by cutting each half through core, stopping where core meets leafy part, and use your hands to tear cabbage head lengthwise into quarters.\nSerious Eats / Tim Chin\nSerious Eats / Tim Chin\nIn a large bowl, whisk together water and salt until salt is fully dissolved, about 45 seconds. Add cabbage, arranging pieces cut side up. Cover surface of brine with sheet of plastic wrap or parchment paper, then place a weight on top to keep cabbage as submerged as possible (\nChef's press weights\n, fermentation weights, or a large bowl filled with water all make good weights). Cabbage may not be fully submerged at the beginning of the brining process; as water expels from the cabbage during first hour of brining, volume of brine will increase, submerging cabbage pieces. Set aside to brine, maintaining an ambient temperature between 55°F (13°C) and 75°F (24°C), for at least 12 hours and up to 14 hours, flipping cabbage quarters twice over the course of brining.\nSerious Eats / Tim Chin\nRemove cabbage from brine, and working with one quarter head at a time, rinse under cold water; discard brine. Using your hands, squeeze cabbage to wring out excess water (cabbage should be quite limp at this point), and set pieces aside on a rimmed baking sheet, cut side up.\nSerious Eats / Tim Chin\nFor Making the Kimchi:\nIn a small bowl, stir together gochugaru and 1/2 cup (120ml) warm water until well combined; set aside to bloom (gochugaru will brighten in color). In a small saucepan, combine rice flour, sugar, and 1 cup (240ml) water, and whisk to combine. Bring to a simmer over medium heat, whisking constantly to prevent mixture from scorching and forming lumps, and cook until mixture thickens to a paste, 3 to 4 minutes. Remove from heat, stir in bloomed gochugaru, and transfer to a medium bowl. Set aside until cool enough to touch, 8 to 10 minutes.\nSerious Eats / Tim Chin\nOnce cooled, stir in fish sauce, salted shrimp, chopped garlic, and ginger until thoroughly combined. Add Asian pear, daikon, carrot, and scallions. Using clean hands, gently mix until thoroughly combined, and vegetables are evenly coated with paste mixture, 3 to 4 minutes.\nSerious Eats / Tim Chin\nWorking with one piece of cabbage at a time, starting with outermost layer of leaves and working in toward the core, use your hands to evenly spread kimchi paste mixture over each cabbage leaf, making sure to thoroughly coat the core as well. Repeat seasoning process with remaining pieces of cabbage.\nSerious Eats / Tim Chin\nWorking with one piece of cabbage at a time, cut side up, roll tightly into a compact parcel, starting from the core and working toward the top, so that outer layer of leaves is wrapped around quarter head of cabbage. Transfer to a non-reactive 1-gallon container, such as a fermentation crock or glass canning jar. Repeat rolling process with remaining pieces of cabbage, nestling them tightly into the container, and pressing down to eliminate air pockets.\nSerious Eats / Tim Chin\nUsing a rubber spatula, scrape any leftover kimchi paste and accumulated juices from the bowl and baking sheet over the cabbage. Press down on mixture to eliminate air pockets, cover surface of mixture with plastic wrap, pressing gently to ensure full contact, and weigh down with fermentation weight. Seal container with airlock lid, if using, following manufacturer's instructions.\nSerious Eats / Tim Chin\nStore kimchi in dark area away from sun and let ferment, maintaining an ambient temperature between 55°F (13°C) and 75°F (24°C) for 3 days; check mixture daily for signs of gas formation (this is a good sign). After first 24 hours, vegetables should have released a good deal of moisture; using a clean spoon, press down on cabbage to submerge in liquid.\nSerious Eats / Tim Chin\nAfter 3 days, transfer container to refrigerator and continue to ferment for at least 2 more days before eating. After 5 total days of fermentation, begin tasting kimchi daily until it has reached desired flavor. Kimchi will continue to slowly ferment while refrigerated, becoming more \"ripe\" in flavor over time. Properly stored, baechu kimchi can be refrigerated for up to 2 months. \"Young\" baechu kimchi is ideal for serving as a banchan, whereas older kimchi is better suited for cooking, as in dishes like\nkimchi jjigae\n.\nSerious Eats / Tim Chin\nTo serve as a banchan, transfer one (or more) of the cabbage parcels to a cutting board, and unroll. Using a sharp knife, remove core, and cut cabbage into 2-inch pieces. Divide between small individual serving dishes, spoon liquid from fermentation container over top, and sprinkle with toasted sesame seeds. Serve.\nSerious Eats / Tim Chin\nKorean\nVegetable Sides\nCabbage\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/baechu-kimchi-napa-cabbage-kimchi.webp?"
}