{
  "url": "https://www.seriouseats.com/baja-fish-tacos-recipe-8682282",
  "image_url": "https://www.seriouseats.com/thmb/CW-G1gz5SBWfiIT2HzLmcyTe_4Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240720-Baja-Fish-Tacos-Qi-Ai-hero-01-tray-SEA-52ac6ca81d9241df93ca4712614fe14b.jpg",
  "tags": [
    "Tacos",
    "The Latest",
    "Mexican",
    "Fish",
    "Cod"
  ],
  "title": "Baja Fish Tacos",
  "full_text": "Baja Fish Tacos\nClose\nJump to recipe\nPrep\n45 mins\nCook\n30 mins\nTotal\n75 mins\nServes\n4\nMakes\n12 Tacos\nCook Mode\n(Keep screen awake)\nIngredients\nMayonnaise Dressing:\n1/2\ncup\n(\n120\nml\n)\nmayonnaise\n1/2\ncup\n(\n120\nml\n)\nketchup\nColeslaw:\n2\ntablespoons\n(\n30\nml\n)\nmayonnaise\n2\ntablespoons\n(\n30\nml\n)\nMexican crema\n1/4\nteaspoon\nfreshly\nground black pepper\nKosher salt to taste\n1 1/2\ncup\nshredded\npurple cabbage\n(\n110\ng\n; from\n1\nsmall head\nof cabbage)\n1\nmedium\ncarrot,\npeeled and grated (\n113\ng\n; about\n3/4\ncup\n)\n1/4\ncup\n(\n30\ng\n)\nraisins\nFor the Fried Fish:\n2\nquarts\n(\n1.9\nL\n)\nvegetable oil\nfor frying, plus more if needed\n1 1/2\npounds\n(\n680\ng\n) firm\nwhite fish\n, (such as\ncod\n,\nhaddock\n,\nflounder\n,\ntilapia\n, or\nswordfish\n), cut crosswise in into roughly 2-inch-wide fingers\n1/2\ncup\n(\n120\nml\n)\nwhite vinegar\n2\ntablespoons\nkosher salt\n1\ncup\nstore-bought\npancake mix\nor\nhomemade\n(\n150\ng\n)\n2/3\ncup\nall-purpose flour\n(\n3\nounces\n;\n85\ng\n)\n1\ntablespoon\ndried onion flakes\n1\ntablespoon\ngarlic powder\n1\nteaspoon\nfreshly\nground black pepper\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt use half as much by volume\n2\ncups\n(\n480\nml\n)\nplain seltzer\n1\nlarge\negg\n1\nteaspoon\nyellow mustard\nFor the Serrano Salsa:\n5-8\nserrano chiles\n, stemmed (see note)\n1/2\nsmall\nonion\n(\n3\nounces\n;\n85\ng\n)\n1\nmedium clove\ngarlic\n, peeled\n2\ntablespoons\nneutral\noil\nsuch as\ncanola\nor\nvegetable oil\n1\nt\neaspoon\nDiamond Crystal\nkosher salt;\nif using table salt use half as much by volume\nFor the Tacos:\nTwelve\n6-inch\ncorn tortillas\n, warmed (see note)\nPrepared mayonnaise dressing\n(from recipe above) or\nchipotle mayonnaise\nPrepared serrano salsa\n(from recipe above)\nPico de Gallo\nAvocado\n, cubed\nLime wedges\nfor serving\nDirections\nFor the mayonnaise dressing\n: In a small bowl, whisk mayonnaise and ketchup to combine; set aside until ready to serve.\nSerious Eats / Qi Ai\nFor the coleslaw\n: In a large bowl, whisk the mayonnaise, Mexican crema, and black pepper to combine. Add the cabbage, carrot, and raisins, and toss to combine. Season to taste with salt; set aside or refrigerate until ready to serve.\nSerious Eats / Qi Ai\nAdd oil to a large Dutch oven or wok (It should measure at least 2-inches deep) and heat over medium-high heat until it reaches 375°F (190°C). Line a wire rack with paper towels and set in a rimmed baking sheet; set aside.\nSerious Eats / Qi Ai\nFor the fish:\nWhile heating the oil, in a large non-reactive bowl, toss fish sticks with kosher salt and vinegar and let sit at room temperature until the surface of the translucent fish begins to whiten, 5 to 10 minutes, then immediately drain the fish and place into the now-empty large bowl. (Do not let fish sit in vinegar for longer than 10 minutes.)\nSerious Eats / Qi Ai\nWhile the fish is marinating, in a medium bowl, combine the pancake mix, flour, onion flakes, garlic powder, ground pepper, and salt. Add the egg, soda water, and yellow mustard and whisk until batter is smooth. Pour the batter over the fish sticks and gently toss to coat the fish sticks evenly.\nSerious Eats / Qi Ai\nFor the serrano salsa:\nOnce the oil reaches 375℉, carefully add the serrano chiles, onion, and garlic and fry until the onion and garlic beging to soften and the chiles skin is crackly and browned, removing with a spider skimmer or slotted spoon as they finish cooking. This will take about 2 minutes for the garlic and onion, and 4 to 6 minutes for the chiles. Monitor and maintain oil temperature at 375℉.\nSerious Eats / Qi Ai\nIn a food processor, blend chiles, garlic, and onion. While blending, slowly add 2 tablespoons of oil and 1 teaspoon kosher salt, until the mixture forms a creamy emulsion. Season with additional salt to taste; set aside until ready to serve.\nSerious Eats / Qi Ai\nFor frying the fish:\nOnce oil returns to 375℉, working with 6 to 8 pieces fish per batch, remove fish from batter (making sure each piece is well coated), allowing excess to drip back into the bowl, and using tongs or your hands, add one at a time to the hot oil, briefly dragging fish along the surface of the oil to prevent sticking. Adjust burner, as needed, to maintain oil oil temperature between 350 and 375℉. Fry fish, stirring as little as possible to not dislodge the delicate batter, if needed, gently flip and separate fish sticks for even frying, until golden brown and bubbling begins to subside, 3 to 7 minutes. If they are frying unevenly, you can spoon hot oil over the frying fish. Using a spider skimmer or large slotted spoon, carefully remove fish from oil and transfer to the prepared wire rack. Return oil to 375℉ and repeat frying the fish in batches of 6 to 8 fish sticks at a time.\nSerious Eats / Qi Ai\nTo assemble:\nTo assemble 1 taco, spread a warmed tortilla with prepared mayonnaise dressing or chipotle mayo, add fried fish, and serve with an array of toppings options: the prepared coleslaw, prepared serrano salsa, pico de gallo, lime, and avocado.\nSerious Eats / Qi Ai\nBaja Shrimp Tacos Variation\nSubstitute 1 ½ pounds peeled and deveined large shrimp (21-25 or 26-30 count) for the fish. Omit the vinegar brine step and instead toss the shrimp with 1/2 teaspoon kosher salt , 1/3 teaspoon freshly ground black pepper, and 1/2 teaspoon garlic powder before transferring to the batter in step 5.\nSpecial Equipment\nBlender or food processor, large Dutch oven or wok, Large colander or wire rack, large slotted spoon or spider skimmer\nNotes\nAny firm, mild white fish will work well in this recipe, but swordfish is traditional for this recipe. Tilapia is also a great option and is commonly used in Baja.\nFor a less spicy salsa, halve the serrano chiles and remove their seeds and ribs before frying. I recommend wearing plastic gloves when handling the chiles and thoroughly washing your hands after handling.\nTo warm the tortillas, wrap them in a clean kitchen towel and microwave until warm and pliable, 15 to 30 seconds. Alternatively, they can be warmed in a griddle, comal, or cast-iron pan set over medium-high heat. Or using tongs, hold 1 tortilla at a time over the flame of a gas stove, turning constantly until softened and lightly charred. Once warmed, wrap the tortillas in a clean kitchen towel until ready to serve.\nMake-Ahead and Storage\nThe coleslaw can be made ahead and refrigerated in an airtight container for up to 3 days.\nThe serrano salsa can be stored in an airtight container and refrigerated for up to 1 week.\nTacos\nThe Latest\nMexican\nFish\nCod",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/baja-fish-tacos.webp?"
}