{
  "url": "https://www.seriouseats.com/bakewell-tart-recipe-11751156",
  "image_url": "https://www.seriouseats.com/thmb/VMDUI9HEoNPEvOwe_ACF9qpybAo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250606-SEA-BakewellTart-DebbieWee-HERO-94f4ac31a9b44862a7e168a61962be2c.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Baking",
    "Desserts",
    "British"
  ],
  "title": "This Classic British Tart Is Sweet, Nutty, and Steeped in History—Here's How to Bake It Well",
  "full_text": "This Classic British Tart Is Sweet, Nutty, and Steeped in History—Here's How to Bake It Well\nClose\nJump to recipe\nPrep\n20 mins\nCook\n85 mins\nChilling and Cooling Time\n2 hrs\nTotal\n3 hrs 45 mins\nServes\n8\nMakes\n1 9-inch tart\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pastry:\n192\ng\nall-purpose flour\n(\n6 3/4\nounces\n;\n1 1/2\ncups\n)\n8\ng\n(\n1\ntablespoon\n)\nconfectioners sugar\n113\ng\nunsalted butter\n(\n4\nounces\n;\n8\ntablespoons\n), cut into 1/2-inch pieces\n2\nlarge\negg yolks\n(\n1 1/4\nounces\n;\n36\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nice water\nFor the Filling:\n135\ng\nunsalted butter\n(\n4 3/4\nounces\n;\n9 1/2\ntablespoons\n), at room temperature\n135\ng\ngranulated sugar\n(\n4 3/4\nounces\n;\n2/3\ncup\n)\n2\nlarge\neggs\n1\nteaspoon\nalmond extract\n135\ng\nblanched\nalmond flour\n(\n4 3/4\nounces\n;\n1 1/3\ncups\n)\n100\ng\nseedless\nraspberry jam\n(\n3 1/2\nounces\n;\n1/3\ncup\n)\n25\ng\nsliced blanched\nraw almonds\n(about\n3/4\nounces\n;\n1/4\ncup\n)\nFor the Icing:\n50\ng\nconfectioner's sugar\n(\n1 3/4\nounces\n;\n1/2\ncup\n)\n2\nteaspoons\nwater\n1/4\nteaspoon\nalmond extract\nDirections\nFor the Pastry:\nIn a large bowl, whisk flour and confectioners' sugar to combine. Add butter to flour mixture and toss to evenly coat. Using your fingertips, pinch and flatten butter, then rub it between fingertips until a sandy mixture forms, 3 to 4 minutes. (It should resemble coarse breadcrumbs with some pea-size pieces still visible but no large chunks of butter remaining.)\nSerious Eats / Debbie Wee\nIn a small bowl, whisk egg yolks and ice water. Drizzle egg and water mixture over flour mixture and use a flexible spatula or dough scraper to incorporate until large clumps form. Using your hands, gently press and squeeze to bring dough together, about 1 minute more. Do not overwork the dough; it should hold together but still feel slightly crumbly, not wet or sticky. If pastry seems too dry to roll, add ice water 1/2 teaspoon at a time, until dough holds together. Flatten into a 7-inch disc. Wrap in plastic wrap and refrigerate until cold to the touch, about 30 minutes.\nSerious Eats / Debbie Wee\nOn a generously floured surface, roll dough to a thickness of 1/8 inch, approximately 10 inches wide, adding more flour to the rolling pin or surface as needed to prevent the dough from sticking. Gently transfer dough to a 9-inch fluted tart pan with a removable bottom. With lightly floured fingertips, press dough into bottom edges and fluted sides of the pan; using a pastry brush, dust off any excess flour. Do not trim.\nSerious Eats / Debbie Wee\nRefrigerate until dough is firm to the touch, about 15 minutes. With a sharp paring knife, trim away excess dough from the edges so that the dough is level with the top of the pan. Freeze until firm to the touch, about 15 minutes.\nSerious Eats / Debbie Wee\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Place a crumpled sheet of parchment paper inside chilled shell and fill to the brim with dried beans, sugar, raw rice, or baking weights. Bake crust until edges are firm and very lightly golden, 15 to 20 minutes. Carefully remove parchment and baking weights, set aside, and continue baking tart until golden brown all over, 10 minutes more. Let tart shell cool in pan on wire rack until warm but no longer hot to the touch, about 10 minutes.\nSerious Eats / Debbie Wee\nMeanwhile, prepare the filling:\nIn the bowl of a stand mixer fitted with the paddle attachment or using a large bowl and an electric hand mixer, beat butter and sugar on low speed to incorporate. Increase to medium-high speed and beat until smooth and creamy, about 3 minutes. Add eggs and almond extract and mix until fully combined, scraping halfway through, 1 to 2 minutes more. (The mixture may look curdled at this point; this is normal.) Using a flexible rubber spatula, gently fold in the almond flour until just combined. Filling will resemble a thick, slightly lumpy paste.\nSerious Eats / Debbie Wee\nIn a small bowl, whisk raspberry jam until smooth. Using a small offset spatula, spread jam from side to side over bottom of tart shell to evenly cover. Dollop almond filling over jam, then use an offset spatula to cover completely. Sprinkle with sliced almonds.\nSerious Eats / Debbie Wee\nSet pan on a 13- by 18-inch rimmed baking tray and bake until filling is puffed, deep golden brown, and firm to the touch, about 45 minutes. (If tart begins to darken too quickly, loosely tent with foil and continue baking.) Let cool in pan on wire rack until tart is room temperature, 45 minutes to 1 hour.\nSerious Eats / Debbie Wee\nMeanwhile, prepare the icing:\nIn a small bowl, whisk confectioners' sugar, water, and almond extract until smooth. Drizzle icing over tart. Slice and serve.\nSerious Eats / Debbie Wee\nSpecial Equipment\nWhisk, dough scraper; rolling pin; 9-inch fluted tart pan with removable bottom; dried beans, raw rice, or baking weights; offset spatula; hand or stand mixer; 13-by-18-inch rimmed baking sheet\nNotes\nFor a simpler topping:\nOmit piped icing and dust cooled tart with confectioners' sugar.\nTo decorate with fresh fruit:\nBefore scattering sliced almonds, dot top of unbaked tart with 60 g (1/2 cup; about 15 berries) fresh raspberries, thoroughly dried with a paper towel to remove excess moisture.\nMake-Ahead and Storage\nYou can prepare the pastry up to 24 hours in advance. Wrap in plastic wrap and refrigerate until ready to use. Let stand at room temperature for 10 minutes, or until soft enough to roll.\nOnce cooled, finished Bakewell tart can be wrapped in foil or stored in an airtight container at room temperature for up to 3 days. To freeze Bakewell tart, wrap cooled tart in a layer of plastic wrap, followed by a layer of foil. Freeze for up to 3 months. Thaw at room temperature.\nThe Latest\nRecipes\nBaking\nDesserts\nBritish"
}