{
  "url": "https://www.seriouseats.com/baked-chicken-spaghetti-pie",
  "image_url": "https://www.seriouseats.com/thmb/qYQIIRmIz0M54pTJRbHQpE1gg6w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__02__20140213-baked-spaghetti-chicken-pie-159ec47a1cf442d4989cfc080741b513.jpg",
  "tags": [
    "Spaghetti, Bucatini, & Linguine",
    "Italian-American",
    "Baked Pasta",
    "Chicken",
    "Quick Dinners"
  ],
  "title": "Chicken Spaghetti Pie",
  "full_text": "Chicken Spaghetti Pie\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n15 mins\nCooling Time\n5 mins\nTotal\n50 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5\nounces\nangel hair pasta\n, broken in half (see note)\n2\ntablespoons\nolive oil\n1\nsmall\nonion\n, chopped (about\n3/4\ncup\n)\nKosher salt\nand freshly ground black pepper\n8\nounces\nground chicken\n2\ncloves\ngarlic\n, minced\n1/2\nteaspoon\nchile flakes\n1\n(14-ounce) can\ndiced tomatoes\n, strained\n1\n(\n8-ounce) can\ntomato purée\n6\nounces\ncheddar cheese\n(or Colby or Monterey Jack), shredded, divided\n1\nounce\nParmesan cheese\n, grated\nDirections\nAdjust oven rack to middle position and preheat to 400°F (205°C). Bring 2 quarts water to boil in medium pot over high heat. Season generously with salt and pasta. Quickly cook until pasta is al dente (about 2 minutes). Immediately drain and run cold water over pasta to cool. Spread onto a plate and place in the freezer while you prepare the sauce (see note).\nHeat oil in large saucepan over medium heat until shimmering. Add onion and season with salt. Cook, stirring, until just softened, about 5 minutes. Add chicken and garlic, and cook, breaking up with spoon, until chicken is no longer pink, about 2 minutes. Add chile flakes, 1/4 teaspoon black pepper, strained tomatoes, and purée, and bring to a simmer. Cook, stirring occasionally, until lightly thickened and flavors have melded, about 5 minutes. Let cool slightly.\nPlace sauce, spaghetti, 5 ounces cheddar, and Parmesan in large bowl. Toss to combine. Spread into 2-quart casserole dish (see note), top with remaining ounce of cheddar, and bake until top is crispy, about 20 minutes. Serve.\nSpecial Equipment\nMedium pot\n, large\nsaucepan\n, 2-quart\ncasserole dish\nNotes\nI chose angel hair (or capellini) pasta for it's delicate texture and quick cooking time. If using regular spaghetti, increase cooking time.\nFreeze the pasta until cold and firm, not frozen. If beginning to freeze solid, move pasta to refrigerator.\nThis can be doubled and baked in a 13- by 9-inch casserole dish.\nRead More\nEasy Skillet Baked Ziti With Sausage and Ricotta Recipe\nThe Food Lab's No-Boil Baked Ziti Recipe\nChicken and Penne in Vodka Cream Sauce Recipe\nSpaghetti, Bucatini, & Linguine\nItalian-American\nBaked Pasta\nChicken\nQuick Dinners"
}