{
  "url": "https://www.seriouseats.com/baked-zucchini-fries-recipe-8687930",
  "image_url": "https://www.seriouseats.com/thmb/jGm_9Rm7SV4kpAxuw_D0SIC0_bE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-SEA-BakedZucchiniFries-Glaze-hero-57-e4afeb71e9734eb89ff4539e77058bc1.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Zucchini & Yellow Squash"
  ],
  "title": "Baked Zucchini Fries With Herby Feta Dip",
  "full_text": "Baked Zucchini Fries With Herby Feta Dip\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nTotal\n45 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Feta-Herb Dip:\n4 ounces (\n113\ng)\nfeta\ncheese\n1/2\ncup\n(118ml)) whole-milk strained (Greek-style)\nyogurt\n2 tablespoons (\n30\nml)\nwater\n1 tablespoon (\n15\nml\n)\nextra-virgin olive oil\n1\nsmall\ngarlic clove\n, coarsely chopped\n1\nteaspoon\nfresh lemon juice\n1\nteaspoon\nfresh thyme leaves, plus more for garnish\n2 teaspoons\nfresh choppe\nd dill,\nplus more for garnish\n1 tablespoon\n(15\nml)\nhoney\nFor the Zucchini Fries:\n3 medium\nzucchini\n(about\n8\nounces\neach, ends trimmed and quartered lengthwise\n1\ncup\npanko breadcrumbs\n(2 ounces; 85g)\n1\ncup\ngrated\nParmigiano\n-Reggiano cheese (2 ounces; 70g)\n1\ntablespoon (15ml)\nextra virgin olive oil\n1 1/2\nteaspoons\nkosher salt, divided\n1/2 cup\nall-purpose flour\n(\n2 1/4\nounces;\n64g)\n3\nlarge\negg whites\nDirections\nFor the Feta-Herb Dip:\nIn a food processor, combine feta, yogurt, water, olive oil, garlic, lemon juice, thyme, and dill and process until smooth, scraping down sides of processor bowl as needed, about 30 seconds. Transfer to a shallow serving bowl and refrigerate until ready to serve.\nSerious Eats / Morgan Hunt Glaze\nFor the Zucchini Fries:\nUsing a vegetable peeler or sharp knife, shave or cut the seeds from the inner portion of each zucchini quarter. Halve each quarter lengthwise, then cut in half crosswise. (You should have 16 “fries” per zucchini that are roughly 1/2 inch thick by 3-inches long, depending on the size of the zucchini, about 48 total.)\nSerious Eats / Morgan Hunt Glaze\nAdjust an oven rack to lower-middle position and a second oven rack to upper-middle position and preheat oven to 450°F (230℃). Line 2 rimmed baking sheets with parchment paper; set aside. Arrange zucchini in an even layer on a paper towel-lined plate and pat dry. Set aside.\nSerious Eats / Morgan Hunt Glaze\nIn a clean, dry food processor, pulse panko until finely ground, 3 to 4 pulses. Transfer to a shallow bowl or pie plate with Parmesan, oil, and 1 teaspoon of the salt. Use fingers to toss until panko is completely coated in oil.\nSerious Eats / Morgan Hunt Glaze\nIn a shallow bowl or pie plate, add egg whites and lightly beat until frothy. In a separate shallow bowl or pie plate, add flour. Working in 3 batches, dredge zucchini sticks in flour, dusting off excess, then dredge into egg whites, allowing excess to drip back into the dish, then transfer into the prepared panko mixture. Turn and press the panko into the zucchini to ensure an even layer on all sides. Divide prepared zucchini fries on the 2 prepared baking sheets, spacing them out at least 1/2 inch apart.\nSerious Eats / Morgan Hunt Glaze\nBake both sheet trays at the same time until zucchini is starting to brown, about 12 minutes. Gently flip zucchini, then return to oven, switching baking sheets top to bottom and rotating front to back, and continue to bake until evenly browned and crisp, 10 to 14 minutes. Sprinkle evenly with 1/2 teaspoon salt.\nSerious Eats / Morgan Hunt Glaze\nTransfer the zucchini fries to a serving platter. Drizzle the feta dip with honey, and sprinkle with additional thyme and dill and serve with the zucchini fries.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nFood processor\nMake-Ahead and Storage\nThe dip can be made ahead and refrigerated in an airtight container for up to 5 days. It will thicken up after refrigeration; whip in additional Greek yogurt to loosen if necessary.\nThe zucchini can be cut as directed through step 2 and refrigerated in an airtight container for up to 2 days. Make sure to blot the zucchini dry before dredging and baking.\nSnacks & Appetizers\nThe Latest\nZucchini & Yellow Squash",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/baked-zucchini-fries-with-herby-feta-dip.webp?"
}