{
  "url": "https://www.seriouseats.com/baked-bacon-for-a-crowd-recipe",
  "image_url": "https://www.seriouseats.com/thmb/S_xwM1Yt9zXOnKbQwpgF3uLTmyQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__10__20161018-best-way-to-bake-bacon-flat-db2ac80bae1a42188041d6cde38e4c24.jpg",
  "tags": [
    "Bacon",
    "Roasting"
  ],
  "title": "Baked Bacon for a Crowd Recipe",
  "full_text": "Baked Bacon for a Crowd Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n3 mins\nTotal\n25 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nslices\nbacon\nDirections\nAdjust oven rack to center position and preheat oven to 425°F (220°C). (If doubling recipe, adjust 2 racks to upper- and lower-middle positions; see notes.)\nFor Crisp, Wavy Bacon:\nLine a 13- by 18-inch rimmed baking sheet with aluminum foil. Arrange bacon strips on pan, overlapping as little as possible. Bake bacon for 10 minutes. Rotate pan and continue baking until bacon is as browned as you like it, 5 to 10 minutes longer for thin-cut or 10 to 15 minutes longer for thick-cut. Remove bacon from oven, transfer to a paper towel–lined plate to drain, and serve.\nSerious Eats / J. Kenji López-Alt\nFor Chewy-Crisp Bacon:\nTear off a 13- by 30-inch piece of aluminum foil and crimp it, accordion-style, into 1-inch sections. Stretch out foil and place it on a 13- by 18-inch rimmed baking sheet, folding up edges to catch drips. Arrange bacon strips on foil, overlapping as little as possible. Bake bacon for 10 minutes. Rotate pan and continue baking until bacon is as browned as you like it, 5 to 10 minutes longer for thin-cut, or 10 to 15 minutes longer for thick-cut. Remove bacon from oven, transfer to a paper towel–lined plate to drain, and serve.\nSerious Eats / J. Kenji López-Alt\nFor Crisp, Flat Bacon for Sandwiches and Burgers:\nLine a 13- by 18-inch rimmed baking sheet with aluminum foil and top with a sheet of parchment paper. Arrange bacon strips on tray, overlapping as little as possible. Top with a second sheet of parchment paper; place a second baking sheet on top. Bake bacon until it's as crisp as you like it, 25 to 30 minutes for thin-cut, or 30 to 35 minutes for thick-cut. Remove trays from oven, carefully remove top tray using tongs and an oven mitt, transfer bacon to a paper towel–lined plate to drain, and serve.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\n13- by 18-inch rimmed baking sheet\n,\nwire rack\n(optional)\nNotes\nTo double the batch, use two trays on two oven racks, rotating top to bottom and back to front halfway through cooking. The cooking time may need to be extended by five to eight minutes if you're cooking two trays.\nIf your oven has a convection setting, use it, reducing the total cooking time by a few minutes.\nRead More\nAll the Best Ways to Cook Bacon (And All the Ways Not To)\nTaste Test: The Best Supermarket Bacon\nBacon, Pancetta, and More: Cured Pork Products and How to Cook With Them\nOvernight Sous Vide Bacon\nThe Best BLT Sandwich\nBacon\nRoasting"
}