{
  "url": "https://www.seriouseats.com/baked-chocolate-mousse-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/E3RR2LX3117UQiB_ZrfedOqVS7I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__06__20130624-256945-baked-chocolate-mousse-cake.1-a62a6c12b58c4927b16fed8ec64708ad.jpg",
  "tags": [
    "Cakes",
    "Gluten-free Desserts",
    "Baking",
    "Chocolate",
    "Mother's Day"
  ],
  "title": "Baked Chocolate Mousse Cake Recipe",
  "full_text": "Baked Chocolate Mousse Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nActive\n30 mins\nCooling Time\n3 hrs 30 mins\nTotal\n4 hrs 30 mins\nServes\n10\nto 12 servings\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\nCocoa\nto dust pan and over top of cake\n14\ntablespoons\n(\n7\nounces\n)\nunsalted butter\n16\nounces\nbittersweet chocolate\n, finely chopped\n1/8\nteaspoon\nsalt\n10\nlarge\neggs\n, separated\n1/4\nteaspoon\ncream of tartar\n1/2\ncup\n(\n3 1/2\nounces\n) plus\n2\ntablespoons\ngranulated sugar\n, divided\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F. Grease bottom and sides of 9-inch springform pan and dust with cocoa. Set pan on baking sheet.\nPlace butter, chocolate, and salt in very large heatproof bowl. Heat over saucepan of barely simmering water, stirring occasionally, until melted and smooth. Remove from heat and let cool slightly, about 5 minutes.\nIn mixer fitted with whip attachment, beat whites and cream of tartar on medium speed until frothy. Increase speed to medium-high and continue to beat until whites have turned opaque. While whites are beating, slowly add 2 tablespoons sugar and continue to beat to stiff but not dry peak. Transfer beaten whites to a bowl.\nUsing same unwashed mixing bowl and whip, beat yolks and remaining 1/2 cup sugar on medium-high speed until light lemon color, 3 to 5 minutes.\nGently whisk yolks into chocolate mixture until combined (trying not to deflate yolks). Gently fold whites into chocolate mixture in three batches, until just combined and no streaks of white remain.\nPour batter into pan and bake until cake is puffed, edges feel set, center is jiggly set, and temperature in center reads 150°F, about 40 minutes. Transfer pan to wire rack to cool 1 hour. Chill until set, about 3 hours. Run knife along inside edge of pan to release cake. Let cake come to almost room temperature before serving, about 30 minutes (see note).\nSpecial equipment\n9-inch springform pan\nThis Recipe Appears In\nChocoholic: Baked Chocolate Mousse Cake\nCakes\nGluten-free Desserts\nBaking\nChocolate\nMother's Day"
}