{
  "url": "https://www.seriouseats.com/baked-eggplant-with-lamb-and-walnut-sauce-turkish-recipe",
  "image_url": "https://www.seriouseats.com/thmb/6Xxc-9oxVyWvdos9qyaRPL40xq4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__02__20120216-192915-lamb-eggplant-walnut-d86840940d19401f807f5eba771091c9.jpg",
  "tags": [
    "Vegetable Mains",
    "Savory",
    "Ground Lamb",
    "Walnuts"
  ],
  "title": "Baked Eggplant with Lamb and Walnut Sauce Recipe",
  "full_text": "Baked Eggplant with Lamb and Walnut Sauce Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n90 mins\nActive\n15 mins\nTotal\n100 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor lamb and walnut sauce\n3\ntablespoons\nolive oil\n1\nmedium\nred onion\n, finely chopped\n3\nlong\nhot peppers\n(see note), finely chopped\n4\ncloves garlic\n, minced\n2\ntablespoons\njanissary spice\n(recipe to follow)\n3/4\nteaspoon\ncumin seeds\n, divided\n1 1/2\ncups\nchopped walnuts\n1\npound\nground lamb\n1\n(28 ounce)\ncan of tomatoes\n1\ntablespoon\npomegranate molasses, or\nbalsamic vinegar\nFresh chopped\nmint\n, for garnish\nFor baked eggplant\n2\nmedium\nItalian eggplant\n2\ntablespoons\nolive oil\nFor janissary spice\n6\ntablespoons\nground maraş or\naleppo chile\n(see note)\n3\ntablespoons\ndried oregano\n2 to 4\nteaspoons\nsumac\n, or to taste\nDirections\nFor lamb and walnut sauce:\nHeat oil in a large sauté pan or Dutch oven on medium, then add onions, long hot peppers, and garlic. Cook, stirring frequently, until vegetables soften, about 5 minutes. Increase heat slightly and add janissary spice and 1/2 teaspoon cumin, stir to combine, and cook for 30 seconds. Add walnuts and cook for 1 to 2 minutes, or until they begin to toast and brown.\nIncrease heat slightly, add some more olive oil if pan looks dry, and add lamb. Lamb should brown but not sear. Season with a couple generous pinches of salt, and break up large clumps with a wooden spoon and cook until lamb is lightly browned. Add tomatoes, stir to combine, and bring to a boil. Reduce to a simmer and cook, covered, for 45 minutes, or until lamb is very tender. Before serving, check for seasoning and stir in pomegranate molasses and remaining 1/4 teaspoon of cumin seed.\nFor baked eggplant:\nHeat oven to 375°F. Cut eggplant in half lengthwise, leaving stems intact. Drizzle some olive oil on baking sheet. Season cut sides of eggplant with several pinches of salt, then place cut side down on baking sheet and spread oil to an even film. Season skin sides of eggplant and drizzle with more olive oil.\nBake for 30 minutes, or until skins are wrinkled and eggplant offers no resistance to a knife. Carefully flip eggplant over with tongs or a long, thin offset spatula, so cut sides point up. Broil until cut sides are well browned, just a couple minutes.\nTo serve, spread some lamb and walnut sauce on a serving platter. Arrange eggplant cut side up, then top with remaining sauce. Garnish with freshly chopped mint leaves.\nFor janissary spice:\nCombine chile and oregano in an airtight bag or jar. If using whole chiles, remove seeds before grinding. Add sumac in small increments; spice mix should not taste sour or tart, but should have a slight piquancy. Sweeter chiles will require more sumac than spicier varieties. Store tightly sealed in a cool, dark place. Recipe makes about 1/2 cup; use within 3 months.\nThis Recipe Appears In\nSpice Hunting: On Blending Chiles and Herbs, and the Spice of the Janissaries\nVegetable Mains\nSavory\nGround Lamb\nWalnuts"
}