{
  "url": "https://www.seriouseats.com/baking-with-dorie-galette-des-rois-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5BJsmjZwbY9FXvKNhpMR6MJTftU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__dorie-feves-a5146ad1359145f0975616c883f0f672.jpg",
  "tags": [
    "Pastries"
  ],
  "title": "Baking with Dorie: Galette des Rois Recipe",
  "full_text": "Baking with Dorie: Galette des Rois Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n85 mins\nChilling and Cooling Time\n40 mins\nTotal\n2 hrs 30 mins\nCook Mode\n(Keep screen awake)\nIngredients\n14\nounces\nall-butter\npuff pastry\n, homemade or store bought, chilled and ready to roll\n3/4\ncup\nalmond cream\n(recipe below)\n1/4\ncup\npastry cream\n(recipe below)\n1\ntablespoon\ndark\nrum\n1\nlarge egg\n1\ntrinket\n(see above)\n6\ntablespoons\n(\n3\nounces\n)\nunsalted butter\n, at room temperature\n3/4\ncup\nconfectioners sugar\n3/4\ncup\nground blanched\nalmonds\n2\nteaspoons\nall purpose flour\n1\nteaspoon\ncornstarch\n1\nlarge egg\n, at room temperature\n2\ncups\nwhole milk\n1\nplump, moist\nvanilla bean\n, split and scraped\n6\nlarge\negg yolks\n1/2\ncup\nsugar\n1/3\ncup\ncornstarch\n, sifted\n3 1/2\ntablespoons\n(\n1 3/4\nounces\n)\nunsalted butter\n, softened and cut into\n3\npats\nDirections\nLine 2 baking sheets with parchment paper and keep them close at hand. Divide the pastry in half and work with one half at a time; keep the other half in the refrigerator.\nWorking on a floured surface, roll 1 piece of the puff pastry into a circle that is about 1/8-inch thick. Using a pan lid or the bottom of a tart pan, cut a circle that is about 9 inches in diameter. Transfer the circle to a lined baking sheet, cover with plastic wrap and refrigerate. Roll the second piece of pastry out in the same manner, but this time cut out a circle that is about 9 1/2 inches in diameter. Place this circle on the other baking sheet, cover and refrigerate as well.\nWhisk the almond cream, pastry cream, and rum together in a bowl, stirring just to blend the two creams, not to whip air into them. In a small bowl, beat the egg just to break it up.\nRemove the smaller circle of pastry from the refrigerator and paint the outer 1 inch border with a light coating of beaten egg. Spoon the almond-pastry cream mixture onto the pastry and spread it smooth across the circle, stopping when you reach the egg-painted border. Put the trinket anywhere on top of the cream and press it gently into the cream. Cover the cream-coated circle with the top (larger) round of puff pastry, pressing it firmly around the border to glue the two pieces together. You have some choices here, you can press the edges together with the tines of a fork to both decorate and seal them, or you can use a small sharp paring knife to create a scallop pattern all around the border. Whatever you do, the important thing is to make certain that the edges are sealed.\nBrush the entire top of the galette with the beaten egg, then, using the tip of a paring knife, decorate the top by drawing curved lines from the center of the galette to the edges. The lines will resemble backward C’s or quotation marks. Don’t worry about the design—even if you make straight lines radiating from the center out, your galette will be attractive. The only important thing here is not to pierce the dough. Cut a small circle of dough, a steam vent, out of the center of the galette, slide the galette into the refrigerator, and chill it for at least 30 minutes while you preheat the oven. (\nThe galette can be covered and kept in the refrigerator for a day or wrapped airtight and frozen for up to 1 month.\n)\nCenter a rack in the oven and preheat the oven to 475°F. (If you are using storebought puff pastry, follow the temperature instructions on the package.)\nSlip the galette into the oven and immediately lower the temperature to 400°F. Bake the galette for 40 minutes, until it is beautifully puffed and deeply golden brown. If, after 20 minutes, the galette is browning too quickly, cover it loosely with a foil tent. Remove the galette from the oven, place the baking sheet on a cooling rack, and allow the galette to cool for 10 minutes before serving. Many consider the galette at its best when it is served hot or warm, but it is still delicious at room temperature.\nKeeping:\nAlthough the constructed galette can be chilled for a day or frozen for up to a month, once it is baked it should be served that day.\nThe Almond Cream\n- makes about 1 1/4 cups -\nWorking in a food processor, put the butter and confectioners’ sugar in the workbowl. Process until the mixture is smooth and satiny. Add the ground almonds and continue to process until well blended. Add the flour and cornstarch, process, then add the egg. Process for about 15 seconds more, or until the almond cream is homogeneous. Scrape the almond cream into a container and either use immediately or refrigerate until firm. (Keeping: The almond cream can be packed airtight and kept in the refrigerator for up to 4 days or frozen for up to 1 month. Defrost, still wrapped, overnight in the refrigerator, then beat it with a spatula or spoon to bring back its original consistency.)\nThe Pastry Cream\n- makes about 2 cups -\nBring the milk and vanilla bean (pulp and pod) to a boil in a small saucepan over medium heat. Cover the pan, turn off the heat, and allow the milk to infuse for at least 10 minutes or for up to 1 hour.\nIf the milk has cooled, it will need to be reheated now.\nWhisk the yolks, sugar, and cornstarch together in a heavy-bottomed medium saucepan. Whisking constantly, drizzle one-quarter of the hot milk over the yolks. When the yolks are warm, whisk the remainder of the milk into the yolks in a steadier stream; remove and discard the pod (or save it to make vanilla sugar).\nPut the pan over medium heat and, whisking vigorously, bring the mixture to the boil. Keep at the boil—still whisking energetically—for 1 to 2 minutes before pulling the pan from the heat and pressing the cream through a sieve into the small bowl. Let the cream sit for 5 minutes, then whisk in the butter. Cover the cream with a piece of plastic wrap—press the wrap against the cream—and refrigerate until thoroughly chilled. You can speed up the chill by putting the bowl in a larger bowl filled with ice cubes and cold water. (Keeping: Covered tightly with plastic wrap, pastry cream can be refrigerated for 2 days. To smooth the chilled cream, whisk it for a few seconds.)\nPastries",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/baking-with-dorie-galette-des-rois-recipe.webp?"
}