{
  "url": "https://www.seriouseats.com/baleela-creamy-chickpeas-with-cumin-and-pine-nuts-recipe-8638841",
  "image_url": "https://www.seriouseats.com/thmb/BZoo112JkAP8xfB89LPTGT6aQcA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240425-SEA-Baleela-MaiKakish-10-bae783938c48492f8989c780338f8c17.jpg",
  "tags": [
    "Chickpeas",
    "The Latest",
    "Middle Eastern",
    "Vegetarian",
    "Vegan"
  ],
  "title": "Baleela (Creamy Chickpeas With Cumin and Pine Nuts)",
  "full_text": "Baleela (Creamy Chickpeas With Cumin and Pine Nuts)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nSoaking Time\n8 hrs\nTotal\n9 hrs 45 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\ndried chickpeas\n(about\n1 1/4\ncups\n;\n226\ng\n), see note\n1\nlarge clove\ngarlic\n(\n10\ng\n), finely minced\n2\nteaspoons\nground cumin\n, plus more for garnishing\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\ntablespoons\n(\n30\nml\n) fresh\nlemon juice\nfrom\n1\nlemon\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, plus more for serving\n2\ntablespoons\npine nuts\n(\n3/4\nounce\n;\n21\ng\n), toasted until a light golden brown\nDirections\nIn a large bowl, cover chickpeas with 6 cups (1.4L) cold water. Let stand at room temperature for at least 8 hours. Drain and rinse chickpeas thoroughly.\nSerious Eats / Mai Kakish\nIn a 6- to 8-quart Dutch oven or saucepan, cover chickpeas with enough water to cover by 2 inches (about 8 cups; about 1.9L) and bring to a boil over high heat. Reduce to a simmer, cover with lid slightly ajar, and cook until chickpeas are completely tender but not falling apart, 1 hour 15 minutes to 1 hour 30 minutes. Stir chickpeas occasionally and top off with more water if needed; chickpeas should be fully submerged at all times. (See notes if using canned chickpeas.)\nSerious Eats / Mai Kakish\nWhen chickpeas are cooked, set aside 1 cup of cooking liquid. Using a colander, drain chickpeas. (Reserve chickpea cooking liquid for reheating the dish if you plan on making this in advance.)\nSerious Eats / Mai Kakish\nIn a large bowl, whisk garlic, cumin, salt, lemon juice, and olive oil together until combined. Add cooked chickpeas to the bowl, along with 2 to 3 tablespoons of the reserved cooking liquid, and mix, using the back of the spoon to mash a few chickpeas. (This will help thicken it slightly.) Season to taste with lemon juice and salt.\nSerious Eats / Mai Kakish\nTo Serve:\nGarnish with toasted pine nuts and cumin and finish with a drizzle of olive oil. Serve with pita for scooping or enjoy with a spoon.\nSerious Eats / Mai Kakish\nNotes\nYou can use two 14-ounce cans of chickpeas, drained and rinsed well, in place of the dried chickpeas. In a medium (4- to 6-quart) pot, cover chickpeas generously with water and bring to a boil, then simmer over medium heat until beans are heated through before continuing with step 3.\nMake-Ahead and Storage\nDried chickpeas can be cooked through the end of step 2 two days in advance and reheated before. When ready to eat, proceed from step 3 and assemble the dish.\nThe prepared baleela can be refrigerated in an airtight container for up to 3 days. Reheat on the stove before serving, adding a few splashes of reserved chickpea cooking liquid as needed to loosen it up.\nChickpeas\nThe Latest\nMiddle Eastern\nVegetarian\nVegan"
}