{
  "url": "https://www.seriouseats.com/balthazars-steak-tartare-recipe",
  "image_url": null,
  "tags": [
    "Beef",
    "No-Cook"
  ],
  "title": "Balthazar’s Steak Tartare Recipe",
  "full_text": "Balthazar’s Steak Tartare Recipe\nClose\nJump to recipe\nPrep\n20 mins\nTotal\n20 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4 pound filet mignon, very cold\n1/2 medium onion, minced\n2 tablespoons capers\n8 cornichons, cut into small dice\n2 tablespoons flat-leaf parsley, chopped\n1 anchovy fillet, minced\n2 tablespoons extra-virgin olive oil\n1 garlic clove, peeled and minced\n1/2 teaspoon salt\nWhite pepper\n6 tablespoons Tartare Mayonnaise (recipe follows)\n1 baguette, sliced\n2 large egg yolks\n2 tablespoons Dijon mustard\n2 teaspoons fresh-squeezed lemon juice\n1 teaspoon sherry vinegar\n1/2 teaspoon Worcestershire sauce\n1/2 teaspoon Tabasco\n1/2 teaspoon salt\n1/2 cup grapeseed oil\n1/2 cup olive oil\nDirections\nTake the beef out of the refrigerator; it should be very cold. Using a very sharp chef’s knife, cut the steak into thin 1/4-inch slices. Stack 3 of the slices and slice lengthwise, every 1/2 inch, holding the stack in place. Then cut across the stack, again every 1⁄2 inch, cutting the steak into 1⁄2-inch dice. Hold the chopped steak in a bowl set over crushed ice in a larger bowl.\nWhen all of the beef has been chopped, add in the onion, capers, cornichons, parsley, anchovy, oil, garlic, salt, and pepper. Gently mix with a fork until just combined. Add the Tartare Mayonnaise and again mix gently until just combined.\nServe on individual plates with baguette slices alongside.\nTartare Mayonnaise\nPut all the ingredients except for the oils in the bowl of food processor. Blend for 30 seconds. With the blade still spinning, drizzle the grapeseed oil in a very slow stream, followed by the olive oil. This should take about 2 minutes. As the mayonnaise forms, the noise from the food processor will become louder, making a slapping sound, as it does with cake batter. Process until the mayonnaise is thick, with a creamy body. Refrigerate, covered, for up to 1 week.\nTo serve with Steak Tartare, add the following ingredients to the prepared Mayonnaise and whisk to smoothly combine:\n1/2 cup ketchup\n3 tablespoons Dijon mustard\n1 tablespoon Tabasco sauce\n1 teaspoon Worcestershire sauce\n1/2 teaspoon salt\nBeef\nNo-Cook"
}