{
  "url": "https://www.seriouseats.com/banana-ice-cream-recipe-8650228",
  "image_url": "https://www.seriouseats.com/thmb/ZaAoCrEx-fQ2D2T5XOspBl0dnVE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240430-BananaIceCream-AmandaSuarez-00-14fcb7d0298a42a29331ece56a9d17f1.jpg",
  "tags": [
    "Ice Cream",
    "The Latest",
    "Banana"
  ],
  "title": "Whipped Banana Ice Cream",
  "full_text": "Whipped Banana Ice Cream\nClose\nJump to recipe\nPrep\n10 mins\nFreezing/Thawing Time\n8 hrs 15 mins\nTotal\n8 hrs 25 mins\nServes\n4\nto 6\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n6\nvery\nripe bananas\n1/4\ncup\noat milk,\nalmond milk\n,\nwhole milk\n,\nheavy cream\n, or\nwater\n2\nteaspoons\nvanilla extract\n, optional\n1\nteaspoon\nlemon juice\n, optional\n1/4\nteaspoon\nkosher salt\nDirections\nPeel bananas, place in a large zipper-lock bag, and press out excess air. Freeze bananas until solid, at least 8 hours.\nSerious Eats / Amanda Suarez\nLet bananas sit at room temperature to soften slightly, about 15 minutes. Slice into 1/2-inch-thick rounds. In a food processor, place banana slices, milk or cream, vanilla, lemon juice, if using, and salt and process until smooth, about 5 minutes, scraping down sides of bowl as needed.\nSerious Eats / Amanda Suarez\nFor a softer texture, serve immediately, or for a firmer ice cream, transfer mixture to an airtight container and freeze until firm, at least 2 hours. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFood processor\nNotes\nBe sure to use very ripe, heavily speckled (or even black) bananas in this recipe.\nYou can skip the freezing in step 3 and serve the ice cream immediately, but the texture will be softer.\nMake-Ahead and Storage\nBananas can be peeled and frozen in an airtight container for up to 3 months before you prepare the ice cream (they will remain safe indefinitely but quality can begin to suffer over time).\nThe finished banana ice cream can be transferred to an airtight container and frozen for up to 7 days.\nIce Cream\nThe Latest\nBanana"
}