{
  "url": "https://www.seriouseats.com/banana-bread-pancakes-recipe-11691938",
  "image_url": "https://www.seriouseats.com/thmb/erYB8_LgpniHBFmIDieJj1SBoGs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250304-SEA-BananaBreadPancakes-AmandaSuarez-Beauty2-26-8bbd685a3164489e84e8de8d676192f7.jpg",
  "tags": [
    "Banana",
    "The Latest",
    "Breakfast & Brunch",
    "Pancakes"
  ],
  "title": "Banana Bread Pancakes",
  "full_text": "Banana Bread Pancakes\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\nripe\nbananas\n(about\n14\nounces\n;\n400\ng\ntotal)\n1\ntablespoon\ndark brown sugar\n(\n1/2\nounce\n;\n14\ng\n)\n1\nlarge\negg\n1\nteaspoon\nvanilla extract\n5 3/4\nounces\nall-purpose flour\n(\n160\ng\n;\n1 1/4\ncup\n)\n3/4\nteaspoon\nbaking powder\n3/4\nteaspoon\nbaking soda\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1 1/2\nounces\nunsalted butter\n(\n42\ng\n;\n3\ntablespoons\n), plus more for cooking\n1/4\nteaspoon\nground cinnamon\n1/2\ncup\n(\n120\nml\n)\nbuttermilk\n(see notes)\n2\nounces\ntoasted\nwalnuts\n(\n57\ng\n;\n1/2\ncup\n), coarsely chopped (optional)\nMaple syrup\n, for serving\nDirections\nIn a large bowl, mash bananas with dark brown sugar, egg, and vanilla extract until mostly smooth; set aside.\nIn a small saucepan or skillet, melt butter over medium heat. Cook, stirring often, until butter solids turn golden brown and smell nutty, 4 to 6 minutes. Remove saucepan from heat and whisk in cinnamon. Let cool slightly, about 5 minutes.\nSerious Eats / Amanda Suarez\nIn a medium bowl, whisk together all-purpose flour, baking powder, baking soda, and salt; set aside.\nPour butter over banana mixture and whisk to combine. Add buttermilk and whisk to incorporate. Add flour mixture, whisking until just combined. Using a flexible spatula, fold in walnuts, if using.\nSerious Eats / Amanda Suarez\nPlace a wire rack inside a rimmed baking sheet; set aside.\nHeat a large electric nonstick griddle to medium heat (350°F/175°C) or large nonstick, cast iron, or carbon steel skillet or stovetop griddle over medium heat. Melt 1/2 tablespoon butter and, using a 1/3 cup scoop or measuring cup, scoop batter onto griddle or skillet to form 3-inch pancakes spaced 1/2- to 1-inch apart, working in batches if necessary. Cook until bubbles start to appear on top of batter and bottoms are golden brown, 2 to 4 minutes, adjusting heat as needed to prevent overbrowning. Carefully flip pancakes and cook until bottoms are lightly golden and pancakes are cooked through, 2 to 4 minutes. Transfer to prepared wire rack. Repeat with remaining batter. Serve warm with maple syrup.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nSmall saucepan;\nwhisk\n; flexible spatula; wire rack; rimmed baking sheet; nonstick electric\ngriddle\nor large nonstick, cast iron, or carbon steel skillet or stovetop griddle\nNotes\nButtermilk can be substituted with a mixture of milk and vinegar. In a measuring cup, stir 1/2 cup whole milk with 1 teaspoon white vinegar or apple cider vinegar to combine. Let sit 5 minutes and proceed with recipe.\nThe recipe can be doubled.\nMake-Ahead and Storage\nOnce cooled, pancakes can be refrigerated in an airtight container for up to 5 days. Reheat in the microwave or a 300°F (150°C) oven until warmed through.\nBanana\nThe Latest\nBreakfast & Brunch\nPancakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/banana-bread-pancakes.webp?"
}