{
  "url": "https://www.seriouseats.com/banana-cookies-recipe-8648339",
  "image_url": "https://www.seriouseats.com/thmb/w61I_5yNeHI8U2eM6xlwaxMnjxQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240514BananaCookies-AmandaSuarez07-7fb8a4786ae64d5590c54f86b0e8b5a3.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Banana"
  ],
  "title": "Brown Butter Bananarama Cookies",
  "full_text": "Brown Butter Bananarama Cookies\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nResting and Cooling Time\n45 mins\nTotal\n110 mins\nServes\n16 Cookies\nMakes\n16 Cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/3\ncups\n(\n7 1/2\nounces\n;\n212\ng\n)\nall-purpose flour\n1\nteaspoon\nDiamond crystal\nkosher salt\n; if using\ntable salt\nuse half as much by volume\n1/2\nteaspoon\nbaking soda\n10\ntablespoons\nunsalted butter\n, divided\n3\nbananas\n, halved crosswise and halved lengthwise\n1 1/4\ncups\npacked\nlight brown sugar\n(\n8 3/4\nounces\n;\n250\ng\n)\n1\nlarge\negg\n, lightly beaten\n1\nteaspoon\nvanilla extract\n1/2\ncup\n(\n60\ng\n) packed\nsweetened shredded coconut\n, toasted, optional (see notes)\n1/2\ncup\n(\n85\ng\n)\nbittersweet\nor\nmilk chocolate chips\n, optional\nFor Topping the Cookies (optional):\n16\nbanana slices\n, cut 1/8-inch thin round (from\n1\nbanana\n)\n1\ntablespoon\ngranulated sugar\nfor sprinkling over banana slices\n1-inch\nroughly chopped\nchocolate chunks\nDirections\nAdjust oven rack to middle positions and heat oven to 350℉ (175℃). Line 2 rimmed baking sheet with parchment paper; set aside. In a medium bowl, whisk the flour, salt, and baking soda to combine; set aside.\nIn a 10-inch nonstick or cast iron skillet, heat 2 tablespoons butter over medium-high heat until melted. Add banana slices cut side down and cook until glossy, golden brown, and softened, flipping slices as needed, 2 to 3 minutes per side. Transfer to a bowl.\nSerious Eats / Amanda Suarez\nIn the now-empty skillet, add the remaining butter and cook over medium-high heat, stirring and swirling skillet constantly with rubber spatula, until butter is light golden brown and has a nutty aroma, 2 to 4 minutes. Return the browned banana to the skillet and continue to cook, stirring and flipping the banana mixture frequently until the bananas are mostly broken down and the mixture turns dark golden brown and has a deep caramelized, nutty banana aroma, 6 to 8 minutes. Off heat stir in the brown sugar, return to heat and cook, stirring frequently, until sugar is fully dissolved and the syrupy mixture gently bubbles, about 1 minute. Transfer the banana mixture to a large bowl. Let sit until cooled slightly, for 10 minutes or up to 30 minutes.\nUsing a potato masher, mash the banana mixture until mostly smooth. Whisk in egg and vanilla until combined. Using a spatula, stir in flour mixture until just combined. Fold in coconut and/or chocolate chips, if using.\nRefrigerate dough mixture until firm enough to roll, at least 30 minutes or up to 24 hours. Using greased portion scoop or wet hands, divide into roughly 2-tablespoon portions (about 2 ounces; 50g each) and round each one into a smooth ball. Arrange 2 inches apart on prepared baking sheets, 8 dough balls per sheet. Using wet hands or the back of a greased measure cup, press the dough balls into 3-inch round disks.\nSerious Eats / Amanda Suarez\nFor topping the cookies (optional):\nToss the banana slices with the sugar until lightly coated. Press 1 chocolate chunk and/or 1 banana slice gently into the center of each cookie.\nSerious Eats / Amanda Suarez\nBake cookies, 1 tray at a time, until cookies are golden brown and puff slightly, and edges have begun to set but centers are still soft, 12 to 16 minutes, rotating baking sheet halfway through baking. Transfer baking sheet to wire rack and let cookies cool for at least 15 minutes before serving.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n10-inch nonstick or cast iron skillet, 2 rimmed baking sheets\nNotes\nTo toast the coconut flakes (if using): Spread coconut in an even layer on a parchment paper lined rimmed baking sheet and bake on the middle rack of the oven at 350℉(175℃), stirring every 5 minutes, until the shreds are a mix of golden brown and white, about 15 minutes. Let cool on the baking sheet before transferring to a bowl or airtight container.\nMake-Ahead and Storage\nOnce cooled, transfer cookies to an airtight container and store at room temperature for up to 5 days.\nCookies\nThe Latest\nBanana",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/brown-butter-bananarama-cookies.webp?"
}