{
  "url": "https://www.seriouseats.com/banana-split-recipe-8647745",
  "image_url": "https://www.seriouseats.com/thmb/j5Aw-T4TtTy02uI1SpszMRF7aks=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240513-BananaSplit-AmandaSuarez-hero2-ca996ebfcca5477da9da82cba923efd9.jpg",
  "tags": [
    "Ice Cream",
    "The Latest",
    "Summer Desserts",
    "No-Cook Desserts"
  ],
  "title": "Banana Split",
  "full_text": "Banana Split\nJump to recipe\nPrep\n10 mins\nTotal\n10 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n240\nml\n)\nheavy cream\n(see notes)\n1\nlarge\nripe\nbanana\n(\n5 1/2\nounces\n;\n155\ng\n), peeled and halved lengthwise (see notes)\n3\nlarge scoops\nice cream\n, such as vanilla, chocolate, and/or strawberry\nFudge sauce\n,\nhomemade\nor store-bought\nCaramel sauce\n,\nhomemade\nor store-bought\nStrawberry sauce\n,\nhomemade\nor store-bought\n1/4\ncup\ntoasted walnuts\n, crushed or roughly chopped (\n1\nounce\n;\n30\ng\n)\nDirections\nIn the bowl of a stand mixer fitted with the whisk attachment, whisk cream on medium-high speed until stiff peaks form, about 2 minutes.\nFit a piping bag\nwith desired piping tip. Using a flexible spatula, gently scrape whipped cream into prepared piping bag. Set aside in refrigerator until ready to use. (See notes.)\nSerious Eats / Amanda Suarez\nIn a banana split dish or large bowl, place halved banana on dish cut side up. Top with 1 scoop vanilla ice cream, 1 scoop chocolate ice cream, and 1 scoop strawberry ice cream. Drizzle ice cream with desired sauces and garnish with toasted walnuts. Pipe whipped cream onto each scoop of ice cream and top each mound of whipped cream with a maraschino cherry. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nStand mixer,  piping bag, piping tip, ice cream scoop\nNotes\nThis recipe can be easily doubled, tripled, quadrupled, or gazoopled. You can also make a mini split by using half a banana, one scoop of ice cream, and a small (but not too small!) amount of sauce and toppings.\nTo easily slice the bananas, cut first, then peel.\nIf using a hand mixer, place heavy cream and whisk on medium speed until stiff peaks form, about 3 minutes. Store-bought whipped cream can be substituted for homemade whipped cream.\nIf you do not have a piping bag, you can use a spoon to dollop whipped cream onto the ice cream instead.\nMake-Ahead and Storage\nChocolate sauce, caramel sauce, and strawberry sauce can be refrigerated in airtight containers for up to a week.\nIce Cream\nThe Latest\nSummer Desserts\nNo-Cook Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/banana-split.webp?"
}