{
  "url": "https://www.seriouseats.com/banh-nam-vietnamese-steamed-rice-dumplings-with-shrimp-and-pork-recipe-7106670",
  "image_url": "https://www.seriouseats.com/thmb/uh3qJmklLhlcm51prB0cCJiDHjo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230207-BanhNam-VyTran-hero-65dcfb87262d4a3ea337577ebe404b6c.JPG",
  "tags": [
    "Vietnamese",
    "Shrimp",
    "Southeast Asian",
    "Pork",
    "Stovetop Seafood"
  ],
  "title": "Bánh Nậm (Vietnamese Steamed Rice Dumplings With Shrimp and Pork)",
  "full_text": "Bánh Nậm (Vietnamese Steamed Rice Dumplings With Shrimp and Pork)\nClose\nJump to recipe\nPrep\n45 mins\nCook\n45 mins\nTotal\n90 mins\nServes\n8\nto 10 servings\nMakes\n36\nto 40 dumplings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1\ncup\ndried wood ear mushrooms\n2\ntablespoons\n(\n30\nml\n) store-bought or homemade\nannatto oil\n(for homemade, see note)\n1\nmedium\nshallot\n, minced (about\n2\ntablespoons\n)\n3\nmedium\ncloves garlic\n, minced (about\n1\ntablespoon\n)\n8\nounces\n(\n227\ng\n)\nground pork\n8\nounces\n(\n227\ng\n) finely minced shelled and deveined\nshrimp\n1\nteaspoon\n(\n5\nml\n)\noyster sauce\n1/2\nteaspoon\nfish sauce\nKosher salt\nand freshly\nground black pepper\n1/2\ncup\nthinly sliced\nscallions\n(from about\n1\nbunch\n)\nFor the Rice Batter:\n2\ncups\n(\n240\ng\n)\nrice flour\n1/2\ncup\n(\n60\ng\n)\ntapioca flour\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n2\nteaspoons\n(\n10\nml\n)\nneutral oil\n, such as\nvegetable\nor\ncanola oil\nTo Assemble and Serve:\nOne\n16-ounce\n(\n454\ng\n) package\nfrozen banana leaves\n, defrosted, then washed, dried, and cut into 10- by 5-inch rectangles\nNước chấm\n, for serving\nDirections\nFor the Filling:\nRinse wood ear mushrooms under cold running water. In a medium bowl, cover mushrooms with hot water and let soak until softened (they will swell significantly and become very flexible with a slight rubbery texture), 15 to 30 minutes. Alternatively, cover with cold water and soak for at least 1 and up to 8 hours. Drain, rinse again to remove any lingering sand or grit, and trim of any tough/woody parts. Mince finely and set aside.\nSerious Eats / Vy Tran\nIn a large nonstick skillet, heat annatto oil over medium heat until shimmering. Add shallot and garlic and cook, stirring, until fragrant, about 1 minute. Increase heat to medium-high, add ground pork and wood ear mushrooms and cook, stirring to break up pork, until pork is browned, about 10 minutes.\nSerious Eats / Vy Tran\nStir in shrimp, oyster sauce, and fish sauce, and season well with salt and pepper. Continue to cook, breaking up any remaining lumps of meat or shrimp, until shrimp is cooked through, about 3 minutes longer. Stir in green onions until well combined, then remove filling from heat and set aside.\nSerious Eats / Vy Tran\nFor the Rice Batter:\nIn a 2-quart saucepan, stir together rice and tapioca flours, salt, oil, and 6 cups (1.4L) water until well combined. Set over medium-high heat and cook, stirring frequently and scraping bottom of pan to prevent sticking, until batter begins to thicken, 5 to 6 minutes. Reduce heat to medium and continue stirring until you get a loose mashed potato–like consistency, about 4 minutes longer. Remove batter from heat and set aside to cool slightly.\nSerious Eats / Vy Tran\nTo Assemble:\nPlace a banana leaf rectangle in front of you with the long side perpendicular to you. Portion 2 tablespoons of batter onto the center. Using a silicone spatula, spread batter into a roughly 2- by 4-inch rectangle about 1/8 inch thick.\nSerious Eats / Vy Tran\nScatter roughly 1 heaping teaspoon filling over batter.\nSerious Eats / Vy Tran\nFold one long side of banana leaf over batter and filling followed by the other to close. Next, fold top and bottom flaps over the filling. Set closed packet aside, folded-sides down to prevent them from popping open and repeat with remaining banana leaf rectangles, batter, and filling.\nSerious Eats / Vy Tran\nIn a steamer basket or bamboo steamer, arrange dumpling packets flat or sideways, making sure to arrange them such that they remain closed. Bring a pot or wok filled with 1 or 2 inches of water to a boil over high heat. Add steamer basket or bamboo steamer, cover, and steam for 10 minutes. Remove from heat, let cool slightly, then enjoy hot or at room temperature with some\nnước chấm\n.\nSerious Eats / Vy Tran\nSpecial Equipment\nSteamer, silicone spatula\nNotes\nTo make annatto oil, warm 2 tablespoons (15ml) neutral cooking oil with 1/4 teaspoon annatto seeds on medium heat, stirring occasionally as oil darkens to a red-orange color, 7 to 8 minutes. Remove from heat, then strain and discard seeds.\nMake-Ahead and Storage\nWood ear mushrooms can be soaked up to 6 hours ahead.\nBanana leaf packets can be prepared 2 to 3 days ahead and refrigerated in an airtight container wrapped in a damp paper towel. When ready to cook, pack into steamer and steam for 10 minutes following recipe instructions.\nThe filling can be made and stored in the refrigerator 1 to 2 days ahead. Reheat by microwaving for 1 minute or steaming for 5 minutes.\nUn-steamed dumpling packets can be frozen in an airtight container for up to 3 months. To cook from frozen, steam for 15 minutes.\nVietnamese\nShrimp\nSoutheast Asian\nPork\nStovetop Seafood"
}