{
  "url": "https://www.seriouseats.com/banh-xeo-crispy-vietnamese-rice-pancakes-recipe-7112029",
  "image_url": "https://www.seriouseats.com/thmb/ERUTHEGtmkZ-5sTtNVuNyFfYHco=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230221-VyTran-BanhxeoVyTran5-0e68e6072e4f4796aeca81f4a91d609a.JPG",
  "tags": [
    "Vietnamese",
    "The Latest",
    "Shrimp",
    "Southeast Asian",
    "Pork"
  ],
  "title": "Bánh Xèo (Crispy Vietnamese Rice Pancakes With Pork and Shrimp)",
  "full_text": "Bánh Xèo (Crispy Vietnamese Rice Pancakes With Pork and Shrimp)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n80 mins\nResting Time\n30 mins\nTotal\n2 hrs 5 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\n(\n170\ng\n)\nrice flour\n1\ntablespoon\n(\n8\ng\n)\ncornstarch\n1\nteaspoon\nground turmeric\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n, divided (for\ntable salt\n, use half as much by volume)\n1 1/2\ncups\n(\n355\nml\n)\nwater\n7\nfluid ounces\ncoconut milk\n(\n200\nml\n;\n175\ng\n)\n1\ncup\nthinly sliced\nscallions\n, white and light green parts (from about\n2\nbunches\n)\n1/2\npound\n(\n227\ng\n) thinly sliced\npork belly\n, cut into 1-inch pieces\n1/2\npound\nheadless small shrimp\n(roughly 60 shrimp per pound), peeled and deveined\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\nfish sauce\nCooking oil\n, for pan-frying\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n227\ng\n), thinly sliced\n1/2\npound\n(\n227\ng\n)\nbean sprouts\n, microwaved for 1 minute\nFor Serving:\nVegetable and herb platter composed of any of the following:\nlettuce\n(such as red leaf or Bibb),\nmustard greens\n,\nsorrel\n,\nVietnamese perilla\n(can substitute shiso if unable to find),\nVietnamese coriander\n(or cilantro, if unable to find), peppermint\nRice paper\n(see note)\nNước chấm\nDirections\nFor the Batter:\nIn a large mixing bowl, mix together rice flour, cornstarch, turmeric, 1/4 teaspoon salt, water, coconut milk, and green onions. Let stand at room temperature for 30 minutes.\nSerious Eats / Vy Tran\nFor the Filling:\nMeanwhile, in a medium mixing bowl, combine pork belly, shrimp, the remaining 1/2 teaspoon salt, pepper, and fish sauce, and set aside.\nSerious Eats / Vy Tran\nTo Cook:\nIn an 8-inch nonstick skillet, heat 1 teaspoon cooking oil over medium heat until shimmering. Add several strands of sliced onion, about 5 pieces of pork belly, and about 5 pieces of shrimp, then fry, stirring occasionally, until opaque, 1 to 2 minutes.\nSerious Eats / Vy Tran\nStir batter to mix well, then ladle about 1/3 cup (50ml) batter into pan in a swirling motion. (You should hear distinct sizzling that tells you you’re at the right temperature.) Immediately swirl batter around pan to form a thin, even layer that spreads up the side of the pan; make sure the batter mostly gets under the solid ingredients to prevent holes from forming around them.\nSerious Eats / Vy Tran\nCook, undisturbed, until edges begin to pull away from side of pan, 3 to 4 minutes. Add a small handful of bean sprouts to one half of the bánh xèo.\nSerious Eats / Vy Tran\nContinue to cook until bánh xèo is crispy and golden brown with small charred bits, 5 to 6 minutes longer. Gently slide a wide silicone spatula underneath and fold in half over the beansprouts, then transfer to a wire rack. Repeat steps 3 to 6 with remaining ingredients, stirring batter each time before ladling. Bánh xèo are best eaten right away as each is ready, but you can also hold them on a wire rack in a 200°F (95°C) oven until ready to serve all together.\nSerious Eats / Vy Tran\nTo Serving:\nServe bánh xèo right away with a platter of vegetables and herbs and/or rice paper (the lettuce and rice paper can be used to wrap around the bánh xèo and herbs), and nước chấm for dipping.\nSerious Eats / Vy Tran\nNotes\nYou can use two nonstick pans at a time to speed the cooking process.\nYou can use an 8- or 10-inch nonstick skillet, adjusting the amount of batter and filling ingredients as appropriate.\nThis recipe scales up well, if larger batches are desired.\nIf using rice paper to make rolls, set a shallow dish of warm water on the table when serving; diners can dip a rice paper round in the water to soften, then form a roll.\nMake-Ahead and Storage\nThe batter and fillings can be prepared up to 1 day in advance.\nRefrigerate any leftover bánh xèo in an airtight container for up to 2 days. Reheat in an unoiled nonstick skillet over medium-low heat until hot and crispy on both sides, about 5 minutes, or bake in a 350°F (175°C) oven until hot and crispy, about 10 minutes.\nVietnamese\nThe Latest\nShrimp\nSoutheast Asian\nPork"
}