{
  "url": "https://www.seriouseats.com/banh-trang-nuong-grilled-vietnamese-rice-paper",
  "image_url": "https://www.seriouseats.com/thmb/EnCkKvxCoyo2wwOqXSk6IHiU9PY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__01__20210113-banh-trang-nuong-jenny-dorsey-1-7fb7d0485aed43fa86d32ad3f7eae4fc.jpg",
  "tags": [
    "Vietnamese",
    "Pork",
    "Rice & Grains",
    "Lemongrass",
    "Pork Mains"
  ],
  "title": "Bánh Tráng Nướng (Grilled Vietnamese Rice Paper With Egg, Pork, and Condiments)",
  "full_text": "Bánh Tráng Nướng (Grilled Vietnamese Rice Paper With Egg, Pork, and Condiments)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n100 mins\nActive\n90 mins\nTotal\n110 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Scallion Oil:\n1 1/2\ncups\n(\n275\nml\n)\nneutral oil\n, such as\npeanut\n,\nvegetable\n, or\ncanola\n7\nounces\n(\n200\ng\n)\nscallions\n(about\n2 or 3\nbunches\n), roughly chopped\nFor the Sweet Chile Sauce:\n3/4\ncup\n(\n200\nml\n)\ndistilled white vinegar\n1\ncup\n(\n200\ng\n)\nsugar\n8\nmedium\ncloves garlic\n(\n1 1/4\nounces\n;\n35\ng\n), thinly sliced\n15\nbird's eye chiles\n(\n1\nounce\n;\n30\ng\n), stemmed and thinly sliced\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\nFor the Lemongrass Pork Belly:\n3\ntablespoons\n(\n45\nml\n)\npeanut\nor other neutral\nvegetable oil\n1/2\nmedium\nred onion\n(\n3 1/2\nounces\n;\n100\ng\n), thinly sliced\n3\nstalks\nlemongrass\n, bottom 4 to 5 inches only and outer leaves discarded (\n2\nounces\n;\n55\ng\n), cut into 2-inch lengths\n7\nmedium\ncloves garlic\n(\n1\nounce\n;\n30\ng\n), smashed\nOne\n1 1/2-inch knob\npeeled\nfresh ginger\n(\n1/2\nounce\n;\n15\ng\n), thinly sliced\n2\nbird’s eye chiles\n, stemmed and halved lengthwise\n1 1/4\npounds\n(\n565\ng\n)\nskinless pork belly\n, cut into 1/2-inch cubes\nKosher salt\n3\ntablespoons\n(\n45\nml\n)\nfish sauce\n1\nteaspoon\n(\n4\ng\n)\nsugar\nFreshly\nground black pepper\nTo Cook and Assemble:\n10-inch\n(\n25 cm\n)\nrice paper wrappers\n, as needed\nScallion Oil\n, for topping\n2\nlarge\neggs\n, beaten\nLemongrass Pork Belly\n, for topping\nSweet Chile Sauce\n, for topping\nPork\n,\nshrimp\n, or\nfish floss\n, for topping (see note)\nVietnamese coriander\n(rau răm) or\ncilantro leaves\nand tender stems, finely chopped, for topping\nDirections\nFor the Scallion Oil:\nIn a small saucepan, combine oil and scallions. Set over medium heat and cook until scallion begins to sizzle lightly, about 5 minutes.\nReduce heat to low and continue to cook until scallion greens have dulled, 5 to 10 minutes longer. Remove from heat and let stand 15 minutes longer. Strain oil; discard scallions and reserve infused scallion oil for assembly.\nFor the Sweet Chili Sauce:\nIn a small saucepan, combine vinegar, sugar, garlic, chiles, and fish sauce and bring to a boil over medium heat.\nReduce heat to low and let sauce simmer until chiles have dulled in color and cooked through, approximately 10 minutes. Remove from heat and let cool 5 minutes.\nUsing a blender or immersion blender, blend sauce until chiles and garlic are well processed (if using an immersion blender, transfer the sauce to a suitable, tall, narrow container first). Set aside.\nFor the Lemongrass Pork Belly:\nIn a large skillet, heat oil over medium heat until shimmering. Add onion, lemongrass, garlic, ginger, and chiles and cook, stirring often, until softened and golden, about 5 minutes.\nIncrease heat to high. Add pork belly, season lightly with salt, and continue to cook, stirring occasionally, until pork begins to brown and crisp in spots, about 3 minutes.\nReduce heat to medium, then stir in fish sauce and sugar and season with black pepper. Continue cooking, stirring occasionally, until pork belly is well browned, about 6 minutes. Remove from heat and let cool, then discard onion, lemongrass, garlic, ginger, and chiles (some of the onion may have melted down and be difficult to remove, but that's fine). Set pork belly aside.\nTo Cook and Assemble:\nSet up your station: Set a metal wire rack directly over the gas burner of a stove (if cooking over the flame) or set a large nonstick skillet on burner. (If cooking directly over the burner, we recommend lining the stovetop around the burner with aluminum foil for easier cleanup in case of spills.) Arrange the toppings in squeeze bottles and/or small bowls with spoons.\nSet a rice paper wrapper directly on the wire rack or in the skillet. Using a clean hand, generously wet the top side of the wrapper all over with water; hold it down securely, as it will want to curl up almost immediately. Press a second rice paper wrapper directly on top. Using a long-handled metal spoon, metal tongs, and/or a metal spatula, hold the rice paper wrappers down so they remain flush with the cooking surface and don't roll up (this can be tricky but with a little practice you'll get better at it).\nTurn heat to medium high and cook, pressing down with the metal tools, rubbing in spots to help the rice paper wrappers fuse, and, if working directly over a gas burner, moving them around so they cook evenly all over, until rice paper wrappers have turned opaque and tiny bubbles have formed all over, about 30 seconds; lower or raise the heat as needed to cook them all over without burning.\nFlip rice paper wrappers over and repeat on second side, lowering heat if needed to prevent burning. Turn off heat.\nDrizzle about 2 teaspoons (10ml) scallion oil all over rice paper, then top with about 2 or 3 teaspoons beaten egg, making sure to brush it around for even coverage. Turn heat to medium and cook until egg is just beginning to set, about 30 seconds; if working directly over the burner, you may have to move the rice paper around to cook the egg in all spots.\nSpoon an even layer of pork belly all over rice paper and cook just until pork is beginning to warm, about 15 seconds; adjust heat as needed to prevent scorching\nDrizzle with chile sauce and top with pork floss and cilantro. Serve, using kitchen shears to cut the bánh tráng nướng into pieces.\nSpecial Equipment\nWire rack\nor 10- or 12-inch\nnonstick skillet\n;\nblender\nor\nimmersion blender\nNotes\nPork floss, as well as shrimp and fish floss, can be purchased at well-stocked Asian markets, as well as online.\nMake-Ahead and Storage\nThe scallion oil, sweet chili sauce, and pork can be refrigerated for up to 5 days in separate airtight containers. Warm pork before using.\nVietnamese\nPork\nRice & Grains\nLemongrass\nPork Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bnh-trng-nng-grilled-vietnamese-rice-paper-with-egg-pork-and-condiments.webp?"
}