{
  "url": "https://www.seriouseats.com/banh-mi-khong-banh-mi-bread-recipe-8303345",
  "image_url": "https://www.seriouseats.com/thmb/0cBcayIVgmS9EaHFZNZok0Lh9ug=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231002-SEA-BanhMiBread-DebbieWee-Hero3-64343a2d878a49e39768dd9533972e95.jpg",
  "tags": [
    "Rolls & Buns",
    "The Latest",
    "Bread",
    "Yeast Breads",
    "Vietnamese"
  ],
  "title": "Bánh Mì Khong (Bánh Mì Bread)",
  "full_text": "Bánh Mì Khong (Bánh Mì Bread)\nClose\nJump to recipe\nPrep\n45 mins\nCook\n25 mins\nRising and Resting Time\n3 hrs 10 mins\nTotal\n4 hrs 20 mins\nMakes\n4\nto 6 loaves\nCook Mode\n(Keep screen awake)\nIngredients\n450\ng\n(\n3 1/2\ncups\n)\nbread flour\n7\ng\n(\n1 1/2\nteaspoons\n) instant\nyeast\n(see note)\n7\ng\n(\n1 3/4\nteaspoons\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n270\ng\n(\n1 1/4\ncups\n) tepid\nwater\n25\ng\n(\n2\ntablespoons\nplus\n1\nteaspoon\n) canola or other neutral flavored\noil\n15\ng\n(\n1\ntablespoon\n) fresh\nlime juice\n12\ng\n(\n2\nteaspoons\n)\nsugar\nNonstick\ncooking spray\nDirections\nIn a stand mixer bowl, whisk flour, yeast, and salt to combine. In a liquid measuring cup or bowl, whisk water, oil, lime juice, and sugar until sugar is dissolved.\nSerious Eats / Debbie Wee\nFit stand mixer with dough hook, and on medium-low speed, slowly pour water mixture into flour mixture and mix until a shaggy dough forms, about 2 minutes. Increase the speed to medium and continue to mix, scraping down bowl and dough hook as needed, until the dough is smooth and stretchy and clears the sides of bowl, but sticks to the bottom, about 5 minutes.\nSerious Eats / Debbie Wee\nUsing clean hands, transfer dough to a lightly oiled work surface and knead by hand to form a smooth, round ball, about 30 seconds. Place dough seam side down in a lightly greased large bowl. Cover bowl with plastic wrap and let sit at warm room temperature (75°F/24°C) until doubled in size, 1 to 1 1/2 hours.\nSerious Eats / Debbie Wee\nTransfer dough to a lightly oiled work surface. Using your hands, punch dough down to deflate, then form it into a taut ball, and let rest, covered, for 20 minutes.\nSerious Eats / Debbie Wee\nDivide dough into 4 even portions for longer banh mi loaves or 6 dough portions for shorter loaves (see notes). Lightly spray the dough portions all over with cooking spray, cover with plastic wrap, and let rest for 15 minutes.\nSerious Eats / Debbie Wee\nWorking with one dough portion at a time, pull edges of the dough towards the center, pinching ends together, to create a tight ball. Set dough ball seam side down on work surface, then cup dough beneath your palm and work it in quick circular motion to form a smooth ball. Repeat with remaining portions of dough. Let rest, covered, for 15 minutes.\nSerious Eats / Debbie Wee\nFlip each dough ball so that the seam side is on top. Working with one dough ball at a time, use your fingers to press down and deflate two-thirds of the ball; the remaining one-third of the dough ball should still be airy and plump with an elongated football shape.\nSerious Eats / Debbie Wee\nUsing a small, lightly oiled French tapered rolling pin or other small rolling pin, roll the deflated side of dough until it is evenly flat and fans outward (for smaller loaves about 10 inches wide and 1/8 inch thick; for larger loaves, 12 inches wide and 1/8 inch thick), while keeping the inflated portion of the dough untouched (this ensures the center of each will be full and fluffy). The rolled out portion of the dough should be longer than the still inflated portion of the dough.\nSerious Eats / Debbie Wee\nUsing both hands and starting with the still-inflated portion of dough, gently roll the dough over itself to form a log; continue rolling until a longer baguette forms with tapered ends (you should have a tapered baguette measuring about 1 1/2 inches thick in the middle that is about 8 inches long for smaller loaves and 10 inches long for larger ones). Gently press and pinch seam closed along the length of loaf.\nSerious Eats / Debbie Wee\nTransfer shaped loaf, seam side down, to a perforated baguette tray that has been lightly coated with cooking spray (see notes). Repeat loaf shaping with remaining portions of dough, then spray the loaves evenly with cooking spray and loosely cover with plastic wrap. Let rest until the dough springs back slowly when pressed lightly, about 45 minutes.\nSerious Eats / Debbie Wee\nMeanwhile, adjust oven racks to the upper-middle position and the lowest position. Place a large baking dish on the bottom oven rack and fill halfway with boiling water. Preheat oven to 475°F (246°C).\nSerious Eats / Debbie Wee\nHolding a bread lame concave side up, with handle oriented at a 30-degree angle to loaf, make one 1/4-inch deep slash along the centerline of each loaf, using a single swift motion from one end to the other, but leaving 1/2-inch uncut at each end.\nSerious Eats / Debbie Wee\nUsing a spray bottle of water, mist the surface of each loaf. Working quickly, place loaves in the oven, then mist the inside walls of the oven with water. Bake loaves for 8 minutes, then rotate the tray and bake 4 minutes longer.\nSerious Eats / Debbie Wee\nReduce oven temperature to 400°F (205°C) and continue to bake loaves until golden brown all over, 6 to 8 minutes. If the bottoms of the loaves have not achieved the desired color, flip loaves upside down and bake until bottoms are golden brown, 2 to 3 minutes. Transfer loaves to a wire rack and let cool for at least 15 minutes before serving.\nSerious Eats / Debbie Wee\nSpecial Equipment\nStand mixer with dough hook attachment\n,\nFrench tapered or other small rolling pin\n, perforated baguette tray (preferred) or\nrimmed baking sheet\n,\nbread lame\n, spray bottle of water\nNotes\nTake care: instant yeast is not the same as active dry yeast. We prefer it for its longer shelf life and the fact that it does not require blooming before using in a recipe (read more about\ndifferent types of yeast here\n).\nBánh mì loaves are typically smaller in size for individual sandwiches, which is what 6 portions of dough will produce, but feel free to make slightly larger ones by dividing into 4 portions instead.\nA perforated baguette tray will produce the best results, but if you don't have one you can use a rimmed baking sheet, though the breads will need to be formed very well to bake into the proper shape.\nIf baking 6 loaves: Most baguette trays you should be able to to fit two 8-inch loaves in one channel to bake the full batch at once, but if for some reason your tray can't accommodate all 6 at once when making the smaller size loaves, set 2 aside and bake after the first round.\nMake-Ahead and Storage\nDough can be made ahead, covered, and refrigerated overnight to bulk proof in step 1. Let dough sit at room temperature for 30 minutes before shaping.\nBaked loaves can be stored in paper bags at room temperature for up to 2 days. If the bread's crust becomes soft, moisten the entire loaf with water before reheating in a 375°F (190°C) oven until hot and crispy.\nRolls & Buns\nThe Latest\nBread\nYeast Breads\nVietnamese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bnh-m-khong-bnh-m-bread.webp?"
}