{
  "url": "https://www.seriouseats.com/banoffee-pie-recipe-8646124",
  "image_url": "https://www.seriouseats.com/thmb/u-Bgsk54KdaVvneIWIa7YHQmcII=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240430-BanoffePie-AmandaSuarez-16-214095a548e8475085a7e2c53ac66818.jpg",
  "tags": [
    "Banana",
    "The Latest",
    "Fruit",
    "Desserts",
    "British"
  ],
  "title": "5-Ingredient British Banoffee Pie",
  "full_text": "5-Ingredient British Banoffee Pie\nClose\nJump to recipe\nPrep\n10 mins\nCook\n4 hrs\nCooling Time\n60 mins\nTotal\n5 hrs 10 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n14-ounce can\nsweetened condensed milk\n, label and glue removed\n300\ng\n(\n10 1/2\nounces\n)\ndigestive biscuits\n, such as McVitie's\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n, divided; for\ntable salt\n, use half as much by volume\n140\ng\nunsalted butter\n(about\n5\nounces\n;\n10\ntablespoons\n), melted and slightly cooled\n3\nmedium\nbananas\n(about\n16 1/2\nounces\n;\n465\ng\n), peeled and cut into 1/2-inch slices\n2\ncups\n(\n480\nml\n)\nheavy cream\nOne\n2-ounce\n(\n57\ng\n)\ndark chocolate\nbar, for garnishing (optional)\nDirections\nFor the Filling:\nSet a wire or steamer rack inside a 6- to 8-quart pot. Set unopened condensed milk can on its side on the rack, then fill pot with room-temperature water, making sure water level is at least 2 inches above can. (The can must remain fully submerged during the entirety of simmering to prevent it from warping and splitting, which can result in the can rupturing and injuries.)\nSet pot over high heat and bring to a simmer (avoid a vigorous boil). Reduce heat to maintain simmer and cook for 4 hours; check pot every 30 minutes to ensure water level stays above can, adding boiling water as necessary to keep can under 2 inches of water.\nRemove pot from heat and allow can to cool to room temperature in water, at least 1 hour. Do not attempt to open can while still hot; this can cause pressurized hot dulce de leche to spray dangerously.\nWhen dulce de leche is cool, open can and pour into a medium bowl. Whisk in 1/2 teaspoon salt until well-combined. Set aside.\nSerious Eats / Amanda Suarez\nFor the Crust:\nWhile dulce de leche is cooking, prepare the crust. Adjust oven rack to center and preheat oven to 350ºF (175ºC). In the bowl of a food processor, pulse together digestive biscuits until sandy. (Alternatively, place digestive biscuits in a zip-top bag and, using a rolling pin, crush biscuits until sandy.) Using a flexible spatula, transfer biscuit mixture to a medium bowl and stir in salt. Pour melted butter over biscuits, tossing to evenly coat crumbs in butter. Pour crumbs into a 9-inch tart pan and spread into an even layer across bottom and up the sides of the pan. Using your fingers and a flat-bottomed measuring cup, press crumbs firmly to form a compact, even layer. Bake until crust is lightly golden and smells buttery, 25 to 30 minutes. Transfer finished tart shell to a wire rack and let cool completely, about 30 minutes, before carefully removing from pan. Set aside until ready to fill.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment, whip heavy cream on medium speed until medium-soft peaks form, about 6 minutes. (Alternatively, use your favorite method for whipping cream, such as a whisk or handheld beaters.)\nSerious Eats / Amanda Suarez\nPour dulche de leche filling into crust and top with sliced bananas. Using a flexible or offset spatula, cover pie evenly with whipped cream. If garnishing with shaved chocolate, place chocolate bar on a microwave-safe plate and heat until just warm enough to leave a fingerprint, about 10 seconds. Using a Y vegetable peeler, shave sides of chocolate bar over the pie, moving the peeler in an up-and-down motion to create small chocolate curls. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFood processor\n,\nstand mixer\nMake-Ahead and Storage\nBanoffee pie can be made 1 day in advance through step 6. Whip the  cream and top the pie with it when ready to serve.\nOnce topped with whipped cream, banoffee pie can be loosely wrapped in plastic and refrigerated for up to 3 days.\nBanana\nThe Latest\nFruit\nDesserts\nBritish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/5-ingredient-british-banoffee-pie.webp?"
}