{
  "url": "https://www.seriouseats.com/barbecue-smoked-bbq-beef-chuck-recipe",
  "image_url": "https://www.seriouseats.com/thmb/p0vIZAlvrtQ5bIaSeD6OamIH4lE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160802-barbecue-chuck-12-b8d731f794b444d19e4865964fa16908.jpg",
  "tags": [
    "Smoked Beef",
    "Barbecue",
    "Grilled Beef",
    "Beef Chuck",
    "Beef Mains"
  ],
  "title": "Barbecue Smoked Beef Chuck Recipe",
  "full_text": "Barbecue Smoked Beef Chuck Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n11 hrs 30 mins\nActive\n60 mins\nTotal\n11 hrs 35 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nounces\ncoarsely ground black peppercorns\n(about\n1/3\ncup\n;\n55\ng\n) (see notes)\n2 1/4\nounces\nkosher salt\n(about\n1/4\ncup\n;\n65\ng\n)\n1\n(\n4- to 5-pound\n;\n1.8 to 2.25 kg\n) piece\nbeef chuck roll\nDill pickles\n, sliced yellow onion, and white bread, for serving\nDirections\nCombine pepper and salt in a small bowl. Rub mixture evenly over surface of chuck roll. Secure chuck roll with 2 to 3 pieces of twine, tied around its circumference at 1- to 1 1/2-inch intervals.\nLight 1/2 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nPlace chuck roll on cooler side of grill. Add 4 to 5 hardwood chunks to hotter side of grill. (If using a gas grill, wrap wood chunks loosely in aluminum foil before placing over hotter side of grill.) Cover and allow beef to smoke, adjusting vents and adding coals a few at a time or adjusting the knobs on a gas grill as necessary to maintain a temperature between 275 and 300°F (135 and 149°C) and adding 2 to 3 wood chunks twice during cooking. Smoke until a deep, dark bark has formed and internal temperature registers between 150 and 165°F (66 and 74°C), about 4 hours.\nSerious Eats / J. Kenji López-Alt\nRemove beef from grill and wrap tightly in a double layer of heavy-duty aluminum foil. Return to cooler side of grill and continue cooking, adding coals or adjusting knobs to maintain internal grill temperature between 225 and 250°F (107 and 121°C). Alternatively, you can transfer foil-wrapped chuck to a wire rack set in a rimmed baking sheet and finish in a preheated 225°F (110°C) oven indoors. (Warning: This will make your whole house smell strongly of smoke.) Cook until meat is almost completely tender and a fork inserted and twisted shows little resistance, 5 to 5 1/2 hours longer. Remove foil, return to grill or oven, and continue cooking until a crisp bark forms, about 30 minutes. Remove from heat, transfer to a cutting board, tent with foil, and allow to cool until internal temperature drops to between 140 and 165°F (60 and 74°C) before serving, 30 minutes to 1 hour.\nSerious Eats / J. Kenji López-Alt\nTo serve, slice meat in half with its grain, running knife in between the two largest muscle groups to separate them. Discard twine and place the two halves cut side down on the cutting board.\nSlice meat thinly against the grain, using a sharp chef's knife or slicing knife. Serve beef with sliced onion, pickles, and white bread. For best results, slice only what you are serving. Remaining chuck can be wrapped in foil and stored in the refrigerator for up to 1 week. Reheat leftover chuck in a 275°F (135°C) oven directly in the foil until hot, about 1 hour.\nSpecial Equipment\nButcher's twine,\nspice grinder\n(see notes),\ngrill\n,\nhardwood chunks\n,\nchimney starter\n,\nwire rack and rimmed baking sheet\n(if finishing in the oven),\ninstant-read thermometer\nNotes\nYou can grind pepper in a\npepper mill\n, a\nfood processor\n, or a\nblade grinder\n, but the easiest way to get a consistent coarse grind in bulk is to use a burr grinder.\nRead More\nSous Vide Smoked Beef Chuck\nSous Vide Smoked Brisket\nHow to Get Started Grilling\nGuide to Grilling: Smoking on a Charcoal Kettle Grill\nSmoked Beef\nBarbecue\nGrilled Beef\nBeef Chuck\nBeef Mains"
}