{
  "url": "https://www.seriouseats.com/barbecue-competition-style-ribs-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5UTAiMhkGfZMkd2brQYO_KvoeIA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__07__20120828-220544-competition-ribs-2-9e3edd3fc4844a538fc2a73abc42564e.jpg",
  "tags": [
    "Pork Mains",
    "Grilled Pork",
    "Pork",
    "Memorial Day"
  ],
  "title": "Competition-Style Barbecue Ribs",
  "full_text": "Competition-Style Barbecue Ribs\nClose\nJump to recipe\nPrep\n10 mins\nCook\n6 hrs 50 mins\nActive\n2 hrs\nTotal\n7 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nracks\nSt. Louis-cut pork ribs\n1/2\ncup\nyellow mustard\n1\ncup\nyour favorite\nbarbecue rub\n2\ncups\napple juice\n, divided, 1 cup placed in a squirt bottle\n2 to 3\nfist size\nchunks\nof\nlight smoking wood\n, such as cherry or apple\n1\ncup\nyour favorite\nbarbecue sauce\n1/2\ncup\nagave syrup\n(optional)\n1/2\ncup\ndark brown sugar\n(optional)\nDirections\nRemove membrane from back of each rack, and trim ribs of excess fat. Brush meat side of each rack with yellow mustard, then rub liberally with barbecue rub on both sides.\nSerious Eats / Joshua Bousel\nFire up smoker or grill to 225°F (105°C), adding chunks of smoking wood when at temperature. When wood is ignited and producing smoke, place ribs in smoker or grill, meat side up. Smoke until ribs darken to a deep mahogany, about 3 hours, misting with apple juice in a squirt bottle every hour.\nSerious Eats / Joshua Bousel\nWrap each rack, meat side up, in extra-large heavy duty aluminum foil, leaving an opening on one end of foil. Pour 1/2 cup of apple juice in each foil pack through opening, seal, and place back on smoker or grill for 1 hour.\nSerious Eats / Joshua Bousel\nRemove ribs from foil and place ribs back in smoker and continue to cook until ribs have a slight bend when lifted from one end, 1 to 2 hours more, squirting with apple juice every hour. Remove ribs from smoker or grill, wrap in foil, and place in an empty cooler to keep warm while preparing grill.\nSerious Eats / Joshua Bousel\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread coals evenly over entire surface of coal grate. Alternatively, set all burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate. Remove racks from foil and brush with barbecue sauce. Place ribs face down over hot fire and cook until sauce caramelizes, 2 to 5 minutes. Remove racks from grill.\nSerious Eats / Joshua Bousel\nFor extra sweet and shiny ribs:\nTear off two more large sheets of aluminum foil longer than each rack. In a rectangle the approximate size of each rack of ribs, spread 1/4 cup of agave syrup and sprinkle 1⁄4 cup brown sugar on top of agave on each piece of foil. Place ribs, meat side down, on top of agave and sugar, and wrap foil closed around ribs. Place ribs back on smoker for 15 minutes. Remove ribs from smoker and foil, then slice and serve.\nSerious Eats / Joshua Bousel\nSpecial Equipment\nSmoker\nor\nGrill\nRead More\nRoasted Spiced Lamb Ribs\nBourbon Baby Back Ribs\nGrilled Corn with Garlic and Soy Butter\nPork Mains\nGrilled Pork\nPork\nMemorial Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/competition-style-barbecue-ribs.webp?"
}