{
  "url": "https://www.seriouseats.com/barbecue-bacon-burgers-recipe",
  "image_url": "https://www.seriouseats.com/thmb/hGFt-CCaish2rqIzlJ0By0HFKoE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120713-burger-topping-variations-07-ae08265bb93a43a3a645035192ce80cd.jpg",
  "tags": [
    "Burgers",
    "Grilled Beef",
    "Ground Beef",
    "Bacon",
    "Quick Dinners"
  ],
  "title": "Barbecue Bacon Burgers",
  "full_text": "Barbecue Bacon Burgers\nClose\nJump to recipe\nPrep\n5 mins\nCook\n55 mins\nActive\n30 mins\nTotal\n60 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nfreshly\nground beef chuck\nKosher salt\nand freshly\nground black pepper\n6\nslices\nthick-cut slab bacon\n, split in half crosswise (see note)\n1\nonion\n, cut into 1/4-inch-thick rings\n1/2\ncup\nbarbecue sauce\n4\nslices\ncheddar\nor\nAmerican cheese\n4\nsturdy\nburger buns\nDirections\nDivide meat into four even piles and shape into burger patties about 1/2-inch wider than burger buns. Season generously with salt and pepper and set aside.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate.\nPlace bacon and onions in between hot and cool sides of grill and cook, turning occasionally, until surface of bacon is bubbling but not yet crisp and browned, and onion is lightly softened, about 15 minutes total.\nPlace burgers directly over hot side of grill and cook until well charred, about 2 minutes. Flip patties and brush with sauce. Cook on second side until well charred, about 2 minutes longer, brushing with sauce occasionally. Flip burgers again, transfer to cooler side of grill, brush with more sauce, and continue to cook, brushing with sauce occasionally, until patty registers 125°F (52°C) to 130°F (54°C) on an instant-read thermometer for medium rare, about 5 minutes total, or 135°F (57°C) to 140°F (60°C) for medium, about 6 minutes total. Top each burger patty with 1 slice cheese, then transfer to a large plate and tent with aluminum foil.\nBrush bacon with barbecue sauce and place directly over hot side of grill, sauce-side down. Brush top with barbecue sauce. Cook until well charred, about 1 minute. Flip and cook until second side is well charred, about 1 minute longer. Top each burger patty with three pieces bacon, then top each with a couple of slices of onion.\nToast buns directly over hot side of grill until browned, about 30 seconds.\nPlace bottom buns on a cutting board. Transfer patty/bacon/onions to bottom bun (see note). Brush top bun with barbecue sauce and close sandwich. Serve.\nNotes\nFor best results, use slab bacon, rind removed, cut into 1/4-inch-thick slices.\nFor a bigger burger, top with sliced avocado and fried pork rinds.\nSpecial Equipment\nGrill\n,\nchimney starter\n, brush,\ninstant-read thermometer\nRead More\nHow to Get Started Grilling\n10 Tips for Better Burgers\nTaste Test: Best Cheddar Singles for Cheeseburgers\nThe Ultimate Bacon Cheeseburgers Recipe\nGrilled Korean-Style Bulgogi Burgers With Kimchi Mayo and Pickled Daikon Recipe\nBurgers\nGrilled Beef\nGround Beef\nBacon\nQuick Dinners",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/barbecue-bacon-burgers.webp?"
}