{
  "url": "https://www.seriouseats.com/basbousa-bel-ashta-recipe-7109622",
  "image_url": "https://www.seriouseats.com/thmb/bf_u68qk40l_tQMUhWCuc_c4IjE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230223-BasbousaBelAshta-FredHardy-01-f5cf0481dcf34a33b94ee0f9a2d441f9.JPG",
  "tags": [
    "The Latest",
    "Cakes",
    "North African",
    "Desserts",
    "Middle Eastern"
  ],
  "title": "Basbousa Bel Ashta (Semolina Cake With Ashta Cream Filling)",
  "full_text": "Basbousa Bel Ashta (Semolina Cake With Ashta Cream Filling)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n60 mins\nCooling and Chilling Time\n5 hrs 30 mins\nTotal\n6 hrs 50 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Ashta (Cream Filling):\n1\ncup\n(\n237\nml\n)\nwhole milk\n1\ncup\n(\n237\nml\n)\nheavy cream\n2\ntablespoons\n(\n16\ng\n)\ncornstarch\n2\ntablespoons\n(\n16\ng\n)\nall-purpose flour\n1\ntablespoon\n(\n15\ng\n)\ngranulated sugar\n2\nmastic resin\ncrystals\nor\ntears\n, crushed (about\n1/2\nteaspoon\n), see note\n1/4\ncup\ncream cheese\n(\n2\nounces\n;\n55\ng\n)\n1\nteaspoon\n(\n5\nml\n)\nrose water\nFor the Simple Syrup:\n1\ncup\n(\n237\nml\n)\nwater\n1\ncup\n(\n200\ng\n)\ngranulated sugar\nOne\n1 1/2–inch strip\nnavel orange rind\n3\ncardamom pods\n, bruised\nOne\n3-inch\ncinnamon stick\n2\nwhole\ncloves\n1\nteaspoon\n(\n5\nml\n)\norange blossom water\nFor the Basbousa Bel Ashta:\nUnsalted butter\n, softened, for preparing the pan\nAll-purpose flour\n, for preparing the pan\n1\ncup\ncoarse\nsemolina\n(\n5.5\nounces\n;\n156\ng\n)\n1/2\ncup\ngranulated sugar\n(\n3.5\nounces\n;\n100\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n2\nteaspoons\nbaking powder\n1/8\nteaspoon\nbaking soda\n1\ncup\nplain whole milk yogurt\n(\n8.3\nounces\n;\n235\ng\n)\n3\nlarge\neggs\n, at room temperature (\n6\nounces\n;\n170\ng\n)\n1\ntablespoon\norange zest\n(from\n2\nmedium\noranges\n), finely grated\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\n3/4\ncup\n(\n177\nml\n)\ncanola\nor other\nneutral oil\n2\ncups\nAshta\n(\n16.2\nounces\n;\n460\ng\n), from recipe above\n1/2\ncup\n(\n120\nml)\nsimple syrup\n(recipe above)\n1/4\ncup\nchopped\nraw, unsalted pistachios\n, to garnish (\n1.2\nounces\n;\n35\ng\n)\nOrange zest curls\n, to garnish\nDirections\nFor the Ashta (Cream Filling):\nIn a medium saucepan, whisk together milk, cream, and cornstarch over low heat until cornstarch is completely dissolved. Whisk in flour until thoroughly incorporated, about 1 minute. Add sugar and whisk until dissolved.\nWhisk in crushed mastic and cream cheese until mastic is melted and mixture is smooth. Increase heat to medium and, stirring constantly, bring mixture to a boil. Boil until mixture reaches a thick, custard-like consistency, about 2 minutes. Stir in rose water and remove from the heat.\nSerious Eats / Fred Hardy\nTransfer ashta to a bowl, place plastic wrap directly on the surface (this prevents a skin from forming), and set aside to cool completely, about 1 hour.\nFor the Simple Syrup :\nIn a medium saucepan, combine water and sugar, set over low heat, and cook, stirring often, until sugar is fully dissolved, about 5 minutes.\nStir in orange rind, cardamom, cinnamon, and cloves. Increase heat to medium and bring the syrup to a simmer. Simmer, undisturbed, until it thickens slightly, 3 to 5 minutes. (The syrup should be thicker than water, but not as viscous as honey.)\nStir in orange blossom water and remove from the heat immediately. Cover and set aside to keep warm.\nFor the Basbousa Bel Ashta:\nAdjust oven rack to middle position and preheat to 350°F (180°C). Butter and flour a 9-inch springform pan, tapping out any excess flour.\nIn a large mixing bowl, whisk together the semolina, granulated sugar, salt, baking powder, and baking soda. Add the yogurt, eggs, orange zest, vanilla extract, and canola oil, and whisk until batter is completely smooth.\nFill the pan with 2 cups (473ml) batter. Bake until the top is set and dry to the touch, and the cake begins to pull away from the sides of the mold, 10-15 minutes. Remove basbousa from the oven.\nUsing an offset spatula, carefully spread ashta in an even layer on top of the basbousa, then carefully pour the remaining 1 1/2 cups (355ml) basbousa batter on top. Bake until the cake is golden brown, springy yet dry to the touch, and begins to pull away from the sides of the mold, 30-40 minutes.\nSerious Eats / Fred Hardy\nRemove basbousa from oven and place on a wire rack. Immediately pour the warm simple syrup on top, working slowly to ensure the cake evenly soaks. Allow basbousa to cool completely, about 90 minutes, then cover and refrigerate at least 3 hours but preferably overnight before serving.\nSerious Eats / Fred Hardy\nTo serve, unmold the basbousa and transfer it to a serving dish. Brush the surface of the basbousa with a thin layer of simple syrup. Garnish with chopped pistachios and orange zest curls. Serve cold with extra simple syrup on the side.\nSpecial Equipment\nWhisk, 9-inch springform mold, offset spatula\nNotes\nMastic or mastica is a natural extract of the mastic tree that grows in Greece. You can order it online or buy it from Middle Eastern stores.\nThe best way to crush mastic is to crush frozen mastic, mixed with a pinch of sugar, using a mortar and pestle; in this recipe you can also put it in a zipper-lock bag and crush it with a heavy rolling pin or skillet (it will dissolve easily into the hot milk mixture even if not finely crushed). Mastic’s flavor is strong and can make your dish bitter if used in excessive quantities.\nIf you make the simple syrup ahead of time, warm it up before you pour it over the hot basbousa. The simple syrup should be just warm to touch.\nMake-Ahead and Storage\nThe ashta can be made 1-2 days in advance and stored in the fridge.\nThe simple syrup can be made 2-5 days ahead of time, and kept at room temperature in a clean glass jar.\nStored in an airtight container, the basbousa will keep for 2-4 days in the fridge.\nThe Latest\nCakes\nNorth African\nDesserts\nMiddle Eastern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/basbousa-bel-ashta-semolina-cake-with-ashta-cream-filling.webp?"
}