{
  "url": "https://www.seriouseats.com/basic-pizza-dough-for-high-temperature-outdoor-pizza-ovens-5211302",
  "image_url": "https://www.seriouseats.com/thmb/ACyF6kv3V4qAo_H9E-98X5jhuDc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211115-OONI-PIZZA-ARMENIAN-ANDREW-JANJIGIAN-23-5447ecc61b12450d9a09f38cca67c19c.jpg",
  "tags": [
    "Pizza",
    "Italian",
    "American",
    "Yeast Breads",
    "The Latest"
  ],
  "title": "Outdoor Pizza Oven Pizza Dough",
  "full_text": "Outdoor Pizza Oven Pizza Dough\nClose\nJump to recipe\nPrep\n5 mins\nRising Time\n24 hrs\nTotal\n24 hrs 5 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n535\ng\n(\n18.9\nounces\n; about\n4\ncups\nplus\n3\ntablespoons\n)\nhigh protein all-purpose flour\n, such as King Arthur (Baker’s percentage: 100%), see note\n2\ng\n(\n0.07\nounce\n;\n1/2\nteaspoon\n)\ninstant dry yeast\n, such as SAF (Baker’s percentage: 0.4%), see note\n360\ng\n(\n12.7\nounces\n; about\n1 1/2\ncups\nplus\n1\ntablespoon\n)\nwater\n, at 40°F (4°C) (Baker’s percentage: 67%), see note\n12\ng\n(\n0.4\nounce\n;\n1\ntablespoon\n) Diamond Crystal\nkosher salt\n(Baker’s percentage: 2%)\nExtra-virgin olive oil\nfor oiling proofing containers and dough balls\nDirections\nCombine flour and yeast in the bowl of a food processor. Pulse 3 to 4 times until well-combined. With machine running, add water and continue to process until mixture forms rough ball and no dry flour remains, 10 to 20 seconds. Allow to rest for 20 minutes.\nSerious Eats / Melissa Rivard\nAdd salt to top of dough and process until a mostly smooth ball of dough forms, 20 to 30 seconds. Dough temperature should register 75°F (24°C) on an instant-read thermometer when mixing is complete. If not, continue to mix in 10 second intervals until it reaches the desired dough temperature. Transfer dough ball to a lightly oiled medium bowl and knead once or twice by hand until smooth ball is formed. Cover bowl and let dough sit for 45 minutes.\nSerious Eats / Melissa Rivard\nUsing lightly-moistened hands, knead dough in bowl until uniform in texture, 5 to 10 seconds. Cover and let sit at room temperature until puffy and not quite doubled in volume, 60 to 120 minutes.\nSerious Eats / Melissa Rivard\nTransfer dough to a lightly floured countertop and divide into four pieces of about 225g (8 ounces) each for 12-inch ovens, or three pieces of about 300g (10.5 ounces) each for 16-inch ovens. Form each portion into a smooth, round ball. Coat exterior of dough ball lightly with oil and place each in a 4- to 7-inch round, lidded plastic takeout container, or on a lightly-oiled tray, spaced at least 2 inches apart, covered loosely but completely. Refrigerate dough for at least 24 hours or up to 4 days (48 to 72 hours is ideal).\nSerious Eats / Melissa Rivard\nOn the day you plan to bake pizzas, remove dough balls from refrigerator and allow to warm up, covered, 1 to 2 hours before baking. Exact timing depends upon ambient temperature; dough should reach at least 60°F (15.5°C) before stretching and baking.\nSerious Eats / Melissa Rivard\nSpecial Equipment\nDigital scale\n;\njeweler's scale\nor\nprecision coffee scale\n;\nfood processor\n; round plastic takeout containers or\ndough-proofing boxes\nNotes\nFor best results, use a digital scale set in grams to measure ingredients. For the yeast, using a jeweler's scale will give you the most precise measurement possible.\nIf King Arthur all-purpose flour is unavailable, bread flour may be used in its place.\nOnce you are comfortable working with this dough, you can try increasing the hydration. I really like this dough at 70% hydration, but it's slightly more difficult to work with, and inexperienced pizza-makers may find that it's more prone to tearing during stretching. To increase the hydration to 70%, use 375g (13.2 ounces) of water in step 1 (an additional 25g).\nMake-Ahead and Storage\nThe pizza dough needs to be made at least 24 hours ahead of baking. It can be refrigerated for up to 4 days, but 2 to 3 days is ideal. Or, for long-term storage,\nfreeze the dough balls\nonce fully fermented.\nRead More\nHow to Make Great Pizza in an Outdoor Pizza Oven\nThe Best Outdoor Pizza Ovens\nBasic New York-Style Pizza Dough Recipe\nBasic Neapolitan Pizza Dough Recipe\nPizza\nItalian\nAmerican\nYeast Breads\nThe Latest"
}