{
  "url": "https://www.seriouseats.com/basic-crepes-batter-recipe",
  "image_url": null,
  "tags": [
    "Crepes",
    "French",
    "Stovetop",
    "Quick Breakfast",
    "Mother's Day"
  ],
  "title": "Basic Crepe Batter Recipe",
  "full_text": "Basic Crepe Batter Recipe\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n4\nto 5 servings\nMakes\n8\nto 10 crepes\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\neggs\n1 1/4\ncups\nwhole milk\n(\n10\nfluid ounces\n;\n280\nml\n)\n1\ncup\nflour\n(\n5\nounces\n;\n140\ng\n)\n1\ntablespoon\nmelted unsalted butter\nor\nvegetable oil\n(\n1/2\nounce\n;\n15\nml\n), plus more for cooking\nPinch\nkosher salt\n1\ntablespoon\n(\n8\ng\n)\nsugar\n, if making sweet crepes\n1\ntablespoon\nminced fresh herbs\n, such as\nparsley\n,\ntarragon\n,\nchervil\n, or\nchives\n(optional; for savory crepes)\nDirections\nFor the Batter:\nCombine eggs, milk, flour, melted butter or oil, salt, and sugar (if using) in a blender. Start blender on low speed and increase to high. Blend until smooth, about 10 seconds. Add herbs (if using) and pulse to combine. (Alternatively, you can combine the ingredients in a mixing bowl and whisk vigorously until smooth.)\nTo Cook:\nHeat a 10-inch nonstick or well-seasoned cast iron or carbon steel skillet over medium heat for 2 minutes. Lightly grease with oil or butter, using a paper towel to wipe out the excess.\nSerious Eats / J. Kenji López-Alt\nHold the pan's handle in one hand and pour in 3 to 4 tablespoons (45 to 60ml) batter, swirling and tilting pan immediately to spread batter in a thin, even layer over bottom of pan.\nSerious Eats / J. Kenji López-Alt\nLet cook until top looks dry, about 20 seconds. Using a thin metal or nylon spatula, lift one edge of crepe. Grab that edge with the fingers of both hands and flip crepe. Cook on second side for 10 seconds, then transfer to a plate. Repeat with remaining batter. Fill crepes as desired (such as with butter, sugar, and lemon juice; with butter and jam; with\nham, cheese, and eggs\n; or with\nspinach and feta\n) and serve. Crepes can also be made ahead and stored, unfilled and wrapped in plastic, in the refrigerator for up to 3 days. Reheat in a nonstick pan to serve.\nSpecial Equipment\n10-inch\nnonstick skillet\nor well-seasoned\ncast iron\nor\ncarbon steel skillet\n;\nblender\nMake Ahead and Storage\nThese crepes can be cooked ahead of time and stored, unfilled and wrapped in plastic, in the refrigerator for up to three days. Reheat in a nonstick pan to serve.\nRead More\nFrench Crepes With Ham, Cheese, and Eggs\nFrench Crepes With Spinach and Feta\nMonte Cristo Crepes\nCrepes\nFrench\nStovetop\nQuick Breakfast\nMother's Day"
}