{
  "url": "https://www.seriouseats.com/basic-white-rice-recipe-5189757",
  "image_url": "https://www.seriouseats.com/thmb/NF00TRHDDrbGsMHwXb5_HKyGgUY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210608-stovetop-white-rice-vicky-wasik-seriouseats-seriouseats-12-4f850a128593498dab6ef7c151544ad0.jpg",
  "tags": [
    "White Rice",
    "Stovetop"
  ],
  "title": "Basic White Rice",
  "full_text": "Basic White Rice\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nResting Time\n5 mins\nTotal\n30 mins\nServes\n3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n200\ng\n) long-grain\nrice\n, such as\njasmine\nor\nCarolina rice\n(see note)\n1\ncup\n(\n240\nml\n)\nwater\n, plus more for rinsing rice\nDirections\nPlace rice in a large bowl and cover by 2 inches with cool water. Using your hands, vigorously swish rice until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. Refill the bowl with cool water, and repeat rinsing and draining process until rinsing water runs clear.\nVicky Wasik\nTransfer drained rice to a 2-quart saucepan. Add 1 cup (240ml) fresh water, very gently swirling pan to evenly distribute rice. Carefully cover pot with layer of plastic wrap and stretch to tighten edges, being sure to crimp plastic so that it doesn't drape too far down the sides of the pot. Cover plastic with a layer of aluminum foil, crimping edges to form a tight seal.\nVicky Wasik\nPlace an 8- to 12-inch cast iron skillet on top of pot and weigh it down with additional heatproof skillets, canned tomatoes, or other weights, if possible. Bring rice to rapid boil over high heat (the pot should emit a quiet, high-pitched whistle if your seal is tight enough, or you might see a small amount of steam escape; otherwise you should be able to hear the rumbling of the boiling water in the sealed pot, assuming your kitchen is quiet enough), 2 to 4 minutes. Immediately lower heat to lowest setting and simmer until water is absorbed and rice is cooked through. The time this takes will depend on the rice you're using and your personal doneness preference, and can range from about 15 to 25 minutes; we recommend starting with the suggested time on the package instructions and then decreasing the time in future batches if you want more resilient grains, or increasing the time if you want softer grains.\nVicky Wasik\nRemove skillet and weights, then carefully peel off foil and plastic wrap. Fluff gently with a rubber spatula or fork to separate grains, re-cover with the foil, and let rest for at least 5 minutes before serving.\nVicky Wasik\nSpecial Equipment\n2-quart saucepan, 8- to 12-inch\ncast iron pan\n, plus more \"weights\" if possible (additional skillets, unopened canned tomatoes, etc.)\nNotes\nDepending on the variety of long-grain rice, cook time may vary according to amylose-amylopectin content. For consistent results, it’s best to cook any particular brand of rice more than once to gauge how long you might need to cook your rice to your desired texture.\nMake-ahead and Storage\nLeftover rice can be refrigerated in an airtight container for up to 1 week.\nWhite Rice\nStovetop",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/basic-white-rice.webp?"
}