{
  "url": "https://www.seriouseats.com/basic-square-pan-pizza-dough-recipe-sicilian-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KTkIVBUhQG-Y2NvDsfKZqTJ5Bzw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20110114-square-pie-pizza-primary2-192cd0baf39c421eb358b668402b1ab8.jpeg",
  "tags": [
    "Pizza"
  ],
  "title": "Basic Square Pan Pizza Dough Recipe (Sicilian-Style Dough)",
  "full_text": "Basic Square Pan Pizza Dough Recipe (Sicilian-Style Dough)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n15 mins\nRising and Cooling Time\n2 hrs 5 mins\nTotal\n2 hrs 45 mins\nServes\n4 servings\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\n17.5\nounces\n(\n500\ng\n, about\n3 1/2\ncups\n) all-purpose or\nbread flour\n0.35\nounce\n(\n10\ng\n, about\n2\nteaspoons\n)\nkosher salt\n0.18\nounce\n(\n5\ng\n, about\n1\nteaspoon\n) instant or\nRapidRise yeast\n1/2\ncup\nextra virgin olive oil\n, divided\n12.25\nounces\n(\n347\ng\n, about\n1 1/2\ncups\nplus\n1 1/2\ntablespoons\n)\nwater\n, room temperature\nDirections\nCombine flour, salt, yeast, and 2 tablespoons olive oil in bowl of stand mixer (see note for mixer-free version). Whisk to combine. Add water to mixer and mix on medium speed until it comes together and no dry flour remains. Increase speed to medium-high and mix until the dough is stretchy and smooth, about 6 minutes. The dough should stick to the bottom of the bowl but pull away from the sides.\nPour remaining olive oil into rimmed baking sheet and spread over entire inner surface with hands. Transfer dough to 13- by 18-inch rimmed baking sheet and rub top surface with oil until thoroughly coated. Cover with baking sheet with plastic wrap and allow to rise at room temperature until dough has spread out to touch nearly each rim of baking sheet, about 2 hours.\n30 minutes before baking, adjust oven rack to middle position and preheat oven to 550°F. Carefully remove plastic wrap from pizza dough. Using oiled hands and being as gentle as possible to maintain air bubbles, push and stretch the dough into the corners of the pan by pressing out from the center and lifting each corner and stretching it beyond the edge of the pan. It should pull back until the pan is just filled with dough.\nTop pizza as desired (see note) and bake until bottom is crisp and top surface is bubbling, 15 to 20 minutes total. Allow to cool at room temperature for 5 minutes.\nSpecial Equipment\nStand mixer\n, 13- by 18-inch\nrimmed baking sheet\nThis Recipe Appears In\nThe Pizza Lab: Three Doughs to Know\nThe Food Lab: 11 Essential Tips for Better Pizza\nPizza"
}