{
  "url": "https://www.seriouseats.com/basque-cheesecake",
  "image_url": null,
  "tags": [
    "Cheesecakes",
    "Desserts",
    "Recipes",
    "Spanish",
    "The Latest"
  ],
  "title": "Basque Cheesecake",
  "full_text": "Basque Cheesecake\nJump to recipe\nPrep\n50 mins\nCook\n52 mins\nActive\n60 mins\nCooling Time\n5 hrs\nTotal\n6 hrs 42 mins\nServes\n12 servings\nMakes\n1 cheesecake\nCook Mode\n(Keep screen awake)\nIngredients\n32\nounces\n(\n900\ng\n)\nfull-fat cream cheese\n, such as Philadelphia, brought to about 70°F (21°C)\n9 1/2\nounces\nsugar\n(about\n1 1/3\ncups\n;\n270\ng\n), plus\n1\ntablespoon\n(\n15\ng\n), divided\n5\nlarge\neggs\n, at room temperature\n2\nlarge\nyolks\n(\n30\ng\n) from\n2\nlarge\neggs\n8\nfluid ounces\nheavy cream\n(\n240\nml\n), at room temperature\n2\nteaspoons\nvanilla extract\n(\n8\ng\n;\n10\nml\n)\nFinely grated zest\nof\n1\nwhole\nlemon\n(about\n1 1/2\nteaspoons\n;\n45\ng\n)\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume or the same weight\n2\ntablespoons\n(\n20\ng\n)\nall-purpose flour\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (200°C). Cut two 12- by 16-inch pieces of parchment paper. Arrange the 12- by 16-inch pieces of parchment in an overlapping pattern to line a greased 9- by 3-inch springform cake pan, leaving at least 1 to 3 inches of parchment overhanging the rim of the pan on all sides. Set aside.\nSerious Eats / Vicky Wasik\nIn the bowl of a stand mixer fitted with the paddle attachment, combine cream cheese and 9 1/2 ounces (270g) sugar. Mix on medium-low speed, scraping down sides of bowl as needed, until no lumps of cheese remain, sugar is dissolved, and mixture is smooth, 3 to 4 minutes.\nSerious Eats / Vicky Wasik\nWith mixer on medium-low speed, add eggs one at a time, beating for 10 seconds before adding the next. Add egg yolks, and beat on low speed until fully incorporated, 5 to 10 seconds. Stop the mixer and scrape down sides of the bowl with a silicone spatula, making sure the mixture is smooth and homogenous.\nSerious Eats / Vicky Wasik\nAdd cream, vanilla, lemon zest, and salt. Mix on low speed until fully combined and smooth, about 15 seconds. Using a fine-mesh strainer, sift flour over batter. Beat on low speed just until combined, 15 to 30 seconds, stopping to scrape down sides of bowl as needed. Pour batter into prepared pan, and refrigerate for at least 30 minutes and up to 1 hour.\nSerious Eats / Vicky Wasik\nWhen ready to bake, remove cake pan from refrigerator, set on a rimmed baking sheet, and sprinkle remaining 1 tablespoon (15g) sugar evenly over surface of batter.\nSerious Eats / Vicky Wasik\nBake cheesecake, rotating pan 180 degrees halfway, until cheesecake jiggles as a whole, surface is deeply browned, and the outer edge feels slightly firm but the inner 4 1/2 to 5 inches still seems wobbly and underdone, 50 to 60 minutes. You can also check doneness with an instant-read thermometer: the cheesecake is done when the very center registers between 150 and 155ºF (65.5 to 68ºC) when an instant-read thermometer is inserted to a depth of 2 inches. For a more deeply browned top, see notes below.\nSerious Eats / Vicky Wasik\nLet cheesecake cool in the pan on a wire rack at room temperature for 1 hour. Refrigerate uncovered for at least 4 hours before unmolding. To unmold the cheesecake, unlatch springform pan and remove pan sides. Holding by parchment overhang, carefully transfer cake to a cutting board or serving plate. Gently peel back parchment from sides of cheesecake, and use a sharp knife to cut into wedges. Serve chilled or allow the cheesecake to come  to room temperature before serving. Leftover cheesecake can be covered and refrigerated for up to 3 days.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n9-inch springform pan,\nstand mixer\n, fine-mesh strainer, rimmed baking sheet\nNotes\nIf you’d like more color on your cheesecake you can give it a brief stint under the broiler with your oven rack positioned about 7 inches from the top heating element. Be sure to keep a close eye on it as it can go from brown to burned very quickly.\nMake-Ahead and Storage\nThe cheesecake can be made up to 3 days in advance; once cooled to room temperature after baking, wrap tightly with plastic and refrigerate for up to 3 days.\nCheesecakes\nDesserts\nRecipes\nSpanish\nThe Latest"
}