{
  "url": "https://www.seriouseats.com/bavarian-style-soft-pretzels-recipe-7967998",
  "image_url": "https://www.seriouseats.com/thmb/4KIg795JOLi_jyZ_vEq5-k3WgVc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230911-GERMAN-PRETZELS-ANDREW-JANJIGIAN-75hero_1-e8187b77b4204a4c9ed5aaa5618fd8f1.jpg",
  "tags": [
    "Baking",
    "The Latest",
    "Western European"
  ],
  "title": "Laugenbrezel (Bavarian-Style Soft Pretzels)",
  "full_text": "Laugenbrezel (Bavarian-Style Soft Pretzels)\nClose\nJump to recipe\nPrep\n15 hrs\nCook\n12 mins\nTotal\n15 hrs 12 mins\nMakes\n6 pretzels\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Poolish:\n80\ng\nhigh-protein all-purpose flour\n(\n1/2\ncup\nplus\n1\ntablespoon\n), such as King Arthur, or bread flour (see notes)\n1/4\nteaspoon\ninstant yeast\n80\ng\n(\n1/3\ncup\n) room-temperature\nwater\nFor the Dough:\n245\ng\nhigh-protein all-purpose flour\n(\n1 3/4\ncups\n), such as King Arthur, or\nbread flour\n(see note)\n1\nheaping\nteaspoon\nDiamond Crystal\nkosher salt\n; if using\ntable salt\n, use half as much by volume\n90\ng\n(\n1/3\ncup\nplus\n2\nteaspoons\n) warm\nwater\n, at 90ºF (32ºC)\n14\ng\nunsalted butter\n(\n1\ntablespoon\n), melted and slightly cooled\nFor Dipping the Pretzels (for alternate baking soda method, see notes):\nNonstick cooking spray\n30\ng\n(\n5\nteaspoons\n)\nfood-grade lye crystals\n720\ng\n(\n3\ncups\n)\nwater\n1 to 2\nteaspoons\npretzel salt\nDirections\nFor the Poolish:\nIn a medium bowl, whisk together flour and yeast to combine. Add water and, using a dough whisk or wooden spoon, stir until combined and no dry bits remain. Cover tightly and let sit at warm room temperature (72 to 77˚F; 22 to 25ºC) until dough is bubbly and has expanded by about half, 3 to 4 hours. Refrigerate for at least 8 hours or up to 24 hours.\nSerious Eats / Amanda Suarez\nFor the Dough:\nAdd water and butter to bowl with the poolish and, using a dough whisk or wooden spoon, stir until mixture is mostly uniform. In a medium bowl, whisk to combine flour and salt. Add flour mixture to the poolish, water, and butter mixture and knead by hand until shaggy but uniform dough forms. Cover well and let sit at warm room temperature (72 to 77˚F; 22 to 25ºC) for 30 minutes.\nSerious Eats / Andrew Janjigian\nUsing slightly moistened hands, knead dough in bowl until uniform in texture, 15 to 30 seconds. Cover well and let sit until puffy and expanded by about half, 60 to 90 minutes.\nSerious Eats / Amanda Suarez\nTo Form the Pretzels:\nLine a rimmed baking sheet with a silicone baking mat or parchment paper lightly coated with nonstick cooking spray. Lightly flour top of dough, then transfer to a lightly-floured work surface. Using a dough scraper, divide dough into 6 equal wedges of about 88g (3 ounces) each. Starting with the pointy end of the wedge, roll each wedge into a log about 3 inches long, pinching the edge of the rolled-up log along its length to seal. (Do not pinch the log's ends closed.) Cover the logs with an inverted container large enough to contain them all without touching, or a clean plastic garbage bag.\nSerious Eats / Andrew Janjigian\nClear your countertop of any flour, then, working one log at a time, roll each log into an 18-inch-long rope of even thickness, rolling from the center out to press out any large bubbles. (If the dough sticks to your hands or countertop, lightly flour your hands and not the dough itself; in order to roll the dough evenly, you need friction between the dough and countertop. If the dough begins to slide around on the countertop, lightly mist your hands with water using a spray bottle.)\nSerious Eats / Amanda Suarez\nTaper the outer 6 inches on either end of the rope slightly and continue rolling until the rope is 24 inches total. (Be sure to measure the dough after it has sat for a few seconds; if the rope shrinks after sitting for a few seconds, allow the dough to rest for several minutes, then resume rolling until it is 24 inches long.)\nSerious Eats / Andrew Janjigian\nLay the rope on the countertop and draw the two ends toward you to form a U-shape. Cross the two ends of the rope over themselves twice, then fold this bundle over itself toward the bend of the U so that the two ends of the rope just overlap the curve. Adjust the placement of the tips so that 3 even windows form, then press the tips down to seal. Transfer the pretzel to the prepared baking sheet and cover loosely with a clean plastic garbage bag. Repeat with the remaining logs, spacing the pretzels evenly apart on the baking sheet.\nSerious Eats / Andrew Janjigian\nTransfer the loosely covered baking sheet to the refrigerator and chill for at least 2 hours and up to 24 hours.\nSerious Eats / Andrew Janjigian\nAdjust oven rack to middle position and preheat oven to 400ºF (205ºC). While the oven preheats, remove the bag from the baking sheet of pretzels and allow pretzels to sit in the fridge uncovered, at least 30 minutes (and up to an hour)\nFor Dipping the Pretzels (see 'Notes' for an alternative method using baking soda):\nIf using a lye dip,\nset a wire rack inside a rimmed baking sheet lined with parchment; spray rack with nonstick cooking spray. Line a second baking sheet with parchment and place it next to the first one. In a large, non-reactive container (such as a Pyrex, glass, or stainless steel bowl or baking dish), add the water. Set the container in the center of the second pan. Wearing gloves and protective eyewear, sprinkle lye over the surface of the water and allow to dissolve, about 5 minutes. (It is very important you put the full amount of water in the container first and then add the lye; if you put the lye in the container and then pour water on top you could cause a violent reaction.) Cover the container loosely with parchment while the oven heats.\nSerious Eats / Andrew Janjigian\nWearing gloves and protective eyewear, transfer one pretzel to the lye bath, bottom side up, and let sit for 30 to 40 seconds. (If necessary, use a non-reactive spoon to gently keep the pretzel fully submerged.) Using gloved hands, transfer the pretzel face up to the rack to drain. Repeat with the remaining pretzels. When all the pretzels have been dipped, transfer them back to the original rimmed baking sheet face up and spaced evenly apart. Sprinkle pretzels evenly with pretzel salt and transfer to oven. Bake until dark brown, 12 to 14 minutes. (The lye-dipped pretzels will naturally be darker than the ones dipped in baking soda.) Using a spray bottle, mist pretzels lightly with water and return to oven until the pretzels have a glossy sheen, 30 seconds.\nSerious Eats / Andrew Janjigian\nRemove pretzels from oven and allow to cool for 5 minutes before serving.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nSilicone baking mat or nonstick parchment, spray bottle filled with water\nNotes\nKing Arthur Baking happens to make an all-purpose flour with an unusually high protein percentage, but most all-purpose flour is not high-protein and wouldn’t work well here. If you aren’t using a high-protein all-purpose flour like the one from King Arthur, bread floru is the next best option.\nIf using baking soda to dip the pretzels: adjust oven rack to middle position and preheat oven to 350ºF (175ºC). Spread 1/2 cup (4 ounces; 115g) baking soda on a rimmed baking sheet in a thin layer and bake for 1 hour. Allow to cool completely and transfer to a container until needed.\nWhen ready to dip the pretzels, set a wire rack inside a rimmed baking sheet lined with parchment. In a large enameled Dutch oven, place 8 cups (1920ml) in water and add the baking soda. Bring to a boil, then lower heat to a gentle simmer and cover until needed. Place 4 cups of cold water in a bowl and set it near the stovetop on top of a sheet of parchment to catch any drips.\nWearing gloves, transfer one pretzel to the baking soda bath, bottom side up, and let sit for 30 to 40 seconds. (If necessary, use a non-reactive spoon to gently keep the pretzel fully submerged.) Using gloved hands, transfer the pretzel face down to the cold water bath and let sit for 30 to 40 seconds. Transfer the pretzel, facing up, to the wire rack. Repeat with remaining pretzels.\nWhen all the pretzels have been dipped, transfer them back to the original rimmed baking sheet face up and spaced evenly apart. Sprinkle pretzels evenly with pretzel salt and transfer to oven. Bake until dark brown, 12 to 14 minutes. Using a spray bottle, mist pretzels lightly with water and return to oven for 30 seconds, until the pretzels have a glossy sheen.\nFood-grade lye and pretzel salt can be purchased online or from baking supply stores.\nSafety Tips for Working With Lye\nAlways wear gloves and protective eyewear when working with lye.\nAlways\nadd lye to water and not the other way around. When water and lye combine, the mixture heats up; sprinkling lye gradually to a large amount of water prevents a violent and potentially hazardous situation.\nYou can use any non-reactive container you want to hold your lye bath—plastic, stainless steel, or glass—but I like using a shallow rectangular glass storage container with a snug snap-top lid. Not only does it help to keep the lye contained when not in use, it allows me to reuse the bath for multiple batches of pretzels. (I find it starts to lose its potency after 3 or 4 sets.)\nLye will stain wood, aluminum and other non-stainless metals, and lots of other common kitchen surfaces as well. Using parchment-lined rimmed baking sheets is a good way to keep it contained in case of spills, and the parchment is easily discarded once you are done.\nI use a clean, moist sponge to mop up occasional spills, and wring it out under running water. If you want, you can use a sponge dipped in white vinegar to neutralize the lye on contact instead.\nTo dispose of the used lye bath, just run cold water in your kitchen sink and carefully pour it down the drain. A 4% solution is weaker than one used to unclog drains, so it will do no harm to your pipes and will be neutralized quickly in your sewer or septic system.\nMake-Ahead and Storage\nBavarian pretzels are best eaten within 4 hours of baking.\nBaking\nThe Latest\nWestern European"
}