{
  "url": "https://www.seriouseats.com/bechamel-white-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/4dpJMP2d08J2RWZpE_aXD7B53qc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__09__20160901-bechamel-sauce-vicky-wasik-14-0a11570d78cb4d8693be4aff60760531.jpg",
  "tags": [
    "Condiments & Sauces",
    "French"
  ],
  "title": "Classic Smooth and Silky Béchamel (White Sauce) Recipe",
  "full_text": "Classic Smooth and Silky Béchamel (White Sauce) Recipe\nClose\nJump to recipe\nCook\n10 mins\nActive\n5 mins\nTotal\n10 mins\nServes\n4 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ntablespoons\nunsalted butter\n(\n3/4\nounce\n;\n20\ng\n) (see notes)\n1 1/2\ntablespoons\n(\n12\ng\n)\nall-purpose flour\n(see notes)\n1\ncup\n(\n240\nml\n)\nwhole milk\nKosher salt\nand freshly\nground black pepper\nFreshly\ngrated nutmeg\n, to taste (optional)\nDirections\nIn a small saucepan, melt butter over medium-high heat (do not allow it to brown). Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added.\nSerious Eats / Vicky Wasik\nHeat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until sauce is thick enough to coat the back of a wooden spoon, about 3 minutes.\nSerious Eats / Vicky Wasik\nSeason with salt and pepper. Add nutmeg to taste, if using. If any lumps form, simply whisk thoroughly to remove them and smooth out sauce, or use a hand blender or countertop blender if lumps are particularly large or tough. Use sauce right away, or press a piece of plastic wrap over surface of sauce to prevent a skin from forming and keep warm until ready to use. Sauce can be cooled and stored in a sealed container in the refrigerator for several days. Reheat very gently on the stovetop or in a microwave to use.\nSpecial Equipment\nWhisk\nNotes\nThis recipe uses a ratio of 1 1/2 tablespoons each of flour and butter per cup of milk, producing a sauce that's luxuriously silky and thick, but still quite pourable—it will work well in a variety of dishes. Depending on the recipe and your personal preference, you can make a thinner béchamel by reducing the flour and butter to 1 tablespoon each per cup of milk, or a very thick one (say, for a soufflé base or Greek moussaka) by increasing them to 3 tablespoons each per cup of milk. You can easily scale this recipe up or down as desired.\nRead More\nHow to Make a Roux and Use It Right\nClassic Mornay Sauce (Cheesy White Sauce) Recipe\nCheesy, Gooey Croques Monsieurs Recipe\nSavory Cheese Soufflé Recipe\nClassic Baked Lasagna Bolognese (Lasagne alla Bolognese) Recipe\nCondiments & Sauces\nFrench",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/classic-smooth-and-silky-bchamel-white-sauce-recipe.webp?"
}