{
  "url": "https://www.seriouseats.com/beef-short-rib-rendang-fatty-crab-zach-pelaccio-recipe",
  "image_url": "https://www.seriouseats.com/thmb/tlo_9xMSNQmktsrRKS7uSET7bjo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100402-seasian-beefrendang-001efd0103804fb6b1b07b8ab1cae331.jpg",
  "tags": [
    "Beef Mains",
    "Malaysian",
    "Braised & Stewed Beef",
    "Short Ribs"
  ],
  "title": "Beef Short Rib Rendang Recipe",
  "full_text": "Beef Short Rib Rendang Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n7 hrs\nMarinating Time\n48 hrs\nTotal\n55 hrs 20 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n5-pound\nshort rib\n, bone-in cut 1 1/2 inches long\nTurmeric Paste:\n0.6\nounce\ndried chile\n, soaked in warm water\n0.8\nounce\nThai chile\n, sliced no stems\n1.1\nounces\ngalangal\n, sliced\n2.4\nounces\nyoung ginger\n, sliced\n1\nounce\ntumeric root\n, sliced\n12\nounces\nlemongrass\n, cleaned and sliced\nShallot Paste:\n7\nounces\nshallots\n, peeled and roughly chopped\n7\nounces\ngarlic\n, peeled and roughly chopped\n3\nounces\npalm sugar\n, chopped\nBraise:\n5\ncups\ncoconut milk\n6\nslices\nassam skin,\nwashed (see note)\n1/4\ncup\nkosher salt\n13\nounces\nkerisik\nGula Jawa Syrup:\n1/4\ncup\nGula Jawa\n(a type of\npalm sugar\n)\n1/4\ncup\nwater\nGarnish:\n10\nmakrut lime leaves\n, very thinly sliced lengthwise\n3\nlimes\n, cut into wedges\nCoconut Rice:\n1\nquart\njasmine rice\n, washed and drained\n1\nquart\nwater\n1\ntablespoon\nsalt\n1\npandan\nleaf\n(1.5 ounces), tied in knot\n3\ntablespoons\nsugar\n1 can (\n1 3/4\ncups\n)\ncoconut milk\n, at 70°F (21°C)\nDirections\nTwo days before cooking:\nTumeric paste:\nCombine first set of ingredients and pound in a mortar or purée in food processor. Use some of the chile soaking water to help the machine purée the ingredients, if necessary. The purée should be as smooth as you can possibly get it, but don't stress out if there are some chunky bits; it'll be fine. In a container large enough to hold all the beef, rub the paste all over the beef and leave it in the container sitting in the fridge to marinate for 48 hours. Wear gloves when working with turmeric and turmeric paste as it will stain your hands.\nThe day of cooking:\nShallot Paste:\nPurée all the ingredients in a food processor until as smooth as possible. Scoop the paste out into a small container and let it hang out until you are ready to use it.\nTo braise:\nPreheat the oven to 225°F.\nPlace marinated short ribs in a single layer in a deep-sided roasting pan. You may need 2 pans to avoid stacking. Season each pan with the 1/8 cup kosher salt, or, if it all fits in one big pan, use 1/4 cup of kosher salt to season the whole deal. Divide the coconut milk, shallot paste, and assam skins evenly and add to the roasting pans. Toss the ribs to incorporate all the ingredients. Cover the pan(s) with parchment and top with tight fitting lid of foil.\nBraise at 225°F until fork tender, about 6 to 6 1/2 hours.\nPrepare the Gula Jawa Syrup anytime, as it keeps for months.\nFor Gula Jawa Syrup:\nAdd gula jawa and water to sauce pot. Simmer on low flame until sugar has completely dissolved. Reserve warm for serving. To store, place in airtight container in refrigerator.\nYou can prepare the kerisik well in advance too.\nTo serve your rendang:\nRemove the ribs from the oven and carefully remove the foil and parchment and to make sure they are tender. If not, put the ribs back in the oven and continue cooking. If so, sprinkle the toasted coconut flakes over the ribs. The kerisik will absorb some of the fat and adhere to the meat thus increasing the unctuous, splendiferous flavor.\nSpoon as many ribs as you would like to serve for this occasion into a large serving bowl or platter. Top with the braising liquid, oil and all. If you are keeping some ribs in reserve, reserve some of the liquid too. Drizzle the gula jawa syrup over the meat and sprinkle the thin sliced kaffir lime leaves on top. Serve the ribs with a side bowl of cut lime wedges and a large bowl of steamed coconut rice.\nTo make the coconut rice:\nIn a large bowl or large sieve with holes small enough to prevent the rice from falling through, wash rice thoroughly under cold running water until the water runs clear. Dump the rice in a rice cooker and add salt, sugar, pandan leaf, and 1 quart of water. Cook until the cooker clicks, proclaiming the rice as finished. Fluff for a moment and pour in coconut milk. Mix the coconut milk and cooked rice gently and thoroughly. Season with salt to taste and keep warm in the rice cooker until dinner. If dinner is waiting on the rice, dump it into a bowl. I mean, what are you waiting for?\nThis Recipe Appears In\nSeriously Malaysian: How to Make Rendang\nBeef Mains\nMalaysian\nBraised & Stewed Beef\nShort Ribs",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/beef-short-rib-rendang-recipe.webp?"
}