{
  "url": "https://www.seriouseats.com/beef-barley-soup-recipe",
  "image_url": null,
  "tags": [
    "Soups",
    "Beef Chuck",
    "Barley",
    "Beef Mains",
    "Winter Mains"
  ],
  "title": "Beef Barley Soup",
  "full_text": "Beef Barley Soup\nJump to recipe\nCook\n2 hrs 15 mins\nActive\n45 mins\nTotal\n2 hrs 15 mins\nServes\n12 servings\nMakes\n3 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n1\nkg\n)\nboneless beef chuck roast\n, cut into 1 1/2–inch steaks, or\n3\npounds\n(\n1.3\nkg\n)\nbone-in beef short ribs\n, ribs removed and reserved (see note)\nKosher salt\nand\nfreshly ground black pepper\n1\ntablespoon\n(\n15\nml\n)\ncanola oil\n3\nlarge\ncarrots\n(\n10\nounces\n;\n280\ng\n), diced\n1\nlarge\nyellow onion\n(\n12\nounces\n;\n340\ng\n) diced\n2\nribs\ncelery\n(\n6\nounces\n;\n170\ng\n)\n4\nmedium\ncloves garlic\n, roughly chopped\n3\nquarts\n(\n3\nL\n)\nhomemade\nor\nstore-bought chicken stock\n(see note)\nSachet of\n2\nsprigs\nfresh thyme\n,\n1\nbay leaf\n, and about\n5\nwhole black peppercorns\n1\ncup\npearled barley\n(\n7\nounces\n;\n200\ng\n)\n1/2\nteaspoon\n(\n3\nml)\nAsian fish sauce\n(optional)\nMinced fresh parsley\n, for garnish\nDirections\nSeason beef with salt and pepper. In a large pot or Dutch oven, heat oil over high heat until lightly smoking. Working in batches if necessary, add beef and cook, turning occasionally, until well browned on all sides, about 5 minutes per side. Transfer to a large platter.\nSerious Eats / Julia Estrada\nAdd carrots, onion, celery, and garlic to pot and cook, stirring and scraping up any browned bits from the bottom, until lightly browned, about 6 minutes. Scrape vegetables into a heatproof bowl and set aside. Add stock to pot, return to heat, and scrape up any browned bits from bottom of pot.\nSerious Eats / Julia Estrada\nMeanwhile, cut beef into chunks and add to pot, along with reserved bones, if using, and herb sachet. Bring to a simmer, then reduce heat to maintain a low simmer and cook until beef is tender, 1 to 2 hours; skim any foam that rises to the top.\nSerious Eats / Julia Estrada\nDiscard bones and herb sachet. Add barley, reserved vegetables, and fish sauce, if using, and simmer until barley and vegetables are tender, about 30 minutes. Season with salt and pepper. If soup is too dry, top up with water to achieve desired consistency. Serve, garnishing with parsley.\nSerious Eats / Julia Estrada\nSpecial Equipment\nLarge pot\nor\nDutch oven\nNotes\nBeef chuck is the easier and more affordable option, and produces very good results. Short ribs, especially when combined with their bones, create an even more deeply beefy stew. Ask your butcher to remove and reserve the bones for you if you don't feel comfortable doing it yourself. If you have beef chuck that's already cut into chunks for stewing, we recommend searing only half of them in step 1 and adding the other half raw in step 3.\nMost store-bought beef stock has poor flavor, which is why we recommend chicken stock instead; if you have good-quality homemade beef stock available, feel free to use it.\nMake-Ahead and Storage\nBeef barley soup freezes very well and will keep, frozen, for three to six months.\nRead More\nPressure Cooker Beef Barley Soup Recipe\nHearty Escarole, Barley, and Parmesan Soup Recipe\nAll-American Beef Stew Recipe\nThe Serious Eats Guide to Whole Grains\nStew Science: What's the Best Way to Brown Beef?\nWhat Are the Best Cuts of Beef for Stew?\nSoups\nBeef Chuck\nBarley\nBeef Mains\nWinter Mains"
}