{
  "url": "https://www.seriouseats.com/beef-jerky-empanadas-recipe-11750972",
  "image_url": "https://www.seriouseats.com/thmb/3PbcqvVmMKvJmm3-Tl4DbY-WTYc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220629-beef-jerky-empanadas-kevin-vaughn-Hero-b838b8f801ad41e79c6c2f0f9af478b7.JPG",
  "tags": [
    "Beef",
    "Recipes",
    "South American"
  ],
  "title": "The Secret to the Best Beef Empanadas? It's Not Beef",
  "full_text": "The Secret to the Best Beef Empanadas? It's Not Beef\nClose\nJump to recipe\nPrep\n30 mins\nCook\n90 mins\nCooling Time:\n15 mins\nTotal\n2 hrs 15 mins\nServes\n24 servings\nMakes\n24 empanadas\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n2 1/2\ncups\n(400g)\nall-purpose flour\n5\ntablespoons\n(70g) room temperature\nunsalted butter\n, cut into 1/2-inch cubes, plus more for greasing the baking sheet\n2/3\ncup\n(170m) lukewarm\nwater\n1 tablespoon plus 3/4 teaspoon (\n11\ng\n) Diamond Crystal\nkosher salt\n; if using table salt use half as much by volume or same weight\nFor the Filling:\n1/2\npound\n(250g)\nbeef jerky\n(see note), torn into strips\n3\nmedium\nyellow\nonions\n(650g), chopped\n3\ntablespoons\n(45ml)\nvegetable or other neutral oil\n1 1/2\ncups\n(225ml) uncooked\ntomato\npureé or\npassata\n1 medium\nred bell pepper\n(6 ounces;\n180\ng\n), stemmed, seeded, and diced\n1 medium\ngreen bell pepper\n(6 ounces;\n180\ng\n), stemmed, seeded, and diced\n1\nteaspoon\nfreshly ground\nwhite pepper\n1\nteaspoon\nsmoked paprika\n1\nteaspoon\nfresh thyme\n, leaves picked and chopped\n1\nteaspoon\ndried oregano\n3\nlarge\neggs\n,\nhardboiled\n, peeled, and diced\nHandful of\nfresh chives\n(\n20\ng\n), finely minced\nKosher salt\nDirections\nFor the Dough:\nIn a medium mixing bowl, whisk together flour and salt. Add the butter to the flour and salt mixture and toss to coat. Using clean hands, pinch the butter pieces flat. Gradually add water and mix with your hands until a slightly sticky dough forms. Transfer dough to a clean work surface and knead dough until it becomes soft and smooth, about 5 minutes. Place dough in a plastic bag or wrap in plastic and let rest at room temperature for at least 30 minutes and up to 1 hour.\nSerious Eats / Kevin Vaughn\nMeanwhile, for the Filling:\nWorking in 3 separate batches, place jerky in a blender and pulse several times to break it up. Turn blender to high speed and blend until jerky is soft, light, and fluffy, like coarse cotton candy, about 1 minute. Set aside.\nSerious Eats / Kevin Vaughn\nIn a 5-quart Dutch oven, heat oil over medium-high heat until shimmering. Add onion and stir until evenly coated with oil. Reduce heat to medium-low and cook, stirring occasionally to avoid scorching, until onion is soft and dark brown in color, about 20-30 minutes.\nSerious Eats / Kevin Vaughn\nIncrease heat to medium, stir in beef jerky and cook, stirring, for 1 minute. Stir in tomato purée, green bell pepper, red bell pepper, white pepper, smoked paprika, thyme, and oregano, bring to a simmer, then reduce heat to maintain a simmer and cook, stirring occasionally, until tomato sauce has reduced completely and bell peppers have softened, about 15 minutes. If tomato sauce reduces too much before bell peppers have cooked through completely, add water a tablespoon or two at a time to avoid scorching until pepper fully soften. Transfer mixture to a medium bowl and let cool. Once cool, stir in hard-boiled eggs and chives. Season with salt, if needed. Set aside.\nSerious Eats / Kevin Vaughn\nTo Make the Empanada:\nAdjust oven rack to middle position and preheat oven to 500°F (260°C). Grease a rimmed baking sheet with butter. Using the palms of your hands, roll rested dough into a roughly 9-inch (24cm) cylinder. Cut into 24 pieces, approximately 30g each; each piece should be about the size of your thumb. Cover the pieces with plastic wrap or a damp cloth to prevent drying out. Working with one piece at a time, shape each piece of dough into a flattened disc. Using a rolling pin, roll the dough disc into a roughly 4-inch (10cm) circle.\nSerious Eats / Kevin Vaughn\nHolding the dough disc in the palm of one hand, place a tablespoon (approximately 35g) of meat filling in the center of the disc. Fold the dough over the filling to enclose it, forming a half-moon shape; use your fingers to gently seal the edges together while making sure to push out any air bubbles.\nSerious Eats / Kevin Vaughn\nFold the right corner of empanada in towards the center and pinch to crimp. Working from that corner, continue crimping with a slight twisting motion to form points along the edge, so that the empanada looks like a half-sun with rays, then finish by folding the left corner in and pinching to crimp; be sure to work the dough gently to avoid air bubbles or tearing. Place formed empanada on prepared baking sheet and repeat process with remaining empanada discs and filling.\nSerious Eats / Kevin Vaughn\nBake empanadas until dough is lightly browned on the exterior, about 25 minutes. Remove empanadas from oven and let cool for 10 to 15 minutes before serving.\nSerious Eats / Kevin Vaughn\nSpecial Equipment\nKitchen scale, rolling pin, baking sheet, blender.\nNotes\nYou will need to adjust the amount of salt you add depending on the saltiness of the beef jerky you use. The best type of beef jerky to use is sun-dried jerky, like carne seca or\nmachaca\n, and I encourage you to try to seek out sun-dried jerkies made in small batches.\nThis dough does not need to be chilled. Doña Estela does not rest her dough before rolling out empanada discs. The other cooks I prepared empanadas with, Doña Graciela and Doña Zulma, rested their dough covered in the shade outdoors, for 30 minutes to 1 hour in 80-95ºF heat.\nBeef\nRecipes\nSouth American"
}