{
  "url": "https://www.seriouseats.com/beignets-recipe-8788234",
  "image_url": "https://www.seriouseats.com/thmb/LiErOBBTvg6x8BhKJV9n0Pr979g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241205-SEA-Beignets-RobbieLozano-Hero1-73-b7e7b10a95944fffa2ebc73a841e0bed.jpg",
  "tags": [
    "Doughnuts",
    "The Latest",
    "Breakfast & Brunch",
    "Mardi Gras",
    "Cajun & Creole"
  ],
  "title": "Homemade Beignets",
  "full_text": "Homemade Beignets\nClose\nJump to recipe\nPrep\n35 mins\nCook\n30 mins\nProofing and Chilling Time\n9 hrs 40 mins\nTotal\n10 hrs 45 mins\nServes\n12\nMakes\n3 dozen beignets\nCook Mode\n(Keep screen awake)\nIngredients\n160\nml\n(\n2/3\ncup\n)\nwater\n, warmed to 100-110ºF (38-43ºC)\n42\ng\ngranulated sugar\n(\n1 1/2\nounces\n;\n3\ntablespoons\nplus\n1\nteaspoon)\n, divided\n1 1/2\nteaspoons\nactive dry yeast\nfrom one 1/4-ounce envelope\n240\nml\n(\n1\ncup\n)\nbuttermilk\n, at room temperature\n1\nlarge egg\n, beaten, at room temperature\n570\ng\nbread flour\n(\n18\nounces\n;\n4\ncups\n), plus more for dusting\n9\ng\n(\n1\ntablespoon\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or same weight\n3/4\nteaspoon\nbaking powder\n1/2\nteaspoon\ndiastatic malt\n(optional)\n42\ng\nunsalted butter\n(\n1 1/2\nounces\n;\n3\ntablespoons\n), softened and cut into 1-tablespoon pieces\nPeanut or other neutral oil\n, for frying\nDirections\nIn the bowl of a stand mixer fitted with whisk attachment, mix water and 1 teaspoon (4g) granulated sugar until sugar is dissolved. Sprinkle yeast over surface and set aside until foamy, 5 to 10 minutes.\nSerious Eats / Robbie Lozano\nAdd buttermilk and egg, whisking to combine, followed by flour, salt, baking powder, diastatic malt powder (if using), and 3 tablespoons (38g) sugar. Fit stand mixer with dough hook attachment and mix on medium-low speed until dough begins to come together, about 3 minutes. Add butter, 1 tablespoon at a time, making sure each piece is incorporated before adding the next, until fully incorporated, about 1 minute. Increase speed to medium and continue beating until dough is strong and elastic, about 10 minutes, stopping to scrape down bowl with dough scraper as needed. (Dough will be sticky and will not clear sides of bowl.)\nSerious Eats / Robbie Lozano\nUsing a dough scraper, scrape down sides of bowl,  cover tightly with plastic wrap, and set aside to rise at warm room temperature (72 to 78ºF; 22 to 25ºC) until doubled in volume, about 1 hour.\nSerious Eats / Robbie Lozano\nUsing damp hands, gently deflate dough. Cover and refrigerate at least 8 hours or up to 18 hours.\nSerious Eats / Robbie Lozano\nTransfer dough to a well-floured work surface. Pat dough into a rectangle, sprinkle lightly with additional flour, then roll out to an 18- by 12-inch rectangle, about 1/4- to 1/3-inch thick. Using a pizza cutter or sharp knife, cut dough into 2- by 2 1/2–inch rectangles, spacing them at least 1/2-inch apart to prevent them from sticking to each other. (You should have about 36 rectangles.) Cover with plastic wrap and let rise until puffy and dough springs back slightly when touched, about 40 minutes and up to 1 hour.\nSerious Eats / Robbie Lozano\nFill a large Dutch oven or large pot with 3 inches of oil and heat over medium-high until oil registers 365ºF (185ºC) on an instant-read thermometer. Line a 13- by 18-inch rimmed baking sheet with paper towels, set a wire rack inside, and place next to stove.\nSerious Eats / Robbie Lozano\nWorking in batches of 3 to 6, carefully add dough portions to hot oil, sliding them in from as close to the oil’s surface as possible to minimize splashing. Fry, using a spider strainer or slotted spoon to turn beignets occasionally, until deep golden brown and puffed, about 2 minutes. Transfer beignets to prepared wire rack. Repeat with remaining dough portions, adjusting heat as needed to maintain oil between 360 and 365ºF (182 to 185ºC).\nSerious Eats / Robbie Lozano\nDust beignets generously with powdered sugar and serve warm.\nSerious Eats / Robbie Lozano\nSpecial Equipment\nStand mixer, dough scraper, plastic wrap, pizza cutter or sharp knife, large Dutch oven or large pot, 13- by 18-inch rimmed baking sheet, wire rack, deep-fry or probe thermometer, spider strainer or slotted spoon\nMake Ahead and Storage\nBeignets really are best when freshly made, but in a pinch leftovers (preferably unsugared) can be stored in an airtight container at room temperature for up to 2 days. They reheat well in an air fryer. Sprinkle with powdered sugar just before serving.\nDoughnuts\nThe Latest\nBreakfast & Brunch\nMardi Gras\nCajun & Creole",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-beignets.webp?"
}