{
  "url": "https://www.seriouseats.com/best-chicken-paprikash-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KxEyWtl1SLDYEs6NKf8_82uHwdg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__11__20150916-chicken-paprikash-kenji-30-9c547e27226e4a7da43020f5794da1c5.jpg",
  "tags": [
    "Braised & Stewed Chicken",
    "Hungarian",
    "Chicken Legs",
    "Comfort Food",
    "Fall Mains"
  ],
  "title": "The Best Chicken Paprikash Recipe",
  "full_text": "The Best Chicken Paprikash Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nActive\n40 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nhomemade\nor store-bought\nlow-sodium chicken stock\n1\n(\n0.25 ounce\n) packet\npowdered gelatin\n(about\n2 1/2\nteaspoons\n)\n4\nwhole\nchicken legs\n, split into thighs and drumsticks (about\n2\npounds\n)\nKosher salt\nand freshly\nground black pepper\n1\ntablespoon\nvegetable oil\n1\nlarge\nyellow onion\n, thinly sliced (about\n1 1/2\ncups\n)\n1\nred bell pepper\n, thinly sliced (optional, see notes)\n1/4\ncup\n(\n1\nounce\n) high quality\nHungarian sweet paprika\n(see notes)\n1\nbay leaf\n1/2\ncup\nsour cream\n, plus more for garnish\n1/2\nteaspoon\nAsian\nfish sauce\n1\nteaspoon\njuice\nfrom\n1\nwhole\nlemon\nMinced\nfresh parsley leaves\nor\ndill\n(optional)\nEgg noodles\n,\nboiled potatoes\n, or\nspaetzle\nfor serving\nDirections\nPour chicken stock into a 1-cup liquid measuring cup and sprinkle gelatin over the top. Set aside.\nSeason chicken pieces generously on all sides with salt and pepper. Heat vegetable oil in a large straight-sided sauté pan or a Dutch oven over medium-high heat until lightly smoking. Add chicken pieces skin-side-down in a single layer and cook without moving until deep golden brown, about 8 minutes. As the chicken pieces finish browning, flip them over and cook until the second side is light golden brown, about 2 minutes longer. Transfer chicken to a large plate and set aside. Pour off all but 1 tablespoon of fat from pan.\nAdd onions and bell peppers (if using) to the pan and cook, stirring and scraping up any browned bits from the bottom, until the onions are tender and just starting to brown, about 5 minutes. Add paprika and cook, stirring, until fragrant and nutty, about 1 minute.\nAdd stock/gelatin mixture and scrape up anything stuck to the bottom of the pan, stirring constantly. Add bay leaf. Nestle seared chicken pieces back into the sauce, leaving them skin-side up. Reduce heat to lowest setting, cover pan, and cook until chicken is completely tender, about 30 minutes.\nRemove chicken pieces and set aside on a large plate. Whisk sour cream, fish sauce, lemon juice, and half of minced parsley or dill into sauce. Season to taste with salt and more paprika if desired. Return chicken to pan and turn to coat in sauce.\nServe immediately over noodles, boiled potatoes, or\nspaetzle\n, tossing the noodles or potatoes with the sauce and placing the chicken on top. Garnish with more sour cream, paprika, and minced fresh parsley or dill (if using)\nSpecial equipment\n4 1/2-quart straight-sided sauté pan or large Dutch oven\nNotes\nBell pepper is not a traditional ingredient for chicken paprikash, but it is such a common addition in the American version of the dish that I decided to include it as an optional ingredient (I almost always use it). It is important to use fresh, high-quality paprika for this recipe. I recommend sweet Hungarian-style paprika from Penzeys, available at local outlets or online.\nThis Recipe Appears In\nThe Food Lab: The Long and Short Paths to Chicken Paprikash\nBraised & Stewed Chicken\nHungarian\nChicken Legs\nComfort Food\nFall Mains"
}