{
  "url": "https://www.seriouseats.com/best-gluten-free-pie-crust-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uinqIJFXQxvunwbXEd5e8uE6IrE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__07__20160608-gluten-free-pie-crust-vicky-wasik-9-dfa8d214162049c69dda5b4023966910.jpg",
  "tags": [
    "Pies",
    "Thanksgiving Desserts",
    "Gluten-free Desserts",
    "Pie Dough",
    "Christmas Desserts"
  ],
  "title": "Flaky and Crisp Gluten-Free Pie Crust Recipe",
  "full_text": "Flaky and Crisp Gluten-Free Pie Crust Recipe\nClose\nJump to recipe\nPrep\n35 mins\nActive\n30 mins\nChilling Time\n2 hrs\nTotal\n2 hrs 35 mins\nServes\n16\nto 20 servings\nMakes\n2 pies\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\nwhite rice flour\n(\n3/4\ncup\n;\n113\ng\n)\n2 1/2\nounces\ncornstarch\n(\n1/2\ncup\n;\n70\ng\n), plus more for dusting\n1 1/2\nounces\ntapioca flour\n(\n1/3\ncup\n;\n42\ng\n)\n1\nounce\ncoconut flour\n(\n1/4\ncup\n;\n28\ng\n)\n1/2\nounce\nsugar\n(\n1\ntablespoon\n;\n15\ng\n)\n1 1/4\nteaspoons\n(\n5\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume or use the same weight\n1/2\nteaspoon\nxanthan gum\n8\nounces\nunsalted butter\n(\n2\nsticks\n;\n225\ng\n), cold\n4\nounces\ncold\nwater\n(\n1/2\ncup\n;\n115\ng\n)\nDirections\nFor the Dough:\nWhisk white rice flour, cornstarch, tapioca flour, coconut flour, sugar, salt, and xanthan gum together in a medium bowl. Cut butter into 1/2-inch cubes and toss with flour mixture to break up the pieces. With your fingertips, smash each cube into a thin sheet—that's it! Stir in water, then knead dough against the sides of the bowl until it comes together in a shaggy ball.\nMake the Layers:\nOn a very generously dusted work surface, gently roll dough into a roughly 10- by 15-inch rectangle, sprinkling more cornstarch above and below to prevent sticking. Don't be shy! Fold the 10-inch sides to the center, then close the newly formed packet like a book. Fold in half once more, bringing the short sides together to create a thick block. The dough will crack along the creases, but that's just fine. Divide in half with a sharp knife or bench scraper. If dough is very soft or if you are working in a hot kitchen, refrigerate for 15 minutes before continuing.\nFor Single-Crusted Pies:\nUsing as much cornstarch as needed, gently roll one piece into a 12-inch circle. Slide an offset spatula underneath it to loosen, then divide into quarters. Transfer to the pie plate one at a time, folding the top edge of each piece over to create a thick border that sits atop the rim of the pan. Press and pinch dough together along the seams to form a unified whole. Repeat with remaining dough. Wrap with plastic and refrigerate at least 2 hours and up to overnight. Use as directed in your favorite recipe.\nSerious Eats / Vicky Wasik\nFor a Double-Crusted Pie:\nShape one piece of dough according to the directions above. For a solid top crust, roll remaining dough the same way, or roll into a 9- by 15-inch rectangle for a lattice-top pie. Divide into manageable pieces and transfer to a baking sheet or parchment-lined cutting board. (The parchment will prevent dough from absorbing any savory odors from the board.) Wrap both portions in plastic and refrigerate at least 2 hours and up to overnight. Use as directed in your favorite recipe.\nSpecial Equipment\nRolling pin\n,\n9-inch pie plate\n(preferably tempered glass; see notes),\npastry brush\nNotes\nCompared to stoneware or heavy enameled ceramic, tempered-glass pie plates conduct heat quickly and evenly, so the crust bakes up light and crisp, never greasy or soft.\nRead More\nA Crash Course in Mastering Pie Dough\nDecorative Crust 101: How to Make a Lattice Pie\n3 Gluten-Free Flour Blends You Can Use in Any Recipe\nThe Ultimate Gluten-Free Angel Food Cake Recipe\nPies\nThanksgiving Desserts\nGluten-free Desserts\nPie Dough\nChristmas Desserts"
}