{
  "url": "https://www.seriouseats.com/best-grilled-chicken-sandwich-ever",
  "image_url": "https://www.seriouseats.com/thmb/VL0ghw8gfbLCvhRvAWE22SNcMeo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-best-grilled-chicken-sandwich-ever-hero-04-6a1d2e743a87423bac1f4ff53bd2926b.jpg",
  "tags": [
    "Sandwiches",
    "Grilled Chicken",
    "Chicken Mains",
    "Memorial Day",
    "4th of July"
  ],
  "title": "The Best Grilled Chicken Sandwich Ever",
  "full_text": "The Best Grilled Chicken Sandwich Ever\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nActive\n60 mins\nBrining Time\n30 mins\nTotal\n85 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nboneless skinless chicken breast halves\n, tender removed,\n6\nto\n8\nounces\neach\n2\nquarts\ncold water\nKosher salt\n, plus more for seasoning\n1/4\ncup\n(\n55\ng\n)\nsugar\n(if making a wet brine; see note)\n1/4\nsmall\navocado\n, diced (about\n1/3\ncup\n)\n1/2\nlarge\njalapeño\n, roughly chopped (about\n2\ntablespoons\n)\n1/4\ncup\nroughly chopped fresh cilantro\nleaves and tender stems (from about\n6\nsprigs\n)\n5\ntablespoons\nvegetable oil\n, divided\n2\ntablespoons\nwater\n1\ntablespoon\nfresh lime juice\n, from\n1\nlime\nFreshly ground black pepper\n6\nslices\nthick cut bacon\n, halved\n4\nsoft white sesame burger buns\n, split\n3/4\ncup\nmayonnaise\n1\ncup\ncrushed ruffled potato chips\n1\ncup\nshredded iceberg lettuce\n4\n(1/4-inch-thick) slices\ntomato\nDirections\nPlace 1 chicken breast in a resealable plastic bag or between 2 pieces of plastic wrap. Using a meat pounder, rolling pin, or small skillet, pound chicken breast into an even thickness about 3/4-inches in height. Repeat with remaining 3 breasts.\nSerious Eats / Qi Ai\nIf making a wet brine, dissolve 1/3 cup (80g) kosher salt and the 1/4 cup (55g) sugar in a medium bowl in 2 quarts (1.9L) water. Place chicken breasts in brine and refrigerate for 30 minutes. If making a dry brine, set a wire rack over a rimmed baking sheet and arrange chicken breasts on it. Sprinkle generously all over with salt on both sides, then refrigerate, uncovered, for 30 minutes.\nSerious Eats / Qi Ai\nMeanwhile, combine avocado, jalapeño, cilantro, 3 tablespoons of vegetable oil, water, and lime juice in blender and purée until a smooth, creamy sauce forms. Season green sauce with salt.\nSerious Eats / Qi Ai\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate. Remove chicken breasts from brine, pat dry with paper towels, season to taste with salt and pepper, and brush lightly with remaining 2 tablespoons oil.\nSerious Eats / Qi Ai\nPlace bacon in between hot and cool sides of grill and cook, turning occasionally, until surface of bacon is bubbling but not yet crisp and browned, about 15 minutes total.\nSerious Eats / Qi Ai\nWhile bacon cooks, place chicken over hot side of grill and cook until well browned, 3 to 5 minutes. Flip and, using a pastry brush or spoon, brush a coating of green sauce all over top side of chicken. Continue to cook until second side is browned. Flip chicken and cook until green sauce is just cooked, about 1 minute. Brush more green sauce on second side of chicken, flip once more, and cook until chicken registers 150°F (66°C) (or 160°F (71°C) if you really want to stick to FDA guidelines) on an instant-read thermometer inserted into the center of breast. If chicken browns too much before it registers 150°F, move to cool side of grill, cover, and let cook until chicken reaches temperature. Remove chicken from grill, let rest for 5 to 10 minutes.\nSerious Eats / Qi Ai\nPlace bun halves on hot side of grill, cut-sides down, and cook until lightly toasted.\nSerious Eats / Qi Ai\nSpread 1 1/2 tablespoons of mayonnaise on cut side of each bun half. Sprinkle 2 tablespoons of crushed potato chips on the mayonnaise. On each bottom bun, add 1/4 cup lettuce, followed by 1 chicken breast, 3 bacon pieces, 1 tomato slice, and 1 tablespoon green sauce. Close sandwiches and serve right away.\nSerious Eats / Qi Ai\nSpecial Equipment\nGrill\n,\nchimney starter\nRead More\nHow to Get Started Grilling\nGrilled Boneless Chicken Breasts Recipe\nPeruvian-Style Grilled-Chicken Sandwiches With Spicy Green Sauce Recipe\nSandwiches\nGrilled Chicken\nChicken Mains\nMemorial Day\n4th of July",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-grilled-chicken-sandwich-ever.webp?"
}