{
  "url": "https://www.seriouseats.com/best-rich-easy-white-chicken-stock-recipe",
  "image_url": "https://www.seriouseats.com/thmb/j69KMCvAyMgbmK_ZqNDqppoq6UQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140929-chicken-stock-vicky-wasik-6-a97abd2edc7941a3af4004dd9324f451.jpg",
  "tags": [
    "Chicken",
    "Braised & Stewed Chicken",
    "Soups"
  ],
  "title": "Basic Chicken Stock",
  "full_text": "Basic Chicken Stock\nClose\nJump to recipe\nCook\n110 mins\nActive\n15 mins\nChilling Time\n6 hrs\nTotal\n7 hrs 50 mins\nServes\n12 servings\nMakes\n3 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n4\nto\n8\npounds\n(\n1.8\nto\n3.6\nkg\n)\nchicken parts\n, such as wings, bones, breasts, and legs\n(see note)\n4\nquarts\n(\n3.8\nL\n)\nwater\n2\nlarge\nyellow onions\n, diced\n4\nlarge\ncarrots\n, diced\n4\nlarge\ncelery ribs\n, diced\n8\ncrushed\nmedium\ncloves garlic\n2\nlarge\nsprigs parsley\n(see note)\n2\npackets\nunflavored gelatin\n, dissolved in\n1/2\ncup\n(\n120\nml\n)\ncold water\n(optional; see note)\nDirections\nCombine chicken, water, onions, carrots, celery, garlic, and parsley in a large stockpot and bring to a simmer over low heat. Lower heat, maintaining a very gentle simmer, and cook for 1 hour 30 minutes. Strain stock through a fine-mesh strainer, let cool, then transfer to containers and refrigerate until completely chilled, about 6 hours. Skim off and remove any fat and scum on the surface. Refrigerate for up to 5 days or freeze for up to 6 months. If stock is thin even after being fully refrigerated, add optional gelatin solution to stock and bring to a boil until fully dissolved, then refrigerate or freeze.\nSpecial Equipment\nStockpot\n,\nfine-mesh strainer\nNotes\nFour pounds of chicken for the four quarts of water here is the minimum I've found that will produce a good, flavorful stock. Packing in even more chicken—up to eight pounds per four quarts—will yield an even richer, deeper stock. Different parts of the chicken will contribute different amounts of gelatin to the stock: Breast meat produces a deliciously flavorful stock that is very thin, while wings produce a slightly less clean flavor, with lots of gelatin. If your stock still looks thin like water, even after being fully refrigerated, add the gelatin solution as instructed in the recipe. Feel free to add other herbs, such as fresh thyme or bay leaves.\nChicken\nBraised & Stewed Chicken\nSoups"
}