{
  "url": "https://www.seriouseats.com/best-chocolate-cupcake-recipe-8700276",
  "image_url": "https://www.seriouseats.com/thmb/7NeOwva6M4emEdoE30W_OVhkwEs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240723-SEA-Classic-Chocolate-Cupcake-MorganHuntGlaze-Hero2-48-22361832e218477a9f88e976a3620138.jpg",
  "tags": [
    "Chocolate",
    "The Latest",
    "Cakes",
    "Desserts"
  ],
  "title": "Chocolate Cupcakes",
  "full_text": "Chocolate Cupcakes\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nCooling Time\n30 mins\nTotal\n65 mins\nServes\n18 cupcakes\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\ndark chocolate chips\nor chopped bittersweet chocolate (3 ounces; 85g)\n1/2\ncup\n(120ml) hot\nwater\n(about 180ºF or 82ºC)\n3\nlarge\neggs\n1/2\ncup\n(120ml) neutral\noil\n, such as canola\n113\ng\nsour cream\n(4 ounces; 1/2 cup)\n2\nteaspoons\nvanilla extract\n195g\nall-purpose flour\n(about\n6 3/4\nounces\n; 1 1/2 cups)\n305g\ngranulated sugar\n(\n10 3/4\nounces\n; 1 1/2 cups)\n18\ng\n(3 tablespoons) unsweetened Dutch-processed\ncocoa powder\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3/4\nteaspoon\nbaking soda\n1/4\nteaspoon\nbaking powder\n1\nrecipe\nChocolate Buttercream\nor\nAmerican\nButtercream\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175ºC). Place paper baking cups in two 12-cup muffin pans.\nFit a piping bag\nwith desired piping tip for frosting the cupcakes; set aside.\nMorgan Hunt Glaze\nIn a medium bowl, cover bittersweet chocolate with hot water; let sit 2 minutes. Whisk until chocolate is melted, about 1 minute. Whisk in eggs, oil, sour cream, and vanilla until smooth.\nMorgan Hunt Glaze\nIn a large bowl, whisk flour, sugar, cocoa powder, salt, baking soda, and baking powder to combine. Add chocolate mixture and whisk until just smooth and no lumps remain. Divide batter equally between baking cups, filling each about 2/3 of the way.\nMorgan Hunt Glaze\nBake until a wooden toothpick or cake tester inserted into center of cupcakes comes out clean and cupcakes spring back lightly when touched, about 18 minutes. Transfer to a wire rack. Let cool in pan for 10 minutes, then remove cupcakes from pan and allow them to cool completely, about 20 minutes.\nMorgan Hunt Glaze\nUsing a flexible spatula, scrape buttercream into prepared piping bag. Pipe buttercream on top of each cupcake until completely covered. (Alternatively, use an offset spatula to spread buttercream on top of each cupcake until completely covered.) Repeat with remaining cupcakes.\nMorgan Hunt Glaze\nSpecial Equipment\nBaking cups, two 12-cup muffin pans, piping bag and piping tip or offset spatula, stand mixer, flexible spatula, wooden toothpick or cake tester, wire rack\nMake-Ahead and Storage\nUnfrosted cupcakes can be tightly wrapped in plastic wrap and frozen for up to 3 months. When ready to frost, thaw overnight at room temperature.\nFrosted cupcakes can be kept at room temperature in an airtight container for up to 3 days.\nChocolate\nThe Latest\nCakes\nDesserts"
}