{
  "url": "https://www.seriouseats.com/best-pesto-recipe",
  "image_url": null,
  "tags": [
    "Italian",
    "Pesto",
    "Vegetarian Mains",
    "Basil",
    "Nuts & Seeds"
  ],
  "title": "The Best Pesto alla Genovese (Classic Basil Pesto Sauce)",
  "full_text": "The Best Pesto alla Genovese (Classic Basil Pesto Sauce)\nJump to recipe\nPrep\n30 mins\nActive\n30 mins\nTotal\n30 mins\nServes\n4 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\ncloves garlic\n(\n10\ng\n)\n2\ntablespoons\npine nuts\n(about\n1\nounce\n;\n30\ng\n)\n3\nounces\nbasil leaves\n(\n85\ng\n), from about a\n4-ounce bunch\n, washed with water still clinging to the leaves (about 4 cups basil leaves)\nCoarse sea salt\n, as needed\n3/4\nounce\ngrated\nParmigiano Reggiano\n(about\n2\ntablespoons\n;\n21\ng\n)\n3/4\nounce\nPecorino Fiore Sardo\n(about\n2\ntablespoons\n;\n21\ng\n), see note\n3/4\ncup\n(\n175\nml\n) mildly flavored\nextra-virgin olive oil\nDirections\nUsing a marble mortar and wooden pestle (see note), pound the garlic to a paste.\nSerious Eats / Vicky Wasik\nAdd pine nuts and continue to crush with pestle, smashing and grinding them, until a sticky, only slightly chunky, beige paste forms.\nSerious Eats / Vicky Wasik\nAdd basil leaves a handful at a time and pound and grind against the walls of the mortar. Add pinch of salt with each handful to act as an abrasive. Continue until all basil leaves have been crushed to fine bits.\nSerious Eats / Vicky Wasik\nAdd both cheeses, then slowly drizzle in olive oil, working it into the pesto with the pestle until a fairly smooth, creamy, emulsified sauce forms. Add more oil, if desired.\nSerious Eats / Vicky Wasik\nPesto can be served with pasta right away\nor transferred to a jar or container, covered with a thin layer of olive oil, and sealed and refrigerated overnight.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nMarble mortar and wooden pestle\nNotes\nIf you can't find Pecorino Fiore Sardo, you can use Pecorino Romano instead, but increase the Parmigiano-Reggiano to 1 ounce, and cut the pecorino to 1/2 ounce.\nIf you want to use a\nfood processor\n, you will still end up with a very good pesto using this ratio of ingredients. Just pulse the garlic, salt, and pine nuts together first, then add the cheese and follow with the basil; stir in the oil.\nTo serve this pesto on pasta\n, toss the sauce with the drained noodles off the heat, adding a little reserved pasta-cooking water to help bind it all together. Adding pieces of cooked new potato and green beans to the pasta is a traditional Ligurian touch.\nMake-Ahead and Storage\nPesto can be stored in an airtight jar or container, covered with a thin layer of olive oil, and refrigerated overnight.\nRead More\nPesto Pasta with Potatoes and Green Beans Recipe\nThe Food Lab: Making Pesto or Curry Paste? The Freezer Is Your Friend\nPesto alla Trapanese (Sicilian Pesto With Almonds and Tomatoes) Recipe\nGarlic Scape Pesto Recipe\nFennel Frond Pesto With Lemon and Anchovies Recipe\nItalian\nPesto\nVegetarian Mains\nBasil\nNuts & Seeds"
}