{
  "url": "https://www.seriouseats.com/best-potato-leek-soup-recipe",
  "image_url": null,
  "tags": [
    "Soups",
    "Vegetarian Mains",
    "Stovetop",
    "Leeks",
    "Russet Potatoes"
  ],
  "title": "The Best Potato-Leek Soup",
  "full_text": "The Best Potato-Leek Soup\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n30 mins\nTotal\n45 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nunsalted butter\n2\nlarge\nleeks\n, white and pale green parts only, rinsed and roughly chopped\n1\nquart\nhomemade\nor\nstore-bought low-sodium chicken stock\n2\nmedium\nrusset potatoes\n, peeled and cut into quarters (about\n3/4\npound\n)\n1\nbay leaf\nKosher salt\nand\nfreshly ground black pepper\n1\ncup\nbuttermilk\n1/2\ncup\nheavy cream\n1/2\nteaspoon\nfreshly ground nutmeg\nSliced chives\nor\nscallions\n, for serving\nDirections\nHeat butter in a large saucepan or Dutch oven over medium heat until melted. Add leeks, reduce heat to low, and cook, stirring frequently, until very soft but not browned, 10 to 15 minutes.\nSerious Eats / Eric Kleinberg\nAdd stock, potatoes, and bay leaf, and season lightly with salt and pepper. Bring to a boil over high heat, reduce to a gentle simmer, cover, and cook until potatoes are fall-apart tender, about 15 minutes.\nSerious Eats / Eric Kleinberg\nTo Finish With a Ricer (Recommended):\nRemove potatoes from soup using tongs and transfer to a bowl. Set aside. Discard bay leaf. Transfer remaining soup to a blender. Slowly increase blender speed to high and blend until completely smooth, about 2 minutes. Return soup to a clean pot.\nSerious Eats / Eric Kleinberg\nPress potatoes through a potato ricer or food mill into the pot with the soup. Whisk in buttermilk and heavy cream. Whisking frequently, bring soup to a simmer over medium-high heat. Whisk in grated nutmeg. Season to taste with salt and pepper and serve with chives or scallions.\nSerious Eats / Eric Kleinberg\nTo Finish With a Blender (Faster):\nAdd heavy cream and buttermilk to pot. Discard bay leaf. Working in batches if necessary, transfer soup to a blender. Slowly increase blender speed to high and blend until completely smooth, about 2 minutes. Return soup to a clean pot, pressing it through a fine-mesh strainer with the bottom of a ladle if a smoother texture is desired. Whisking frequently, bring soup to a simmer over medium-high heat. Alternatively, chill completely and serve cold. Whisk in grated nutmeg. Season to taste with salt and pepper and serve with chives or scallions.\nSerious Eats / Eric Kleinberg\nSpecial Equipment\nRicer\n,\nblender\n(optional),\nfine-mesh strainer\n(optional)\nNotes\nFor best results, follow instructions using a ricer. Blender soup will still taste good, but will have a slightly gluier consistency.\nRead More\nRoasted Garlic, Potato, and Parmesan Soup\nLoaded Baked Potato Soup\nSoups\nVegetarian Mains\nStovetop\nLeeks\nRusset Potatoes"
}