{
  "url": "https://www.seriouseats.com/best-nanaimo-bars-recipe-8671193",
  "image_url": "https://www.seriouseats.com/thmb/gPvYlWaMmSKLE0AUaCSMmQhEFQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240628-NanaimoBars-AmandaSuarez-hero-82c6e1320a5b4141ad9557a9800f6fed.jpg",
  "tags": [
    "Canadian",
    "The Latest",
    "Chocolate",
    "Desserts",
    "Dessert Bars"
  ],
  "title": "Nanaimo Bars",
  "full_text": "Nanaimo Bars\nClose\nJump to recipe\nPrep\n30 mins\nCook\n0 mins\nChilling Time\n110 mins\nTotal\n2 hrs 20 mins\nServes\n16 2-inch by 2-inch bars\nCook Mode\n(Keep screen awake)\nIngredients\nNonstick\nbaking spray\nFor the Base Layer:\n180\ng\ngraham crackers\n(about\n6 1/2\nounces\n;\n1 1/2\ncups\ncrushed)\n98\ng\nsweetened shredded coconut\n(about\n3 1/2\nounces\n;\n1\ncup\n)\n65\ng\nwalnuts\n(about\n2 1/4\nounces\n;\n1/2\ncup\n)\n113\ng\nunsalted butter\n(\n4\nounces\n;\n8\ntablespoons\n)\n67\ng\ngranulated sugar\n(about\n2 1/2\nounces\n;\n1/3\ncup\n)\n26\ng\nunsweetened cocoa powder\n(about\n1\nounce\n;\n5\ntablespoons\n), sifted\n1\nlarge\negg\n, beaten\nFor the Custard Filling:\n84\ng\nunsalted butter\n(about\n3\nounces\n;\n6\ntablespoons\n), softened\n173\ng\npowdered sugar\n(about\n6\nounces\n;\n1 1/2\ncups\n)\n36\ng\ncustard powder\n, such as Bird’s (\n1 1/4\nounces\n;\n3\ntablespoons\n)\n2\ntablespoons\n(\n30\nml\n)\nwhole milk\n1\nteaspoon\nvanilla extract\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Chocolate Layer:\n170\ng\nsemi-sweet or dark chocolate\n(\n6\nounces\n;\n1\ncup\n, chopped)\n42\ng\nunsalted butter\n(\n1 1/2\nounces\n;\n3\ntablespoons\n)\nDirections\nUsing nonstick baking spray, grease an 8- by 8-inch baking pan. Alternatively, line the baking pan with 2 long strips of parchment to cover the bottom and sides, creasing as needed to ensure a secure fit.\nFor the Crust:\nIn the bowl of a food processor, pulse together graham crackers, shredded coconut, and walnuts until finely ground. Transfer mixture to a medium bowl.\nSerious Eats / Amanda Suarez\nPlace butter in a medium heatproof bowl and set over a saucepan of simmering water. When butter is melted, whisk in sugar and cocoa powder until dissolved, then add beaten egg. Mix until smooth and slightly thickened, about 2 minutes.\nSerious Eats / Amanda Suarez\nPour melted butter mixture over graham cracker crumbs, tossing to evenly coat crumbs in chocolate and butter mixture. Gently knead until cohesive and transfer to prepared baking pan. Spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup. Place in the freezer until firm, about 10 minutes.\nSerious Eats / Amanda Suarez\nSerious Eats / Amanda Suarez\nFor the Custard Filling:\nIn a medium bowl, use a hand mixer to beat butter, powdered sugar, custard powder, milk, vanilla, and salt on medium speed until smooth, about 3 minutes. (Alternatively, in a stand mixer fitted with the paddle attachment, beat softened butter, powdered sugar, custard powder, milk, vanilla, and salt on medium speed until smooth, about 3 minutes.) Remove crust from freezer and, using a flexible or offset spatula, spread custard filling over the crust. Refrigerate until set, about 1 hour, then transfer baking pan to freezer until ready to top with chocolate.\nSerious Eats / Amanda Suarez\nFor the Chocolate Layer:\nIn a medium heat-proof bowl, combine chopped chocolate and butter. Set bowl over a saucepan of barely simmering water, stirring frequently, until chopped chocolate and butter are melted, about 5 minutes. Whisk until smooth and remove from heat.\nSerious Eats / Amanda Suarez\nRemove baking pan from the freezer. Using an offset spatula, spread chocolate mixture over chilled custard filling to evenly cover bars. Refrigerate bars until fully set, about 30 minutes.\nSerious Eats / Amanda Suarez\nUsing a hot knife, slice bars and serve. If not serving immediately, return bars to refrigerator until ready to serve. (For cleaner cuts, run knife under warm water and carefully dry the knife with a clean kitchen towel before portioning each slice.)\nSerious Eats / Amanda Suarez\nSpecial Equipment\n8- by 8-inch baking pan, food processor, medium saucepan, whisk, hand mixer or stand mixer, offset spatula\nMake-Ahead and Storage\nNanaimo bars can be up to 4 days in advance and refrigerated in an airtight container. To freeze Nanaimo bars, tightly wrap individual slices in a layer of plastic wrap and then a layer of foil, and freeze in an airtight container. Nanaimo bars can be frozen for up to 2 months.\nCanadian\nThe Latest\nChocolate\nDesserts\nDessert Bars"
}