{
  "url": "https://www.seriouseats.com/best-vegetarian-bean-chile-recipe",
  "image_url": "https://www.seriouseats.com/thmb/BohTVbCSitXRXh21nAumUHEMAdA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/best-vegetarian-bean-chile-recipe-HERO-ce764a8bb25a4949a2751ca384329d8a.JPG",
  "tags": [
    "Vegan Mains",
    "Vegetarian Mains",
    "Braised & Stewed Beans",
    "Cannellini & Kidney Beans",
    "Chickpeas"
  ],
  "title": "The Best Vegetarian Bean Chili Recipe",
  "full_text": "The Best Vegetarian Bean Chili Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n110 mins\nActive\n30 mins\nTotal\n2 hrs 5 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nwhole\nsweet dried chiles\nlike\ncosteño\n,\nNew Mexico\n, or\nchoricero\n, stems and seeds removed\n2\nsmall\nhot dried chiles\nlike\narbol\nor\ncascabel\n, stems and seeds removed (optional)\n3\nwhole\nrich fruity\ndried chiles\nlike\nancho\n,\nmulato\n,\nnegro\n, or\npasilla\n, stems and seeds removed\n1\nquart\nwater\n2\nwhole\nchipotle chiles in adobo sauce\nwith\n2\ntablespoons\nsauce\nfrom can\n2\n(\n14-ounce\n)\ncans\nchickpeas\n1\n(\n28-ounce\n)\ncan\nwhole tomatoes packed in juice\n2\ntablespoons\nvegetable oil\n1\nlarge\nonion\n, finely diced\n3\ncloves\ngarlic\n, grated on a microplane grater\n1 1/2\ntablespoons\ncumin\n2\nteaspoons\ndried oregano\n1\ntablespoon\nsoy sauce\n1\nteaspoon\nmarmite\nor\nvegemite\n2\n(\n14-ounce\n)\ncans\ndark red kidney beans\n, drained, liquid reserved separately\n2\ntablespoons\nvodka\nor bourbon\nKosher salt\n2 to 3\ntablespoons\nmasa\nDirections\nAdd dried chiles to a large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside. Alternatively, place dried chiles on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl. Add water and chipotle chiles, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside. Transfer chiles and liquid to blender and blend, starting on the lowest possible setting and gradually increasing speed to high (make sure to hold the lid down with a clean kitchen towel or a potholder to prevent it from blowing out). Blend until smooth, about 1 minute.\nSerious Eats / Julia Estrada\nDrain chickpeas, reserving liquid from can. Transfer chickpeas to a food processor and pulse until just roughly chopped, about three 1-second pulses. Set aside.\nSerious Eats / Julia Estrada\nRoughly squeeze tomatoes through your fingers into approximate 1/4-inch pieces. Add to chickpea water along with any juices.\nSerious Eats / Julia Estrada\nHeat oil in a large saucepan or Dutch oven over medium-high heat until shimmering. Add onions and cook, stirring frequently, until softened but not browned, about 4 minutes. Add garlic, cumin, and dried oregano and cook, stirring constantly, until fragrant, about 30 seconds. Add puréed chiles, soy sauce, and marmite and cook, stirring constantly, until fragrant, about 30 seconds. Add reserved chickpea/tomato water mixture and stir to combine. Add chopped chickpeas and kidney beans. Stir to combine.\nSerious Eats / Julia Estrada\nIf beans are sticking out of the top, add reserved kidney bean liquid until just barely submerged. Bring to a boil over high heat, reduce to a bare simmer, and cook, stirring occasionally, until thick and rich, about 1 1/2 hours, adding more reserved kidney bean liquid as necessary if chili becomes too thick or sticks to the bottom of the pan.\nSerious Eats / Julia Estrada\nWhen cooked, add vodka or bourbon and stir to combine. Season to taste with salt and whisk in masa in a slow steady stream until desired thickness is reached. For best results, allow chili to cool and refrigerate for at least one night and up to a week. Reheat to serve.\nSerious Eats / Julia Estrada\nServe, garnished with cilantro, chopped onions, scallions, avocado, lime wedges, and warm tortillas as desired.\nSerious Eats / Julia Estrada\nSpecial Equipment\nDutch oven\n,\nblender\nor\nimmersion blender\n,\nfood processor\nRead More\nThe Best Chili Ever\nVegan Sweet Potato and 2-Bean Chili With Hominy\nQuick and Easy Vegetarian Tamale Pie With Brown Butter Cornbread Crust\nSerious Entertaining: A Comforting Vegetarian Dinner\nVegan Mains\nVegetarian Mains\nBraised & Stewed Beans\nCannellini & Kidney Beans\nChickpeas",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-vegetarian-bean-chili-recipe.webp?"
}