{
  "url": "https://www.seriouseats.com/best-blueberry-pie-dessert-recipe",
  "image_url": null,
  "tags": [
    "Pies",
    "Blueberry",
    "Memorial Day",
    "4th of July",
    "Labor Day"
  ],
  "title": "The Best Blueberry Pie Recipe",
  "full_text": "The Best Blueberry Pie Recipe\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nActive\n15 mins\nChilling/Cooling Time\n3 hrs 30 mins\nTotal\n5 hrs\nServes\n8\nto 10 servings\nMakes\n1 double-crusted pie\nCook Mode\n(Keep screen awake)\nIngredients\n20\nounces\nfresh blueberries\n(\n3 1/4\ncups\n;\n565\ng\n)\n8\nounces\nwild blueberries\n(\n2\ncups\n;\n225\ng\n), fresh or frozen (see notes)\n1\nounce\nfresh juice\nfrom\n1\nwhole\nlemon\n(\n2\ntablespoons\n;\n30\ng\n)\n7\nounces\nsugar\n(\n1\ncup\n;\n195\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume or use the same weight\n1/4\nteaspoon\nground coriander\n(optional)\n1 1/2\nounces\ntapioca starch\n(\n1/3\ncup\nplus\n1\nteaspoon\n;\n40\ng\n), such as Bob's Red Mill (see notes)\nOld-fashioned flaky pie dough\n, rolled and chilled as per the directions for a double crust\nFor the Egg Wash (optional):\n1\nlarge\negg\n1\nlarge\negg yolk\n1/2\nounce\nheavy cream\n(\n1\ntablespoon\n;\n15\ng\n)\n1/8\nteaspoon\n(\n0.5\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume or use the same weight\nTo Serve (optional):\nLemon chantilly\nDirections\nFor the Filling:\nToss regular and wild blueberries, lemon juice, sugar, salt, coriander (if using), and tapioca starch in a large bowl, folding with a flexible spatula until well combined. Scrape into prepared pie shell and top with remaining dough, using a solid sheet, cutouts, or a lattice-top design. (Check out my tutorial\nhere\n.) Trim away excess dough and refrigerate to ensure top crust is completely chilled, about 30 minutes. Meanwhile, adjust oven rack to lower-middle position and preheat to 400°F (200°C).\nFor the Egg Wash (if using):\nWhisk egg, egg yolk, cream, and salt in a small bowl. Brush over chilled top crust in a thin, even layer. This will give the crust a glossy, golden sheen, but it is not necessary in any way.\nPlace chilled pie on a parchment-lined half-sheet pan. Bake until crust is golden, about 1 hour, then loosely cover with tented foil. (Alternatively, an empty baking sheet can be placed on the topmost rack of the oven to serve as a shield.) Continue baking until filling is bubbling even in the very center of the pie, about 15 minutes longer. If crust completely covers filling, bake until pie reaches an internal temperature of 213°F (101°C) on a digital thermometer. The time can vary considerably depending on the thickness and type of pie plate, the amount of top crust, how long the pie was refrigerated, et cetera.\nTo Serve:\nCool pie until no warmer than 85°F (29°C) on a digital thermometer, about 3 hours depending on the type of pie plate (at higher temperatures, filling will be runny and thin). Slice into wedges with a sharp knife, pressing firmly against bottom and sides of pie plate to ensure the bottom crust is completely cut. If you like, serve with lemon chantilly. Wrapped in foil, leftovers will keep up to 3 days at room temperature; warm 10 minutes in a 350°F (180°C) oven to revive crust before serving.\nSpecial equipment\n9-inch pie plate (preferably tempered-glass), pastry brush, rimmed half-sheet pan,\ndigital thermometer\nNotes\nDue to disparate sourcing practices, tapioca starch manufactured in Asia may be derived from plants other than cassava, which may have different gelling properties. Look for products that mention cassava by name on the packaging, such as Bob's Red Mill.\nWhether you've got top-notch local berries or run-of-the-mill supermarket fruit, smuggling a portion of wild blueberries into the mix makes for a pie that's remarkably complex. If they're not growing in your own backyard, look for wild blueberries in the freezer aisle of well-stocked groceries like Kroger or markets such as Whole Foods and Trader Joe's. There's no need to defrost them before using. Of course, that's not to say you can't make a perfectly excellent pie using cultivated blueberries alone; only that you should probably make two pies to taste the difference side by side. You know, for science. If you'd prefer to skip the wild blueberries, simply increase the \"normal\" blueberries to 28 ounces (5 2/3 cups; 795g), fresh or\nfrozen\n.\nPrep time will fluctuate depending on the complexity of crust design.\nRead More\nA Crash Course in Mastering Pie Dough\nHow to Bake a Pie With Frozen Fruit\nHow to Freeze and Thaw a Fresh-Fruit Pie\nPies\nBlueberry\nMemorial Day\n4th of July\nLabor Day"
}