{
  "url": "https://www.seriouseats.com/best-strawberry-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/GSaLSQCRc5zobkOAuUXqmFjGtz4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/best-strawberry-ice-cream-recipe-hero-02_1-46a0912233a548c787f10389e86ccc5f.JPG",
  "tags": [
    "Ice Cream",
    "Strawberry"
  ],
  "title": "The Best Strawberry Ice Cream",
  "full_text": "The Best Strawberry Ice Cream\nClose\nJump to recipe\nPrep\n10 mins\nActive\n60 mins\nChurning/Freezing Time\n6 hrs 30 mins\nTotal\n6 hrs 40 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n30\nounces\n(\n1\nquart\nplus a little extra)\nfresh strawberries\n, washed, hulled, and divided (see notes)\n1 1/4\ncups\nsugar\n, divided\n4\ntablespoons\n80-proof liquor\nsuch as\nvodka\nor, preferably,\nCointreau\n2\ncups\nhalf-and-half\n1/2\ncup\ncorn syrup\n1/2\nteaspoon\nkosher salt\n, to taste\nScant drops of\nlemon juice\n, if needed\nDirections\nQuarter 6 ounces (about 1 cup) strawberries, then slice quarters crosswise into very thin pieces. In a mixing bowl, combine strawberries with 1/2 cup sugar and alcohol and let stand in refrigerator for at least 2 hours and up to 2 days.\nSerious Eats / Qi Ai\nIn a countertop blender, process remaining strawberries until very smooth, about 30 seconds. Strain through a fine-mesh strainer to filter out all seeds and fibers, then measure and reserve 1 1/2 cups purée. Extra purée, if there is any, can be put to another use.\nSerious Eats / Qi Ai\nIn a clean mixing bowl, whisk together 1 1/2 cups strawberry purée with half-and-half, corn syrup, and remaining 3/4 cup sugar until fully combined. Add salt to taste, and, if mixture is too sweet, a few drops of lemon juice.\nSerious Eats / Qi Ai\nChill in refrigerator until base is very cold, at least 45°F (7°C), about to 2 to 3 hours. Churn in ice cream maker according to manufacturer's instructions. In the last minute of churning, retrieve strawberry mix-ins from the refrigerator, strain off syrup, and add mix-ins to the churn; reserve strawberry syrup for another use (it makes a great daiquiri). Transfer ice cream to airtight container and chill in freezer for at least 4 hours before serving.\nSerious Eats / Qi Ai\nSpecial Equipment\nIce cream maker\n,\nblender\nNotes\nThe quality of this ice cream depends entirely on your strawberries. Use impeccably ripe ones while they're in season; those giant store-bought berries won't taste the same. Strawberry amounts are approximate; final yields can vary, so this recipe may call for more fruit than you actually need.\nRead More\nFruity No-Churn Ice Cream Recipe\nHomemade Strawberry Shortcake Ice Cream Bars Recipe\nStrawberry Sorbet Recipe\nTaste-Test: 8 Supermarket Strawberry Ice Creams\nIce Cream\nStrawberry"
}