{
  "url": "https://www.seriouseats.com/best-tamale-pie-braised-skirt-steak-beef-charred-corn-brown-butter-cornbread-crust-recipe",
  "image_url": "https://www.seriouseats.com/thmb/VxBeUTZa8Cs0oP4MBJiYtZaVhBA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__01__20150128-tamale-pie-american-food-lab-recipe-37-13f5184f9afa4940ade1830d61752915.jpg",
  "tags": [
    "American",
    "Braised & Stewed Beef",
    "Pressure Cooked Beef",
    "Skirt Steaks",
    "Cornmeal"
  ],
  "title": "The Best Tamale Pie With Braised Skirt Steak, Charred Corn, and Brown Butter Cornbread Crust Recipe",
  "full_text": "The Best Tamale Pie With Braised Skirt Steak, Charred Corn, and Brown Butter Cornbread Crust Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n3 hrs 25 mins\nActive\n30 mins\nCooling Time\n15 mins\nTotal\n3 hrs 55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\nunsalted butter\n2\npounds\nskirt steak\nKosher salt\nand freshly\nground black pepper\n2\nwhole\nsweet dried chiles\nlike\nCosteño\n,\nNew Mexico\n, or\nChoricero\n, stems and seeds removed\n2\nwhole\nrich fruity\ndried chiles\nlike\nAncho\n,\nMulatto\n,\nNegro\n, or\nPasilla\n, stems and seeds removed\n3\ncups\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\ntablespoons\nvegetable\nor\ncanola oil\n1\ncup\nfresh corn kernels\nfrom\n1 to 2\nears\nof\ncorn\n1\nmedium\nonion\n, thinly sliced\n1\nred bell pepper\n, stemmed, seeded, and thinly sliced\n1\npoblano pepper\n, stemmed, seeded, and thinly sliced\n4\nmedium\ncloves garlic\n, thinly sliced\n1\nserrano pepper\n, minced\n1\ntablespoon\nground cumin\n(preferably from whole seeds)\n1\nteaspoon\nground coriander\n(preferably from whole seeds)\n1\nteaspoon\ndried oregano\n1\ncup\npitted green olives\n, sliced\n1\ntablespoon\nWorcestershire sauce\n1\ntablespoon\nAsian fish sauce\n4\nounces\ngrated sharp cheddar cheese\n(about\n1\ncup\n)\n3\nmedium\nscallions\n, thinly sliced\n1/2\ncup\nfresh cilantro leaves\nand fine stems, minced\nFor the Brown Butter Cornbread Crust:\n1\ncup\n(about\n5\nounces\n)\nfine yellow cornmeal\n1\ncup\n(about\n5\nounces\n)\nall-purpose flour\n4\ntablespoons\nsugar\n2\nteaspoons\nbaking powder\n1/4\nteaspoon\nbaking soda\n2\nlarge\neggs\n6\nounces\n(about\n3/4\ncup\n)\nsour cream\n4\nounces\n(about\n1/4\ncup\n)\ncultured buttermilk\nFor Serving:\nSour cream\n, for serving\nDirections\nAdjust oven rack to center position and preheat oven to 300°F (150°C) (see note for pressure cooker instructions). Heat butter in a large Dutch oven over medium heat until melted. Continue to cook, swirling pan gently until butter is nutty-smelling and solids are a toasty brown. Transfer to a heatproof cup or bowl and reserve for Brown Butter Cornbread Crust.\nReturn pan to high heat. Season skirt steak generously with salt and pepper. Add to the pan in as close to a single layer as possible. Cook without moving until deeply browned on bottom side, about 6 minutes. When beef is browned (do not brown top side), transfer to a large plate and set aside.\nSerious Eats / J. Kenji Lopez-Alt\nMeanwhile, place chiles on a microwave-safe plate and microwave until hot, pliable, and toasted, about 30 seconds. Transfer to a microwave-safe liquid measuring cup and add 1 cup chicken stock. Cover with plastic wrap and microwave on high power until gently simmering, about 3 minutes. Remove from microwave and transfer to a blender. Add remaining chicken stock. Blend until completely smooth, about 1 minute. Set aside.\nSerious Eats / J. Kenji Lopez-Alt\nReturn Dutch oven to high heat. Add oil to Dutch oven followed by corn. Cook, stirring occasionally, until corn is well charred in spots, about 4 minutes. Add onion, bell pepper, and poblano pepper, and cook, stirring, until softened but not browned, about 3 minutes.\nSerious Eats / J. Kenji Lopez-Alt\nAdd garlic, Serrano pepper, cumin, coriander, and oregano and cook, stirring, until fragrant, about 30 seconds. Add chili purée and stir to combine. Return beef to the pot along with any drippings. Add olives and stir to combine.\nSerious Eats / J. Kenji Lopez-Alt\nBring to a simmer on the stovetop, cover, and transfer to the oven (see note for pressure cooker instructions). Cook until beef is fall-apart tender, about 2 1/2 hours. Remove from oven.\nSet oven temperature to 425°F (220°C). Stir Worcestershire sauce, fish sauce, and cheese into stew. Return to stovetop and simmer on medium heat, stirring frequently, until thickened to a rich, stew-like consistency, about 5 minutes. Stir in scallions and cilantro and season to taste with salt and pepper. Transfer mixture to a 12-inch cast iron skillet or a 9- by 13-inch casserole dish.\nSerious Eats / J. Kenji Lopez-Alt\nFor the Brown Butter Cornbread Crust:\nCombine cornmeal, flour, sugar, 1 teaspoon kosher salt, baking powder, and baking soda in a large bowl. Combine eggs, sour cream, and buttermilk in a second bowl and whisk until homogenous. Whisking constantly, slowly drizzle in reserved browned butter. Whisk wet ingredients into dry ingredients until homogenous.\nSerious Eats / J. Kenji Lopez-Alt\nUsing a large spoon, place small dollops of the cornbread batter mixture on top of the beef filling, then use the back of the spoon to spread it into an even layer. Transfer the skillet to the oven and bake until pale golden brown and a skewer inserted into the cornbread comes out clean, about 20 minutes.\nSerious Eats / J. Kenji Lopez-Alt\nLet cool 15 minutes, then serve with sour cream.\nSerious Eats / J. Kenji Lopez-Alt\nNotes\nThe meat can be braised in a pressure cooker. To use a pressure cooker, follow recipe up to and including Step 5 (do not preheat oven in Step 1), using a stovetop or electric pressure cooker in place of the Dutch oven. Instead of Step 6, cook in the pressure cooker on high pressure for 45 minutes. Allow pressure to release naturally, remove lid, and continue recipe from Step 7.\nSpecial Equipment\nCast iron skillet\n,\nDutch oven\n, or an\nelectric\nor stovetop pressure cooker.\nRead More\nQuick and Easy Skillet Tamale Pie With Brown Butter Cornbread Crust\nAmerican\nBraised & Stewed Beef\nPressure Cooked Beef\nSkirt Steaks\nCornmeal"
}