{
  "url": "https://www.seriouseats.com/best-grilled-hot-dogs-recipe",
  "image_url": "https://www.seriouseats.com/thmb/QJZXQHDXBfTiUSKstQ1uskJc31g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-best-grilled-hot-dogs-recipe-hero-02-9d245c0d43874a3da13a7228682b0dce.jpg",
  "tags": [
    "Sausages",
    "The Latest",
    "Grilling",
    "Memorial Day",
    "Summer"
  ],
  "title": "The Best Grilled Hot Dogs",
  "full_text": "The Best Grilled Hot Dogs\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n25 mins\nTotal\n30 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\nstewed\nhot-dog onions\nor\n1\n(\n1-pound\n) package\nsauerkraut\n2\n(\n12-ounce\n)\nbottles\nlager\nor\nlight ale\n16\nnatural casing all-beef hot dogs\n(such as Dietz & Watson)\nHot dog buns\n, for serving\nMustard\n, for serving\nDirections\nLight one chimney full of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate.\nSerious Eats / Julia Hartbeck\nPlace stewed onions and juices (or sauerkraut, if using) in a 12-inch (or larger) cast iron skillet and add beer. Nestle hot dogs into onions (or sauerkraut).\nSerious Eats / Julia Hartbeck\nPlace cast iron pan on hot side of grill and cook until simmering, about 7-10 minutes. Slide to cooler side of grill. If using a charcoal grill, cover grill with vents over the hot dogs. Cook with all vents open until hot dogs are heated through, about 10 minutes, turning once halfway through cooking. If using a gas grill, simply lower the cover (there will not be vents).\nSerious Eats / Julia Hartbeck\nRemove lid. Using tongs, remove hot dogs from onions or sauerkraut and place directly on cooking grates over hot side of grill. Cook, turning occasionally, until well browned and crisp, about 3 minutes total. Return to cast iron pan. Toast buns over hot side of grill if desired. Serve hot dogs with buns, mustard, and onions or sauerkraut.\nSerious Eats / Julia Hartbeck\nSpecial Equipment\nGrill\n,\nchimney starter\n, and\n12-inch cast iron skillet\nor 10-inch square disposable aluminum pan.\nNotes\nIf using a disposable aluminum pan in step 3, it may require less time to heat the onions or sauerkraut to simmering.\nRead More\n8 Great Hot Dog Topping Ideas\nTaste Test: Chicago's Vienna Beef vs. New York's Sabrett Hot Dogs\nThe Best Way to Grill Sausages\nSous Vide Sausages Recipe\nRyan Farr's New York-Style Hot Dogs Recipe\nHow to Get Started Grilling\nSausages\nThe Latest\nGrilling\nMemorial Day\nSummer"
}