{
  "url": "https://www.seriouseats.com/better-no-knead-bread-recipe",
  "image_url": "https://www.seriouseats.com/thmb/gBMNe_J1QqbAz_QAXfW7-bRrhnw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/better-no-knead-bread-recipe-hero-01_1-48d654bfadeb4a5caf9b233b00fc74ca.JPG",
  "tags": [
    "Yeast Breads"
  ],
  "title": "Better No-Knead Bread",
  "full_text": "Better No-Knead Bread\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n15 mins\nRising Time\n86 hrs\nTotal\n87 hrs 5 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n300\ngrams\n(\n10.5\nounces\n, about\n2\ncups\n)\nbread flour\nor all-purpose flour\n4.5\ngrams\n(about\n3/4\nteaspoon\n)\nsalt\n3\ngrams\n(about\n0.5\nteaspoons\n)\nyeast\n210\ngrams\n(\n7.5\nounces\n, about\n1\ncup\nminus\n1.5\ntablespoons\n)\nwater\nDirections\nIn a large bowl, combine flour, salt, and yeast and whisk to combine. Add water and stir with a wooden spoon until no dry flour remains. Cover bowl tightly with plastic wrap and let sit at room temperature for at least 12 and up to 24 hours.\nSerious Eats / Mariel De La Cruz\nTransfer container to refrigerator and let sit for at least 3 and up to 5 days.\nSerious Eats / Mariel De La Cruz\nRemove dough from refrigerator and turn out onto well-floured surface. Turn once or twice and form into loaf shape. Cover with a well-floured kitchen towel and allow to rise at room temperature for at least 2 hours, and up to 4.\nSerious Eats / Mariel De La Cruz\nMeanwhile, adjust oven rack to lower-middle position and preheat oven to 450°F (230°C), with a heavy cast-iron or stainless steel Dutch oven placed inside it.\nSerious Eats / Mariel De La Cruz\nWhen dough has risen, slash top with a floured knife into 2 or 3 slashes, 1/2 inch deep. Remove Dutch oven from oven and working quickly, drop dough inside. Place lid back on Dutch oven and return to oven. Bake for 15 minutes, then remove lid and continue to bake until center of bread registers 209°F (98°C) on an instant read thermometer, about 30 to 45 minutes longer (time will vary depending on shape of loaf).\nSerious Eats / Mariel De La Cruz\nRemove Dutch oven from oven and remove loaf of bread with a spatula or tongs. Allow to rest on a wire rack for at least 15 minutes before slicing and serving. Unused bread can be stored at room temperature wrapped in foil for up to 3 days, though it may need to be refreshed in a hot oven or toaster before serving.\nSerious Eats / Mariel De La Cruz\nNotes\nYou can modify this recipe easily to bake loaves of any size. The important thing to note is the ratio of ingredients: 100 parts flour, 1.5 parts salt, 1 part instant yeast, and 70 parts water.\nSpecial Equipment\nDutch oven\n,\ngram scale\n,\ninstant-read thermometer\nRead More\nSimple Crusty White Bread Recipe\nHow to Make a Sourdough Bread Loaf\nHomemade Focaccia Recipe\nJim Lahey's No-Knead Pizza Dough Recipe\nYeast Breads"
}