{
  "url": "https://www.seriouseats.com/beurre-blanc-recipe-7643412",
  "image_url": "https://www.seriouseats.com/thmb/5vlTM6afuEVCcvGRzc4r3evrGkI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230815-SEA-BeurreBlanc-AmandaSuarez-007-ddc00798a9c14f128526708133d26e23.jpg",
  "tags": [
    "Butter",
    "The Latest",
    "Condiments & Sauces"
  ],
  "title": "Beurre Blanc",
  "full_text": "Beurre Blanc\nClose\nJump to recipe\nCook\n10 mins\nTotal\n10 mins\nServes\n4 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\ndry white wine\n2\ntablespoons\n(\n30\nml\n)\nwhite wine vinegar\n, plus more if needed\nOne\nmedium\nshallot\n(\n2\nounces\n;\n57\ng\n), finely minced\n1 1/2\nsticks\n(\n170\ng\n) cold\nunsalted butter\n, cut into 1/2-inch pats\nKosher\nor\nsea salt\nFreshly\nground black\nor\nwhite pepper\n(optional)\nDirections\nIn a small saucepan or saucier, heat wine, vinegar, and shallot over medium heat until simmering. Cook at a simmer, swirling and stirring occasionally, until liquid is almost fully evaporated and only 1 or 2 tablespoons remain.\nSerious Eats / Amanda Suarez\nWorking with a few pats of butter at a time, whisk butter into reduced wine base, whisking constantly, until just melted and a milky emulsion forms (the sauce should not look broken). Immediately add 2 or 3 more pats of butter and continue to whisk until just melted. Repeat this process until all the remaining butter has been melted into the sauce and a stable emulsion has formed; remove the pan from heat and/or lower the heat at any point if it seems to be getting too hot and at risk of breaking. Season with salt.\nSerious Eats / Amanda Suarez\nNote that after the last piece of butter has melted into the sauce, the sauce may be tepid; if it is, carefully continue to heat it while whisking constantly until warmed through, but be careful not to overheat, which will cause it to break. Serve beurre blanc right away or keep warm until ready to serve (see make ahead below); it is best served on warmed plates in order to maintain a proper serving temperature for the sauce.\nSerious Eats / Amanda Suarez\nMake-Ahead and Storage\nBeurre blanc is best made right before serving, but can be held in a warm place or warm-water bath for up to a few hours (see section above on making the sauce ahead for more instruction). Be sure to re-whisk occasionally and add a tablespoon or two of water over time to prevent the sauce from over-thickening and breaking.\nButter\nThe Latest\nCondiments & Sauces"
}