{
  "url": "https://www.seriouseats.com/beyond-curry-pork-vindaloo-recipe",
  "image_url": "https://www.seriouseats.com/thmb/vrCT3_VTMkDkyeghH8MITOV0uyo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__2013.5.02-Pork20Vindaloo-db60e6d7f66c4a389f7b556bfaa076d0.jpg",
  "tags": [
    "Pork Mains",
    "Indian",
    "Pork Shoulder"
  ],
  "title": "Pork Vindaloo Recipe",
  "full_text": "Pork Vindaloo Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n90 mins\nActive\n15 mins\nTotal\n95 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n15\ndried Kashmiri chile\ns (see notes)\n2\nteaspoons\ntoasted\nwhole cumin seeds\n2\nteaspoons\nturmeric\n2\n(1-inch) pieces\nof\ncinnamon\n, divided\n9\nwhole\nblack peppercorns\n, divided\n7\nwhole\ncloves\n, divided\n1\nteaspoon\nsugar\n10\ngarlic flakes\n(or\n2\nmedium cloves\ngarlic\n, roughly chopped)\n1\ninch-piece\nginger\n, peeled and roughly chopped\n1/2\ncup\npalm vinegar\n, or\n1/3\ncup\nrice vinegar\n1/2\npound\npork shoulder\n, cut into 1-inch cubes\nKosher salt\n1\nmedium\nonion\n, roughly chopped (about\n1\ncup\n)\n1 1/2\ntablespoons\nvegetable oil\n1\ncup\nwater\nDirections\nCombine chiles, cumin, turmeric, 1 piece of cinnamon, 5 peppercorns, 4 cloves, and sugar in a spice grinder. Grind until a fine powder is formed. Transfer spice mixture to food processor or mortar and pestle and add garlic, ginger, and vinegar. Process or pound until a fine paste is formed. Scrape out paste into a small bowl and set aside without washing food processor.\nPlace pork in a large bowl and season with salt. Add half of spice paste and turn pork to coat. Add onion to food processor and process until a paste is formed.\nHeat oil in a heavy-bottomed saucepan over medium heat until shimmering. Add onion paste (do not wash food processor bowl), remaining 4 peppercorns, remaining cinnamon stick, and remaining 3 cloves. Cook, stirring constantly, until onion is soft and oil is fragrant, about 5 minutes. Add remaining spice paste and cook, stirring occasionally, until the oil separates and mixture starts to sizzle, about 5 minutes longer.\nAdd pork and cook, stirring occasionally, until browned, about 10 minutes. Add water to the food processor bowl and swirl to rinse. Pour mixture into pan and bring to a simmer, stirring occasionally. Reduce heat to maintain a gentle simmer, cover, and cook until the pork is fork tender, about 1 hour longer. Serve immediately with bread or rice, or for better flavor, cool, store overnight in a sealed container in the refrigerator, and reheat before serving.\nNotes\nDon't be alarmed by the amount of oil that will surface once the dish is made. This is necessary as it forms a layer over the pork and preserves it for future eating. Pork vindaloo is often had over days and preserves well in the fridge because of this.\nKashmiri chiles can be found in Indian specialty shops or online. Alternatively, use chiles de arbol.\nSpecial Equipment\nSpice grinder\n, heavy-bottomed lidded saucepan,\nfood processor\nor\nmortar and pestle\nPork Mains\nIndian\nPork Shoulder"
}