{
  "url": "https://www.seriouseats.com/bi-rite-creamerys-cara-cara-orange-cardamom-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/_N83pRC-k1n9drF_y50ISakd_jU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120427-bi-rite-orange-cardamom-primary-9ee1f4b9bc834a8cbb448a167e23908e.jpg",
  "tags": [
    "Ice Cream"
  ],
  "title": "Bi-Rite Creamery's Cara Cara Orange Cardamom Ice Cream",
  "full_text": "Bi-Rite Creamery's Cara Cara Orange Cardamom Ice Cream\nClose\nJump to recipe\nPrep\n30 mins\nActive\n60 mins\nChill Time\n6 hrs\nTotal\n6 hrs 30 mins\nServes\n6\nto 8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n1/4\nounce\n)\ngreen cardamom pods\n1 3/4\ncups\nheavy cream\n3/4\ncup\n1% or\n2% milk\n1/2\ncup\nsugar\n1/4\nteaspoon\nkosher salt\n5\nlarge\negg yolks\n1\nlarge\ncara cara orange\nor other variety orange\nDirections\nInfuse the milk/cream\n: Put the cardamom pods in a small skillet and put the pan over medium heat. Toast, stirring frequently, until aromatic, 2 to 3 minutes. Remove from the heat, let cool for a minute, then use a sharp knife to coarsely chop the pods.\nTip:\nCardamom pods have a tendency to fly all over the place when you chop them. To minimize this, use a large cutting board, a sharp knife, and slow, deliberate motions as you chop. Or you can crush the pods by rocking them back and forth over them on a cutting board.\nIn a medium heavy saucepan, stir together the cardamom, cream, milk, half of the sugar (1/4 cup), and the salt.\nPut the pan over medium-high heat. When the mixture just begins to bubble around the edges, remove from the heat and cover the pan. Let steep for about 30 minutes, or until the cream mixture has a distinct cardamom flavor. (Taste it to monitor the progress; the mixture will become bitter if oversteeped.)\nFor the base\n: In a medium heatproof bowl, whisk the yolks just to break them up, then whisk in the remaining sugar (1/4 cup). Set aside.\nUncover the cream mixture and put the pan over medium-high heat. When the mixture approaches a bare simmer, reduce the heat to medium.\nCarefully scoop out about 1/2 cup of the hot cream mixture and, whisking the eggs constantly, add the cream to the bowl with the yolks. Repeat, adding another 1/2 cup of the hot cream to the bowl with the yolks. Returning to the pan of cream on the stove, use a heatproof spatula to stir the cream as you slowly pour the egg and cream mixture from the bowl back into the pan.\nContinue to cook the mixture carefully over medium heat, stirring constantly, until the mixture is thickened, coats the back of a spatula, and leaves a clear mark when you run your finger across it, 1 to 2 minutes longer.\nStrain the base through a fine-mesh strainer and into a clean container. Working directly over the container, use a fine grater to grate the orange zest into the ice cream base. Set the container into an ice bath, wash your spatula, and use it to stir the base occasionally until it is cool. Then cover with plastic wrap and refrigerate the base for at least 2 hours or overnight.\nTo Freeze\n: Freeze in your ice cream machine according to the manufacturer's instructions. While the ice cream is churning, put the container you'll use to store the ice cream into the freezer. Enjoy right away or, for a firmer ice cream, freeze for at least four hours.\nSpecial Equipment\nIce cream machine\nIce Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bi-rite-creamerys-cara-cara-orange-cardamom-ice-cream.webp?"
}