{
  "url": "https://www.seriouseats.com/bi-rite-creamery-san-francisco-salted-caramel-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/WRzGzSsT0sEyuWdgWrJynLEiqCo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__bi-rite-salted-caramel-ice-cream-primary-b494252fbb3d446b93af574b9ae2f44c.jpg",
  "tags": [
    "Ice Cream",
    "Heavy Cream"
  ],
  "title": "Bi-Rite Creamery's Salted Caramel Ice Cream",
  "full_text": "Bi-Rite Creamery's Salted Caramel Ice Cream\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n30 mins\nChurning/Freezing Time\n6 hrs 30 mins\nTotal\n6 hrs 55 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4\ncups\nheavy cream\n, at room temperature\n3/4\ncup\ngranulated sugar\n3/4\ncup\n1% or\n2% milk\n1\nteaspoon\nkosher salt\n5\nlarge\negg yolks\nDirections\nFor the Caramel:\nSet the measured cream by the stove so it's at hand when you need it. Measure out 1/2 cup of the sugar and keep near the stove; you'll use this for the caramel (the rest will go in with the yolks). Put 2 tablespoons of the sugar for the caramel in a heavy stainless steel pan over medium-high heat. When the sugar is melted around the edges and starts to turn amber in places (about 2 minutes), stir the mixture gently and add another 2 tablespoons sugar to the pan.\nContinue to add the rest of the 1/2 cup sugar, 2 tablespoons at a time, stirring frequently and allowing most of the sugar to melt before you add more. Watch carefully as the sugar darkens, stirring gently to help it melt evenly.\nWhen the caramel becomes a dark mahogany color, remove the pan from the heat and immediately pour the cream slowly into the pan. (It will steam and bubble up, so wear oven mitts and be very careful to avoid splatters and steam burns.) When the bubbling subsides, gently stir to blend the cream completely into the caramel. If you have lumps of hardened caramel in your pan, simply put the pan over low heat and stir until the caramel is melted.\nFor the Base:\nOnce the caramel is completely smooth, stir in the milk along with the salt and put the pan over medium-high heat. When the mixture approaches a bare simmer, reduce the heat to medium.\nIn a medium heatproof bowl, whisk the yolks just to break them up, then whisk in the remaining 1/4 cup sugar. Set aside.\nCarefully scoop out about 1/2 cup of the hot cream mixture and, whisking the eggs constantly, add the cream to the bowl with the egg yolks. Repeat, adding another 1/2 cup of the hot cream to the bowl with the yolks. Returning to the pan of cream on the stove, use a heatproof spatula to stir the cream as you slowly pour the egg and cream mixture from the bowl back into the pan.\nContinue to cook the mixture carefully over medium heat, stirring constantly, until the mixture is thickened, coats the back of a spatula, and leaves a clear mark when you run your finger across it, 1 to 2 minutes longer.\nStrain the base through a fine-mesh strainer and into a clean container. Set the container into an ice bath, wash your spatula, and use it to stir the base occasionally until it is cool. Then cover base with plastic wrap and refrigerate for at least 2 hours or overnight.\nFreeze the Ice Cream:\nWhen the base is completely chilled, freeze in your ice cream machine according to the manufacturer's instructions. While the ice cream is churning, put the container you'll use to store the ice cream into the freezer. Enjoy right away, or for a firmer ice cream, freeze for at least 4 hours.\nSpecial Equipment\nIce cream machine\nRead More\nThe Best Strawberry Ice Cream\nHazelnut Mascarpone Ice Cream\nEasy Caramel Sauce\nIce Cream\nHeavy Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bi-rite-creamerys-salted-caramel-ice-cream.webp?"
}