{
  "url": "https://www.seriouseats.com/bi-rite-creamery-san-francisco-strawberry-balsamic-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/OPp8kj72E3lIPgQT_XxMfaMWhKM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120417-bi-rite-strawberry-primary-61d453d7e8b546f186375f959393d400.jpg",
  "tags": [
    "Ice Cream",
    "Strawberry",
    "Heavy Cream"
  ],
  "title": "Bi-Rite Creamery's Strawberry Balsamic Ice Cream",
  "full_text": "Bi-Rite Creamery's Strawberry Balsamic Ice Cream\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n60 mins\nChurning/Freezing Time\n6 hrs 30 mins\nTotal\n6 hrs 55 mins\nServes\n6\nto 8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Strawberry Purée:\n1 1/2\npints\n(\n3\ncups\n)\nstrawberries\n, hulled and halved or quartered\n2 1/2\ntablespoons\nsugar\n2\nteaspoons\nbalsamic vinegar\nFor the Base:\n5\negg yolks\n1/2\ncup\nsugar\n1 3/4\ncups\nheavy cream\n3/4\ncup\n1% or\n2% milk\n1/4\nteaspoon\nkosher salt\n2\nteaspoons\nbalsamic vinegar\nDirections\nCook the berries\n: Combine the berries with the 2 1/2 tablespoons sugar and 2 teaspoons vinegar in a large skillet. Put the pan over medium heat and cook, stirring frequently, until the strawberries are soft and the liquid they release has reduced somewhat, 6 to 8 minutes.\nLet cool slightly, then transfer the berries and their juice to a blender or food processor. Purée until smooth and refrigerate.\nMake the base\n: In a medium heatproof bowl, whisk the yolks just to break them up, then whisk in half of remaining sugar (1/4 cup). Set aside.\nIn a heavy stainless steel pan, stir together the cream, milk, salt, and the last of the sugar (1/4 cup) and put the pan over medium-high heat. When the mixture approaches a bare simmer, reduce the heat to medium.\nCarefully scoop out about 1/2 cup of the hot cream mixture and, whisking the eggs constantly, add the cream to the bowl with the yolks. Returning to the pan of cream on the stove, use a heatproof spatula to stir the cream as you slowly pour the egg and cream mixture from the bowl back into the pan.\nContinue to cook the mixture carefully over medium heat, stirring constantly, until the mixture is thickened, coats the back of a spatula, and leaves a clear mark when you run your finger across it, 1 to 2 minutes longer.\nStrain the base through a fine-mesh strainer and into a clean container. Set the container into an ice bath, wash your spatula, and use it to stir the base occasionally until it is cool. Then cover with plastic wrap and refrigerate the base for at least 2 hours or overnight.\nFreeze the ice cream\n: Whisk the strawberry purée and the remaining 2 teaspoons vinegar into the chilled base.\nFreeze in your ice cream machine according to the manufacturer's instructions. While the ice cream is churning, put the container you'll use to store the ice cream into the freezer. Enjoy right away or, for a firmer ice cream, freeze for at least 4 hours.\nSpecial Equipment\nBlender\nor\nfood processor\n,\nice cream maker\nRead More\nFruity No-Churn Ice Cream Recipe\nThe Best Strawberry Ice Cream Recipe\nStrawberry Dream Pie Ice Cream Recipe\nStrawberry Sorbet Recipe\nIce Cream\nStrawberry\nHeavy Cream"
}