{
  "url": "https://www.seriouseats.com/bibimbap",
  "image_url": "https://www.seriouseats.com/thmb/Xl_i8ZKSu5oGeEhLvZ7VtZwMtbk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__09__Food-Lab-Jr.-Bibimbap-primary-13c0ea7be6e24f8e927b83d8e4dbd2fa.jpg",
  "tags": [
    "Rice & Grain Mains",
    "Korean",
    "Fried Eggs"
  ],
  "title": "Kid-Friendly Bibimbap (The Food Lab Junior)",
  "full_text": "Kid-Friendly Bibimbap (The Food Lab Junior)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n60 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n2\ntablespoons\n(\n30\nml\n)\ngochujang\n(see notes)\n2\nteaspoons\n(\n10\nml\n)\nroasted sesame oil\n1\ntablespoon\n(\n3\ng\n)\ntoasted sesame seeds\n(gold, black, or a mix)\n2\nteaspoons\n(\n10\nml\n)\nhoney\n2\nteaspoons\n(\n10\nml\n)\nrice vinegar\n(see notes)\nFor the Toppings:\nRoasted sesame oil\n, for sautéing and dressing as needed\nToasted sesame seeds\n, as needed\nMinced garlic\n, as needed (optional)\nThinly sliced\nscallions\n, as needed (optional)\nSoy sauce\n, as needed\nKosher salt\n2\ncups\n(about\n5\nounces\n)\nsoy bean\nor\nmung bean sprouts\n2\ncups\n(about\n3\nounces\n) packed fresh\nspinach leaves\n1\nmedium\ncarrot\n, peeled, split in half lengthwise, and cut on a bias into thin slices\n1\nkirby\nor\nJapanese cucumber\n(or\n1/2\nan\nAmerican cucumber\n), peeled, split lengthwise, and cut into half moons\n4\nounces\nshiitake mushroom caps\n, thinly sliced\n4\nounces\nground beef\nor thinly sliced\nbeef\n(such as beef you’d find for shabu shabu or bulgogi at an Asian supermarket, thinly sliced Philly cheesesteak beef)\n2\nteaspoons\nhoney\nTo Serve:\n4\ncups\ncooked white short-grain rice\nRaw egg yolks\nor\nsunny-side up fried eggs\n, as desired\nDirections\nFor the Sauce:\nCombine all the sauce ingredients in a small bowl and stir together with a fork. Kids (and adults) can taste and smell each of the ingredients as they go in before tasting all of them combined (have some milk on hand in case the gochujang is too spicy for anyone).\nFor the Toppings:\nSet up your topping station by putting out bottles and containers of sesame oil, sesame seeds, garlic, scallions, and soy sauce on the counter. Set a stack of 6 small bowls on the counter as well.\nIn a wok or a small saucepan, bring 2 cups of water to a simmer. Add the bean sprouts and cook for 3 minutes. Fish them out with a slotted spoon, run them under cold water until you can handle them easily, then squeeze out excess moisture or spin them dry in a salad spinner (either of these is a great activity for kids). Place them in one of the small bowls.\nSerious Eats / J. Kenji López-Alt\nAdd the spinach to the simmering water and cook for 1 minute. Repeat the draining, cooling, and squeezing process and place the spinach in a second bowl.\nSerious Eats / J. Kenji López-Alt\nEmpty out the wok, and return it to medium-high heat, allowing it to dry fully. Add 2 teaspoons of sesame oil and heat until shimmering, then add the carrots and stir-fry until heated through and lightly softened, about 1 minute. Transfer to a third small bowl.\nReturn the wok to medium-high heat. Add 2 teaspoons sesame oil and heat until shimmering, then add the cucumber and stir-fry until heated through and lightly softened, about 1 minute. Transfer to a fourth small bowl.\nReturn the wok to medium-high heat. Add 2 teaspoons of sesame oil and heat until shimmering, then add the mushrooms and stir-fry until lightly browned , about 3 minutes. Transfer to a fifth small bowl.\nSeason the beef with 2 teaspoons soy sauce, 2 teaspoons honey, 1 teaspoon sesame oil, some minced garlic (if using), and a sprinkle of sesame seeds. Return the wok to medium-high heat. Add 2 teaspoons sesame oil and heat until shimmering, then add the beef and stir-fry until lightly browned, about 3 minutes. Transfer to a sixth small bowl.\nSerious Eats / J. Kenji López-Alt\nNow season all of the vegetables to taste with about 1 teaspoon of sesame oil, a sprinkle of sesame seeds, a dash of soy sauce, and some minced garlic and/or scallions. Make sure you and your helpers mix thoroughly (I like to use clean fingers) and taste as you go.\nTo Serve:\nServe steamed rice in individual bowls at the table, allowing diners to pick and choose their toppings, and finishing off each bowl with a fried egg or a raw egg yolk (if desired), and a drizzle of as much or as little sauce as you’d like (even if that’s none). Mix it all up, or eat it all separately: It’s your food, you decide.\nNotes\nGochujang is a fermented chili and wheat paste with a sweet-hot flavor. You can find it in many Asian supermarkets, and in many well-stocked Western supermarkets. You can also order it online.\nIf you don’t have rice vinegar, you can use another vinegar such as apple cider or white wine. Those vinegars tend to be more acidic, so start with half the amount and add more to taste.\nFor the toppings, you don’t need to use all of them. A mix of 4-5 toppings with varying colors is a good place to start.\nRice & Grain Mains\nKorean\nFried Eggs"
}