{
  "url": "https://www.seriouseats.com/bibimbap-recipe-7094731",
  "image_url": "https://www.seriouseats.com/thmb/9gYczIvS4R7ZvK19ahBns0xOG_k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230113-Bibimbap-AmandaSuarez-hero-331e5e1ffa5b400fbb684e59b14d57c1.JPG",
  "tags": [
    "Korean",
    "The Latest",
    "Rice & Grain Mains",
    "Vegetables"
  ],
  "title": "Homestyle Bibimbap",
  "full_text": "Homestyle Bibimbap\nClose\nJump to recipe\nPrep\n40 mins\nCook\n35 mins\nTotal\n75 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nTo Marinate the Beef:\n9\nounces\n(\n250\ng\n)\nground beef\n2\ntablespoons\nYangjo ganjang soy sauce\n1 1/2\ntablespoons\n(\n23\ng\n)\ngranulated sugar\nA\ndrop\nof\ntoasted sesame oil\nFreshly ground black pepper\n1\nteaspoon\nminced garlic\n, about\n1\nclove\nFor the Radish Kimchi:\n10 1/2\nounces\n(\n300\ng\n)\nKorean Moo radish\n, peeled and julienned 1mm thick\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n1 1/2\nteaspoons\ngochugaru\n(\nKorean chile flakes\n)\n1 1/2\nteaspoons\nminced garlic\n, about\n3\nmedium\ncloves\n1/2\nteaspoon\nsaeujeot\n(salted shrimp condiment)\n1\nteaspoon\nmaesil\n(plum) syrup\n2\npinches\nground ginger powder\n1\nspring onion\n, sliced 1/4-inch thick crosswise\n1\nteaspoon\nground toasted sesame seed powder\n(see note)\nFor the Spinach:\n10 1/2\nounces\n(\n300\ng\n)\nfresh spinach\n(not baby spinach), washed well of any grit or sand\n1\nteaspoon\nminced garlic\n, about\n2\nmedium\ngarlic cloves\nDiamond Crystal\nkosher salt\n, to taste\n2\nteaspoons\n(\n10\nml\n)\nyangjo ganjang soy sauce\n2\nteaspoons\n(\n10\nml\n)\ntoasted sesame oil\n1\nteaspoon\nground toasted sesame seeds\n(see note)\nFor the Beansprouts:\n7\nounces\n(\n200\ng\n)\nmung bean sprouts\n1/2\nteaspoon\nyangjo ganjang soy sauce\nDiamond Crystal\nkosher salt\n, to taste\n1\nteaspoon\n(\n5\nml\n)\ntoasted sesame oil\n1\nteaspoon\nminced garlic\n, about\n1\nclove\ngarlic\n1\nteaspoon\nground toasted sesame seeds\n(see note)\nFor the Carrots:\n7\nounces\n(\n200\ng\n)\ncarrots\n(about\n2\nmedium\ncarrots\n), peeled and julienned 3mm thick\nDiamond Crystal\nkosher salt\n, to taste\n1\ntablespoon\n(\n15\nml\n)\nperilla oil\n2\ntablespoons\n(\n30\nml\n)\nwater\nFor the Squash:\n9\nounces\n(\n250\ng\n)\nsummer squash\nor\nzucchini\n, cut into 1/4-in-thick strips\n1\nteaspoon\n(\n5\nml\n)\nsaeujeot\n(salted shrimp condiment)\n1\ntablespoon\n(\n15\nml\n)\nperilla oil\n1\nteaspoon\nminced garlic\n, about\n2\nmedium\ncloves\n1\nteaspoon\nground toasted sesame seeds\n(see note)\nFor the Shiitake Mushrooms:\n7\nounces\n(\n200\ng\n)\nshiitake mushrooms\n, stemmed and thinly sliced\n1/4\ncup\n(\n60\nml\n)\nwater\n1\ntablespoon\n(\n15\nml\n)\nperilla oil\n1\ntablespoon\n(\n15\nml\n)\nyanjo ganjang soy sauce\n1\nteaspoon\nminced garlic\n, about\n2\nmedium\ncloves\nFreshly ground black pepper\nFor the Rice:\n2\ncups\nsushi rice\n(\n14\nounces\n;\n400\ng\n)\nTo Finish and Serve:\n3\ntablespoons\n(\n45\nml\n)\nvegetable oil\n, divided\nMarinated beef\n4\nlarge\neggs\nKosher salt\nand\ngochujang\n(\nred pepper paste\n), for serving\nToasted sesame oil\n, for drizzling\nDirections\nTo Marinate the Beef:\nIn a medium bowl, season ground beef with soy sauce, sugar, sesame oil, black pepper, and garlic. Let marinate for at least 10 minutes and up to 45 minutes.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Radish Kimchi:\nIn a large mixing bowl, combine the radish with salt, gochugaru, garlic, shrimp paste, maesil syrup, and ginger. Massage seasonings into radish until it softens; there may be some juice. Add the sliced spring onion and sesame powder, then toss lightly to combine. Set aside and allow to sit for at least 30 minutes.\nSerious Eats / Amanda Suarez\nFor the Spinach:\nIn a medium saucepan of salted boiling water, cook spinach until wilted, about 1 minute. Immediately drain in a colander or strainer and rinse under cold water. In a medium bowl, toss spinach with chopped garlic, salt, soy sauce, sesame oil, and toasted sesame powder. Set aside.\nSerious Eats / Amanda Suarez\nFor the Bean Sprouts:\nIn a medium saucepan, combine bean sprouts with just enough water to cover. Cover saucepan and set over medium heat until water comes to simmer and sprouts are steamed and crisp-tender, about 10 minutes total. Drain and rinse sprouts immediately under cold water. In a medium bowl, season sprouts with soy sauce, salt, toasted sesame powder, chopped garlic, and sesame oil. Set aside.\nSerious Eats / Amanda Suarez\nFor the Carrots:\nWipe the pan out, drizzle in perilla oil, and set over medium heat. Add perilla oil, carrots, a pinch of salt, and cook, stirring often, until slightly softened, about 8 minutes; add water as needed in 1 tablespoon (15ml) increments to keep the carrots plump during cooking and prevent browning, but without making them overly wet. Transfer to a plate or small bowl and set aside.\nSerious Eats / Amanda Suarez\nFor the Squash:\nIn a 10-inch nonstick skillet, combine perilla oil with squash, garlic, and shrimp paste and set over medium heat. Cover and cook, stirring often and lifting the lid only to check cooking progress, until squash is tender but still holds its shape, about 5 minutes. (Covering the skillet traps stream, which we want here to prevent browning and keep the squash extra plump). Transfer to a plate or small bowl and set aside.\nSerious Eats / Amanda Suarez\nFor the Shiitake Mushrooms:\nWipe the pan out, drizzle in the perilla oil, and set over medium heat. Add sliced mushrooms, and garlic, and cook, stirring often, until mushrooms begin to soften, about 7 minutes; add water as needed in 1 tablespoon (15ml) increments to keep the mushroom plump and tender during cooking and prevent browning, but do not make them overly wet. Stir in soy sauce and freshly ground black pepper. Transfer to a plate or bowl and set aside.\nSerious Eats / Amanda Suarez\nFor the Rice:\nIn a large bowl, cover rice with water and, using your hands, swish and rinse rice until water becomes cloudy, about 30 seconds. Using a fine-mesh strainer, drain rice, then repeat until the water runs clear. Transfer drained rice to the bowl of a rice cooker. Add 1 cup water and cook according to manufacturer's instructions. Alternatively, in a medium saucepan, combine drained rice with 1 cup water, bring to a simmer over medium heat, then cover, lower heat to low, and cook until rice is tender and fluffy, about 15 minutes or following timing on rice package. Remove from heat, fluff rice, then keep warm until ready to serve.\nSerious Eats / Amanda Suarez\nTo Finish and Serve:\nIn a large nonstick skillet, heat 1 tablespoon (15ml) oil over medium-high until it begins to shimmer. Add the marinated beef and cook, stirring often, until cooked through and lightly browned, about 10 to 15 minutes. Transfer beef to a clean bowl and set aside; wipe out skillet. Add the remaining 2 tablespoons (30ml) oil and heat until slightly shimmering. Break four eggs into the skillet, season with salt, and cook until whites are just set and the yolks are still runny, about 3 minutes.\nSerious Eats / Amanda Suarez\nFill four bowls with steamed rice. Wet the radish kimchi in its juice and arrange the prepared toppings on the rice in a circular pattern. Top each bowl with a sunnyside egg, a spoonful of gochujang, and a drizzle of sesame oil. Serve, passing additional gochujang at the table for diners to mix in to taste.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n10-inch nonstick skillet\nNotes\nFor best results, use a knife to prepare the vegetables and avoid using the food processor, as it may result in over-processed, mushy vegetables.\nMake Ahead and Storage\nAll the components can be made in advance. Koreans are eating a meal composed of side dishes and a bowl of rice and soup, and we often easily add all left-over side dishes into a bowl of rice and mix them together with a dollop of Gochujang and drizzle of sesame oil together.\nThe radish kimchi can be prepared 2-3 days in advance.\nKorean\nThe Latest\nRice & Grain Mains\nVegetables"
}