{
  "url": "https://www.seriouseats.com/bierocks-recipe-8775361",
  "image_url": "https://www.seriouseats.com/thmb/dAE5rkH5zgYshVJQkDpljiqGJGo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250115-SEA-Bierocks-DebbieWee-Hero3-20-dff57ce6cfd444cc870c0a3d7b514795.jpg",
  "tags": [
    "Ground Beef",
    "The Latest",
    "Cabbage",
    "Bread"
  ],
  "title": "Is It a Bierock or a Runza? These Savory Midwestern Buns Are Delicious Either Way",
  "full_text": "Is It a Bierock or a Runza? These Savory Midwestern Buns Are Delicious Either Way\nClose\nJump to recipe\nPrep\n35 mins\nCook\n50 mins\nProofing Time\n60 mins\nTotal\n2 hrs 25 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n1/2\ncup\n(\n120\nml\n)\nwhole milk\n, room temperature\n1/2\ncup\n(\n120\nml\n) warm\nwater\n, plus more as needed (see notes)\n52\ng\ngranulated sugar\n(about\n1 3/4\nounces\n;\n1/4\ncup\n)\n28\ng\nunsalted butter\n(about\n1\nounce\n;\n2\ntablespoons\n), melted and cooled slightly\n1\nlarge\negg\n, room temperature\n496\ng\nall-purpose flour\n(\n17 1/2\nounces\n; about\n3 1/2\ncups\n), plus more for shaping\n7\ng\n(\n2 1/4\nteaspoons\n)\ninstant yeast\n2\nteaspoons\nDiamond Crystal kosher\nsalt\n; for table salt, use half as much by volume or same quantity by weight\nNonstick\nspray\nFor the Filling:\n1\ntablespoon\n(\n15\nml\n) neutral\noil\n, like canola or vegetable\n1\npound\nground beef\n(\n16\nounces\n;\n454\ng\n), 85% lean\n1\nlarge\nyellow onion,\ndiced (\n10\nounces\n; about\n2\ncups\n)\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, start with half as much by volume, plus more to taste\n1\nteaspoon\nfreshly\nground black pepper\n1\nteaspoon\npaprika\n1/2\nteaspoon\ngarlic powder\n1/2\nteaspoon\nonion powder\n1/2 medium\ngreen cabbage\n(\n20\nounces\n;\n567\ng\n), cored, quartered, and thinly sliced (about 6 cups)\n1/2\ncup\n(\n120\nml\n)\nwater\nor low-sodium beef broth\nTo Assemble:\n1\nlarge\negg\n1\nteaspoon\nwater\nMustard\nor other condiments of choice, for serving (optional)\nDirections\nFor the Dough:\nIn a 4-cup liquid measuring cup or medium bowl, whisk milk, water, sugar, butter, and egg until smooth and sugar is dissolved.\nSerious Eats / Debbie Wee\nIn the bowl of a stand mixer fitted with a dough hook attachment, combine flour, yeast, and salt and mix on low speed until combined, about 20 seconds. With the mixer running on low speed, pour liquid mixture into the flour in a slow, steady stream. Continue mixing until a shaggy dough forms, stopping to scrape the sides of the bowl with a flexible spatula or dough scraper as needed, 2 to 3 minutes. If dough is excessively dry and dry flour remains, add water, 1 tablespoon at a time, mixing for 30 seconds to 1 minute after each addition, until all flour is hydrated and incorporated. Once no visible flour remains and dough is fairly cohesive, increase mixer speed to medium and knead until dough is smooth, elastic, and pulls away from sides of bowl, about 8 minutes.\nSerious Eats / Debbie Wee\nTransfer dough onto a lightly floured surface and knead by hand to form a smooth ball, about 1 minute. Lightly grease a large bowl with nonstick cooking spray. Place dough seam-side down into bowl and cover tightly with plastic wrap. Let rise at room temperature until dough is doubled in size, 45 minutes to 1 hour.\nSerious Eats / Debbie Wee\nFor the Filling:\nWhile dough proofs, heat oil in a 12-inch cast iron skillet or straight-sided stainless steel sauté pan over medium-high heat. Add beef and onion and cook, breaking up meat and stirring often with a wooden spoon, until beef is browned, onion is just tender, and any moisture in the pan has cooked off, 12 to 15 minutes. Reduce heat to medium and stir in salt, pepper, paprika, garlic powder, and onion powder until well incorporated.\nSerious Eats / Debbie Wee\nAdd cabbage to pan a handful at a time, stirring between additions to combine. When all cabbage has been added, pour in water and stir to scrape up any browning on bottom of skillet. Continue cooking, stirring often, until liquid is evaporated and cabbage is wilted and tender with a slight bite, about 10 minutes. Remove from heat, season to taste, and let filling cool at room temperature, at least 20 minutes or up to 1 hour.\nSerious Eats / Debbie Wee\nFor the Bierocks:\nOnce dough is proofed, adjust oven racks to upper-middle and lower-middle positions and preheat to 350°F (175ºC).\nLine two 13- by 18-inch rimmed baking sheets with parchment paper. Using your hands, gently press dough to deflate it and transfer to a lightly floured work surface. Using a bench scraper or sharp knife,  quarter the dough, then cut each quarter in half so you have 8 pieces of dough weighing about 105g each. (See notes.) Shape each piece roughly into a ball and set aside. Cover loosely with a clean kitchen towel or plastic wrap to keep dough from drying on top.\nSerious Eats / Debbie Wee\nWorking with 1 dough ball at a time, use a rolling pin to shape into an 8-inch round, rolling from the center outward and lightly increasing pressure toward the edges so edges are slightly thinner than the middle. (Dough should be soft and pliant; if it recoils while rolling, let it rest for 5 minutes before continuing.) Place 3/4 cup of cooled filling in a rounded mound in center, leaving a border of at least 1 inch around edges.\nSerious Eats / Debbie Wee\nGently bring edges of dough over filling; pleat edges of dough repeatedly, pinching the edge closed after each pleat until the entire bierock is sealed in a cinched purse shape. Pinch and twist top to seal, gently pressing down on the top to flatten slightly.\nSerious Eats / Debbie Wee\nPlace bierock, smooth-side down, into the cupped palm of your hand and, using your other hand, rotate bierock, putting gentle pressure on its sides as you turn, to shape into a rounded bun. Turn bierock over and place it seam-side down on parchment-lined baking sheet. Repeat with remaining dough, placing 4 evenly spaced bierocks on each pan.\nSerious Eats / Debbie Wee\nAllow bierocks to rest until puffy and dough bounces back slightly when touched, about 15 minutes. Meanwhile, in a small bowl, whisk egg and water until smooth. Using a pastry brush, lightly brush top and sides of each bierock with egg wash.\nSerious Eats / Debbie Wee\nBake until tops are deep golden brown, 25 to 27 minutes, rotating the trays top-to-bottom and back-to-front halfway through baking. Transfer to a wire rack to cool for 5 minutes, then serve with mustard or other condiments of choice.\nSerious Eats / Debbie Wee\nSpecial Equipment\nStand mixer\nwith dough hook attachment, 12-inch\ncast iron skillet\nor\nstraight-sided sauté pan\n, 2\nrimmed half-sheet pans\n,\nrolling pin\n, pastry brush, wire rack\nNotes\nIf you live in a particularly dry climate, you may need additional water to hydrate the bread dough. If a shaggy dough does not form and visible dry flour remains after the initial 3-minute mix, add 1 tablespoon of water at a time and mix for 30 seconds to 1 minute between additions until a ragged dough forms.\nIf you want smaller, snack-sized bierocks, split dough into 12 pieces (about 70g or 2 ounces each), roll to 7-inch rounds, and use 1/2 cup filling per round. Bake them 6 to a pan, evenly spaced, for 20 to 25 minutes.\nFor log-shaped runzas, roll each dough portion into a long oval (about 8 inches long and 6 inches wide). Distribute beef and cabbage mixture along center of oval and seal by pinching edges into a long seam above filling.\nMake-Ahead and Storage\nThe filling can be made up to 2 days ahead of time and refrigerated in an airtight container. Baked bierocks can be stored in an airtight container or zip-top bag for up to 5 days in the refrigerator. They can also be individually wrapped in aluminum foil, placed in a zip-top bag, and frozen for up to 3 months.\nTo reheat, place a foil-wrapped bierock, with the foil opened slightly to allow steam to escape, on a baking sheet and bake in a 325°F (165ºC) oven or toaster oven until heated through, about 10 to 15 minutes from refrigerated or 40 to 45 minutes from frozen.\nGround Beef\nThe Latest\nCabbage\nBread",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/is-it-a-bierock-or-a-runza-these-savory-midwestern-buns-are-delicious-either-way.webp?"
}