{
  "url": "https://www.seriouseats.com/big-batch-grilled-pineapple-margarita-recipe-11727624",
  "image_url": "https://www.seriouseats.com/thmb/72v67HvhCnuhNAVW9e_wGWo-NnU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250502-SEA-GrilledPineappleMargarita-LorenaMasso-17-37e9cf7580334969b9a1eb1ed35d1b73.jpg",
  "tags": [
    "Cocktails",
    "The Latest",
    "Recipes",
    "Tequila"
  ],
  "title": "The Secret Ingredient for the Ultimate Summer Margarita: Grilled Pineapple",
  "full_text": "The Secret Ingredient for the Ultimate Summer Margarita: Grilled Pineapple\nClose\nJump to recipe\nPrep\n45 mins\nTotal\n45 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nwood chips\nsuch as apple or cherry wood\n7\nmedium\nlimes\n1/2\nripe\npineapple\n(\n1 1/2\npounds\n;\n680\ng\n), peeled and sliced crosswise into 1-inch-thick rings\n1/8\nteaspoon\ncoarse or flaky salt\n, plus more for garnish (optional)\n8\nounces\n(\n240\nml\n) high-quality blanco or reposado\ntequila\n6\nounces\n(\n180\nml\n)\nCointreau\nor other triple sec\nSugar\nto\ntaste\n, optional\nDirections\nUsing a large piece of heavy-duty aluminum foil, wrap wood chips in an 8- by 4-inch foil packet. (Make sure chips do not poke holes in sides or bottom of packet. If using gas, make sure there are no more than 2 layers of foil on bottom of packet.) Cut 2 evenly spaced 2-inch slits on top of packet. Grate limes to yield 4 teaspoons zest; set zest aside and halve limes.\nSerious Eats / Lorena Masso\nFor a Charcoal Grill:\nOpen bottom vent completely. Light large chimney starter filled halfway with charcoal briquettes (3 quarts). When top coals are partially covered with ash, pour evenly over half of grill. Place wood chip packet over hot coals. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot, about 5 minutes.\nSerious Eats / Lorena Masso\nFor a Gas Grill:\nRemove cooking grate and place wood chip packet directly on primary burner. Turn all burners to high; cover; and heat grill until hot, about 15 minutes. Leave all burners on high.\nClean and oil cooking grate. Grill pineapple slices and lime halves, cut side down, over direct heat (directly over hot coals for a charcoal grill or over the primary burner of a gas grill with the lid down), ­turning pineapple as needed, until charred and tender, about 15 minutes. Transfer pineapple and limes to plate as they finish cooking and let cool slightly, about 5 minutes.\nSerious Eats / Lorena Masso\nSqueeze 4 ounces (1/2 cup) juice from lime halves; reserve a piece of lime for salting the glass rims. Transfer 2 ­pineapple slices to cutting board and cut into 6 wedges; set aside for garnish. Transfer remaining pineapple, lime zest and juice, and pinch of salt to blender and process, starting on low speed and gradually increasing speed to high and scraping down sides of blender jar as needed, until completely smooth, about 1 minute. Transfer mixture to a large bowl and stir in tequila and triple sec. (The blended fruit mixture, before adding the alcohol, can be covered and refrigerated for up to 2 days.)\nSerious Eats / Lorena Masso\nStrain mixture through fine-mesh strainer set over serving pitcher or large container, pressing on solids to extract as much liquid as possible; discard solids. Season to taste with sugar or salt, if needed. Keep margarita and garnishes chilled in refrigerator until ready to serve.\nSpread 1/2 cup salt, if using, into even layer in shallow bowl. Moisten about 1/2 inch of chilled old-fashioned glass or margarita glass rims by running reserved lime around outer edge. Roll moistened rims in salt to coat. Serve margaritas in prepared glasses filled with ice, garnishing individual portions with pineapple wedges.\nSerious Eats / Lorena Masso\nSpecial Equipment\nCharcoal or gas grill, wood chips, aluminum foil, blender, fine-mesh strainer, large serving pitcher\nNotes\nThis recipe can be scaled down by half to serve 2 to 3 people.\nCocktails\nThe Latest\nRecipes\nTequila",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-secret-ingredient-for-the-ultimate-summer-margarita-grilled-pineapple.webp?"
}