{
  "url": "https://www.seriouseats.com/big-batch-apposta-cocktail-recipe-8703192",
  "image_url": "https://www.seriouseats.com/thmb/nCmOXi9-O6PMukEz44OYcsXOHII=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240823-SEA-Apposta-AmandaSuarez-hero-f026bdad4f484268ba34d896de29d0de.jpg",
  "tags": [
    "Cocktails",
    "The Latest",
    "Labor Day",
    "Summer Drinks",
    "Gin"
  ],
  "title": "Big-Batch Apposta Cocktail",
  "full_text": "Big-Batch Apposta Cocktail\nClose\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nServes\n8\nMakes\n8 cocktails\nCook Mode\n(Keep screen awake)\nIngredients\nFor the make-ahead cocktail base\n1 1/2\ncups\ngin\n(12 ounces; 375ml)\n3/4\ncup\nAperol\n(6 ounces; 180ml)\n3/4\ncup\nPunt e Mes\n(6 ounces; 180ml)\n1/4\ncup\nfresh\nlemon juice\n(from about 2 lemons) (2 ounces; 60ml)\nFor serving\nAbout\n2\ncups\nchilled grapefruit\nsoda\n(16 ounces; 475ml), preferably San Pellegrino Pompelmo grapefruit soda (from two 11.15-ounce cans), divided\n8\nstrips\nof\ngrapefruit peel\nfor garnish\n8\nfresh thyme\nsprigs\nfor garnish\nDirections\nFor the make-ahead-batch:\nCombine gin, Aperol, sweet vermouth, and fresh lemon juice in a resealable jar, container, swing top bottle, empty liquor bottle, or small pitcher that can comfortably hold 3¼ cups  (26 ounces) liquid. Serve immediately or seal well and refrigerate for up to 4 hours.\nSerious Eats / Amanda Suarez\nTo serve\n, stir batched alcohol mix well to recombine. Fill each Collins glass with ice. Add 3¼ ounces (about 6½ tablespoons) of the prepared alcohol mix to each glass, then top with about 2 ounces (1/4 cup) of chilled grapefruit soda. Stir gently to combine.\nSerious Eats / Amanda Suarez\nTwist a grapefruit peel over each drink to express its aromatic oils into the cocktail, then add to each drink as a garnish, along with a fresh thyme sprig. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nLiquid measuring cup, small pitcher or narrow-mouthed resealable container, such as a swingtop bottle, for easy pouring, that can comfortably hold 3¼ cups (26 ounces) liquid, funnel (optional but helpful to avoid splashing)\nNotes\nRecipe can be easily doubled or halved.\nFor a single serving, use the same numeric quantities, but swap out the units—1½ cups becomes 1½ ounces, 3/4 cup becomes 3/4 ounces\nMake-Ahead and Storage\nThe cocktail batch can be used immediately, or mixed through step 1 without the soda and refrigerated for up to 4 hours. For longer storage—up to several months in a sealed container without headroom—wait to add the juice lemon until ready to serve. Add the lemon juice to the batch mix just before pouring into glasses.\nCocktails\nThe Latest\nLabor Day\nSummer Drinks\nGin"
}