{
  "url": "https://www.seriouseats.com/biko-filipino-sticky-rice-cake-5189022",
  "image_url": "https://www.seriouseats.com/thmb/W9cK95wrWNLlRtrxS3jqUWHonFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210617-biko-vicky-wasik-seriouseats-seriouseats-27-62f3c7854d1443dfbe36f1b29dc1dae5.jpg",
  "tags": [
    "Filipino",
    "White Rice",
    "Dessert Bars",
    "Coconut Oil",
    "The Latest"
  ],
  "title": "Biko (Filipino Sticky Rice Cake)",
  "full_text": "Biko (Filipino Sticky Rice Cake)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n100 mins\nCooling Time\n45 mins\nTotal\n2 hrs 35 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n14-ounce\n(\n400\nml\n) can\ncoconut cream\n(see note)\n2\ncups\n(\n14\nounces\n;\n400\ng\n)\nglutinous sticky rice\n(see note)\nOne\n13.5-ounce\n(\n400\nml\n) can\ncoconut milk\n1\ncup\n(\n8\nounces\n;\n230\ng\n) dark muscovado or\ndark brown sugar\n(see note)\n1\nteaspoon\n(\n5\nml\n)\nvanilla\nor pandan\nextract\n(see note)\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nDirections\nAdjust oven rack to middle position and preheat to 375°F (190°C). In a 12-inch nonstick skillet, bring the coconut cream to a boil over high heat. Lower the heat to maintain a steady simmer. Cook, stirring every few minutes with a wooden spoon or heatproof spatula, until the curds separate from the oil, smell toasty, and turn deep golden brown, about 30 minutes.\nVicky Wasik\nStrain curds through a fine-mesh strainer set over a small heatproof bowl; set aside, reserving strained coconut oil. Transfer the strained latik to a separate small bowl and set aside; the curds will crisp up as they cool. Clean skillet and strainer.\nVicky Wasik\nGrease an 8-inch square anodized aluminum pan with the reserved coconut oil (save remaining coconut oil for another use).\nVicky Wasik\nIn a large bowl, cover rice with water by several inches. Using your hands, swish the rice in the water until water turns cloudy, about 30 seconds. Strain through fine-mesh strainer and repeat two more times.\nVicky Wasik\nIn a 3-quart saucepan, combine the washed rice with 2 cups (475ml) water, cover, and bring to a boil over high heat. Lower heat to maintain a simmer, and cook until the rice is tender and water has been absorbed, about 18 minutes. Remove from heat and keep covered.\nVicky Wasik\nIn the cleaned 12-inch nonstick skillet, combine the coconut milk, muscovado sugar, vanilla or pandan extract, and salt. Bring to a boil over medium-high heat, watching constantly to ensure it doesn't boil over. Lower heat to maintain a simmer. Cook, stirring occasionally, until the mixture has formed a dark brown caramel that coats the back of a spoon, about 10 minutes; you should have 1 1/2 cups (14 ounces; 400g) caramel. Remove from heat.\nVicky Wasik\nMeasure 1/2 cup (5 ounces; 140g) of the caramel and set aside. Add the cooked rice to the remaining caramel in the skillet and stir to combine. Return to medium heat and cook, stirring constantly, until caramel is absorbed and the biko mixture begins to thicken, about 5 minutes.\nVicky Wasik\nTransfer biko to prepared pan and spread in an even layer. Spread the reserved 1/2 cup caramel on top.\nVicky Wasik\nBake biko until the caramel topping is hot and bubbly, about 20 minutes.\nVicky Wasik\nTransfer pan to a wire rack to cool, about 45 minutes. Slice into sixteen 2-inch squares. Top each square with 1/2 teaspoon of reserved latik curds before serving.\nVicky Wasik\nSpecial Equipment\n8-inch square anodized aluminum cake pan\nNotes\nWhen purchasing coconut cream, avoid ones that include stabilizers and emulsifiers in their ingredients lists, which will prevent the curds from separating from the oil.\nGlutinous rice (also sold as “sweet” and “sticky” rice) can be found online or at Asian supermarkets.\nMuscovado sugar is sold in many grocery stores; we prefer it for its rich molasses flavor and moisture content. If you cannot find muscovado sugar, dark brown sugar is a great substitute.\nPandan extract has a mild grassy vanilla flavor with hints of coconut. It's sold in many Asian supermarkets.\nMake-ahead and Storage\nTo store biko, cover tightly with foil and refrigerate for up to 5 days. Reheat in the microwave in 15-second intervals.\nYou can also slice and freeze biko on a parchment-lined baking sheet until firm. Transfer to a zipper lock bag and store in the freezer for up to 2 months. Defrost before reheating in the microwave.\nLatik curds can be used to top many other Filipino desserts. Store in an airtight container and refrigerate for up to 1 week or freeze up to 1 month.\nFilipino\nWhite Rice\nDessert Bars\nCoconut Oil\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/biko-filipino-sticky-rice-cake.webp?"
}