{
  "url": "https://www.seriouseats.com/birria-de-res-beef-birria-recipe-8362004",
  "image_url": null,
  "tags": [
    "The Latest",
    "Mexican",
    "Beef Chuck",
    "Braised & Stewed Beef",
    "Beef Mains"
  ],
  "title": "Birria de Res (Beef Birria)",
  "full_text": "Birria de Res (Beef Birria)\nJump to recipe\nPrep\n45 mins\nCook\n4 hrs\nTotal\n4 hrs 45 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\nteaspoons\nblack\npeppercorns\n1/4\nteaspoon\ncumin seeds\n2\ncloves\n4\ncups\n(\n945\nml\n) homemade\nchicken stock\nor store-bought low-sodium chicken broth\n2\nplum\n(Roma)\ntomatoes\n(\n8\nounces\n;\n225\ng\n)\n2\ntomatillos\n, husks removed (\n4\nounces\n;\n85\ng\n)\n3\nguajillo\nchiles,\nstems removed\n2\nCalifornia\nchiles\n, stems removed\n3\nárbol\nchiles\n, stems removed\nOne\n3.5\n-\nounce\npack\nachiote paste\n(\n100\ng\n) (see notes)\n2\ntablespoons\ngochujang\n(see notes)\n5\nmedium\ncloves garlic\n4\npounds\n(\n2\nkg\n) boneless\nbeef chuck roast\n, trimmed of excess fat and cut into 2-inch cubes\nKosher\nsalt\nand\nfreshly\nground\nblack pepper\n1\ncup\nwater\n1\nwhole\nyellow onion\n, unpeeled, ends trimmed (\n8\nounces\n;\n227\ng\n)\n2\nwhole\nbay leaves\nFor Serving:\nDiced\nwhite\nonion\nMinced\nfresh\ncilantro leaves\nand tender stems\nWarmed\ncorn\ntortillas\nCooked rice\n(see notes)\nCooked\nbeans\nLime\nwedges\nDirections\nIn a large saucepan, toast peppercorns, cumin seeds, and cloves over medium heat until fragrant, about 30 seconds. Add chicken stock, tomatoes, tomatillos, guajillo, California, and árbol chiles. Bring to a boil over high heat, then turn off the heat, and let rest until tomato skins begin to shrivel and chiles soften, about 15 minutes.\nSerious Eats / Lorena Masso\nTransfer chicken stock mixture to a blender. Crumble achiote paste into the blender by hand. (see notes) Add gochujang and garlic cloves and blend (in batches if needed) into a smooth puree. Set aside.\nSerious Eats / Lorena Masso\nGenerously season beef all over with salt and pepper. In a stock pot or large Dutch oven, add the beef, blended chile sauce, water, onion, and bay leaves and cook over medium-high heat, covered, until just simmering.\nSerious Eats / Lorena Masso\nContinue to cook, covered, reducing heat as needed to maintain gentle simmer (about 180-190°F; 82-88°C), until beef is fork-tender, 3 to 4 hours. Discard onion and bay leaves and season with salt and pepper to taste. Hold warm until ready to serve.\nSerious Eats / Lorena Masso\nFor Serving:\nUsing a slotted spoon, transfer beef to a cutting board. Using 2 forks, shred beef into bite-sized pieces or lightly chop. Ladle consomé into individual serving bowls and top consomé with diced onion and cilantro (this is for dunking and/or spooning over the meat). Serve shredded beef with prepared consomé, warm tortillas, rice, beans, and lime wedges. (see notes)\nSerious Eats / Lorena Masso\nSpecial Equipment\nBlender\n,\n3-quart saucepan\n,\nstock pot\nor large\nDutch oven\nNotes\nAchiote paste is available at most latin markets. When shopping for achiote paste, search for a brand that doesn’t include artificial dyes in the ingredient list; it isn’t necessary due to the annatto seed’s natural food coloring properties. My preferred brand is El Yucateco.\nGochujang, a Korean fermented chili paste, is available at Asian markets and well-stocked food stores.\nI recommend wearing plastic gloves when crumbling the achiote paste into the blender to prevent your hands from staining red.\nServe the consomé hot to prevent the fat from solidifying. If the fat begins to solidify, gently reheat until liquified and gently stir it into the consomé.\nI recommend a Mexican-style tomato rice for serving.\nThe braised beef can also be used as a filling for a quesabirria, mulita, taco, or sandwich.\nMake-Ahead and Storage\nBirria submerged in its liquid can be refrigerated in an airtight container for up to 5 days or frozen for up to 3 months.\nSerious Eats / Lorena Masso\nThe Latest\nMexican\nBeef Chuck\nBraised & Stewed Beef\nBeef Mains"
}