{
  "url": "https://www.seriouseats.com/biryani-style-roast-chicken-recipe-8661770",
  "image_url": "https://www.seriouseats.com/thmb/1PXiv2YBTEvInc5HyiTSlTacJAY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240611-SEA-BiryaniStyleRoastChicken-KanikaandJatin-Sharma-Hero-6f756fad4526486fb33f4369761414d2.jpg",
  "tags": [
    "Chicken Mains",
    "The Latest",
    "Roasted Chicken",
    "Roasts"
  ],
  "title": "Biryani-Style Roast Chicken",
  "full_text": "Biryani-Style Roast Chicken\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs 30 mins\nSoaking and Marination Time\n4 hrs\nTotal\n7 hrs\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Potatoes with Saffron Yogurt:\n1/3 cup (\n76\ng)\nplain whole milk yogurt\n2\npinches\nof\nsaffron\nthreads (about 10-15 strands)\n1 tablespoon (\n15\nml)\nghee\n1/2\npound\n(680g) small\nred potatoes\nKosher\nsalt\nFor the Biryani Spice Mix\n1 1/2\nteaspoon\ncaraway seeds\n1 1/2\nteaspoon black\npeppercorns\n1 1/2\nteaspoon\ncoriander seeds\n1 1/2\nteaspoon\ncumin seeds\n1 1/2\nteaspoon\nfennel seeds\n6\ndried\nPequin\nchile\npeppers (see notes)\n8\ngreen cardamom\npods\nOne\n1-inch piece\nof\ncinnamon stick\n(Ceylon, preferably)\n4\nwhole\ncloves\n4\ndried\nallspice berries\n1\nteaspoon\nground nutmeg\nFor the Chicken and Marinade:\n1\nbay\nleaf\n1 1/2\ncups\n(355ml) plain\nwhole milk yogurt\n15\ndried\nPequin\nchile\npeppers, coarsely ground\n6\nmedium\ncloves garlic\n(30g), roughly chopped\nOne\n1-inch piece\nfresh ginger,\npeeled and grated\n2\ntablespoons\n(30ml)\nghee\n1\ntablespoon\n(12g)\njaggery (see notes)\n1\ntablespoon (15ml)\nhoney\n1\ntablespoon\nkosher salt\n; for table salt use half as much by volume\n1/2\nteaspoon\nground turmeric\nFresh\njuice\nfrom\n1\nlime\n1/2\ncup\nfresh coarsely chopped\nmint leaves\n1/4\ncup\nfresh minced\ncilantro leaves and tender stems\nOne\n3 1/2-4 1/2\npound\nwhole chicken\n, (1.6-2kg)\nFor the biryani:\n1\ncup (225g)\nbasmati rice\n1\ncup\n(235ml) homemade\nchicken stock\nor store bought chicken broth\n2\ntablespoons\n(30ml)\nneutral oil\nsuch as vegetable or canola oil, divided\n1\ntablespoon (45ml)\nghee\n2\nmedium\nyellow onions\n(1 pound; 453g), halved and sliced thin\n3\nmedium\nzucchini\n(about 8 ounces each), halved lengthwise and sliced crosswise into ½-inch thin half moons\nFor the Garnish:\n1\nbunch\nfresh\ncilantro, chopped\n1\nlime,\nhalved\nDirections\nFor saffron yogurt and potatoes:\nIn a small metal or glass bowl or glass jar, add the saffron strands, yogurt and ghee and stir thoroughly. Cover and refrigerate until yogurt is a rich golden color and infused with saffron flavor, 6 to 12 hours.\nSerious Eats / Kanika and Jatin Sharma\nIn a large, heavy-bottomed pot, combine 8 cups of cold water, 2 ½ tablespoons of salt, and the potatoes and bring to a boil over medium-high heat. Simmer, adjusting heat as needed to maintain simmer, until the potatoes are fork tender, 15 to 20 minutes. Drain potatoes and using a fork, prick each potato all over, then transfer to a large metal or glass bowl. Add the prepared saffron yogurt and stir to combine; set aside until ready to use or refrigerate for up to 10 hours.\nSerious Eats / Kanika and Jatin Sharma\nFor the biryani spice mix:\nMeanwhile,\nin a small stainless-steel skillet or sauté pan over medium heat and working with one spice at a time, toast allspice berries, cloves, cinnamon stick, peppercorns, Pequin peppers, cardamom, fennel, coriander, cumin, and caraway until just warm and fragrant, taking care not to burn the seeds. (The cumin, caraway, and fennel seeds will start to jump in the pan as they finish cooking.) Transfer each spice to the same mixing bowl as it is done. In a high-powered blender or spice grinder, or using a mortar and pestle, combine all toasted spices. Grind into a coarse powder, similar to coarsely ground pepper. Stir in the nutmeg and store at room temperature in an airtight jar until ready to use.\nSerious Eats / Kanika and Jatin Sharma\nFor the chicken and marinade:\nIn the now-empty small stainless-steel skillet, lightly toast the bay leaf over medium heat until color darkens slightly and fragrant, about 30 seconds. In a large bowl, whisk 1½ tablespoons of the prepared biryani spice mix, yogurt, chile peppers, garlic, ginger, ghee, jaggery, honey, salt, and lime juice until well combined. Fold in the mint and cilantro to combine; set aside.\nSerious Eats / Kanika and Jatin Sharma\nSpatchcock the chicken:\nUsing sharp kitchen shears, remove backbone. Flatten chicken by placing skin side up on a cutting board and applying firm pressure to breastbone.\nPlace the spatchocked chicken in a baking dish, large zip-top bag, or a food-safe storage container with a lid. Pour the prepared yogurt marinade all over the chicken. Add the bay leaf, then gently rub the marinade into the chicken to coat well. Cover the container or seal the bag and refrigerate for at least 2 hours, or preferably overnight up to 12 hours.\nSerious Eats / Kanika and Jatin Sharma\nFor the biryani:\nAdjust the oven rack to middle position and preheat oven to 425℉ (220℃). In a fine-mesh strainer, rinse the rice under running cold water until the water runs clear. Shake off excess water and transfer the rinsed rice to a small saucepan. Add 1 cup of chicken stock and bring to a boil over medium-high heat, then reduce heat to medium-low and cook, covered, until rice is par-cooked and most of the stock is absorbed, 10 minutes.\nSerious Eats / Kanika and Jatin Sharma\nIn 14- or 16-inch cast iron skillet or large Dutch oven, add 2 tablespoons oil and ghee and heat over medium heat until shimmering. Add onions and cook, stirring occasionally until softened and beginning to brown, 5 to 7 minutes. Lower heat to medium low and continue to cook, stirring frequently, until onions are reduced by about half in volume and are fully softened and golden brown, 15 to 20 minutes. If onions begin to char before fully softened, add a tablespoon of water as needed during cooking. Transfer to a bowl and set the skillet aside.\nSerious Eats / Kanika and Jatin Sharma\nIn the now-empty cast-iron skillet or Dutch oven, heat the remaining 1 tablespoon oil over medium-high heat until just smoking. Remove the chicken from the marinade and carefully place the chicken, breast side down, into the skillet and reduce heat to medium. The chicken should immediately sizzle. Add half of the reserved cooked onions around the chicken. Arrange the zucchini slices on top and around the chicken in an even layer, followed by the yogurt-dressed potatoes. Carefully uncover the par-cooked rice, (the stock should mostly be absorbed by the grains), and with a spoon, mound the rice on top of the vegetables and around the chicken. Remove the skillet or Dutch oven from heat.\nSerious Eats / Kanika and Jatin Sharma\nArrange the remaining cooked onions on top of the rice. If needed, use a wooden spoon to rearrange the top layer of rice so it covers the vegetables and chicken in an even flat layer. This creates a seal for the chicken with the rice, vegetables, and onions. Cover with either a heavy lid or aluminum foil (it will be extremely hot so cover carefully). Transfer the covered skillet to the oven and bake until the chicken breasts register 155℉ with an instant read thermometer and the rice is fully cooked, about 1 hour. (You will need to push the thermometer through the rice mixture to insert into the chicken.)\nSerious Eats / Kanika and Jatin Sharma\nFor serving:\nSlowly unseal the skillet or Dutch oven, from one corner first to let the steam out away from you. Let rest for 15 minutes, then, using a large spoon, transfer the cooked rice and vegetables to a large serving platter. Using tongs and a large wooden spoon or spatula, transfer the chicken to top the rice and vegetables. (Don’t worry if a leg or wing falls off—you can arrange it artfully on your platter.) Squeeze the lime all over the chicken and rice and sprinkle with the cilantro. Carve the chicken at the table and serve with the hot rice and vegetables. Serve with a side of\ncucumber raita\n, shorba gravy, or just as-is.\nSerious Eats / Kanika and Jatin Sharma\nSpecial Equipment\n14- or 16-inch cast iron skillet or large Dutch oven, spice grinder or pestle and mortar\nNotes\nJaggery\ncan be found at any local Desi food store in your area, with options of powdered or in a mound that you can shave with a sharp knife. If unavailable, you can substitute coconut sugar for the jaggery.\nIf Pequin chile peppers are unavailable, chile de árbol or Tien Tsin chiles can be substituted.\nStore the marinated chicken in a non-reactive container made of glass or ceramics, or a large plastic bag.\nMake-Ahead and Storage\nThe spice mix can be stored in an airtight container at room temperature for up to 2 weeks.\nThe caramelized onion can be prepared and refrigerated in an airtight container up to 3 days ahead.\nThe cooked potatoes tossed with the saffron yogurt can be refrigerated for up to 1 day before you assemble and cook the final dish.\nLeftovers can be refrigerated in an airtight container for up to 3 days.\nRead More\nLamb Biryani With Saffron, Yogurt, and Caramelized Onions\nVegetable Biryani Recipe\nMaqlubeh (Palestinian \"Upside Down\" Meat, Vegetables, and Rice) Recipe\nChicken Mains\nThe Latest\nRoasted Chicken\nRoasts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/biryani-style-roast-chicken.webp?"
}