{
  "url": "https://www.seriouseats.com/bistec-encebollado-puerto-rican-steak-and-onion-recipe-11717214",
  "image_url": "https://www.seriouseats.com/thmb/vmfvaKt6K8TjTaZgiP0DtBvLomA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250415-SEA-BistecEncebollado-LorenaMasso-Beauty2-34-885ac1d554ca44aabc005d4bfef2cf06.jpg",
  "tags": [
    "Steaks",
    "The Latest",
    "Recipes",
    "Puerto Rican"
  ],
  "title": "My Mom's 5-Ingredient Puerto Rican Steak Dinner Cooks in Under 15 Minutes",
  "full_text": "My Mom's 5-Ingredient Puerto Rican Steak Dinner Cooks in Under 15 Minutes\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nMarination Time:\n60 mins\nTotal\n85 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nsliced\ncube steaks\n(\n907\ng\n; about\n6 to 8\nthin\nsteaks\n, each about 1/4-inch thick) or boneless top or bottom round steaks or roast (see notes)\nKosher salt\nFreshly\nground black pepper\n1\nteaspoon\ngarlic powder\n1\nteaspoon\ndried oregano\n1/2\ncup\n(\n120\nml\n)\ndistilled white vinegar\n1\nlarge\nyellow onion\n(\n10\nounces\n;\n285\ng\n), halved and thinly sliced\n3\ntablespoons\nneutral high-smoke-point oil\n, such as canola, avocado, or grapeseed\nSteamed white rice\n,\nfo\nr\nserving\nStewed pink, pinto, or black\nbeans\nfor serving (optional)\nDirections\nIf using pre-sliced cube steak, proceed to step 2. If using top or bottom round, slice roast against the grain into six 1/2-inch-thick slices.\nSerious Eats / Lorena Masso\nLay steak slices 3 inches apart on a cutting board and cover with plastic wrap. Using a meat pounder, flatten slices to an even 1/4-inch thickness. If using pre-sliced cube beef, pound lightly just to even thickness. Season both sides of each steak with salt and pepper. Sprinkle steaks evenly with garlic powder and dried oregano and rub all over meat, then place in a large zipper-lock bag or shallow baking dish.\nSerious Eats / Lorena Masso\nPour vinegar over steaks, and use hands to toss together until well-combined.\nSerious Eats / Lorena Masso\nToss onions with steaks and their marinade until onions are well coated, then place onions on the top of steaks and seal bag or cover container tightly and refrigerate for at least 1 hour or up to 12 hours, flipping steaks at least once halfway through.\nSerious Eats / Lorena Masso\nWhen ready to cook, remove onions from marinade and set aside in a small bowl.\nSerious Eats / Lorena Masso\nIn a large stainless steel, cast iron, or carbon steel skillet, heat 1 tablespoon oil over medium-high heat until just smoking. Working in batches to prevent crowding the pan, add the steaks and cook until browned on each side, 45 to 60 seconds per side. If needed, add an additional 1 tablespoon oil to the skillet between batches. Transfer cooked steaks to a platter. Repeat with remaining steaks.\nSerious Eats / Lorena Masso\nIn now-empty skillet, heat 1 tablespoon oil over medium-high heat until shimmering, add onions and cook, stirring and scraping up all browned bits of fond, until onions are translucent and beginning to soften and edges begin to brown, 4 to 5 minutes (the onions should still have a bit of crunch).\nSerious Eats / Lorena Masso\nArrange steaks on serving platter or individual plates and top with browned onions. Serve immediately, preferably with white rice and stewed beans.\nSerious Eats / Lorena Masso\nSpecial Equipment\nLarge zipper-lock bag or shallow baking dish, large stainless steel, cast iron, or carbon steel skillet\nNotes\nI prefer using already prepped cubed steaks in this recipe. The cube steaks that I’m able to find at my local grocery store often come in family packs of 6 to 8 steaks per package, which makes it easy to put this dinner together in no time. But if pre-sliced cube steak is unavailable, I’ve included instructions for using top or bottom round steak.\nMake-Ahead and Storage\nThe steaks and onion can be marinated for up to 12 hours ahead of cooking.\nThis dish is best enjoyed right away since the thin steaks can easily overcook and become tough when overheated, but leftovers can be refrigerated for up to 4 days. Gently reheat the steak with the onions in a large skillet over medium heat until just warmed through.\nRead More\nPalomilla (Cuban Steak and Onions)\nSteaks\nThe Latest\nRecipes\nPuerto Rican",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/my-moms-5-ingredient-puerto-rican-steak-dinner-cooks-in-under-15-minutes.webp?"
}