{
  "url": "https://www.seriouseats.com/black-forest-icebox-cake-recipe-8702233",
  "image_url": "https://www.seriouseats.com/thmb/RtmOxiNkLbKapZyEF6LO109xRxM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240827-SEA-BlackForestIceboxCake-AmandaSuarezhero-1e4977b6f2804e6da03196a40bad07e2.jpg",
  "tags": [
    "The Latest",
    "Summer Desserts",
    "Chocolate",
    "Desserts",
    "Cherry"
  ],
  "title": "Black Forest Icebox Cake",
  "full_text": "Black Forest Icebox Cake\nClose\nJump to recipe\nPrep\n35 mins\nCook\n45 mins\nChilling and Freezing Time\n7 hrs\nTotal\n8 hrs 20 mins\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cherry Compote:\n1 pound (\n454\ng\n) frozen pitted sweet\ncherries\n, thawed and coarsely chopped\n1 tablespoon\ngranulated sugar\n(\n1/2\nounce\n; 15g)\n1\ntablespoon\n(15ml)\nlemon juice\nfrom 1 medium lemon\nFor the Chocolate Mousse:\n7\nounces\n(198g)\ndark chocolate\n, coarsely chopped (1 1/4 cups), between 64 and 70% cacao\n3/4\ncup\n(180ml)\nheavy cream\n3\nlarge\neggs\n(150g), separated\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nespresso\npowder (optional)\n50g\ngranulated sugar\n(\n1 3/4\nounces\n; 1/4 cup)\nFor the Whipped Cream:\n1 1/2\ncups\n(360ml)\nheavy cream\n1 1/2\ntablespoon\n(22g) superfine or\ngranulated sugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Cookie Layers:\n18\nchocolate cookies\n(about 3 3/4 ounces; 108g), homemade or store-bought, such as Goya Chocolate Maria Cookies or chocolate graham crackers\n1/4\ncup\n(60ml)\nkirsch\n(optional), see notes\nTo Serve (Optional)\nWhipped cream\nChocolate\nshavings or curls, homemade or store-bought, see notes\nFresh cherries\nDirections\nIn a medium saucepan, combine cherries, sugar, and lemon juice. Bring to a simmer over medium heat and cook, stirring occasionally, until cherries are soft and jammy, about 18 minutes.\nSerious Eats / Amanda Suarez\nIn a large bowl, set up an ice bath by filling it about halfway with a combination of cold water and ice. Transfer cherry compote to a medium bowl; place bowl on ice bath to chill until cool to the touch, about 30 minutes.\nFor the Chocolate Mousse:\nIn a large heatproof mixing bowl, combine chocolate and heavy cream. Set it over a saucepan filled with 1 inch barely simmering water and heat, stirring occasionally, until chocolate is fully melted, about 10 minutes. Whisk until homogeneous, then remove from heat and set on a heatproof work surface.\nSerious Eats / Amanda Suarez\nOnce chocolate mixture is warm to the touch, whisk in 3 egg yolks until well combined. Set aside.\nSerious Eats / Amanda Suarez\nMeanwhile, in the bowl of a stand mixer fitted with the whisk attachment, combine egg whites, salt, and espresso powder. Whisk on medium speed until egg whites begin to foam. Slowly and steadily stream in sugar. Continue to whisk until meringue is glossy and reaches medium-stiff peaks, about 8 minutes. Set aside.\nSerious Eats / Amanda Suarez\nAdd 1/4 of the meringue to the chocolate mixture and gently fold until thoroughly combined. Add remaining meringue and continue to gently fold until meringue is almost entirely incorporated, being careful not to overmix. Transfer to large bowl; set aside in refrigerator. Wash and dry mixing bowl.\nSerious Eats / Amanda Suarez\nFor the Whipped Cream:\nIn the now-clean bowl of a stand mixer fitted with the whisk attachment, combine cream, sugar, and salt. Whip on medium-high speed until medium-stiff peaks form, about 2 minutes. (Alternatively, combine cream, sugar, and salt in a large mixing bowl. Using a hand mixer fitted with the whisk attachment, beat on medium speed until medium stiff peaks form, about 3 minutes.) Set aside.\nSerious Eats / Amanda Suarez\nTo Assemble:\nLine a 9- by 4-inch loaf pan with plastic wrap. Using a flexible spatula or offset spatula, spread about 1/2 cup (75g) of chocolate mousse on the bottom. Cover surface with 1 layer of chocolate cookies; you may have to break the cookies up to get them to fit snugly. Gently press them into mousse. Using a pastry brush, brush cookies generously with 1 tablespoon (15ml) kirsch, if using. Using a flexible or offset spatula, evenly spread 1/2 cup (50g) whipped cream across crackers.\nSerious Eats / Amanda Suarez\nTop whipped cream with 2 tablespoons cherry compote, using a spoon or offset spatula to distribute them evenly across the entire layer. Repeat layering, alternating mousse, cookies, whipped cream, and cherries as needed, ending with a thin layer of chocolate mousse. Set aside remaining whipped cream for topping; transfer to an airtight container refrigerate until ready to use. (You should have about 4 chocolate cookie layers.)\nSerious Eats / Amanda Suarez\nCover tightly with plastic wrap and refrigerate until cake is cohesive and chilled, at least 6 hours and up to 24 hours.\nSerious Eats / Amanda Suarez\nLine a 9- by 13- inch rimmed baking sheet with parchment. Remove plastic from top of cake and invert cake onto rimmed baking sheet. Gently peel away remaining plastic, and transfer to freezer until firm enough to slice, about 1 hour or up to 1 week.\nSerious Eats / Amanda Suarez\nRemove cake from freezer. Hold both ends of the parchment paper and lift to transfer cake to cutting board. Wiggle a large offset spatula under the cake to separate it from the parchment paper, then gently pull to remove it. Allow cake to soften slightly at room temperature for 5 minutes. Top cake with whipped cream, chocolate curls, and fresh cherries, if desired.\nUsing a hot knife, slice cake into 8 pieces and serve. (For cleaner cuts, run knife under warm water and carefully dry knife with a clean kitchen towel before portioning each slice.) If not serving immediately, place slices on a rimmed baking sheet lined with parchment and keep frozen until ready to serve. When ready to serve, remove cake from freezer and transfer onto serving plates; allow cake to soften slightly for 10 minutes before serving.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nStand mixer or hand mixer, 9- by 4-inch loaf pan, plastic wrap, 9- by 13-inch rimmed baking sheet, parchment paper, large offset spatula, knife, Y peeler (if making chocolate curls)\nNotes\nIf you don’t have kirsch, you can brush the cookies with cognac, armagnac, calvados, rum, or bourbon. For a non-alcoholic option, you can use simple syrup instead. To make the simple syrup: In a small saucepan, whisk 1/4 cup (60ml) water and 2 tablespoons (30g) granulated sugar to combine. Bring to a simmer over medium heat and cook, whisking occasionally, until sugar is dissolved, about 4 minutes. Set aside.\nTo make chocolate curls, place one 4-ounce bar of dark chocolate on a plate and microwave on medium power until chocolate is warm to the touch (about 70ºF or 21ºC) but not melted,15 to 20 seconds. Hold chocolate over a bowl and, using a Y peeler, move quickly up and down the edge of the chocolate bar to create chocolate shavings, allowing chocolate to fall into the bowl beneath.\nMake-Ahead and Storage\nThe whole icebox cake can be frozen for up to 1 week before slicing and serving.\nSliced icebox cake can be frozen on a rimmed baking sheet lined with parchment and tightly wrapped with plastic for up to 5 days.\nThe Latest\nSummer Desserts\nChocolate\nDesserts\nCherry",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/black-forest-icebox-cake.webp?"
}