{
  "url": "https://www.seriouseats.com/black-sesame-buttermilk-biscuit-recipe",
  "image_url": "https://www.seriouseats.com/thmb/wdT86CqZFRzBvSJ2s_6vIrdXXaA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__03__20181218-kimchi-fried-chicken-sandwich-black-sesame-biscuits-vicky-wasik-15-0827d20f876a41caa69285f58341aef9.jpg",
  "tags": [
    "Breakfast & Brunch",
    "Biscuits",
    "Sesame & Tahini",
    "Easter Side Dishes",
    "Mother's Day"
  ],
  "title": "Black Sesame Buttermilk Biscuits Recipe",
  "full_text": "Black Sesame Buttermilk Biscuits Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n35 mins\nActive\n20 mins\nTotal\n50 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n18\nounces\nall-purpose flour\n, such as Gold Medal (about\n4\ncups\n, spooned;\n510\ng\n), plus more for dusting\n1\nounce\nsugar\n(about\n2\ntablespoons\n;\n30\ng\n)\n3/4\nounce\n(\n21\ng\n)\nroasted\nJapanese- or Korean-style\nblack sesame seeds\n(see note)\n2\ntablespoons\nbaking powder\n1\nteaspoon\nbaking soda\n1\ntablespoon\n(\n12\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n6\nounces\ncold\nunsalted butter\n(about\n12\ntablespoons\n;\n170\ng\n), cut into 1/2-inch cubes\n13 1/2\nounces\ncultured low-fat buttermilk\n(shy\n1 3/4\ncups\n;\n385\ng\n), straight from the fridge (see note)\nSesame oil\n, for brushing\nDirections\nAdjust oven rack to lower-middle position and preheat to 400°F (200°C). Should your kitchen be warmer than 75°F (24°C), please see our\nguide to baking in a hot kitchen\nbefore getting started; the specifics are focused on pie dough, but the overall principles hold true for baking biscuits as well.\nSift flour into medium bowl, then add sugar, black sesame seeds, baking powder, baking soda, and salt. Whisk until well combined (this may take a minute or more). Add cubed butter, toss to break up pieces, and smash each cube flat. Continue smashing and rubbing until butter has mostly disappeared into a floury mix, although a few larger, Cheerio-sized pieces may remain. (This can also be done with 4 or 5 pulses in a\nfood processor\n; just take care not to overdo it.) The prepared mix can be refrigerated up to 3 weeks in an airtight container, then used as directed below.\nAdd buttermilk and stir with flexible spatula until the flour has been fully absorbed. The dough will seem rather crumbly and dry at first, but keep mixing until it finally comes together. (Don't worry about over-mixing; until the flour has been fully incorporated, the greater concern is under-mixing.) Once dough forms a rough ball, turn it out onto lightly floured surface.\nUsing your bare hands, gently pat dough into squarish shape about 1/2 inch thick, then fold in half; repeat twice more for a total of 3 folds, using only enough flour to keep your hands from sticking. Finish by patting dough to thickness of 3/4 inch. Dust away any excess flour, if necessary, then cut dough into 3-inch rounds and arrange closely in 10-inch cast iron skillet. Gather scraps into a ball, pat and fold a single time, then cut as many more biscuits as you can. The final round of scraps can be gathered and shaped into a single biscuit by hand.\nBrush tops of biscuits with sesame oil and bake until biscuits are well risen and golden brown, about 30 minutes. Let biscuits cool about 5 minutes to help set their crumb, then serve fresh, whether alongside soups and stews or as a base for fried chicken sandwich.\nSpecial Equipment\n3-inch round cutter (or similar cutter),\n10-inch cast iron skillet\nNotes\nThis recipe works best with commercial cultured low-fat buttermilk. DIY substitutes will lend a different viscosity and pH to the dough, affecting the dough's texture along with browning and rise. For more information, please see our\nexplainer on buttermilk substitutes\n.\nThe processing methods and selection standards for Japanese and Korean brands of black sesame seeds produce the most robust flavor for this application, so avoid Western brands or unmarked bulk goods.\nMake-Ahead and Storage\nThe biscuit dough can be prepared through step 2, then stored in an airtight container in the refrigerator for up to 3 weeks. Leftover biscuits can be stored up to 1 week in an airtight container. To serve, split stale biscuits in half, brush with sesame oil, arrange on a baking sheet, and broil until golden brown.\nRead More\nLight and Fluffy Biscuits Recipe\nBreakfast & Brunch\nBiscuits\nSesame & Tahini\nEaster Side Dishes\nMother's Day"
}