{
  "url": "https://www.seriouseats.com/blackberry-ice-cream",
  "image_url": "https://www.seriouseats.com/thmb/z9ToUzLCwQGZbpdTJwSKWLj-ZCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__05__20180529-blackberry-ice-cream-vicky-wasik-17-e37248a607924807a7fba86a892f8dca.jpg",
  "tags": [
    "Ice Cream",
    "Blackberry",
    "Heavy Cream",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Blackberry Ice Cream",
  "full_text": "Blackberry Ice Cream\nClose\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nActive\n45 mins\nChurning/Freezing Time\n8 hrs 30 mins\nTotal\n9 hrs 15 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n40\nounces\nfresh blackberries\n, washed and drained (\n8\ncups\n;\n1.13\nkg\n; see note)\n5 1/4\nounces\nsugar\n(about\n3/4\ncup\n;\n148\ng\n)\n1/8\nteaspoon\n(\n0.5\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n14\nounces\nheavy cream\n(about\n1 3/4\ncups\n;\n395\ng\n)\n1/8\nteaspoon\nground cinnamon\n2\nteaspoons\nbourbon\n, rum, or gin (optional)\n1/2\nounce\nfresh lemon juice\n(\n1\ntablespoon\n;\n15\ng\n), optional\nDirections\nIn a 3-quart stainless steel saucier, combine blackberries, sugar, and salt. Using a metal spatula, crush the berries until the sugar dissolves (the spatula's comparatively sharp edge will minimize splashing compared to the dull edge of a potato masher). Using a kitchen scale, weigh the pot and fruit together, then make note of that number to track the reduction. Cook over medium heat until bubbling hot, then simmer, stirring constantly, until the mixture has reduced by 14 ounces (395g; see note). The time required will vary depending on the size, shape, and type of cooking vessel, as well as the size and output of the burner, but expect about 30 minutes, and adjust heat as needed to proceed at a similar rate. (Try not to over-reduce the fruit, as it can produce unwanted flavors, but if you do accidentally do it, you can add back just enough water to correct the weight.)\nSerious Eats / Vicky Wasik\nWhen reduced by 14 ounces, strain into a large bowl through a fine-mesh stainless steel strainer. Press and stir the blackberries with a flexible spatula to extract their juices, until there's nothing left in the sieve but about 10 ounces (1 heaping cup; 285g) seedy pulp, with 20 ounces (565g) blackberry purée in the bowl.\nSerious Eats / Vicky Wasik\nDiscard the blackberry pulp. Stir the cream, cinnamon, and alcohol (if using) into the concentrated blackberry purée, along with lemon juice (if needed) to brighten the flavor. Cover and refrigerate or place in an ice bath until no warmer than 40°F (4°C), then churn in an ice cream maker according to the manufacturer’s directions. Meanwhile, place a 1-quart container and flexible spatula in the freezer.\nSerious Eats / Vicky Wasik\nWhen ice cream looks thick and light, shut off the machine and, using the chilled spatula, scrape ice cream into the chilled container. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until firm enough to scoop, about 4 hours.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel\nsaucier\n,\nmetal spatula\n,\nflexible spatula\n, non-reactive\nfine-mesh strainer\n,\nice cream maker\n, non-reactive, freezer-safe container,\ndigital scale\nNotes\nThe flavor and color of this ice cream can vary dramatically with the quality of the fruit; if the blackberries aren't fresh and delicious to start, the ice cream will be lackluster as well.\nWe highly recommend using a digital scale to ensure the best results.\nRead More\n30-Minute Philadelphia-Style Ice Cream\nFruity No-Churn Ice Cream\nLemon Ginger Blackberry Swirl Ice Cream\nBlackberry Brown Sugar Frozen Yogurt\nAn Illustrated Tour of Ice Cream Styles Around the World\nIce Cream\nBlackberry\nHeavy Cream\nMother's Day\nFather's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/blackberry-ice-cream.webp?"
}