{
  "url": "https://www.seriouseats.com/black-sesame-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/apRK5APNxMNytY3tLYMUbgOxuRw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__10__20170522-black-sesame-ice-cream-vicky-wasik-18-585b60aac6bb4e47b7546fc4c1c958a8.jpg",
  "tags": [
    "Ice Cream",
    "Japanese",
    "Sesame & Tahini",
    "Summer Desserts"
  ],
  "title": "Black Sesame Ice Cream",
  "full_text": "Black Sesame Ice Cream\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n25 mins\nChurning/Freezing Time\n9 hrs\nTotal\n9 hrs 15 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\nturbinado\nor light brown\nsugar\n(about\n3/4\ncup\n;\n170\ng\n)\n4 1/2\nounces\negg yolk\n(about\n1/2\ncup\n;\n125\ng\n), from\n7\nlarge\neggs\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n7\nounces\nheavy cream\n(about\n3/4\ncup\nplus\n2\ntablespoons\n;\n195\ng\n)\n8\nounces\nwhole milk\n(about\n1\ncup\n;\n225\ng\n)\n6\nounces\nJapanese-style black sesame paste\n(about\n2/3\ncup\n;\n170\ng\n), such as Kuki (see note)\nDirections\nCombine turbinado or light brown sugar, egg yolks, and salt in a 3-quart stainless steel saucier, then whisk in cream and milk. Cook over medium-low heat until warm to the touch, then increase to medium and cook, stirring constantly with a flexible spatula, until mixture is steaming-hot but not bubbling, about 8 minutes or to 155°F (68°C) on a digital thermometer. Off heat, whisk in black sesame paste and strain mixture through a fine-mesh sieve into a large stainless steel bowl. For a more homogeneous color, process about 30 seconds with an immersion blender; this is strictly an aesthetic consideration.\nSerious Eats / Vicky Wasik\nFill a sink compartment or extra-large bowl with a few inches of ice water and place bowl of custard inside, stirring from time to time, until cool, about 30 minutes. Cover and refrigerate until no warmer than 40°F (4°C), about 4 hours, or hold up to 1 week.\nChurn in an ice cream machine according to the manufacturer’s directions. Meanwhile, place a 1-quart container and flexible spatula in the freezer. When ice cream is fluffy and thick, shut off the machine and scrape ice cream into chilled container, using chilled spatula. Enjoy as soft-serve or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until hard, about 4 hours.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart\nstainless steel saucier\n,\nballoon whisk\n,\nflexible spatula\n,\ndigital thermometer\n(optional),\nfine-mesh strainer\n,\nimmersion blender\n(optional),\nice cream maker\nNotes\nThe flavor and color of this ice cream hinge on high-quality Japanese-style black sesame paste, which is made from roasted, un-hulled black sesame seeds. The jet-black paste is rich, intensely nutty, and pleasantly bitter, like dark chocolate. Look for it in squeezable pouches at your local Japanese market, or shop for Kuki black sesame paste online. American brands of black sesame paste (often labeled \"black tahini\") are made from raw, un-roasted black sesame seeds, for a flavor that's too mild and astringent for ice cream.\nRead More\nNo-Bake Black Sesame and Honey Puddings Recipe\nBlack Sesame Buttermilk Biscuits Recipe\nIce Cream\nJapanese\nSesame & Tahini\nSummer Desserts"
}