{
  "url": "https://www.seriouseats.com/blackberry-cake-recipe",
  "image_url": null,
  "tags": [
    "Cakes",
    "Summer Desserts",
    "Blackberry",
    "Memorial Day",
    "Mother's Day"
  ],
  "title": "Blackberry Cake With Cream Cheese Frosting Recipe",
  "full_text": "Blackberry Cake With Cream Cheese Frosting Recipe\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n25 mins\nCooling Time\n2 hrs\nTotal\n2 hrs 50 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n7\nounces\nfresh blackberries\n(about\n1 1/4\ncups\n;\n200\ng\n), firm and tart (see note)\n4\nounces\nunsalted butter\n(about\n8\ntablespoons\n;\n110\ng\n), softened to about 60°F (16°C)\n5 1/4\nounces\nsugar\n(about\n3/4\ncup\n;\n145\ng\n)\n1 1/4\nteaspoons\nbaking powder\n, preferably not aluminum free (see note)\n1/4\nteaspoon\nbaking soda\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/8\nteaspoon\nground cinnamon\n2\nounces\negg whites\n(about\n1/4\ncup\n;\n55\ng\n), brought to about 70°F (21°C)\n5 1/2\nounces\nbleached cake flour\n(about\n1 1/4\ncups\n, spooned;\n155\ng\n), such as Swans Down, sifted (see note)\nTo Serve:\n1\nbatch\nCream Cheese Frosting\nAdditional\nblackberries\n, to garnish\nDirections\nTo Prepare:\nUsing a blender, food processor, or immersion blender, purée blackberries until totally smooth. If seeds bother you, the purée can be strained using a fine-mesh strainer; if you do plan to strain, add a couple extra blackberries to make up for the loss. Measure out exactly 6 ounces fresh blackberry purée (about 3/4 cup; 170g) and bring to about 70°F (21°C) before using.\nSerious Eats / Vicky Wasik\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). Lightly grease an 8- by 2-inch or 8- by 3-inch anodized aluminum cake pan and line with parchment (explanation and tutorial\nhere\n).\nTo Make the Cake:\nIn the bowl of a stand mixer fitted with paddle attachment (see note), combine butter, sugar, baking powder, baking soda, salt, and cinnamon. Mix on low speed to roughly incorporate, then increase to medium and beat until fluffy and light, about 5 minutes. About halfway through, pause to scrape bowl and beater with a flexible spatula. With mixer still running, add egg whites a little at a time, letting each addition fully incorporate before proceeding to the next.\nSerious Eats / Vicky Wasik\nReduce speed to low and sprinkle in about one-third of cake flour, followed by one-third of prepared blackberry purée. Repeat with remaining flour and fruit, working in thirds as before.\nSerious Eats / Vicky Wasik\nScrape bowl and beater with flexible spatula and resume mixing on medium speed for about 3 seconds to ensure everything is well combined. The batter should look bright purple and register between 65 and 68°F (18 and 20°C) on a digital thermometer. (Significant deviation indicates ingredients were too warm or too cold, which can lead to textural problems with the cake.) If the batter looks streaky or tie-dyed, gently fold with a flexible spatula until streaks disappear.\nSerious Eats / Vicky Wasik\nScrape into prepared pan, spread into an even layer, and bake until puffed and firm, about 30 minutes. Cool directly in pan for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off parchment, and place on a serving plate until fully cool, about 1 hour. Top with a batch of\ncream cheese frosting\nand a handful of fresh blackberries and cut with a chef's knife to serve.\nSpecial Equipment\nImmersion blender\n,\nblender\n, or\nfood processor\n;\nfine-mesh strainer\n(optional);\nstand mixer\n; one\n8-inch anodized aluminum cake pan\n(preferably 3 inches deep);\ndigital thermometer\n;\nwire rack\nNotes\nThis batter is formulated to the specific pH and moisture content of blackberries; it cannot be made with any other type of fruit.\nIn this recipe, aluminum-free baking powder formulations may cause discoloration in the final product.\nThe success of this recipe hinges on the unique behavior, pH, and starch content of bleached cake flour; other types of flour will produce a cake that's gummy and dense. For more information, please consult this article on\nbleached cake flour\n.\nIf using an unvarnished aluminum paddle attachment, be sure it’s meticulously clean and free from oxidized residue. If you’re not sure, wipe the paddle firmly with a damp paper towel until no trace of gray remains on the cloth, as this will cause the acidic batter to discolor in the oven. For more information, consult KitchenAid’s website.\nMake-Ahead and Storage\nWrapped in plastic, this cake will keep for up to 3 days at cool room temperature.\nRead More\nBlackberry and White Chocolate Layer Cake Recipe\nBlackberry Pistachio Icebox Cake Recipe\nA Guide to Cake Frosting\nCakes\nSummer Desserts\nBlackberry\nMemorial Day\nMother's Day"
}