{
  "url": "https://www.seriouseats.com/blue-moon-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/JDlh7YFJy11piman_rpvpCR46QA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/blue-moon-ice-cream-recipe-hero-9fd5dc4df64945f28ebfe05ce9ccb32a.jpg",
  "tags": [
    "Ice Cream",
    "Desserts",
    "Summer Desserts"
  ],
  "title": "Blue Moon Ice Cream Recipe",
  "full_text": "Blue Moon Ice Cream Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nActive\n30 mins\nChilling Time\n6 hrs\nTotal\n6 hrs 40 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\negg yolks\n(\n1\nounce\n;\n30\ng\n)\n1/2\ncup\ngranulated sugar\n(\n3.5\nounces\n;\n100\ng\n), divided\n2\ncups\n(\n475\nml\n)\nheavy cream\n1\ncup\n(\n240\nml\n)\nwhole milk\n1\ntablespoon\ninstant\nvanilla pudding mix\n(\n0.5\nounce\n;\n12\ng\n)\n1\nteaspoon\n(\n5\nml\n)\nraspberry flavoring\n1\nteaspoon\n(\n5\nml\n)\nlemon oil\n1/2\nteaspoon\nvanilla extract\nBlue gel food coloring\nDirections\nIn a medium bowl, lightly beat egg yolks with 1/4 cup of sugar and set aside.\nSerious Eats / Mariel De La Cruz\nIn a medium saucepan, whisk together cream, milk, and remaining sugar. Whisking occasionally, heat mixture over medium-low heat until bubbles begin to form along the edges of the pan, about 8 minutes. Remove from heat and add heated cream mixture to the eggs one tablespoon at a time while whisking constantly to temper the eggs.\nSerious Eats / Mariel De La Cruz\nOnce cream mixture and eggs have been combined, return to saucepan and heat on medium-low until the custard coats the back of a spoon or spatula and a line drawn with a finger leaves a distinct trail, 1 to 2 minutes. Mixture should register 170 to 175°F (77 to 79°C) on an instant-read thermometer; do not allow mixture to overheat.\nSerious Eats / Mariel De La Cruz\nPour custard into a medium bowl and whisk in vanilla pudding mix until thoroughly incorporated. Whisk in raspberry flavoring, lemon oil, and vanilla extract until combined. Whisk in blue food coloring until desired color is reached.\nSerious Eats / Mariel De La Cruz\nSet bowl over an ice bath. Let cool at room temperature for 1 hour, stirring occasionally, then cover and refrigerate for 2 more hours or up to overnight until completely chilled. Churn chilled custard according to your ice cream maker's instructions. Transfer ice cream into a bowl or container that will hold 1 quart. Cover and freeze for at least 3 hours to fully set. Serve.\nSpecial Equipment\nMedium saucepan, whisk,\ninstant-read thermometer\n, ice cream maker\nNotes\nThis ice cream has a very strong, distinct flavor profile and this recipe has them on display in full force. If you’d prefer a more subtle tasting ice cream, feel free to dial back on the flavorings to taste.\nLemon oil is the essential oil derived from the lemon itself; often it has a more concentrated, clear- or pure-tasting flavor than its extract counterparts. Lemon extracts, meanwhile, are made by extracting the flavor of the ingredient into a liquid base, typically alcohol. For this recipe, you’ll want to use lemon oil; substituting extract may lead to off flavors.\nIt is very important to use high-quality flavorings for this ice cream to yield the best-tasting end product.\nIce Cream\nDesserts\nSummer Desserts"
}