{
  "url": "https://www.seriouseats.com/bok-choy-kale-fried-rice-garlic-chinese-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Dd2sihu604cLdA38tg08MhWYZWA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__03__20140228-bok-choy-and-kale-fried-rice-with-fried-garlic-11-8fab99ef186d44cb8892952123384a73.jpg",
  "tags": [
    "Chinese",
    "Dairy-free",
    "Vegan",
    "Vegetarian",
    "Stovetop"
  ],
  "title": "Bok Choy and Kale Fried Rice With Fried Garlic Recipe",
  "full_text": "Bok Choy and Kale Fried Rice With Fried Garlic Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Fried Garlic:\n1\nwhole head\nof\ngarlic\n, peeled\nKosher salt\n1/4\ncup\nvegetable oil\nFor the Fried Rice:\n3\ncups\nday-old cooked\njasmine or short grain\nrice\n(see note)\n2\ncups chopped\nkale\n(about\n4\nounces\n)\n2\ncups chopped\nbok choy\n(about\n4\nounces\n)\n1\nThai bird's eye\nchile\n, finely minced\n1/4\nteaspoon ground\nwhite pepper\n1\nteaspoon\nsoy sauce\nDirections\nFor the Fried Garlic:\nTransfer garlic to the bowl of a food processor or mini food processor. Pulse until garlic is very finely chopped but not a paste, about 12 short pulses, scraping down sides as necessary. Set aside 2 teaspoons and toss remaining garlic with a pinch of salt in a small bowl.\nSerious Eats / Shao Z.\nSet a fine-mesh strainer over a heat-proof bowl. Heat oil in a small saucepan over medium heat until shimmering. Add garlic and cook, stirring. Garlic should maintain a gentle bubble. If bubbling vigorously, reduce heat. Cook until garlic is light golden brown, 6 to 8 minutes, then immediately strain. Transfer garlic to a paper towel-lined plate to cool.\nFor the Fried Rice:\nHeat 1 tablespoon garlic oil in a wok over high heat until smoking. Add the kale and bok choy, season with salt, and stir-fry until the vegetables are bright green and barely wilted, about 1 minute. Transfer to a bowl and set aside.\nSerious Eats / Shao Z.\nHeat 1 more tablespoon garlic oil in the wok over high heat until smoking. Add reserved raw minced garlic and bird's eye chile and cook, stirring, until fragrant, about 15 seconds. Add rice and stir immediately, breaking up any large chunks and adding remaining garlic oil as necessary to prevent sticking.\nSerious Eats / Shao Z.\nSeason rice with salt and white pepper, then add soy sauce. Return kale and bok choy to rice and toss to combine. Transfer to a warm serving bowl and sprinkle generously with fried garlic. Serve immediately.\nSpecial Equipment\nFood processor\n,\nfine-mesh strainer\n,\nwok\nNotes\nFor best results, use day-old cooked rice that has been stored in the refrigerator overnight. If cooking same day, cook the rice then spread it in an even layer on a wide plate or rimmed baking sheet. Let cool for at least 1 hour before stir-frying.\nMake-Ahead and Storage\nOnce the fried garlic has cooled completely, you can store it in an air-tight container at room temperature for up to two months. The leftover garlic oil can be stored in a sealed container in the fridge for up to two weeks.\nRead More\nWok Skills 101: Stir-Frying\nPerfect Egg Fried Rice (On Whatever Gear You Have)\nShrimp Fried Rice\nChinese\nDairy-free\nVegan\nVegetarian\nStovetop"
}