{
  "url": "https://www.seriouseats.com/bolis-de-jamaica-mexican-hibiscus-ice-pops-recipe-8681504",
  "image_url": "https://www.seriouseats.com/thmb/9Mm4HgO4_9fw77LuCIVyqWRp21Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-bolis-de-jamaica-mexican-hibiscus-ice-pops-recipe-Amanda-Suarez-hero-5e1b6844cc584ef9b1bf0d1c50b5984f.JPG",
  "tags": [
    "Mexican",
    "The Latest",
    "Summer"
  ],
  "title": "Bolis de Jamaica (Mexican Hibiscus Ice Pops)",
  "full_text": "Bolis de Jamaica (Mexican Hibiscus Ice Pops)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nCooling and Freezing Time\n4 hrs 30 mins\nTotal\n4 hrs 50 mins\nServes\n6 servings\nMakes\n6 bolis (see note)\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\nounces\n(about\n2/3\ncup\n;\n40\ng\n)\ndried flor de Jamaica\n(hibiscus), rinsed with cold water in a colander or strainer (see note)\n8\nounces\nsugar\n(\n1\ncup\nplus\n2\ntablespoons\n;\n230\ng\n)\n2\ntablespoons\n(\n30\nml\n) fresh\nkey lime juice\nfrom\n2\nlimes\nor\n1\ntablespoon\n(\n15\nml\n) fresh Persian lime juice from\n1\nlime\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt, use half as much by volume\nDirections\nIn a medium pot, combine flor de Jamaica and 1 quart (945ml) cold water. Bring to a boil over high heat, lower heat to maintain a simmer, and cook for 10 minutes. Remove from heat and let cool for at least 30 minutes and up to 1 hour.\nSerious Eats / Amanda Suarez\nStrain the flor de Jamaica liquid through a fine-mesh strainer set over a large measuring cup or a vessel with a spout (reserve flor de Jamaica for another use; see note). Whisk in sugar, lime juice, and salt until sugar and salt are completely dissolved.\nSerious Eats / Amanda Suarez\nFilling one boli bag at a time, slowly pour in flor de Jamaica mixture until it’s about one-third full (roughly 4 ounces; 115g), then pinch the top of the bag close, and tie it off with a knot (make sure to leave space between the mixture and the knot since the mixture will expand as it freezes). Repeat with remaining flor de Jamaica mixture.\nSerious Eats / Amanda Suarez\nFreeze until solid, at least 4 hours. To serve, trim one corner from the bottom of the bag and enjoy immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n3- by 10-inch bolis bags\nNotes\nThe flor de Jamaica mixture can also be frozen in popsicle molds, if preferred. To freeze in a popsicle mold, divide flor de Jamaica mixture evenly between 10 3-ounce popsicle molds. Freeze until solid, at least 4 hours. To unmold, follow your popsicle mold's instructions.\nDried flor de Jamaica can be bought at Latin grocery stores or ordered online. The dried flowers in a package of flor de Jamaica aren’t technically flowers; they're  calyces. In plants, calyces are the little petal-like projections around a fruit, like the little green crown where the tomato stem meets the tomato). I occasionally refer to them as flowers for the sake of convenience and because they’re commonly referred to that way in Spanish. The flowers are edible. After straining them out of the liquid, they can (and should) be reserved to use as a filling for tacos. Tacos de Jamaica make a surprisingly satisfying meal, especially with beans or a little chorizo. Without the chorizo, it’s a popular option among vegans and vegetarians where I live.\nMake-Ahead and Storage\nJamaica bolis can be frozen for up to 3 months.\nMexican\nThe Latest\nSummer"
}