{
  "url": "https://www.seriouseats.com/boozy-butterscotch-ice-cream-with-whiskey-recipe",
  "image_url": "https://www.seriouseats.com/thmb/hJgfzxexWl5NeRUsq0phvfoQYbg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130220-butterscotch-ice-cream-2-ae47e2ef123d4ea392d0af347be14e48.jpg",
  "tags": [
    "Ice Cream",
    "Heavy Cream"
  ],
  "title": "Boozy Butterscotch Ice Cream Recipe",
  "full_text": "Boozy Butterscotch Ice Cream Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n10 mins\nActive\n60 mins\nChill Time\n4 hrs\nTotal\n4 hrs 40 mins\nServes\n6\nto 8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nbutter\n1\ncup\nraw (\nturbinado\n)\nsugar\n(see note)\n2\ncups\ncream\n1\ncup\nmilk\n6\nlarge\negg yolks\n6\ntablespoons\nwhiskey\n(see note)\n1 1/4\nteaspoons\nkosher salt\n(to taste)\nDirections\nMelt butter in a heavy-bottomed saucepan on medium heat and cook until foaming subsides. Add sugar and stir to coat with butter, increasing heat to high. Cook, stirring occasionally, until sugar mixture begins to darken and butter smells slightly nutty, about 2 minutes. Quickly whisk in cream, taking care to watch for steam. Whisk until sugar is fully incorporated into cream and remove from heat.\nIn a medium mixing bowl, whisk together milk and egg yolks until well combined. Ladle in hot cream mixture about 1/2 cup at a time, whisking constantly, until the side of the bowl is warm to the touch, two or three times. Pour contents of mixing bowl back into saucepan, whisking constantly until egg mixture is fully incorporated.\nCook mixture on medium heat, whisking frequently, until a custard forms on the back of a spoon but a swiped finger leaves a clean line. Remove from heat and strain into an airtight container.\nStir in whiskey, then salt to taste in quarter teaspoon increments. The level of saltiness is up to you, but the hot custard should taste slightly saltier than the desired finished ice cream. Cover container and chill overnight, or at least 6 hours.\nThe next day, churn ice cream according to manufacturer's instructions. Transfer churned ice cream to airtight container and chill in freezer for at least 4 hours before serving.\nNotes\nA smooth Irish whiskey like Jameson is best for intensifying the flavor of the butterscotch. I recommend using raw sugar, often labeled as \"turbinado,\" for this recipe instead of brown. It has a delicate, less tangy flavor that makes for a more interesting butterscotch.\nSpecial Equipment\nIce cream maker\nThis Recipe Appears In\nThe Real Rules of Making Boozy Ice Cream\nIce Cream\nHeavy Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/boozy-butterscotch-ice-cream-recipe.webp?"
}