{
  "url": "https://www.seriouseats.com/borek-5185229",
  "image_url": "https://www.seriouseats.com/thmb/9S4cjUDmr0tHFqM9tCsyxnCKVjk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210511-Boreg-Andrew-Janjigian-seriouseats-25-a496890d995a4517a8fdd55b014d7b98.jpg",
  "tags": [
    "Armenian",
    "Snacks & Appetizers",
    "Savory",
    "Vegetarian Snacks & Appetizers",
    "The Latest"
  ],
  "title": "Borek (Armenian Spinach and Cheese Turnovers)",
  "full_text": "Borek (Armenian Spinach and Cheese Turnovers)\nClose\nJump to recipe\nPrep\n45 mins\nCook\n60 mins\nTotal\n105 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Herb and Cheese Filling:\n8\nounces\n(\n225\ng\n)\nGreek feta\n, crumbled\n4\nounces\n(\n115\ng\n)\nMuenster\nor\nMonterey Jack cheese\n, shredded\n2 1/2\nounces\n(\n70\ng\n)\nfresh goat cheese\n, crumbled\n1/2\ncup\nchopped\nmixed tender herbs and tender stems\n(about\n2\nounces\n;\n60\ng\n), such as dill, parsley, mint, and cilantro\n4\nscallions\n(\n2\nounces\n;\n60\ng\n), thinly sliced (\n1/2\ncup\n)\n2\nlarge\neggs\n(\n110\ng\n), lightly beaten\n1/4\nteaspoon\nfreshly\nground black pepper\nFor the Spinach, Herb, and Cheese Filling:\n10\nounces\n(\n285\ng\n)\nfrozen chopped spinach\n, thawed\n8\nounces\n(\n225\ng\n)\nGreek feta\n, crumbled\n2 1/2\nounces\n(\n70\ng\n)\nfresh goat cheese\n, crumbled\n2\nounces\n(\n1\npacked cup\n;\n60\ng\n) chopped\nmixed tender herbs and tender stems\n, such as dill, parsley, mint, and cilantro (about\n2\npacked cups\npicked herbs\nbefore chopping)\n4\nscallions\n(\n2\nounces\n;\n60\ng\n), thinly sliced (\n1/2\ncup\n)\n2\nlarge\neggs\n(\n110\ng\n), lightly beaten\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\nFor the Boreks:\n9\n(\n13- by 18-inch\n)\nsheets\nphyllo dough\n, thawed and rested at room temperature for 30 minutes\n10\ntablespoons\n(\n5\nounces\n;\n140\ng\n)\nunsalted butter\n1\ntablespoon\nhulled\nsesame seeds\n1\nteaspoon\nnigella seeds\n(optional; see notes)\nDirections\nFor the Herb and Cheese Filling:\nIn a medium bowl, combine feta, Muenster, goat cheese, herbs, scallions, eggs, and pepper, and toss gently to combine. Cover and set aside.\nAndrew Janjigian\nFor the Spinach, Herb, and Cheese Filling:\nWrap spinach in a clean kitchen towel or double layer of paper towels and squeeze to remove excess moisture (you should end up with about 6 ounces (170g) spinach). Transfer to a medium bowl, along with feta, goat cheese, herbs, scallions, eggs, salt, and pepper, and toss gently to combine. Cover and set aside.\nAndrew Janjigian\nFor the Boreks:\nAdjust oven rack to middle position and preheat oven to 350°F (190°C). Using a sharp knife, cut stack of phyllo sheets in half to form eighteen 13- by 9-inch sheets. Stack together and cover with a sheet of parchment and a clean kitchen towel.\nAndrew Janjigian\nIn a small saucepan, melt butter over medium heat and cook, swirling pan frequently and taking care not to let butter solids brown (lower heat as needed to medium-low if butter begins to pop and brown), until foaming subsides (an indication that water has been driven off), about 5 to 7 minutes. Remove from heat.\nAndrew Janjigian\nRemove one phyllo sheet from stack and transfer to clean work surface, with the long end of the sheet running parallel to edge of counter. Working lengthwise, brush half of phyllo sheet that is closest to you lightly but evenly with butter. Fold sheet in half toward you lengthwise, covering the buttered portion of dough. Rotate sheet 90 degrees so short side now faces you, and brush entire surface of sheet lightly but evenly with butter.\nAndrew Janjigian\nUsing a 1/4 cup measure, place a scant 3 tablespoons (40g) filling on the bottom left-hand corner of sheet, about one inch from the bottom edge. Using a spoon, form filling into a rough triangle with its long edge (hypotenuse) facing the bottom right edge of the phyllo. Lift the bottom right corner of the phyllo and fold it over the filling and gently press to form a right triangle. Continue folding up and over, like folding a flag, until you reach the end of phyllo strip. Using a sharp knife, trim off any overhanging phyllo. Brush top of triangle with butter and transfer to a parchment-lined rimmed baking sheet, seam side down. Sprinkle with about 1/4 teaspoon seed mixture.\nAndrew Janjigian\nRepeat borek-forming process with remaining phyllo and filling, arranging boreks in pairs with long edges facing each other, so that they form two rows of eight boreks.\nAndrew Janjigian\nBake until golden and crisp, 20 to 23 minutes, rotating baking sheet halfway through baking. Transfer baking sheet to wire rack and let boreks cool at least 5 minutes before serving. Serve.\nAndrew Janjigian\nNotes\nYou can substitute a variety of tender, fresh greens, such as spinach, watercress, arugula, Swiss chard, or beet greens, for the frozen spinach. To do so, wash 10 gently packed cups chopped mixed fresh greens and tender stems (about 15 ounces; 430g) and place in a medium microwave-safe bowl along with 1/4 cup (60ml) water. Cover and microwave on high power until greens have wilted and decreased in volume by about half, 3 to 5 minutes. Keep covered for 1 minute, then uncover and let cool slightly. Once cool enough to handle, chop fine, and squeeze dry in a clean kitchen towel. You will need 7 to 8 ounces (200-225g) cooked, drained greens for the filling; set aside any excess for another use.\nEach borek calls for about 3 tablespoons (40g) of filling. Use a spoon and a 1/4 cup measure to transfer the filling to the strip of dough.\nRewarm the butter as needed to keep it melted so it's easy to brush onto phyllo.\nYou can make 22 to 24 slightly smaller boreks with this recipe, too. Just cut the full-sized sheets of phyllo into thirds, lengthwise, to form twenty-seven 13- by 6-inch strips, and use 2 scant tablespoons of filling for each borek.\nMake-Ahead and Storage\nThe filling can be made up to 24 hours in advance and refrigerated. Stir well before using.\nUncooked boreks freeze wonderfully. Just place them in an airtight container separated by sheets of waxed paper or parchment and freeze for up to 3 weeks. Bake directly from frozen, increasing the total bake time by 5 to 10 minutes. Leftover baked boreks can be reheated on a wire rack set inside a rimmed baking sheet,in a 400˚F (200˚C) oven for 15 minutes.\nArmenian\nSnacks & Appetizers\nSavory\nVegetarian Snacks & Appetizers\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/borek-armenian-spinach-and-cheese-turnovers.webp?"
}