{
  "url": "https://www.seriouseats.com/boston-cream-pie-recipe-8629075",
  "image_url": "https://www.seriouseats.com/thmb/taXy75-Q9L2ITOk5S85r8jmLhR0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240408-SEA-BostonCreamPie-AmandaSuarez-hero-287a7bd646484451a7f3f414047973a6.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "American",
    "Desserts"
  ],
  "title": "Boston Cream Pie",
  "full_text": "Boston Cream Pie\nClose\nJump to recipe\nPrep\n50 mins\nCook\n20 mins\nCooling Time\n60 mins\nTotal\n2 hrs 10 mins\nMakes\n1 9-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n4\nlarge\neggs\n, room temperature\n300\ng (1 1/2 cups)\ngranulated sugar\n173\ng\n(1 1/2 cups)\ncake flour\n, plus more for dusting\n2\nteaspoons\nbaking powder\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3/4\ncup\n(180ml)\nhalf and half\n56\ng\n(4 tablespoons) unsalted\nbutter\n, plus more for pans\nFor the Simple Syrup:\n1/4 cup (\n50\ng\n)\ngranulated sugar\n1/4\ncup\n(60ml)\nwater\nFor the Ganache:\n227\ng\n(8 ounces; 1 1/3 cups) coarsely chopped\ndark chocolate\n, between 64 and 70% cacao\n1\ncup\n(240ml)\nheavy cream\n1\nteaspoon\nlight\ncorn syrup\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n14\ng\n(1 tablespoon) unsalted\nbutter\n, cubed, at room temperature\n1 recipe\nvanilla\npastry cream\nDirections\nAdjust rack to middle position and preheat oven to 350ºF (175ºC). Butter two 9-inch cake pans with unsalted butter, then dust with cake flour, shaking out excess.\nSerious Eats / Amanda Suarez\nIn a medium bowl, whisk together cake flour, baking powder, and salt.\nIn a small saucepan, heat half-and-half and butter over medium-low heat until butter has melted, about 3 minutes.\nIn the bowl of a stand mixer fitted with the whisk attachment, whip eggs and granulated sugar on medium-high speed until yolks are thick and pale yellow color, and doubled in volume, 5 to 7 minutes.\nSerious Eats / Amanda Suarez\nReduce mixer speed to low, and slowly pour in half-and-half mixture. Continue to whisk until combined, about 15 seconds.\nSerious Eats / Amanda Suarez\nWith the mixer on low speed, gradually add the dry mixture 1/4 cup at a time, until just incorporated, about 2 minutes. Using a flexible spatula, scrape down sides and bottom of the bowl to ensure there are no dry bits. (If any remain, use spatula to gently fold until incorporated.) Divide batter between prepared cake pans and, using an offset spatula, smooth surface. Gently tap cake pans on kitchen counter to eliminate any large air bubbles.\nSerious Eats / Amanda Suarez\nBake, rotating halfway through, until cake has risen by about 1 inch, is light golden, and springs back when gently touched, 17 to 20 minutes. Transfer pans to a wire rack and allow cakes to cool in pans for 30 minutes.\nSerious Eats / Amanda Suarez\nRun an offset spatula or butter knife around the edges of cake, then carefully invert cake onto a parchment-lined baking sheet. Let cool completely, at least 30 minutes. (Cooled cake can be lightly wrapped in plastic wrap and stored at room temperature for up to 24 hours.)\nSerious Eats / Amanda Suarez\nFor the Simple Syrup:\nIn a small saucepan, bring sugar and water to a simmer over medium heat and cook, whisking, until sugar is fully dissolved, 5 to 7 minutes.\nSerious Eats / Amanda Suarez\nFor the Chocolate Ganache:\nPlace chocolate, heavy cream, corn syrup, and salt in a medium heatproof bowl. Set over a small saucepan of gently simmering water and heat, stirring occasionally, until chocolate is fully melted, about 10 minutes. Remove from heat, stir to combine. Add butter and gently fold until ganache is smooth and shiny. Set aside until cool and slightly thickened (35ºC or 95ºF) but still fluid enough to pour, about 10 minutes.\nSerious Eats / Amanda Suarez\nTo Assemble:\nWhisk pastry cream until smooth. Place one cake on a plate. Brush cake evenly with 1 to 2 tablespoons simple syrup. Top with 2 cups pastry cream, using an offset spatula to spread it evenly from edge to edge. Top with the second cake and brush cake evenly with 1 to 2 tablespoons simple syrup, allowing the cake to absorb it. Pour slightly thickened ganache over cake and, using an offset spatula, spread evenly to cover cake, letting excess ganache drip decoratively over the sides of the cake. Serve immediately or allow ganache to cool until firm.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nTwo 9-inch cake pans\n,\nstand mixer\n,\nwire rack\n,\noffset spatula\nor butter knife,\nparchment\n, pastry brush\nNotes\nIf your chocolate has cooled too much, you can reheat it with the double boiler until you reach your desired texture. Alternatively, you can microwave it in 5 to 10 second increments until melted.\nMake-Ahead and Storage\nCooled cake rounds can be wrapped tightly in plastic wrap and held at room temperature for up to 24 hours. The assembled cake is best eaten on the day it's made.\nCakes\nThe Latest\nAmerican\nDesserts"
}