{
  "url": "https://www.seriouseats.com/boston-baked-beans-recipe",
  "image_url": null,
  "tags": [
    "New England",
    "Braised & Stewed Beans",
    "White Beans",
    "Beans Sides",
    "Fall Sides"
  ],
  "title": "Slow-Cooked Boston Baked Beans",
  "full_text": "Slow-Cooked Boston Baked Beans\nJump to recipe\nPrep\n5 mins\nCook\n5 hrs 5 mins\nActive\n60 mins\nSoaking Time\n12 hrs\nTotal\n17 hrs 10 mins\nServes\n6\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\ndried small white beans\n(about\n2\ncups\n;\n450\ng\n), such as navy beans\n1\ntablespoon\n(\n15\ng\n)\nkosher salt\nplus more to taste\nAssorted peeled, halved, and trimmed aromatic vegetables (such as\n1\nyellow onion\n,\n1\ncarrot\n, and\n2\ncloves\ngarlic\n), optional\n2\nsprigs\nof a woodsy herb (such as\nrosemary\n, sage, and/or thyme), optional\n1\nbay leaf\n1/2\ncup\n(\n120\nml\n)\ndark molasses\n(not blackstrap)\n2\nteaspoons\n(\n10\nml\n) Dijon or\nbrown mustard\n1\nteaspoon\nfreshly ground black pepper\nto taste\n1/2\npound\n(\n225\ng\n) salt pork or\nslab bacon\n, rinsed of excess salt if necessary and cut into 1/2-inch chunks (see note)\n1\nlarge\nyellow onion\n, diced (about\n8\nounces\n;\n225\ng\n)\nApple cider vinegar\n, to taste (optional)\nDirections\nIn a medium bowl, cover beans with cold water by several inches and stir in 1 tablespoon (15g) salt. Let beans soak at least 12 hours and up to 1 day. Drain and rinse.\nCombine beans with aromatic vegetables and herbs (if using) and bay leaf in a large pot and cover with water by several inches. Add a generous pinch of salt. Bring to a boil, reduce to a simmer, and cook, topping up with water as necessary, until beans are fully tender, about 45 minutes. Using tongs, discard vegetables and aromatics.\nSerious Eats / Vicky Wasik\nMeanwhile, pour molasses into a 2-cup liquid measuring cup. Add mustard, a very generous dose of freshly ground black pepper (let it rain!), and a pinch of salt.\nSerious Eats / Vicky Wasik\nDrain beans, reserving cooking liquid. Add enough bean-cooking liquid to molasses mixture to bring the volume up to 2 cups (475ml) and stir until molasses is completely dissolved. Reserve remaining bean-cooking liquid.\nPreheat oven to 325°F (165°C). In a Dutch oven, cook pork over medium-high heat, stirring occasionally, until fat is rendered and pork is beginning to lightly brown, about 4 minutes. Add onion and cook, stirring, until onion is very tender and just beginning to turn golden, about 6 minutes. Add beans to pot.\nSerious Eats / Vicky Wasik\nAdd bean water/molasses mixture and stir well to combine. Add enough reserved bean-cooking water to just barely cover beans, then stir once more, leveling out beans so that none are sticking up above the liquid level. Bring to a simmer.\nTransfer beans to oven and bake, uncovered, until beans are extremely tender but still mostly whole, with only a small fraction beginning to burst, about 4 hours. Check beans once or twice per hour during baking, adding remaining bean-cooking liquid (switching eventually to boiling water if you run out) as needed to prevent the beans on the surface from drying out. Stir beans twice during the baking process to submerge the top ones, leveling them out each time; over time, a dark, browned crust will form on the surface of the beans (this is good). The goal throughout is to keep the liquid level just high enough that the upper beans don't desiccate, but not so high that the surface doesn't brown. Stop adding liquid during the last hour of baking unless the level becomes perilously low.\nSerious Eats / Vicky Wasik\nRemove beans from oven and stir them very well. The sauce should form into a thickened, starchy glaze. If it's too dry, add boiling water sparingly until a glaze is achieved; if it's too wet, simmer briefly on the stovetop until reduced to desired consistency. Adjust seasoning with salt and pepper. If beans are too sweet for your taste, a small splash of cider vinegar can help balance the flavor.\nSerious Eats / Vicky Wasik\nKeep warm until ready to serve. Beans can be refrigerated for up to 1 week. Reheat in a saucepan, adding water gradually as needed to loosen them back up.\nSpecial Equipment\nDutch oven\n(see note)\nNotes\nYou can also bake the beans in a large baking dish, but if you do, skip the pork-and-onion-sautéing directions and the stovetop simmering directions. Instead, combine the cooked beans with all the remaining ingredients, adding enough liquid to just barely cover the beans, then bake in the oven as directed.\nRead More\nThe Serious Eats Guide to Beans\nHow to Cook Dried Beans\nThe Best Barbecue Beans Recipe\nNew Orleans–Style Red Beans and Rice Recipe\nTraditional French Cassoulet Recipe\nHardcore Feijoada Recipe\nNew England\nBraised & Stewed Beans\nWhite Beans\nBeans Sides\nFall Sides"
}