{
  "url": "https://www.seriouseats.com/bostock-recipe-11688115",
  "image_url": "https://www.seriouseats.com/thmb/nSlDRKjncvXCzqP2uYdoE5u1cmE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250226-SEA-Bostock-AmandaSuarez-Beauty1-22-e6e0217aa3c54c348faab35c82080d08.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "French"
  ],
  "title": "Bostock",
  "full_text": "Bostock\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nCooling Timer\n15 mins\nTotal\n60 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Almond Cream:\n8\nounces\nblanched or natural\nalmond flour\n(\n226\ng\n;\n2\ncups\n), see notes\n6\nounces\nunsalted butter\n, room temperature (\n170\ng\n;\n12\ntablespoons\n)\n7\nounces\ngranulated sugar\n(\n200\ng\n;\n1\ncup\n)\n1 1/2\nteaspoons\norange zest\nfrom 2 medium oranges\n1\nounce\nall-purpose flour\n(\n32\ng\n;\n1/4\ncup\n)\n2\nlarge\neggs\n, room temperature\n2\ntablespoons\n(\n30\nml\n) brandy or dark\nrum\n, optional\n1\ntablespoon\n(\n15\nml\n)\nalmond extract\n1\ntablespoon\n(\n15\nml\n)\nvanilla extract\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nTo Assemble:\nEight\n(1/2-inch thick)\nslices\nbrioche\n,\nhomemade\nor store-bought\n1/2\ncup\n(\n60\nml\n)\norange juice\nfrom 2 medium oranges\n1/4\nteaspoon\nvanilla extract\n1/2\ncup\norange marmalade\n, divided\nAlmond cream\n, see above\n2\nounces\nsliced almonds\n(57 g; 1/2 cup\nDirections\nAdjust oven rack to middle position and preheat to 350°F (175°C). Add almond flour to a parchment-lined 13- by 18-inch rimmed baking sheet and spread into a thin, even layer. Toast in oven, stirring every 3 minutes, until the almond flour is fragrant and light golden brown, about 10 minutes. Remove from oven and let cool to room temperature, about 20 minutes.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter, sugar, and orange zest, if using, on low speed to roughly incorporate. Increase to medium-high speed and beat until smooth and creamy, about 3 minutes, pausing to scrape down bowl and beater with a flexible spatula as needed. Add almond flour, all-purpose flour, egg, brandy (if using), almond extract, vanilla extract, and salt. Mix on medium-high speed until smooth, thick, and creamy, pausing to scrape down bowl and beater halfway through, about 2 minutes. Using a flexible spatula, scrape bowl and beater to ensure that no streaks of unmixed butter remain. (Almond cream can also be prepared in a large bowl with an electric hand mixer.)\nSerious Eats / Amanda Suarez\nArrange brioche slices on a 13- by 18-inch rimmed baking sheet lined with parchment. In a small bowl, whisk orange juice and vanilla extract to combine. Brush both sides of 1 slice of brioche with orange juice mixture. Using an offset spatula, spread 1 tablespoon orange marmalade evenly across brioche. Top with about 3 tablespoons almond cream, spreading evenly from side to side to cover bread. Garnish with sliced almonds. Repeat with remaining brioche slices.\nSerious Eats / Amanda Suarez\nBake until almond cream is a light golden brown and just firm to the touch, about 20 minutes. Let cool for 5 minutes. Serve warm or at room temperature and dust with confectioners’ sugar, if desired.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n13- by 18-inch rimmed\nbaking sheet\n,\nstand mixer\nor hand mixer, pastry brush, offset spatula\nNotes\nAlmond cream can be found in specialty grocery stores and online.\nBlanched almond flour is a solid beige color whereas natural almond flour appears speckled. Either variety will work well in this recipe; it all comes down to personal preference.\nMake-Ahead and Storage\nAlmond cream can be refrigerated in an airtight container for up to 1 week.\nBostock is best eaten on the day it’s made, but cooled leftovers can be stored in an airtight container at room temperature for up to 2 days. Leftover bostock may become soggy; to refresh, reheat in a 325°F (160°C) oven until warmed through.\nBreakfast & Brunch\nThe Latest\nFrench"
}