{
  "url": "https://www.seriouseats.com/bourbon-roasted-peach-cheesecake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uI61tkNGYWDkSeDA0REdsOkj9P8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__08__20120807-127677-LTE-Bourbon-Peach-Cheesecake-PRIMARY-a5d52e1f7d954b92a6995debb076f1f6.jpg",
  "tags": [
    "Cheesecakes",
    "Peach",
    "Cakes"
  ],
  "title": "Bourbon-Roasted Peach Cheesecake",
  "full_text": "Bourbon-Roasted Peach Cheesecake\nClose\nJump to recipe\nPrep\n25 mins\nCook\n2 hrs 20 mins\nActive\n60 mins\nCooling and Chilling Time\n4 hrs 40 mins\nTotal\n7 hrs 25 mins\nServes\n12\nto 14 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Bourbon Roasted Peaches:\n8\nripe but firm\nwhole\npeaches\n(about\n3\npounds\n)\n18\nounces\nunsalted butter\n, melted\n2/3\ncup\nbourbon\n1/4\nteaspoon\nsalt\n1/4\ncup packed\ndark brown sugar\nFor the Crust:\n2 1/4\ncups\ngraham cracker crumbs\n1/2\ncup\ntoasted pecans\n, finely chopped\n1\nstick\n(\n4\nounces\n)\nunsalted butter\n, melted\n1/3\ncup packed\ndark brown sugar\n1/4\nteaspoon\nsalt\nFor the Cheesecake Filling:\n4\nlarge\neggs\n, separated and at room temperature\n2\nvanilla bean\npods\n, seeds scraped out\n1/2\ncup\n(about\n3 1/2\nounces\n)\ngranulated sugar\n16\nounces\ncream cheese\n, cut into small pieces and at room temperature\n3\ntablespoons\nall-purpose flour\n1\ncup\nheavy cream\nDirections\nFor the Bourbon Roasted Peaches:\nAdjust oven racks to upper-middle and lower-middle positions and preheat oven to 450°F (230°C). Line 2 rimmed baking sheets with foil.\nSlice 4 peaches into 3/4-inch thick slices. Arrange in single layer on 1 prepared baking sheet. Cut remaining 4 peaches into 1/4-inch pieces. Arrange in single layer on second prepared baking sheet.\nWhisk together melted butter, bourbon, and salt in medium bowl. Drizzle half of bourbon mixture on sliced peaches and remaining half on diced peaches. Sprinkle 2 tablespoons sugar on sliced peaches and remaining 2 tablespoons on diced peaches. Toss peaches to coat an rearrange in single layer. Roast until peaches are tender and liquid is syrupy, about 15 minutes, alternating baking sheets’ positions halfway through. Transfer to cooling rack and cool completely, about 20 minutes.\nFor the Crust:\nDecrease oven temperature to 350°F (175°C) and adjust oven rack to middle position. Line exterior of springform pan with foil. Combine cracker crumbs, pecans, melted butter, brown sugar, and salt in medium bowl, stirring until crumbs are thoroughly saturated with butter. Press onto bottom and up sides of pan, leaving about 1/2 inch from top of pan.\nBake crust until golden, 10 to 12 minutes. Transfer to cooling rack and cool completely, 15 to 20 minutes.\nFor the Cheesecake Filling:\nDecrease oven temperature to 275°F (135°C). In a stand mixer fitted with a whisk attachment or a clean, dry bowl, whip egg whites and vanilla bean seeds on medium speed until soft peaks form, about 2 minutes. Gradually add sugar and continue whipping until stiff peaks form, 1 to 2 minutes longer. If using a stand mixer, transfer whites to separate bowl and wipe out bowl.\nBeat cream cheese, egg yolks, and flour on medium speed until light and fluffy, about 2 minutes. Add cream and continue beating until creamy and smooth, about 2 minutes longer, scraping down sides and bottom of bowl with rubber spatula as necessary. Stir in diced peaches.\nStir 1/3 of egg whites into cream cheese mixture, then, gently fold in remaining egg whites. Scrape batter into cooled crust and bake until cheesecake is set but still slightly wobbly in the center, 75 to 90 minutes. Shut oven off and let cheesecake sit in oven 20 minutes.\nTransfer cheesecake to cooling rack and cool for 1 hour. Transfer to refrigerator and cool until completely chilled and set, at least 3 hours. Remove from springfrom mold and set on serving dish. Top with sliced peaches and serve.\nSpecial Equipment\n2\nrimmed baking sheets\n, foil, parchment paper, 9-inch round\nspringform pan\n,\nstand mixer\n(optional),\nflexible spatula\n,\ncooling rack\nRead More\nClassic Biscuit-Topped Peach Cobbler Recipe\nClassic Peach Pie Recipe\nPeach Melba Recipe\nEpic New York Cheesecake From BraveTart Recipe\nCheesecakes\nPeach\nCakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bourbon-roasted-peach-cheesecake.webp?"
}