{
  "url": "https://www.seriouseats.com/bourbon-peach-jam-recipe",
  "image_url": "https://www.seriouseats.com/thmb/DjsyEfEqNkhhPFrWfFsW-SeeJkY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__07__20110724bourbonpeachjam-17c8e3b2a1434c2cbb13b9b91b48ebf0.jpg",
  "tags": [
    "Condiments & Sauces",
    "Jams & Jellies",
    "Peach"
  ],
  "title": "Bourbon Peach Jam Recipe",
  "full_text": "Bourbon Peach Jam Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n80 mins\nActive\n30 mins\nTotal\n90 mins\nServes\n48 servings\nMakes\n6 half-pints\nCook Mode\n(Keep screen awake)\nIngredients\n3 1/2\npounds\nripe\npeaches\n7 1/2\ncups\ngranulated sugar\n1/4\ncup\nfreshly squeezed lemon juice\n1/2\ncup\nbourbon\n1\ncinnamon\nstick\n1\nvanilla bean\n, split lengthwise\n1/2\nteaspoon\nunsalted butter\nOne\n(\n6\n-\nounce\n) package\nliquid pectin\n(2 foil packets)\nDirections\nIf you are going to preserve the jam, prepare the jars and lids: place 6 half-pint jars on a rack in a large pot. Add enough water to cover jars, and bring to boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.\nBring a large pot of water to a boil. Fill a large bowl with ice water. Cut a shallow X into the bottom of each peach and drop them into the boiling water. Blanch for 20 to 30 seconds, then immediately plunge peaches into ice water. Peel, pit, and chop the peaches. Transfer them to a blender and pulse just until they are coarsely puréed. You should have about 4 cups of purée.\nTransfer peaches to a large, heavy-bottomed pot. Add sugar, lemon juice, bourbon, cinnamon stick, vanilla bean, and butter. Bring to a full rolling boil over medium-high heat, stirring constantly. Add pectin and return mixture to a full rolling boil. Boil hard for 1 minute. Remove pot from heat and skim any foam from the surface with a metal spoon. Discard cinnamon stick and vanilla bean.\nLadle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of the jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 10 minutes. Turn off heat, uncover pot, and allow jars to rest in water for 5 minutes. Remove jars from pot and allow them to rest undisturbed on countertop for 6 hours or overnight. Preserved jam will keep for up to 1 year in a cool, dark place. Unpreserved jam will keep in the refrigerator for about 6 months.\nSpecial Equipment\nLarge\nheavy-bottomed pot\n; half-pint canning jars with lids and rings;\nequipment for boiling-water bath canning\nMake-Ahead and Storage\nPreserved jam will keep for up to 1 year in a cool, dark place. Unpreserved jam will keep in the refrigerator for about 6 months.\nRead More\nA Beginner's Guide to Canning\nJam Making 101: The Secrets to Getting Jam to Set Like a Pro\nFrom Jam to Jerky: Water Activity and the Science of Preservation\nRustic Apricot Jam Recipe\nCondiments & Sauces\nJams & Jellies\nPeach",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bourbon-peach-jam-recipe.webp?"
}