{
  "url": "https://www.seriouseats.com/boxty-irish-potato-pancake-recipe-11690806",
  "image_url": "https://www.seriouseats.com/thmb/Vb2G7i_pCu3nUGIfbhbUZ3k3gAA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250304-SEA-BoxtyIrishPancakes-TwoBites-Beauty2-45-a1f1bc663eed455abc42f2efeae6c8ec.jpg",
  "tags": [
    "Potatoes",
    "The Latest",
    "Stovetop",
    "Irish",
    "St. Patrick's Day"
  ],
  "title": "Boxty (Irish Potato Pancakes)",
  "full_text": "Boxty (Irish Potato Pancakes)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nTotal\n55 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nall-purpose flour\n(\n4 1/2\nounces\n;\n127\ng\n)\n2 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt use half as much by volume\n1/2\nteaspoon\nbaking soda\n1/4\nteaspoon freshly\nground black pepper\n2\npounds\n(\n907\ng)\nrusset potatoes\n(see notes), divided\n4\nscallions\n(about\n2\nounces\n;\n56\ng\n), thinly sliced, plus more for garnish\n1\nlarge\negg\n1\ncup\n(\n240\nml\n)\nbuttermilk\n(see notes)\n4 1/2\ntablespoons\n(\n63\ng\n)\nunsalted butter\n, divided\nFor Serving (Optional):\nSou\nr\ncream\nShredded\ncheddar\ncheese\nCook\ned\nbacon\nFri\ne\nd e\nggs\nDirections\nAdjust oven rack to middle position and preheat oven to 200℉ (95℃); line a baking sheet with a wire rack and set aside.\nIn a medium bowl, whisk flour, 1 teaspoon salt, baking soda, and black pepper; set aside.\nSerious Eats / Two Bites\nPeel 1 pound potatoes and cut into 1/2-inch pieces. In a medium saucepan, add potatoes, 1 teaspoon salt, and enough cold water to cover by 1-inch. Bring to a boil over high heat, then reduce heat to medium and simmer vigorously until potatoes are very tender when pierced with a knife or fork, about 15 minutes. Drain potatoes and let sit in colander in sink or over a bowl until cool enough to handle, about 10 minutes. Transfer potatoes to a large bowl and mash with a fork or potato masher until smooth and no lumps remain.\nSerious Eats / Two Bites\nWhile the boiled potatoes are cooling, peel remaining 1 pound potatoes. Center a box grater over a clean kitchen towel and shred potatoes onto kitchen towel. Gather towel edges together and carefully ring out liquid from potatoes over a sink. Then transfer shredded potatoes to large mixing bowl with mashed potatoes. Using a fork or your fingers, stir until just combined. Add scallions and egg and stir to combine, then stir in flour mixture until combined. Using a spatula, add buttermilk and gently stir until mixture resembles a thick, pancake-like batter and no dry flour streaks remain.\nSerious Eats / Two Bites\nIn a large nonstick or cast iron skillet, heat 1 1/2 tablespoons (21 g) butter over medium heat until melted and bubbling. Dollop 4 heaping 1/4-cup portions of prepared potato batter into skillet and flatten into 4-inch wide and 1/2-inch thick circles. Cook, undisturbed, until golden brown on bottom side, 4 to 6 minutes. Gently flip and cook until golden brown on second side, 4 to 6 minutes. Transfer to prepared wire rack–lined baking sheet, then place in oven to keep warm. Repeat with remaining batter, making 4 pancakes at a time for a total of 3 batches, adding 1 1/2 tablespoons butter in between each batch.\nSerious Eats / Two Bites\nWhen ready to serve, sprinkle hot potato pancakes with remaining 1/4 teaspoon salt and sprinkle with additional scallions for garnish. Serve with your preferred toppings, such as sour cream, shredded cheddar cheese, bacon, or fried eggs.\nSerious Eats / Two Bites\nSpecial Equipment\nBox grater, kitchen towel, large nonstick or cast iron skillet, wire rack, baking sheet\nNotes\nYou can make this recipe using leftover mashed potatoes instead of making fresh mashed potatoes. If using leftover mashed potatoes, start with 2 cups of cold leftover\nmashed potatoes\n. Mix in freshly grated potatoes, egg, flour mixture, and scallions. Stir in 1/2 cup (120 ml) buttermilk to start, and if needed, slowly add more in small increments, until mixture resembles a thick pancake batter.\nThe buttermilk can be replaced with 3/4 cup whole milk and 1/4 cup plain yogurt.\nMake-Ahead and Storage\nStore leftovers in an airtight container in the refrigerator for up to 3 days. To reheat, bake in a toaster oven at 400℉ until hot or reheat in a skillet with melted butter on the stovetop.\nPotatoes\nThe Latest\nStovetop\nIrish\nSt. Patrick's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/boxty-irish-potato-pancakes.webp?"
}