{
  "url": "https://www.seriouseats.com/braised-long-beans-tomato-garlic-recipe",
  "image_url": "https://www.seriouseats.com/thmb/QDntslE8VHQQfV2v9e9EDbH4DRs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__07__20150715-braised-long-beans-vicky-wasik-9-e46cc5a283f946cb979f0835f09048e2.jpg",
  "tags": [
    "Italian",
    "Dairy-free Sides",
    "Gluten-free Sides",
    "Vegan Sides",
    "Vegetarian Sides"
  ],
  "title": "Braised Long Beans With Tomatoes, Garlic, and Mint Recipe",
  "full_text": "Braised Long Beans With Tomatoes, Garlic, and Mint Recipe\nClose\nJump to recipe\nCook\n40 mins\nActive\n40 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\nextra-virgin olive oil\n3\nmedium\ncloves garlic\n, sliced\nPinch\nred pepper flakes\n1\npound\nlong beans\n, ends trimmed, beans cut into 5-inch lengths (see note)\nKosher salt and freshly ground black pepper\n1\n(28-ounce) can\nwhole tomatoes with juices\n, crushed by hand\n2\ntablespoons packed chopped\nfresh\nmint leaves\nDirections\nIn a large sauté pan, add 3 tablespoons olive oil, garlic, and red pepper flakes. Set over medium heat and cook, stirring, until garlic is lightly golden, about 4 minutes.\nAdd long beans and raise heat to high. Cook, stirring, until beans are bright green and beginning to sear, 3 to 4 minutes. Season with salt and pepper.\nAdd tomatoes to pan. Add 1/2 cup water to empty tomato can, swish it around to pick up any extra tomato juices and pulp, and add to the pan. Bring to a simmer. Lower heat to maintain simmer and cook uncovered, stirring occasionally, until beans are very tender throughout and tomato has reduced to a thick sauce, about 30 minutes. Add more water, if necessary, 1 tablespoon at a time, to prevent tomatoes from scorching during cooking. Stir in mint and remaining 3 tablespoons olive oil. Season with salt and pepper. Serve warm. Alternatively, chill in refrigerator, then serve chilled or at room temperature, or rewarm before serving.\nNotes\nYou can use regular string beans in place of long beans; if you do, omit the water and braise them just until the string beans are soft and tender, about 15 minutes.\nThis Recipe Appears In\nEasiest Summer Ever: Braised Long Beans With Tomatoes and Garlic\nItalian\nDairy-free Sides\nGluten-free Sides\nVegan Sides\nVegetarian Sides"
}