{
  "url": "https://www.seriouseats.com/braised-leeks-in-chile-sauce-recipe-8430746",
  "image_url": "https://www.seriouseats.com/thmb/-yzuSkCn_cvLPndp8HA2_p3KJZk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-BraisedLeeks-Amanda-Suarez-hero-d8514c283697450faaf6cf39bb8fed01.jpg",
  "tags": [
    "Leeks",
    "Sides",
    "The Latest",
    "Vegetarian Sides",
    "Vegetables"
  ],
  "title": "Braised Leeks With Chile Bean Sauce",
  "full_text": "Braised Leeks With Chile Bean Sauce\nClose\nJump to recipe\nPrep\n10 mins\nCook\n85 mins\nTotal\n95 mins\nServes\n4\nto 6 as a side\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Leeks:\n8\nlarge\nleeks\n(about\n10 ounces; 283 g\neach)\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n, divided\nKosher salt\n3/4\ncup\n(\n177\nml\n) water, vegetable, or\nchicken stock\nFor the Sauce and to Serve:\n2\nteaspoons\nSichuan\npeppercorns\n1/4\ncup\n(\n60\nml\n) vegetable or other neutral\noil\n2\ntablespoons\n(\n34\ng\n)\ndoubanjiang\n(Chinese fermented broad bean-chile paste; see notes)\n5\nmedium\ncloves garlic\n, minced\n1\ncup\n(\n237\nml\n)\nwater\n, vegetable, or chicken stock\n4\nteaspoons\nsugar\n1\nteaspoon\nChinese\nlight soy sauce\n2\ntablespoons\n(\n30\nml\n) Chinkiang\nvinegar\n(see notes)\n1\nteaspoon\ncornstarch\nstirred into\n1\ntablespoon\ncold\nwater\nDirections\nFor the Leeks:\nTrim leeks to remove root ends, tough or damaged outer layers, and dark green top parts; reserve trimmings for stock if desired. Cut leeks in half lengthwise, then rinse each leek half under cold, running water, gently fanning layers open while being careful to keep leek halves intact, to wash away any sand or grit. Pat dry.\nSerious Eats / Amanda Suarez\nPreheat oven to 325°F (160°C) and adjust oven rack to middle position. Heat 2 tablespoons (30ml) oil in a 12-inch heavy-bottomed skillet over medium-high heat until shimmering. Working in 2 batches, add as many leeks as you can fit in a single layer cut side down. Cook, pressing down gently with a spatula and shaking occasionally, until well browned, about 3 minutes. Transfer leeks to a 9- by 13-inch baking dish, arranging them in a single layer, cut-side up; sprinkle lightly with salt. Repeat with remaining leeks and oil until all leeks are browned, transfer to baking dish and lightly season once more with salt.\nSerious Eats / Amanda Suarez\nPour water into the skillet; bring to a simmer, scraping up any browned bits, then pour into baking dish with leeks. Cover tightly with aluminum foil and bake for 30 minutes. Remove foil and continue to cook until leeks are completely tender and translucent, about 20 to 30 minutes longer, depending on thickness of the leeks.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Sauce:\nIn a dry wok, toast sichuan peppercorns over medium heat, stirring and tossing often, until fragrant and lightly toasted, about 2 minutes. Transfer to a spice grinder or small mortar and pestle and grind to a powder. Set aside.\nSerious Eats / Amanda Suarez\nWipe out wok. Add oil along with the doubanjiang and cook over medium-high heat, stirring, until doubanjiang is toasted and fragrant, 2 to 3 minutes. Add garlic and cook, stirring, until very lightly browned, about 1 minute. Add water, sugar, soy sauce, and vinegar, and bring to a boil.\nSerious Eats / Amanda Suarez\nStir the cornstarch slurry to mix well, then pour into the wok and stir to combine. Return to a boil and cook sauce, stirring occasionally, until thickened to a lightly glaze-like consistency, 4 to 5 minutes.\nSerious Eats / Amanda Suarez\nWhen leeks are ready, ladle sauce on top of leeks, then sprinkle with a couple generous pinches of toasted Sichuan peppercorn powder. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nLarge skillet, wok, baking dish\nNotes\nDoubanjiang (Chinese fermented broad bean-chile paste) can often be found at Chinese or Asian grocery stores and online. When possible, look for Pixian doubanjiang.\nIf you can’t find Chinkiang vinegar, you can substitute with malt vinegar.\nThe omission of salt in this recipe is not an error, as both soy sauce and Doubanjiang are quite salty and obviate the need for extra salt.\nMake-Ahead and Storage\nLeftovers can be kept in an airtight container in the refrigerator for up to 4 days. Rewarm before serving.\nLeeks\nSides\nThe Latest\nVegetarian Sides\nVegetables",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/braised-leeks-with-chile-bean-sauce.webp?"
}