{
  "url": "https://www.seriouseats.com/braised-short-ribs-from-daniel",
  "image_url": "https://www.seriouseats.com/thmb/kR9WP6sLZz60XzGMH5HQvMY8KOA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__02__20140203-281931-cook-the-book-daniel-cover-bc46068dea0642d48e28339d28dc3a87.jpg",
  "tags": [
    "Beef Mains",
    "French",
    "Braised & Stewed Beef",
    "Short Ribs"
  ],
  "title": "Braised Short Ribs From 'Daniel'",
  "full_text": "Braised Short Ribs From 'Daniel'\nClose\nJump to recipe\nPrep\n45 mins\nCook\n3 hrs 30 mins\nActive\n45 mins\nTotal\n4 hrs 15 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\nred wine\n1\ncup\nruby port wine\n4\nbone-in\n2-inch-thick\nshort ribs\nSalt\nCracked\nblack pepper\nFlour\nfor dusting\n2\ntablespoons\nolive oil\n1\nmedium\nonion\n, cut into small dice\n2\ncarrots\n, cut into small dice\n1\nrib\ncelery\n, cut into small dice\n4\nlarge\nshallots\n, peeled and split\n1\nsmall\nleek\n, white and light green parts only, diced and rinsed\n1\nhead\ngarlic\n, halved\n4\nsprigs\nthyme\n1 1/2\ntablespoons\ntomato paste\n1 1/2\nquarts\nveal, beef, or\nchicken stock\nDirections\nPreheat the oven to 300 degrees. Pour the red wine and port into a large saucepan and boil until it reduces by half.\nPat the short ribs dry with paper towels, season them on all sides with salt and pepper, and dust them lightly with flour. Heat the olive oil over medium-high heat in a large heavy-bottomed Dutch oven. Sear the short ribs evenly on all sides, 3 to 4 minutes per side, until well browned (you may need to do this in batches). Remove the short ribs from the pan and set aside.\nLower the heat to medium, remove all but 2 tablespoons fat from the pan, and add the onion, carrots, celery, shallots, leek, garlic, and thyme. Cook for 5 to 7 minutes, stirring occasionally, until lightly browned. Stir in the tomato paste and continue to cook for another 2 to 3 minutes.\nAdd the reduced wine, browned ribs, and stock to the pot. Bring to a boil, cover tightly, and transfer to the oven to braise for 3 to 3 1/2 hours, or until the ribs are fork-tender.\nRemove the pot from the oven and cool at room temperature for 20 minutes. Gently scoop the ribs from the pot and pull out their bones and tendons, being careful not to shred the meat. Return the ribs to the sauce and refrigerate overnight.\nThe next day, scoop out and discard any fat that has risen to the surface of the sauce. Remove the ribs, trim any remaining cartilage, and transfer to a heatproof dish. Heat the sauce, then strain through a fine-meshed sieve into a clean saucepan. Reduce to a consistency thick enough to coat the back of a spoon and pour over the ribs. (At this point, the ribs and sauce can be reserved, refrigerated, for up to 4 days.)\nWhen ready to serve, place the covered dish in a preheated 325 degree oven and cook, occasionally basting the meat with the sauce, until heated through, about 30 minutes.\nBeef Mains\nFrench\nBraised & Stewed Beef\nShort Ribs"
}