{
  "url": "https://www.seriouseats.com/braised-leeks-with-parsley-and-lemon-recipe",
  "image_url": "https://www.seriouseats.com/thmb/3ZIWx9i47_Y8Ux38zFcVbvNWWmc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-BraisedLeeks-FredHardy-06-82bc720302ec4747b44dab42a5174f0f.JPG",
  "tags": [
    "Leeks"
  ],
  "title": "Braised Leeks With Lemon and Parsley",
  "full_text": "Braised Leeks With Lemon and Parsley\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n15 mins\nTotal\n75 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nlarge\nleeks\n(about\n10\nounces\n/\n283\ng\neach)\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, plus more for serving\nKosher salt\nand\nfreshly ground black pepper\n1/2\ncup\n(\n118\nml\n)\ndry white wine\n1\ncup\n(\n237\nml\n)\nhomemade chicken stock\nor\nlow-sodium broth\n(see note)\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, cubed\n3\ntablespoons\nchopped fresh flat-leaf parsley leaves and tender stems\n2\nteaspoons\n(\n10\nml\n)\njuice\nand\n2\nteaspoons\nzest\nfrom\n1\nlemon\nDirections\nTrim leeks to remove root ends, tough or damaged outer layers, and dark green top parts; reserve trimmings for stock if desired. Cut leeks in half lengthwise, then rinse each leek half under cold, running water, gently fanning layers open while being careful to keep leek halves intact, to wash away any sand or grit. Pat dry.\nSerious Eats / Fred Hardy\nPreheat oven to 325°F (160°C) and adjust oven rack to middle position. Heat oil in a 12-inch heavy-bottomed skillet over medium-high heat until shimmering. Working in 2 batches, add as many leeks as you can fit in a single layer cut side down. Cook, pressing down gently with a spatula and shaking occasionally, until well browned, about 3 minutes. Transfer leeks to a 9- by 13-inch baking dish, arranging them in a single layer, cut-side up. Repeat with remaining leeks until all leeks are browned.\nSerious Eats / Fred Hardy\nPour wine and chicken broth into the skillet; bring to a simmer. Sprinkle leeks all over with salt and pepper, dot with butter, and then pour hot wine and broth mixture on top. Cover tightly with aluminum foil and bake for 30 minutes. Remove foil and continue to cook until leeks are completely tender and translucent, about 20 to 30 minutes longer, depending on thickness of the leeks.\nSerious Eats / Fred Hardy\nUsing a slotted spatula, carefully transfer leeks to a serving platter. Season lightly with salt. Transfer pan juices to a small saucepan (you should have about 1/2 cup). Bring to a simmer over high heat and cook until sauce is emulsified and reduced to about 1/4 cup, 5 to 10 minutes. Stir in parsley, lemon juice, and lemon zest, and season with salt and pepper. Pour braising sauce over leeks and serve, drizzling with extra olive oil if desired.\nSerious Eats / Fred Hardy\nSpecial Equipment\n12-inch heavy-bottom skillet, 9- by 13-inch baking dish\nNotes\nBecause of the simplicity of this recipe, homemade chicken stock will give you more depth of flavor, as well as natural gelatin that will improve the body of the sauce. That said, this recipe is also delicious with good-quality, store-bought stock.\nLeeks"
}