{
  "url": "https://www.seriouseats.com/brandade-salt-cod-spread-recipe",
  "image_url": "https://www.seriouseats.com/thmb/6dMmgseQQWJx4b_yObxvnm1Xm4A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__10__20151006-brandade-salt-cod-vicky-wasik-10-ddbda4a386c849298d7cdbc2d8ccf721.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Christmas Appetizers",
    "French",
    "Cod"
  ],
  "title": "Whipped Salt Cod Spread (Brandade de Morue)",
  "full_text": "Whipped Salt Cod Spread (Brandade de Morue)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nActive\n45 mins\nSoaking Time\n24 hrs\nTotal\n25 hrs 30 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nsalt cod\n1/2\npound\nwhole russet potatoes\n(about\n2\nmedium\npotatoes\n; see note)\n5\nmedium whole\ncloves\ngarlic\n, plus\n2\noptional minced medium\ncloves\ngarlic\n, divided (see note)\n3\nsprigs\nfresh thyme\n1\nbay leaf\n1 1/4\ncups\nextra-virgin olive oil\n(or\n3/4\ncup\nif no potato)\n1/2\ncup\nhalf-and-half\n(or\n1/4\ncup\nif no potato)\nKosher salt\nand\nfreshly ground black pepper\n2\ntablespoons\nfinely chopped\nflat-leaf parsley leaves\nand tender stems (optional)\nZest of 1/2 lemon\n(optional)\nCrackers\nor\nbaguette toasts\n, for serving\nDirections\nRinse salt cod under cold running water until any salt on its surface is washed away. Transfer to a large container (cut the salt cod into smaller pieces if it doesn't fit whole) and cover with fresh water. Refrigerate for 24 hours, changing the water several times during that period.\nBake potatoes in a 350°F (175°C) oven until easily pierced with a fork, about 1 hour. Alternatively, put potatoes in a medium saucepan and cover with cold unsalted water; set over medium-high heat, bring to a simmer, and cook until easily pierced with a fork, about 45 minutes. Split potatoes lengthwise, scoop flesh from potato skins, and mash using a food mill, ricer, or potato masher. Set aside.\nSerious Eats / Vicky Wasik\nMeanwhile, drain salt cod and place in a medium saucepan. Cover with cold unsalted water and add 5 whole cloves garlic, thyme, and bay leaf. Set over medium-high heat and bring to a simmer. Cook for 10 minutes, then remove from heat and let stand in cooking liquid for 20 minutes.\nSerious Eats / Vicky Wasik\nDrain salt cod, reserving garlic; discard thyme and bay leaf. Flake salt cod, discarding any bones and silvery membranes.\nSerious Eats / Vicky Wasik\nTransfer salt cod and reserved cooked garlic to a stand mixer fitted with the paddle; add remaining 2 minced garlic cloves for a more intense garlic flavor. With the mixer running at medium-high speed, drizzle in the olive oil until fully incorporated. Then drizzle in half-and-half until fully incorporated.\nSerious Eats / Vicky Wasik\nAdd mashed potatoes and whip just long enough to fully incorporate. Season with salt and pepper, and mix in optional flavorings, like minced parsley or lemon zest, if using.\nSerious Eats / Vicky Wasik\nServe the brandade at room temperature with crackers or baguette toasts, or serve it warm and browned on top by transferring to an oven-safe baking dish or gratin dish and baking at 350°F (175°C) for 10 minutes; then broil until browned on top, about 3 minutes.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n;\nfood mill\n,\nricer\n, or\npotato masher\nNotes\nPotato is a common, but optional, ingredient in this spread. Using it creates brandade with a milder flavor and softer, creamier texture; it also yields a greater quantity of brandade by acting as a filler. If you decide to omit it in favor of a brandade with a more assertive salt-cod flavor and toothsome bite, cut the olive oil down to 3/4 cup and the half-and-half to 1/4 cup.\nThe cooked garlic adds a mellow flavor to the brandade, but you can punch it up by adding 2 minced raw cloves during the whipping step.\nRead More\nSalmon Rillettes With Chives and Shallots Recipe\nBaccalà alla Napoletana (Neapolitan-Style Braised Salt Cod with Tomatoes, Olives, and Capers) Recipe\nSalt Fish Fritters (Stamp and Go) Recipe\nHors D'Oeuvres\nChristmas Appetizers\nFrench\nCod"
}