{
  "url": "https://www.seriouseats.com/bravetart-homemade-cinnamon-rolls-recipe",
  "image_url": null,
  "tags": [
    "Pastries",
    "Breakfast & Brunch",
    "Mother's Day",
    "Rolls & Buns",
    "Easter"
  ],
  "title": "One-Bowl, Overnight Cinnamon Rolls Recipe | BraveTart",
  "full_text": "One-Bowl, Overnight Cinnamon Rolls Recipe | BraveTart\nJump to recipe\nPrep\n60 mins\nCook\n60 mins\nActive\n45 mins\nRising Time\n13 hrs 30 mins\nTotal\n15 hrs 30 mins\nServes\n12 cinnamon rolls\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Frosting:\n4\nounces\nplain, full-fat\ncream cheese\n(\n8\ntablespoons\n;\n115\ng\n), softened to about 70°F (21°C)\n2\nteaspoons\n(\n10\nml\n)\nvanilla extract\n5\nounces\npowdered sugar\n(about\n1 1/4\ncups\n;\n141\ng\n)\nFor the Filling:\n4\nounces\nunsalted butter\n(\n8\ntablespoons\n;\n115\ng\n), creamy and soft, about 70°F (21°C)\n6\nounces\nlight brown sugar\n(\n3/4\ncup\n, gently packed;\n170\ng\n)\n1/2\nounce\nground cinnamon\n(about\n2\ntablespoons\n;\n15\ng\n)\n1/2\nteaspoon\n(\n1\ng\n)\ngrated nutmeg\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n4\nounces\ntoasted pecan halves\n, roughly chopped (a shy\ncup\n;\n115\ng\n), or more to taste\nFor the Dough:\n16\nounces\nall-purpose flour\n(about\n3 1/2\ncups\n, spooned;\n450\ng\n), such as Gold Medal, plus more for rolling\n3 1/2\nounces\ngranulated sugar\n(about\n1/2\ncup\n;\n100\ng\n)\n2\nteaspoons\n(\n8\ng\n)\ninstant yeast\n, such as SAF (not rapid-rise; see notes)\n1 3/4\nteaspoons\n(\n7\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\n(\n1\ng\n)\nbaking soda\n4\nounces\nunsalted butter\n(\n8\ntablespoons\n;\n115\ng\n)\n4\nounces\nmilk\n(\n8\ntablespoons\n;\n115\ng\n), any percentage will do\n8\nounces\nplain, unsweetened Greek yogurt\n(about\n1\ncup\n;\n225\ng\n), any percentage will do\nDirections\nFor the Frosting:\nCombine cream cheese and vanilla with half the powdered sugar in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then sprinkle in the rest of the sugar a little at a time. Once it is incorporated, increase to medium and beat until creamy and pale ivory, about 5 minutes. Transfer to a zip-top bag or disposable pastry bag and set aside until needed, up to 24 hours at room temperature. (If your kitchen is chilly and the frosting hardens in that time, briefly microwave the bag to restore its creamy texture before use.)\nSerious Eats / Julia Estrada\nFor the Filling:\nPrepare filling with the same bowl and beater, mixing butter, brown sugar, cinnamon, nutmeg, and salt on low speed until moistened. Increase to medium and beat the dark paste until creamy, light in color, and very soft, about 5 minutes. Transfer to a zip-top bag or disposable pastry bag and set aside until needed, up to 24 hours at room temperature. Reserve the pecans until it's time to fill and shape the rolls.\nSerious Eats / Julia Estrada\nFor the Dough:\nWipe the bowl with a paper towel, then whisk together flour, sugar, yeast, salt, and baking soda until thoroughly combined. Melt butter in a 2-quart saucier over low heat, then stir in milk and yogurt, warming to about 80°F (27°C). Add to flour and stir to form a very dry and shaggy dough. With the hook attachment, knead on low until silky-smooth and elastic, able to be gently stretched into a thin but rough sheet without tearing, about 20 minutes.\nSerious Eats / Julia Estrada\nFirst Rise:\nCover bowl with plastic and set dough to rise until puffy, light, and doubled in bulk, about 90 minutes at roughly 70°F (21°C). If the dough feels dense, firm, or overly resilient, rest 15 minutes before testing again (this is more likely in chilly months).\nSerious Eats / Julia Estrada\nShaping:\nTurn dough onto a lightly floured surface, dust with flour, and roll into a 13-inch square. Snip a corner from the bag of cinnamon filling, squeeze over the dough, and spread into an even layer with an offset spatula. Sprinkle pecans on top and roll to form a 12-inch log, ending seam side down.\nSerious Eats / Julia Estrada\nSlide an 8-inch strand of thread, unflavored dental floss, or butcher's twine under the dough until you reach the middle. Cross the ends over the top and pull tight to divide the log in two. Cut each half into six 1-inch slices and arrange in a parchment-lined 9- by 13- by 2-inch aluminum baking pan (or two 8-inch by 3-inch round cake pans).\nSerious Eats / Julia Estrada\nSecond Rise:\nCover rolls with foil and refrigerate overnight, or up to 48 hours. Adjust oven rack to middle position and preheat to 350°F (180°C); meanwhile, let cinnamon rolls stand at room temperature until oven is hot.\nSerious Eats / Julia Estrada\nTo Bake and Serve:\nBake, covered, until cinnamon rolls are puffed and firm but pale, about 45 minutes. (If using darker pans, check on the cinnamon rolls after 30 minutes.) Remove the foil and continue baking until lightly browned, about 15 minutes more. Snip a corner from the bag of frosting, squeeze over the cinnamon rolls, and spread into an even layer with the back of a spoon. Serve immediately, and leave no survivors; life’s too short for day-old cinnamon rolls.\nSerious Eats / Julia Estrada\nSpecial Equipment\nStand mixer\n,\n2-quart saucier\n,\nflexible spatula\n,\ndigital thermometer\n,\noffset spatula\n, unflavored dental floss or butcher’s twine,\n9- by 13- by 2-inch anodized aluminum baking pan\nor\ntwo 8-inch anodized aluminum cake pans\n(preferably 3 inches deep)\nNotes\nInstant yeast doesn't require hydration prior to use and is suitable for cold fermentation, making it distinct from both active dry and rapid-rise yeast. My favorite brand is SAF, which is higher-quality than anything found in supermarkets, and dramatically cheaper, too.\nPastries\nBreakfast & Brunch\nMother's Day\nRolls & Buns\nEaster"
}