{
  "url": "https://www.seriouseats.com/bravetart-homemade-oreo-style-cookies-recipe",
  "image_url": null,
  "tags": [
    "Cookies",
    "Christmas Cookies"
  ],
  "title": "Homemade Oreo Cookies Recipe | BraveTart",
  "full_text": "Homemade Oreo Cookies Recipe | BraveTart\nJump to recipe\nPrep\n50 mins\nCook\n25 mins\nActive\n60 mins\nCooling Time\n30 mins\nTotal\n105 mins\nServes\n45 sandwich cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chocolate Wafers:\n4\nounces\nunsalted butter\n(about\n8\ntablespoons\n;\n115\ng\n), creamy and soft, about 68°F (20°C)\n3 1/2\nounces\nsugar\n(about\n1/2\ncup\n;\n100\ng\n)\n2\nounces\ngolden syrup\n(about\n3\ntablespoons\n;\n55\ng\n), such as Lyle’s\n1/2\nteaspoon\nbaking soda\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal kosher\nsalt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\ncoconut extract\n(optional)\n5 3/4\nounces\nbleached all-purpose flour\n(about\n1 1/4\ncups\n, spooned;\n165\ng\n), such as Gold Medal\n1 1/4\nounces\nDutch-process cocoa powder\n(about\n1/3\ncup\nplus\n1\ntablespoon\n;\n35\ng\n), such as Cacao Barry Extra Brute, plus more for dusting\nFor the Filling:\n6\nounces\nunsalted butter\n(about\n12\ntablespoons\n;\n170\ng\n)\n1\nteaspoon\nvanilla extract\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n8 1/2\nounces\npowdered sugar\n(about\n2\ncups\nplus\n1\ntablespoon\n;\n240\ng\n)\nDirections\nFor the Chocolate Wafer Dough:\nCombine butter, sugar, golden syrup, baking soda, salt, and coconut extract (if using) in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed to moisten, then increase to medium and beat until fluffy and light, about 5 minutes, pausing to scrape bowl and beater about halfway through.\nSerious Eats / Vicky Wasik\nSift flour and cocoa together. (If using cup measures, spoon into the cups and level with a knife before sifting.) With mixer running on low speed, sprinkle flour/cocoa mixture into butter mixture. It will seem dry and mealy at first, but continue mixing to form a smooth dough. Knead against sides of bowl to form a smooth ball, then divide in half and flatten into disks. Use immediately or wrap in plastic and refrigerate up to 1 week; soften cold dough 30 minutes at room temperature, then knead on a bare surface until pliable and smooth.\nSerious Eats / Vicky Wasik\nFor the Wafers:\nAdjust oven rack to middle position and preheat to 350°F (180°C). On a cocoa-dusted surface, roll a portion of dough into a 7-inch square. Sprinkle both sides with cocoa and roll until 1/4 inch thick; generously dust with cocoa and continue rolling to 1/8 inch (see note). Alternatively, roll dough to 1/8 inch using an embossed pin. Slide an offset spatula under dough to loosen, brush away excess cocoa, and stamp into 1 1/2–inch rounds.\nSerious Eats / Vicky Wasik\nArrange on a parchment-lined aluminum baking sheet, leaving 1/4 inch between wafers. Gather scraps, knead, re-roll, and cut as before. Repeat with remaining dough as well. Any remaining scraps can be discarded or baked to grind for crumbs. Bake until wafers are firm and dry, about 15 minutes, and cool to room temperature on the baking sheet. Fill immediately or store in an airtight container up to 1 week at room temperature.\nSerious Eats / Vicky Wasik\nFor the Filling:\nBefore making the filling, flip half the chocolate wafers upside down so they can be filled immediately after preparing the filling, as it will quickly set.\nIn a 2-quart stainless steel saucier, completely melt butter over medium-low heat. Simmer, stirring with a heat-resistant spatula, while butter hisses and pops; if you notice brown bits forming along the edges, reduce heat to low. Continue cooking and stirring until butter falls silent, then strain into the bowl of a stand mixer fitted with a paddle attachment.\nSerious Eats / Vicky Wasik\nAdd vanilla and salt, followed by powdered sugar. Mix on low to moisten, then increase to medium and beat until creamy and soft, about 5 minutes. Transfer to a heavy-duty pastry bag fitted with a 1/2-inch tip and use immediately; this filling cannot be made in advance.\nSerious Eats / Vicky Wasik\nTo Sandwich the Wafers:\nPipe a generous dollop of filling in the center of each upturned wafer (just shy of 1 tablespoon, or a little more than 1/4 ounce). Sandwich with remaining halves, transfer to an airtight container, and stand at room temperature until filling has set, about 30 minutes. The cookies will keep for up to 1 week at room temperature, up to a month in the fridge, or 3 months if frozen; serve at room temperature.\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n,\nrolling pin\n, embossed rolling pin (optional),\noffset spatula\n, 1 1/2-inch round cookie cutter,\nhalf sheet pans\n, 2-quart\nstainless steel saucier\n,\nfine-mesh strainer\n,\nlarge pastry bag\n, 1/2-inch round tip\nNotes\nThe yield of this recipe depends on rolling the dough to 1/8 inch; slightly thicker wafers will taste just fine, but will make fewer, less delicate cookies.\nRead More\nHow Oreos Got Their Name: The Rise of an American Icon\nOreo Cake With Oreo Whipped Cream Frosting Recipe\nOreo Ice Cream Recipe\nMint Oreo Ice Cream Recipe\nCookies\nChristmas Cookies"
}