{
  "url": "https://www.seriouseats.com/bravetart-sweetened-condensed-milk-recipe",
  "image_url": null,
  "tags": [
    "Condiments & Sauces",
    "Gluten-free",
    "Stovetop",
    "Dairy Milk"
  ],
  "title": "Sweetened Condensed Milk",
  "full_text": "Sweetened Condensed Milk\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nActive\n45 mins\nTotal\n45 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n32\nounces\nmilk\n,\nany percentage will do\n(\n4\ncups\n;\n910\ng\n)\n6\nounces\nheavy cream\n(\n3/4\ncup\n;\n170\ng\n)\n7\nounces\nplain or\ntoasted\nsugar\n(\n1\ncup\n;\n195\ng\n)\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\nAromatics such as a vanilla bean, split lengthways, or\ncinnamon stick\n(optional)\nDirections\nCombine milk, cream, sugar, salt, and vanilla bean or cinnamon (if using) in a 5-quart stainless steel saucier. If you have a scale, weigh the pot and ingredients together so you can digitally track the reduction. Place over medium heat, stirring occasionally with a heat-resistant spatula, until the milk begins to simmer, about 12 minutes.\nContinue simmering an additional 30 minutes, scraping continuously to prevent a milky buildup from forming around the sides. When the thickened milk syrup suddenly turns foamy, it’s almost done. Keep cooking and stirring until the foam subsides and the dairy has condensed to exactly 2 cups or 19 ounces. If using a scale, the pot will weigh 26 ounces less than when you started.\nTroubleshooting:\nShould the dairy reduce too far, top it off with enough milk to reach 2 cups or 19 ounces, then remove aromatics and blitz with an\nimmersion blender\nto emulsify.\nPour into an airtight container, seal to prevent evaporation, and refrigerate until needed, up to 1 month. To mimic the consistency of canned milk, bring to room temperature before use.\nSpecial Equipment\nStainless steel Dutch oven,\nheat-resistant spatula\nNotes\nThe timing of this recipe may vary considerably depending on the heat output of your stove and the size, shape, and gauge of your cookware. If it takes considerably longer than 12 minutes to bring the dairy to a simmer, increase the heat to medium-high in order to reduce the dairy within the allotted time. Conversely, should the milk begin to simmer much faster, reduce the heat to medium-low to cook at a more gentle pace.\nMake-Ahead and Storage\nHomemade sweetened condensed milk can be stored in an airtight container in the refrigerator for up to one month.\nCondiments & Sauces\nGluten-free\nStovetop\nDairy Milk"
}