{
  "url": "https://www.seriouseats.com/bravetart-homemade-animal-crackers-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0q21nOeXMJQjlYtpC7PZS_NV1jY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111227rhino610-2c59cbe7b3d94c7691b0bd5c5d0b0e57.jpg",
  "tags": [
    "Cookies",
    "American"
  ],
  "title": "Homemade Animal Crackers Recipe",
  "full_text": "Homemade Animal Crackers Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n30 mins\nChilling and Cooling Time\n3 hrs 15 mins\nTotal\n3 hrs 45 mins\nMakes\n30 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nflour\n3\nounces\nunsalted butter\n, room temperature\n4\nounces\nsugar\n1/4\nounce\npowdered milk\n1/4\nteaspoon\nnutmeg\n1/4\nteaspoon\nsalt\n1/8\nteaspoon\nbaking soda\n1/2\nounce\nvanilla extract\n1 1/2\nounces\negg whites\nExtra\nflour\nfor dusting\nDirections\nMake the Cookie Dough:\nUse a fine-mesh strainer to sift flour. Set aside.\nUsing a hand or stand mixer (fitted with a paddle attachment) cream together the butter and sugar, along with the powdered milk, nutmeg, salt and baking soda, on medium speed. Not until light and fluffy, but only until well combined. About a minute. Scrape the bowl down with a flexible spatula and cream a minute more.\nSet the mixer to low. Drizzle in the vanilla. With the mixer still running, add half the flour and mix until just incorporated. Then add half the egg whites. Repeat with the remaining flour and egg whites. Mix until homogenous, then shut off the mixer.\nUse a spatula to scrape the cookie dough onto a large sheet of plastic wrap. Wrap the dough and refrigerate for at least 3 hours, or overnight, before rolling.\nCut and Bake the Cookies:\nPreheat the oven to 350°F (175°C) and have 2 parchment-lined baking sheets standing by.\nOn a well-floured surface, roll the cookies to just a little over 1/4-inch thickness (3/8-inch if you like to be precise). Run a metal spatula between the dough and the rolling surface, to ensure the dough isn't sticking in any places. Cut the dough with your desired cutters and transfer the cut-outs to the cookie sheet. They won't spread significantly in the oven, so they can be placed fairly close together.\nIf you like, dock the cookies twice with the tip of a clicky pen (clicked to the retracted position) to mimic the large, deep dock marks on the originals.\nYou can gather, knead and re-roll the scraps three times; the dough is very forgiving.\nBake the cookies for approximately 12 minutes, or until quite firm to the touch and just beginning to brown. Cool thoroughly.\nSpecial Equipment\nKitchen scale\n,\nfine-mesh strainer\n,\nhand mixer\nor\nstand mixer\n,\nflexible spatula\n,\nrolling pin\n,\nmetal spatula\n, animal-shaped cookie cutters, two\nrimmed baking sheets\n, parchment paper\nMake-Ahead and Storage\nThe crackers can be stored in an airtight container at room temperature for up to a month.\nRead More\nDIY Oyster Crackers\nE.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies\nHomemade Carr's-Style Whole Wheat Crackers\nCookies\nAmerican",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-animal-crackers-recipe.webp?"
}