{
  "url": "https://www.seriouseats.com/bravetart-chocolate-chip-cookies-recipe",
  "image_url": null,
  "tags": [
    "Cookies",
    "Chocolate",
    "Christmas Cookies"
  ],
  "title": "Quick and Easy Chocolate Chip Cookies | BraveTart",
  "full_text": "Quick and Easy Chocolate Chip Cookies | BraveTart\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n30 mins\nTotal\n45 mins\nServes\n32 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n14\nounces\nassorted\ndark\n, milk, or white\nchocolate\n(not commercial chips), roughly chopped (\n2 1/2\ncups\n;\n395\ng\n)\n12 1/2\nounces\nall purpose flour\n(\n2 3/4\ncups\n, spooned;\n355\ng\n), such as Gold Medal\n8\nounces\nunsalted butter\n(\n2\nsticks\n;\n225\ng\n), soft but cool, about 65°F (18°C)\n7 1/4\nounces\nwhite sugar\n(\n1\ncup\n;\n205\ng\n)\n8\nounces\nlight brown sugar\n(\n1\ncup\n, gently packed;\n225\ng\n)\n1/2\nounce\nvanilla extract\n(\n1\ntablespoon\n;\n15\ng\n)\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n, plus more for sprinkling; for table salt, use about half as much by volume or the same weight\n1\nteaspoon\nbaking soda\n1/2\nteaspoon\nbaking powder\n1/8\nteaspoon\ngrated\nnutmeg\n1\nlarge\negg\n(about\n1 3/4\nounces\n;\n50\ng\n), straight from the fridge\nDirections\nMake the Dough:\nAdjust oven rack to middle position and preheat to 350°F (180°C). Set aside a handful of chopped chocolate (about 2 ounces; 55g) and place the remainder in a medium bowl. Sift flour on top and toss together. Combine butter, white sugar, brown sugar, vanilla, salt, baking soda, baking powder, and nutmeg in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase to medium and beat until light and fluffy, about 5 minutes. With mixer running, add egg and continue beating only until smooth. Reduce speed to low, add flour/chocolate all at once, and mix to form a stiff dough.\nSerious Eats / Vicky Wasik\nPortion the Dough:\nDivide in 2-tablespoon portions (about 1 1/2 ounces or 40g each) and round each one into a smooth ball. (If you like, portioned dough can be refrigerated in a heavy-duty zipper-lock bag up to 1 week, or frozen 6 months. Stand at room temperature until quite soft, about 70°F or 21°C, and proceed as directed.)\nSerious Eats / Vicky Wasik\nTo Bake:\nArrange portions on a parchment-lined half sheet pan, leaving 2 inches between cookies to account for spread. Garnish each with reserved chocolate and a pinch of kosher salt. Bake until puffed and pale gold around the edges but steamy in the middle, about 15 minutes. For crunchy cookies, continue baking until golden, 3 to 5 minutes more. Cool directly on baking sheet until crumb is set, about 5 minutes. Enjoy warm or store in an airtight container up to 2 days at room temperature.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n, 2-tablespoon portion scoop (optional),\nrimmed baking sheets\nNotes\nWith kitchen temperatures above 74°F (23°C), start by refrigerating the mixing bowl and dry ingredients until cooled to 70°F (21°C). At elevated temperatures, these ingredients and equipment can act as a heat source to the butter, warming the dough and causing excessive spread in the oven.\nMake-Ahead and Storage\nThe portioned dough can be refrigerated in a heavy-duty zipper-lock bag up to 1 week, or frozen 6 months. Stand at room temperature until quite soft, about 70°F or 21°C, and proceed as directed. Though these chocolate chip cookies are best enjoyed warm, they can be kept for up to 2 days in an airtight container at room temperature.\nRead More\nThe Food Lab's Chocolate Chip Cookies\nCocoa Butter Cookies With Chocolate Chips\nLevain Bakery-Style Super-Thick Chocolate Chip Cookies\nTate's-Style Thin and Crispy Chocolate Chip Cookies\nThe Best Chocolate for Baking\nCookies\nChocolate\nChristmas Cookies"
}