{
  "url": "https://www.seriouseats.com/bravetart-crispy-cereal-marshmallows-homemade-lucky-charms-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uXgpib5_WAh1w-y6FQKUUop6KMU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__10__20111002charmsbowl610-d27e6b4949f84addb319a4bbe6c0ea6a.jpg",
  "tags": [
    "Breakfast & Brunch",
    "Gluten-free Breakfast & Brunch"
  ],
  "title": "Crispy Cereal Marshmallows Recipe",
  "full_text": "Crispy Cereal Marshmallows Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n40 mins\nServes\n4\nto 8 servings\nMakes\n100\nto 200 tiny marshmallows\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\nounce\ngelatin\n12\nounces\ncold\nwater\n1\nounce\nrolled or\nsteel cut oats\n(omit for gluten free)\n1\nTahitian vanilla\nbean\n, split and scraped, seeds reserved\n6\nounces\nhomemade\ncorn simple syrup\n, (see recipe below) preferably made a day or two in advance\n15\nounces\nsugar\n1/4\nteaspoon\nsalt\n2\nteaspoons\nvanilla extract\n1/8\nteaspoon\norange flower water\n1/16\nteaspoon\nalmond extract\n(about 2 drops)\nOptional:\nfood coloring\nFor the Corn Simple Syrup:\n14\nounces\ncorn cobs\n(from about\n4\nears\n), sliced into 1-inch thick rounds\n42\nounces\nwater\n, preferably filtered\n1\nvanilla bean\n, split and scraped\n36\nounces\nsugar\n2\nteaspoons\nsalt\nDirections\nFor the Corn Simple Syrup\n: In a medium pot, combine sliced corn cobs and water. Bring the water to a boil, then reduce heat to medium and simmer gently until water has reduced by half; about 30 minutes. Use a pair of tongs to fish out the corn cob pieces; discard. Add vanilla bean and seed scrapings, sugar, and salt. Stir constantly until sugar dissolves. Simmer for 20 minutes, or until the mixture has taken on a thick, syrupy consistency. Cool. Store indefinitely in the fridge along with the vanilla bean.\nFor the Marshmallow Base:\nHave one lightly greased cookie sheet standing at the ready. Add 4 ounces water to bottom of bowl of stand mixer and sprinkle with gelatin. Set aside. In a medium pot, combine the remaining water, vanilla bean pod, and oats. Bring to a simmer over medium heat, then turn heat to medium-low and simmer gently for about 10 minutes. Shut off the heat. Set a fine-meshed sieve over a small bowl and carefully drain the oatmeal from the water. Press the oatmeal with a rubber spatula to release as much oat water as possible; you should have about 8 ounces. If you do not, add enough fresh water to equal 8 ounces. Discard the solids (or enjoy for breakfast?) and return the vanilla oat water to the pot.\nAdd reserved vanilla bean seeds, corn syrup, sugar, and salt to oat water. Set over medium heat and stir gently until the sugar dissolves and the mixture starts to simmer. Keep cooking, undisturbed, until the mixture reaches 240°F (116°C) on a candy thermometer. You may notice the mixture beginning to crystallize a little around the edges, but that is a good thing. When the mixture reaches 240°F, shut off the heat and let it stand until it cools to 210°F (99°C). Transfer to bowl with gelatin (mixture may crystallize). Fit the bowl with the whisk attachment and whip on medium-high speed until the mixture has nearly doubled in volume and cooled. While mixing, add vanilla extract, orange flower water, and almond extract.\nOnce mixture has doubled and cooled, shut off the mixer. If you're just making white marshmallows, use a lightly greased rubber spatula to transfer the mixture to the cookie sheet, spreading it out to about 1/4-inch thickness. Alternatively, if you'd like to make different color marshmallows, divide the mixture into as many bowls as you'd like colors. Add a few drops of food coloring to each and stir with a spatula until the color has incorporated. Spread each portion across a separate patch of the cookie sheet.\nSet the tray of marshmallows in a dry, well ventilated location where you feel safe leaving them, uncovered, for 24 hours.\nAfter the marshmallows have dried, peel the big sheet of marshmallows up from the cookie sheet. You will notice the bottom of the marshmallow sheet is slightly damp, while the top is crusty. Transfer to a cutting board, placing it crusty side down, and use a tiny cookie cutter to stamp the marshmallows into shapes, or use a knife to cut them into tiny squares or diamonds. Transfer the marshmallow cutouts to a parchment-lined cookie sheet, damp side up. Allow them to dry for another 24 hours, or until they have become crunchy. The exact length of time it takes depends on kitchen humidity. Store the marshmallows in an airtight container, at room temperature for up to 2 weeks. Alternately, freeze or refrigerate indefinitely.\nSpecial Equipment\nLeave-in probe thermometer\nor candy thermometer,\nstand mixer\nNotes\nAll measurements are in weights, as volume measures can be very imprecise. I strongly recommend using a scale for all pastry projects. For purchasing options, see our\nkitchen scale recommendations\n.\nRead More\nClassic Marshmallows, and Some Variations\nChocolate-Coated Caramel Honeycomb With Salted Peanuts\nOur Favorite Breakfast Cereals\nBreakfast & Brunch\nGluten-free Breakfast & Brunch",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crispy-cereal-marshmallows-recipe.webp?"
}