{
  "url": "https://www.seriouseats.com/brazo-de-mercedes-filipino-meringue-custard-roll-recipe-8557314",
  "image_url": "https://www.seriouseats.com/thmb/75l3kiixLd3GS5ihEaCWPSYNGBw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2024020120240129-brazo-de-mercedes-rezel-kealoha-51-SEA-66741383db5d46469525c14b270778ec.jpg",
  "tags": [
    "Southeast Asian",
    "The Latest",
    "Filipino",
    "Eggs",
    "Desserts"
  ],
  "title": "Brazo de Mercedes (Filipino Meringue Roll)",
  "full_text": "Brazo de Mercedes (Filipino Meringue Roll)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n35 mins\nCooling Time\n105 mins\nTotal\n3 hrs 20 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Custard:\n1/2\ncup\n(\n64\ng\n) roasted\ncashews\n1\ntablespoon\n(\n15\ng\n)\nsugar\n12\nlarge\negg yolks\nOne\n14-ounce\n(\n397\ng\n) can\nsweetened condensed milk\n1/2\ncup\n(\n118\nml\n)\nheavy cream\n4\nteaspoons\nfinely\ngrated lemon zest\n1\nteaspoon\n(\n5\nml)\nvanilla extract\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Meringue:\n1\ncup\n(\n200\ng\n)\nsugar\n12\nlarge\negg whites\n1\nteaspoon\ncream of tartar\nBaking\nspray\n(see notes)\n2\ntablespoons\nconfectioners sugar\nDirections\nFor the Custard:\nIn a food processor, pulse cashews with the sugar, scraping down as needed, until cashews are finely ground, about 6 pulses. Reserve 1/4 cup ground cashews and save remaining ground cashews for another use. Wash and dry food processor bowl and blade, then set aside.\nSerious Eats / Rezel Kealoha\nFill a large bowl halfway with an ice bath; set aside. In a 3- or 4-quart saucepan, whisk egg yolks and condensed milk until combined. Whisk in heavy cream, lemon zest, vanilla, salt, and reserved 1/4 cup ground cashews until well combined. Cook over medium-high heat, whisking constantly, until custard thickens, 5 to 7 minutes. Transfer custard to a heat-proof bowl and place plastic wrap directly on its surface to prevent skin from forming. Nestle bowl of custard into ice bath to chill.\nSerious Eats / Rezel Kealoha\nFor the Meringue:\nAdjust oven rack to middle position and preheat oven to 350℉ (175℃). Spread superfine sugar evenly into a 10-inch oven-safe skillet and bake until sugar has a strong caramel aroma and is light beige in color, 15 to 30 minutes. (Read about this\nquick-toasted sugar method\nfor more tips and pointers on the process.) Scrape sugar onto a rimmed baking sheet and let cool completely, about 15 minutes.\nSerious Eats / Rezel Kealoha\nIn now-empty food processor, process toasted sugar until finely ground, 2 to 3 minutes. Transfer to a bowl; set aside.\nSerious Eats / Rezel Kealoha\nLine a rimmed half baking sheet with parchment paper and lightly grease with baking spray. Using a stand mixer fitted with whisk attachment, whip egg whites and cream of tartar on medium-low speed until white and frothy, 5 to 7 minutes. Increase speed to high and gradually add toasted sugar in thin, steady stream. Continue mixing on high speed until sugar is fully dissolved and the meringue holds stiff peaks, about 7 minutes.\nSerious Eats / Rezel Kealoha\nPour meringue onto prepared baking sheet, using an offset spatula to spread into an even layer. Use the tines of a fork to make a wood-grain pattern lengthwise over entire surface of meringue, running the length of the pan. Bake until the top of meringue is light golden brown and the fork pattern is well defined, about 20 minutes. Transfer sheet to wire rack and let stand until fully cooled, about 30 minutes.\nSerious Eats / Rezel Kealoha\nTo Assemble and Serve:\nRun a small knife along edge of baking sheet to loosen meringue. Use a fine-mesh strainer to dust top of baked meringue evenly with confectioners’ sugar. Place a clean sheet of parchment paper on top of meringue, then carefully invert meringue onto a clean inverted baking sheet.\nSerious Eats / Rezel Kealoha\nCarefully remove parchment from now-top side of meringue. Spread custard filling evenly over meringue, leaving a 1/2-inch margin on each side. Starting with the long side, gently roll the meringue and filling into a jelly roll shape, leaving the parchment paper behind as you go. Cover with parchment paper and wrap tightly with plastic wrap. Refrigerate for at least 1 hour. Cut into 1-inch-thick slices and serve.\nSerious Eats / Rezel Kealoha\nSpecial Equipment\nStand mixer with whisk attachment, 2 rimmed half baking sheets, fine-mesh strainer, food processor, parchment paper, offset spatula\nNotes\nTake note that baking spray is different from cooking spray, as baking spray contains flour, while cooking spray does not.\nBe firm when rolling the meringue to create the desired coil shape, but gentle enough so that you do not squeeze the custard filling out of the ends.\nMake-Ahead and Storage\nThe custard can be refrigerated for up to 5 days.\nThe finished brazo de Mercedes can be stored in an airtight container and refrigerated for up to 5 days.\nSoutheast Asian\nThe Latest\nFilipino\nEggs\nDesserts"
}