{
  "url": "https://www.seriouseats.com/brazilian-carrot-cake-recipe-11715745",
  "image_url": "https://www.seriouseats.com/thmb/QkE54JNHKpi5haBC3TAetYO4PG4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250415-SEA-BrazilianCarrotCake-HannahHufham-01-8998a0b6914d4680bca7bbe86817b217.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Baking",
    "Carrots",
    "Desserts"
  ],
  "title": "For Moist, Tender Carrot Cake, Make It the Brazilian Way",
  "full_text": "For Moist, Tender Carrot Cake, Make It the Brazilian Way\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nCooling Time:\n105 mins\nTotal\n2 hrs 50 mins\nServes\n10\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nBaking spray\nwith flour\n3\nmedium\ncarrots\n(\n4\nounces\n;\n113\ng\neach), peeled and grated (about\n2\ncups\npacked)\n14\nounces\ngranulated sugar\n(\n400\ng\n;\n2\ncups\n)\n1\ncup\n(\n240\nml\n)\nvegetable oil\n3\nlarge\neggs\n8 1/2\nounces\nall-purpose flour\n(\n240\ng\n;\n1 3/4\ncup\nplus\n2\ntablespoons\n)\n1\ntablespoon\nbaking powder\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Frosting:\n2\n(3 1/2 ounce) cans\nsweetened condensed milk\n3/4\ncup\n(\n180\nml\n)\nwhole milk\n1 1/2\nounces\nunsweetened natural cocoa powder\n(\n42\ng\n;\n1/2\ncup\n)\n1\nounce\nunsalted butter\n(\n28\ng\n;\n2\ntablespoons\n), cut into 1-inch cubes\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nChocolate sprinkles\n(optional)\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Using baking spray, lightly grease bottom and sides of a 9-inch round cake pan; line bottom of pan with parchment paper.\nIn a blender or food processor, blend carrots, sugar, oil, and eggs until completely smooth, about 90 seconds. In a large bowl, whisk flour, baking powder, and salt together. Pour carrot mixture into flour mixture and whisk until combined and no lumps remain. Pour batter into prepared pan and gently tap to eliminate any air bubbles. Using an offset or flexible spatula, smooth batter into an even layer.\nSerious Eats / Hannah Hufham\nSerious Eats / Hannah Hufham\nBake until golden brown and a toothpick or cake tester inserted comes out clean, 45 to 50 minutes. Tent with aluminum foil, if needed, after 30 minutes to prevent overbrowning. Let cake cool in pan 15 minutes; invert cake onto a wire rack and let cool completely, about 1 hour.\nFor the Frosting\n: In a small saucepan, whisk condensed milk, whole milk, cocoa powder, butter, and salt to combine. Cook over medium heat, stirring constantly, until mixture begins to bubble and has thickened slightly, about 5 minutes.\nSerious Eats / Hannah Hufham\nImmediately pour frosting over cooled cake, allowing it to drip down sides of cake. Garnish with chocolate sprinkles, if desired. Let frosting set before slicing and serving, at least 30 minutes.\nSpecial Equipment\n9-inch round cake pan, parchment paper, blender or food processor, whisk, toothpick or cake tester, wire rack, small saucepan\nNotes\nCake can be baked in a Bundt pan or a 9- by 13-inch baking pan if desired. Baking time may vary; if baking in a 9- by 13-inch baking pan, bake until golden brown and a toothpick or cake tester inserted comes out clean, about 30 minutes.\nMake-Ahead and Storage\nCake can be stored in an airtight container at room temperature for up to 3 days.\nThe cooled and unfrosted cake can be wrapped tight in plastic and frozen for up to 2 months. Let thaw in refrigerator overnight before frosting.\nThe Latest\nRecipes\nBaking\nCarrots\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/for-moist-tender-carrot-cake-make-it-the-brazilian-way.webp?"
}