{
  "url": "https://www.seriouseats.com/breakfast-torta-recipe",
  "image_url": "https://www.seriouseats.com/thmb/7Em25qaxMC91a6YUOkCXyCFx-I4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120604-127677-Breakfast-Torta-PRIMARY-ca5f4cbb1f614e069f89b4ea0263aab4.jpg",
  "tags": [
    "Breakfast Sandwich",
    "Black Beans",
    "Eggs",
    "Pork"
  ],
  "title": "Breakfast Torta (Mexican Breakfast Sandwich with Eggs, Crispy Pork, and Beans) Recipe",
  "full_text": "Breakfast Torta (Mexican Breakfast Sandwich with Eggs, Crispy Pork, and Beans) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n30 mins\nMakes\n4 sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\n4\nroll (1 oz)\nrolls\n16\nounces\nrefried beans\n1/4\ncup\nmayonnaise\n2\ntablespoons\nhot sauce\n1\ncup\nchicharrones\n2\nounces\ncotija cheese\n1\navocado\n, NS as to Florida or California\navocado\n1/2\nsmall\nyellow onion\n1/2\ncup\ncilantro\n2\ntablespoons\nunsalted butter\n4\nlarge\nlarge eggs\n1/4\ntsp\nsalt and pepper\nPickled jalapeños and\nlime wedges\nto taste\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F. Arrange rolls on baking sheet and place in oven and bake until heated through, about 7 minutes.\nMeanwhile, heat beans in microwave or small skillet until completely heated through, about 2 minutes. Set aside. In small bowl, combine mayonnaise and hot sauce. Set aside.\nWith clean dish rag or oven mitts, transfer warm bread to cutting board. With serrated knife, split each roll in half. Spread inside of 4 bottom pieces of each roll with 1/4 of beans. Layer beans with chicharrones, cotija, avocado, onion, and cilantro, distributing each topping evenly among 4 rolls. Spread inside of 4 top pieces with mayonnaise mixture.\nMelt butter in large nonstick skillet over medium heat. Crack eggs into pan, season with salt and pepper, and cook until whites begin to set and turn opaque. Cover pan and cook until yolks and whites are cooked to preferred doneness, 2 to 4 minutes.\nPlace 1 egg on top of each roll, then close top of sandwich. Serve with pickled jalapeños and lime wedges.\nSpecial equipment\nbaking sheet, microwave or small skillet, serrated knife, large nonstick skillet with lid\nBreakfast Sandwich\nBlack Beans\nEggs\nPork"
}