{
  "url": "https://www.seriouseats.com/breakfast-burrito-with-scrambled-egg-chorizo-and-refried-beans",
  "image_url": "https://www.seriouseats.com/thmb/BNwDQbhgLgQUSS4nji1NhvdVPkM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__07__20200706-chorizo-egg-refried-bean-breakfast-burrito-daniel-gritzer-30-8c0e2a90d5d64399a58e1cf5e856922f.jpg",
  "tags": [
    "Breakfast & Brunch",
    "Southwestern & Tex Mex",
    "Beans",
    "Scrambled Eggs",
    "Sausages"
  ],
  "title": "Breakfast Burrito With Scrambled Egg, Chorizo, and Refried Beans Recipe",
  "full_text": "Breakfast Burrito With Scrambled Egg, Chorizo, and Refried Beans Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n50 mins\nServes\n2 burritos\nMakes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\neggs\nKosher salt\nand freshly ground black pepper\n1\nmedium\n(\n4\n-\nounce\n;\n115\ng\n)\nPoblano pepper\n8\nounces\n(\n225\ng\n)\nfresh Mexican chorizo\n(about\n2\nlarge\nlinks), casings removed\n2\nounces\n(\n55\ng\n) shredded p\nepper jack cheese\n2\nlarge\n(10-inch)\nflour tortillas\n, warmed through on a dry griddle or cast iron pan\n1/4\ncup\n(\n2\nounces\n;\n55\ng\n) warm\nrefried beans\n, divided\n2\ntablespoons\n(\n1\nounce\n;\n30\ng\n)\ncrema\nor sour cream, divided\n1/4\ncup\n(\n2\nounces\n;\n55\ng\n)\nguacamole\n, divided\nHot sauce\nof your choice (optional)\nDirections\nIn a medium bowl, whisk eggs with a large pinch of salt and black pepper to taste until homogenous and no visible egg whites remain. Let stand 15 minutes.\nSerious Eats / Vicky Wasik\nUsing a broiler with the rack set in the highest position, or working directly over a gas flame, char Poblano pepper, rotating frequently, until skin is blistered and black all over. Transfer to a heatproof bowl, cover with plastic, and let stand for 5 minutes. Using paper towels, rub charred skin off pepper. Stem and seed pepper, finely dice the flesh, and reserve.\nSerious Eats / J. Kenji López-Alt\nIn a medium nonstick skillet, add chorizo and turn heat to high. Cook, stirring and breaking chorizo into small pieces with a wooden spoon, until fat has rendered and chorizo is cooked through and is beginning to brown, about 5 minutes.\nLower heat to medium-low, add eggs, and cook, stirring constantly, until eggs have formed curds but are still runny, 1 to 2 minutes. Stir in cheese and reserved Poblano pepper and continue to cook, stirring constantly, until cheese is melted and eggs are soft and fluffy, about 1 minute longer. Remove from heat.\nWorking with one just-warmed tortilla at a time, lay tortilla on a work surface. Spread half the refried beans on center of tortilla, leaving about 2 inches of border on either side and 3 inches of border above and below. Top with 1 tablespoon (15g) crema and 2 tablespoons (30g) guacamole, spreading each in a thin, even layer on top of the refried beans.\nPile half the eggs and cheese on top. Douse with as much hot sauce as you want.\nFold the tortilla sides in over the filling. Then roll the bottom flap of tortilla up over the filling, holding the sides tight as you roll. Continue rolling until the burrito is sealed. Repeat with remaining tortilla and filling ingredients. Serve right away.\nSerious Eats / Daniel Gritzer\nSpecial Equipment\nMedium cast iron skillet\n, medium nonstick skillet\nMake-Ahead and Storage\nThe burrito is best prepared shortly before serving, though the refried beans can be prepared up to three days in advance and the guacamole can be prepared a few hours in advance and refrigerated until ready to use; make sure to press plastic wrap directly against the surface of the guacamole to prevent oxidation, and reheat the refrieds before using.\nBreakfast & Brunch\nSouthwestern & Tex Mex\nBeans\nScrambled Eggs\nSausages"
}