{
  "url": "https://www.seriouseats.com/breakfast-sopes-recipe-8639442",
  "image_url": "https://www.seriouseats.com/thmb/FFEVcxnrwtx9vfpdz6qnvqKLIMw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240426-SEA-Sopes-LorenaMasso-hero-71b8ecb06bff4a969f582530c8bc44ff.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Mexican",
    "Beans",
    "Eggs"
  ],
  "title": "Breakfast Sopes With Refried Beans, Queso Fundido, Poached Eggs, and Salsa",
  "full_text": "Breakfast Sopes With Refried Beans, Queso Fundido, Poached Eggs, and Salsa\nClose\nJump to recipe\nPrep\n60 mins\nCook\n2 hrs\nTotal\n3 hrs\nServes\n6\nMakes\n6 Sopes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Xnipec:\n1/2\ncup\n(\n240\nml\n)\norange juice\n(from\n2\noranges\n)\n1/2\ncup\n(\n240\nml\n)\nlime juice\n(from\n5\nlimes\n)\n1/4\ncup\n(\n120\nml\n)\ngrapefruit juice\n(from\n1\ngrapefruit\n)\n1\nmedium\nred onion\n, peeled, ends trimmed, and thinly sliced (\n8\nounces\n;\n227\ng\n)\n2 to 4\nhabaneros\n, stemmed and thinly sliced\nOne\n1-inch-thick\npineapple ring\nfrom\n1\npineapple\nwith core and rind removed\nFor the Sopes:\n2 1/4\ncups\n(\n225\ng\n)\nmasa harina\n1 1/2\nteaspoons\nkosher salt;\nfor table salt use half as much by volume, plus salt for sprinkling\n1 1/2\ncups\n(\n360\nml\n)\nwater\n2\ncups\nneutral oil\nsuch as\nvegetable\nor\ncanola oil\n, for frying\nFor the Refried Beans with Queso Fundido:\n4\nstrips\nbacon\n, cut into thin pieces\n2\nThai chiles,\nstemmed and thinly sliced into rings\n4\nounces\n(\n113\ng\n)\nqueso Oaxaca\n, grated\n4\nounces\n(\n113\ng\n)\nextra-sharp white cheddar,\ngrated\n2 cups\nPerfect Frijoles Refritos\nFor Finishing:\n6\npoached eggs\nMinced\nfresh cilantro leaves\nand tender stems\nDirections\nFor the Xnipec:\nAdjust oven rack to the upper-middle position and preheat the broiler. In a medium bowl, combine the orange juice, lime juice, grapefruit, red onion, and habanero. If the onion or habanero is sticking out of the liquid, push them down to submerge; set aside.\nSerious Eats / Lorena Masso\nSet pineapple slab on a rimmed baking sheet and broil until charred on both sides, about 2 minutes per side. Once cool enough to handle, dice into 1/4-inch pieces and stir into the onion-juice mixture. Let sit at room temperature for at least 30 minutes or up to 4 hours. (The mixture can be refrigerated in an airtight container for up to 3 days.)\nSerious Eats / Lorena Masso\nFor the Sopes:\nIn a large bowl, combine masa harina, salt, and water. Using your hands, mix the ingredients into a uniform dough. To test the masa, roll it into a small ball and gently crush it between your palms. If it sticks to your hands, add another tablespoon of masa harina. Once the masa is smooth and pliable, roll it into 6 uniformly sized balls.\nSerious Eats / Lorena Masso\nTo form the sopes, place 1 masa ball on a work surface and flatten it into a pancake. Then, fold the outer 1-inch edge of the dough and pinch to create a 1-inch tall border that stands straight up. Using the tips of your fingers, press the inside of the shaped sopes base into an even thickness.\nSerious Eats / Lorena Masso\nIn a large skillet or wok, heat oil over medium-high heat to 350℉ (175°C). (Oil should measure about 1/2 inch deep.) Add 2 sopes flat side down, and fry until the bottom side crisps and turns golden, about 2 minutes. Carefully flip over and fry until the inside surface is crisp and golden, about 2 more minutes. Using a spider skimmer, lift the sopes and let any trapped oil drip back into the pot. Place on a paper towel–lined rack, sprinkle lightly with salt, and repeat in batches of 2 at a time with the remaining sopes.\nSerious Eats / Lorena Masso\nFor the Queso Fundido:\nHeat oven to 400℉ (205°C). In a 10-inch stainless-steel skillet, add bacon and cook over medium heat, stirring occasionally, until bacon is rendered and crisp, 5 to 10 minutes. Add Thai chiles and cook until softened and fragrant, about 30 seconds. Using a slotted spoon, transfer bacon and chiles to a large bowl. Add queso Oaxaca and cheddar to the bacon mixture and toss to combine.\nSerious Eats / Lorena Masso\nIn a 3-quart casserole dish, spread refried beans in an even layer. Top with the cheese-bacon mixture and bake until warmed through and the cheese is melted, about 10 minutes.\nSerious Eats / Lorena Masso\nTo assemble:\nFill each sope with the bean and queso fundido mixture on the base of each sope. Top each with a poached egg, minced cilantro, and the prepared xnipec. Serve, passing the remaining xnipec.\nSerious Eats / Lorena Masso\nSpecial Equipment\nLarge deep skillet or wok, Digital thermometer, spider skimmer, 10-inch stainless-steel skillet\nNotes\nMasa harina is available in the Latin foods aisle at most grocery stores. Maseca is a widely available brand. Masienda is a great brand that uses heirloom corn but can be more difficult to find. Make sure the label says “instant corn masa flour.”\nThis recipe makes more xnipec than you need. Use it anywhere you would use pickled onions, such as in sandwiches or tacos, or with fried eggs.\nMake-Ahead and Storage\nThe xnipec can be refrigerated in an airtight container for up to 4 days.\nThe refried beans can be refrigerated for up to 4 days.\nThe fried sopes are best consumed right away.\nBreakfast & Brunch\nThe Latest\nMexican\nBeans\nEggs"
}