{
  "url": "https://www.seriouseats.com/bread-baking-pullman-loaf-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ix5YTGlgBNoNMZeZdS9MRv8yxeg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__pullman20loaf-3ddbf2c2cc29437eb64ba6318953efca.JPG",
  "tags": [
    "Yeast Breads"
  ],
  "title": "Pullman Loaf Recipe",
  "full_text": "Pullman Loaf Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n25 mins\nRising Time\n2 hrs\nTotal\n2 hrs 55 mins\nServes\n14\nto 16 servings\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\nlukewarm\nwater\n1\ncup\n(\n5 1/2\nounces\n)\nsemolina flour\n2\ntablespoons\nhoney\n2 1/4\nteaspoons\ninstant yeast\n2\ncups\n(\n9\nounces\n)\nbread flour\n1/2\ncup\nwhite wheat flour\n1 1/2\nteaspoons\nsalt\n3\ntablespoons\nbutter\nDirections\nIn the bowl of your stand mixer, combine the water, semolina flour, honey, yeast, and bread flour. Stir to combine. Cover and set aside for 20 minutes.\nAdd the white wheat flour, salt, and butter and knead with the dough hook attachment of your stand mixer until the dough is smooth and elastic. Flour your work surface lightly, and knead by hand briefly, then form the dough into a ball. Drizzle with olive oil and return it to the bowl. Cover with plastic wrap and set aside for 30 minutes.\nPreheat the oven to 350°F (175°C). Turn out the dough and knead it briefly to knock out the large bubbles. Form it into a log about 13 inches long - to fit inside the pan. Place the log in the pan, seam-side down. Put the lid on the pan and set aside until the dough has risen to within about an inch of the top of the pan, at least 30 minutes and up to 1 hour 30 minutes proofing times vary depending on the ambient temperature of your kitchen).\nBake until the loaf is golden brown, about 40 minutes. Remove the loaf from the pan and allow it to cool completely on a rack before slicing.\nSpecial Equipment\n13 x 4 x 4 pullman pan\nYeast Breads"
}