{
  "url": "https://www.seriouseats.com/bread-baking-sourdough-english-muffins-recipe",
  "image_url": "https://www.seriouseats.com/thmb/djaW_MDp4x60t8M874eJn-DA5_8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__08__20200829-sourdough-english-muffins-vicky-wasik-1-2-1599c43092e94a9598dc4c1de76ed38f.jpg",
  "tags": [
    "Muffins",
    "Yeast Breads",
    "Breakfast & Brunch"
  ],
  "title": "Sourdough English Muffins Recipe | Bread Baking",
  "full_text": "Sourdough English Muffins Recipe | Bread Baking\nClose\nJump to recipe\nPrep\n60 mins\nCook\n30 mins\nActive\n20 mins\nTotal\n90 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nbread flour\n(\n1 1/2\ncups\n;\n225\ng\n)\n8\nounces\n(\n1\ncup\n;\n225\ng\n) warm\nwater\n, between 110°F-115°F\n4\nounces\n(\n1/2\ncup\n;\n115\ng\n) leftover\nsourdough starter\n(unfed/discard, see notes)\n1\nounce\nnon-fat dry milk powder\n(\n1/4\ncup\n;\n30\ng\n)\n1\nounce\n(\n2\ntablespoons\n;\n30\ng\n)\nunsalted butter\n, melted\n1/2\nounce\ngranulated sugar\n(\n1\ntablespoon\n;\n15\ng\n)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\ninstant yeast\nNon-stick cooking spray\n, for greasing ring molds\nDirections\nIn a large bowl, whisk together flour, water, sourdough starter, milk powder, butter, sugar, salt, and yeast until smooth. Cover with plastic wrap and let stand at room temperature until batter has roughly doubled in volume, about 1 hour.\nHeat griddle on medium heat (see note). Spray the inside of eight 3 1/2-inch English muffin rings or round ring molds with non-stick cooking spray and place on griddle. Without stirring the batter, use a 1/3 measuring cup to evenly portion it into the rings. Cover rings with a baking sheet, reduce heat to low, and cook undisturbed for 5 minutes.\nRemove baking sheet. Using tongs to hold rings in place, slide a spatula underneath muffins and flip over to cook other side. Cover again, and cook 5 minutes longer.\nRemove baking sheet. Using tongs, remove rings from muffins and set aside. Using a spatula, transfer muffins to a wire rack to cool for about 10 minutes. Split English muffins by hand or with a fork. If desired, toast before serving.\nSpecial Equipment\nStovetop or\nelectric griddle\n; 3 1/2-inch ring molds, English muffin rings, or other round metal form\nNotes\nYou can use unfed/discarded starter that has been kept at room temperature or straight from the refrigerator. To read more about discarding, feeding, and maintaining a sourdough starter, please see our guide\nhere\n.\nIf you don’t have an electric griddle, you can use a heavy-bottomed non-stick 10-inch skillet or a 10-inch cast iron pan. Using either option, you can make four muffins at a time.\nMake-Ahead and Storage\nEnglish muffins are best served the same day. Store leftover muffins in an airtight container at room temperature for up to 2 days.\nMuffins\nYeast Breads\nBreakfast & Brunch"
}