{
  "url": "https://www.seriouseats.com/brioche-loaf-recipe-6755249",
  "image_url": "https://www.seriouseats.com/thmb/Pjnr31tMZbtLepItm58aoV_z72A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221205-Brioche-DebbieWei-ffa328502c4943f797c6c66b0aca8a8c.jpg",
  "tags": [
    "Yeast Breads",
    "The Latest",
    "French"
  ],
  "title": "Brioche",
  "full_text": "Brioche\nClose\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nProofing Time\n7 hrs 30 mins\nTotal\n8 hrs 35 mins\nServes\n10 servings\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/4\ncups\n(\n285\ng\n)\nbread flour\n, chilled in freezer for 2 hours beforehand\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n1 3/4\nteaspoons\n(\n5\ng\n)\ninstant yeast\n1/4\ncup\nminus\n1\nteaspoon\n(\n55\ng\n)\nwhole milk\n, cold\n4\nlarge\neggs\n(\n150\ng\n) plus\n1\nlarge\negg yolk\n(\n15\ng\n), divided, straight from the fridge\n3\ntablespoons\n(\n40\ng\n) caster or\nsuperfine sugar\n3/4\ncup\n(\n170\ng\n)\nunsalted butter\n, cut into 1 to 2-inch cubes, and softened to about 65°F/18°C (see headnote for guidance on controlling butter’s temperature)\nDirections\nIn the bowl of a stand mixer fitted with the dough hook attachment, add flour, salt, and yeast, making sure to place yeast and salt apart from one another in the bowl. Add milk, 3 eggs, and the egg yolk and mix on low speed until no dry flour remains, about 1 minute. Increase speed to medium and mix for 3 minutes, then let rest for 3 minutes. Repeat mixing on medium speed and resting dough, scraping down bowl and hook as needed, until dough is homogenous and somewhat elastic (you can stretch it but the dough will tear fairly easily).\nSerious Eats / Debbie Wee\nWith the mixer running on medium speed, add one-third of the butter, one piece at a time, making sure to wait until each piece is mostly incorporated before adding the next, about 4 minutes. Add sugar and mix until fully incorporated, about 1 minute (the dough will slacken and look more wet). Repeat adding remaining butter, one piece at a time, and scraping down bowl and hook as needed, about 8 minutes. Let dough rest for 2 minutes.\nSerious Eats / Debbie Wee\nIncrease speed to medium-high and mix until dough pulls away cleanly from sides of bowl and is able to be gently stretched into a thin sheet without tearing, about 8 minutes.\nSerious Eats / Debbie Wee\nScrape dough onto a clean, un-floured work surface. Using clean hands, slide hands under left and right side of dough and lift it up from the middle until dough releases from work surface, then slap the bottom half of the dough down onto the work surface, quickly stretching the top half up and folding it over the bottom half (it will be sticky at first but don't worry, this process will reduce that as you work; do not add flour). Repeat this\nslap and fold motion\n, rotating dough as you work, until dough is smooth and less sticky, about 5 to 10 slaps.\nSerious Eats / Debbie Wee\nTransfer dough to a greased parchment-lined rimmed baking sheet, cover with plastic wrap, and let dough proof at room temperature until dough is visibly puffed, about 1 hour. Press dough into a roughly 8- by 14-inch rectangle, cover tightly with plastic, and place in the refrigerator. Let dough proof and allow the butter to solidify for at least 4 hours or up to 24 hours.\nSerious Eats / Debbie Wee\nGrease an 8 1/2- by 4 1/2-inch aluminum loaf pan and line with a 7- by 13-inch sheet of parchment paper so that parchment hangs over the long sides of the pan to form a sling. Transfer chilled dough onto a lightly floured work surface. Using a rolling pin or your hands, stretch the dough into a 8- by 14-inch rectangle. Starting at the narrow end, roll dough to form a log, then transfer to the prepared loaf pan seam side down. Alternatively, for brioche Nanterre, divide dough into 8 equal portions (70g each), forming each into a smooth ball. Arrange dough in a single layer in prepared loaf pan; they can be slightly touching and will proof into each other.\nSerious Eats / Debbie Wee\nLoosely drape plastic wrap over pan to prevent a crust from forming and let dough proof at room temperature, between 2 1/2 to 5 hours for a large loaf, or 1 1/2 to 3 hours for a Nanterre-style loaf. The loaf is ready to bake once the dough is peaking above the rim of the pan by 1 inch and looks very wobbly. When pressed with a lightly wet or oiled finger, your finger should leave a slight indentation and the dough should bounce back slowly.\nSerious Eats / Debbie Wee\nAdjust oven rack to middle position and preheat to 400°F (204°C). In a small bowl, whisk remaining egg until homogenous, then using a pastry brush, gently brush all over loaf.\nSerious Eats / Debbie Wee\nPlace loaf in the oven, reduce temperature to 350°F (180°C), and bake until deep golden brown and to an internal temperature of 190°F (88°C), about 35 minutes (if loaf is darkening too quickly, loosely cover with aluminum foil); if loaf has not reached desired internal temperature, continue to bake, checking temperature in 5-minute increments until desired final temperature is reached.\nSerious Eats / Debbie Wee\nTransfer pan to a wire rack and let cool for 10 minutes. Run a butter knife along edges to loosen, then lift loaf using overhanging parchment. Remove parchment, return loaf to wire rack, and let cool completely. Slice and serve as desired.\nSerious Eats / Debbie Wee\nSpecial Equipment\nStand mixer with dough hook attachment\n,\nrolling pin\n(optional),\ndigital thermometer\n,\nkitchen scale\n,\nbowl scraper\n, pastry brush,\n8 1/2- by 4 1/2-inch aluminum loaf pan\nNotes\nThe recipe can easily be doubled and will fit in a stand mixer bowl.\nMake-Ahead and Storage\nBrioche is best enjoyed on the day it’s baked. Leftover brioche can be wrapped tightly in plastic and kept at room temperature for up to 2 days, refrigerated for up to 7 days, and frozen for up to 1 month. To freeze, I recommend slicing your brioche first then defrost individual slices by toasting. If you prefer to freeze a whole loaf, defrost overnight in the refrigerator.\nYeast Breads\nThe Latest\nFrench",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/brioche.webp?"
}