{
  "url": "https://www.seriouseats.com/british-chips-recipe-8605265",
  "image_url": "https://www.seriouseats.com/thmb/BUR7a-Jcrb0mDuCkHHkSsad4f6k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240304-SEA-Chips-AmandaSuarez-22-45bb69d129324fcda1cd06153f2dc71a.jpg",
  "tags": [
    "Potatoes",
    "The Latest",
    "British",
    "Fried Potatoes"
  ],
  "title": "British Chips",
  "full_text": "British Chips\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nCooling Time\n30 mins\nTotal\n100 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n2 pounds\nrusset potatoes\n(\n900\ng\n; about 4 large potatoes), peeled and cut lengthwise into 1/2-inch by 1/2-inch chips\n3 tablespoons (\n45\nml)\ndistilled\nwhite vinegar\nKosher salt\n3 quarts (2.9L) neutral\noil\n, such as vegetable or canola, for frying\nMalt vinegar\n, optional\nDirections\nIn a 6-quart Dutch oven, add potatoes, distilled white vinegar, 3 quarts (2.8L) water, and 3 tablespoons (36g) salt. Bring to a boil over high heat and boil until potatoes are fully tender, but not falling apart, about 12 minutes. Drain and spread into an even layer on a wire rack set in a rimmed baking sheet. Let dry for 5 minutes. (For best results, freeze potatoes for at least 3 hours, until frozen solid, and up to overnight before continuing with step 2).\nSerious Eats / Amanda Suarez\nLine a rimmed baking sheet with a double layer of paper towels; set aside. In a 6-quart Dutch oven or large wok, heat oil over high heat to 265ºF (130ºC). Add one-third of chips and cook, using a spider skimmer to agitate occasionally, until a crust begins to form, 3 minutes. Use spider skimmer to transfer to the prepared baking sheet. Return oil to 265ºF (130ºC) and repeat frying with the remaining potatoes, working in 2 more batches. Let potatoes cool to room temperature, about 30 minutes. (For best results, transfer potatoes to a wire rack set within a rimmed baking sheet and freeze potatoes for at least 3 hours, until frozen solid, and up to overnight before continuing with step 3).\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and heat oven to 200ºF (90ºC). Set a wire rack in a rimmed baking sheet; set aside. Reheat oil in Dutch oven over high heat to 400ºF (205ºC). Add half of the potatoes and fry until crisp and light golden brown, about 3 1/2 to 4 1/2 minutes, adjusting heat as needed to maintain a temperature of around 360ºF (180ºC). Transfer to a  paper-towel lined bowl and season immediately with kosher salt and a dash of malt vinegar, if using and toss to combine. Transfer to prepared baking sheet and hold warm in the oven. Return oil to 400ºF (205ºC) and repeat frying and seasoning with the remaining chips. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n6-quart Dutch oven, pot, or wok, wire rack, rimmed baking sheet, instant read thermometer, spider\nPotatoes\nThe Latest\nBritish\nFried Potatoes"
}