{
  "url": "https://www.seriouseats.com/british-fish-pie-salmon-cod-shrimp-mashed-potatoes",
  "image_url": "https://www.seriouseats.com/thmb/rppHj0kzQPunlakFMH00qw6pRbA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__07__20170705-fish-pie-matt-clifton-17-cdd5c96bcd194414a174ddf382a87566.jpg",
  "tags": [
    "Savory",
    "British",
    "Salmon",
    "Shrimp",
    "Potatoes"
  ],
  "title": "British Fish Pie With Smoked Salmon, Shrimp, and Mashed Potatoes",
  "full_text": "British Fish Pie With Smoked Salmon, Shrimp, and Mashed Potatoes\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs\nActive\n90 mins\nCuring Time\n4 hrs\nTotal\n6 hrs 10 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Smoked Salmon (see note):\n1/2\ncup\n(\n100\ng\n)\nsugar\n1\ntablespoon\n(\n15\ng\n) Diamond Crystal\nkosher salt\n2\nteaspoons\n(\n10\ng\n)\nfreshly ground black pepper\n2\nteaspoons\n(\n10\ng\n)\nmustard powder\n2\nteaspoons\n(\n10\ng\n)\nfreshly grated lemon zest\n(from about\n1\nlarge\nlemon\n)\n1\npound\n(\n450\ng\n)\nskin-on boneless salmon fillets\n(you will need only\n1/2\npound\nfor the pie, so you'll have plenty left over)\n3\ncups\nwood chips\nor pellets\nFor the Filling and Topping:\n1/2\npound\n(\n225\ng\n) medium to\nlarge shrimp, peeled and deveined\n1/8\nteaspoon\nbaking soda\nKosher salt\n4\ntablespoons\n(\n60\ng\n)\nunsalted butter\n, plus\n2\nmore\ntablespoons\n(\n30\ng\n) if using panko, plus more for buttering baking dish\n2\nmedium\nleeks\n, white and light green parts only, washed and finely chopped (\n8\nounces\n;\n225\ng\nafter trimming)\n1/3\ncup\nall-purpose flour\n(\n1 1/2\nounces\n;\n40\ng\n)\n1/2\ncup\n(\n120\nml\n)\ndry white wine\n1\ncup\n(\n240\nml\n)\nwhole milk\n1\ncup\n(\n240\nml\n)\nheavy cream\n1/4\ncup\n(\n16\ng\n)\nchopped flat-leaf parsley\nleaves and tender stems\n3\ntablespoons\n(\n10\ng\n)\nminced chives\n2\noil-packed anchovy\nfillets\n, finely chopped\nFreshly ground black pepper\n1\npound\n(\n450\ng\n)\ncod\nor other firm, white-fleshed fish fillets (such as halibut, hake, or pollack), skinned, deboned, and cut into 1 1/2–inch chunks\n1/2\nrecipe\nUltra-Fluffy Mashed Potatoes\n, made with only 1/2 cup (120ml) milk total\n1/2\ncup\n(\n30\ng\n)\npanko bread crumbs\n(optional)\nDirections\nFor the Smoked Salmon:\nIn a small bowl, stir together sugar, salt, pepper, mustard powder, and lemon zest. Place salmon, skin side down, in a glass baking dish. Spread mixture evenly on top of salmon. Cover dish with plastic wrap and refrigerate for at least 4 and up to 12 hours.\nSerious Eats / Emily and Matt Clifton\nIf using wood chips, soak them in water at least 1 1/2 hours before you plan to smoke the fish. (Pellets do not have to be soaked.)\nLight 1 chimney full of charcoal\n. When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Sprinkle half the soaked wood chips over the hot coals; you can also use a smoker box or a foil packet with holes punched in it to hold the wood chips or pellets. Place disposable foil pan on empty side of charcoal grate and pour in 1 cup (240ml) water. Place cooking grate on grill, then\nclean and oil\nthe grate. Make sure top and bottom vents are open about 1/4 of the way.\nWipe most of salt mixture off salmon, then place fish, skin side down, on cooler side of grill, directly over foil pan. Close lid on grill and smoke salmon for 10 minutes. Add the remaining wood chips to the grill and continue cooking until salmon reaches 125°F (52°C) in center of thickest part, about 10 minutes longer. Transfer salmon to a plate and cover with aluminum foil. Allow to rest for at least 20 minutes. When cool, remove skin and any bones. Flake half of salmon into roughly 1-inch pieces; reserve remainder for another use.\nSerious Eats / Emily and Matt Clifton\nFor the Filling and Topping:\nPreheat oven to 375°F (190°C) and set rack in middle position. In a medium bowl, toss shrimp with baking soda and 1/2 teaspoon kosher salt. Place in refrigerator for at least 15 minutes and up to 1 hour. If shrimp are large or extra large, cut into large chunks before adding to pie.\nIn a large saucepan, melt 4 tablespoons (60g) butter over medium heat. Add leeks and cook until soft but not browned, about 5 minutes. Stir in flour and cook for 2 minutes. Slowly whisk in wine, milk, and cream, stirring well. Bring sauce to a simmer and cook for 5 minutes. Stir in parsley, chives, and anchovies. Remove from heat and season with salt and pepper. Gently stir in flaked smoked salmon, cod, and shrimp. Transfer mixture to a buttered 2-quart baking dish.\nTop with dollops of mashed potatoes, then use a spatula to spread into an even layer over the entire top of the dish. Make sure to cover edges to prevent sauce from bubbling over. If desired, use the back of a large spoon to create a wavy texture. If using panko bread crumbs, sprinkle on top and dot with remaining 2 tablespoons (30g) butter. Place dish on a rimmed baking sheet and place in oven on center rack. Bake until pie is bubbly and top is golden brown, 30 to 40 minutes, and serve.\nSerious Eats / Emily and Matt Clifton\nSpecial Equipment\nCharcoal grill\nor\nsmoker\n, wood chips or pellets, disposable foil roasting pan,\n2-quart baking dish\n,\nrimmed baking sheet\n,\ninstant-read thermometer\nNotes\nIf you don't want to smoke your own salmon, you can use 1/2 pound (225g) store-bought hot-smoked salmon instead.\nRead More\nCoquilles St. Jacques Pot Pies with Roasted Lemon Recipe\nSalmon en Croûte with Rosemary and Asparagus Recipe\nArugula, Salmon, and Leek Tart Recipe\nSeafood-Stuffed Shells Recipe\nHow to Smoke Salmon\nHow to Shop for Sustainable Seafood\nSavory\nBritish\nSalmon\nShrimp\nPotatoes"
}