{
  "url": "https://www.seriouseats.com/broccoli-soup-recipe-8772702",
  "image_url": "https://www.seriouseats.com/thmb/Dfpw2EyZXhMmO8Ehs31AnbmIWz0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240827-SEA-Green-broccoli-leek-and-snap-pea-soup-VyTran-HERO-33-5726b662e7f642cdbac08f1a44c29294.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Vegetable Mains",
    "Broccoli"
  ],
  "title": "The Greenest Broccoli Soup",
  "full_text": "The Greenest Broccoli Soup\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nTotal\n45 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n4\nquarts (3.8\nL)\ncold water\n, divided\n4\nteaspoons(\n12g) Diamond Crystal\nkosher salt,\ndivided; for table salt use half as much by volume\n1 teaspoon (\n6\ng)\nbaking soda\n1 pound (\n450\ng\n)\nbroccoli crowns\n(about 2 crowns), half cut into 2-inch pieces, half cut into 1-inch florets, divided\n1\nleek\n(6 ounces;\n170\ng)\n, white and light green parts washed and finely chopped; dark green tops sliced crosswise into thin rounds and washed thoroughly\n2\ncups\nloosely packed fresh\nparsley\nleaves and tender stems (1 ounce; 30g), roughly chopped\n6 tablespoons (\n90\nml\n)\nvegetable oil\n, divided\n1\nteaspoon\nfreshly\nground black pepper\n2\nmedium\ncloves (10g)\ngarlic\n, grated\n1\nteaspoon\n(6g) chicken\nbouillon paste\n, such as Better Than Bouillon (optional, see notes)\n1 tablespoon\n(15\nml\n)\nfish sauce\n4 ounces\n(115\ng\n)\nsnap peas,\ntrimmed and halved crosswise on a bias\nExtra-virgin olive oil\n,\nfor\nserving\nLemon\nwedges\nor white wine vinegar,\nfor serving\nDirections\nIn a Dutch oven, stir together 3 quarts water, 1 tablespoon (9g) salt, and baking soda until evenly distributed. Bring liquid to boil over high heat. Add the 2-inch pieces broccoli (8 ounces) to pot and cook until vibrant green and a knife pierces easily into the stem, 5 to 6 minutes. Use a spider skimmer or large slotted spoon to remove and set aside. Return water to a boil and add sliced dark green leek tops and parsley and cook until vibrant green and wilted, 1 to 2 minutes longer. In a fine-mesh strainer or colander, drain vegetables and discard water.\nSerious Eats / Vy Tran\nTransfer the blanched broccoli, leek tops, and parsley to the jar of a blender. Add 2 cups (475ml) cold water and blend on high speed, scraping down sides as needed, until smooth, 30 to 60 seconds. Set aside.\nSerious Eats / Vy Tran\nWipe the now-empty Dutch oven dry with a clean kitchen towel. In the dry Dutch oven, heat 3 tablespoons (45ml) oil over high heat until shimmering. Add remaining 1-inch broccoli florets (8 ounces) in a single layer and cook until the first side is roasted and well browned, 4 to 6 minutes. Carefully flip broccoli and cook until the second side is roasted and well browned, about 4 to 6 minutes longer. Transfer charred broccoli to a plate and season with salt to taste. Set aside.\nSerious Eats / Vy Tran\nIn now-empty Dutch oven, heat remaining 3 tablespoons (45ml) oil and pepper over medium-low heat until pepper begins to sizzle, about 30 seconds. Add white and light green leek slices and remaining 1 teaspoon (3g) salt and cook, stirring occasionally, until vegetables soften, about 3 minutes. Stir in garlic and bouillon paste and cook until fragrant, about 30 seconds. Stir in fish sauce and cook until slightly evaporated, about 15 seconds. Stir in remaining 2 cups (475ml) water and bring mixture to a simmer. Add the reserved green broccoli puree and stir until combined. Cook soup until heated through, about 1 minute.\nSerious Eats / Vy Tran\nOff heat, stir in snap peas. Season with salt and pepper to taste. Ladle soup into individual bowls and portion charred broccoli florets on top. Drizzle with olive oil and lemon juice or vinegar (if desired). Serve.\nSerious Eats / Vy Tran\nSpecial Equipment\nDutch oven, high speed blender, colander\nNotes\nIf you don’t prefer chicken bouillon paste, you can double the amount of fish sauce in the recipe.\nMake-Ahead and Storage\nThe broccoli puree base can be refrigerated for up to 2 days. When ready to serve, proceed with step 3 to finish.\nSoups\nThe Latest\nVegetable Mains\nBroccoli",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-greenest-broccoli-soup.webp?"
}