{
  "url": "https://www.seriouseats.com/broccoli-cheddar-cheese-soup-food-lab-recipe",
  "image_url": null,
  "tags": [
    "Soups",
    "Gluten-free Mains",
    "Cheddar Cheese",
    "Broccoli",
    "Russet Potatoes"
  ],
  "title": "Broccoli Cheese Soup",
  "full_text": "Broccoli Cheese Soup\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nActive\n30 mins\nTotal\n55 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n700\ng\n)\nbroccoli\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\nKosher salt\nand freshly ground black pepper\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n1\nmedium\nonion\n, sliced (about\n6\nounces\n;\n170\ng\n)\n1\nmedium\ncarrot\n, peeled and finely diced (about\n4\nounces\n;\n120\ng\n)\n3\nmedium cloves\ngarlic\n, thinly sliced\n2\ncups\n(\n475\nml\n) water, or\nhomemade\nor store-bought\nlow-sodium chicken stock\n3\ncups\n(\n700\nml\n)\nwhole milk\n1\nsmall\nrusset potato\n, peeled and sliced (about\n4\nounces\n;\n120\ng\n)\n12\nounces\n(\n340\ng\n)\nsharp cheddar cheese\n, grated (see notes)\n8\nounces\n(\n240\ng\n) deli-style\nAmerican cheese\n, diced (see notes)\n1\nteaspoon\n(\n3\ng\n)\nmustard powder\nDash\nof\nhot sauce\n, such as\nFrank's RedHot\nDirections\nSeparate broccoli into florets and stems. Cut florets into bite-size pieces and set aside. Roughly chop stems and reserve separately.\nSerious Eats / J. Kenji López-Alt\nHeat oil in a large Dutch oven over high heat until shimmering. Add broccoli florets and cook, without moving, until charred on the bottom, about 1 minute. Stir, season with salt and pepper, and continue cooking, stirring occasionally, until tender and charred on several surfaces, about 1 minute longer. Transfer to a rimmed baking sheet to cool.\nSerious Eats / J. Kenji López-Alt\nReturn Dutch oven to medium heat and add butter, onion, carrot, and broccoli stems. Season with salt and pepper and cook, stirring frequently, until tender but not browned, about 5 minutes, lowering heat if necessary. Add garlic and cook, stirring, until fragrant, about 30 seconds.\nSerious Eats / J. Kenji López-Alt\nAdd water or chicken stock, milk, and potato and bring to a boil over high heat. Reduce to a bare simmer and cook, stirring occasionally, until broccoli and potato are completely tender, about 30 minutes.\nSerious Eats / J. Kenji López-Alt\nIn a large bowl, toss both cheeses together along with mustard powder. Using an immersion blender or working in batches with a countertop blender, blend soup, adding cheese a handful at a time, until completely smooth. Stir in hot sauce and season to taste with salt and pepper. Stir in reserved broccoli florets and pulse with blender a few more times until a few pieces are broken down, but most bite-size pieces remain. Serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nImmersion blender\nor\ncountertop blender\n,\nrimmed baking sheet\nNotes\nLook for deli-style American cheese at the deli counter of your supermarket. You can use any combination of cheddar, American, and other young, moist cheeses, like Jack or colby.\nRead More\nCrispy Air-Fryer Broccoli\nCaesar Roasted Broccoli\nTurn Cheesy Broccoli Into a Real-Deal Main Course\nCharred Broccoli With Manchego, Hazelnuts, and Honey\nSoups\nGluten-free Mains\nCheddar Cheese\nBroccoli\nRusset Potatoes"
}