{
  "url": "https://www.seriouseats.com/broccoli-rabe-anchovy-pizza-recipe-8682624",
  "image_url": "https://www.seriouseats.com/thmb/tbHOrrrbJekV-2AI5GkParbvJ5k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211115-OONI-PIZZA-RABE-ANDREW-JANJIGIAN-49select-cf775e3e2bb64a50816af79fda98175a.jpg",
  "tags": [
    "Pizza",
    "The Latest",
    "Anchovies",
    "Broccoli Rabe"
  ],
  "title": "Broccoli Rabe, Pecorino, and Anchovy Pizza",
  "full_text": "Broccoli Rabe, Pecorino, and Anchovy Pizza\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nProofing Time:\n60 mins\nTotal\n105 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\npizza dough for an outdoor pizza oven\nOne\n28-ounce\n(\n795\ng\n)\ncan whole peeled tomatoes\n, drained, juices reserved\n2\nounces\n(\n60\ng\n) finely grated\nParmesan cheese\n2\nounces\n(\n60\ng\n) finely grated\nPecorino Romano cheese\n1\npound\nbroccoli rabe\n(\n450\ng\n; about\n2\nsmall bunches\n), ends trimmed\n1/4\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n, plus extra for drizzling\n1/2\nteaspoon\nred pepper flakes\n16\nanchovy fillets\n, halved lengthwise (see note)\nDirections\nRemove dough from refrigerator and allow to rest in proofing containers, covered, at room temperature for 1 to 2 hours before baking. Dough temperature should reach 60˚F (15.5°C) before stretching and baking; exact timing will depend upon ambient temperature.\nMelissa Rivard\nUsing a countertop or immersion blender, process tomatoes until a coarse but evenly blended sauce forms, about 10 seconds. Transfer to a 2-cup liquid measuring cup; if needed, add reserved tomato liquid to yield 2 cups (475ml) sauce. Season to taste with salt and pepper; set aside.\nMelissa Rivard\nIn a small bowl, stir together Parmesan and Pecorino until well combined; set aside.\nBring a large pot of salted water to a boil over high heat. Add broccoli rabe to boiling water and cook, stirring occasionally, until thickest parts of stalks are tender, 2 to 3 minutes. Drain well, squeezing rabe to get rid of excess moisture. Allow to cool slightly, then cut stalks crosswise into 2- to 3-inch pieces.\nMelissa Rivard\nHeat pizza oven to 800°F (425°C). While oven heats, in a 10-inch stainless steel, cast iron, or carbon steel skillet, combine rabe, 1/4 cup (60ml) oil, and red pepper flakes. Set skillet in oven and cook, stirring frequently, until rabe is lightly but evenly charred, 5 to 8 minutes. Transfer to a small bowl and set aside.\nMelissa Rivard\nWhen ready to bake, coat one dough ball generously on both sides with flour and place on well-floured surface, seam side down. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Stretch dough into a 10- or 12-inch circle (final dimension depends upon the size of your oven) about 1/4-inch thick by draping over knuckles and gently stretching. Transfer to floured wooden or perforated metal pizza peel.\nMelissa Rivard\nWorking quickly, spread an even layer of tomato sauce over pizza, leaving outer 1/2-inch rim untopped. Spread anchovies evenly over sauce, followed by cheese mixture. Scatter rabe evenly over pizza and drizzle with oil.\nMelissa Rivard\nTransfer pizza to oven and bake, rotating pie regularly with a metal peel for even cooking, until rim is lightly charred and bottom is crisp, 90 to 180 seconds total. Retrieve pizza with a metal peel and transfer to a cutting board. Slice, and serve immediately.\nMelissa Rivard\nRepeat steps 6 through 8 for remaining pizzas.\nSpecial Equipment\nHigh-temperature outdoor pizza oven\n,\nimmersion blender\n,\nwooden or perforated metal pizza peel\n, metal pizza peel.\nNotes\nBoth salt- and oil-packed anchovies will work for this recipe. Read more about how to fillet and prepare salt-packed anchovies\nhere\n. If you don’t like anchovies, this pie is still delicious without them.\nMake-Ahead and Storage\nTomato sauce can be made in advance and refrigerated in an airtight container for up to 3 days.\nPizza\nThe Latest\nAnchovies\nBroccoli Rabe",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/broccoli-rabe-pecorino-and-anchovy-pizza.webp?"
}