{
  "url": "https://www.seriouseats.com/broiled-blueberry-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KzybujwaPdweIVXyTO3yIjwMyTo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__08__20180726-MHT-broiling-blueberry-cream-cheese-graham-cracker-dessert-overhead-slice-vicky-wasik-10--3723ab17f3ff4c4692e3425524b29dab.jpg",
  "tags": [
    "Blueberry"
  ],
  "title": "Broiled Blueberry \"Pie\" With Graham Cracker Crust Recipe",
  "full_text": "Broiled Blueberry \"Pie\" With Graham Cracker Crust Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n20 mins\nStanding Time\n40 mins\nTotal\n60 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Blueberry Topping:\n1\npint\nfresh blueberries\n(about\n10\nounces\n;\n280\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nfresh juice\nfrom\n1\nwhole\nlime\nFreshly grated lime zest\nfrom\n1/2\nlime\n2\ntablespoons\nlight brown sugar\nFor the Crust:\n5\nounces\ngraham crackers\n(about\n1\ncup\ncrumbs\n;\n140\ng\n, or\n1\nsleeve\nof\ngraham crackers\n, depending on brand)\n2\ntablespoons\nlight brown sugar\n4\ntablespoons\nunsalted butter\n(\n2\nounces\n;\n60\ng\n)\nKosher\nor\nsea salt\nTo Finish:\n4\nounces\nplain, full-fat cream cheese\n(about\n1/2\ncup\n;\n115\ng\n), cubed\nWhipped cream\n, for serving (optional)\nDirections\nFor the Blueberry Topping:\nIn a medium bowl, combine blueberries with lime juice, zest, and brown sugar. Stir well. Let stand for 10 to 15 minutes.\nMeanwhile, for the Crust:\nIn a\nfood processor\n, pulse graham crackers to a coarse sand texture. Add brown sugar and pulse a few more times to mix.\nTurn on your broiler and position top rack 4 to 6 inches from broiler element. Add butter to an 8-inch cast iron skillet and broil until melted and slightly browned, about 2 minutes. Pour melted butter into the food processor work bowl with the graham crackers, add a pinch of salt, and pulse together until mixture resembles a sandy crumb. Add 1 tablespoon (15ml) water and pulse again. Pour mixture into cast iron skillet and pack down firmly with a rubber spatula.\nBroil until crust is set and lightly browned but not burnt, 1 to 2 minutes. Keep an eye on it, as it may burn quickly depending on the strength of your broiler. (A few dark spots are okay; you’ll cover them up with the cream cheese.)\nTo Finish:\nDistribute cubed cream cheese evenly over crust, return to broiler, and cook until cheese softens slightly, about 30 seconds. Let stand for 1 minute to warm through, then gently spread cream cheese over the crust to cover it in an even layer.\nScrape blueberry topping into an even layer on the cream cheese, lightly pressing berries into the cream cheese layer without breaking them. Broil until berries just begin to burst and juices bubble, about 4 minutes. Let pie rest on the counter for 30 minutes, or refrigerate for at least 10 minutes, before serving.\nServe, topping with whipped cream if desired.\nSpecial Equipment\nFood processor\n,\n8-inch cast iron skillet\nThis Recipe Appears In\nThe Broiling Days of Summer: Make This Easy Blueberry \"Pie\" in Your Cast Iron Skillet\nBlueberry"
}