{
  "url": "https://www.seriouseats.com/broiled-strip-steak-with-mushrooms-and-chive-sour-cream",
  "image_url": "https://www.seriouseats.com/thmb/6mI6iPbgtIng-cK2Y-ktpjYZmyY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__08__20180726-MHT-broiling-strip-steak-mushrooms-sour-cream-chives-finished-overhead-vicky-wasik-6--71fe82f1da714feaa046c4ce068c8d9b.jpg",
  "tags": [
    "Strip Steaks",
    "Roasted Beef",
    "Cremini & Button Mushrooms",
    "Oyster Mushroom",
    "Quick Dinners"
  ],
  "title": "Broiled Strip Steak With Mushrooms and Chive Sour Cream Recipe",
  "full_text": "Broiled Strip Steak With Mushrooms and Chive Sour Cream Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n30 mins\nResting Time\n5 mins\nTotal\n30 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\nsour cream\n(\n60\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nfresh juice\nfrom\n1\nwhole\nlemon\n2\ntablespoons\nfinely minced\nchives\n1\npound\n(\n450\ng\n) mixed mushrooms, such as cremini,\nshiitake\n, or oyster, sliced 1/4 inch thick\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\nKosher sea salt and freshly ground black pepper\n1\n(\n12-ounce\n)\nNew York strip steak\n, about 1 1/2 to 2 inches thick (see note)\n2\ncups\n(\n4\nounces\n;\n115\ng\n) shredded green or red (or a mixture)\ncabbage\nDirections\nPreheat broiler and set oven rack in highest position (closest to broiler element). In a small bowl, mix together the sour cream, lemon juice and chives. Set aside.\nIn a 12-inch cast iron skillet, toss mushrooms with olive oil until evenly coated. Season with salt. Broil, stirring occasionally, until they've released some of their juices and are beginning to dry, about 7 minutes.\nDry steak very well with paper towels. Season all over with salt. Push mushrooms to the sides of the pan and set steak in the clearing. Broil, without turning, until top side is browned and steak registers 125°F (52°C) for medium-rare or 135°F (57°C) for medium, about 8 minutes (time will vary depending on your broiler heat and the size of your steak).\nRemove steak from the skillet, season with black pepper, and let rest for a few minutes.\nToss cabbage with mushrooms; it should just slightly wilt from the heat but still retain some crunch. Season with salt, if necessary.\nTransfer mushrooms and cabbage to a platter. Slice steak and set on top. Serve with a dollop of the chive sour cream.\nSpecial equipment\n12-inch cast iron skillet\nNotes\nIf you have the time, you can season the steak all over with salt the night before and set it in the fridge on a wire rack set in a rimmed baking sheet to dry-brine and air-dry overnight (do not season the steak again before cooking if you do this); if not, simply proceed with the recipe as written.\nThis Recipe Appears In\nThe Broiling Days of Summer: Easy Strip Steak and Mushrooms\nStrip Steaks\nRoasted Beef\nCremini & Button Mushrooms\nOyster Mushroom\nQuick Dinners"
}