{
  "url": "https://www.seriouseats.com/broiled-clams-with-tomatoes-butter-and-tarragon",
  "image_url": "https://www.seriouseats.com/thmb/zyrZp0UalLUHgikvDCHrc0L33Dc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__08__20180726-MHT-broiling-tomato-clams-vicky-wasik-14--7c5f69acb2094ca280f25c379dad4366.jpg",
  "tags": [
    "Clams",
    "Butter",
    "Tarragon",
    "Tomato",
    "Seafood Mains"
  ],
  "title": "Broiled Clams With Tomatoes, Butter, and Tarragon Recipe",
  "full_text": "Broiled Clams With Tomatoes, Butter, and Tarragon Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n20 mins\nStanding Time\n25 mins\nTotal\n45 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher\nor\nsea salt\n1\ndozen\nlittleneck clams\n(about\n1\npound\n)\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n4\nmedium\ncloves garlic\n, thinly sliced\n8\nounces\n(\n225\ng\n)\ngrape\nor\ncherry tomatoes\n1/2\ncup\ndry white vermouth\n(\n120\nml\n)\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n1/4\ncup\ntarragon leaves\n(about\n5\ng\n)\nCrusty bread\n, for serving\nDirections\nFill a large bowl with cold water and stir in enough salt to make it salty like the sea. Add clams and let stand 20 minutes. Lift clams from water and discard purging water; if there is sand in the bottom of the bowl, rinse it out and repeat this process until clams no longer release sand into the water (usually 2 to 3 purging cycles).\nTurn on the broiler and position the top rack 4 to 6 inches from the broiler element. In a 9-inch cast iron pan, add olive oil and garlic. Broil for about 2 minutes, until garlic is slightly browned, but not burnt.\nAdd tomatoes and a large pinch of salt, tossing to coat. Broil until tomatoes have burst and some of their juices have spilled into the pan, about 4 minutes.\nAdd clams to the pan, nestling them between the tomatoes. Pour in vermouth and add butter in the center of the pan. Broil for 2 minutes, and then flip clams, baste with liquid and return to broiler until all clams have popped wide open, about 2 minutes longer (with an open-flame broiler, it's not impossible for the vermouth to briefly ignite; don't panic, just carefully blow out the flame and proceed). Broil for 1 additional minute after last clam opens, then remove from broiler. Baste clams once more.\nPour clams, tomatoes, and all of the juices into a deep serving bowl. Garnish with tarragon on top and let it stand for a 1 minute before eating so the anise-flavored herb has enough time to wilt and permeate the broth. Serve with crusty bread.\nSpecial Equipment\n10-inch cast iron skillet\nThis Recipe Appears In\nThe Broiling Days of Summer: Buttery Clams With Burst Tomatoes\nClams\nButter\nTarragon\nTomato\nSeafood Mains"
}