{
  "url": "https://www.seriouseats.com/brown-rice-congee-shiitake-garlic-chip-beef-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-eevvpXbXZLeTL7yDM-QfRqiNZ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__11__20141111-brown-rice-congee-with-beef-and-shiitake-shao-zhong-09-83d741cc23c648b89c17cbf8fd1876d7.jpg",
  "tags": [
    "Chinese",
    "Stovetop",
    "Ground Beef",
    "Brown Rice",
    "Garlic"
  ],
  "title": "Brown Rice Congee With Beef, Shiitake, and Garlic Chips Recipe",
  "full_text": "Brown Rice Congee With Beef, Shiitake, and Garlic Chips Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n40 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beef:\n1/2\npound\nground beef\n2\nteaspoons\ncornstarch\n2\nteaspoons\nsoy sauce\n2\nteaspoons\npeanut or\nvegetable oil\n1/2\nteaspoon\nsugar\n1/8\nteaspoon\nsalt\nFor the Garlic Chips:\n1\nhead\nof\ngarlic\n1/2\ncup\nolive oil\n1/2\nteaspoon\nsalt\nFor the Congee:\n6\ndried shiitake\nmushrooms\n1\ncup\nbrown rice\n(long grain or short grain)\n2\nteaspoons\nsoy sauce\n1/8\nteaspoon\nwhite pepper\nScallions\nand/or chives, chopped (optional)\nDirections\nFor the Beef:\nIn a large bowl, combine ground beef, cornstarch, soy sauce, oil, salt, and sugar. Mix well and set aside in the refrigerator.\nFor the Garlic Chips:\nPeel and thinly slice the cloves from a whole head of garlic. Add slices of garlic in a saucepan with olive oil. Turn the flame to medium-low and slowly fry the garlic until pale golden brown. Stir the garlic every few minutes, checking to make sure they are not burning. This should take about 15 minutes. When the garlic is done, drain through a fine mesh strainer set in a bowl. Transfer garlic to a small bowl and season with 1/2 teaspoon of salt. Mix and set aside. Reserve the garlic oil.\nSerious Eats / Shao Z.\nFor the Congee:\nRinse dried shiitake mushrooms under running water to remove grit. Place in a bowl and pour enough boiling water to cover the mushrooms. Soak the mushrooms in the hot water for at least 20 minutes. If you are rehydrating the mushrooms the day before, soak mushrooms in cold water overnight. Once the mushrooms are soft, rinse under running water again. Squeeze out any excess water, slice, and set aside.\nTo start the congee, rinse brown rice under running water. Drain and place in a pot. Add 5 cups of water to the pot, cover with a lid, and bring it to a boil. Once the water starts boiling, turn down the flame to a simmer and cover the pot. 15 minutes later, stir the rice making sure it’s not sticking to the bottom, and cover the pot again.\nSerious Eats / Shao Z.\nLet congee cook for 15 minutes longer, then stir one more time and add the sliced shiitakes. Cover the pot and simmer for 20 minutes.\nSerious Eats / Shao Z.\nAfter 20 minutes, add the ground beef in teaspoon-sized chunks with a chopstick or a spoon. Stir and cover the pot until beef is cooked, 5 to 10 minutes. When the congee is done, add 2 teaspoons of soy sauce, white pepper, and season with salt to taste.\nSerious Eats / Shao Z.\nTo serve the congee, spoon it into bowls, sprinkle chopped scallions, chives, and garlic chips on top. Drizzle garlic oil on top and serve hot.\nRead More\nCongee (Rice Porridge) With Pork and Crispy Shallots\nGround Pork and Corn Congee (Chinese Rice Porridge)\nDak Juk (Korean Chicken and Rice Porridge)\nBengali Rice Porridge With Lentils and Chicken\nCrispy Fried Garlic and Garlic Oil\nChinese\nStovetop\nGround Beef\nBrown Rice\nGarlic",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/brown-rice-congee-with-beef-shiitake-and-garlic-chips-recipe.webp?"
}