{
  "url": "https://www.seriouseats.com/brown-duck-stock-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-cFchv9Onv204r0SaOjy5Iuj8hE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200102-duck-vicky-wasik-Jus-1-d82c2a3c8dda4b55b3ddfdc3a230de6c.jpg",
  "tags": [
    "Duck"
  ],
  "title": "Brown Duck Stock Recipe",
  "full_text": "Brown Duck Stock Recipe\nClose\nJump to recipe\nPrep\n45 mins\nCook\n60 mins\nActive\n20 mins\nChill Time\n4 hrs\nTotal\n5 hrs 45 mins\nServes\n8 servings\nMakes\n2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\nBones\nfrom\nbreaking down\n2 to 3\nducks\n(\n2 to 3\npounds\n;\n900\ng\nto\n1.4\nkg\n), cut into 3- to 4-inch pieces\nVegetable oil\n, for coating\n1\nlarge\n(\n9\n-\nounce\n;\n255\ng\n)\nyellow onion\n, cut into 2-inch pieces\n2\ncarrots\n(\n4\nounces\n;\n115\ng\n), peeled and cut into 2-inch pieces\n2\ncelery\nribs\n(\n4\nounces\n;\n115\ng\n), cut into 2-inch pieces\n1\ncup\n(\n240\nml\n)\ndry red wine\n(optional)\n1\ntablespoon\n(\n15\nml\n)\ntomato paste\n2\nsprigs\nfresh thyme\n2\nsprigs\nfresh parsley\n2\nbay leaves\n1\nteaspoon\n(\n2\ng\n) whole black\npeppercorns\nDirections\nPreheat oven to 400°F (200°C) with rack set in middle position. In a large bowl, toss duck parts with oil until lightly coated on all sides. Then arrange in an even layer on a rimmed baking sheet or in a roasting pan; don't clean out bowl. Roast, turning bones once or twice, until beginning to turn golden brown, about 30 minutes.\nMeanwhile, toss onion, carrot, and celery with oil in now-empty bowl until lightly coated all over. When step 1 is complete, scatter vegetables over and around bones on baking sheet in as even a layer as possible. Continue to roast until bones and vegetables are well-browned, about 30 minutes longer. Set baking sheet aside on counter to cool slightly.\nTransfer bones and vegetables to a stockpot, and pour off any accumulated fat from the baking sheet (fat can be strained and reserved with other\nrendered duck fat\nif desired). Add wine (if using) and tomato paste to baking sheet, and use a wooden spoon or metal spatula to scrape up any browned bits. If not using wine, deglaze baking sheet with a cup of hot water instead. Pour off contents of baking sheet into the stockpot (see notes).\nAdd thyme, parsley, bay leaves, and peppercorns to stockpot. At this point, stockpot can be covered and refrigerated until you are ready to make stock (keep in mind that stock will simmer for about 3 hours). When ready to cook, add enough cold water to stockpot to cover bones and vegetables by 3 inches. Bring to a boil over medium-high heat, then reduce to simmer. Simmer, occasionally skimming off foam and fat that rises to surface with a ladle, until stock is well-flavored, deep reddish brown, and reduced by about a third, 2 1/2 to 3 hours.\nLet stock cool slightly, then strain through a fine-mesh strainer set over a large heatproof container; discard solids. Use immediately or cool to room temperature before covering and refrigerating or freezing. (When chilled, fat on the surface of stock will solidify, making it easy to remove with a spoon).\nSpecial Equipment\nRimmed baking sheet\n,\nstockpot\n,\nfine-mesh strainer\nNotes\nThis recipe is designed to use bones left over from breaking down whole ducks using the method outlined\nhere\n.\nWhile this recipe employs a traditional slow-cooking stovetop method, it can be easily adapted to a pressure cooker by following the method from our\npressure cooker brown chicken stock recipe\n.\nMake-Ahead and Storage\nDuck stock can be refrigerated in an airtight container for up to one week or frozen for up to six months.\nRead More\nHow to Get the Most Dang for Your Duck\nHow to Break Down Whole Ducks Like a Pro\nHow to Dry-Age Duck at Home\nDry-Aged Roast Duck Breast\nDuck",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/brown-duck-stock-recipe.webp?"
}