{
  "url": "https://www.seriouseats.com/brown-butter-rosemary-roasted-sweet-potatoes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/FXfXSVxQKFZxQnIYSOpMqLlINfw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__10__20161020-roasted-sweet-potato-variations-brown-butter-rosemary-vicky-wasik-6-489b923fd9624a3691c33fbe9789ffaf.jpg",
  "tags": [
    "Sweet Potatoes",
    "Gluten-free Sides",
    "Roasted Potatoes",
    "Thanksgiving Side Dishes"
  ],
  "title": "Brown Butter Rosemary Roasted Sweet Potatoes Recipe",
  "full_text": "Brown Butter Rosemary Roasted Sweet Potatoes Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n20 mins\nResting Time\n60 mins\nTotal\n2 hrs 5 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.4\nkg\n)\nsweet potatoes\n, peeled and cut into 1/2-inch chunks\n3\ntablespoons\n(\n45\nml\n)\nvegetable\nor\ncanola oil\nKosher salt\nand freshly\nground black pepper\n1/2\npacket\nunflavored gelatin\n(about\n1 1/4\nteaspoons\n;\n4\ng\n)\n1/4\ncup\n(\n60\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n1\nstick\nunsalted butter\n(\n8\ntablespoons\n;\n115\ng\n)\n3\nrosemary\nsprigs\n1\nteaspoon\n(\n5\nml\n)\nfresh juice\nfrom\n1\nlemon\nDirections\nPlace sweet potatoes in a large saucepan and cover with cold water. Heat water to 160°F (70°C) as registered on an instant-read thermometer. Cover and set aside for 1 hour.\nAdjust oven racks to upper-middle and lower-middle positions and preheat oven to 400°F (200°C). Drain sweet potatoes and transfer to a large bowl. Toss with oil and season to taste with salt and pepper. Spread sweet potatoes on 2 rimmed baking sheets and roast until bottom sides are browned, about 30 minutes. Carefully flip potatoes with a thin spatula and roast until second side is browned and potatoes are tender, about 20 minutes longer.\nMeanwhile, in a small container, sprinkle gelatin over chicken stock and let bloom for 5 minutes. Microwave until gelatin is dissolved, stopping and stirring as needed to help it dissolve, about 2 minutes.\nIn a small saucepan, melt butter over medium-high heat until foamy. Continue to cook, swirling pan, until milk solids in butter turn a deep hazelnut brown, 1 to 2 minutes. Remove from heat and add rosemary (don't be alarmed; butter will foam and fizzle when rosemary is added), swirling to coat.\nAdd chicken stock to butter, return to medium heat, and bring to a simmer. Cook, swirling, until stock reduces slightly and sauce becomes rich and silky, about 3 minutes. Remove from heat, discard rosemary, and add lemon juice. Season with salt.\nIn a mixing bowl, toss potatoes with butter sauce and serve. Potatoes can be made in advance, tossed with sauce, and set aside until ready to serve; rewarm in the oven before serving.\nSpecial Equipment\nRimmed baking sheets\n,\ninstant-read thermometer\nRead More\nThe Best Roasted Sweet Potatoes\nMiso-Scallion Roasted Sweet Potatoes\nSmoky Spiced-Pecan Roasted Sweet Potatoes\nThe Best Way to Cook Whole Sweet Potatoes\nA Field Guide to Sweet Potato Types (and the Dirt on Yams)\nSweet Potatoes\nGluten-free Sides\nRoasted Potatoes\nThanksgiving Side Dishes"
}