{
  "url": "https://www.seriouseats.com/buckeye-brownies-recipe-8705868",
  "image_url": "https://www.seriouseats.com/thmb/alPS9IE7RmPHThLZlthDnwG6ssk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240820_SEA_Buckeye-Brownies_Glaze_HERO_50-78d67853a8334fc3a4addf8f76692109.jpg",
  "tags": [
    "Dessert Bars",
    "The Latest",
    "Chocolate"
  ],
  "title": "Buckeye Brownies",
  "full_text": "Buckeye Brownies\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nCooling Time\n2 hrs 30 mins\nTotal\n3 hrs 30 mins\nServes\n10\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Brownies:\nCooking\ns\np\nray\n2 sticks\nunsalted butter\n(226g;\n1\ncup)\n7 ounces\ngranulated sugar\n(198g;\n1\ncup)\n5 1/4 ounces packed\nlight brown suga\nr (148g;\n3/4\ncup\n)\n7 ounces bittersweet (70 to 75%)\ndark chocolate,\nchopped (200g; abou\nt 1 1/4\ncups\n), divided\n2 1/2 ounces Dutch-processed\ncocoa powder\n(70g; about\n2/3\ncup)\n3 tablespoons\n(45\nml\n) strong\nbrewed coffee\n1 tablespoon (\n15\nml)\nvanilla extract\n1 1/4\nteaspoon\nkosher salt;\nfor table salt use half as much by volume\n3\nlarge\neggs,\nroom temperature\n4 1/2 ounces\nall-purpose flour (\n127g\n; 1\ncup)\nFor the Peanut Butter Filling:\n2\nsticks\nunsalted butter\n(226g; 1 cup), at room temperature\n1 cup\ncreamy peanut butter\n(\n9 1/2\nounces;\n269g), (see notes)\n10\nounces\nconfectioners' sugar\n(283g; 2 1/2 cups)\n2\ntablespoons\n(30ml)\nheavy whipping cream\n1 1/2\nteaspoon\nvanilla extract\n1/2\nteaspoon\nkosher salt\nFor the Chocolate Ganache:\n4 1/2\nounces\nbittersweet (72% dark)\nchocolate, c\nhopped (127g; about 3/4 cup)\n1/2\ncup\n(120ml) heavy\nwhipping cream\n1/2\ntablespoon\nunsalted butter\n1/4\nteaspoon\nkosher salt\n; for table salt, use half as much by volume\nFlaky\nsea salt\nfor s\nprinkling\nDirections\nFor the Brownies:\nAdjust oven rack to middle position and preheat oven to 350°F. Coat a 13- x 9-inch metal baking pan (at least 2 inches deep) with cooking spray. Line with parchment paper, leaving at least 2 inches overhang on two opposite sides to remove brownies from pan. Spray parchment paper with cooking spray. Set pan aside.\nSerious Eats / Morgan Hunt Glaze\nIn a medium saucepan, melt butter over medium-low heat. Once melted, whisk in granulated sugar and brown sugar until smooth, about 1 minute. Remove from heat and whisk in 1 cup of the chopped chocolate until melted, about 30 seconds. Whisk in cocoa powder, coffee, vanilla, and salt. Let mixture cool for 5 minutes. Working quickly to avoid cooking eggs, add one egg at a time to the chocolate mixture and whisk vigorously after each addition until incorporated. Add flour and 1/4 cup of the remaining chopped chocolate, folding until just combined.\nSerious Eats / Morgan Hunt Glaze\nPour brownie mixture into the prepared baking pan, and spread into an even layer. Bake until slightly risen and the top appears somewhat shiny, 30 to 35 minutes.\nSerious Eats / Morgan Hunt Glaze\nRemove from oven, and place pan on a wire rack to cool completely, about 1 1/2 hours.\nSerious Eats / Morgan Hunt Glaze\nFor the Peanut Butter Filling:\nIn a large bowl with an electric mixer or in a stand mixer with the whisk attachment, beat butter on medium-high speed until creamy, about 1 minute. Add peanut butter, and beat until light and creamy, about 1 more minute. Gradually add the powdered sugar, 1/2 cup at a time, and beat until fully incorporated, about 2 minutes, stopping to scrape down sides of bowl as needed. Add heavy cream, vanilla, and salt; beat until combined, about 30 seconds. Dollop peanut butter mixture over cooled brownies, and spread into an even layer. Refrigerate, uncovered, while preparing the chocolate ganache.\nSerious Eats / Morgan Hunt Glaze\nFor the Chocolate Ganache:\nIn a small heatproof bowl, add chopped chocolate and set aside. In a microwave-safe liquid measuring cup or bowl, microwave cream until hot, but not simmering, 30 to 60 seconds. Add butter to cream, and stir until melted. Pour cream mixture over chocolate in bowl, and let sit for 1 minute. Add kosher salt, and stir until smooth and all chocolate is melted. Remove brownies from refrigerator, and pour the ganache over the peanut butter filling. Use an offset spatula to spread into an even layer. Refrigerate again until chocolate ganache is firm and set, about 1 hour.\nSerious Eats / Morgan Hunt Glaze\nRun a sharp knife around the edges of brownies (inside the parchment) to release from the pan. Use the parchment sling handles to remove the brownies from the pan and place on a cutting board. Sprinkle evenly with flaky sea salt. Cut into squares, and serve.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\n13- x 9-inch metal baking pan, medium saucepan, electric mixer or stand-mixer with whisk attachment\nNotes\nIf using salted peanut butter, use half the amount of salt in the brownie batter.\nMake-Ahead and Storage\nThe peanut butter filling can be made in advance and stored at room temperature in an airtight container for up to 2 days.\nThe assembled brownies can be stored at room temperature, covered, for up to 2 days.\nDessert Bars\nThe Latest\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/buckeye-brownies.webp?"
}