{
  "url": "https://www.seriouseats.com/buffalo-chicken-paratha-recipe-8784061",
  "image_url": "https://www.seriouseats.com/thmb/mriifcZRV6zYVCsbI4vQ5DZSVTs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250131-BuffaloChickenandCheesePartha-KanikaandJatinSharma-00_23-700079cc45ff472b8266f95b95277892.jpg",
  "tags": [
    "Chicken",
    "The Latest",
    "Chicken Breast",
    "Mozzarella",
    "Super Bowl"
  ],
  "title": "Buffalo Chicken and Cheese Paratha",
  "full_text": "Buffalo Chicken and Cheese Paratha\nClose\nJump to recipe\nPrep\n45 mins\nCook\n30 mins\nTotal\n75 mins\nServes\n6\nMakes\n6 parathas\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Parathas:\n3\ncups\natta\n(\n13 1/2\nounces;\n384\ng\n), plus more for dusting (see notes)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n1\ncup\n(\n240\nml\n)\nwater\n, at about 98 to 110ºF (37 to 43ºC)\n2\ncooked\nboneless\nchicken breasts\n(\n18\nounces\n;\n510\ng\ntotal)\n6\nounces\n(\n170\ng\n)\ncream cheese\n, at room temperature\n1/4\ncup\n(\n60\nml\n)\nBuffalo sauce\n, such as Frank’s Red Hot\n1\nteaspoon\ngarlic powder\n1\ncup\npart-skim low-moisture\nshredded mozzarella\n(\n4 1/2\nounces\n;\n128\ng\n)\n1/4\ncup\nghee\n, divided (\n1 1/2\nounces\n;\n44\ng\n)\nFor Serving:\nAchaar\nDahi\nRanch dressing\n,\nhomemade\nor store-bought\nDirections\nIn a medium bowl, add atta. Make a well in the center of the flour. Pour salt and vegetable oil into the well. Slowly pour lukewarm water into the well. Gradually incorporate flour and salt into the oil and water until a shaggy dough forms. (If dough is too dry, add water, 1 tablespoon at a time, until it forms a shaggy dough.) Knead until a smooth dough forms, about 3 minutes; it should be soft and pillowy. Transfer the dough to a zip-top bag, seal, and let rest at room temperature for 30 minutes.\nSerious Eats / Kanika and Jatin Sharma\nUsing your hands or two forks, finely shred chicken breasts into 1/4-inch pieces. Alternatively, you can use a stand or a hand mixer fitted with the paddle attachment to shred chicken breasts: Place chicken breasts in a stand mixer bowl or large bowl, then paddle until finely shredded, about 1 minute. (Smaller pieces of chicken prevent the paratha from tearing through the dough when rolling.)\nSerious Eats / Kanika and Jatin Sharma\nIn a medium bowl, whisk cream cheese, Buffalo sauce, and garlic powder until smooth. Add mozzarella and shredded chicken breasts and, using a flexible spatula, fold until mixture is uniform.\nSerious Eats / Kanika and Jatin Sharma\nOn a lightly floured surface, roll and shape dough out into a 12 inch–long log about 2 inches wide. Using a bench scraper or sharp knife, portion dough into 6 pieces, each weighing about 83g or 3 ounces. Cup each piece of dough in your hand and, quickly gliding the dough in a circular motion, roll dough until it forms a tight ball. Cover dough ball with a damp towel and repeat with remaining dough.\nSerious Eats / Kanika and Jatin Sharma\nWorking with 1 dough ball at time, use a rolling pin to shape into a 6-inch round, rolling from the center outward and lightly increasing pressure toward the edges so edges are slightly thinner than the middle. (Dough should be soft and pliant; if it recoils while rolling, let it rest for 5 minutes before continuing.) Place 1/2 cup Buffalo chicken mixture (about 4 1/4 ounces; 120g) in a rounded mound in the center, leaving a 1-inch border around the edges.\nSerious Eats / Kanika and Jatin Sharma\nGently bring edges of dough over filling; pleat edges of dough repeatedly, pinching the edge closed after each pleat until the entire paratha is sealed in a cinched purse shape. Pinch and twist top to seal, gently pressing down the top to flatten slightly.\nSerious Eats / Kanika and Jatin Sharma\nOn a lightly floured surface, roll out stuffed dough into a 9-inch circle.\nSerious Eats / Kanika and Jatin Sharma\nRepeat with remaining dough and filling. Stack uncooked parathas on a large plate dusting well with atta or all-purpose flour in between each to prevent them from sticking to one another.\nSerious Eats / Kanika and Jatin Sharma\nHeat a griddle or 12-inch cast iron skillet over medium heat; a drop of water should evaporate immediately when placed in the pan. Place 1 paratha onto griddle or skillet until it begins to puff, about 1 minute. Flip the paratha and, using a pastry brush, spread 1 teaspoon ghee on top. Cook for 1 minute more, flip, then brush other side of paratha with 1 teaspoon ghee. Cook for 1 minute more per side before transferring to a plate. Repeat with remaining parathas. Serve warm with ranch dressing.\nSerious Eats / Kanika and Jatin Sharma\nSpecial Equipment\nZip-top bag, rolling pin, griddle or cast iron skillet, pastry brush\nNotes\nAtta, a type of finely milled whole-wheat flour from India that's typically ground in stone mills called chakki, can easily be found  at Indian grocery stores and can also be purchased online. If you can’t find atta, you can use two parts whole-wheat flour to one part all-purpose flour to create a blend with a similar texture.\nMake-Ahead and Storage\nThe paratha dough and filling can be made up to 2 days in advance and refrigerated. Stuffed parathas should not be made ahead of time and refrigerated, as the filling can make the dough too moist.\nStuffed and rolled out parathas can be laid out on a parchment-lined baking sheet and frozen; when completely frozen, transfer parathas to a zip-top bag. Frozen parathas can be frozen in an airtight zip-top bag for up to 3 months. Alternatively, stuffed parathas can also be stacked and frozen; keep parathas separate with a layer of parchment paper between each. Frozen parathas can be cooked directly on the pan without thawing.\nChicken\nThe Latest\nChicken Breast\nMozzarella\nSuper Bowl",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/buffalo-chicken-and-cheese-paratha.webp?"
}