{
  "url": "https://www.seriouseats.com/buko-pandan-recipe-5223515",
  "image_url": "https://www.seriouseats.com/thmb/op-zI1hls1U17Qp9GJS-i0Pk6vw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220314-buko-pandan-rezel-kealoha-25-dc47444de5b94f54b9a0c225449717c9.jpg",
  "tags": [
    "Filipino",
    "Desserts",
    "Coconut",
    "The Latest"
  ],
  "title": "Buko Pandan (Filipino Dessert Salad With Coconut and Pandan)",
  "full_text": "Buko Pandan (Filipino Dessert Salad With Coconut and Pandan)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nCooling and Chilling Time\n4 hrs 45 mins\nTotal\n5 hrs 5 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Jelly:\n2\ncups\n(\n475\nml\n)\nunsweetened coconut water\n, divided (see note)\n1/2\nounce\nunflavored gelatin powder\n(about\n4 1/2\nteaspoons\n;\n14\ng\n), such as Knox\n1\nteaspoon\n(\n5\nml\n)\nbuko pandan extract\n(see note)\n1\ntablespoon\n(\n15\ng\n)\nlight brown sugar\nFor the Buko Pandan:\n2\nounces\n(\n60\nml\n)\nunsweetened coconut cream\n, such as Kara\n2\nounces\n(\n60\nml\n)\nsweetened condensed coconut milk\n(see note)\n1\n(12-ounce; 340 g) bottle\nnata de coco\n, rinsed (see note)\n1\n(12-ounce; 340g) bottle\nmacapuno\n(see note)\n2\ntablespoons\n(\n25\ng\n)\npinipig\n(see note)\nDirections\nFor the Jelly:\nPour 1/2 cup coconut water into a medium heatproof bowl and evenly sprinkle gelatin over surface. Set aside.\nSerious Eats / Rezel Kealoha\nIn a small saucepan, bring remaining 1 1/2 cups coconut water to a boil over high heat. Add extract and brown sugar and whisk until sugar is completely dissolved.\nSerious Eats / Rezel Kealoha\nAdd coconut water mixture to gelatin mixture and whisk until gelatin is fully dissolved.\nSerious Eats / Rezel Kealoha\nTransfer mixture to an 8-inch square glass baking dish and let cool at room temperature for 45 minutes. Cover and refrigerate until fully set, at least 3 hours. Using a sharp knife, portion jelly into 64 1-inch squares and refrigerate until ready to use.\nSerious Eats / Rezel Kealoha\nFor the Buko Pandan:\nIn a large bowl, whisk together coconut cream and condensed coconut milk until well combined. Add nata de coco, macapuno, and jelly squares. Using a flexible spatula, gently fold ingredients together, taking care to avoid breaking up the jelly squares. Cover and refrigerate until cold, about 1 hour.\nSerious Eats / Rezel Kealoha\nMeanwhile, in a small stainless-steel skillet, toast pinipig over medium heat, stirring and swirling frequently, until puffed and golden brown, about 3 minutes. Transfer to small bowl and set aside.\nSerious Eats / Rezel Kealoha\nTransfer buko pandan to individual serving bowls, garnish with toasted pinipig, and serve.\nSerious Eats / Rezel Kealoha\nSpecial Equipment\n8-inch square glass baking dish\n.\nNotes\nFor the unsweetened coconut water, you can use frozen coconut water, found in Filipino and Asian markets in the frozen aisle; just thaw in the refrigerator overnight before using. If you’re unable to source frozen coconut water, substitute with other unsweetened coconut water such as Harmless Harvest organic coconut water.\nBuko pandan extract can be found in Asian markets or online.\nCondensed coconut milk is a non-dairy alternative option for conventional sweetened condensed milk. It can be found in Asian markets, at specialty markets such as Whole Foods, and online.\nNata de coco, or coconut gel, is made from fermented coconut water and possesses a chewy, gelatinous texture. It can be found in Filipino and Asian markets, or online.\nMacapuno, or coconut sport strings, are preserved young coconut strips made from a variety of coconut that has soft, jelly-like flesh and contains very little water. It's sweeter than other kinds of coconut and is commonly used in Filipino desserts. Macapuno can be found in Filipino and Asian markets, or online.\nPinipig, or pounded young rice, can be found in most Asian and Filipino markets and online.\nMake-Ahead and Storage\nThe jelly can be made in advance and refrigerated in an airtight container for up to 1 week.\nBuko pandan can be refrigerated in an airtight container for up to 1 week.\nFilipino\nDesserts\nCoconut\nThe Latest"
}