{
  "url": "https://www.seriouseats.com/bulalo-bone-marrow-soup-5208528",
  "image_url": "https://www.seriouseats.com/thmb/3GEAyIkABnSP-Bo-H0QGgGF-kP8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/BulaloHero_1-c12e9d20fd6546bba9b5eeee259dfce3.jpg",
  "tags": [
    "Filipino",
    "Stovetop Beef",
    "Beef Mains",
    "Beef",
    "The Latest"
  ],
  "title": "Bulalo (Bone Marrow Soup)",
  "full_text": "Bulalo (Bone Marrow Soup)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n4 hrs 21 mins\nSoaking and Cooling Time\n75 mins\nTotal\n5 hrs 56 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5\npounds\n(\n2.3\nkg\n)\nbeef marrow bones\n, cut crosswise into 2-inch pieces (see note)\n2\nbone-in\nbeef\nshanks\n(about\n2 1/2\npounds\n)\nKosher salt\nand\nfreshly ground black pepper\n2\nears\nsweet corn\n, shucked\n4\ntablespoons\n(\n75\nml\n) canola or other neutral\noil\n, divided\n2\nmedium\ngarlic cloves\n, minced\n1/2\nmedium\nred onion\n(\n4\nounces\n;\n115\ng\n), cut into 1/8-inch-thick slices (reserve trimmings)\n1/2\nmedium\nNapa cabbage\n(\n1\npound\n;\n450\ng\n), cut into 3-inch-thick slices (reserve trimmings)\n2\nscallions\n, ends trimmed and sliced thinly on a bias, for garnish (reserve trimmings)\n1\npound\n(\n450\ng\n)\nbeef tendons\n, rinsed and patted dry with paper towels (optional)\n1\npound\n(\n450\ng\n)\nbeef knuckles\n, rinsed and patted dry with paper towels (optional)\nFish sauce\n1\npound\n(\n450\ng\n)\nyellow fingerling potatoes\n(about\n5 to 7\npotatoes\n), scrubbed and cut into 2-inch pieces\nCooked white rice\n, for serving\nDirections\nRinse marrow bones and beef shanks under cold running water. Transfer to a large bowl, cover with cold water, and let soak for 1 hour. Rinse, pat dry with paper towels, season with salt and pepper, and set aside.\nRezel Kealoha\nMeanwhile, adjust oven rack to middle position and preheat to 425°F (218°C). In a medium bowl, toss corn with 1 tablespoon (15ml) oil. Place on rimmed baking sheet and roast, rotating corn after 15 minutes, until corn is tender and lightly browned, about 30 minutes total. Set aside until cool enough to handle, about 15 minutes.\nRezel Kealoha\nTo remove kernels from the cobs, place a large bowl on your work surface and invert a small bowl within the large bowl (this serves as a base on which to rest the corncob). Working with one at a time, place one end of a cob on the inverted, smaller bowl. Using a chef's knife, slice downward, as close to the base of the kernels as possible while taking care not to angle the blade into the cob itself. Rotate the ear of corn, and continue until all the kernels have been removed. Repeat with remaining ear of corn. Set aside; reserve cobs.\nRezel Kealoha\nIn a Dutch oven or stockpot, heat 1 tablespoon (15ml) oil over high heat until shimmering. Using tongs, add shanks and cook, turning occasionally, until well browned on all sides, about 5 minutes. Transfer to plate; set aside. Add garlic and onions to stockpot. Cook, stirring frequently, until garlic is golden brown and onions are translucent, about 3 minutes. Scrape onto plate with shanks.\nRezel Kealoha\nAdd reserved corn cobs and reserved onion, cabbage, and scallion trimmings to stockpot and cover with water. Bring to a boil over high heat and cook for 10 minutes. Lower heat to maintain a simmer and continue to cook for 30 minutes. Using a spider skimmer, remove cobs and trimmings, and discard.\nRezel Kealoha\nAdd reserved shanks, garlic and onion, beef tendons (if using), and beef knuckles (if using) to stockpot (be sure to check the water level; if the shanks, tendons, and knuckles are not fully covered, add water as needed). Bring to a boil over high heat and cook for 30 minutes. Lower heat to maintain a simmer, partially cover with lid, and continue to cook until tender, about 1 1/2 hours. Add cabbage, cover, and cook until cabbage is tender, about 10 minutes. Stir in fish sauce, 1 tablespoon at a time, until sufficiently seasoned.\nRezel Kealoha\nMeanwhile, line two rimmed baking sheets with aluminum foil. In a large bowl, toss potatoes with remaining 2 tablespoons (30ml) oil, then season with salt and pepper. Transfer to a prepared baking sheet. Roast potatoes until crispy on the outside and fork-tender on the inside, about 20 minutes.\nRezel Kealoha\nPlace marrow bones on second prepared baking sheet. Roast marrow bones until crisp, brown on the edges, and marrow is soft and pulling away from the bone, about 20 minutes.\nRezel Kealoha\nTo serve, divide marrow bones, shank, tendons, and knuckles between soup bowls. Top with cabbage, potatoes, and corn. Ladle broth on top, garnish with scallions, and serve hot with white rice.\nRezel Kealoha\nSpecial Equipment\nLarge\nDutch oven\nor stockpot, spider skimmer, rimmed baking sheets.\nNotes\nIf your marrow bones don't come pre-cut, ask the butcher to cut them for you.\nIf you have a stovetop pressure cooker or electric multicooker (such as an Instant Pot), you can use it in place of the Dutch oven or stockpot. To do that, sear the shank first, then add tendons (if using), knuckles (if using), and vegetable trimmings, and cover with water. Cook at high pressure for 1 hour. Once the pressure is released, add the cabbage, cover, and cook until the cabbage is tender, about 10 minutes. Proceed with the recipe as directed.\nYou can use\nbeef stock\ninstead of water for a more flavorful soup.\nMake-Ahead and Storage\nBulalo can be refrigerated in an airtight container for up to 1 week and frozen for up to 6 months.\nFilipino\nStovetop Beef\nBeef Mains\nBeef\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bulalo-bone-marrow-soup.webp?"
}