{
  "url": "https://www.seriouseats.com/bun-cha-hanoi-recipe-8421208",
  "image_url": "https://www.seriouseats.com/thmb/J0g7JWjk9r6CHESo1CIrD1BfGd0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-VyTran-BunChaHanoi-19-f623913c6ef34a9185bcd6e5680c545f.jpg",
  "tags": [
    "The Latest",
    "Noodle Mains",
    "Pork Belly",
    "Vietnamese",
    "Grilled Pork"
  ],
  "title": "Bún Chả Hanoi",
  "full_text": "Bún Chả Hanoi\nClose\nJump to recipe\nPrep\n20 mins\nCook\n35 mins\nChilling and Marinating Time\n6 hrs\nTotal\n6 hrs 55 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork Patties:\n1 1/4\npounds\n(567\ng)\nground pork\n, 20 percent fat\n1\nsmall\nshallot\n(\n35\ng\n), finely chopped (about\n2\ntablespoons\n)\n5\nmedium\ncloves (\n25\ng\n)\ngarlic\n, minced (\n2\ntablespoons\n)\n3\ntablespoons\n(\n37\ng\n)\ngranulated sugar\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n(see note)\n1\nteaspoon\nfreshly\nground black pepper\nVegetable or other\nneutral oil,\nfor brushing\nFor the Pork Belly:\n1\npound\n(\n456\ng\n) skin-on\npork belly\n, frozen for 45 to 50 minutes\n2\ntablespoons\n(\n30\nml\n) hot\nwater\n2\ntablespoons\ngranulated sugar\n(\n1\nounce\n;\n28\ng\n)\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n(see note)\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\nor other neutral oil\n2\nscallions\n, white and green parts, thinly sliced\n1\nsmall\nshallot\n(about\n35\ng\n), roughly chopped (\n2\ntablespoons\n)\n2\nmedium\n(\n10\ng\n)\ncloves garlic\n, roughly chopped\n1/2\nteaspoon\nfreshly\nground black pepper\nFor the Pickled Carrot and Kohlrabi:\n1/2\ncup\n(\n120\nml\n)\nwater\n1/4\ncup\n(\n60\nml\n)\nrice vinegar\n1/4\ncup\n(\n60\nml\n)\nsugar\n1\nsmall\ncarrot\n(\n59\ng\n), peeled and thinly sliced (\n1/2\ncup\n)\n1\nsmall\nkohlrabi\n(\n68\ng\n), thinly sliced, then cut into small pieces (\n1/2\ncup\n), see note\nFor the Dipping Sauce:\n4\ncups\n(\n960\nml\n)\nwater\n3/4\ncup\ngranulated sugar\n(\n5.25\nounces\n;\n150\ng\n)\n1/2\ncup\n(\n120\nml\n)\nfish sauce\n(see note)\nFor Serving:\n8\nounces\n(\n227\ng\n)\nuncooked rice vermicelli noodles\n(see note)\n1\nhead\nbutter lettuce\n, leaves picked and washed\n1\nbunch\nThai basil\n(húng quế), leaves picked\n1\nbunch\nVietnamese\ncoriander\n(rau răm), leaves picked\n1\nbunch\nperilla\n(tiá tô), leaves picked\n1\nbunch\npeppermint\n(húng lủi), leaves picked\n1\nbunch\nfish mint\n(dấp cá), leaves picked\n8\ncloves\n(\n40\ng\n)\ngarlic\n, chopped (about\n1/4\ncup\n)\n2\nbird’s eye\nchiles\n, thinly sliced\nDirections\nFor the Pork Patties\n: In a large bowl, combine ground pork, shallots, garlic, sugar, fish sauce, and pepper and mix well. Cover bowl and refrigerate mixture for at least 4 and up to 24 hours.\nSerious Eats / Vy Tran\nFor the Pork Belly:\nUsing a very sharp knife, slice semi-frozen pork belly into 2-inch-long, 1/4-inch-thick slices.\nSerious Eats / Vy Tran\nIn another large bowl, combine hot water and sugar and stir until sugar has dissolved. Add fish sauce, vegetable oil, scallions, shallot, garlic, and pepper and whisk to combine. Add pork belly slices and toss well to coat. Cover bowl and refrigerate for at least 4 and up to 24 hours.\nSerious Eats / Vy Tran\nFor the Pickled Carrot and Kohlrabi:\nIn small bowl, stir water, rice vinegar, and sugar until sugar has dissolved. Add sliced carrot and kohlrabi and let sit at room temperature until pickled, 2 hours.\nSerious Eats / Vy Tran\nFor the Dipping Sauce:\nIn a small saucepan, combine water, sugar, and fish sauce. Bring to a boil over medium-high heat, stirring until the sugar has dissolved, then boil for 5 minutes. Keep hot. (If making ahead of time, reheat before serving.)\nSerious Eats / Vy Tran\nTo Grill the Meats:\nWhen ready to grill, remove pork mixture and pork belly from fridge. Weigh out about 2 ounces of pork mixture for each patty. Using oiled hands, form pork mixture into small patties, about 2 1/2 inches in diameter and 1/2 inch thick. Place formed patties on baking sheet lined with aluminum foil or parchment paper.\nSerious Eats / Vy Tran\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of grill. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, turn on all the burners of a gas grill to high, close grill, and preheat for 5 minutes. Clean and oil the grill grate.\nSerious Eats / Vy Tran\nBrush both sides of pork patties with vegetable oil. Transfer 6 pork patties to a metal grilling basket. Grill over direct heat, turning every minute, until cooked through and browned on the outside, about 8 minutes. Transfer cooked patties to a platter or baking sheet. Repeat with remaining pork patties. Keep warm.\nSerious Eats / Vy Tran\nTransfer pork belly slices to now-empty grilling basket. Grill over direct heat, turning every minute until cooked through and browned, 5 to 6 minutes. Transfer to the platter with the patties. Repeat with remaining pork belly slices. Keep warm.\nSerious Eats / Vy Tran\nFor Serving:\nCook the noodles according to the package instructions. Drain and run under cold water. Drain again and set aside.\nSerious Eats / Vy Tran\nPlace the noodles, lettuce, and herbs on a platter. Place the garlic and sliced bird’s eye chiles in separate small bowls.\nSerious Eats / Vy Tran\nDivide grilled pork patties and pork belly slices into 4 bowls. Add pickled vegetables. Ladle about 1 cup of hot dipping sauce into each bowl. Serve immediately with noodles, fresh herbs,raw garlic, and bird’s eye chiles alongside.\nSerious Eats / Vy Tran\nSpecial Equipment\nGrilling basket\nNotes\nMake sure to use a traditionally made fish sauce; I prefer Red Boat brand.\nFor the rice vermicelli, Three Ladies is a good brand.\nGreen papaya makes a great substitute for kohlrabi.\nThe listed fresh herbs are available at most Asian grocery stores or well stocked markets. Any combination of the listed fresh herbs that are available to you will work in this recipe. Cilantro may be substituted for the Vietnamese coriander (rau răm).\nMake-Ahead and Storage\nThe vermicelli rice noodles can be prepared a few hours before assembling the bowl.\nThe meat can be marinated the night before.\nThe dipping sauce can be made the day before and warmed up when ready to use.\nThe pickled carrot and kohlrabi can be made up to 48 hours ahead. Refrigerate them until ready to use.\nThe Latest\nNoodle Mains\nPork Belly\nVietnamese\nGrilled Pork"
}