{
  "url": "https://www.seriouseats.com/bun-bo-hue-vietnamese-spicy-beef-noodle-soup-recipe-7972276",
  "image_url": "https://www.seriouseats.com/thmb/AeLQd8S4Z-X9nMKoeJ8A3XYL6PU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230915-SEA-BunBoHue-Vy-Tran-hero-d3a9082377414ca68f3540ceae84fa61.jpg",
  "tags": [
    "The Latest",
    "Noodle Mains",
    "Soups",
    "Rice Noodles",
    "Vietnamese"
  ],
  "title": "Bún Bò Huê (Vietnamese Spicy Beef Noodle Soup)",
  "full_text": "Bún Bò Huê (Vietnamese Spicy Beef Noodle Soup)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n4 hrs\nSoaking and Cooling Time\n60 mins\nTotal\n5 hrs 15 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n2\npounds\n(\n905\ng\n) boneless\nbeef shanks\n2\npounds\n(\n905\ng\n) meaty beef bones, such as neck bones or\noxtails\n1 1/2\npounds\n(\n680\ng\n) fresh (un-smoked)\nham hocks\n, cut into 1- to 2-inch-thick rounds\n2\ntablespoons\n(\n30\nml\n) neutral oil, such as vegetable, canola, or\ngrapeseed\n1\nteaspoon\nannatto seeds\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n225\ng\n), halved through root end\n2\nstalks\nlemongrass\n, cut into roughly 5-inch lengths, then halved lengthwise and lightly crushed with the blunt side of a knife\n1\nteaspoon\nred pepper flakes\n4\nmakrut lime leaves\n1/4\ncup\n(\n36\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n1/4\ncup\n(\n50\ng\n)\nsugar\n, plus more if desired\n1/3\ncup\n(\n80\nml\n)\nfish sauce\n, plus more if desired\n1\nteaspoon\nMSG\n(optional)\n1/3\nof a peeled\nfresh pineapple\n1/4\ncup\n(\n70\ng\n)\nshrimp paste\n, such as Lee Kum Kee, plus more for serving\nFor Serving:\n1\n(2-pound; 905 g) package\nbun bo hue\nrice noodles\n, cooked according to package instructions, then rinsed with cold water\n1\npound\n(\n455\ng\n) cooked coagulated\npork blood\ncake, sliced 1/2 inch thick\n1\npound\n(\n455\ng\n) Vietnamese steamed\nham\n(also called cha hue or cha lua), sliced 1/4 inch thick\n1\nbunch\nscallions\n(about\n5 to 6\nmedium\nscallions\n), white and green parts, thinly sliced\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n225\ng\n), thinly sliced\n1\nbunch\nfresh cilantro\nleaves and tender stems, chopped\n1\nbunch\nfresh mint\nsprigs\n1\nfresh\nbanana\nblossom\n, thinly sliced crosswise and held in water with a splash of white vinegar, or\n1/2\nhead\ngreen cabbage\n, shredded\n2\npounds\n(\n905\ng\n)\nbean sprouts\n2 to 3\njalapeños\n, bird's eye, or other hot green chiles, stemmed and thinly sliced\n8\nlime\nwedges\nDirections\nFor the broth:\nIn a stockpot, add beef shanks, beef bones, and ham hocks, and add enough water to cover by 1 inch. Let soak at room temperature for 30 minutes to draw out any blood. Drain, rinse, then return meat and bones to the same pot. Add fresh water to cover by 1 inch, then bring to a rolling boil over high heat. Cook for 10 minutes (there should be foam and cloudy proteins that float to the top.) Drain and rinse meat and bones well, transfer to a large bowl, and set aside.\nSerious Eats / Vy Tran\nIn the same large pot, heat oil and annatto seeds over medium-high heat, stirring occasionally, until oil becomes bright red, about 3 minutes. Using a slotted spoon, remove and discard seeds. Add onion, lemongrass, and chile flakes to the annatto oil and cook, stirring often until fragrant, about 30 seconds.\nSerious Eats / Vy Tran\nAdd lime leaves, salt, sugar, fish sauce, MSG (if using), and pineapple (if using), along with prepared meat and bones and 5 quarts (4.7L) water. Bring to a boil, reduce heat to maintain a simmer, and cook until ham hocks are fork-tender but not falling off the bone, about 1 hour. Transfer ham hocks to a large bowl, let cool slightly, then cover and refrigerate.\nSerious Eats / Vy Tran\nContinue to cook broth until beef shank is fork-tender, 2 to 4 hours longer. Remove beef shank, transfer to cutting board, let stand until cool enough to handle, then slice beef shank 1/4 inch thick and set aside. Strain broth, discard solids, then return broth to pot.\nSerious Eats / Vy Tran\nMeanwhile, in a small pot, combine shrimp paste with 2 cups (475ml) water, and bring to a boil over high heat. Remove from heat, stir, and let sit for 30 minutes. Using a laddle or large spoon, transfer shrimp-paste liquid to the broth, being careful to leave any shrimp paste sediment behind. Season to taste with sugar and/or fish sauce. Hold broth warm over low heat until ready to serve.\nSerious Eats / Vy Tran\nFor serving:\nRewarm ham hocks in the broth. In each soup bowl, add 7 ounces (200g) noodles, top with 5 or 6 slices reserved beef shank, 1 ham hock, 1 slice pork blood cake, and 2 or 3 pieces steamed ham, followed by a handful each of green onions, yellow onion, and cilantro.\nSerious Eats / Vy Tran\nReturn broth to a boil, then ladle enough hot broth into each bowl to cover noodles.\nSerious Eats / Vy Tran\nServe immediately with a plate of fresh mint, banana blossom or cabbage, bean sprouts, chiles, and lime wedges alongside, as well as extra shrimp paste if desired.\nSerious Eats / Vy Tran\nSpecial Equipment\nLarge stock pot\nMake-Ahead and Storage\nThis is a dish that keeps getting better as it sits, but you should only cook the noodles the day you serve them, because they will become brittle once refrigerated.\nAll of the garnishes can be prepped up to 4 hours in advance and refrigerated in airtight containers.\nThe broth can be strained and refrigerated in airtight containers for up to 5 days or frozen for up to 3 months. The beef shank can be refrigerated in a container with some of the broth (so it stays juicy) for up to 5 days.\nThe Latest\nNoodle Mains\nSoups\nRice Noodles\nVietnamese"
}