{
  "url": "https://www.seriouseats.com/buttermilk-fried-rabbit-5203378",
  "image_url": "https://www.seriouseats.com/thmb/BbtHS2zu3tuoHCbuLEUkRzPTdxc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210713-buttermilk-fried-rabbit-vicky-wasik-seriouseats-primary-a548bcfada044b80a75b1088c0e48d51.jpg",
  "tags": [
    "Soul Food & Southern",
    "Snacks & Appetizers",
    "Mains",
    "Other Meat & Poultry",
    "Frying"
  ],
  "title": "Southern Fried Rabbit",
  "full_text": "Southern Fried Rabbit\nClose\nJump to recipe\nPrep\n8 hrs 30 mins\nCook\n20 mins\nTotal\n8 hrs 50 mins\nServes\n4\nMakes\n6 pieces fried rabbit\nCook Mode\n(Keep screen awake)\nIngredients\nTo Brine the Rabbit:\n3\ncups\n(\n710\nml\n)\nbuttermilk\n2\nteaspoons\n(\n8\ng\n)\nDiamond Crystal kosher salt\n; for table salt use half as much by volume or an equal amount by weight\n1/2\nteaspoon\nmustard powder\n1/2\nteaspoon\npaprika\n1/4\nteaspoon\nfreshly ground black pepper\n1/4\nteaspoon\ngarlic powder\n1/4\nteaspoon\nonion powder\n8\nsprigs\nfresh thyme\n, picked\n2\nsprigs\nfresh rosemary\n, picked and chopped\n1\n(3-pound; 1.4 kg)\nrabbit\n,\nbroken down into 2 front legs, 2 hind quarters, and 1 saddle cut in half crosswise\nTo Dredge and Fry:\n2\ncups\n(\n9\nounces\n;\n260\ng\n)\nall-purpose flour\n1\ntablespoon\n(\n12\ng\n)\nDiamond Crystal kosher salt\n, plus extra for seasoning; for table salt use half as much by volume or an equal amount by weight\n1/2\nteaspoon\nfreshly ground black pepper\n4\ncups\n(\n1\nL\n)\nneutral oil\nsuch as\nvegetable\n, for frying\nDirections\nTo Brine the Rabbit:\nIn a large bowl, whisk together buttermilk, salt, mustard powder, paprika, black pepper, garlic powder, onion powder, rosemary, and thyme. Add rabbit pieces and toss to thoroughly coat. Transfer contents of bowl to a 1-gallon zipper-lock freezer bag and refrigerate for at least 8 hours and up to 12 hours, flipping bag occasionally to redistribute the contents and coat rabbit evenly.\nSerious Eats / Vicky Wasik\nTo Dredge and Fry:\nAdjust oven rack to middle position and preheat oven to 200°F (95°C). Set a wire rack in a rimmed baking sheet. In a large bowl, whisk together flour, salt, and pepper. Working with one piece of rabbit at a time, remove rabbit from marinade, allowing excess buttermilk to drip off, and add to flour mixture. Toss to thoroughly coat, pressing with your hands to get flour to adhere to rabbit in an even layer. Transfer to prepared wire rack, and repeat dredging process with remaining rabbit pieces. Let dredged rabbit rest for 15 minutes.\nSerious Eats / Vicky Wasik\nMeanwhile, line a second rimmed baking sheet with paper towels and set a clean wire rack in it. Heat oil in a 12-inch cast iron skillet or 14-inch wok over medium-high heat to 350°F (175°C). Carefully add half the rabbit pieces and fry, adjusting heat to return to a 350°F (175°C) frying temperature, until golden brown on the first side, about 8-10 minutes. Using tongs, carefully flip rabbit pieces, and continue to fry until golden brown all over, and thickest part of rabbit registers 160°F (70°C) on an instant-read thermometer, about 7 minutes longer. Transfer fried rabbit to prepared wire rack, season lightly with salt, then transfer to oven to keep warm.\nSerious Eats / Vicky Wasik\nSkim any browned bits from oil and discard. Return oil to 350°F (175°C), and repeat with remaining rabbit. Let rest 5 minutes. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n12-inch cast iron skillet,\n2\nrimmed baking sheets\n, and 2\nwire cooling racks\nMake-Ahead and Storage\nThe fried rabbit is best enjoyed immediately after frying. Placed in an airtight container, the rabbit will keep in the refrigerator for up to five days. To reheat, place chicken on a wire rack set in a rimmed baking sheet in a preheated 350°F (175°C) oven; alternatively, you can refry it.\nRead More\nHow to Cut Up a Rabbit\nThe Best Buttermilk-Brined Southern Fried Chicken\nBatter-Fried Chicken\nLight and Fluffy Biscuits\nSoul Food & Southern\nSnacks & Appetizers\nMains\nOther Meat & Poultry\nFrying"
}