{
  "url": "https://www.seriouseats.com/butternut-squash-mac-and-cheese-recipe-8747696",
  "image_url": "https://www.seriouseats.com/thmb/OgzXr_jv8lhNtBgiuovMcgMtRhw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241010-SEA-Butternut-Squash-Mac-Cheese-Lozano_3x4_139-4297b802f14344ccb9d40e506fba944c.jpg",
  "tags": [
    "The Latest",
    "Pastas",
    "Vegetarian",
    "Fall",
    "Baked Pasta"
  ],
  "title": "Butternut Squash Mac and Cheese",
  "full_text": "Butternut Squash Mac and Cheese\nClose\nJump to recipe\nPrep\n30 mins\nCook\n70 mins\nCooling Time\n15 mins\nTotal\n115 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nOne 2- to 2 3/4 pound (\n960\ng\n)\nbutternut squash\n, halved and seeded\n1\ntablespoon\n(15ml)\nextra virgin olive oil\n1 3/4\nteaspoon\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\n4\nmedium\ngarlic\nclove\ns (20g), peeled and smashed\n1\npound\n(454g) medium-size\npasta shells\nor other short pasta\n6 tablespoons\nunsalted butter\n(about\n3\nounces\n; 84g), divided, plus more for greasing\n1/4 cup\nall-purpose flour\n(about\n1\nounce\n; 32g)\n1\nteaspoon\npaprika\n1/2\nteaspoon\nfreshly\nground black pepper\n1/4\nteaspoon\nground nutmeg\n2 1/2\ncups\n(590ml)\nwhole milk\n1 1/2\ncups\n(355ml)\nhalf and half\n1 1/2\ntablespoons\nDijon mustard\n12\nounces\nfontina cheese\n(340g; about 3 cups), shredded\n12\nounces\nextra-\nsharp cheddar\n(340g; about 3 cups), shredded\n8\nounces\nGruyère cheese\n(226g; about 2 cups), shredded\n1 cup\npanko breadcrumbs\n(\n2 1/2\nounces\n; 71g)\n1\ntablespoon\nminced\nfresh sage\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (205ºC). Line a 13- by 18-inch rimmed baking sheet with foil or parchment. Set aside.\nSerious Eats / Robby Lozano\nRub oil and 1/2 teaspoon of the salt all over cut sides of butternut squash. Place two smashed garlic cloves in each squash cavity and place squash halves cut side down on prepared baking sheet. Bake until easily pierced with a fork, 30 to 40 minutes. Remove from oven and let cool slightly, about 5 minutes. Reduce oven temperature to 350°F (175ºC) and, using oven mitts, carefully move rack to top third position.\nSerious Eats / Robby Lozano\nWhile butternut squash bakes, bring a large pot of lightly salted water to a boil. Add pasta and cook, stirring, until just shy of al dente, about 2 minutes less than cooking time indicated on package. Drain pasta and set aside.\nSerious Eats / Robby Lozano\nIn the now-empty pot, melt 4 tablespoons butter over medium heat. Once melted, add flour, paprika, pepper, and nutmeg, and whisk to form a paste. Continue to cook, whisking constantly, until raw flour scent is gone, about 1 minute. In a 4-cup measuring cup, combine whole milk and half-and-half. Slowly pour milk and half-and-half in a thin, steady stream, whisking constantly and thoroughly and getting into all corners of the saucepan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added. Whisk in Dijon to combine.\nSerious Eats / Robby Lozano\nScoop out roasted squash flesh (about 3 to 4 cups) and garlic and add to milk mixture in pot. Using an immersion blender, blend squashand garlic into milk mixture until smooth (alternatively, combine squash flesh, garlic, and 2 cups of the milk mixture in a blender; blend until smooth. Stir back to saucepan); bring to a simmer over medium heat. Remove from heat and gradually whisk in fontina and cheddar, about 1/2 cup at a time, until smooth and creamy, 5 to 7 minutes.\nSerious Eats / Robby Lozano\nFold in cooked pasta to fully coat in sauce, followed by Gruyère and 1 teaspoon salt. Lightly grease a 9- by 13-inch baking dish with butter and scrape pasta mixture into prepared dish and smooth surface into an even layer.\nSerious Eats / Robby Lozano\nMicrowave remaining 2 tablespoons butter in a medium microwave-safe bowl on low power until melted, about 20 seconds on medium power. Add panko, sage, and remaining 1/4 teaspoon salt, stirring to evenly coat breadcrumb mixture in butter. Scatter panko all over surface of mac and cheese in an even layer. Place baking dish on a 13- by 18-inch rimmed baking sheet and bake at 350ºF on upper-middle rack until browned and bubbling, 35 to 40 minutes. (Ovens can vary; check often to prevent top from burning.)\nSerious Eats / Robby Lozano\nRemove from oven and let cool for 15 minutes. Serve.\nSerious Eats / Robby Lozano\nSpecial Equipment\n13- by 18-inch rimmed baking sheet, immersion blender, 9- by 13-inch baking dish\nNotes\nTo make the squash easier to cut, use a fork or sharp paring knife to poke holes all over the gourd. Place on a large plate and microwave on high for 3 to 5 minutes. Once it’s cooled enough to handle, you can slide your knife in easily to halve the squash.\nAny semi-firm cheeses, such as cheddar, Swiss, Comté, emmentaler, Gruyère, fontina, or Monterey Jack will work here.\nMake-Ahead and Storage\nButternut squash can be roasted, scooped out, and refrigerated in an airtight container for up to 3 days before blending into the cheese sauce.\nMac and cheese can be assembled through the end of step 5, then covered and refrigerated for up to 5 days before baking. Increase baking time by 15 minutes if refrigerating.\nIf you are planning to freeze the butternut squash mac and cheese, we recommend baking it in a disposable aluminum baking pan. Once cooled, mac and cheese can be wrapped in 1 layer of aluminum foil then tightly wrapped in plastic wrap and frozen for up to 3 months. Thaw overnight in the fridge before baking. Bake in an oven preheated to 350ºF (175ºC) until warmed through.\nThe Latest\nPastas\nVegetarian\nFall\nBaked Pasta",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/butternut-squash-mac-and-cheese.webp?"
}