{
  "url": "https://www.seriouseats.com/butterfiled-roast-turkey-with-gravy-recipe",
  "image_url": null,
  "tags": [
    "Roasted Turkey",
    "Whole Turkey",
    "Turkey Mains",
    "Fall Mains",
    "Winter Mains"
  ],
  "title": "Crisp-Skinned Spatchcocked (Butterflied) Roast Turkey With Gravy",
  "full_text": "Crisp-Skinned Spatchcocked (Butterflied) Roast Turkey With Gravy\nJump to recipe\nPrep\n10 mins\nCook\n105 mins\nActive\n20 mins\nResting Time\n20 mins\nTotal\n2 hrs 15 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\nonions\n, roughly chopped (about\n1 1/2\nquarts\n)\n3\nlarge\ncarrots\n, peeled and roughly chopped (about\n1\nquart\n)\n4\nstalks\ncelery\n, roughly chopped (about\n1\nquart\n)\n12\nthyme\nsprigs\n1\nwhole\nturkey\n(\n12 to 14\npounds\ntotal), butterflied as per the instructions above, backbone, neck, and giblets reserved\n2\ntablespoons\nvegetable oil\n, divided\nKosher salt\nand freshly ground black pepper\n1 1/2\nquarts\nlow-sodium\nhomemade\nor store-bought\nchicken\nor turkey\nbroth\n2\nbay leaves\n3\ntablespoons\nunsalted butter\n4\ntablespoons\nall-purpose flour\nDirections\nAdjust oven rack to middle position and preheat oven to 450°F (230°C). Line a rimmed baking sheet or broiler pan with aluminum foil. Scatter 2/3rds of onions, carrots, celery and thyme sprigs across bottom of pan. Place slotted broiler rack or wire rack directly on top of vegetables.\nSerious Eats / Fred Hardy\nPat turkey dry with paper towels and rub on all surfaces with 1 tablespoon oil. Season liberally on all surfaces with salt and black pepper. (If using a brined, salted, or Kosher turkey, omit salting step; see note.) Tuck wing tips behind back. Place turkey on top of rack, arranging so that it does not overlap the edges, pressing down on the breast bone to flatten the breasts slightly.\nSerious Eats / Fred Hardy\nTransfer turkey to oven and roast, rotating occasionally, until an instant read thermometer inserted into the deepest part of the breast registers 150°F (66°C), and the thighs register at least 165°F (74°C), about 80 minutes.\nWhile turkey roasts, make the gravy. Roughly chop the neck, backbone, and giblets. Heat remaining 1 tablespoon oil in a 3-quart saucepan over high heat until shimmering. Add chopped turkey parts and cook, stirring occasionally, until lightly browned, about 5 minutes. Add remaining onions, carrots, and celery and continue to cook, stirring occasionally, until vegetables start to soften and brown in spots, another 5 minutes. Add chicken or turkey stock, remaining thyme, and bay leaves. Bring to a boil and reduce to a bare simmer. Allow to cook 45 minutes, then strain through a fine-mesh strainer into a 2-quart liquid measuring cup and discard solids. Skim off any fat from the surface of the broth.\nSerious Eats / Fred Hardy\nMelt butter over medium-high heat in a 2-quart saucepan. Add flour and cook, stirring constantly until flour is golden brown, about 3 minutes. Whisking constantly, add broth in a thin, steady stream until it is all incorporated. Bring to a boil, reduce to a simmer, and cook until reduced to about 1 quart, about 20 minutes longer. Season to taste with salt and pepper, cover, and keep gravy warm.\nSerious Eats / Fred Hardy\nWhen turkey is cooked, remove from oven and transfer rack to a new baking sheet. Allow to rest at room temperature for 20 minutes before carving. Carefully pour any collected juices from out of the roasting pan through a fine-mesh strainer into a liquid measuring cup. Skim off excess fat and discard. Whisk juices into gravy.\nSerious Eats / Fred Hardy\nCarve turkey and serve with gravy.\nSerious Eats / Fred Hardy\nSpecial Equipment\nTwo rimmed baking sheets\nor one baking sheet and one broiler pan; aluminum foil;\nwire rack\n;\npoultry shears\n;\ninstant-read thermometer\n,\nfine-mesh strainer\n,\n2-quart liquid measuring cup\n,\n2-quart saucepan\n,\nwhisk\n.\nNotes\nFor best results, we recommend dry-brining your turkey by\nfollowing the instructions here\n. If dry-brining, you can omit any additional salt added to the turkey in step two.\nRead More\nVideo: How to Cook a Spatchcock Turkey (the Fastest, Easiest, Best Way to Cook a Thanksgiving Bird)\nThe Food Lab's Definitive Guide to Buying, Prepping, Cooking, and Carving Your Holiday Turkey\nThe Serious Eats Guide to Carving Turkey\nThe Best Simple Roast Turkey With Gravy Recipe\nEasy Stuffed Roast Turkey With Giblet Gravy Recipe\nPorchetta-Flavored Spatchcocked Turkey Recipe\nRoasted Turkey\nWhole Turkey\nTurkey Mains\nFall Mains\nWinter Mains"
}