{
  "url": "https://www.seriouseats.com/butter-basted-bison-rib-steak-crispy-potatoes",
  "image_url": "https://www.seriouseats.com/thmb/8ilwpzOkLNodi-ZagIpOV61Si0U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__10__20131003-bison-ribeye-01-a489ae4e03f6413ea09459c8a85d900f.jpg",
  "tags": [
    "Ribeyes",
    "Stovetop Beef",
    "Fingerling",
    "Beef Mains"
  ],
  "title": "Butter-Basted Bison Ribeye Steak with Crispy Potatoes Recipe",
  "full_text": "Butter-Basted Bison Ribeye Steak with Crispy Potatoes Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nActive\n30 mins\nDry-Brining and Cooling Time\n12 hrs 10 mins\nTotal\n13 hrs 5 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nbone-in bison rib\nsteak\n, 1 3/4- to-2 inches thick, about\n1- to- 1 1/4\npounds\ntotal\nKosher salt\nand freshly ground black pepper\n3/4\npound\nfingerling potatoes\n3\nsprigs\nfresh rosemary\n3\nsprigs\nfresh thyme\n3\ntablespoons\nvegetable, canola, or\npeanut oil\n4\ntablespoons\nunsalted butter\n6\ngarlic\ncloves\n, smashed\nDirections\nSeason steak liberally on all sides with salt and pepper. Set on a wire rack set in a rimmed baking sheet and place in refrigerator uncovered overnight.\nSerious Eats / J. Kenji López-Alt\nMeanwhile, place potatoes in a medium pot, cover with water, season with salt, and bring to a boil over high heat. Reduce to a simmer and cook until tender, about 10 minutes total. Meanwhile, remove leaves from 1 sprig of rosemary and 1 sprig of thyme and finely chop. Set aside. Drain potatoes and set aside to cool. Cut each potato in half lengthwise. Potatoes can be cooked through this stage up to a day in advance and stored in a sealed container in the refrigerator.\nHeat oil in a 12-inch heavy-bottomed cast-iron skillet over high heat until just beginning to smoke. Carefully add steak and cook, flipping frequently, until a pale golden brown crust starts to develop, about 4 minutes total.\nSerious Eats / J. Kenji López-Alt\nReduce heat to medium. Add 3 tablespoons butter, garlic, whole rosemary sprigs, and whole thyme sprigs to the skillet and continue to cook, flipping steak occasionally, and basting any light spots with foaming butter. To baste, tilt pan slightly so that butter collects by handle. Use a spoon to pick up butter and pour it over steak, aiming at light spots.\nSerious Eats / J. Kenji López-Alt\nContinue flipping and basting until an instant-read thermometer inserted into thickest part of steak side registers 115 to 120°F (46 to 49°C) for medium-rare, or 125°F (52°C) for medium, 6 to 8 minutes total. Immediately transfer steak to a wire rack set in a rimmed baking sheet and place herb sprigs and garlic on top. Allow steak to rest uncovered while you cook the potatoes.\nSerious Eats / J. Kenji López-Alt\nReturn skillet to medium-high heat and add remaining tablespoon butter. When foaming subsides, add potatoes, cut-side down. Cook, shaking pan occasionally, until potatoes are deep golden brown and crisp, about 8 minutes. Add chopped rosemary and thyme, season with salt and pepper, and toss to coat potatoes. Cook, tossing and stirring, until fragrant, about 1 minute.\nSerious Eats / J. Kenji López-Alt\nTransfer potatoes to a serving platter with a slotted spoon, leaving excess fat behind. Increase heat to high until leftover fat is smoking. Pour over resting steak. Discard garlic, rosemary, and thyme sprigs. Place steak on serving platter and serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\n12-inch cast-iron skillet, wire rack, rimmed baking sheet, kitchen tongs,\ninstant-read thermometer\nRibeyes\nStovetop Beef\nFingerling\nBeef Mains"
}