{
  "url": "https://www.seriouseats.com/butter-tart-recipe-8711439",
  "image_url": "https://www.seriouseats.com/thmb/56Ek2LKsUZT0ajAMXfxUt67_fgw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240910-SEA-CanadianButterTarts-VyTran-Hero1-39-d9bd7a59eba745b8aa2825aa2bdff758.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Pies",
    "Canadian"
  ],
  "title": "Canadian Butter Tarts",
  "full_text": "Canadian Butter Tarts\nClose\nJump to recipe\nPrep\n10 mins\nCook\n22 mins\nChilling Time\n90 mins\nTotal\n2 hrs 2 mins\nServes\n18 2-inch tarts\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\nButtery, Flaky\nPie Crust\nor 1 store-bought\npie crust\nFor the Filling:\n170\ng\nunsalted butter\n(6 ounces; 3/4 cup), melted\n336\ng\ndark brown sugar\n(12 ounces; 1 3/4 cup)\n2\nlarge\neggs\n1\nteaspoon\nvanilla extract\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1 1/2\nteaspoons\nwhite vinegar\nDirections\nAdjust oven rack to middle position and preheat oven to 425ºF (220ºC). Using nonstick spray, lightly grease two 12-cup muffin tins (or 12 individual tart tins); set aside.\nSerious Eats / Vy Tran\nOn a generously floured work surface, use a rolling pin to roll pie crust dough into a 12- by 16-inch rectangle about 1/4-inch thick. Using a round 4-inch cookie cutter or jar, cut 18 circles out of the dough, rerolling the dough as needed, about 3 times. (If dough is too soft or sticky to work with, refrigerate briefly before continuing to roll.)\nSerious Eats / Vy Tran\nWorking with one circle of dough at a time, press dough into the well of muffin tin, starting from the center to edges, until dough reaches the edge of the well. Repeat with remaining dough. Transfer muffin tin to fridge and chill until firm, about 30 minutes. (Alternately, use the same method to press the dough into 12 individual tart tins.)\nSerious Eats / Vy Tran\nMeanwhile, prepare the filling:\nIn a medium bowl, whisk melted butter and brown sugar together. Add eggs, vanilla extract, salt, and vinegar and whisk until smooth. (The filling will be fairly runny.)\nSerious Eats / Vy Tran\nFill tart shells with 1 1/2 tablespoons of filling; do not overfill. Bake for 10 minutes, then reduce oven temperature to 350ºF (175ºC). Continue baking until filling is bubbly, deeper in color, and pastry is golden, about 12 minutes. Remove from oven and allow tarts to cool in pan for 10 minutes; use a butter knife to gently separate tarts from the tin, then transfer to a wire rack to cool completely, about 1 hour.\nSerious Eats / Vy Tran\nSpecial Equipment\nTwo 12-cup muffin tins or twelve 2-inch by 1 1/4-inch individual tart tins, rolling pin, 4-inch round cookie cutter, whisk\nMake-Ahead and Storage\nButter tarts can be made up to one week in advance and stored in an airtight container at room temperature or in the fridge. (Refrigerated butter tarts will have a chewier texture.)\nTo freeze butter tarts, transfer them to an airtight container or plastic zip-top bag once cooled. Butter tarts can be frozen for up to 3 months. Defrost in the refrigerator before serving.\nDesserts\nThe Latest\nPies\nCanadian"
}