{
  "url": "https://www.seriouseats.com/butternut-squash-and-kale-farrotto-recipe-8764505",
  "image_url": "https://www.seriouseats.com/thmb/6j-RKxwMyFa-EjVkfumvE3tHR9s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241220-SEA-ButternutSquashFarrotto-AmandaSuarez-00-d4c2fb77607444a39b0804a2ffb6597d.jpg",
  "tags": [
    "Rice & Grain Mains",
    "The Latest",
    "Butternut Squash",
    "Kale",
    "Winter Mains"
  ],
  "title": "Here's How to Easily Make Butternut Squash and Kale Farrotto Like an Italian Chef",
  "full_text": "Here's How to Easily Make Butternut Squash and Kale Farrotto Like an Italian Chef\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nTotal\n55 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne\nmedium\nbutternut squash\n(2 3/4 pounds; 1.24kg), peeled, seeded, and diced into 1/2-inch pieces\n5\ntablespoons\n(75ml)\nextra-virgin olive oil\n, divided\nKosher salt\n1 1/2\ncups\npearled\nfarro\n(9 ounces; 255g)\nOne\nmedium\nyellow onion\n(8 ounces; 225g), finely diced\n1/2\ncup\n(120ml)\ndry white wine\nOne bunch\nblack (Tuscan) kale\n(\n8\nounces\n; 225g), stemmed and leaves thinly sliced (about 4 ounces/113g) once stemmed\n2\nquarts\n(2L) homemade\nvegetable\nor\nchicken\nstock\nor store-bought low-sodium broth, heated\n1/2\ncup\ngrated\nParmigiano-Reggiano\n(1 ounce; 28g), plus more for serving\nDirections\nPreheat oven to 425°F (220°C). On a rimmed baking sheet, toss butternut squash with 2 tablespoons (30ml) olive oil and a large pinch of salt, then spread in an even layer and roast until squash is very soft and lightly browned, about 25 minutes.\nSerious Eats / Amanda Suarez\nIn a Dutch oven or large 5-quart saucier or rondeaux, heat remaining 3 tablespoons (45ml) olive oil over medium-high heat until shimmering. Add farro and cook, stirring, until very lightly toasted and fragrant, 2 to 3 minutes. Add onion and cook, stirring, until softened, about 3 minutes longer.\nSerious Eats / Amanda Suarez\nAdd white wine and cook, stirring, until raw alcohol smell has mostly cooked off and wine has mostly evaporated. Stir in kale and a large pinch of salt, followed by 1/2 cup stock. Cook, stirring often, until stock has mostly evaporated. Continue adding stock in roughly 1/2-cup increments, allowing it to evaporate and be absorbed between additions, until farro is tender with a delicately chewy bite, about 30 minutes (cooking time can vary depending on the brand of farro and how much of its bran was removed). If you run out of stock and the farro is still too firm, continue to cook by adding additions of boiling water until farro is tender. When farro is tender, warm serving bowls in a low oven or toaster oven or by filling them with boiling water.\nSerious Eats / Amanda Suarez\nStir in butternut squash, allowing it to mash into farrotto while leaving some chunks intact. Adjust consistency as needed with additional hot stock/water; you want the farrotto to flow and not be dry and thick as it will continue to thicken as time passes. Off heat, vigorously stir in cheese until farrotto is creamy and flowing (you can continue to add hot liquid in small increments throughout this process to maintain the proper consistency). Season as needed with salt.\nSerious Eats / Amanda Suarez\nSpoon thickened-but-flowing farrotto into warmed serving bowls and serve right away, topping with more cheese at the table.\nSerious Eats / Amanda Suarez\nRice & Grain Mains\nThe Latest\nButternut Squash\nKale\nWinter Mains"
}