{
  "url": "https://www.seriouseats.com/butter-basted-pan-seared-steaks-recipe",
  "image_url": null,
  "tags": [
    "Stovetop Beef",
    "Ribeyes",
    "Beef Mains",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Pan-Seared, Butter-Basted Thick-Cut Steak Recipe",
  "full_text": "Pan-Seared, Butter-Basted Thick-Cut Steak Recipe\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n15 mins\nResting Time\n55 mins\nTotal\n80 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\nbone-in T-bone\nor ribeye\nsteak\n(see notes)\nKosher salt\nand\nfreshly ground black pepper\n1/4\ncup\n(\n60\nml\n) vegetable or\ncanola oil\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n6\nsprigs\nthyme\nor rosemary (optional)\n1/2\ncup\nfinely sliced shallots\n(about\n1\nlarge\n; optional)\nDirections\nCarefully pat steak dry with paper towels. Season liberally on all sides, including edges, with salt and pepper. If desired, let steak rest at room temperature for 45 minutes, or refrigerated, loosely covered, up to 3 days (see notes).\nSerious Eats / Julia Estrada\nIn a 12-inch heavy-bottomed cast iron skillet, heat oil over high heat until just beginning to smoke. Carefully add steak and cook, flipping frequently, until a pale golden-brown crust starts to develop, about 4 minutes total.\nSerious Eats / Julia Estrada\nAdd butter, herbs (if using), and shallot (if using) to skillet and continue to cook, flipping steak occasionally and basting any light spots with foaming butter. If butter begins to smoke excessively or steak begins to burn, reduce heat to medium. To baste, tilt pan slightly so that butter collects by handle. Use a spoon to pick up butter and pour it over steak, aiming at light spots.\nSerious Eats / Julia Estrada\nContinue flipping and basting until an instant-read thermometer inserted into thickest part of tenderloin side registers 120 to 125°F (49 to 52°C) for medium-rare or 130°F (54°C) for medium, 8 to 10 minutes total.\nSerious Eats / Julia Estrada\nImmediately transfer steak to a large heatproof plate and pour pan juices on top. Let rest 5 to 10 minutes. Carve and serve.\nSerious Eats / Julia Estrada\nSpecial Equipment\n12-inch cast iron skillet\n,\ninstant-read thermometer\nNotes\nThis recipe is designed for very large steaks, at least one and a half inches thick and weighing 24 to 32 ounces (700 to 900g) with the bone in. Porterhouse, T-bone, ribeye, and New York strip will all work. Avoid using tenderloin steaks, as they are likely to overcook.\nFor best results, let steaks rest at least 45 minutes at room temperature, or up to three days loosely covered in the refrigerator, after seasoning in step 1.\nRead More\nAsk The Food Lab: Do Bones Add Flavor to Meat?\nThe Food Lab's Complete Guide to Dry-Aging Beef at Home\n7 Myths About Cooking Steak That Need to Go Away\nThe Food Lab: Flip Your Steaks Multiple Times for Better Results\nAsk The Food Lab: Does Resting Under Foil Ruin Meat?\nButter-Basting: A Classic Technique Everyone Should Know\nThe 3 Best Ways to Cook Steak: A Pros and Cons List\nStovetop Beef\nRibeyes\nBeef Mains\nMother's Day\nFather's Day"
}