{
  "url": "https://www.seriouseats.com/caesar-roast-potatoes-recipe-8670545",
  "image_url": "https://www.seriouseats.com/thmb/PXFdMJ4MokiDnwaqIOvBF66BPR8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-CaesarRoastPotatoes-TwoBites-heroes-161e5d9473244c90a5b961e8bb6ce866.jpg",
  "tags": [
    "Potatoes",
    "The Latest",
    "Holidays & Seasons",
    "Roasted Potatoes"
  ],
  "title": "Caesar Roast Potatoes",
  "full_text": "Caesar Roast Potatoes\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nTotal\n85 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1/2\nteaspoon\n(\n4\ng\n)\nbaking soda\n4\npounds\n(about\n2\nkg\n) russet or\nYukon Gold potatoes\n, peeled and cut into 2- to 3-inch chunks\n6\ntablespoons\n(\n90\nml\n)\nextra-virgin olive oil\n4-6\nanchovy\nfillets\npacked in oil, minced\n3\nmedium\ncloves garlic\n(15\ng)\n, minced\n1/2\nteaspoon\nlemon zest\n, divided, plus\n2\nteaspoons\nlemon juice\nFreshly\nground black pepper\n1\nteaspoon\nWorcestershire sauce\n2\ntablespoons\nminced\nfresh parsley leaves\n1/2\ncup\n(\n1\nounce\n) grated\nParmigiano-Reggiano\ncheese, plus extra for serving\nDirections\nAdjust oven rack to center position and preheat oven to 450°F (230°C) or 400°F (200°C) if using convection. In a large pot, heat 2 quarts (2L) water over high heat until boiling. Add 2 tablespoons kosher salt (about 1 ounce; 25g), baking soda, and potatoes and stir. Return to a boil, reduce to a simmer, and cook until a knife meets little resistance when inserted into a potato chunk, about 10 minutes after returning to a boil.\nSerious Eats / Two Bites\nMeanwhile, combine olive oil, anchovies, garlic, 1/4 teaspoon lemon zest, and a few grinds of black pepper in a small saucepan and heat over medium heat. Cook, stirring and shaking pan constantly, until garlic just begins to turn golden and anchovies break down, 1 to 3 minutes. Immediately strain oil through a fine-mesh strainer set in a large bowl. Set garlic/anchovy mixture aside and reserve separately.\nSerious Eats / Two Bites\nWhen potatoes are cooked, drain carefully, return to the pot off heat, and let them rest in the pot for about 30 seconds to allow excess moisture to evaporate. Transfer to the bowl with the infused oil, season to taste with a little more salt and pepper, and toss to coat, shaking bowl roughly, until a thick layer of mashed potato–like paste has built up on the potato chunks.\nSerious Eats / Two Bites\nTransfer potatoes to a large rimmed baking sheet and separate them, spreading them out evenly. Transfer to the oven and roast, without moving, for 20 minutes. Using a thin, flexible metal spatula to release any stuck potatoes, shake pan and turn potatoes. Continue roasting until potatoes are deep brown and crisp all over, turning and shaking them a few times during cooking, 30 to 40 minutes longer.\nSerious Eats / Two Bites\nIn a large bowl, whisk to combine the reserved garlic/anchovy mixture, remaining 1/4 teaspoon lemon zest, lemon juice, Worcestershire sauce, and parsley.  Transfer potatoes to the large bowl, sprinkle with Parmigiano-Reggiano, and toss until the potatoes are coated evenly. Season with more salt and pepper to taste. Transfer to a serving platter, sprinkle with additional Parmigiano-Reggiano, if desired, and serve immediately.\nSerious Eats / Two Bites\nSpecial Equipment\nSmall saucepan\nNotes\nRusset potatoes will produce crisper crusts and fluffier centers. Yukon Golds will be slightly less crisp and have creamier centers, with a darker color and deeper flavor. You can also use a mix of the two.\nThe potatoes should be cut into very large chunks, at least 2 to 3 inches or so. For medium-sized Yukon Golds, this means cutting them in half crosswise, then splitting each half again to make quarters. For larger Yukon Golds or russets, you can cut the potatoes into chunky sixths or eighths.\nPotatoes\nThe Latest\nHolidays & Seasons\nRoasted Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/caesar-roast-potatoes.webp?"
}