{
  "url": "https://www.seriouseats.com/caesar-spaghetti-recipe-8667582",
  "image_url": "https://www.seriouseats.com/thmb/81xZpXMCvD_FOZ1FzOJNp0Sa1Io=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240701-CaesarPasta2-AmandaSuarez-hero-c4302923bb52429db5f53c350d688b97.jpg",
  "tags": [
    "Recipes",
    "The Latest",
    "Spaghetti, Bucatini, & Linguine",
    "Pasta Mains",
    "Anchovies"
  ],
  "title": "Caesared Spaghetti",
  "full_text": "Caesared Spaghetti\nClose\nJump to recipe\nCook\n15 mins\nTotal\n15 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Gremolata Breadcrumbs:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1/2\ncup\npanko breadcrumbs\n(\n1 1/4\nounces\n;\n35\ng\n)\n1/4\ncup\n(\n15\ng\n)\nchopped fresh flat-leaf parsley leaves\nFinely grated zest\nfrom\n1\nlemon\nKosher salt\nFor the Anchovy Carbonara Version:\n2\nlarge\neggs\nplus\n6\nlarge\negg yolks\n1/2\ncup\nfinely grated Parmigiano-Reggiano\n(\n1\nounce\n;\n30\ng\n)\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n1\nteaspoon\n(\n5\nml\n)\nWorcestershire sauce\nFreshly ground black pepper\nKosher salt\n1\npound\n(\n450\ng\n)\ndried spaghetti\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n1\nounce\noil-packed anchovy fillets\n(\n30\ng\n; about\n7\nfillets\n)\n4\nmedium cloves\n(\n20\ng\n)\ngarlic\n, very finely minced or grated\nFor the EVOO e Alici Version:\n1\npound\n(\n450\ng\n)\ndried spaghetti\nKosher salt\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n1\nounce\noil-packed anchovy fillets\n(\n30\ng\n; about\n7\nfillets\n)\n4\nmedium cloves\n(\n20\ng\n)\ngarlic\n, very finely minced or grated\nFreshly ground black pepper\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n1\nteaspoon\n(\n5\nml\n)\nWorcestershire sauce\n1/2\ncup\nfinely grated Parmigiano-Reggiano\n(\n1\nounce\n;\n30\ng\n)\nDirections\nFor the Gremolata Breadcrumbs\nIn a medium skillet, combine oil and breadcrumbs and cook over medium-low heat, stirring occasionally, until toasted and golden brown, 5 to 7 minutes. Add parsley and lemon zest, season lightly with salt, stir to combine, and continue to cook until parsley begins to sizzle and mixture is very fragrant of citrus, 30 seconds to 1 minute. Transfer breadcrumb mixture to small bowl and set aside until ready to serve.\nSerious Eats / Amanda Suarez\nFor the Anchovy Carbonara Version:\nIn a large heatproof mixing bowl, whisk together whole eggs and yolks, Parmigiano-Reggiano, Dijon, Worcestershire, and black pepper.\nSerious Eats / Amanda Suarez\nBring a pot of lightly salted water to a boil. Add pasta and cook, stirring, until al dente.\nSerious Eats / Amanda Suarez\nMeanwhile, in a skillet or saucier, combine olive oil with anchovies and garlic and cook over medium heat, stirring frequently, until anchovies have melted and garlic is lightly golden, about 3 minutes. Measure 1/2 cup (120ml) pasta cooking water (you can take it right from the pot as the pasta is cooking) and add to the anchovy-oil mixture.\nSerious Eats / Amanda Suarez\nWhile whisking constantly, slowly drizzle the anchovy-oil mixture into the egg mixture; take care, because if you add the hot liquid too fast, you may scramble the eggs.\nSerious Eats / Amanda Suarez\nUsing tongs and/or a strainer, transfer pasta to egg mixture, stirring it in as you add it to ensure you don't cause the eggs to scramlbe. Stir well to combine.\nSerious Eats / Amanda Suarez\nSet mixing bowl over pot of boiling pasta water (make sure bottom of bowl does not touch the water; you can remove water from the pot to ensure they don't touch) and cook, stirring quickly with tongs, until sauce begins to thicken to a creamy, silky consistency and leaves trails as you stir. Remove from heat, season with salt if needed, and divide into bowls. Serve right away, topping with reserved gremolata breadcrumbs.\nSerious Eats / Amanda Suarez\nFor the EVOO e Alici Version:\nIn a large Dutch oven or wide-bottomed pot, combine 3 quarts (3L) of water and 2 teaspoons (8g) salt, and bring to a boil over high heat. Add pasta and cook, stirring frequently for first 30 seconds to prevent noodles from sticking.\nSerious Eats / Amanda Suarez\nMeanwhile, in a large skillet or saucier, combine olive oil with anchovies, garlic, and a generous amount of black pepper and cook, stirring and breaking up anchovies occasionally with a rubber spatula or wooden spoon, until anchovies have dissolved, about 4 minutes.\nSerious Eats / Amanda Suarez\nOnce pasta has cooked for 5 minutes, transfer 1 cup (240ml) of pasta cooking water to skillet along with the Dijon and Worcestershire; continue cooking pasta. Return skillet to high heat and bring to a boil, swirling pan and stirring constantly until cooking water emulsifies with oil-anchovy mixture, 1 to 2 minutes. Reduce heat to low while pasta finishes cooking to prevent liquid from over-reducing.\nSerious Eats / Amanda Suarez\nMeanwhile, continue cooking pasta until it is softened on the exterior, but well shy of al dente and still uncooked in the center (about 3 minutes less than the package directions). Using tongs, transfer pasta to skillet, and reserve remaining pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 2 cups (475ml) pasta cooking water.\nSerious Eats / Amanda Suarez\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is slightly thickened and coats noodles with a creamy glaze, 2 to 3 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed. At this point, the sauce should be emulsified and loose enough to pool around the edges of the pan.\nSerious Eats / Amanda Suarez\nRemove from heat, add cheese and toss and stir rapidly to incorporate and emulsify into the sauce. Season with salt and pepper to taste. Divide between individual serving bowls, sprinkle with gremolata breadcrumbs, and serve.\nSerious Eats / Amanda Suarez\nMake-Ahead and Storage\nThe gremolata breadcrumbs can be made ahead and stored in an air-tight container at room temperature. for up to 7 days.\nRecipes\nThe Latest\nSpaghetti, Bucatini, & Linguine\nPasta Mains\nAnchovies"
}