{
  "url": "https://www.seriouseats.com/caesar-mayonnaise-recipe-8667576",
  "image_url": "https://www.seriouseats.com/thmb/AGCa7Jvg2iytUFUjvzpHVGif8cU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240625-CaesarMayo-AmandaSuarez-hero-045d48ad4d634082b003f13776b3b375.jpg",
  "tags": [
    "Condiments & Sauces",
    "The Latest",
    "Anchovies",
    "Parmesan"
  ],
  "title": "Caesar Mayo",
  "full_text": "Caesar Mayo\nClose\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nServes\n20\nto 30 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\negg\n8\noil-packed\nanchovy\nfillets\n, or more to taste (see note)\n4\nmedium\ncloves\ngarlic\n2\nounces\nParmigiano-Reggiano\n, finely grated (\n60\ng\n; about\n1\ncup\n)\n2\ntablespoons\n(\n30\nml\n) fresh\nlemon juice\n(from\n1\nwhole\nlemon\n)\n1\ntablespoon\n(\n15\nml\n)\nWorcestershire sauce\n1\ntablespoon\n(\n15\nml\n)\nDijon mustard\nKosher salt\nand freshly ground black pepper\n1\ncup\n(\n237\nml\n)\ncanola oil\n1\ncup\n(\n237\nml\n)\nextra-virgin olive oil\nDirections\nIf using a countertop blender or food processor:\nIn blender jar or processor bowl, combine egg, anchovies, garlic, Parmigiano-Reggiano, lemon juice, Worcestershire, and mustard. Add a pinch of salt and generous grinding of black pepper. With the blender or processor running, slowly drizzle in canola oil in a thin, steady steam until a thickened sauce forms. Then drizzle in olive oil until a thicker sauce forms (if you're sensitive to the\nbitter flavor sometimes created by high-speed blending of olive oil\n, you can transfer the mayo to a mixing bowl and whisk the olive oil in by hand). Adjust seasoning by adding more lemon juice, salt, and/or pepper, if desired.\nSerious Eats / Amanda Suarez\nIf using an immersion blender:\nIn a cup or jar that just fits the head of your immersion blender, combine egg, anchovies, garlic, Parmigiano-Reggiano, lemon juice, Worcestershire, and mustard. Add a pinch of salt and generous grinding of black pepper. The egg/lemon juice mixture must reach the blades for this to work (see note).\nPour canola oil (and olive oil, if bitterness is not a concern for you) on top and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and turn it on high speed. Do not pulse or move the head. As mayonnaise forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified. If you didn't add olive oil with the canola, transfer mayo to a mixing bowl and slowly whisk in the olive oil while drizzling it in a thin stream. Season mayonnaise to taste with salt. Adjust seasoning by adding more lemon juice, salt, and/or pepper, if desired.\nNotes\nIt is imperative that the jar you use be just slightly larger than the head of the immersion blender, and the egg/lemon mixture must be in contact with the blades of the blender before you switch it on for this to work. The head of the blender must be firmly planted against the bottom of the jar until the mayonnaise starts to come together. If you can't find a jar the right size, double the recipe in order to increase the starting volume of the egg/lemon mixture.\nSpecial Equipment\nBlender\n,\nfood processor\n, or\nimmersion blender\nMake-Ahead and Storage\nThe Caesar mayo can be refrigerated in an airtight container for up to 5 days.\nCondiments & Sauces\nThe Latest\nAnchovies\nParmesan"
}