{
  "url": "https://www.seriouseats.com/caesar-roasted-broccoli-recipe-8672043",
  "image_url": "https://www.seriouseats.com/thmb/E9CsgcO70SNuwrI5ceX-_UEPKRU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240701-CaesarBreadcrumbs-Amanda-Suarez-hero-d4279ce212cd4b44b74333a8eff7f271.jpg",
  "tags": [
    "Recipes",
    "The Latest",
    "Vegetable Sides",
    "Roasting",
    "Broccoli"
  ],
  "title": "Caesar Roasted Broccoli",
  "full_text": "Caesar Roasted Broccoli\nClose\nJump to recipe\nCook\n25 mins\nTotal\n25 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Caesar Breadcrumbs:\n1 tablespoon\n(14\ng)\nsalted butter\n1/4\ncup plain\nbreadcrumbs (see notes)\n1\nteaspoon\nanchovy paste, or 1 finely minced anchovy\n1\nsmall\nclove garlic,\nminced or grated\n1/2\nteaspoon\nlemon zest\nFor the Broccoli:\n1\npound\nbroccoli florets\n, cut into 1 1/2 to 2-inch pieces (6 cups; 453g)\n2\ntablespoons\n(30ml)\nextra-virgin olive oil\n3/4\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt, use half as much by volume\nFreshly\nground\nblack pepper\nFor Serving:\n1\nteaspoon\nlemon zest\nfrom 1 lemon\n1\ntablespoon\ngrated\nParmigiano-Reggiano cheese\n, plus more to taste\nDirections\nFor the Caesar breadcrumbs:\nIn a small nonstick skillet, melt butter over medium-low heat. Stir in anchovy paste and garlic and cook until fragrant, about 1 minute. Add breadcrumbs and, using a flexible spatula, toss to coat. Cook, stirring constantly until breadcrumbs are golden brown, about 3 minutes. Off heat, stir in the lemon zest and season with salt to taste. Transfer to a bowl and let cool completely.\nSerious Eats / Amanda Suarez\nFor cooking broccoli in the oven:\nLine a rimmed baking sheet with aluminum foil. Adjust oven rack to upper position and preheat oven to 500°F (260°C). Place baking sheet on oven rack to preheat.\nIn a large bowl, toss broccoli florets with olive oil, salt, and pepper. Carefully add broccoli to preheated baking sheet in a single layer. Roast until broccoli is tender and deeply browned in spots, about 20 minutes (for the deepest browning on only one side, do not flip the broccoli during cooking; for more even browning all over, toss and flip broccoli about halfway through roasting).\nFor cooking broccoli in the air fryer:\nPreheat a 6-quart air fryer to 400°F (205ºC) for 5 minutes. Meanwhile, in a large bowl, toss broccoli with oil, salt, and pepper to evenly coat. Working in batches if necessary, pour broccoli into the air fryer basket in an even layer and cook until broccoli is still bright green but starting to char around edges, about 5 minutes. Remove basket from air fryer and shake to toss broccoli florets. Return to air fryer and decrease temperature to 340°F (170ºC). Cook until broccoli is crisp-tender, about 3 more minutes.\nSerious Eats / Morgan Hunt Glaze\nFor serving:\nIn the now empty bowl, toss broccoli with lemon zest then transfer broccoli to a serving platter. Sprinkle with breadcrumbs and Parmigiano-Reggiano and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheet if oven roasting, 6-quart capacity air fryer if air frying\nMake-Ahead and Storage\nOnce completely cooled, the breadcrumbs can be transferred to an airtight container and stored at room temperature for up to 3 days.\nRecipes\nThe Latest\nVegetable Sides\nRoasting\nBroccoli"
}