{
  "url": "https://www.seriouseats.com/caesar-blt-recipe-8667580",
  "image_url": "https://www.seriouseats.com/thmb/v6DhL1RLDaH8l1gQT7hogGXKanI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-CaesarBLT-AmandaSuarez-hero10-df49f3685c13493cbba244c23be6dca7.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Bacon",
    "Tomato",
    "Summer"
  ],
  "title": "Caesar BLT",
  "full_text": "Caesar BLT\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n1 serving\nMakes\n1 sandwich\nCook Mode\n(Keep screen awake)\nIngredients\n3\nstrips\nthick-cut, naturally cured\nbacon\n(see note)\n2\nslices\nhigh-quality\nsandwich bread\n, such as\nshokupan\nExtra-virgin olive oil\n, for drizzling\nAbout\n6\ntablespoons\nfinely grated\nParmigiano-Reggiano cheese\n, divided, plus a few thin shavings for the sandwich\nCaesar mayo\nor regular\nmayonnaise\n2\nromaine lettuce\nleaves\n, trimmed to roughly the size of sandwich bread\n2 to 4\nthick\nslices\nripe\ntomato\n(see note)\n2\noil-packed\nanchovy\nfillets\nKosher\nor flaky\nsea salt\nand\nfreshly ground black pepper\n(optional)\nDirections\nPlace a griddle or skillet over medium-low heat. Add bacon and place a bacon press, skillet, or masonry trowel on top of it to keep it flat as it cooks. Cook until lightly browned on first side, about 5 minutes, then flip, cover again, and continue cooking until bacon is browned on both sides and fat has rendered, about 3 minutes longer. Transfer bacon to a paper towel–lined plate and set aside.\nSerious Eats / Amanda Suarez\nLightly drizzle bread slices on both sides with olive oil. In a large nonstick skillet, spread half the cheese in a thin circle just slightly larger than a bread slice (if your skillet is large enough you can make two circles of cheese and toast both bread slices at once). Set over medium heat and cook until cheese just starts to melt. Press one bread slice into the cheese and continue to cook until cheese is just starting to turn golden around the edges, about 3 minutes; increase heat to medium-high if the cheese isn't melting and browning fast enough.\nSerious Eats / Amanda Suarez\nPush cheese in around the sides of the bread and continue to cook until cheese is golden all over, about 4 minutes longer. Flip bread and lightly toast on second side, about 2 minutes. Transfer to a work surface, cheese side up (this prevents it from steaming and softening). Repeat with remaining cheese and bread.\nSerious Eats / Amanda Suarez\nSpread a generous slather of mayo on both non-cheese sides of bread. Arrange tomatoes on top of one of the bread slices (season with salt and pepper if not using Caesar mayonnaise). Cut bacon in half crosswise and arrange slices on top of tomatoes.\nSerious Eats / Amanda Suarez\nTop with thinly shaved Parmigiano-Reggiano, anchovy fillets, and romaine lettuce. Close sandwiches, cut in half on the diagonal, and serve.\nSerious Eats / Amanda Suarez\nNotes\nIf making multiple sandwiches, you can save time by cooking the bacon in the oven sandwiched between two baking sheets;\nread how to bake bacon for a crowd here\n.\nSandwiches\nThe Latest\nBacon\nTomato\nSummer"
}