{
  "url": "https://www.seriouseats.com/cajeta-mexican-vanilla-caramel-recipe",
  "image_url": "https://www.seriouseats.com/thmb/i8mzsMaQqhj7jhbZALpSvPiL7PY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__09__20160329-cajeta-syrup-vicky-wasik-1-2-95e887c0e3184c468252b90b428916d7.jpg",
  "tags": [
    "Desserts",
    "Mexican"
  ],
  "title": "Cajeta Casera (Homemade Goat's Milk \"Caramel\") Recipe",
  "full_text": "Cajeta Casera (Homemade Goat's Milk \"Caramel\") Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n65 mins\nActive\n45 mins\nTotal\n70 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nMexican vanilla bean\n34\nounces\n(\n4\ncups\n;\n965\ng\n)\nfresh goat's milk\n, preferably UHT (see notes)\n6\nounces\n(\n3/4\ncup\n;\n170\ng\n)\nsugar\n1/2\nteaspoon\nplus 1/8\nteaspoon\nbaking soda\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\nDirections\nSplit vanilla bean with a paring knife and scrape out seeds with the flat of the blade; reserve seeds for another use. Combine split vanilla pod with goat’s milk, sugar, baking soda, and salt in a 5-quart stainless steel pot. Warm over medium heat, stirring occasionally with a heat-resistant spatula, until sugar dissolves and milk turns foamy and light, about 15 minutes.\nSerious Eats / Vicky Wasik\nContinue cooking at a gentle simmer, stirring and scraping the sides of the pot frequently if not constantly, until milk is thick, golden, and reduced to no more than a thin, super-jammy layer, about 45 minutes; stir more frequently as the cajeta thickens to prevent scorching. Continue cooking until cajeta forms a \"trail\" that remains open for 1 second when a spatula is scraped across the bottom of the pot. Remove from heat. Using tongs, remove and discard vanilla pod. Scrape cajeta into a heat-resistant, wide-mouth glass jar. If the total amount is less than 12 1/2 ounces (1 cup; 355g), thin with a touch of milk or water or else the cajeta will be too thick on cooling. Cajeta can be refrigerated for up to 3 months.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n5-quart stainless steel pot,\nheat-resistant spatula\nNotes\nThis quick-cook technique hinges on the unique properties of goat's milk and cannot be attempted with traditional cow's milk or non-dairy replacements. I've found that ultra-high-temperature pasteurized (UHT) goat's milk works particularly well—look for purple cartons of Meyenberg in the refrigerated case of supermarkets like Kroger and Whole Foods. Raw or low-temperature pasteurized goat's milk (often found in local markets) will coagulate toward the end of the cooking process, giving the cajeta a slightly grainy consistency, so save those delicately flavored milks for fresh applications.\nDesserts\nMexican",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cajeta-casera-homemade-goats-milk-caramel-recipe.webp?"
}