{
  "url": "https://www.seriouseats.com/cajun-burgers-spicy-remoulade-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-h_xANK0b4Xc7wbocghrfBBOR1U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__07__20150701-cajun-burger-assembled-morgan-eisenberg-0a27fdff16d54c349928d2ffdbbd4bf5.jpg",
  "tags": [
    "Burgers",
    "Cajun & Creole",
    "Grilled Beef",
    "Ground Beef",
    "Quick Dinners"
  ],
  "title": "Cajun Burgers With Spicy Rémoulade Recipe",
  "full_text": "Cajun Burgers With Spicy Rémoulade Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n60 mins\nFreezing Time\n20 mins\nTotal\n60 mins\nServes\n6 burgers\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\nbeef chuck\n, cut into 1-inch cubes\n8\nounces\nCreole andouille sausage\n, cut into 1/2-inch cubes\n1\ncup\nmayonnaise\n1\ntablespoon\nketchup\n1\ntablespoon\nhot sauce, such as\nTabasco\n2\ntablespoons\nmustard\n1\ntablespoon\nchopped\nflat-leaf parsley\n, leaves and tender stems\n1\ntablespoon\nfresh juice\nfrom\n1\nwhole\nlemon\n1\nteaspoon\ncayenne pepper\n2\nteaspoons\njarred\nhorseradish\n2\nmedium\ncloves garlic\nKosher salt\nand freshly ground black pepper\n3\nstalks\ncelery\n, thinly sliced lengthwise with a vegetable peeler\n1/2\nwhite onion\n, thinly sliced crosswise\n1\nlarge\nred bell pepper\n, thinly sliced\nVegetable oil\n, for brushing\n6\nhamburger buns\n8\nounces\nblue cheese\n, crumbled\nDirections\nSpread the beef in a single layer on a rimmed baking sheet or large plate. Freeze just until the meat begins to get stiff around the edges, about 20 minutes. Working in batches, place 1/3 of the beef in a food processor and pulse until very roughly chopped, about 10 pulses. Add 1/3 of the andouille and continue to pulse until the mixture is finely chopped and the andouille is well distributed, about 10 more short pulses. Repeat with remaining beef and andouille.\nGently form meat into 6 patties, each about 1/2 inch wider in diameter than the burger buns. Using your thumb, press a dimple into the center of each patty. Arrange patties on a baking sheet and refrigerate until ready to cook.\nIn a food processor, combine mayonnaise, ketchup, hot sauce, mustard, parsley, lemon juice, cayenne pepper, horseradish, and garlic. Process until smooth and season with salt and pepper. Set rémoulade aside.\nPlace celery strips in a bowl of ice water and refrigerate until ready to use.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate.\nBrush onion and bell pepper with oil and grill until lightly charred and soft, about 4 minutes per side. Set aside.\nSeason patties with salt and pepper. Place burgers directly over hot coals, cover with vents open, and cook, turning occasionally, until burgers register 125°F for medium-rare or 135°F for medium on an instant-read thermometer, about 6 minutes. Transfer burgers to a large plate.\nToast buns over center of grill until golden brown and warmed through.\nAssemble the burgers in this order: bottom bun, dollop of rémoulade, grilled onions and peppers, patty, additional dollop of rémoulade, celery, blue cheese, and top bun. Serve right away.\nSpecial Equipment\nGrill, food processor, instant-read thermometer\nThis Recipe Appears In\nCajun Burgers With Spicy Remoulade: A Holy (Trinity) Marriage\nBurgers\nCajun & Creole\nGrilled Beef\nGround Beef\nQuick Dinners"
}