{
  "url": "https://www.seriouseats.com/cajun-gumbo-with-chicken-and-andouille-recipe",
  "image_url": null,
  "tags": [
    "Soul Food & Southern",
    "Braising & Stewing",
    "Chicken Thighs",
    "Sausages",
    "Mains"
  ],
  "title": "Cajun Gumbo With Chicken and Andouille Sausage Recipe",
  "full_text": "Cajun Gumbo With Chicken and Andouille Sausage Recipe\nJump to recipe\nPrep\n5 mins\nCook\n3 hrs 45 mins\nActive\n3 hrs\nCooling Time\n10 mins\nTotal\n4 hrs\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nplus\n1\ntablespoon\n(\n250\nml\n) canola or\nvegetable oil\n, divided\n6\nboneless, skinless chicken\nthighs\n(about\n2 1/4\npounds\n;\n1\nkg\ntotal)\nKosher salt\n1 1/2\npounds\nCajun-style andouille sausage\n(\n680\ng\n; about\n8\nlinks\n), sliced crosswise 1/2 inch thick\n1\ncup\nall-purpose flour\n(\n4 1/2\nounces\n;\n130\ng\n)\n2\nlarge\nyellow onions\n(about\n12\nounces\n;\n340\ng\neach), cut into 1/4-inch dice\n2\ngreen bell peppers\n(about\n7 ounces; 200 g\neach), cut into 1/4-inch dice\n4\nlarge\ncelery ribs\n(\n9\nounces\n;\n260\ng\ntotal), cut into 1/4-inch dice\n8\nmedium cloves\ngarlic\n, minced\n1/4\nteaspoon\ncayenne pepper\nFreshly ground black pepper\n1 1/2\nquarts\n(\n1.4\nL\n) homemade\nbrown\nor\nwhite chicken stock\nor store-bought\nlow-sodium chicken stock\n2\ndried bay leaves\n2\nlarge sprigs\nfresh thyme\n1\npound\n(\n450\ng\n)\nfresh okra\n, caps trimmed, pods cut crosswise 1/2 inch thick (optional; see note)\n1/2\nteaspoon\nfilé powder\n, plus more as needed for serving (optional; see note)\nWarm rice\n, thinly sliced scallions, and hot sauce, for serving\nDirections\nIn a large Dutch oven, heat 1 tablespoon (15ml) oil over medium-high heat until shimmering. Season chicken all over with salt. Working in batches, sear chicken until browned on both sides, about 5 minutes per side. Transfer chicken to a platter, then set aside until cool enough to handle. Once chicken has cooled, shred into bite-size pieces.\nAdd sliced andouille to pot and cook, stirring, until lightly browned, about 6 minutes. Using a slotted spoon, transfer to a platter and set aside.\nSerious Eats / Vicky Wasik\nAdd remaining 1 cup (235ml) oil to Dutch oven along with flour, stirring to form a paste. Lower heat to medium-low and cook, stirring and scraping frequently, until roux is a chestnut or chocolate-brown color but not scorched, about 1 hour. Alternatively, you can combine the flour and 1 cup oil in a separate ovenproof vessel and cook, uncovered, in a 350°F (180°C) oven, stirring occasionally, until roux is chestnut or chocolate-brown, about 4 hours, though how long this will take can vary dramatically depending on your oven. You can add the finished oven roux to the pot on the stovetop after removing the sausage, then immediately proceed to the next step of sautéing the aromatics.\nSerious Eats / Vicky Wasik\nAdd onion, bell pepper, and celery and season lightly with salt. Cook over medium-high heat, stirring and scraping, until softened, about 10 minutes; lower heat to medium if any of the ingredients threaten to scorch.\nSerious Eats / Vicky Wasik\nStir in garlic, cayenne, and a generous amount of black pepper and cook, stirring, for 2 minutes longer.\nAdd stock, bay leaves, and thyme. Season lightly with salt. Bring to a gentle simmer, then allow to cook uncovered, stirring occasionally, for 1 hour. Add okra, if using, along with sausage and shredded chicken, and gently simmer, uncovered, for 1 hour longer. Skim any fat from the surface as it accumulates.\nSerious Eats / Vicky Wasik\nRemove from heat and add filé powder, if using, stirring well to break up any small lumps. Season gumbo with salt. Discard thyme sprigs and bay leaves.\nSerious Eats / Vicky Wasik\nServe gumbo with warm rice, sprinkling sliced scallions on top of each bowl. Pass hot sauce at the table, as well as filé powder, if desired, to lightly shake on top of each serving of gumbo and rice.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge Dutch oven\nNotes\nOkra and filé powder are both traditionally used as thickeners in gumbo. Use one or the other, or both, but it's not really gumbo if you omit them both. Okra has a slightly slimy texture that some love and some revile, while filé powder has a subtle tea-like flavor and will thicken the cooking liquid when stirred in at the end of cooking.\nMake-Ahead and Storage\nThe gumbo can be refrigerated for up to 5 days. Reheat before serving.\nSoul Food & Southern\nBraising & Stewing\nChicken Thighs\nSausages\nMains"
}