{
  "url": "https://www.seriouseats.com/cambodian-chicken-stir-fry-recipe",
  "image_url": null,
  "tags": [
    "Chicken Stir-Fry",
    "Chicken Breast",
    "Southeast Asian",
    "Stovetop Chicken",
    "Lemongrass"
  ],
  "title": "Cha Kreung Satch Moan (Cambodian Lemongrass Chicken Stir-Fry) Recipe",
  "full_text": "Cha Kreung Satch Moan (Cambodian Lemongrass Chicken Stir-Fry) Recipe\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n25 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Kreung:\n3\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, sliced into thin rounds (\n65\ng\nonce sliced)\n1\n(3-inch) knob\ngalangal\n, peeled and sliced into thin rounds (\n35\ng\nonce sliced)\n2\n(4-inch) knobs\nfresh turmeric\n, peeled and sliced into thin rounds (\n25\ng\nonce sliced)\n12\nmakrut lime leaves\n, preferably fresh, sliced very thinly crosswise\n1\nsmall\nshallot\n, peeled and sliced into thin rounds (\n25\ng\nonce sliced)\n5\nmedium\ncloves\ngarlic\n, peeled (\n25\ng\n)\n1/2\ncup\nholy\nbasil leaves\n, very tightly packed (\n12\ng\n; see note) or\nThai basil leaves\n(\n25\ng\n)\nFor the Stir-Fry:\n1/2\ncup\n(\n120\nml\n)\nvegetable oi\nl, divided\n2\npounds\n(\n900\ng\n)\nboneless, skinless chicken breast\n(about\n3\nbreast\nhalves\n), cut crosswise into 1/2-inch-thick slices, divided\n1\n(3-inch) piece\nfermented mudfish\n(\n35\ng\n), cut in half, divided (optional; see notes)\n2\nteaspoons\n(\n10\nml\n)\nAsian fish sauce\n, divided\n1/2\nteaspoon\ngranulated sugar\n, divided\n1/2\ncube\n(\n6\ng\n)\nchicken bouillon\n, such as Knorr, crumbled to a powdery consistency, divided\n1\ncup\nholy\nbasil leaves\n, very tightly packed (\n40\ng\n), divided\n4\nmedium\njalapeños\n(\n150\ng\n), stemmed, halved, and seeded, then cut on a bias into 3/4-inch strips, divided\nKosher salt\nFor Serving:\nSteamed white rice\nDirections\nFor the Kreung:\nUsing a large granite mortar and pestle, combine lemongrass, galangal, turmeric, and makrut lime leaves and grind to a smooth but slightly fibrous paste. These are the toughest, most fibrous ingredients in the paste, so it will take 5 to 10 minutes for the paste to form. Once the paste has formed, add shallot and garlic and pound again to smash them into the paste, another 3 to 5 minutes longer. Add basil to the mortar and pound until it is fully incorporated into the paste.\nFor the Stir-Fry:\nIn a wok, heat 1/4 cup (60ml) vegetable oil over medium-low heat until shimmering. Add roughly half of the kreung to the wok, stirring and scraping constantly with a wooden spatula to prevent the mixture from sticking to the bottom of the pan and burning. At first, the paste will snap and pop as it begins to release moisture. Continue stirring until all visible moisture has cooked off and the paste has thickened and darkened slightly, 1 to 2 minutes.\nIncrease heat to high, then add half of the chicken to the wok, along with 1 piece of mudfish (if using) and cook, stirring, until chicken is coated in the kreung and has turned white on the surface, 2 to 3 minutes.\nStir in half of fish sauce, sugar, and bouillon and scrape browned bits from the bottom of the wok (some may still adhere). Stir in half the basil. Once basil has wilted, reduce heat to low and add half of jalapeño slices, cooking until warmed through but still crisp. Season with salt to taste.\nScrape contents of wok into a serving bowl and discard fermented fish. Rinse and dry wok, then repeat with remaining oil, kreung, chicken, and other ingredients.\nServe stir-fry right away, passing steamed white rice at the table.\nSpecial Equipment\nGranite mortar and pestle\n,\nwok\nNotes\nFermented mudfish, called prahok when smashed into a paste, is an extremely fragrant and pungent ingredient, used as a source of salt and flavor in all sorts of Cambodian dishes. My local Thai grocery was sold out of prahok, so I bought the whole small fish instead. If you find the pre-processed prahok paste instead of the whole-fish version, start with 1 teaspoon and adjust your other sources of salt accordingly. In New York,\nBangkok Center Grocery\nusually carries several forms of fermented fish paste, along with the whole fish. Otherwise, you can purchase prahok paste online.\nHoly basil, also known as tulsi, delivers a menthol-like tingling and cooling sensation, along with a slightly bitter earthiness. It's a great balancing flavor for the pungency of this dish, but it can be hard to find. Search local Thai or Cambodian grocery stores for it, if you have any in your area. If you can't get your hands on holy basil, substitute an equal volume of Thai basil. Thai basil contains more moisture, so expect to cook the kreung slightly longer, until the excess moisture has cooked off.\nChicken Stir-Fry\nChicken Breast\nSoutheast Asian\nStovetop Chicken\nLemongrass"
}