{
  "url": "https://www.seriouseats.com/caneles-canneles-de-bordeaux-french-pastry-recipe-how-to-make",
  "image_url": "https://www.seriouseats.com/thmb/7dEbPAzjcDiJxTbrMPs7E36xrUY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Caneles-de-Bordeaux-Hero-4x5-00514-VictorProtasio-4f219073be7d43fe8a32516ffd2cfbff.JPG",
  "tags": [
    "Pastries"
  ],
  "title": "Canelés (Cannelés) de Bordeaux",
  "full_text": "Canelés (Cannelés) de Bordeaux\nClose\nJump to recipe\nPrep\n90 mins\nCook\n70 mins\nActive\n3 hrs\nChilling and Cooling Time\n24 hrs 40 mins\nTotal\n27 hrs 20 mins\nMakes\n16 canelés\nCook Mode\n(Keep screen awake)\nIngredients\n17.6\nounces\nwhole milk\n(\n498\nml\n; about\n2\ncups\nplus\n2\ntablespoons\n)\n10.6\nounces\nconfectioners' sugar\n, sifted, divided (\n301\ng\n; about\n2 1/2\ncups\n)\n1.8\nounces\nunsalted butter\n, cubed (\n51\ng\n; about\n3\ntablespoons\nplus\n2\nteaspoons\n)\n1\n(6-inch)\nvanilla bean\nwith the seeds scraped\n2\nlarge\neggs\n(\n3.5\nounces\n;\n100\ng\n)\n2\nlarge\negg yolks\n(\n1.2\nounces\n;\n34\ng\n)\n4.4\nounces\nall-purpose flour\n(\n125\ng\n; about\n1\ncup\n), sifted\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nounce\ndark rum\n(\n28\ng\n;\n2\ntablespoons\n)\n2\nounces\npure beeswax\n(\n57\ng\n; about\n1/4\ncup\n)\n2\nounces\nhomemade\nor store-bought\nclarified butter\n(\n55\ng\n; about\n1/4\ncup\n)\nDirections\n2 days before baking: In a medium-sized saucepan set over medium heat, whisk together milk, half of the sugar, butter, and vanilla bean pod and seeds. Bring milk just to a simmer, gently whisking occasionally; turn heat off when the edges begin to bubble.\nSerious Eats / Victor Protasio\nPlace eggs, yolks, and remaining half of sugar in a medium bowl; gently whisk just until combined but avoid incorporating too much air. Gradually and gently whisk warm milk mixture into egg mixture until combined. In a large bowl, sift together flour and salt. Place a fine-mesh strainer over bowl with flour mixture; pour and press egg mixture through strainer; reserve vanilla pod for later. Add rum to the bowl. Very gently whisk batter until combined; avoid incorporating air. Wash and dry the strainer, then push the batter through the strainer with a rubber spatula. Return vanilla bean pod to batter; press a sheet of plastic wrap directly on surface to prevent a skin from forming. Cover bowl and allow batter to rest in the refrigerator for at least 24 hours, or preferably 48 hours.\nSerious Eats / Victor Protasio\n1 hour before baking: Set oven to 350°F (180°C) and place the metal (either copper or aluminum) canelé molds inside for 10 minutes. While molds are heating, place beeswax in a plastic, microwave-safe container and microwave in 30-second increments, swirling each time, until beeswax is fully liquified. Add butter and microwave until it has fully melted, then stir until you have a solution of butter and beeswax. (This may also be done on the stovetop in a saucepan, but because cleaning beeswax from pots is an unsavory activity, using the microwave is highly recommended.) Remove molds from the oven and allow them to cool for 1 minute. Set up a cooling rack with a piece of aluminum foil  underneath. Pour wax mixture into 1 mold all the way to the rim; pick up mold using a kitchen towel or kitchen mittens and quickly return beeswax mixture to container. Invert mold on top of the cooling rack and allow the excess wax to drip off. Repeat with remaining molds. Once the wax has cooled back to opaque, about 5 minutes, use a kitchen torch to evenly heat outside of molds, allowing more excess wax mixture to drip off. (Alternatively, place molds on a baking sheet, open side up. Bake for 2 minutes; invert molds on top of cooling rack to remove any excess wax.) Once molds are cool enough to handle, about 5 minutes, place on a cool plate or baking sheet and freeze for 30 minutes.\nSerious Eats / Victor Protasio\nOnce it's time to bake:\nPreheat oven to 500°F (260°C). Place a baking sheet in oven and let preheat 30 minutes. Remove molds from freezer. Remove and wring out vanilla bean pod; very gently whisk batter until homogenous, avoiding incorporating any air. Transfer batter to a plastic deli container or a wet measuring cup with a spout. Fill molds almost to the top with batter, leaving a centimeter of space at the top of the molds (about 65 grams each). Remove preheated sheet tray from the oven, line with aluminum foil, then place the filled molds on the heated tray, spacing them about 1 inch apart. Bake for 15 minutes.\nSerious Eats / Victor Protasio\nDecrease temperature of the oven to 400°F (200°C) and bake until caneles are deep golden brown, about 40 to 50 minutes, loosely covering with foil to prevent excess browning if needed. (If caneles have not settled back into molds during the initial 10 to 15 minutes of baking, carefully remove from oven one at a time;use a wooden pick to gently pull caneles away from sides to release steam trapped underneath and help push them back down. To check for doneness, invert 1 mold onto a cooling rack. If you are pleased with the color, let the canelé cool on the wire rack for 30 minutes. If you are not, return the canelé to its mold and bake for 5 to 6 minutes longer. The canelés are best if consumed no more than 5 hours after baking.\nSerious Eats / Victor Protasio\nSpecial Equipment\nCanelé molds,\nmetal tongs\n, baking stone, kitchen torch (optional)\nWe also strongly recommend using\na scale\nfor all pastry projects.\nPastries"
}