{
  "url": "https://www.seriouseats.com/canederli-di-pane-italian-bread-dumpling-recipe-11679155",
  "image_url": "https://www.seriouseats.com/thmb/-b2ZbZin9-AcF_CMY7spsW6c6XE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250213-SEA-Canederli-di-Pane-AmandaSuarez-HERO1-7ca59831f9104a379e7175d9f5d5201c.jpg",
  "tags": [
    "Italian",
    "The Latest",
    "Mains",
    "Comfort Food"
  ],
  "title": "Canederli di Pane (Northern Italian Bread Dumplings)",
  "full_text": "Canederli di Pane (Northern Italian Bread Dumplings)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n3\ncups\n(\n250\ng\n)\nbreadcrumbs\nfrom very stale bread or\n5\ncups\n(\n250\ng\n) diced day-old\nbread\n, plus additional breadcrumbs if needed (see notes)\n1\ncup\n(\n237\nml\n)\nmilk\n, plus more if needed\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, plus\n4\nadditional\ntablespoons\n(\n60\ng\n) if making optional frizzled sage\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n226\ng\n), minced\n1/4\npound\n(\n113\ng\n) minced\nspeck\nor\nsweet Italian sausage\n(about\n1\nlarge\nlink\n), casing removed\n2\nlarge\neggs\n1/4\ncup\ngrated\nParmigiano-Reggiano\n(\n1\nounce\n;\n30\ng\n), plus more for serving\n1/4\ncup\nminced\nflat-leaf parsley\nleaves and tender stems\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n, plus more as needed; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly ground black pepper\nPinch\nfreshly grated nutmeg\n(optional)\n2\nquarts\n(\n2\nL\n) rich\nhomemade\nchicken stock\nor\nbroth\n15\npicked fresh\nsage leaves\n, if making optional frizzled sage\nDirections\nIn a large mixing bowl, stir together bread with milk until bread is evenly moistened. Set aside to allow milk to fully soak in.\nSerious Eats / Amanda Suarez\nIn a medium skillet, melt 2 tablespoons butter over medium-high heat. Add onion and cook, stirring, until softened but not browned, about 3 minutes. Add speck or sausage, and cook, stirring (and breaking up sausage into small pieces if using sausage), until onion is fully tender and, if using sausage, sausage is cooked through, about 2 minutes for speck and 5 minutes for sausage. Set aside to cool slightly.\nAdd eggs, cheese, parsley, salt, pepper, and nutmeg (if using). Using clean hands, mix until all ingredients are fully incorporated. Add onion-pork mixture and mix once more to fully incorporate.\nSerious Eats / Amanda Suarez\nMake a test bread dumpling: If mixture seems too dry to hold together when forming balls (you can test this by trying to make a ball), add more milk 1 tablespoon at a time until sufficiently moistened; if mixture seems too wet, dense, and pasty, add additional breadcrumbs 1 tablespoon at a time until excess moisture has been absorbed but mixture is still able to hold a ball without falling apart.\nSerious Eats / Amanda Suarez\nLine a baking sheet with parchment. Using lightly moistened hands, roll bread mixture into roughly 1 1/2- to 2-inch balls, then set on prepared baking sheet.\nSerious Eats / Amanda Suarez\nIn a large saucepan or small pot or Dutch oven, heat broth until simmering (season with salt, if needed). Poach bread dumplings until fully heated through and floating on the surface, about 15 minutes. (You should be able to poach all of the dumplings at once, but if you have trouble fitting them all, work in batches to avoid overcrowding.)\nSerious Eats / Amanda Suarez\nMeanwhile, if making frizzled sage, in a clean skillet, melt optional remaining 4 tablespoons butter over medium-high heat until foaming. Toss in sage leaves and cook, swirling, until frizzled, about 1 minute. Season with salt.\nSerious Eats / Amanda Suarez\nTo serve: You can either serve the poached dumplings on plates without the broth, spooning the frizzles sage leaves and butter on top, along with a sprinkling of grated cheese, or you can ladle some of the broth into serving bowls and set the dumplings in that, again sprinkling cheese on top (or you can do what I like to, which is to serve them in some broth with the frizzled sage and butter spooned on top, plus the cheese).\nSerious Eats / Amanda Suarez\nNotes\nYou have a lot of options with the bread you use. You can use store-bought breadcrumbs, very stale bread that you process into course or fine breadcrumbs in a food processor, or semi-stale bread that is past its prime but not yet a rock. My experience is that the best canederli come from older, drier, staler bread, so I would encourage you to oven-dry any bread that still has some softness and moisture before using (cut it into cubes, pop it in a low oven around 300°F/150°C, and cook it until it's dried out but not deeply browned). You can leave the crusts on your bread or remove them, whichever appeals more.\nDepending on the bread you use, you may need to adjust by adding more milk to moisten it more so the dumpling balls hold together, or in some cases dry it out with breadcrumbs if the moisture is too wet and pasty.\nMake-Ahead and Storage\nThe uncooked canederli can be formed, set on a parchment-lined baking sheet, wrapped in plastic, and refrigerated for up to 1 day before cooking. Once cooked, leftover canederli can be cooled and stored in the broth; reheat gently before serving.\nItalian\nThe Latest\nMains\nComfort Food"
}