{
  "url": "https://www.seriouseats.com/canned-whole-tomatoes-preservation-recipe",
  "image_url": "https://www.seriouseats.com/thmb/q629otGUlzZO3-w-8AvvJvXr7KM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__09__20170908-tomato-preservation-vicky-wasik-17-46de25532b0e4c79a815fe589b6bc3ea.jpg",
  "tags": [
    "Canning & Preserving",
    "Tomato"
  ],
  "title": "Canned Whole Tomatoes (Using a Pressure Canner or Boiling-Water Bath)",
  "full_text": "Canned Whole Tomatoes (Using a Pressure Canner or Boiling-Water Bath)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n100 mins\nActive\n45 mins\nCooling Time\n24 hrs 5 mins\nTotal\n26 hrs\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\nAbout\n2\npounds\n(\n1\nkg\n)\nwhole, ripe plum tomatoes\n, free of all damage (see note)\n2\ntablespoons\n(\n30\nml\n) bottled\nlemon juice\nor\n1/2\nteaspoon\ncitric acid (see note)\n1\nteaspoon\n100% pure sea salt or\nkosher salt\n(optional)\nDirections\nBring a large pot of water to a boil and fill a large bowl with ice water. Meanwhile, wash tomatoes, discarding any leaf and stem remnants. Using a paring knife, score skin of each tomato by making an X at the top of each. Carefully lower tomatoes into boiling water and let stand until skins show the first signs of loosening around the edges of the score marks, about 1 minute. Using a slotted spoon, transfer tomatoes to ice water and let cool; their skins should loosen even more.\nPull off tomato skins and discard, or\nreserve for dehydrating\n. Place peeled tomatoes in a large bowl.\nSerious Eats / Vicky Wasik\nWash a 1-quart glass canning jar (or two 1-pint jars) in hot soapy water, rinse, and set aside. Alternatively, run jar(s) through the dishwasher and leave in machine until ready to use.\nAdd lemon juice or citric acid to jar, or divide evenly between jars if using the pint size. If using salt, add it to jar or divide evenly between jars; salt seasons the tomatoes but can be omitted if desired (see note).\nSerious Eats / Vicky Wasik\nScoop skinned tomatoes into jars. Gently press them in, trying not to break them (they will still be edible even if they do break), until jar is filled to a 1/2-inch headspace. Slide a thin plastic or metal blade in and out of jars to remove air bubbles. If headspace decreases from 1/2 inch, add any accumulated liquid from tomato bowl (or water, if you don't have enough tomato liquid) to bring contents back to 1/2-inch headspace.\nSerious Eats / Vicky Wasik\nWipe rims of jars with a damp towel. Place lids on top, then screw on rings only to finger-tightness. Over-tightening lids can prevent the canning process from working.\nSerious Eats / Vicky Wasik\nIf Using a Boiling-Water Bath:\nSet a rack on the bottom of a stockpot, making sure the pot is large enough to hold the jars and allow at least 2 inches of water above them. Fill pot about halfway with water. Bring to a rolling boil. Meanwhile, bring a kettle of water to a boil as well.\nWhen water is boiling, carefully lower jars into pot using jar-lifting tongs. When all jars are in the pot, if water does not cover them by at least 2 inches, add more boiling water from kettle until they are covered by 2 inches.\nSerious Eats / Vicky Wasik\nCover pot and return to a rolling boil. Process tomatoes at a boil for 85 minutes at sea level; add 5 minutes to this time for every 1,000 feet above sea level. Remove jars when processing time is complete.\nIf Using a Pressure Canner:\nSet canner's rack in the bottom of pressure canner and add about 4 inches water. Using jar-lifting tongs, carefully lower jars into pressure canner (see note). Seal canner lid following manufacturer's instructions. If using a weighted-gauge pressure canner, bring to 10 psi and process for 25 minutes. If using a dial-gauge pressure canner, bring to 11 psi and process for 25 minutes. If above an elevation of 1,000 feet, increase pressure setting to 15 psi for a weighted-gauge canner or 12 psi for a dial-gauge canner. (Follow manufacturer's instructions exactly for specifics on how to operate your canner.)\nAllow pressure canner to depressurize by venting it following manufacturer's instructions. Once fully vented to 0 psi, let stand for 10 minutes. Attempt to remove lid only once canner has fully depressurized and has sat for 10 minutes. Attempting to open a pressure canner before it has depressurized is extremely dangerous; do not do it. The 10-minute rest at 0 psi allows the jars to acclimate to lower pressure; skipping this by attempting to move the jars too soon can cause siphoning (loss of liquid in the jar). When ready, carefully remove pressure canner lid. Let jars rest 15 minutes inside canner before removing with the jar-lifter.\nLet jars stand for 24 hours, then check their seal. Lids should be taut, with no flex or give when you press down on them, and each jar should be at least halfway filled with liquid. If your jars do not pass the test, transfer to refrigerator and use tomatoes within 1 week. If they do pass the test, tomatoes can be stored in a dark, cool place for 12 to 18 months.\nSpecial Equipment\nStockpot\n(large enough to hold jars and provide at least two inches of water to cover them) or\npressure canner\n;\njar-lifting tongs\n; pint or quart canning jars\nNotes\nAny type of tomato will work for whole preserving, but plum varieties work best. In the garden or at the farmers' market, you're looking for tomatoes that are ripe and unblemished. Fungus, molds, and other microbes that have invaded a damaged tomato can reduce its already-borderline acidity, putting you at even greater risk.\nA boiling-water bath processes the jarred tomatoes at the atmospheric boiling point (212°F or 100°C at sea level). This lower temperature is safe for canning as long as the tomatoes are properly acidified following the instructions in this recipe. A pressure canner increases the pressure inside the device, which in turn raises the boiling point; these higher temperatures kill pathogens even more effectively and quickly, though it's still good insurance to add some acid in the form of lemon juice or citric acid.\nIf using a pressure canner, you can flavor your tomatoes by adding a clove of garlic and a few leaves of basil to each jar. Due to the risk of lowering the acidity level, do\nnot\nattempt to add these extra ingredients if using a boiling-water bath.\nA\npressure cooker\nis not necessarily a\npressure canner\n, so please make sure you are using the correct device before proceeding. Do not attempt to pressure-can with a multi-cooker. The National Center for Home Food Preservation was so alarmed by the popularity of using these for canning that\nit put out an alert\n.\nRead More\nHow to Can Tomatoes\nTomato Powder From Tomato Skins Recipe\nWhat Type of Canned Tomatoes Should I Use?\nCanning & Preserving\nTomato"
}