{
  "url": "https://www.seriouseats.com/cantonese-clay-pot-rice-with-chinese-meatloaf-recipe-7509578",
  "image_url": "https://www.seriouseats.com/thmb/lhGsLyJV4j1Zpa7NXH8XwVqw6og=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230601-SEA-ClaypotMeatloaf-AmandaSuarez08-23083e0b280548e8a05a780ee8d165f8.jpg",
  "tags": [
    "White Rice",
    "The Latest",
    "Chinese",
    "Rice & Grains",
    "East Asian"
  ],
  "title": "Cantonese Clay Pot Rice With Chinese Meatloaf (肉餅煲仔飯)",
  "full_text": "Cantonese Clay Pot Rice With Chinese Meatloaf (肉餅煲仔飯)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n35 mins\nCooling and Soaking Time\n70 mins\nTotal\n2 hrs 5 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Seasoned Soy Sauce:\n1\ntablespoon\n(\n15\nml\n)\nlard\n, schmaltz, or neutral oil\n1\nscallion\n, root end trimmed, white and green parts cut into 1-inch segments\n1\nsmall\nshallot\n(\n1\nounce\n;\n30\ng\n), thinly sliced\n1\nounce\n(\n30\ng\n)\ncilantro\n(about\n1/2\nbunch\n), cut into 1-inch segments (about\n1/3\ncup\n)\n4\nmedium\ncloves garlic\n(\n20\ng\n), smashed\n1\n(1-inch)\nknob\nfresh peeled\nginger\n(\n20\ng\n), sliced thinly\n2\ntablespoons\n(\n30\nml\n)\nShaoxing wine\n1/3\ncup\n(\n80\nml\n)\nwater\n1/3\ncup\n(\n80\nml\n)\nlight soy sauce\n1/3\ncup\n(\n80\nml\n)\ndark soy sauce\n2\ntablespoons\n(\n30\ng\n)\ngranulated sugar\nFor the Clay Pot Rice:\n1\ncup\njasmine rice\nor an equal-parts mix of jasmine and short-grain (such as koshihikari) rice (\n7\nounces\n;\n200\ng\n), see notes\n1\ncup\n(\n240\nml\n) hot\nwater\n1\ntablespoon\n(\n15\nml\n)\nlard\n, schmaltz, or neutral oil\nFor the Meatloaf and to Serve:\n1/2\npound\n(\n227\ng\n) boneless, skinless\npork shoulder\n, chilled in the freezer for 15 minutes\n1 1/2\nteaspoons\n(\n8\ng\n) finely minced\nginger\n1\ntablespoon\n(\n15\nml\n)\nlight soy sauce\n1\ntablespoon\n(\n15\nml\n)\noyster sauce\n1 1/2\nteaspoons\n(\n8\nml\n)\nShaoxing wine\n1\nteaspoon\n(\n5\nml\n)\ntoasted sesame oil\n1\nteaspoon\ncornstarch\n1\nlarge\negg white\n1/2\nteaspoon\ngranulated sugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use a pinch\n1\nraw salted\nduck egg\n(optional; see note)\n1\nscallion\n, root end trimmed, white and green parts thinly sliced, for garnishing\nDirections\nFor the Seasoned Soy Sauce:\nIn a small saucepan set over medium heat, melt the lard until liquid, about 1 minute. Reduce heat to medium-low and add scallions, shallots, cilantro, garlic, and ginger. Gently sauté, swirling the pan occasionally, until the aromatics are fragrant and begin to turn golden brown. Deglaze the pan with the Shaoxing wine, then add water, light soy sauce, dark soy sauce, and sugar. Bring the mixture to a boil over high heat and allow to bubble for 2 minutes. Strain, chill, and set aside; the sauce should be dark, smooth, and slightly thicker than bottled soy sauce.\nSerious Eats / Amanda Suarez\nIn a large bowl, combine short-grain and jasmine rice and cover by 2 inches with cool water. Using your hands, vigorously swish rice until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. (Rinsing the grains just once retains more of the starch and flavors of the rice.) Cover rice with at least double the amount of water and soak for at least 1 hour and up to 3 hours. When the rice has finished soaking, drain it well through a fine-mesh sieve. (To check if the rice has thoroughly soaked, break a grain in half. There shouldn’t be a visible hard, white center.)\nSerious Eats / Amanda Suarez\nMeanwhile, for the Meatloaf:\nDice the pork shoulder into 1/4-inch pieces. Set aside a third of the diced pork. Chop the pork, pushing the mixture around until the pork is as fine as conventionally ground pork. Transfer to a medium bowl and set aside.\nSerious Eats / Amanda Suarez\nIn a small bowl, mix together ginger, light soy sauce, oyster sauce, Shaoxing wine, sesame oil, starch, egg white, salt, and sugar, stirring well with a silicone spatula until well-combined.\nSerious Eats / Amanda Suarez\nGradually pour the seasoning liquid into the meat mixture. Vigorously stir the meat in one direction to incorporate the liquid. As the meat is being mixed, you will notice that white strands of protein that looks like fine tendons will get longer and longer. Once these strands reach 2 inches in length, begin slapping the meat loaf. Using clean hands, ball up the mixture into one mass and then slap it back into the bowl. Continue to slap the meat until the final mixture holds together and begins to feel bouncy, about 2 minutes.\nSerious Eats / Amanda Suarez\nTo Cook the Clay Pot Rice:\nset the clay pot over medium-high heat for 2 minutes. Add the rice to the pot and top with just enough water to barely cover. Bring the rice and water to a boil, with the lid off, stirring occasionally. When the rice and water begin to bubble, give the rice a final stir to get rid of any clumps, and allow the rice to cook until water is no longer visible above the rice, about 2 minutes.\nSerious Eats / Amanda Suarez\nReduce heat to low. Using a pair of chopsticks, ventilate the rice by poking a few shallow holes on the surface of the rice. Shape the meat loaf into a 5-inch wide disc and lay it on top of the rice, and using a spoon, make a small indent in the center of the meatloaf and crack in the salted duck egg, if using.\nSerious Eats / Amanda Suarez\nCover clay pot with lid and allow rice and meatloaf to cook on low heat until the rice begins to crackle, about 10 minutes. (Do not open the lid. Listening carefully, you should hear a consistent sizzling crackle; loud, inconsistent pops mean that the heat is too high.)\nSerious Eats / Amanda Suarez\nDrizzle lard, schmaltz, or oil on the rim of the lid and allow it to trickle down into the rice. With the lid still on, angle the clay pot so that a quarter of the bottom of the pot is toasting directly over the flame. Rotate the clay pot every minute, so that another quarter of the pot is being toasted. Repeat this process for another 13 minutes. Be careful not to burn the rice; if the vapor escaping the pot becomes a single, slow wisp or you begin to smell smoke, reduce heat to low. The rice is done when it stops sizzling and the steam slows. Remove clay pot from heat and rest for 2 minutes. Check that the meatloaf is fully cooked by poking a chopstick in the center of the meatloaf. The juices that run out should be clear and not pink.\nSerious Eats / Amanda Suarez\nTo Serve:\nRemove the lid and drizzle with the desired amount of seasoned soy sauce, stirring to mix well. Serve in the clay pot itself, dividing portions up into smaller individual bowls. Once most of the rice has been served, use a metal spoon to scrape up the crispy rice on the bottom, optionally crumbling it into the fluffier rice mixture.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nCantonese clay pot (about 1 quart in capacity and 18cm in diameter), gas stove\nNotes\nUsing both jasmine and a short- or medium-grain variety produces rice that’s both fluffy and chewy, a texture I particularly enjoy. However, you’re more than welcome to use just one kind of rice instead of a blend.\nThe salted duck egg used here should be raw. Salted duck eggs are available to purchase in most Asian grocery stores, but if you can only find cooked duck eggs, I suggest crumbling it into the meatloaf instead of placing it on top, as this will flavor the meatloaf throughout.\nMake-Ahead and Storage\nThe seasoned soy sauce can be refrigerated in an airtight container for up to 1 week.\nWhite Rice\nThe Latest\nChinese\nRice & Grains\nEast Asian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cantonese-clay-pot-rice-with-chinese-meatloaf.webp?"
}