{
  "url": "https://www.seriouseats.com/cantonese-clay-pot-rice-with-chinese-sausage-recipe-7509523",
  "image_url": "https://www.seriouseats.com/thmb/ojhjwApRpaUU8uuQw1uQ9Mw5ufo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230607-SEA-Claypot-AmandaSuarez51-b65ce0bdce6741668682d6e3ddfe540e.jpg",
  "tags": [
    "Rice & Grains",
    "The Latest",
    "White Rice",
    "Chinese",
    "East Asian"
  ],
  "title": "How to Make Cantonese Clay Pot Rice (煲仔飯)",
  "full_text": "How to Make Cantonese Clay Pot Rice (煲仔飯)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nChilling and Soaking Time\n95 mins\nTotal\n2 hrs 25 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Seasoned Soy Sauce:\n1\ntablespoon\n(\n15\nml\n)\nlard\n, schmaltz, or neutral oil\n1\nscallion\n, root end trimmed, white and green parts cut into 1-inch segments\n1\nmedium\nshallot\n(\n1\nounce\n;\n30\ng\n), thinly sliced\n1\nounce\n(\n30\ng\n)\ncilantro\n(about\n1/2\nbunch\n, cut into 1-inch segments (about\n1/3\ncup\n)\n4\nmedium\ncloves garlic\n(\n20\ng\n), smashed\n1\n(1-inch) knob\nfresh peeled\nginger\n(\n20\ng\n), sliced thinly\n2\ntablespoons\n(\n30\nml\n) Shaoxing\nwine\n1/3\ncup\n(\n80\nml\n)\nwater\n1/3\ncup\n(\n80\nml\n)\nlight soy sauce\n1/3\ncup\n(\n80\nml\n)\ndark soy sauce\n2\ntablespoons\n(\n30\ng\n)\ngranulated sugar\nFor the Clay Pot Rice:\n1\ncup\njasmine rice\nor an equal-parts mix of jasmine and short-grain (such as koshihikari) rice (\n7\nounces\n;\n200\ng\n), see notes\n1\ncup\n(\n240\nml\n) boiling\nwater\n1\ntablespoon\n(\n15\nml\n) neutral oil,\nlard\n, or schmaltz, melted if solid\nFor the Toppings:\n2\nlinks\nChinese\nsausage\n(\n3\nounces\n;\n85\ng\n), sliced thinly on a bias\n1/2\nbunch\nChinese\ngreens\n(about\n1.75\nounces\n;\n50\ng\n), such as\nchoi sum\nor gai lan, ends trimmed and blanched\n1\nlarge\negg yolk\nDirections\nFor the Seasoned Soy Sauce:\nIn a small saucepan, melt lard over medium heat until shimmering, about 1 minute. Reduce heat to medium-low and add scallions, shallot, cilantro, garlic, and ginger, and cook, swirling the pan occasionally, until the aromatics are fragrant and begin to turn golden, about 2 minutes. Add Shaoxing wine, water, light soy sauce, dark soy sauce, and sugar. Bring to a boil over high heat, then reduce heat and simmer for 7 minutes, until thickened. The sauce should be dark, smooth, and slightly thicker than bottled light soy sauce. Pour seasoned soy sauce through a fine-mesh strainer set over a medium heatproof bowl. Refrigerate until chilled.\nSerious Eats / Amanda Suarez\nFor the Clay Pot Rice:\nIn a large bowl, combine short-grain and jasmine rice and add 3/4 cup water to cover. Using your hands, vigorously swish rice until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. Return rice to bowl and cover by 3 inches. Soak for at least 1 hour and up to 3 hours. (To check if the rice has been thoroughly soaked, break a grain in half. There shouldn’t be a visible hard, white center.)\nSerious Eats / Amanda Suarez\nDrain rice through a fine-mesh strainer, making sure any excess water is allowed to drip off.\nSerious Eats / Amanda Suarez\nSet the clay pot over medium-high heat for about 2 minutes. Add the rice to the pot and top with just enough boiling water, about 1 cup (240ml) to barely cover. Bring the rice and water to a boil, stirring occasionally. When the rice and water begin to bubble, give the rice a final stir to get rid of any clumps, then allow the rice to cook, undisturbed, until water is no longer visible above the rice, about 4 minutes.\nSerious Eats / Amanda Suarez\nReduce heat to low. Using a pair of chopsticks, ventilate the rice by poking a few shallow holes on the surface. Lay the Chinese sausage and blanched greens in the center of the clay pot in an even layer on top of the rice. Cover clay pot and cook over low heat until you can hear a consistent sizzling crackle, about 10 minutes. (Try not to open the lid to check; inconsistent pops mean that the heat is too high.)\nSerious Eats / Amanda Suarez\nWithout lifting the lid, drizzle lard, schmaltz, or oil all around the lid's rim, allowing it to trickle down into the rice. Position the clay pot so that a quarter of its base is sitting directly over the flame. Continue to cook, rotating the clay pot a quarter-turn every minute until the sizzling sound stops and the escaping steam slows to thin wisps of smoke, about 13 minutes. Be careful not to burn the rice; if the vapor escaping the pot becomes a single, slow wisp or you begin to smell smoke, remove from heat. Remove clay pot from heat and let stand, covered, for 2 minutes.\nSerious Eats / Amanda Suarez\nTo Serve:\nRemove the lid, place the egg yolk in the center of the rice, and drizzle with the desired amount of seasoned soy sauce, stirring to mix well. Serve in the clay pot itself, dividing portions up into smaller individual bowls. Once most of the rice has been served, use a metal spoon to scrape up the crispy rice on the bottom, optionally crumbling it into the fluffier rice mixture.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nCantonese clay pot (about 1 quart in capacity and 18cm in diameter), gas stove\nNotes\nUsing both jasmine and a short- or medium-grain variety produces rice that’s both fluffy and chewy, a texture I particularly enjoy. However, you’re more than welcome to use just one kind of rice instead of a blend.\nMake-Ahead and Storage\nThe seasoned soy sauce can be refrigerated in an airtight container for up to 1 week.\nRice & Grains\nThe Latest\nWhite Rice\nChinese\nEast Asian"
}