{
  "url": "https://www.seriouseats.com/cantonese-lobster-chinese-ginger-scallion-recipe",
  "image_url": "https://www.seriouseats.com/thmb/hPF3Jdxmh6yzhV3Uhy1aL9Ud9q4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__05__20130527-cantonese-lobster-15-ab9c4cb19dfc4605a9acbf8deba1d91d.jpg",
  "tags": [
    "Seafood Mains",
    "Chinese",
    "Seafood Stir-Fry",
    "Lobster",
    "Ginger"
  ],
  "title": "Cantonese-Style Lobster With Ginger and Scallions",
  "full_text": "Cantonese-Style Lobster With Ginger and Scallions\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nCooling Time\n5 mins\nTotal\n40 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\nShaoxing wine\nor dry sherry\n1\ntablespoon\nsoy sauce\n1/2\ncup\ncornstarch\n, divided\n1/2\ncup\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\nlobsters\n, preferably soft shell, about\n1 1/4 pounds\neach\n1\nquart\nvegetable, canola, or\npeanut oil\n1/2\nteaspoon\nwhite pepper\n1\nteaspoon\nsalt\n1\n(2-inch) knob\nginger\n, peeled and cut into fine matchsticks\nSmall bunch\nscallions\n, whites finely sliced on the bias\n1\nlong\ngreen hot pepper\n, finely sliced on the bias\n12\nyellow chives\n, cut into 2-inch pieces (optional)\nDirections\nCombine wine, soy sauce, and 1 tablespoon cornstarch in a small bowl and mix with a fork until smooth. Stir in chicken stock. Set aside.\nSerious Eats / J. Kenji López-Alt\nAdd 1 inch of water to a pot or wok fitted with a steamer attachment and bring to a boil. Add lobsters and steam for 3 minutes. Remove and transfer to cutting board. Allow to cool slightly.\nSerious Eats / J. Kenji López-Alt\nTwist off tail and claws from lobsters. Remove guts from lobster head and rinse clean for garnish. Using a heavy chef's knife or cleaver, split tails in half lengthwise, then into thirds crosswise forming six pieces. Transfer to a large bowl. Cut both knuckles from each claw and add to bowl with tails. Remove small side of claw by breaking it off by hand and add to bowl. Cut each claw in half exposing meat and add to bowl.\nSerious Eats / J. Kenji López-Alt\nHeat oil to 375°F (190°C) in a large wok, adjusting heat as necessary to maintain temperature. Season lobster with salt and pepper. Add remaining cornstarch to bowl with lobster and toss until pieces are well-coated. Carefully add lobster pieces to hot oil one piece at a time until half of them have been added. Fry, agitating occasionally with a metal spider, until the cornstarch coating is crisp and pale golden brown, about 1 1/2 minutes. Transfer to a colander set in a bowl to drain. Repeat with remaining lobster pieces.\nSerious Eats / J. Kenji López-Alt\nPour off all but 1 tablespoon oil (save it for another use) and return wok to high heat until lightly smoking. Add ginger, scallions, hot pepper, and yellow chives (if using) and cook, stirring and tossing constantly, until fragrant and very gently softened, about 1 minute. Return lobster to pan and toss to coat. Stir up wine mixture (cornstarch may have settled to the bottom of the bowl) and add to wok. Cook, stirring and tossing constantly until mixture has bubbled and thickened, coating the lobster and vegetables. Immediately transfer to a serving platter, garnish with lobster heads, and serve.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nWok\n, pot with steamer attachment\nRead More\nHow To Buy A Lobster | The Food Lab\nSous Vide Lobster\nSeafood Mains\nChinese\nSeafood Stir-Fry\nLobster\nGinger"
}