{
  "url": "https://www.seriouseats.com/cantonese-clay-pot-rice-with-velveted-chicken-recipe-7509614",
  "image_url": null,
  "tags": [
    "White Rice",
    "The Latest",
    "Chinese",
    "Rice & Grain Mains",
    "East Asian"
  ],
  "title": "Cantonese Clay Pot Rice With Velveted Chicken and Mushrooms (北菇滑雞煲仔飯)",
  "full_text": "Cantonese Clay Pot Rice With Velveted Chicken and Mushrooms (北菇滑雞煲仔飯)\nJump to recipe\nPrep\n45 mins\nCook\n40 mins\nSoaking and Marinating Time\n90 mins\nTotal\n2 hrs 55 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Seasoned Soy Sauce:\n1\ntablespoon\n(\n15\nml\n)\nlard\n, schmaltz, or neutral oil\n1\nscallion\n, root end trimmed, white and green parts cut into 1-inch segments\n1\nsmall\nshallot\n(\n1\nounce\n;\n30\ng\n), thinly sliced\n1\nounce\n(\n30\ng\n)\ncilantro\n(about\n1/2\nbunch\n), cut into 1-inch segments (about\n1/3\ncup\n)\n4\nmedium\ncloves garlic\n(\n20\ng\n), smashed\n1\n(1-inch)\nknob\nfresh peeled\nginger\n(\n10\ng\n), sliced thinly\n2\ntablespoons\n(\n30\nml\n)\nShaoxing wine\n1/3\ncup\n(\n80\nml\n)\nwater\n1/3\ncup\n(\n80\nml\n)\nlight soy sauce\n1/3\ncup\n(\n80\nml\n)\ndark soy sauce\n2\ntablespoons\n(\n30\ng\n)\ngranulated sugar\nFor the Rice:\n1\ncup\njasmine rice\nor an equal-parts mix of jasmine and short-grain (such as koshihikari) rice (\n7\nounces\n;\n200\ng\n), see notes\n1\ncup\n(\n240\nml\n) hot\nwater\n1\ntablespoon\n(\n15\nml\n)\nlard\n, schmaltz, or neutral oil\nFor Washing the Chicken:\n1\nwhole\nbone-in, skin on\nchicken leg\n(\n200\ng\n), chopped into 1-inch pieces with a cleaver\n1\ntablespoon\nDiamond Crystal\nkosher salt\n(\n9\ng\n); for table salt, use half as much by volume or the same weight\n1\nteaspoon\nbaking soda\nFor Marinating the Chicken:\n2\nteaspoons\n(\n10\nml\n)\nShaoxing wine\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use a pinch\n1\nteaspoon\n(\n5\nml\n)\nvegetable\nor other neutral\noil\n1\nteaspoon\n(\n5\nml\n)\nlight soy sauce\n1\ntablespoon\n(\n15\nml\n)\noyster sauce\n1\npinch\nwhite pepper\n1\ntablespoon\ncornstarch\nor potato starch (\n0.3\nounce\n;\n8\ng\n)\n1\n(1-inch)\nknob\nfresh peeled\nginger\n(about\n3/4\nounce\n;\n20\ng\n), peeled, smashed, and sliced thinly\n3\nwhole\ndried shiitake mushrooms\n(\n11\ng\n), washed and soaked for at least 1 hour and up to overnight, thinly sliced\nDirections\nFor the Seasoned Soy Sauce:\nIn a small saucepan, melt lard over medium heat until shimmering, about 1 minute. Reduce heat to medium-low and add scallions, shallot, cilantro, garlic, and ginger, and cook, swirling the pan occasionally, until the aromatics are fragrant and begin to turn golden, about 2 minutes. Add Shaoxing wine, water, light soy sauce, dark soy sauce, and sugar. Bring to a boil over high heat, then reduce heat and simmer for 7 minutes, until thickened. The sauce should be dark, smooth, and slightly thicker than bottled light soy sauce. Pour seasoned soy sauce through a fine-mesh strainer set over a medium heatproof bowl. Refrigerate until chilled.\nSerious Eats / Amanda Suarez\nMeanwhile, Wash the Chicken:\nIn a medium-sized bowl, cover the chicken with water and rinse off as much blood as possible. Add 1 cup water, along with salt and baking soda, and massage the chicken, tenderizing it and removing as much residual blood as possible. Drain well, squeeze gently to remove as much moisture as possible, and set aside.\nSerious Eats / Amanda Suarez\nFor the Rice:\nIn a large bowl, combine short-grain and jasmine rice and cover by 2 inches with cool water. Using your hands, vigorously swish rice until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. (Rinsing the grains just once retains more of the starch and flavors of the rice.) Cover rice with at least double the amount of water and soak for at least 1 hour and up to 3 hours. When the rice has finished soaking, drain it well through a fine-mesh sieve. (To check if the rice has thoroughly soaked, break a grain in half. There shouldn’t be a visible hard, white center.)\nSerious Eats / Amanda Suarez\nMake the Marinade:\nIn a medium bowl, whisk together Shaoxing wine, salt, oil, light soy sauce, oyster sauce, white pepper, and potato starch. Add the chicken, gently squeezing it to work the marinade into the meat.\nSerious Eats / Amanda Suarez\nAdd the ginger and shiitake mushrooms, tossing to coat, then transfer to refrigerator and let marinate for at least 30 minutes and up to 2 days.\nSerious Eats / Amanda Suarez\nCook the Rice:\nSet the clay pot over medium-high heat until hot to the touch, about 2 minutes. Add the rice to the pot and top with just enough water to barely cover. Bring the rice and water to a boil, stirring occasionally. When the rice and water begin to bubble, give the rice a final stir to get rid of any clumps, and allow the rice to cook until water is no longer visible above the rice, about 2 minutes.\nSerious Eats / Amanda Suarez\nReduce heat to low. Using a pair of chopsticks, ventilate the rice by poking a few shallow holes on the surface of the rice. Slide the marinated chicken, ginger, and shiitake mushrooms onto the rice in an even layer.\nSerious Eats / Amanda Suarez\nCover clay pot with lid and allow rice and chicken to cook on low heat until the rice begins to crackle, about 10 minutes. (Do not open the lid. Listening carefully, you should hear a consistent sizzling crackle; loud, inconsistent pops mean that the heat is too high.)\nSerious Eats / Amanda Suarez\nDrizzle lard, schmaltz, or oil on the rim of the lid and allow it to trickle down into the rice. With the lid still on, angle the clay pot so that a quarter of the bottom of the pot is toasting directly over the flame. Rotate the clay pot every minute, so that another quarter of the pot is being toasted. Repeat this process for another 13 minutes. Be careful not to burn the rice; if the vapor escaping the pot becomes a single, slow wisp or you begin to smell smoke, reduce heat to low. The rice is done when it stops sizzling and the steam slows. Remove clay pot from heat and rest for 2 minutes.\nSerious Eats / Amanda Suarez\nTo Serve:\nRemove the lid and drizzle with the desired amount of seasoned soy sauce, stirring to mix well. Serve in the clay pot itself, dividing portions up into smaller individual bowls. Once most of the rice has been served, use a metal spoon to scrape up the crispy rice on the bottom, optionally crumbling it into the fluffier rice mixture.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nCantonese clay pot (about 1 quart in capacity and 18cm in diameter), gas stove\nNotes\nUsing both jasmine and a short- or medium-grain variety produces rice that’s both fluffy and chewy, a texture I particularly enjoy. However, you’re more than welcome to use just one kind of rice instead of a blend.\nSerious Eats / Amanda Suarez\nMake-Ahead and Storage\nThe seasoned soy sauce can be refrigerated in an airtight container for up to 1 week.\nWhite Rice\nThe Latest\nChinese\nRice & Grain Mains\nEast Asian"
}