{
  "url": "https://www.seriouseats.com/caramel-bonbon-chocolate-candy-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-lISVLW3yg5AR-8c9Pex3cPLQA8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__02__20120127-188620-bonbons-610x458-18-c6e66b16fa74495296966c635627e833.jpg",
  "tags": [
    "Candy",
    "Christmas Candies",
    "Stovetop",
    "Chocolate"
  ],
  "title": "Boozy Caramel Bonbons Recipe",
  "full_text": "Boozy Caramel Bonbons Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n2 hrs\nCooling and Chilling Time\n25 mins\nTotal\n55 mins\nServes\n20 bonbons\nCook Mode\n(Keep screen awake)\nIngredients\n6.9\nounces\ngranulated sugar\n2\nounces\nwater\n2\nounces\nlight corn syrup\n5\nounces\nheavy cream\n2\ntablespoons\nbutter\nSeeds scraped from\n1/2\nvanilla bean\n1/2\nteaspoon\nsalt\n2\ntablespoons\nrum, whiskey, or\nbourbon\nColored cocoa butter\n(optional)\n16\nounces\n58% couverture chocolate\nSea salt\nfor sprinkling\nDirections\nIn a medium saucepan with a heavy bottom, combine sugar, water, and corn syrup and stir. Wash down sides with a pastry brush dipped in clean water, then place over medium-high heat for 7-10 minutes, at which point mixture will begin to darken. Swirl pot to even out caramelization, and allow caramel to turn deep amber.\nThen, stand back and slowly add cream (mixture will sputter, rise in pot, and spit; be very careful) and turn off heat. Once it is safe, whisk until smooth. Whisk in butter until it melts completely. Whisk in vanilla seeds, booze, and salt and allow mixture to cool completely.\nChop chocolate into very small pieces and divide chocolate evenly into one very large bowl and one small bowl (the large bowl is the bowl that you will melt the chocolate in, the small one contains the \"seed\" chocolate for tempering). Set a pot of water to boil on stove. When water is boiling, turn off heat and place large bowl of chocolate over water. Temper chocolate (for a full tutorial, click\nhere\n) by stirring to bring to chocolate to 115°F (46°). Then, begin adding reserved chocolate a little at a time and vigorously stirring mixture, without stopping. Continue to add reserved seed chocolate and agitate until chocolate comes down to 90°F (32°C). The chocolate is now tempered. Check to be sure that there are no solid pieces of chocolate left in bowl.\nWave mold over a flame on stove or place it in a warm oven for just a moment to warm it up slightly (this will help the chocolate flow over it, rather than seizing up immediately when it hits the mold, which prevents air bubbles from forming). Then pour chocolate into each cavity in mold. Allow it to stand for 10 seconds, then invert mold over bowl, allowing excess chocolate to run off. Tap mold to shake out additional excess, then turn mold back over. With a flexible metal scraper, scrape over top, cleaning off any excess chocolate on the sides. Place mold in the fridge for 2-3 minutes, then remove.\nSerious Eats / Lauren Weisenthal\nSerious Eats / Lauren Weisenthal\nSprinkle a pinch of sea salt into each shell. Using a piping bag fitted with a small tip or a cone of parchment, pipe cooled caramel into shells, stopping a 3-4 millimeters below edge (it's very important to leave room, otherwise the chocolates will not seal). Ensure chocolate is still tempered (if it is not, you will need to bring it back to 115°F once again, then down to 90°F, otherwise, your bonbons will be streaky on the bottom). Pipe or pour chocolate over tops of each bonbon. Scrape top clean to create a seal, then place mold in fridge for 2-3 minutes and remove. Twist mold to release chocolates, then turn it upside down and tap them out of mold. Clear work surface of bonbons, and pound mold against counter to release any stragglers. Store chocolates in a cool, dry place.\nSerious Eats / Lauren Weisenthal\nSerious Eats / Lauren Weisenthal\nSerious Eats / Lauren Weisenthal\nSpecial Equipment\nBonbon mold, instant-read thermometer, flexible metal scraper, food scale\nNotes\nYou can purchase couverture chocolate on Amazon. Molds and cocoa butter color are available on the\nChef Rubber\n.\nAll measurements are in weight, as volume measures can be very imprecise. I strongly recommend using a scale for all pastry projects.\nWhen making bonbons, there is always a fair amount of chocolate left over. Scrape all of this chocolate onto parchment and allow it to cool and harden at room temperature. Then wrap tightly and store. This chocolate may be used for all kinds of baking or chocolate projects, but should not be used as the \"seeds\" during tempering.\nCandy\nChristmas Candies\nStovetop\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/boozy-caramel-bonbons-recipe.webp?"
}