{
  "url": "https://www.seriouseats.com/cardamom-lemonade-recipe-11743507",
  "image_url": "https://www.seriouseats.com/thmb/ZntdeXcTc6Yrm2boRt1_7TbSir0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250528-SEA-MarathiLemonade-JatinSharma-Beauty1-45-210c98a3e71d48a98e100082b92b8dfb.jpg",
  "tags": [
    "Non-Alcoholic Drinks",
    "The Latest",
    "Recipes",
    "Indian",
    "Lemon"
  ],
  "title": "The Unexpected Ingredient for the Ultimate Refreshing Lemonade",
  "full_text": "The Unexpected Ingredient for the Ultimate Refreshing Lemonade\nClose\nJump to recipe\nPrep\n30 mins\nResting Time:\n3 hrs\nTotal\n3 hrs 30 mins\nServes\n4\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n18\ngreen cardamom\npods\n(see notes)\n3\npounds\n(\n1.3\nkg\n) room-temperature\nlemons\n(\n10 to 12\nmedium\nlemons\n)\n14\nounces\nsugar\n(\n2\ncups\n;\n400\ng\n)\n2\nteaspoons\ngreen cardamom seeds\n(see notes)\n24\nounces\ncold\nwater\n(\n3\ncups\n;\n700\nml\n)\n1\nteaspoon\nDiamond Crystal kosher salt\n, plus more to taste; for table salt, use half as much by volume\nDirections\nUse a mortar and pestle or rolling pin to gently crack open cardamom pods to release their flavor and aroma. Seeds should be visible but not popping out. Set aside.\nSerious Eats / Jatin Sharma\nRoll lemons firmly against counter to soften their rinds. Halve and juice lemons; pour juice into a sealable container and refrigerate. Cut rinds into 1-inch chunks. In a large nonreactive mixing bowl, mix lemon rinds well with sugar and cracked cardamom pods. Cover with plastic wrap or a lid, and let stand at room temperature, stirring once every 45 minutes or so, until sugar has completely dissolved, about 3 hours. (You can let the mixture stand up to 12 hours, if desired.)\nSerious Eats / Jatin Sharma\nWhile the lemons macerate, use a spice grinder or mortar and pestle to pulverize the cardamom seeds into a fine powder. You should get between 2 and 3 teaspoons of powder. Set aside in an airtight jar until needed (see notes).\nSerious Eats / Jatin Sharma\nStir the lemon chunks once more, tasting and smelling the mixture to ensure it has a cardamom aroma and flavor.\nSerious Eats / Jatin Sharma\nAdd water, 8 ounces (1 cup) of reserved lemon juice, and 1 teaspoon ground cardamom to the macerated lemons (see notes). Stir well, then strain through a nonreactive fine-mesh strainer or piece of cheesecloth into a glass or ceramic container, pressing to express liquid; discard solids.\nSerious Eats / Jatin Sharma\nStir 1/2 teaspoon ground cardamom and salt into the liquid. At this point, the concentrated cardamom lemonade can be refrigerated in a tightly sealed glass or other nonreactive container for up to 1 week.\nSerious Eats / Jatin Sharma\nTo serve, pour lemonade over ice and adjust to taste with additional water or lemon juice, depending on personal preference; bear in mind, though, that the lemonade will be diluted as the ice melts.\nSerious Eats / Jatin Sharma\nSpecial Equipment\nLemon squeezer or juicer, mortar and pestle or spice grinder, cheesecloth or nonreactive fine-mesh strainer, 2-quart pitcher.\nNotes\nI prefer a tart lemonade, so this recipe calls for adding  8 ounces (1 cup) of reserved lemon juice to the lemon rind syrup. If you prefer your lemonade sweeter, start with 6 ounces of lemon juice and taste before adding more.\nGreen cardamom is generally considered sweeter and more versatile, suitable for both savory and sweet dishes, while black cardamom has a smokier, more robust flavor and is typically used in savory dishes. Do not substitute with black cardamom in this recipe.\nIf green cardamom seeds are unavailable, you can substitute with ground cardamom and omit pulverizing in step 3.\nMake-Ahead and Storage\nThe concentrated lemonade can be refrigerated in an airtight nonreactive container for up to 1 week.\nReserve any extra ground cardamom in an airtight jar at room temperature for up to 2 months.\nNon-Alcoholic Drinks\nThe Latest\nRecipes\nIndian\nLemon"
}