{
  "url": "https://www.seriouseats.com/caribbean-johnny-cakes-recipe-8762362",
  "image_url": "https://www.seriouseats.com/thmb/Rau2lurvgHzyTmGkCux7iD2InsY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241210-SEA-JohnnyCakes-AmandaSuarez-Hero4-49-f6117d0028114f6b942f4f1d86e48bb1.jpg",
  "tags": [
    "The Latest",
    "Sides",
    "Snacks & Appetizers",
    "Bread",
    "Vegetarian"
  ],
  "title": "Johnny Cakes: Buttery, Soft, Pillowy, and Fried to Golden Perfection",
  "full_text": "Johnny Cakes: Buttery, Soft, Pillowy, and Fried to Golden Perfection\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nResting Time\n30 mins\nTotal\n60 mins\nServes\n12\nMakes\n12 Johnny Cakes\nCook Mode\n(Keep screen awake)\nIngredients\n600\ng\nbread flour\n(\n21 1/4\nounces\n;\n4 1/4\ncups\n), plus more for dusting\n3\ntablespoons\nfine\nyellow cornmeal\n(\n1 1/4\nounces\n;\n23\ng\n)\n3\ntablespoons\ngranulated sugar\n(\n1 1/3\nounces\n;\n38\ng\n)\n1\ntablespoon\nbaking powder\nplus\n1\nteaspoon\nbaking powder\n1 1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3\ntablespoons\nunsalted butter\n, cubed, at room temperature\n1 1/2\ncups\n(\n355\nml\n)\nwater\n2\nquarts\n(\n1.9\nL\n)\ncanola or other neutral oil\n, for frying\nDirections\nIn a large bowl, thoroughly whisk together flour, cornmeal, sugar, baking powder, and salt. Using your fingers, rub butter into dry ingredients until mixture is crumbly with no large chunks of butter.\nSerious Eats / Amanda Suarez\nMake a well in the center of the flour mixture, then pour water into the well. Using a wooden spoon, then your hands, mix water into flour mixture until a firm yet elastic dough ball is formed.\nSerious Eats / Amanda Suarez\nOn a lightly floured surface, turn out the dough and knead until smooth and elastic.\nSerious Eats / Amanda Suarez\nPlace the dough in a clean bowl and cover with a damp towel. Let rest at room temperature for 30 minutes.\nSerious Eats / Amanda Suarez\nAfter the dough has rested, divide into 12 equal-size balls (about 90g; 3 ounces each).\nSerious Eats / Amanda Suarez\nOn a clean work surface, working with 1 dough ball at a time and covering the rest with a damp towel, roll into a small 4-inch (10cm) round. Repeat with remaining dough balls.\nSerious Eats / Amanda Suarez\nLine a rimmed baking sheet with paper towels or wire rack. In a large Dutch oven filled with about 2 inches of oil (or an electric fryer filled to its minimum fill line), heat oil over medium-high heat until it registers 350°F (177°C) on an instant-read thermometer. Working in batches of about 3 at a time to avoid crowding, fry dough rounds until golden on first side, 2 to 3 minutes. Turn Johnny cakes and fry until second side is golden, 2 to 3 minutes longer. Remove from oil and drain on a wire rack or paper towels. Return oil to 350°F (177°C) and repeat with remaining dough rounds. Transfer to a serving platter and serve hot, warm, or at room temperature.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nLarge Dutch oven or deep fryer, instant-read thermometer, rimmed baking sheet, wire rack or paper towels\nMake Ahead and Storage\nJohnny cakes are best served immediately, but leftovers can be rewarmed in an air fryer at 350ºF (175ºC) until warmed through, about five minutes.\nThe Latest\nSides\nSnacks & Appetizers\nBread\nVegetarian"
}