{
  "url": "https://www.seriouseats.com/carne-adovada-adobada-chili-braised-pork-recipe",
  "image_url": null,
  "tags": [
    "Southwestern & Tex Mex",
    "Pork Shoulder",
    "Chile Pepper",
    "Pork Mains",
    "Chili"
  ],
  "title": "Carne Adovada (New Mexico-Style Pork With Red Chiles) Recipe",
  "full_text": "Carne Adovada (New Mexico-Style Pork With Red Chiles) Recipe\nJump to recipe\nPrep\n5 mins\nCook\n3 hrs\nActive\n45 mins\nTotal\n3 hrs 5 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nwhole\ndried ancho chiles\n, seeds and stems removed\n4\nwhole\ndried pasilla chiles\n, seeds and stems removed\n1\nquart\n(\n32\nounces\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n1/2\ncup\nraisins\n1\ncup\nfrozen orange juice concentrate\n3\nwhole\nchipotle chiles canned in adobo\n2\ntablespoons\nwhite vinegar\n2\ntablespoons\nAsian fish sauce\n3\npounds\nboneless pork shoulder\n, trimmed and cut into 2-inch thick cubes\n2\ntablespoons\nvegetable oil\n2\nmedium\nonions\n, thinly sliced (about\n2\ncups\n)\n6\nmedium\ncloves garlic\n, minced (about\n2\ntablespoons\n)\n2\nteaspoons\ndried oregano\n1\ntablespoon\nground cumin\n3\nbay leaves\nKosher salt\nCorn tortillas\n, cilantro, diced onions, lime wedges, and queso fresco for serving (optional)\nDirections\nAdd dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Add chicken stock, raisins, orange juice concentrate, chipotles in adobo, white vinegar, and fish sauce. Bring to a boil over high heat, reduce to a bare simmer, and let cook until chiles are totally softened, about 15 minutes. Blend into a smooth puree using an immersion blender or by transferring to a countertop blender. Set aside.\nCarefully pat pork cubes dry with paper towels or a clean kitchen towel. Heat vegetable oil in a large heavy-bottomed Dutch oven over high heat until smoking. Add pork all at once and spread evenly over bottom surface. (It's ok if not all the pork is touching the bottom or if the pan is crowded.) Cook without moving until bottom surface is well browned, about 8 minutes. Transfer pork to a cutting board and set aside. Add onions and garlic to Dutch oven and cook, stirring frequently, until softened and beginning to brown, about 10 minutes. Add oregano and cumin and cook, stirring constantly, until fragrant, about 30 seconds.\nAdd chile mixture to Dutch oven and stir to scrape up any browned bits from the bottom. Add bay leaves along with the pork and any accumulated juices. Bring to a boil then reduce to a bare simmer. Cover, leaving lid slightly ajar, and cook, stirring occasionally until pork chunks break apart when you apply pressure with a spoon, about 2 hours.\nSauce should be thick, with an almost ketchup-like consistency. If too thin, increase heat to a light simmer and cook, stirring frequently, until reduced to the desired consistency. Season to taste with salt.\nServe pork with corn tortillas, cilantro, diced onions, lime wedges, and queso fresco. Pork can be stored in a sealed container in the fridge for up to 5 days.\nSpecial Equipment\nLarge Dutch oven\n,\nimmersion blender\nor\nblender\nRead More\nAsk The Food Lab: On Browning Ground Meat In Recipes\nThese 4 Mexican Braises Will Jump-Start Your Fall\nSouthwestern & Tex Mex\nPork Shoulder\nChile Pepper\nPork Mains\nChili"
}