{
  "url": "https://www.seriouseats.com/carrot-and-feta-borek-recipe-11730300",
  "image_url": "https://www.seriouseats.com/thmb/_ij-yXNrHMQFmAmgRJCDT8zASAA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250506-SEA-CarrotFetaBorek-VictorProtasio-Beauty1-24-69232ea3714b454db1a3b1f76c81b01e.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Recipes",
    "Vegetarian Snacks & Appetizers",
    "Pastries"
  ],
  "title": "This Beloved Savory Mediterranean Pastry Is a Spiraled Delight",
  "full_text": "This Beloved Savory Mediterranean Pastry Is a Spiraled Delight\nClose\nJump to recipe\nCook\n75 mins\nCooling Time:\n10 mins\nTotal\n85 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\ndrained julienne-cut\nsun-dried tomatoes packed in oil\n, chopped, plus\n1/4\ncup\n(\n60\nml\n) oil from jar, divided\n1\npound\n(\n453\ng\n) medium\ncarrots\n, shredded using the largest holes of a box grater (about\n4\ncups\nshredded; see notes)\n1/2\ncup\nchopped\nportobello mushroom\ncap (from\n1\nlarge\nmushroom\n)\n3/4\nteaspoon\nDiamond Crystal kosher sal\nt; for table salt use half as much by volume\n8\nounces\n(\n226\ng\n)\nfeta cheese\n, crumbled (about\n2\ncups\ncrumbed)\n1/2\ncup\nchopped mixed fresh tender\nherbs\n, such as mint, parsley, and/or dill\n1/2\ncup\nchopped pitted\ngreen olives\n1/4\ncup\nchopped walnuts\n2\nmedium\nscallions\n, chopped (about\n1/4\ncup\n)\n1/2\nteaspoon\ncrushed red pepper flakes\n1/4\nteaspoon\nfreshly\nground black pepper\n2\nlarge\neggs\n, divided\n2\ntablespoons\n(\n30\nml\n)\nwhole milk\n30\nfrozen phyllo pastry\nsheets\n, thawed, from\n1\n(1-pound)\npackage\n, such as Athens brand\n1\nteaspoon\neverything bagel seasoning\nor sesame seeds\nDirections\nAdjust oven rack to lower-middle position and preheat oven to 400°F (205°C). Line a rimmed baking sheet with parchment paper. Set aside.\nIn a large skillet, heat 2 tablespoons sun-dried tomato oil over medium until shimmering. Add sun-dried tomatoes, carrots, mushrooms, and salt, and cook, stirring often, until carrots and mushrooms are softened, liquid evaporates, and mixture appears dry, 4 to 5 minutes. Remove from heat and let cool for 10 minutes.\nStir feta cheese, mixed herbs, olives, walnuts, scallions, crushed red pepper, black pepper, and 1 egg into the cooled carrot mixture in skillet.\nSerious Eats / Victor Protasio\nIn a small bowl, whisk together milk, remaining 1 egg, and remaining 2 tablespoons sun-dried tomato oil.\nSerious Eats / Victor Protasio\nWorking in batches of 6 phyllo sheets for 1 spiral (keep remaining sheets covered), place 1 phyllo sheet on a work surface with long end of sheet running parallel to edge of counter. Using a pastry brush, lightly brush egg mixture along 1 short edge of sheet. Put a second phyllo sheet overlapping the short edge by 1 inch with long end of sheet running parallel to edge of counter. Press to seal both sheets together to form a sheet about 26 inches long. Lightly brush top with egg mixture (some dry spots are OK). Place 2 more phyllo sheets on top, overlapping the short edge by 1 inch. (Don’t brush the overlapping center or it will get too soggy.) Repeat brushing the top lightly with egg mixture. Place 2 more phyllo sheets and repeat overlapping in center and lightly brushing the top.\nSerious Eats / Victor Protasio\nSpread about 1 cup cooked carrot mixture along bottom (long edge) of phyllo, leaving a 1-inch border from bottom edge. Fold bottom edge of phyllo over filling and continue rolling phyllo away from you into a log (do not roll tightly).\nSerious Eats / Victor Protasio\nStarting at 1 end of the log, coil the end around itself, creating a spiral shape. Continue to wrap the log around, coiling tightly. Transfer to center of prepared baking sheet. Cover with a clean kitchen towel.\nSerious Eats / Victor Protasio\nRepeat steps 5 and 6 with remaining 24 phyllo sheets and remaining 4 cups filling to create a total of 4 more logs. Attach 1 log to the end of the first spiral on baking sheet, and wrap the log around to continue spiral. Repeat three more times to create 1 large spiral on baking sheet.\nLightly brush pastry with egg mixture (do not let egg mixture pool), taking care to coat seams where pastry logs connect to make spiral. Sprinkle with everything bagel seasoning or sesame seeds.\nSerious Eats / Victor Protasio\nBake until well browned, 25 to 30 minutes. Let cool 10 minutes before transferring to a cutting board. Cut into wedges and serve hot.\nSerious Eats / Victor Protasio\nSpecial Equipment\nLarge skillet, pastry brush, clean kitchen towel\nNotes\nWe strongly encourage you to freshly grate your own carrots rather than using store-bought pre-shredded carrots. You can shred them using the large wholes of a box grater or with the shredding disc attachment of a food processor.\nMake-Ahead and Storage\nThe filling can be made up to 24 hours in advance and refrigerated. Stir well before using.\nThis uncooked borek freezes wonderfully. Just place it in an airtight container or wrap fully with plastic wrap and freeze for up to 3 weeks. Bake directly from frozen, increasing the total bake time by 5 to 10 minutes. Leftover baked borek can be reheated on a wire rack set inside a rimmed baking sheet in a 400˚F (200˚C) oven for 15 minutes.\nSnacks & Appetizers\nThe Latest\nRecipes\nVegetarian Snacks & Appetizers\nPastries",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-beloved-savory-mediterranean-pastry-is-a-spiraled-delight.webp?"
}