{
  "url": "https://www.seriouseats.com/carrot-cake-recipe",
  "image_url": null,
  "tags": [
    "Layer Cake",
    "Thanksgiving Desserts",
    "Carrots",
    "Fall Desserts",
    "Christmas Desserts"
  ],
  "title": "Brown Butter Carrot Cake From \"BraveTart\" Recipe",
  "full_text": "Brown Butter Carrot Cake From \"BraveTart\" Recipe\nJump to recipe\nPrep\n35 mins\nCook\n65 mins\nActive\n60 mins\nCooling and Chilling Time\n2 hrs 15 mins\nTotal\n3 hrs 55 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n14\nounces\npecan\npieces (\n3 1/2\ncups\n;\n395\ng\n)\n2\npounds\nwhole, unpeeled\ncarrots\n(from\n1\n(2-pound) bag\n;\n910\ng\n)\n16\nounces\nunsalted butter\n(\n4\nsticks\n;\n450\ng\n)\n14\nounces\nwhite sugar\n(\n2\ncups\n;\n395\ng\n)\n8\nounces\nlight brown sugar\n(\n1\ncup\n, gently packed;\n225\ng\n)\n4\nteaspoons\nground cinnamon\n4\nteaspoons\nground ginger\n1\ntablespoon\nbaking powder\n1 3/4\nteaspoons\n(\n7\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1\nteaspoon\nbaking soda\n1\nteaspoon\ngrated nutmeg\n3/4\nteaspoon\nground cloves\n1/2\nounce\nvanilla extract\n(\n1\ntablespoon\n;\n15\ng\n)\n6\nlarge\neggs\n, straight from the fridge\n11\nounces\nall-purpose flour\n, such as Gold Medal (\n2 1/2\ncups\nspooned;\n310\ng\n)\n5\nounces\nwhole wheat flour\n, not stone-ground (\n1\ncup\n;\n140\ng\n)\nTo Finish:\n1\nrecipe\ncream cheese buttercream\n1\nrecipe\ntwisted carrot roses\n, optional\nDirections\nGetting Ready:\nTo better synchronize the downtime in both recipes, prepare the\ncream cheese buttercream\nbefore the cake. Adjust oven rack to the middle position and preheat to 350°F (180°C). Toast the pecans on a baking sheet until golden brown, about 10 minutes, and cool completely. Meanwhile, peel, trim, and shred the carrots, then measure out 24 ounces (6 cups, firmly packed). This can be refrigerated up to 1 week in a zip-top bag.\nIn a 2-quart stainless steel saucier, completely melt the butter over medium-low heat. Increase to medium and simmer, stirring with a heat-resistant spatula while the butter hisses and pops. Continue cooking and stirring, scraping up any brown bits that form along the pan, until the butter is golden-yellow and perfectly silent. Pour into a heat-safe measuring cup, along with all the toasty brown bits, and proceed as directed, or cover and refrigerate up to 1 week; melt before using.\nFor the Cake:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). Lightly grease three 8-inch anodized aluminum cake pans and line with parchment (\nexplanation and tutorial here\n). If you don’t have 3 pans, it’s okay to bake the cakes in stages; the batter will keep at room temperature until needed.\nCombine white sugar, brown sugar, cinnamon, ginger, baking powder, salt, baking soda, nutmeg, cloves, vanilla, and eggs in the bowl of a stand mixer fitted with the whisk attachment. Mix on low to moisten, then increase to medium and whip until thick and fluffy, about 8 minutes. Meanwhile, whisk together all-purpose and whole wheat flours. Drizzle in the brown butter in a steady stream, then reduce speed to low and add the flours. Once smooth, fold in shredded carrots and pecans with a flexible spatula.\nDivide batter between the prepared cake pans, about 33 ounces each. If you don't have 3 pans, the remaining batter can be held at room temperature up to 3 hours (see notes). Bake until cakes are golden, about 45 minutes. A toothpick inserted into the center will have a few crumbs still attached, and your fingertip will leave a slight indentation in the puffy crust.\nCool cakes directly in their pans for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off the parchment, and return cakes right side up (covered in plastic, the cakes can be left at room temperature for a few hours). Prepare the buttercream.\nSerious Eats / Vicky Wasik\nFor the Crumb Coat:\nLevel cakes with a serrated knife (\nfull directions here\n) and set the scraps aside for snacking. Place one layer on a heavy cast iron turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with exactly 1 cup buttercream, using an offset spatula to spread it evenly from edge to edge. Repeat with the second and third layers, then cover the sides of the cake with another cup of buttercream, spreading it as smoothly as you can (\ntutorial here\n). Refrigerate cake until the buttercream hardens, about 30 minutes.\nRe-whip remaining buttercream to restore its creamy consistency, then use to decorate the chilled cake as desired; finish with\ntwisted carrot roses\n(optional). Let the cake return to cool room temperature before serving. Under a cake dome or an inverted pot, the frosted cake and carrot roses will keep 24 hours at cool room temperature. After cutting, wrap leftover slices individually and store at cool room temperature up to 2 days more.\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n, two or three 8-inch anodized aluminum\ncake pans\n(preferably 3 inches deep),\nserrated knife\n,\noffset spatula\n, cast iron turntable\nNotes\nWhen allowed to cool below 80°F (27°C), the brown butter may thicken the batter. While strange to see, this will not change how the batter is handled or baked. Brown butter hotter than 110°F (43°C) will, conversely, thin the batter, yet produce an otherwise identical cake.\nMake-Ahead and Storage\nUnder a cake dome or an inverted pot, the frosted cake and carrot roses will keep 24 hours at cool room temperature. After cutting, wrap leftover slices individually and store at cool room temperature up to two days more.\nRead More\nCream Cheese Buttercream Frosting Recipe\nTwisted Carrot Roses From \"BraveTart\" Recipe\nLayer Cake\nThanksgiving Desserts\nCarrots\nFall Desserts\nChristmas Desserts"
}