{
  "url": "https://www.seriouseats.com/carrot-cake-baklava-recipe-11717493",
  "image_url": "https://www.seriouseats.com/thmb/ZgPlzrOvcxc1oLl1V-ecQBQ_w-M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250417-SEA-CarrotCakeBaklava-RobbyLozano-Beauty2-61-de80a745283e4b66a59b77b72f334f47.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Recipes",
    "Easter",
    "Pastries"
  ],
  "title": "Carrot Cake Meets Baklava in This Delightful Spring Dessert",
  "full_text": "Carrot Cake Meets Baklava in This Delightful Spring Dessert\nClose\nJump to recipe\nPrep\n40 mins\nCook\n55 mins\nCooling TIme:\n2 hrs\nTotal\n3 hrs 35 mins\nServes\n12\nto 24\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\ncups\ngranulated sugar\n(\n8.75\nounces\n;\n248\ng\n), divided\n3/4\ncup\n(\n180\nml\n)\nwater\n1/2\ncup\n(\n120\nml\n)\nhoney\n1/2\ncup\nplus\n2\ntablespoons\npacked\nlight brown sugar\n, divided\n1 1/2\ncups\nroasted, salted\npistachios\n(\n5.5\nounces\n;\n212\ng\n)\n1 1/2\ncups\ntoasted\npecans\n(\n5.5\nounces\n;\n212\ng\n)\n1 1/2\ncups\nshredded\ncarrots\n, (about\n12\nounces\n;\n340\ng\n)\n1/2\ncup\nshredded sweetened coconut\n(\n3\nounces\n;\n85\ng\n)\n2\nteaspoons\nground cinnamon\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n1/2\nteaspoon\nground ginger\n1/4\nteaspoon\nground\ncardamom\n2\npounds\nfrozen\nphyllo dough\nsheets, thawed (such as The Fillo Factory brand)\n9\nounces\nghee\nor butter, melted (see notes)\nDirections\nIn a small saucepan, stir together 1 cup sugar, water, honey, and 1/2 cup brown sugar. Bring to a boil over medium heat. Once boiling, reduce heat to low and simmer, stirring occasionally, until sugar has dissolved, 2 to 3 minutes. Set aside to cool while preparing baklava.\nIn a food processor, pulse pistachios and pecans until finely chopped, about 12 pulses. Transfer nuts to a large bowl and add carrots, coconut, cinnamon, salt, ginger, cardamom, remaining 1/4 cup sugar, and remaining 2 tablespoons brown sugar and stir to combine.\nAdjust oven rack to lower-middle position and preheat oven to 350°F (175°C). With a pastry brush, brush bottom and sides of a 9- x 13-inch baking pan with melted ghee or butter.\nSerious Eats / Robby Lozano\nWorking with half of phyllo at a time, unroll phyllo onto a clean work surface and use a sharp knife to trim in to 9- x 13-inch rectangle to fit the prepared baking pan. Discard or reserve phyllo trimmings for another use.) Repeat with remaining phyllo and stack phyllo together and cover with a damp paper towel. Place 1 phyllo sheet in baking pan, and brush top with ghee or butter. Top with another phyllo sheet and brush with ghee or butter. Continue layering 8 more phyllo sheets, brushing each layer with ghee or butter (a total of 10 sheets on bottom layer).\nSerious Eats / Robby Lozano\nSprinkle 1 cup of carrot mixture evenly over top sheet of phyllo. Place another phyllo sheet over carrot mixture, and brush with ghee. Continue layering 7 more phyllo sheets, brushing each layer with ghee or butter (a total of 8 phyllo sheets).\nSprinkle 2 cups of the remaining carrot mixture evenly over top sheet of phyllo. Place another phyllo sheet over carrot mixture, and brush with ghee. Continue layering 7 more phyllo sheets with butter (a total of 8 phyllo sheets). Sprinkle remaining carrot mixture over top phyllo sheet. Place another phyllo sheet over carrot mixture and brush with ghee or butter. Continue with remaining phyllo sheets until all phyllo sheets are used, ending with a final brushing of ghee.\nSerious Eats / Robby Lozano\nUsing a sharp knife, cut baklava lengthwise into 2-inch wide strips, making sure to cut all the way through the bottom of pastry. Cut baklava diagonally into 2-inch wide strips to create diamond shaped pieces.\nSerious Eats / Robby Lozano\nBake baklava until deep golden brown and crispy, rotating pan halfway through baking, about 1 hour. Remove from oven and immediately pour cooled honey syrup evenly over hot baklava, making sure to reach edges of pan. Set pan on a wire rack and cool, uncovered at room temperature, at least 2 hours or up to 24 hours before serving or storing (see notes).\nSerious Eats / Robby Lozano\nSpecial Equipment\nSmall saucepan, 9- x 13-inch baking pan, pastry brush\nNotes\nWhile you can use plain melted butter, using ghee or\nclarified butter\n, which have water removed, will result in slightly crispier pastry.\nTo avoid soggy baklava, make sure the baklava has cooled completely before covering.\nMake-Ahead and Storage\nThe simple syrup can be refrigerated in an airtight container for up to 2 months.\nBaklava tastes best after it has rested for 4 to 6 hours (or, ideally, overnight), when the pastry has had a chance to absorb the syrup and the flavors are more pronounced.\nCooled baklava can be kept in an airtight container at room temperature for up to 5 days. After that, it can be refrigerated for up to 2 weeks.\nDesserts\nThe Latest\nRecipes\nEaster\nPastries",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/carrot-cake-meets-baklava-in-this-delightful-spring-dessert.webp?"
}