{
  "url": "https://www.seriouseats.com/carrot-halwa-gajar-ka-halwa-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0B33q5IzkjqE7EFQ-10JpKOrNjc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__11__20121107-cookiemonster-carrothalwa-8bbec0aa048b4dfb96e0c30e085766c7.JPG",
  "tags": [
    "Carrots",
    "Indian",
    "Dessert Bars",
    "Diwali"
  ],
  "title": "Indian-Style Spiced Carrot Bars (Gajar Ka Halwa) Recipe",
  "full_text": "Indian-Style Spiced Carrot Bars (Gajar Ka Halwa) Recipe\nClose\nJump to recipe\nCook\n95 mins\nActive\n70 mins\nTotal\n95 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\nplus\n1 1/4\ncups\nvegetable oil\n, divided\n1/4\ncup\nalmonds\n(optional)\n4\npounds\ncarrots\n, peeled, then grated through the largest holes of a box grater\n8\ncups\nwhole milk\n4\ngreen cardamom\npods\n6\ntablespoons\nsugar\nSliced almonds\n,\nclotted cream\n, and\nraisins\nfor garnishing (optional)\nDirections\nIf using almonds (not just for garnish), heat 1 tablespoon vegetable oil in a Dutch oven or large heavy bottomed pot over medium heat until shimmering. Add 1/4 cup almonds and cook, stirring and tossing frequently, until lightly golden brown, about 3 minutes. Transfer to a paper towel-lined plate to drain. Set aside.\nCombine grated carrots, milk, and cardamom pods in pot and bring to a boil. Reduce heat to a simmer and cook, stirring occasionally, until all milk has evaporated, about 40 minutes.\nWhen liquid has evaporated, add oil. Fry carrot mixture in oil, stirring constantly, until darkened to dark orange/brown in color, about 30 minutes. Add sugar and fried almonds if using. Cook, stirring, for 2 minutes. Transfer halwa to an 8-inch square baking pan or other pan of your choice, spread into an even layer with an offset spatula, and let cool to room temperature. The flavor is best if the halwa is covered and stored in the refrigerator overnight.\nIf not eating right away, store, covered, in refrigerator and bring back to room temperature before serving. The flavor is best if the halwa is stored overnight.\nSpecial Equipment\nBox grater\n,\nDutch oven\nor large heavy bottomed pot,\noffset spatula\nRead More\nHalva With Spice Dried Fruit and Nuts\nCarrot Halvah Ice Cream\nMilk Creams (Indian Cashew Sweets)\nGulab Jamun\nPhirni (Indian Rice Pudding)\nCarrots\nIndian\nDessert Bars\nDiwali"
}