{
  "url": "https://www.seriouseats.com/carrot-harissa-rissotto-11731297",
  "image_url": "https://www.seriouseats.com/thmb/irfzQ3Jt9nSlMDPw8DJvvag_U-s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250506-SEA-CarrotRissotto-KelseyHansen-Beauty1-93-6e5d5ff0e52c45049dea077ed8677415.jpg",
  "tags": [
    "White Rice",
    "The Latest",
    "Recipes",
    "Rice & Grains"
  ],
  "title": "This Sweet and Fiery Risotto Breaks the Mold—and It Works",
  "full_text": "This Sweet and Fiery Risotto Breaks the Mold—and It Works\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nTotal\n55 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\ncarrots\nwith tops, green tops removed and reserved, carrots peeled and diced into 1/2-inch pieces (see notes)\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, divided\n1/4\nteaspoon\nDiamond Crystal kosher salt\n, plus more to taste; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\n1/2\ncup\nminced\ncarrot greens\nfrom above or minced fresh parsley\n1\nteaspoon\nlemon zest\nplus\n2\ntablespoons\n(\n30\nml\n)\nlemon juice\nfrom\n1\nlemon\n, divided\n1/2\ncup\nstore-bought crispy fried shallots\nor\nhomemade fried shallots\n3\ncups\n(\n720\nml\n) pure,\nunsweetened fresh or store-bought carrot juice\n2\ncups\n(\n480\nml\n)\nhomemade chicken stock\nor store-bought low-sodium chicken broth\n1\nlarge\nshallot\n, minced\n4\ncloves garlic\n, minced\n1 1/2\ncups\nshort- or medium-grain\nrisotto rice\n, such as carnaroli, arborio, or vialone nano (\n10.5\nounces\n;\n300\ng)\n2\nteaspoons\n(\n10\nml\n) homemade or store-bought\nharissa paste\n1\ncup\n(\n240\nml\n)\ndry white wine\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\n, cut into 4 pieces\n3/4\ncup\nfinely grated\nParmigiano-Reggiano cheese\n(\n3\nounces\n;\n85\ng\n)\nDirections\nAdjust oven rack to middle position and preheat oven to 400ºF (205°C). Place carrots on a rimmed baking sheet and toss with 1 tablespoon oil, 1/4 teaspoon salt, and 1/4 teaspoon pepper until evenly coated. Spread carrots in an even layer. Bake until carrots are tender and lightly browned, about 25 minutes. Once roasted, set aside 1/3 cup carrots for garnish.\nSerious Eats / Kelsey Hansen\nMeanwhile, in a medium bowl combine carrot greens or parsley, fried shallots, and lemon zest; set aside.\nSerious Eats / Kelsey Hansen\nIn a medium saucepan, bring carrot juice and stock or broth to a simmer over medium heat. Reduce heat to low and cover with a lid to hold warm.\nSerious Eats / Kelsey Hansen\nIn a 3- or 5-quart saucier or medium Dutch oven, heat remaining 2 tablespoons oil over medium heat until shimmering. Add fresh shallot and cook, stirring frequently, until tender and translucent, about 5 minutes. Add garlic and cook, stirring frequently, until fragrant, about 1 minute.\nIncrease heat to medium-high, add rice, and continue to cook, stirring constantly, until rice is evenly coated in oil and toasted but not browned, 2 to 3 minutes. Rice should smell nutty and grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center.\nSerious Eats / Kelsey Hansen\nAdd wine and harissa paste and cook until wine is almost completely evaporated, about 1 minute. Add 1/2 cup of stock and season lightly with salt. Cook, stirring constantly with a rubber spatula or wooden spoon, until liquid is mostly absorbed, 1 to 2 minutes. Continue to cook, adding stock in 1/2-cup increments while stirring constantly, until rice is almost fully softened but still retains a noticeable al dente bite in the center, 15 to 20 minutes total. Add enough stock so that there is enough liquid in the pot for the rice to flow like lava when you stir it. Remove from heat.\nSerious Eats / Kelsey Hansen\nStir in cheese and butter and stir or toss vigorously until cheese and butter are fully melted and emulsified and a creamy, satiny glaze coats each grain of rice. Keep in mind that the risotto will tighten up and thicken in the time it takes to plate and serve it, so adjust with more stock as needed to achieve a free-flowing consistency, leaving it looser than you think it should be. Season with additional salt to taste, if needed. Stir in the remaining (all but 1/3 cup) roasted carrots and lemon juice into risotto.\nSerious Eats / Kelsey Hansen\nSpoon risotto onto warmed plates, shaking gently to spread risotto out over each plate in an even layer. Top each portion with reserved roasted carrots and dressed carrot greens. Serve right away.\nSerious Eats / Kelsey Hansen\nSpecial Equipment\nMedium saucepan, 3- or 5-quart saucier or medium Dutch oven\nNotes\nIf you can't find carrots with their green tops attached, you can substitute fresh parsley for carrot tops in the garnish.\nMake-Ahead and Storage\nOnce finished, risotto is best eaten right away. However, leftovers can turned into\nrisotto al salto\n(crispy rice pancakes).\nWhite Rice\nThe Latest\nRecipes\nRice & Grains"
}