{
  "url": "https://www.seriouseats.com/carrot-and-raisin-salad-recipe-11696673",
  "image_url": "https://www.seriouseats.com/thmb/LevLsLaa35_YBLUulxRlq6DgNwM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250204-SEA-CarrotSlaw-JenCausey-Beauty2-30-1bf47b76de5d4428b129515efa145f36.jpg",
  "tags": [
    "Salads",
    "The Latest",
    "Carrots",
    "Coleslaw"
  ],
  "title": "Sweet, Crunchy Carrot Salad",
  "full_text": "Sweet, Crunchy Carrot Salad\nClose\nJump to recipe\nPrep\n10 mins\nRest Time:\n15 mins\nTotal\n25 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\nml\n)\nfresh orange juice\nfrom\n1\nmedium\norange\n2\nteaspoons\n(\n10\nml\n)\nunseasoned rice vinegar\n, cider vinegar, Champagne vinegar, or white wine vinegar\n3\nteaspoons\n(\n15\nml\n)\nhoney\n, divided\n1/2\ncup\nraisins\n(\n3 1/4\nounces\n;\n92\ng\n)\n1/3\ncup\n(\n75\nml\n)\nmayonnaise\n2\ntablespoons\n(\n30\nml\n)\nfresh lemon juice\nfrom\n1\nmedium\nlemon\n3/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n1\npound\n(\n456\ng\n)\ncarrots\n, peeled\n1/2\ncup\nchopped toasted\npistachios\n(\n2\nounces\n;\n55\ng\n)\nDirections\nOn the large holes of a box grater, shred carrots. Alternatively, carrots can be shredded with disk attachment of a food processor. You should have about 3 1/2 cups shredded carrots.\nIn a small microwave-safe bowl, whisk together orange juice, vinegar, and 1 teaspoon honey until combined and honey dissolves; add raisins and toss to coat. Microwave on high until orange juice mixture is hot and bubbling, about 45 seconds. Let sit, stirring every 5 minutes, until raisins are plump and softened, about 15 minutes.\nSerious Eats / Jen Causey\nIn a fine-mesh strainer set over a medium bowl, drain raisins, reserving the orange juice mixture in the medium bowl; set raisins aside. Whisk mayonnaise, lemon juice, salt, and remaining 2 teaspoons honey into the reserved orange juice mixture.\nSerious Eats / Jen Causey\nAdd carrots, plumped raisins, and pistachios, and toss to coat. Serve immediately.\nSerious Eats / Jen Causey\nSpecial Equipment\nMicrowave-safe small bowl, box grater or food processor with shredding disk attachment\nMake-Ahead and Storage\nThe carrots can be shredded and refrigerated in an airtight container up to 2 days before making the salad.\nWe strongly suggest tossing the salad right before serving, but leftovers can be refrigerated in an airtight container for up to 2 days. Note that the salad will become more watery as it sits, and you may need to drain excess liquid before serving.\nSalads\nThe Latest\nCarrots\nColeslaw"
}