{
  "url": "https://www.seriouseats.com/carrot-okonomiyaki-recipe-11724220",
  "image_url": "https://www.seriouseats.com/thmb/QHB6SKqFb6MHNZCd9XZFEpMUoeE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250417-SEA-CarrotOkonomiyaki-KelseyHanson-Beauty1-24-3927e070dda145c286f70adcbf809889.jpg",
  "tags": [
    "Carrots",
    "The Latest",
    "Recipes",
    "Japanese",
    "Pork Belly"
  ],
  "title": "Crispy, Savory Carrot Pancakes, the Japanese Way",
  "full_text": "Crispy, Savory Carrot Pancakes, the Japanese Way\nClose\nJump to recipe\nPrep\n5 mins\nCook\n75 mins\nTotal\n80 mins\nServes\n4\nMakes\n1 (8 to 9-inch) pancake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n1/4\ncup\n(\n60\nml\n)\nketchup\n2\ntablespoons\n(\n30\nml\n)\noyster sauce\n2\ntablespoons\n(\n30\nml\n)\nWorcestershire sauce\n1 1/2\ntablespoons\ngranulated sugar\n(\n3/4\nounce\n;\n22\ng\n)\nFor the Okonomiyaki:\n6\nounces\n(\n170\ng\n)\nskin-off pork belly\n, cut into 1/2-inch pieces\n2 to 3\nmedium\ncarrots\n(\n8\nounces\n;\n226\ng\ntotal), julienned with a mandoline or shredded\n6\nscallions\n, cut in half lengthwise and cut into 1 1/2–inch pieces\n1/4\ncup\n(\n60\nml\n)\nstore-bought or\nhomemade dashi\n(see notes)\n1\nlarge\negg\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/2\ncup\nall-purpose flour\n(\n2 1/4\nounces\n;\n64\ng\n)\nVegetable oil\n, as needed\nTo Serve:\nJapanese-style mayonnaise\n, such as Kewpie\nFurikake\n(optional)\nKatsuobushi\n(bonito flakes), optional\nDirections\nFor the Sauce:\nIn a small bowl, whisk ketchup, oyster sauce, Worcestershire sauce, and sugar to combine; set aside.\nSerious Eats / Kelsey Hansen\nFor the Okinomiyaki:\nAdd pork belly to a cold 10-inch nonstick or well-seasoned cast iron skillet. Place over medium heat and cook until pork belly is crisp and browned on all sides and fat is rendered, about 15 minutes. Remove from heat. Using a slotted spoon, remove pork belly; reserve drippings in pan.\nSerious Eats / Kelsey Hansen\nIn a large bowl, combine carrots, scallions, dashi, eggs, and salt. Stir in flour, 1 tablespoon at a time, until combined. Add half of the cooked pork belly.\nSerious Eats / Kelsey Hansen\nHeat skillet with drippings over medium heat until shimmering. Add 1/4 of the batter, and use an offset or flexible spatula to spread into an even layer. Cook, covered, shaking pan occasionally, until bottom is crisp and well browned, about 10 minutes; adjust heat as necessary to prevent burning.\nSerious Eats / Kelsey Hansen\nHolding the pancake in place in the skillet with a spatula, the lid, or a plate, drain off any excess fat into a small glass bowl. Cover skillet with plate and carefully invert skillet to flip pancake onto plate. Return drippings to skillet and set on medium heat. (Use additional vegetable oil as needed.) Slide the pancake back into the skillet, cooked side up. Cook, uncovered, until browned, about 5 minutes.\nSerious Eats / Kelsey Hansen\nRemove pancake from skillet. Drizzle sauce and mayonnaise on top of the pancake. Sprinkle with furikake and katsuobushi, if desired.\nSpecial Equipment\n10-inch nonstick or cast iron skillet, spatula, 10-inch lid\nNotes\nIf you don't have homemade or store-bought dashi, you can substitute with 1/4 cup (60 ml) water or whisk 1/4 teaspoon instant dashi, such as Hondashi, into 1/4 cup (60 ml) water. (If using water, adjust seasoning with additional salt as needed.)\nMake-Ahead and Storage\nLeftover pancakes can be refrigerated in an airtight container for up to 3 days. Reheat in a microwave or air fryer until warmed through.\nCarrots\nThe Latest\nRecipes\nJapanese\nPork Belly"
}