{
  "url": "https://www.seriouseats.com/cathead-biscuits-recipe-8668293",
  "image_url": "https://www.seriouseats.com/thmb/pvjN6xZlCepBdRx3jzn9R5RTdwY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240608-Cathead-Biscuits-Qi-Ai-hero-02-1-overhead-closeup-2a47edd007464f91bf7828e3f948ad93.jpg",
  "tags": [
    "Biscuits",
    "The Latest",
    "Snacks & Appetizers",
    "Breakfast & Brunch",
    "Baking"
  ],
  "title": "Southern Cathead Biscuits",
  "full_text": "Southern Cathead Biscuits\nClose\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nTotal\n45 mins\nServes\n7 large biscuits\nCook Mode\n(Keep screen awake)\nIngredients\n195g bleached, enriched\nall-purpose flour\n(about 6 3/4 ounces;\n1 1/2\ncups\n)\n195g bleached\ncake flour\n(about 6 3/4 ounces;\n1 1/2\ncups\n)\n24g (\n2\ntablespoons\n)\nbaking powder\n1 1/2\nteaspoons\ngranulated sugar\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n170g cold\nunsalted butter\n(\n6\nounces\n; 12 tablespoons), divided, plus more for serving\n1 1/4\ncup\ns (300ml) cold\nbuttermilk\nHoney\n, to serve (optional)\nDirections\nAdjust oven rack to middle position and preheat oven to 425ºF (220ºC). Set a 9-inch cake pan onto oven rack to preheat.\nSerious Eats / Qi Ai\nIn a large bowl, whisk together all-purpose flour, cake flour, baking powder, sugar, and salt. Set aside.\nSerious Eats / Qi Ai\nThinly slice 1 tablespoon of unsalted butter and set aside. On the large holes of a box grater, grate remaining butter onto a cutting board or piece of parchment. Add grated butter to dry ingredients and toss to evenly coat. Using your fingers, rub butter in until mixture is crumbly with no large chunks of butter. The mixture should hold together when squeezed, a sign that the flour is properly hydrated.\nSerious Eats / Qi Ai\nMake a well in the center of the dry mixture, then pour in the buttermilk. Using a fork or flexible spatula, mix until a shaggy, cohesive dough forms. Use your hands to gently fold the dough over itself a few times, mixing until dough is sticky and no dry bits remain.\nSerious Eats / Qi Ai\nOnce oven is preheated, remove pan from oven and set onto a trivet or heat-proof surface.  Add remaining 1 tablespoon butter to pan; using pot holders or oven mitts, swirl to evenly coat pan until butter has completely melted. (If butter does not melt fully, place pan back in the oven for 2 to 3 minutes).\nSerious Eats / Qi Ai\nDivide dough into 7 equal portions, about 120g or 4 1/2 ounces each, and shape each portion into a rough ball. Arrange 6 balls of dough around the edge of the pan and place 1 in the middle; they should just be touching.\nSerious Eats / Qi Ai\nBake the biscuits until they spring back when touched, are golden brown on top, and register 190ºF (88ºC) when an instant read thermometer is inserted, about 35 minutes.\nSerious Eats / Qi Ai\nLet the biscuits cool in pan for 10 minutes, then use a spatula to slide the attached biscuits out of the pan. (Alternatively, serve biscuits directly in pan). Pull apart and serve warm with honey and additional butter, if desired.\nSerious Eats / Qi Ai\nSpecial Equipment\n9-inch cake pan, instant read thermometer\nMake-Ahead and Storage\nBiscuits can be stored in an airtight container at room temperature for up to 2 to 3 days. Biscuits can be individually wrapped and frozen for up to 1 month.\nBiscuits\nThe Latest\nSnacks & Appetizers\nBreakfast & Brunch\nBaking",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/southern-cathead-biscuits.webp?"
}