{
  "url": "https://www.seriouseats.com/cauliflower-pakoras-recipe-7490800",
  "image_url": "https://www.seriouseats.com/thmb/Y1M4p42Pgu-pxC2o6iCAEU-ZL3Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230508-SEA-CauliflowerPakoras-AmandaSuarez-13-b69d4fa5dfab408e890a815d3eb86cef.jpg",
  "tags": [
    "Indian",
    "The Latest",
    "Vegan Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Vegetarian"
  ],
  "title": "Cauliflower Pakoras",
  "full_text": "Cauliflower Pakoras\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n6 as an appetizer\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nchickpea flour\n(\n8 1/2\nounces\n;\n240\ng\n)\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nground red\nchile\npowder, such as Kashmiri\n1/4\nteaspoon\nground turmeric\n3/4\nteaspoon\nchaat\nmasala\n, divided\n1 1/4\ncups\n(\n295\nml\n) cold\nwater\n1\nlarge head\ncauliflower\n, about\n1 1/2\npounds\n(\n680\ng\n), separated into bite-sized pieces, thick stems discarded (about\n5\ncups\n)\n4\ncups\n(\n946\nml\n)\nvegetable oil\n, for frying\nGreen chutney\n, for serving\nDirections\nIn a large mixing bowl, whisk the chickpea flour, salt, red chile powder, turmeric, and 1/2 teaspoon of the chaat masala together. Whisk in the water until completely smooth. The batter should be runny like a custard and not too thick or thin. Fold the cauliflower florets into the batter to coat evenly.\nSerious Eats / Amanda Suarez\nIn a 6-quart Dutch oven or wok, heat oil over medium heat until it reaches 350ºF (177ºC). Meanwhile, set a wire rack in a rimmed baking sheet. Line rack with a double layer of paper towels; set aside. Working in three batches to prevent crowding the oil, use your fingers or tongs to lift cauliflower from batter, allowing excess to drain off, then carefully lower into the oil. Fry on medium, stirring and turning pieces gently as they cook, until golden brown and crisp, 4 to 5 minutes. Using a slotted spoon or spider, transfer the fried florets to the prepared baking sheet and season with salt. Return oil to 350ºF (177ºC) and repeat twice more with remaining cauliflower florets. Sprinkle with remaining 1/4 teaspoon chaat masala. Serve hot.\nSpecial Equipment\nSpider or slotted spoon, rimmed baking sheet, wire rack or paper towels, instant-read thermometer\nNotes\nDifferent sizes of florets can create varying cooking times: smaller florets cook faster than larger ones, and pieces with thicker stems may require more time in the fryer.\nMake-Ahead and Storage\nThe pakoras are best enjoyed within an hour of cooking.\nIndian\nThe Latest\nVegan Snacks & Appetizers\nVegetarian Snacks & Appetizers\nVegetarian"
}