{
  "url": "https://www.seriouseats.com/cauliflower-gratin-recipe-7488121",
  "image_url": "https://www.seriouseats.com/thmb/gmZnp-cSbIz7FaQB_fcYpSR1-J4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230509-SEA-CauliflowerGratin-AmandaSuarez-hero-141919e503d944b89e5e4ed6258f91ed.jpg",
  "tags": [
    "Cauliflower",
    "The Latest",
    "Winter",
    "Fall"
  ],
  "title": "Cauliflower Gratin",
  "full_text": "Cauliflower Gratin\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nTotal\n70 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge heads\ncauliflower\n, about\n3\npounds\n(\n1.4\nkg\n), cut into 1 1/2-inch florets, thick stems discarded\nFor the Mornay Sauce:\n4 1/2\ntablespoons\nunsalted butter\n(\n2.25\nounces\n;\n60\ng\n)\n4 1/2\ntablespoons\nall-purpose flour\n(\n1.5\nounces\n;\n36\ng\n)\n3\ncups\n(\n710\nml\n)\nhalf and half\n, divided\n2\nteaspoons\nwhite or yellow\nmiso paste\n2\nbay leaves\n2\nteaspoons\nonion powder\n1\nteaspoon\ngarlic powder\n1/2\nteaspoon\nwhite pepper\n4\nounces\nshredded Gruyère\n(\n170\ng\n; about\n1 1/2\ncup\n)\n1/4\ncup\ngrated\nParmigiano-Reggiano\n(about\n1/2\nounce\n;\n14\ng\n)\nKosher salt\nFor the Breadcrumbs:\n2\ntablespoons\nunsalted butter\n(\n1\nounce\n;\n28\ng\n), melted\n1/2\ncup\n(\n35\ng\n)\npanko\n(see notes)\n2\ntablespoons\n(\n10\ng\n) homemade or store-bought\nza'atar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nDirections\nAdjust oven rack to middle position and preheat the oven to 375ºF (190ºC). Line a large rimmed baking sheet with parchment paper; spread cauliflower in an even layer. Season to taste with salt. Bake cauliflower until starting to brown, 30 to 35 minutes, stirring halfway through. Set aside.\nMeanwhile, for the Breadcrumb Topping:\nIn a small bowl, stir together melted butter, breadcrumbs, and za’atar until well combined. Season to taste with salt. Set aside.\nSerious Eats / Amanda Suarez\nFor the Mornay Sauce:\nIn a medium bowl, whisk together 2 tablespoons of the half and half with the miso paste until thoroughly mixed. Stir in remaining 2 3/4 cups plus 2 tablespoons half and half; set aside.\nSerious Eats / Amanda Suarez\nIn a medium saucepan set over medium heat, melt 4 1/2 tablespoons butter. Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add miso mixture in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. (The sauce will initially become very thick, then get very thin once all the half and half is added.) Heat, stirring often, until sauce comes to a simmer and begins to thicken slightly, about 5 minutes. Reduce heat to low and cook, stirring, until sauce is thick enough to coat the back of a wooden spoon, about 3 minutes. Remove from heat, then stir in the bay leaves, onion powder, garlic powder, and white pepper until well-combined. Stir in Gruyère and Parmigiano-Reggiano until just combined. Season to taste with salt.\nSerious Eats / Amanda Suarez\nTransfer cauliflower to a 9- by 13-inch baking dish or pan and season with salt and freshly ground pepper. Pour the Mornay sauce evenly over the cauliflower and evenly sprinkle the breadcrumb mixture all over. Bake, uncovered, rotating dish halfway through, until the sauce is bubbling around the edges and breadcrumbs are lightly golden brown, 10 to 12 minutes.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nMedium saucepan, whisk, 9- by 13-inch baking dish\nNotes\nI prefer the crunchier texture of panko, but regular breadcrumbs can be used instead.\nUsing white or yellow miso rather than a saltier red one makes it easier to control the saltiness of the recipe.\nCauliflower\nThe Latest\nWinter\nFall"
}