{
  "url": "https://www.seriouseats.com/cavatelli-recipe-8726647",
  "image_url": "https://www.seriouseats.com/thmb/1SzV7evIlJPWvJ1i-2wLdalf9PY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241008-SEA-FreshCavatelli-QiAi-Hero2-33-a5c6482684b74500803c730779d76b76.jpg",
  "tags": [
    "Pasta Mains",
    "The Latest",
    "Italian"
  ],
  "title": "How to Make Homemade Cavatelli",
  "full_text": "How to Make Homemade Cavatelli\nClose\nJump to recipe\nPrep\n60 mins\nCook\n10 mins\nResting Time\n90 mins\nTotal\n2 hrs 40 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cavatelli:\n375g (about\n2 1/2\ncups\n)\nfinely-ground double-milled semolina flour\n(see notes)\n150g to 175g\n(2/3\nto 3/4\ncup\n) room temperature\nwater\n1 tablespoon\n(15\nml\n)\nextra-virgin olive oil\nFor Serving:\nFresh tomato sauce\n,\nAmerican tomato sauce\n,\npork ragu\n, or your preferred\npasta sauce\nDirections\nFor the cavatelli:\nIn a large bowl, mix semolina, 150g (2/3 cup) water, and oil together until a clumpy dough forms and there is very little dry semolina remaining at the bottom of the bowl. Use your hands to press and knead the dough together in the bowl until it forms a rough ball. If the dough seems too dry, like there’s no way to get it to come together, knead in 1 to 2 more tablespoons (15 to 30ml) of water.\nSerious Eats / Qi Ai\nTransfer dough to a clean counter and knead until smooth, about 4 to 6 minutes. Cover dough with a clean dishcloth (or with the now-empty overturned mixing bowl from step 1). Let dough rest for about 15 minutes.\nSerious Eats / Qi Ai\nUse a bench scraper or knife to cut the dough into 6 equal pieces. Keep all but one piece of dough covered. Working with one piece of dough at a time, use the palms of both hands to press down moderately on the dough and roll until the dough forms an even rope that’s roughly 1/2-inch diameter and 12 to 15 inches long. Make sure the counter beneath the dough is clean (no dusting of flour) so the rope can grip the surface and lengthen as it rolls.\nSerious Eats / Qi Ai\nCut the rope into 1/2 inch long segments. If making ridges, hold a gnocchi board with your non-dominant hand. Place a segment of dough, cut-side-down, on the top-side of the board (the side closest to the handle) or the back side of a fork. Press the thumb of your dominant hand into the dough and forcefully roll it down the board or length of the back of the fork toward the counter. This will create one large indent on one side of the dough and a grooved pattern on the rolled exterior of the noodle. Repeat with remaining segments of dough. Alternatively, use a crank-operated cavatelli maker for shaping, or use a butter knife and, working with one 1/2 dough segment at a time, drag the butter knife across each piece of dough along the counter until it curls over itself. This will create cavatelli with a smooth exterior.\nSerious Eats / Qi Ai\nUse a bench scraper to scoop up cavatelli and transfer noodles to a rimmed baking sheet. Sprinkle semolina over cavatelli and gently toss until coated. Shake baking sheet so cavatelli arrange themselves in a single layer.\nSerious Eats / Qi Ai\nRepeat rolling out ropes, cutting segments, and forming cavatelli with the remaining covered dough. Once all noodles are coated in semolina and arranged in a single layer on a baking sheet, let them partially dry (or “cure”) at room temperature until they have a very light skin, 30 minutes to 1 hour (depending on humidity in the air). After the noodles have cured, you can cook them immediately or freeze in a single layer until they harden, about 15 minutes, and then transfer them to a zipperlock bag or airtight plastic container to store in the freezer for up to 3 months.\nSerious Eats / Qi Ai\nFor Cooking and Serving:\nIn a large sauté pan or skillet, heat sauce until warmed through and hold warm over low heat. In a large pot, bring 4 quarts water to a boil over high heat. Add 1 tablespoon salt, return to a boil, then add cavatelli and cook, stir gently with a wooden spoon, chopsticks, or a cooking fork, tasting occasionally until cavatelli are just set with a definite bite, 3 to 6 minutes.\nSerious Eats / Qi Ai\nUsing a large spider skimmer or slotted spoon, transfer pasta to the sauce along with 1/4 cup pasta cooking water. Cook over high heat, stirring and tossing rapidly, until pasta is al dente and sauce has thickened and begins to coat noodles. Season to taste with salt and pepper. Serve with your preferred grated cheese, if desired.\nSerious Eats / Qi Ai\nSpecial Equipment\nBench scraper, hand-held gnocchi board, fork, butter knife, or\ncrank-operated cavatelli maker for shaping the pasta, large sauté pan or skillet, large pot, large spider skimmer or slotted spoon\nNotes\nDouble-milled semolina flour, also known as Semolina rimacinata is finely-ground hard durum wheat that has a high protein content, light yellow color, and a soft texture. You can purchase semolina rimacinata such as the Caputo brand at specialty markets and online.\nMake-Ahead and Storage\nYou can freeze the cavatelli in a single layer until they harden, about 15 minutes, then transfer them to a zipperlock bag or airtight container to store in the freezer for up to 3 months. Boil from frozen, adding 1 to 2 additional minutes to the cooking time.\nPasta Mains\nThe Latest\nItalian"
}