{
  "url": "https://www.seriouseats.com/cazuelitas-fried-masa-pockets-with-caramelized-onion-and-mushroom-filling-recipe-8638970",
  "image_url": "https://www.seriouseats.com/thmb/2KG3X4UOGdqwyxfWml6W2QlvXWI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240425-SEA-Cazuelitas-48-c3c755841e594111883ea298b8c5c597.jpg",
  "tags": [
    "The Latest",
    "Mexican",
    "Snacks & Appetizers",
    "Frying",
    "Mushrooms"
  ],
  "title": "Cazuelitas (Fried Masa Pockets with Caramelized Onion and Mushroom Filling)",
  "full_text": "Cazuelitas (Fried Masa Pockets with Caramelized Onion and Mushroom Filling)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs\nTotal\n2 hrs 30 mins\nServes\n5\nto 8\nMakes\n15 each\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter,\ndivided\n2\npounds\nyellow\nonions\n(about\n4\nmedium\nonions), halved and thinly sliced\n1/2\ncup\n(\n120\nml\n)\nwater\nKosher salt\nand freshly\nground black pepper\n1\npound\n(\n450\ng)\ncremini or white\nbutton mushrooms\n, thinly sliced\n2\ntablespoons\n(\n30\nml\n)\ncrème fraîche\nFor the Cazuelitas:\n1 1/4\npounds\nrusset potatoes\n(\n580\ng\n; about\n3\nmedium\n), peeled and cut into 1-inch chunks\n2 1/4\ncups\n(\n8\nounces\n;\n225\ng\n)\nmasa harina\n1\ntablespoon\nkosher salt\n; for table salt use half as much by volume\n1 1/2\ncups\n(\n360\nml\n)\nwater\n2\nquarts\n(\n2\nL\n) neutral oil such as vegetable or\npeanut oil\n, for frying\nFor the Glaze:\n1\ncup\n(\n240\nml\n) homemade\nchicken stock\nor store-bought low-sodium chicken broth\n2 1/2\nteaspoons\n(\n10\ng\n)\npowdered gelatin\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter, divided\n4\nmedium\ngarlic\ncloves\n(\n20\ng\n), minced\n1\nteaspoon\nred pepper flakes\n2\ntablespoons\n(\n30\nml\n)\nlime juice\n1\ntablespoon\nminced fresh\ncilantro leaves\nKosher salt\nand freshly ground black pepper\nGrated Parmesan\n, to serve (optional)\nDirections\nFor the filling:\nIn a 12-inch nonstick or cast-iron skillet,\nbring onions, 1/2 cup water, butter, and salt to boil over medium- high heat. Cover and cook until water has evaporated and onions start to sizzle, about 10 minutes.\nSerious Eats / Lorena Masso\nUncover, and use rubber spatula to gently press onions into the skillet. Cook, without stirring, until the bottom of onions are lightly browned, about 30 seconds. Stir onions, scraping fond from the skillet, then gently press onions into skillet again. Repeat pressing, cooking, and stirring until onions are softened, well browned, and slightly sticky, 15 to 20 minutes. Season to taste with salt. Transfer to a bowl and set aside. Rinse and wipe the skillet clean with paper towels.\nSerious Eats / Lorena Masso\nReturn now-empty skillet to medium-high heat and melt the remaining 1 tablespoon butter in skillet. Add mushrooms, cover and cook until the mushrooms have released their liquid, about 8 minutes. Uncover, and continue to cook, stirring occasionally, until mushrooms are browned, 5 to 10 minutes. Return caramelized onions to the skillet and stir to combine. Stir in crème fraîche, and cook until the mixture is warmed through, about 2 minutes. Season with salt and pepper to taste; remove from heat and set aside.\nSerious Eats / Lorena Masso\nFor the cazuelitas:\nIn a large saucepan, cover potatoes with cold water by at least 2 inches. Bring water to a boil over high heat, then reduce heat to medium and simmer until potatoes are softened and can be pierced easily with a paring knife, about 15 minutes. Drain potatoes. Set a ricer over the now-empty pot and pass the potatoes through it (or use a potato masher to mash the potatoes until smooth).\nSerious Eats / Lorena Masso\nIn a large bowl, whisk together masa harina and salt to combine then stir in the 1 1/2 cups (360ml) water to form a dough. Add mashed potatoes and use a wooden spoon or your hands to mix until homogenous. Divide the mixture into 15 equal pieces and shape into balls.\nSerious Eats / Lorena Masso\nWorking with 1 dough ball at a time, use your finger to make an indentation about halfway through at the top of the ball. Gently tap your finger around the interior as you rotate the cazuelita to form a cup shape with thick walls. The finished cazuelita should have a thick rim and deep crater that’s about 1-inch in diameter. It’s OK if the shaped cazuelitas have some small cracks. Set aside on a large plate or baking sheet and repeat with the remaining balls.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and heat oven to 200℉.  In a large Dutch oven or pot, heat oil over medium-high heat to 325℉ (175°C) (oil should measure about 1 1/2 inches deep). Working in batches of 5 at a time, carefully add cazuelitas, crater side up, and fry until light golden brown, 4 to 6 minutes. While frying, the cazuelitas should be almost completely submerged in oil. Flip and continue to fry until golden brown and center of dough registers 200℉ (93°C) on an instant-read thermometer, 2 more minutes. Transfer cazuelitas to a paper towel-lined baking sheet and keep warm in the oven. Repeat frying with the remaining cazuelitas. Hold warm in the oven while preparing the glaze.\nSerious Eats / Lorena Masso\nFor the glaze:\nIn a large bowl, add chicken stock and sprinkle gelatin on top and let sit for 10 minutes. In a small skillet, heat 1 tablespoon butter over medium heat until shimmering. Add garlic and red pepper flakes and cook, stirring frequently, until softened and fragrant, about 30 seconds. Pour stock mixture into skillet, bring to a boil, and cook until the sauce is reduced to a glaze that coats the back of a spoon, 6 to 10 minutes. Lower heat to low and whisk in remaining 1 tablespoon butter until emulsified, about 15 seconds. Turn off the heat and whisk in lime juice and cilantro. Season with salt and pepper to taste.\nSerious Eats / Lorena Masso\nTo assemble, briefly roll each cazuelita in the glaze. Add 2 tablespoons of filling to each and sprinkle with Parmesan cheese, using. Serve immediately.\nSerious Eats / Lorena Masso\nSpecial Equipment\n12-inch nonstick or cast-iron skillet, ricer or potato masher, instant-read thermometer, large saucepan, Dutch oven or large pot, rimmed baking sheet\nGood to Know\nCazuelitas should not be confused with cazuelas, which are a type of dish prepared in a clay pot. They are, however, identical in shape to chocoyotes, which are masa dumplings served in soup.\nMake-Ahead and Storage\nThe cooked filling can be refrigerated in an airtight container for up to 4 days before using.\nThe Latest\nMexican\nSnacks & Appetizers\nFrying\nMushrooms"
}