{
  "url": "https://www.seriouseats.com/chacarero-chileno-steak-sandwich",
  "image_url": "https://www.seriouseats.com/thmb/butcu-S3iYd1zmRYrIOTTvb4CT0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240221-SEA-ChacareroChileno-EstudioComo18-78cddeb4684c42e8a70213a2b447d86d.jpg",
  "tags": [
    "The Latest",
    "South American",
    "Grilled Beef",
    "Steaks",
    "Green Beans"
  ],
  "title": "Chacarero Chileno (Chilean Steak and Green Bean Sandwiches)",
  "full_text": "Chacarero Chileno (Chilean Steak and Green Bean Sandwiches)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1/2\npound\n(\n225\ng\n)\ngreen beans\n, cut on a sharp bias into long, thin strips\n1/4\nteaspoon\nbaking soda\n1 1/2\npound\n(\n675\ng\n)\ntop round beef\nroast or sirloin beef, or other lean beef cut, sliced into\n4\nsteaks\n(see notes)\n3/4\ncup\n(\n175\nml\n)\nmayonnaise\n3\nmedium\ncloves garlic,\nminced\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n4\nsturdy\nrolls\n, such as frica, marraqueta, telera, or ciabatta rolls, lightly toasted (see notes)\nSliced fresh\ntomato\nfor serving (see notes)\n1\ncup\nthinly sliced fresh\nají cristal chiles\n, yellow banana peppers, or lemon drop peppers\nDirections\nBring a large pot of salted water to a rolling boil. Add beans and baking soda and cook until tender (they should be slightly softer than al dente), about 4 minutes. Drain beans and run under cold water to halt cooking. Set aside at room temperature.\nSerious Eats / Estudio Como\nIn a small bowl, stir together mayonnaise, garlic, and olive oil. Transfer half of mixture to a covered container and refrigerate until ready to use (see notes).\nSerious Eats / Estudio Como\nWorking with one piece at a time, place a piece of steak between 2 sheets of plastic wrap or inside a heavy-duty zipper-lock bag and pound gently with the bottom of a skillet until the meat is less than 1/4 inch thick. Cut each steak into lengths that slightly overhang the length of your bread. Set meat aside on a large tray.\nSerious Eats / Estudio Como\nSeason steak generously with salt. With a pastry brush, brush steaks on both sides with the remaining mayonnaise mixture.\nSerious Eats / Estudio Como\nFor Cooking On an Outdoor Grill:\nLight one chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil grilling grate. Working in batches if necessary, place meat directly over hot side of grill and cook without moving until well charred on first side, about 2 minutes. Flip and cook until charred on second side, about 2 minutes longer. Transfer steak to a clean plate as it finishes cooking. When steak is cooked, toast buns, cut side down, on grill until crisp and lightly charred. Proceed with step 7.\nFor Cooking On an Indoor Stovetop:\nIn a large stainless steel or cast iron skillet, heat 1 tablespoon vegetable or canola oil until just smoking. Working in batches, add steak to skillet and cook, without moving until well browned on first side, about 2 minutes. Flip and cook on second side until well browned and an instant-read thermometer registers 125°F for medium-rare, or 135°F for medium, reducing heat as necessary if steak smokes excessively or starts to burn.Transfer steaks to a clean plate as it finishes cooking. Once steak is cooked, toast buns, cut side down, in remaining fat in skillet until crisp and lightly charred.\nSerious Eats / Estudio Como\nTo Assemble the Sandwiches:\nSeason tomatoes with salt then layer meat, tomatoes, green beans, and peppers on bottom buns, and close firmly with top buns. Cut sandwiches in half and serve with the remaining mayonnaise mixture.\nSerious Eats / Estudio Como\nSpecial Equipment\nGrill\n, pastry brush\nNotes\nFor the beef, store-bought pre-sliced thin (1/4- to 1/8-inch-thick) top round steaks (1 1/2 pounds; 675g) may be substituted. Omit the pounding step.\nThis sandwich typically uses a lean beef cut as listed, however more substantially beefy, loosely textured cuts, like hanger, skirt, or flap meat may be substituted. Striploin or tenderloin may also be used for more tender and juicy result.\nThe mayonnaise-garlic coating for the beef may be substituted for a more traditional garlic-infused oil. For this method, microwave olive oil and garlic in a small bowl until hot, about 30 seconds. Set aside to infuse for 10 minutes, then discard garlic clove and brush both sides of steaks with the infused oil before cooking.  An optional side of plain mayonnaise may be served in place of the mayonnaise-garlic mixture.\nWhile frica or marraqueta rolls are traditional for this recipe, if unavailable, telera or ciabatta rolls are a good substitution. The roll for this sandwich should have a dense crumb with a crusty exterior.\nRead More\nMy 19 Favorite Summer Grilling Recipes\n17 Sandwich Recipes for Your Labor Day Cookout\nThe Latest\nSouth American\nGrilled Beef\nSteaks\nGreen Beans",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chacarero-chileno-chilean-steak-and-green-bean-sandwiches.webp?"
}