{
  "url": "https://www.seriouseats.com/chai-recipe-8364307",
  "image_url": "https://www.seriouseats.com/thmb/apjZLJv1aXMJTcKdDvA9vxuoqKg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231025-MasalaChai-AnantaGulati-12-ed342ff0e9924623989c6c359a19ae86.jpg",
  "tags": [
    "Teas",
    "The Latest",
    "Indian",
    "Stovetop"
  ],
  "title": "How to Make Chai",
  "full_text": "How to Make Chai\nClose\nJump to recipe\nPrep\n15 mins\nTotal\n15 mins\nServes\n2\nMakes\n1 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4 cups (\n300\nml\n)\nwater\n2 teaspoons (\n5\ng\n) Premium or Gold CTC\nblack tea\nleaves\n2\nteaspoons\n(10g)\ngranulated sugar\nAny one or two of the following spices/flavorings: one lightly crushed 1-inch knob fresh ginger (about 1/2 ounce; 14g); 2 lightly crushed cardamom pods; 2 lightly crushed cloves;\none\nlightly crushed\n2-inch\nstick cinnamon\n(see notes)\n1 cup (\n240\nml\n)\nwhole milk\nDirections\nIn a 2-quart saucepan, bring the 1 1/4 cups water to a simmer over medium-high heat. Add tea, sugar, and the spices/flavorings you have selected from the list. For a light chai, allow the mix to boil until the extract is reddish brown and lightly aromatic, about 2 minutes. For a stronger chai, allow the mixture to boil until the extract is darker, thicker, and more aromatic, about 5 minutes.\nSerious Eats / Ananta Gu\nAdd milk to chai mixture, return to a boil, then set a timer for 5 minutes. While the timer is counting down, allow the chai to rise up in the saucepan until it almost boils over, then reduce heat and allow it to fall back down into the pot. Increase the heat and repeat this process of almost boiling over 3 more times. Finally, reduce heat to a gentle simmer for the remainder of the 5-minute timer.\nSerious Eats / Ananta Gualit\nRemove chai from heat, cover with a lid, and allow it to stand for 5 minutes. Strain through a fine-mesh strainer and serve immediately.\nSerious Eats / Ananta Gulati\nSpecial Equipment\n2-quart saucepan\n,\nfine-mesh strainer\nNotes\nDo not add too many spices all at once. They will overpower the chai. It is more enjoyable to add just 1 or 2 spices to round out the chai flavor. I recommend starting with cardamom, if you like this spice. If you want to add saffron, the method is slightly different: A pinch of saffron should be added after the boil during the resting step.\nSerious Eats / Ananta Gulati\nMake-Ahead and Storage\nChai reheats very well the next day. You can make a double batch, strain it, and refrigerate it without any problem.\nTeas\nThe Latest\nIndian\nStovetop"
}