{
  "url": "https://www.seriouseats.com/charred-brussels-sprouts-leeks-banchan",
  "image_url": null,
  "tags": [
    "Brussels Sprouts",
    "Korean",
    "Leeks",
    "Salads",
    "Vegetable Sides"
  ],
  "title": "Charred Brussels Sprouts and Leek Muchim With Coffee-Dijon Dressing Recipe",
  "full_text": "Charred Brussels Sprouts and Leek Muchim With Coffee-Dijon Dressing Recipe\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n10 mins\nTotal\n15 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\nml\n)\nhoney\n3\ntablespoons\n(\n45\nml\n)\ntoasted sesame oil\n2\ntablespoons\n(\n30\nml\n)\nbrewed double-strength coffee\nor\nespresso\n2\ntablespoons\n(\n30\nml\n)\ncider vinegar\n1\ngarlic clove\n(\n5\ng\n), finely grated or minced\n1\ntablespoon\nplus\n2\nteaspoons\n(\n25\nml\n)\nfish sauce\n1/4\ncup\n(\n32\ng\n)\ntoasted sesame seeds\n1 1/2\nteaspoons\n(\n6\ng\n)\nfreshly ground black pepper\n3\ntablespoons\n(\n45\nml\n)\nvegetable oil\n1\npound\n(\n450\ng\n)\nBrussels sprouts\n,\ntrimmed\nand separated into individual leaves\n1/2\nlarge\nleek\n, white and light green parts only, rinsed and sliced into thin 3- by 1/2-inch strips (\n5 1/4\nounces\n;\n150\ng\ntotal)\n3\ntablespoons\n(\n45\nml\n)\nDijon mustard\nDirections\nIn a large bowl, whisk together honey, sesame oil, coffee, fish sauce, cider vinegar, and garlic. Stir in sesame seeds and black pepper; set aside.\nIn a large cast iron or carbon steel skillet, heat oil over high heat until just smoking. Carefully add Brussels sprouts leaves to the pan, spreading them into as even a layer as possible. Cook, stirring and shaking the pan occasionally, until leaves are charred in spots and bright green, 2 to 3 minutes. Working quickly, transfer Brussels sprouts to a rimmed baking sheet or large plate, spread in an even single layer, and set aside to cool to room temperature, about 5 minutes.\nSerious Eats / Vicky Wasik\nOnce Brussels sprouts have cooled, add to bowl with dressing, along with leeks and Dijon. Using clean hands, scrunch, mix, and massage together until vegetables are evenly coated with dressing and slightly softened, about 30 seconds.\nSerious Eats / Vicky Wasik\nDivide salad between small individual serving bowls and serve. If not serving right away, salad can be refrigerated in an airtight container for up to 1 day; bring to room temperature before serving.\nSerious Eats / Vicky Wasik\nSpecial equipment\nLarge cast iron skillet\nMake-Ahead and Storage\nThe dressed salad can be made in advance and refrigerated in an airtight container for up to 1 day. The dressing (without the Dijon mustard) can be made in advance and refrigerated in an airtight container for up to 3 days.\nThis Recipe Appears In\nCelebrate the Sides With a Korean-American Banchan Thanksgiving\nBrussels Sprouts\nKorean\nLeeks\nSalads\nVegetable Sides"
}