{
  "url": "https://www.seriouseats.com/charquican-chilean-vegetable-and-beef-stew-recipe-8582159",
  "image_url": "https://www.seriouseats.com/thmb/CDLFqFomLYA43D5c-UmGsD956wc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240220-SEA-Charquican-EstudioComo-16-320f88d7f29b456591a91d5ac61a816c.jpg",
  "tags": [
    "Beef Mains",
    "The Latest",
    "Braised & Stewed Beef",
    "Beef",
    "South American"
  ],
  "title": "Charquicán (Chilean Vegetable and Beef Stew)",
  "full_text": "Charquicán (Chilean Vegetable and Beef Stew)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nPickling Time\n360 hrs\nTotal\n361 hrs\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Escabeche Onions (Optional):\n6\nsmall\nwhite or\nyellow onions\n(about 4 ounces each, about the size of a lime), peeled (see notes\n3\ncups\n(\n700\nml\n) good-quality\nred wine vinegar\nFor the Charquicán:\n6\ntablespoons\n(\n90\nml\n) canola or other neutral\noil\n, divided\n1\npound\n(\n450\ng\n)\nlean beef\n, such as top or bottom sirloin butt, sirloin tip, or top or eye of round, cut into roughly 1/3- to 1/2-inch pieces\nFine sea or\nkosher salt\nand freshly\nground black pepper\n1\nmedium\nyellow or\nwhite onion\n(\n8\nounces\n;\n227\ng\n), finely diced\n1\nmedium\ncarrot\n(\n3\nounces\n;\n85\ng\n),\nfinely diced\n1/2\nred\nbell\npepper\n, finely diced\n2\nmedium\ngarlic cloves\n, minced\n1\ntablespoon\ndried oregano\n, preferably Chilean or good-quality Italian\n1\nteaspoon\nají de color or\nsweet paprika\n1/2\nteaspoon\nground cumin\n2 1/2\npounds\n(\n1.13\nkg\n)\nred potatoes\n, peeled and cut into 1-inch chunks\n1\npound\n(\n450\ng\n)\nbutternut squash\nor kabocha squash, peeled and cut into 1-inch cubes\n5\nounces\n(\n140\ng\n)\ngreen beans\n(preferably flat \"romano\" variety), stemmed and cut diagonally into 1/2-inch pieces (see notes)\n1\ncup\nfrozen\ncorn kernels\n(see notes)\n1\ncup\nfrozen peas\n(see notes)\n2\ncups\nloosely packed, roughly chopped fresh\nSwiss chard\nor spinach\n1 or 2\nfried eggs\nper person, for serving (optional)\nEscabeche onions (above) or quick-\npickled onions\n, for serving (optional)\nDirections\nFor the Escabeche Onions (Optional):\nUsing a sharp knife, make a 1/2-inch-deep cross cut “X” on each cut side (root and stem ends) of the peeled onions.\nSerious Eats / Estudio Como\nAdd the onions to a clean jar with a fitted lid. Pour the vinegar over the onions to fill the jar and fully submerge the onions, though some may float, which is fine.\nSerious Eats / Estudio Como\nClose the lid and store in a dark place, opening them every 2 to 3 days to check that they are still fully submerged and no signs of mold growth, until the onions have turned red and are fully pickled at least 15 days. Slice thin to serve. After they are ready, they can be refrigerated for up to 6 months. (see notes)\nSerious Eats / Estudio Como\nFor the Charquicán:\nIn a Dutch oven, heat 2 tablespoons (30ml) oil over high heat until shimmering. Add half the beef, distributing it in an even layer and cook without stirring until juicy on top and browned underneath, about 3 minutes. Season with salt and pepper, then stir to release beef from bottom of pot. Transfer beef to a medium bowl. Repeat with 2 tablespoons (30ml) oil and remaining beef.\nSerious Eats / Estudio Como\nRemove Dutch from heat, add 2 cups (480ml) water and scrape to deglaze any remaining browned bits into the water. Transfer water to a 4-cup measuring cup and top up with enough water to total 4 cups (950ml); set aside.\nSerious Eats / Estudio Como\nReturn Dutch oven to medium heat and heat remaining 2 tablespoons (30ml) oil until shimmering. Add onion, carrot, bell pepper, and garlic and cook, stirring often, until onion looks transparent, about 5 minutes. Add oregano, aji de color, and cumin, season with salt and pepper, and cook, stirring, until well blended, aromatic, and the onion mixture is mostly dry, 2 minutes.\nSerious Eats / Estudio Como\nStir in potato and squash chunks and reserved deglazing water, then bring to a boil over medium-high heat. Reduce heat, cover pot, and simmer, stirring occasionally, until potatoes are slightly firm in the center when pricked with a paring knife, 15 to 18 minutes.\nSerious Eats / Estudio Como\nAdd green beans, corn, and peas. Cook, uncovered, over low heat, stirring often, until green beans look bright green, about 5 minutes. At this point, stir and using a large fork or wooden spoon, mash about a third of the potatoes against the edges of the pot.\nSerious Eats / Estudio Como\nAdd Swiss chard and reserved beef along with any accumulated juices and cook, continuing to thoroughly mash the potatoes and stir the vegetables, just until the beef is heated through and cooked and the greens are wilted, 2 to 3 minutes. At this point the charquicán will be drier and prone to sticking to the bottom of the pot. If it’s too dense and sticking too much add 1/4 cup (60ml) hot water to loosen it up. The final stew should have the consistency of very chunky mashed potatoes. Season to taste with salt and pepper.\nSerious Eats / Estudio Como\nServe with 1 or 2 fried eggs on each portion and a few slices of escabeche onions or pickled onions, if desired.\nSerious Eats / Estudio Como\nSpecial Equipment\nLarge jar with a fitted lid, Dutch oven\nNotes\nIf small onions are unavailable, 4 medium sized (roughly 6 to 8 ounce) onions may be used. For medium onions, add 4 days to pickling time.\nCorn, peas, and green beans should be used fresh if in season, or frozen otherwise. Adjust the cooking times so they stay colorful and crunchy. Flat green beans (\"romano\" beans) can be found at Italian or Asian specialty stores and are the more common Chilean choice; otherwise, regular green beans or haricots verts will work just fine.\nMake-Ahead and Storage\nAll vegetables, except the potatoes, can be cut a day or two ahead of time and kept in containers in the fridge. The sofrito can be fully cooked and stored in the fridge for up to 3 days or frozen for up to 6 months. I use it so much that I often make a big batch, portion it , and freeze it.\nCharquicán can be cooled down and refrigerated in an airtight container for up to 3 days. It reheats well in the microwave or in a skillet. If reheating in a skillet, add a few tablespoons of water and stir constantly so it doesn't stick.\nBeef Mains\nThe Latest\nBraised & Stewed Beef\nBeef\nSouth American",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/charquicn-chilean-vegetable-and-beef-stew.webp?"
}