{
  "url": "https://www.seriouseats.com/charred-fresno-tamari-and-roasted-garlic-fermented-hot-sauce",
  "image_url": null,
  "tags": [
    "Hot Sauces",
    "Dairy-free",
    "Gluten-free",
    "Vegan",
    "Vegetarian"
  ],
  "title": "Fermented Hot Sauce With Fresno Chiles, Garlic, and Tamari Recipe",
  "full_text": "Fermented Hot Sauce With Fresno Chiles, Garlic, and Tamari Recipe\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nCooling and Fermentation Time\n168 hrs 15 mins\nTotal\n168 hrs 45 mins\nServes\n48 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\nFor The Mash:\n25\nounces\n(\n700\ng\n) stemmed\nFresno chile\npeppers\n(from about\n1 3/4\npounds\n/\n800\ng\nwhole peppers)\n1/4\ncup\n(\n60\nml\n) bottled, filtered, or distilled\nwater\n3\ntablespoons\n(\n45\nml\n)\ntamari\n1\ntablespoon\n(\n10\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\nTo Finish the Hot Sauce:\n1/2\ncup\n(\n120\nml\n)\ndistilled white vinegar\n2\nteaspoons\n(\n10\ng\n)\nsugar\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n1/2\ncup\n(\n120\nml\n)\nroasted garlic oil\nDirections\nFor The Mash:\nAdjust oven rack as close as possible to broiler element and preheat broiler to high. On a foil-lined rimmed baking sheet, arrange 10 1/2 ounces (300g) peppers in a single layer. Broil until peppers are blistered and well charred, 5 to 8 minutes per side. Cooked peppers should weigh about 7 ounces (200g) after broiling. Let peppers cool completely before using.\nIn a food processor, pulse charred peppers, remaining 14 1/2 ounces (400g) fresh peppers, water, tamari, and salt until coarse mash forms, 16 to 20 pulses.\nTransfer pepper mash to a clean wide-mouth, 1-quart canning jar. Tap jar lightly on palm to remove any air pockets. Cover surface of mash with plastic wrap, pressing gently to ensure full contact, and weigh down with fermentation weight or small jar lid. Seal jar with airlock lid following manufacturer's instructions.\nStore pepper mash in dark area away from sun and let ferment, maintaining an ambient temperature between 55°F (13°C) and 75°F (24°C), for 7 days; check mixture daily for signs of gas formation (mash will climb up sides of jar; this is a good sign). Starting on the 7th day, taste mash daily until it has reached a pleasantly sour flavor (like sauerkraut); the total fermentation time can take anywhere from 7 to 21 days.\nTo Finish the Hot Sauce:\nScrape mash into a blender. Add vinegar, sugar, and salt, and blend on high speed until smooth, about 1 minute. With blender running, slowly stream in garlic oil and blend until smooth and emulsified, about 1 minute longer. Measure pH using strips or pH-meter to make sure sauce is about 3.4; if it is too high, lower pH to 3.4 with more vinegar as needed.\nStrain sauce through fine-mesh strainer set over a nonreactive bowl or large container, pressing on solids to extract as much liquid as possible; reserve solids for another use (see note).\nTransfer strained hot sauce to glass bottles or jar, cover, and keep refrigerated until ready to use. Sauce will keep refrigerated for up to 1 month.\nAbove photograph: Vicky Wasik. Process photographs: Tim Chin.\nSpecial Equipment\nfood processor\n, 1-quart wide-mouth jar, small fermentation weight or small lid, airlock,\nblender\nNotes\nBroilers tend to vary greatly in intensity and speed of cooking. Check the peppers after 5 minutes to monitor the rate of charring in Step 1. If you can’t find tamari, regular soy sauce will work as well, but the umami flavor will be slightly less pronounced.\nReserved strained solids from the fermentation can be incorporated into a mignonette for oysters, added to sofritos and other sautéed aromatic vegetable bases in soups and stews, and as an alternative to tomato and chile pastes in some recipes.\nMake-Ahead and Storage\nThe finished hot sauce can be refrigerated for up to 1 month; after that point it may experience a loss in flavor quality, though will still be safe to eat.\nRead More\nHow to Make Fermented Hot Sauce\nHot Sauces\nDairy-free\nGluten-free\nVegan\nVegetarian"
}