{
  "url": "https://www.seriouseats.com/charred-broccoli-with-taleggio-cheese-sauce-and-gremolata",
  "image_url": "https://www.seriouseats.com/thmb/Znwk6jP6N8-BER-8DbXIZdNv0f4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/M7011302_charred_broccoli_taleggio_cheese_sauce_gremolata6766-JenCausey-77e1129ac64e4a20bb49f5d2c0152437.jpg",
  "tags": [
    "Broccoli",
    "Vegetable Mains",
    "Cheese",
    "American",
    "Gluten-free Mains"
  ],
  "title": "Charred Broccoli With Taleggio Cheese Sauce and Gremolata",
  "full_text": "Charred Broccoli With Taleggio Cheese Sauce and Gremolata\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n30 mins\nResting Time\n20 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(\n225\ng\n)\nTaleggio cheese\n, rind removed and cut into 1/2-inch pieces (see note)\n1/2\ncup\n(\n120\nml\n)\nheavy cream\n2\nheads\nbroccoli\n(about\n2\npounds\n;\n900\ng\n)\n1/3\ncup\n(\n80\nml\n)\nextra-virgin olive oil\n1/3\ncup\n(\n15\ng\n) chopped\nfresh flat-leaf parsley\nleaves and tender stems\n1\nsmall\ngreen jalapeño\n(about\n1/2\nounce\n;\n15\ng\n), stemmed, seeded, and finely minced\n1\nmedium\nclove garlic\n, minced\nFinely grated\nzest\nof\n1\nwhole\nlemon\nKosher salt\nand freshly ground black pepper\n3\ntablespoons\n(\n45\nml\n)\nvegetable oil\n, plus more as needed\nDirections\nPlace Taleggio in a large heat-proof liquid measuring cup or tall-sided bowl. In a small saucepan, bring cream to a simmer over medium-high heat. Pour hot cream over the Taleggio, and immediately cover tightly with plastic wrap. Set aside for 20 minutes; then use an immersion blender or blender to process cheese mixture into a very smooth purée with the consistency of\nnacho cheese sauce\n. (The sauce can be thinned to desired consistency with additional hot cream.) Cover and set aside until ready to serve. To reheat sauce, microwave on high heat, stopping and stirring every 15 seconds until it is loosened up and warmed through; be careful not to get it very hot, lest it break.\nSerious Eats / Vicky Wasik\nUsing a sharp knife, separate broccoli crowns from stems, just below the point where the florets converge on the stem (this will hold the florets together); reserve stems. Slice crowns lengthwise into 3/4-inch-thick steaks, trimming them such that each piece has two flat sides; set aside. Roughly chop broccoli floret trimmings into small pieces; transfer to small mixing bowl. Trim away bottom ends and tough outer layer of\nbroccoli stems\nand cut stems into fine dice (following steps 9-12 in\nthis knife-skills guide\n). Add stems to bowl with chopped floret pieces.\nSerious Eats / Vicky Wasik\nAdd olive oil, parsley, jalapeño, garlic, and lemon zest to bowl with stems and florets, and stir to combine. Season to taste with salt and pepper and set aside.\nIn a large cast iron skillet, heat 2 tablespoons (30ml) vegetable oil over high heat until smoking. Working in batches if necessary to avoid crowding the pan, add broccoli steaks, season with salt, and cook, using a small cast iron skillet or weight to press down on broccoli for even charring. Cook until charred on first side, 3 to 4 minutes. Turn broccoli over, add remaining vegetable oil, and cook until broccoli is charred on second side and stem sections are just cooked through (poke them with the tip of a paring knife or cake tester to test for doneness; they should be firm but tender enough to be pierced without resistance), 3 to 4 minutes longer. Transfer to a paper towel–lined plate or baking sheet, and season to taste with salt and pepper. Repeat with remaining broccoli.\nSerious Eats / Vicky Wasik\nWarm a large serving plate or individual serving plates. Spread warmed Taleggio sauce in an even layer on the plate(s). Arrange broccoli steaks on top of cheese sauce, and then top with gremolata. Serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nImmersion blender\n,\ncast iron skillet\n,\nChef's Press\nor\ngrill press\n(optional)\nNotes\nTaleggio is a very soft cheese, and it is therefore easier to cut when well-chilled. Pop it in the freezer for 10 minutes before cutting to make it a snap.\nMake-Ahead and Storage\nWhile the finished dish is best enjoyed immediately, the Taleggio cheese sauce can be refrigerated for up to 5 days. To reheat sauce, microwave on high heat, stopping and stirring every 15 seconds until it is loosened up and warmed through.\nRead More\nCharred Broccoli With Manchego, Hazelnuts, and Honey Recipe\nCharred Broccoli Salad with Sardines, Pickled Shallot, and Mint Recipe\nOutdoor Pizza Oven Charred Broccoli Rabe and Anchovy Pizza\nBroccoli and Cheese Galette Recipe\nBroccoli Cheese Soup Recipe\nBroccoli\nVegetable Mains\nCheese\nAmerican\nGluten-free Mains"
}