{
  "url": "https://www.seriouseats.com/che-chuoi-vietnamese-banana-tapioca-coconut-milk-dessert-recipe-7109489",
  "image_url": "https://www.seriouseats.com/thmb/C57VYz0knBrTvQ8ldKu4ebwd_po=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220214-Che-Sweet-Soup-VyTran-hero-8e8c5f7cc6324bed92dbd52e72fe4ce9.JPG",
  "tags": [
    "The Latest",
    "Snacks & Appetizers",
    "Dairy-free Desserts",
    "Gluten-free Desserts",
    "Desserts"
  ],
  "title": "Chè Chuối (Vietnamese Banana, Tapioca, and Coconut Milk Dessert)",
  "full_text": "Chè Chuối (Vietnamese Banana, Tapioca, and Coconut Milk Dessert)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nTotal\n30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\ncups\n(\n600\nml\n)\nwater\n1\n(13 1/2–fluid ounce; 400 ml) can\ncoconut milk\n, divided\n3\npandan\nleaves\n(about\n20\ng\n), tied into a knot, or\n1/2\nteaspoon\nvanilla extract\n(see notes)\n1/3\ncup\n(\n55\ng\n)\nsmall tapioca pearls\n1\npound\n(\n450\ng\n)\npisang awak bananas\n, peeled and cut on a diagonal into 1-inch-thick slices (see notes)\n3\ntablespoons\n(\n45\ng\n)\nsugar\n, plus more if needed\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/3\ncup\n(\n50\ng\n)\nunsalted roasted peanuts\n, roughly crushed, for garnish\nDirections\nIn a 2-quart saucepan, combine water, 6.75 fluid ounces (200ml) coconut milk, and pandan leaves and bring to a boil over medium-high heat. Add tapioca pearls, then lower heat to maintain a simmer and cook, stirring frequently to prevent tapioca pearls from clumping and sticking to bottom of pan, until tapioca pearls turn translucent, about 10 minutes (exact cooking times can vary depending on the specific size of tapioca pearls you use, so consult package instructions and make sure to prioritize the doneness cues over the estimated time; add extra water, as needed, if cooking time runs longer and too much liquid evaporates).\nSerious Eats / Vy Tran\nAdd bananas and let simmer until they soften and release their juices (their cores will turn bright yellow and the coconut milk will take on a distinct banana flavor), about 5 minutes (see note).\nSerious Eats / Vy Tran\nAdd remaining 6.75 fluid ounces (200ml) coconut milk along with the sugar and salt. Continue cooking until mixture comes to a gentle boil. Turn off heat, then discard pandan leaves. Add additional sugar to taste, if needed (this will depend on personal taste and how sweet bananas were).\nSerious Eats / Vy Tran\nServe hot or warm in individual bowls, garnishing each with crushed peanuts.\nSerious Eats / Vy Tran\nNotes\nPandan leaves (also labeled as screwpine leaves) are available fresh or frozen at Asian grocery stores. If you use vanilla extract in place of pandan leaves, add it together with the coconut milk, sugar, and salt in Step 3.\nYou can substitute with sweet plantains (mostly black all over) by combining them with all of the sugar in a medium bowl and setting them aside while the tapioca pearls are cooking. Add them with all of the sugar to the coconut milk in Step 2; adjust the sweetness to taste in Step 3, if needed.\nMake-Ahead and Storage\nChè chuối can be stored in an airtight container in the fridge for up to 2 days. Reheat before serving.\nThe Latest\nSnacks & Appetizers\nDairy-free Desserts\nGluten-free Desserts\nDesserts"
}