{
  "url": "https://www.seriouseats.com/cheddar-cheese-ice-cream-apple-pie",
  "image_url": "https://www.seriouseats.com/thmb/UFo6SPrxZ0_jICJbcI37TEnQtuY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__11__20141114-cheddar-ice-cream-vicky-wasik-1-7ee26b9fb5a74a4caae2a6886e5506a9.jpg",
  "tags": [
    "Ice Cream",
    "Cheddar Cheese",
    "Heavy Cream"
  ],
  "title": "Cheddar Ice Cream for Apple Pie Recipe",
  "full_text": "Cheddar Ice Cream for Apple Pie Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n45 mins\nChurning/Freezing Time\n6 hrs 30 mins\nTotal\n6 hrs 50 mins\nServes\n4 servings\nMakes\n1 pint\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\negg yolks\n1/4\ncup\nplus\n2\ntablespoons\nsugar\n3/4\ncup\nheavy cream\n(see note)\n3/4\ncup\nwhole milk\n(see note)\n3\nounces\nsharp cheddar cheese\n, grated\nKosher salt\nDirections\nIn a heavy-bottomed saucepan, whisk together egg yolks and sugar until well combined. Whisk in cream and milk until yolk mixture is fully incorporated.\nPlace pot over medium-low heat and cook, whisking frequently, until a custard forms on a spoon and a finger swiped across the back leaves a clean line, or until custard temperature reaches 170°F (77°C).\nRemove from heat and add cheddar. Let sit 1 minute, then whisk to combine. Use an immersion blender, or carefully transfer custard to a stand-alone blender, and blend until completely smooth, about 30 seconds. Add salt to taste, starting with a small pinch (seasoning will depend on saltiness of cheese).\nPour custard through a fine mesh strainer into an airtight container and chill in an ice bath or refrigerator until temperature drops to 40°F (4°C), about 2 hours in ice bath, or up to overnight in refrigerator. As base chills, it might separate slightly or form a skin. If so, wait until it's completely chilled, then blend until smooth.\nChurn ice cream according to manufacturer's instructions. Transfer to an airtight container and harden in freezer for at least 4 hours before serving atop apple pie in small scoops.\nSpecial Equipment\nIce cream maker\n;\nblender\nor\nimmersion blender\nNotes\nYou can substitute half-and-half for the cream and milk in this recipe.\nRead More\nBlue Cheese Ice Cream Recipe\nCranberry Goat Cheese Ice Cream Recipe\nSecret Tools and Tricks of the Ice Cream Pros\nHow to Mix and Match Ice Creams and Swirls\nIce Cream\nCheddar Cheese\nHeavy Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cheddar-ice-cream-for-apple-pie-recipe.webp?"
}