{
  "url": "https://www.seriouseats.com/cheese-bean-pupuses-curtido-recipe",
  "image_url": "https://www.seriouseats.com/thmb/yE_uUWqDQckjQdNbYTkOJpYHjCw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__06__20140616-pupusa-lauren-rothman-3-c241bc3f4a6f4b0e8569da1b60495cfd.jpg",
  "tags": [
    "Salvadoran",
    "Stovetop",
    "Beans",
    "Cheese",
    "Cabbage"
  ],
  "title": "Cheese and Bean Pupusas (Salvadoran Stuffed, Griddled Tortillas) With Cabbage Slaw",
  "full_text": "Cheese and Bean Pupusas (Salvadoran Stuffed, Griddled Tortillas) With Cabbage Slaw\nClose\nJump to recipe\nPrep\n20 mins\nCook\n35 mins\nActive\n60 mins\nTotal\n55 mins\nServes\n15 pupusas\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\nmasa dough\n1\nrecipe\nperfect refried beans\n, cooled\n2\ncups\nshredded\nqueso Oaxaca\nor mozzarella\nVegetable oil\n, for frying\n1\nrecipe\nquick curtido\nHot sauce\nand lime wedges, for serving (optional)\nDirections\nUsing wet hands, roll masa dough into 15 golf-ball-sized balls. Place balls on a baking sheet and cover with a moist towel. Working with one ball at a time, use your thumb to press a deep indent into the ball, then use your hands to work it into a small \"bowl\" with a 1/4-inch-thick edge.\nSerious Eats / Lauren Rothman\nPlace about 1 heaping tablespoon refried beans into the bottom of the \"bowl,\" then top with about 1 heaping tablespoon shredded cheese. Using moist fingers, carefully bring dough edge together, enclosing the filling within, and press to seal. Roll the ball in your hands to return it to a uniform ball shape. Carefully pat pupusa down into a flat round about 4 inches wide and about 3/4 inch thick; if edges crack, run a wet finger around them to smooth them. Place pupusas on a baking sheet and keep covered with a towel as you work. Repeat with remaining masa balls and fillings.\nLightly coat a large cast iron skillet with oil and heat over medium heat until shimmering. Working in batches, add pupusas and fry, turning once, until well-browned and crisp, about 4 minutes per side. Drain pupusas on a paper towel-lined plate, then transfer them to plates and top with curtido. Serve with hot sauce and lime wedges, if desired.\nNotes\nMasa freezes beautifully. After\nforming the balls of masa\n(see Step 1), place extras on a baking sheet in a single layer for one hour, then transfer to a zipper-lock bag or airtight container and store in the freezer for up to three months. To defrost, set masa balls on a plate at room temperature for about 15 minutes, then proceed with the recipe.\nRead More\nQuick Masa Dough\nPerfect Refried Beans\nQuick Curtido (Salvadoran Cabbage Slaw)\nSalvadoran\nStovetop\nBeans\nCheese\nCabbage"
}