{
  "url": "https://www.seriouseats.com/cheese-filled-toasted-ravioli-recipe-7566345",
  "image_url": "https://www.seriouseats.com/thmb/rSLErBdfLqXb-FpzU_ScNXeP1aA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230804-SEA-ToastedRaviloli-RobbyLozano-003-e7bb43d20b734ff7bcc9a56a49a4840d.jpg",
  "tags": [
    "Stuffed Pasta",
    "The Latest",
    "Pastas",
    "Midwestern"
  ],
  "title": "Cheese-Filled Toasted Ravioli",
  "full_text": "Cheese-Filled Toasted Ravioli\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n25 mins\nFreezing Time\n75 mins\nTotal\n3 hrs 40 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pasta Dough:\n2\ncups\nall-purpose flour\n(\n9\nounces\n;\n260\ng\n)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(\n10\ng\n)\nsemolina flour\n3\nlarge\neggs\n2\nlarge\negg yolks\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\nFor the Cheese Filling:\n3\ncups\nwhole-milk ricotta cheese\n(\n24\nounces\n;\n680\ng\n)\n1\ncup shredded\nmozzarella cheese\n(\n4\nounces\n;\n113\ng\n), see note\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Ravioli:\n2\nlarge\neggs\n, beaten\n1\ncup\n(\n240\nml\n)\nwhole milk\n2\ncups\nbreadcrumbs\n(\n8\nounces\n;\n227\ng\n)\n3\ntablespoons\nfinely chopped\nfresh flat-leaf parsley\n1\nteaspoon\nfinely chopped\nfresh rosemary\n1\nteaspoon\nfinely chopped\nfresh thyme\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFreshly ground black pepper\nVegetable oil\n, for frying\n1/2\ncup finely shredded\nParmigiano-Reggiano cheese\n(\n1\nounce\n;\n28\ng\n)\n2\ncups\nwarmed\nmarinara sauce\n(\n16\nfluid ounces\n,\n478\nml\n), for serving\nDirections\nFor the Pasta Dough:\nIn a food processor, pulse flour with salt and semolina until combined, about 3 pulses. Add the eggs and yolks and pulse until incorporated, about 7 pulses. With the machine on, add olive oil in a thin stream and process until mixture forms a cohesive dough, about 4 pulses.\nSerious Eats / Robby Lozano\nTurn out dough onto a semolina-dusted work surface and knead until smooth, about 10 minutes. (The dough should have the consistency of modeling clay and bounce back when poked.) Wrap dough tightly in plastic wrap and let rest at room temperature for 30 minutes or up to 4 hours.\nSerious Eats / Robby Lozano\nFor the Cheese Filling:\nIn a medium bowl, stir together ricotta, mozzarella, and salt until combined. Cover and refrigerate until ready to use.\nSerious Eats / Robby Lozano\nTo Roll the Pasta:\nWhen dough is done resting, cut into 4 equal pieces and loosely cover with plastic wrap on a semolina-dusted surface. Working with 1 piece at a time (and keeping remaining pieces covered), flatten dough into a 5- by 4-inch oval, about 1/4 inch thick. Dust both sides lightly with semolina flour.\nSerious Eats / Robby Lozano\nUsing a pasta machine with rollers set to widest setting, feed dough through rollers twice. Bring tapered end of dough toward middle to press to seal, folding in thirds like a letter. Feed dough, seem side first, through rollers again at the same setting. Repeat folding and rolling once more, lightly dusting dough with semolina before each roll. Dough should be smooth and rectangular in shape. (Using a stiff pastry brush, clean the pasta machine of any excess dough or semolina between rolling.)\nSerious Eats / Robby Lozano\nNarrow rollers to next setting and feed dough through rollers twice more. Continue to progressively narrow rollers, feeding dough through each setting twice, until you reach the lowest setting and the dough is very thin and semi-transparent (you should be able to see the outline of your hand through it.)\nSerious Eats / Robby Lozano\nTransfer dough sheet to liberally floured work surface. Halve the dough sheet crosswise. On one cut dough sheet, spoon 8 mounded tablespoonfuls of filling in 2 rows of 4, spaced 1 inch apart and leaving 1 inch from edges of dough. Top with the second dough sheet. Use your fingers to press dough layers together around the mounds of filling while pressing out any air.\nSerious Eats / Robby Lozano\nUsing a fluted pastry cutter or a sharp knife, cut between the mounds to form squares, about 2 1/2- by 2 1/4-inches each. (You should have about a 1/2-inch dough border around each mound of filling.)\nSerious Eats / Robby Lozano\nTransfer cut ravioli to a rimmed baking sheet liberally dusted with semolina. Repeat with the remaining pasta dough and filling. Freeze ravioli on the semolina-dusted baking sheet until hard, about 30 minutes.\nSerious Eats / Robby Lozano\nFor the Ravioli:\nIn a medium bowl, whisk eggs and milk. In a shallow dish or pie plate, combine breadcrumbs, parsley, rosemary, thyme, salt, and pepper.\nSerious Eats / Robby Lozano\nWorking one at a time, dip ravioli into egg mixture, letting excess drip off, then dredge in breadcrumb mixture, pressing to adhere. Return to baking sheet and freeze until hard, about 15 minutes. Set a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels.\nSerious Eats / Robby Lozano\nIn a Dutch oven, heat about 1 inch of vegetable oil until a thermometer registers between 335°F and 350°F (168ºC and 177ºC). Fry the ravioli in batches of 4, turning as needed with a slotted spoon, until golden brown all over, about 2 minutes per batch. Transfer fried ravioli to the prepared cooling rack and immediately sprinkle with some of the Parmesan.\nSerious Eats / Robby Lozano\nServe hot with marinara sauce for dipping.\nSerious Eats / Robby Lozano\nSpecial Equipment\nFood processor, pasta machine, pastry brush, rimmed baking sheet, cooling rack, instant-read thermometer\nNotes\nIf you can’t find good quality mozzarella, you can substitute with low-moisture, part-skim mozzarella.\nMake-Ahead and Storage\nThe breaded ravioli can be frozen for up to 1 month. Freeze on a large baking sheet in a single layer, then transfer the ravioli to resealable plastic bags.\nStuffed Pasta\nThe Latest\nPastas\nMidwestern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cheese-filled-toasted-ravioli.webp?"
}