{
  "url": "https://www.seriouseats.com/cheese-foam-tea-recipe-6755262",
  "image_url": "https://www.seriouseats.com/thmb/0xGRGvX2R1itXPMJwP4YzgFN6Bk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221205-Cheesefoam-Amanda-Suarez-14-e87bb57e755d4951a35751e311b1d520.JPG",
  "tags": [
    "Teas",
    "The Latest",
    "Cheese",
    "East Asian"
  ],
  "title": "Cheese Foam Tea",
  "full_text": "Cheese Foam Tea\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nTotal\n70 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Tea:\n6\ntablespoons\n(12g)\nloose-leaf black tea\n, or 4 tea bags\nCoarse raw sugar\n, such as demerara, to taste\nFor the Tapioca Pearls (optional):\n1\ncup\n(180g)\ndried black tapioca pearls\n(often labeled as boba)\n1\ncup\n(200g)\ncoarse raw sugar\n, such as demerara\nFor the Cheese Foam:\n6\ntablespoons\n(90ml)\nwhole milk\n2\ntablespoons\n(30g) full-fat\ncream cheese\n1\ncup\n(237ml)\nheavy cream\n2\ntablespoons\n(30g)\ngranulated sugar\n1\nteaspoon\n(3g) Diamond Crystal kosher salt; for table or fine\nsea salt\n, use half as much by volume or the same weight\nDirections\nFor the Tea:\nIn a 3-quart saucepan, bring 7 cups of water to a rolling boil over high heat. Turn off heat, add tea, cover, and let stand until water turns amber red, about 5 minutes. Strain tea (or remove tea bags) into a heatproof pitcher. Whisk in raw sugar to taste, cover, and refrigerate until cold.\nSerious Eats / Amanda Suarez\nFor the Tapioca Pearls (if using):\nIn a 2-quart saucepan, bring 6 cups of water to a rolling boil over high heat. Add tapioca pearls and cook, stirring occasionally, until all of the pearls float and turn completely brown with no white starchy bits in the center (timing can vary depending on the product; follow package cooking times for guidance). Turn off heat, cover, and let stand for 30 minutes.\nSerious Eats / Amanda Suarez\nMeanwhile, in a small pot, heat raw sugar and 1 cup water over low heat and cook, stirring, until sugar is completely dissolved. Turn off heat, cover simple syrup, and set aside. Once tapioca pearls are ready, drain pearls through a fine-mesh strainer, then add to pot with simple syrup. Cover and keep warm.\nSerious Eats / Amanda Suarez\nFor the Cheese Foam:\nIn a small bowl, combine milk and cream cheese. Using a small whisk or the back of a spoon, blend the cream cheese into the milk until no lumps remain.\nIn a medium bowl, combine cream, granulated sugar, and salt, and, using a hand mixer or a manual balloon whisk, beat at medium speed or whisk until frothy and sugar is fully dissolved, about 30 seconds. Beat or whisk in cream cheese mixture until light and airy like sea foam and still able to just barely flow, about 1 minute.\nSerious Eats / Amanda Suarez\nTo serve, divide tapioca pearls (if using) between chilled tall glasses, add ice (if desired), and pour in chilled black tea. Top each glass with a couple dollops of cheese foam. If desired, add a thick straw or a long, thin spoon to scoop up the pearls. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nHand mixer or balloon whisk\nMake-Ahead and Storage\nThe tea can be prepared in advance and refrigerated for up to 2 days. Tapioca pearls, if using, should be made the day of because cooked pearls don’t have a long shelf life and will harden when they cool down.\nTeas\nThe Latest\nCheese\nEast Asian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cheese-foam-tea.webp?"
}