{
  "url": "https://www.seriouseats.com/cheesy-onion-potato-gratin-food-lab",
  "image_url": "https://www.seriouseats.com/thmb/yu-rsBEOywXLadTiHNw1TSD_eHY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__12__20131219-pearl-onion-potato-gratin-23-fc7746941bfc4418bb449d48f2aaa104.jpg",
  "tags": [
    "Sides",
    "Savory",
    "Bacon",
    "Onions",
    "New Potatoes"
  ],
  "title": "Cheesy Onion, Bacon, and New Potato Gratin Recipe",
  "full_text": "Cheesy Onion, Bacon, and New Potato Gratin Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n20 mins\nTotal\n75 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nfinely chopped\nfresh parsley\nleaves\n1/2\ncup\nfine\nbread crumbs\n1\nmedium\nclove minced garlic\n(about\n1\nteaspoon\n)\nKosher salt\nand freshly\nground black pepper\n1 1/2\npounds\nsmall new potatoes\n1 1/2\npounds\npearl onions\n1/2\npound\nbacon\n, cut into 1/2-inch lardons\n2\ntablespoons\nheavy cream\n6\nounces\ngrated\nComté\nor\nGruyère cheese\nDirections\nAdjust an oven rack to center position and preheat oven to 400°F. Whisk together 1 tablespoon parsley, bread crumbs, and garlic in a medium bowl. Season to taste with salt and pepper and set aside.\nPlace potatoes in a medium saucepan and cover with cold water. Add 2 tablespoons salt and bring to a simmer over medium-high heat. Cook until potatoes are tender, about 10 minutes. Drain and set aside.\nMeanwhile, peel onions by cutting off tops and bottoms, scoring a light X on one cut side, and plunging in boiling water for 1 minute. Rinse under cool running water. Peels should come off easily by hand or with the help of a paring knife. Set aside.\nPlace bacon in a large skillet and cover with 1/4-inch of water. Bring to a simmer over high heat. Cook, shaking pan occasionally, until water has evaporated and bacon begins to crisp. Continue cooking, stirring frequently, until bacon is browned and crisp all over, about 8 minutes total. Add potatoes, onions, heavy cream, and remaining tablespoon parsley and toss to combine. Season to taste with salt and pepper.\nTransfer mixture to a rectangular casserole dish. Cover with cheese and transfer to oven. Bake until cheese is melted, about 10 minutes. Remove from oven, sprinkle bread crumb mixture evenly over top and return to oven. Bake until browned and bubbly, about 15 minutes longer. Allow to cool slightly, and serve.\nThis Recipe Appears In\nCheesy Onion and Potato Gratin\nSides\nSavory\nBacon\nOnions\nNew Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cheesy-onion-bacon-and-new-potato-gratin-recipe.webp?"
}