{
  "url": "https://www.seriouseats.com/cheese-danish-recipe-7487976",
  "image_url": "https://www.seriouseats.com/thmb/P2qDXsFSRLjVefbJD7vb9DR5H7Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230502-SEA-CheeseDanish-GregDupree-17-56c16d344965487faaee5b1d39eaf984.jpg",
  "tags": [
    "Pastries",
    "The Latest",
    "Breakfast & Brunch",
    "Baking"
  ],
  "title": "Cheese Danish",
  "full_text": "Cheese Danish\nClose\nJump to recipe\nPrep\n35 mins\nCook\n70 mins\nResting and Chilling Time\n4 hrs 40 mins\nTotal\n6 hrs 25 mins\nServes\n9\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Danish Dough:\n1/3\ncup\n(\n80\nml\n) warm\nwater\n(110-115ºF/43-46ºC)\n6\ntablespoons\n(\n90\ng\n) plus\n1/2\nteaspoon\ngranulated sugar\n, divided\n2 1/4\nteaspoons\n(\n7\ng\n) active\ndry yeast\n4 1/2\ncups\nbread flour\n(\n21\nounces\n;\n585\ng\n)\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nlarge\negg\n(\n2\nounces\n;\n55\ng\n)\n18\ntablespoons\n(\n255\ng\n)\nunsalted\nEuropean-style\nbutter\n, cut into 1/2-inch cubes, divided\n1\ncup\n(\n240\nml\n) cold\nwhole milk\nAll purpose flour\n, as needed\nFor the Cream Cheese Filling:\n8\nounces\n(\n226\ng\n)\ncream cheese\n, softened\n1\nlarge\negg yolk\n(\n18\ng\n)\n1/4\ncup\npowdered sugar\n, sifted, plus more for garnish (about\n1\nounce\n;\n30\ng\n)\n1/2\nteaspoon\nfresh lemon juice\n(from\n1\nwhole\nlemon\n)\n1/4\nteaspoon\nvanilla extract\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Egg Wash:\n1\nlarge egg\nDirections\nFor the Danish Dough:\nIn a medium bowl, whisk together warm water and the 1/2 teaspoon granulated sugar until the sugar dissolves. Whisk in yeast until well-combined; let stand, uncovered, at room temperature until foamy, 5 to 10 minutes.\nSerious Eats / Greg Dupree\nIn the bowl of a stand mixer fitted with a paddle attachment, beat together bread flour, salt, and remaining 6 tablespoons granulated sugar on low speed until combined, about 15 seconds. Add egg and 85g (6 tablespoons) butter; pulse mixer between low speed and off until mixture resembles coarse crumbs, about 3 minutes. Add remaining 170g (12 tablespoons) butter; pulse mixer between low speed and off until butter is coated with flour, about 10 seconds. Stir cold milk into yeast mixture, then slowly add yeast mixture while pulsing mixer between low speed and off, until a shaggy dough forms, about 2 minutes. (There will be pieces of dough that have formed together, but it will not be a smooth or homogeneous dough.)\nSerious Eats / Greg Dupree\nUsing a silicone spatula or a dough scraper, scrape dough onto a lightly floured work surface. Gently shape into a 7-inch square about 1 1/4-inch thick; the dough will be slightly sticky. Tightly wrap in plastic wrap; freeze until chilled, about 30 minutes.\nSerious Eats / Greg Dupree\nOn a lightly floured work surface, roll dough into a 18- by 9-inch rectangle (1/4-inch thick), with the long sides parallel to the counter edge. Fold the dough like a business letter: Fold dough into thirds (each section should be 6-inches wide) like a letter by bringing the right third over the center, then folding the left third over to create a smaller rectangle. (Use a bench scraper or the flat side of a chef’s knife to lift dough if necessary.) Transfer to a lightly floured 9- by 13-inch rimmed baking sheet. Cover tightly with plastic wrap and refrigerate until firm, about 45 minutes. Repeat rolling, folding, and chilling process 2 more times for a total of 3 folds. After the final fold, refrigerate dough for 1 hour 30 minutes or overnight.\nSerious Eats / Greg Dupree\nFor the Cream Cheese Frosting:\nIn a medium bowl, whisk together cream cheese, egg yolk, powdered sugar, lemon juice, vanilla, and salt until smooth. Using a silicone spatula, transfer the frosting to a pastry bag and secure the top with kitchen twine, a rubber band, or a chip clip; set aside at room temperature.\nSerious Eats / Greg Dupree\nLine 2 rimmed baking sheets with parchment paper; set aside. On a lightly floured surface, roll dough into a roughly 13-inch square (1/4-inch thick). Using a sharp chef’s knife or pizza cutter, trim edges into a 12-inch square; cut into nine 4-inch squares. Working with 1 square at a time, brush each corner of the square with beaten egg. Fold each corner into the center of the square (all corners should touch in the center) and press down gently to seal. Repeat with the 8 remaining squares of dough. Transfer to prepared baking sheets, placing each square 2 to 3 inches apart.\nSerious Eats / Greg Dupree\nTo Bake the Pastries:\nCut tip off the pastry bag to form a 1/2-inch hole. Gently press down in the center of the dough squares to create a small indentation; pipe the frosting in the center (about 2 tablespoons each; it’s okay if the mound of filling is taller than the dough.) Loosely cover with plastic wrap; let rise in a warm draft-free area (75°F or 24°C) until slightly puffed, about 45 minutes.\nSerious Eats / Greg Dupree\nPreheat oven to 425°F (220ºC) with racks in upper third and lower third positions. Remove and discard plastic wrap. Gently brush tops and sides of dough with beaten egg. (For best results, try not to get egg wash on the cut edges of the dough.) Bake until puffed and lightly browned, about 10 minutes. Rotate baking sheets from top to bottom; reduce oven temperature to 375°F (with baking sheets in oven), and bake at 375°F until Danishes are puffed and deep golden brown, 10 to 15 minutes longer. (Keep a close eye during the last few minutes of baking; 1 tray may be ready before the other). Let cool slightly on baking sheets for 15 minutes. Garnish with additional powdered sugar; serve warm or at room temperature.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nStand mixer, silicone spatula, rolling pin, whisk, pastry bag,\nsharp chef’s knife or pizza cutter, two 18- by 13- inch rimmed baking sheets\nMake-Ahead and Storage\nThe pastries are best eaten the day-of.\nPastries\nThe Latest\nBreakfast & Brunch\nBaking"
}