{
  "url": "https://www.seriouseats.com/cheeseburger-pizza-recipe-8757382",
  "image_url": "https://www.seriouseats.com/thmb/-wmAteTf7y12-ANIz974aZYlw4E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241101-SEA-DeliStudios-CheeseburgerburgerPizza-Hero2-18-0610da93ee234e21a76d7164392684f7.jpg",
  "tags": [
    "Pizza",
    "The Latest",
    "Ground Beef"
  ],
  "title": "Cheeseburger Pizza",
  "full_text": "Cheeseburger Pizza\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nProofing Time:\n60 mins\nTotal\n85 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\npizza dough\nfor an outdoor pizza oven\nor 1 recipe\nNew York-style pizza dough\n, divided and risen at least 2 hours (see notes)\n1\ntablespoon\n(15ml)\nvegetable oil\n1\nsmall white or\nyellow onion\n(\n4\nounces\n;\n113\ng\n), peeled and sliced\n8\nounces\n(\n225\ng\n)\n90% lean ground beef\nKosher salt and freshly ground pepper\n2\ntablespoons\n(30ml)\nketchup\n2\ntablespoons\n(30ml)\nmayonnaise\n1\ntablespoon\n(15ml)\nyellow mustard\n3\nounces\nshredded low-moisture mozzarella cheese\n(85g;\n3/4\ncup\n)\n2\nounces\nshredded cheddar cheese\n(56g;\n1/2\ncup\n)\nAll-purpose flour\n, for dusting\n1/4\ncup\nfresh\narugula\nSliced dill pickles\n, for serving\nDirections\nFor the Beef and Onion Topping:\nIn a large skillet, heat oil over medium-high until shimmering. Add onions and cook, stirring occasionally, until soft, about 5 minutes. Add ground beef and cook, using a wooden spoon to stir and scrape bottom of skillet, until beef is well browned and broken into small crumbles, 6 to 8 minutes. Season to taste with salt and pepper. Using a slotted spoon, transfer beef and onion mixture to a medium bowl, allowing any excess grease to drip off. Let cool to room temperature, about 10 minutes; set aside.\nSerious Eats / Deli Studios\nFor the Sauce and Cheese:\nIn a small bowl, stir ketchup, mayonnaise, and mustard to combine; set aside. In another small bowl, combine shredded mozzarella cheese and cheddar cheese.\nSerious Eats / Deli Studios\nIf Using an Outdoor Pizza Oven:\nRemove one ball of pizza dough from refrigerator. Rest in a proofing container, covered, at room temperature for 1 to 2 hours before baking. Dough temperature should reach 60ºF (15.5ºC) before stretching and baking; exact timing will depend on the ambient temperature of your kitchen. Preheat pizza oven to 800ºF (425ºC).\nFlour dough ball generously on both sides with flour and place on well-floured surface, seam side down. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough into a 10- or 12-inch circle (final dimension depends on size of your oven) about 1/4-inch thick by draping over knuckles and gently stretching. Transfer to floured wooden or metal pizza peel.\nUsing an offset spatula, spread all of the sauce evenly over surface of crust, leaving 1/2-inch border along edge. Evenly spread 1/2 of cheese mixture over sauce. Spoon enough ground beef and onion mixture to evenly cover cheese and top with remaining cheese.\nUsing a metal peel, transfer assembled pizza to oven and bake, rotating pie regularly with peel for even cooking, until rim is lightly charred and bottom is crisp, 90 to 180 seconds total. Retrieve pizza with metal peel and transfer to a cutting board. Sprinkle arugula over cooked pizza, top with pickle slices, and serve immediately.\nIf Using a Conventional Oven:\n1 hour before baking, adjust oven rack with pizza stone or steel to middle position and preheat oven to 500ºF (260ºC).\nFlour dough ball generously on both sides and place on well-floured surface, seam side down. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough into a 10- or 12-inch circle (final dimension depends on size of your oven) about 1/4-inch thick by draping over knuckles and gently stretching. Transfer to floured wooden or metal pizza peel.\nSerious Eats / Deli Studios\nUsing an offset spatula, spread all of the sauce evenly over surface of crust, leaving 1/2-inch border along edge. Evenly spread 1/2 of cheese mixture over sauce. Spoon enough ground beef and onion mixture to evenly cover cheese and top with remaining cheese.\nSerious Eats / Deli Studios\nUsing wooden or metal peel, slide assembled pizza onto pizza stone or steel and bake until cheese is melted with some browned spots and crust is golden brown and puffed, 12 to 15 minutes. Carefully transfer pizza to cutting board. Sprinkle arugula over cooked pizza, top with pickle slices, and serve immediately.\nSerious Eats / Deli Studios\nSpecial Equipment\nOutdoor pizza oven or pizza stone/steel (if using conventional oven), wooden or metal pizza peel\nNotes\nIf using New York-style pizza dough:\nAt least 2 hours before baking, remove dough from refrigerator. Divide dough into 3 equal parts; shape into balls by gathering dough towards bottom and pinching shut. Flour well and place 1 dough ball in a medium mixing bowl. Cover tightly with plastic wrap and allow to rise at warm room temperature until roughly doubled in volume. Place each remaining dough ball in a zip-top freezer bag, refrigerate, and reserve for another use.\nStore-bought pizza dough can be substituted for homemade dough.\nPizza\nThe Latest\nGround Beef"
}