{
  "url": "https://www.seriouseats.com/cheese-pie-tart-quiche-recipe",
  "image_url": "https://www.seriouseats.com/thmb/w-0o2-BVXqIEqAmxmjsoTioj_4Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150222-cheese-tarte-daniel-gritzer-8-ec38f449ed134d7c972ec535cd5902a8.jpg",
  "tags": [
    "Quiches",
    "Baked Eggs",
    "Breakfast & Brunch",
    "Mains",
    "Easter"
  ],
  "title": "Easy Mixed-Cheese Quiche Recipe",
  "full_text": "Easy Mixed-Cheese Quiche Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nActive\n25 mins\nFreezing and Cooling Time\n45 mins\nTotal\n110 mins\nServes\n6\nto 8 servings\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nrecipe\neasy pie dough\n, rolled out to a 12-inch circle (see notes)\n1\ncup\nheavy cream\n(see notes)\n1\ncup\nwhole milk\n(see notes)\n3\nlarge\neggs\n1\nteaspoon\nkosher salt\nFreshly\nground black pepper\n8\nounces\nmixed rindless soft and semi-soft cheeses (such as\nGruyere\n, Fontina, Cheddar, Gorgonzola, Stilton, Jack, etc.), cubed or broken into small clumps\nMinced chives\n, for garnish (optional)\nDirections\nLay pie dough into an 8-inch tart pan or pie dish (at least 1 1/2 inches deep), and trim excess dough around the edge. Press dough gently into edges, then, with a docker or the tines of a fork, poke holes in even rows across the base and around the wall of dough. Freeze for at least 30 minutes and up to overnight.\nSerious Eats / Daniel Gritzer\nPreheat oven to 425°F (220°C) and set rack to center position. Line dough with parchment paper, allowing it to overhang the sides, and fill the pan with pie weights, dried beans, or dry rice. Bake the crust for 10 minutes. Remove weights and parchment paper, wrap edges of the pie dough with tin foil, and return to the oven. Bake until lightly golden brown, 3 to 5 minutes. Remove and lower oven temperature to 350°F (175°C).\nIn a large bowl, whisk cream and milk with eggs until thoroughly incorporated. Whisk salt and pepper into custard base.\nSerious Eats / Daniel Gritzer\nScatter cheese all over bottom of pie and set on a rimmed baking sheet. Transfer to the oven, then carefully pour custard base into pie (you can slide the oven rack out slightly to help with this, but be sure to push it back gently to avoid spilling the pie filling). Bake until center is just barely set but still jiggles when touched, about 35 minutes. Remove from oven and allow to cool at least 15 minutes before serving. Serve warm, sprinkling minced chives on top, if desired.\nSerious Eats / Daniel Gritzer\nSpecial Equipment\n8-inch tart pan or pie plate (at least 1 1/2 inches deep)\nNotes\nFor ease, you can also use a pre-made pie crust, blind-baking according to manufacturer instructions and following recipe from step 3.\nThis recipe calls for one cup each heavy cream and whole milk, but you can also substitute two cups of half-and-half.\nRead More\nHam and Swiss Quiche\nEasy Kale Quiche\nHearty Chard, Pancetta, and Pecorino Quiche\nQuiches\nBaked Eggs\nBreakfast & Brunch\nMains\nEaster",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-mixed-cheese-quiche-recipe.webp?"
}