{
  "url": "https://www.seriouseats.com/cheese-frenchee-recipe-11686537",
  "image_url": "https://www.seriouseats.com/thmb/XmrNumo8n0dbeqtXqnnDNmPmmmA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250224-Cheese-Frenchees-Qi-Ai-hero-horizontal-closeup-47a497d62d1e4bc89f02113ffdad13e6.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Cheese",
    "Midwestern",
    "Frying"
  ],
  "title": "Cheese Frenchee (Deep-Fried Grilled Cheese Sandwiches)",
  "full_text": "Cheese Frenchee (Deep-Fried Grilled Cheese Sandwiches)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nResting Time\n20 mins\nTotal\n35 mins\nServes\n2\nto 4\nMakes\n2 Sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\n3\ncups\ncornflakes\n(2.75\nounces\n;\n78\ng\n)\n1/2\ncup\nall-purpose flour\n(\n2.5\nounces\n;\n71\ng\n)\n1\nlarge\negg\n1/4\ncup\nplus\n2\ntablespoons\n(\n90\nml\n)\nwhole milk\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\ntablespoons\n(\n30\nml\n)\nmayonnaise\n4\nslices\nwhite sandwich bread\n(see notes)\n4\nslices\nAmerican cheese\nNeutral oil\nsuch as vegetable or canola for frying\nDirections\nPlace cornflakes in a zip-top bag and use a rolling pin to lightly crush into coarse crumbs (about the consistency of panko). Pour into a shallow bowl or pie plate. In a second shallow bowl or pie plate, combine flour, egg, milk, and salt, and whisk until smooth. Set both bowls aside.\nSerious Eats / Qi Ai\nSpread 1/2 tablespoon mayonnaise on one side of each slice of bread. Set 2 bread slices down, mayonnaise side up, on a work surface. Center two cheese slices on the mayonnaise side of the 2 bread slices, then top each with the remaining bread slices, mayonnaise side down.\nSerious Eats / Qi Ai\nUse a serrated bread knife to trim crust from all sides of each sandwich to create straight sides. Cut sandwiches in half diagonally to form triangular wedges.\nSerious Eats / Qi Ai\nWorking with one wedge at a time, dip all sides into flour batter to evenly cover. Let excess batter drip off, then press all sides into cornflake crumbs to thoroughly coat. Use hand to press in additional cornflake crumbs to ensure even coverage. Transfer to a plate and repeat with remaining wedges. Refrigerate wedges while oil heats, at least 20 minutes or up to 1 day. Sandwiches will firm up slightly as they rest.\nSerious Eats / Qi Ai\nWhile sandwiches chill, line a large plate with paper towels or place a wire rack inside a baking sheet; set aside. In a large Dutch oven or 10-inch cast iron skillet, add oil until it measures 1 inch deep and heat over medium heat to 350ºF (177ºC).\nSerious Eats / Qi Ai\nUsing tongs or spider skimmer, carefully transfer two sandwich wedges into oil. Fry, adjusting heat as needed to keep oil temperature between 330 and 350°F (165ºC to 177ºC), until bottom is deep golden brown, about 1 minute. Flip and continue cooking until deep golden brown on second side, about 1 more minute. Transfer to prepared plate or baking sheet and repeat with remaining wedges. Let cool for 10 minutes before serving.\nSerious Eats / Qi Ai\nSpecial Equipment\nRolling pin, serrated bread knife, tongs or spider skimmer, 10-inch cast iron skillet or Dutch oven, instant-read or leave-in probe thermometer\nNotes\nFor the classic triangular wedge, use sandwich bread that is tall and square vs. broad and rectangular, such as Wonder Bread or Sara Lee sandwich bread. A soft, pullman-style loaf cut into 1/2- to 3/4-inch slices would also work well here.\nMake-Ahead and Storage\nOnce battered and coated, the sandwiches can be chilled in the refrigerator for up to a day before frying. You can also set the uncooked, coated sandwich wedges on a parchment-lined baking sheet and freeze until ready to cook. Once frozen, cheese Frenchees can be placed in a zip-top bag and frozen for up to 3 months. When cooking from frozen, reduce oil heat to 325°F and increase cooking time by 1 to 2 minutes per side, or until internal temperature reaches 160°F.\nSandwiches\nThe Latest\nCheese\nMidwestern\nFrying",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cheese-frenchee-deep-fried-grilled-cheese-sandwiches.webp?"
}