{
  "url": "https://www.seriouseats.com/chicken-enchilada-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uOW3pnj9l8nACsShtXS37nTwgds=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__11__20151124-enchilada-soup-recipe-kenji-1-2b2eb2784d404fb1aaa180598beee704.jpg",
  "tags": [
    "Soups",
    "Stovetop",
    "Chicken Breast"
  ],
  "title": "Easy Creamy Chicken Enchilada Soup Recipe",
  "full_text": "Easy Creamy Chicken Enchilada Soup Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nActive\n30 mins\nCooling Time\n10 mins\nTotal\n55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole\ndried guajillo chiles\n, stems and seeds removed (see note)\n2\nwhole\ndried ancho chiles\n, stems and seeds removed (see note)\n1 1/2\nquarts\n(\n1.5\nliters\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n1\nsplit\nbone-in, skin-on chicken\nbreast\n(about\n1\npound\n;\n450\ng\n)\n4\nounces\n(\n100\ng\n)\ncream cheese\n1\ntablespoon\n(\n15\nml\n)\ndistilled white vinegar\n(see note)\n1\ntablespoon\n(\n15\nml\n) vegetable or\ncanola oil\n1\nmedium\nyellow onion\n, finely diced (about\n1\ncup\n;\n1/2\npound\n;\n200\ng\n)\nKosher salt\nand freshly ground black pepper\n3\nmedium\ncloves garlic\n, minced (about\n1\ntablespoon\n;\n10\ng\n)\n2\nears\nof\ncorn, kernels\nremoved (about\n1 1/2\ncups\n;\n250\ng\n)\n1\n(14-ounce; 400 ml) can\ndiced tomatoes\n1\n(4.5-ounce; 125 ml) can\nchopped green chiles\n(see note)\n1\n(14.5-ounce; 400 g) can\nblack beans\n, drained and rinsed\n1/2\npound\n(\n225\ng\n) grated\nPepper Jack cheese\n1\ntablespoon\n(\n15\nml\n)\nfresh juice\nfrom\n1\nlime\n1/2\ncup\npicked\nfresh cilantro leaves\n(about\n1\nounce\n;\n30\ng\n), chopped\nDiced avocado\n, picked fresh cilantro leaves, sliced scallions, and grated cheese, for serving\nDirections\nPlace guajillo and ancho chiles on a microwave-safe plate and microwave on high at 15-second intervals until hot, pliable, and toasted-smelling, about 30 seconds total. Combine chicken stock, split chicken breast, and toasted chiles in a large saucepan or pot. Bring to a boil, reduce to lowest heat setting, cover, and cook until chicken breast is cooked through (an instant-read thermometer inserted into the center of the breast should register 155 to 160°F, or 68 to 71°C) and chiles are tender, about 15 minutes.\nRemove chicken breast to a plate and set aside to cool. Transfer chiles to the jar of a blender and add 1 cup of stock. Blend, starting at lowest speed and gradually increasing to high speed, until chiles are completely puréed, about 2 minutes. Add cream cheese and blend until homogeneous, about 1 minute, adding more stock as necessary if the mixture is too thick. Whisk chile/cream cheese mixture back into remaining chicken stock. Whisk in vinegar and set aside.\nWhen chicken is cool enough to handle, shred meat into bite-sized pieces using your fingers or two forks. Set aside. Discard skin and bones.\nHeat oil in a large saucepan over medium heat until shimmering. Add onion, season with salt and pepper, and cook, stirring, until softened but not browned, about 5 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds.\nAdd corn and cook, stirring, until heated through, about 3 minutes. Add tomatoes, chopped green chiles, black beans, and stock/chile/cream cheese mixture. Bring to a simmer over medium heat, stirring frequently. Stir in pepper jack cheese, shredded chicken, and lime juice. Season to taste with more salt and pepper. Stir in cilantro. Serve immediately with diced avocado, picked fresh cilantro leaves, sliced scallions, and grated cheese.\nSpecial Equipment\nMicrowave\n,\ninstant-read thermometer\n,\nblender\n, large\nsaucepan\nNotes\nFor an easier version, use 1 cup (250ml) canned red enchilada sauce in place of the chiles and vinegar.\nYou can use two fresh Hatch, Anaheim, or poblano peppers in place of the can of chopped green chiles. Roast the peppers in a foil-lined rimmed baking sheet under a broiler preheated to high, turning the chiles occasionally, until they're charred on all sides, about 10 minutes total. Wrap them tightly in foil and let them rest for 5 minutes. Peel the chiles, discard stems and seeds, and chop.\nRead More\nReal-Deal Tortilla Soup Recipe\nSopa de Lima (Yucatán-Style Lime Soup) Recipe\nSlow-Cooker Chicken Tortilla Soup With All the Fixings Recipe\nEasy Pressure Cooker Chicken Enchiladas Recipe\nSoups\nStovetop\nChicken Breast"
}