{
  "url": "https://www.seriouseats.com/chicken-and-leek-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/9B17BbjPZ5FtQhwFIyP65LTJ3TI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__03__20130320-244349-british-bites-chicken-leek-pie-cf0b3f299abb48d2bcd46a2aa203f7d4.JPG",
  "tags": [
    "British",
    "Savory",
    "Chicken Legs",
    "Leeks",
    "Pies"
  ],
  "title": "Chicken and Leek Pie Recipe",
  "full_text": "Chicken and Leek Pie Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n100 mins\nActive\n30 mins\nCooling Time\n60 mins\nTotal\n2 hrs 55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nbone-in, skin-on chicken leg pieces\n(thighs and drumsticks)\n1\nmedium\nonion\n, quartered\n3\nsprigs\nparsley\n1\nsmall bunch\nthyme\n, divided\n6\nsage\nleaves\n, divided\n3\ntablespoons\nunsalted butter\n, divided\n2\nleeks\n, thinly sliced (about\n1\ncup\n)\n2\ntablespoons\nall-purpose flour\n1/2\nteaspoon\nDijon mustard\n1/4\ncup\ncream\nKosher salt\nand freshly ground black pepper\n1\npound\nfrozen puff pastry\n, thawed\n1\negg\n, beaten\nDirections\nIn a large pot, combine chicken leg pieces, onion, parsley, 1/2 bunch thyme, and 3 sage leaves, and cover with water. Bring to a simmer over medium-high heat, reduce to low, cover, and cook until chicken is tender and falling off bone, about 1 hour. Remove and reserve chicken pieces, strain cooking liquid and reserve, and discard remaining solids. Return cooking liquid to pot and simmer until reduced to 1 1/2 cups, about 10 minutes. Reserve.\nShred the chicken and transfer to a large bowl, discarding skin and bones.\nRemove leaves from the remaining thyme, and finely slice remaining sage. Melt 1 tablespoon butter in a large skillet over medium-high heat. Add leeks, thyme leaves, and sliced sage. Cook, stirring often, until the leeks are softened but not browned, about 4 minutes. Combine leeks and chicken.\nMelt remaining butter in the skillet over medium-high heat and add flour. Cook, stirring often, until flour just begins to brown, about 2 minutes. Whisking constantly, slowly add 1 1/2 cups reserved cooking liquid and Dijon mustard and bring to a simmer. Remove from heat and whisk in cream, then season to taste with salt and pepper. Pour sauce over chicken and leeks and mix until fully incorporated; taste and season again with salt and pepper if necessary. Allow the mixture to fully cool before assembling pie.\nTo Assemble the Pie\n: Adjust oven rack to middle position and preheat to 400°F (200°C). Divide puff pastry into 2 pieces and roll each piece into a 9- by 11-inch rectangle. Place 1 rectangle on an aluminium foil-lined baking sheet, then place the filling in the center of the pie, leaving a 1-inch border. Brush the border with beaten egg, then place the remaining sheet of pastry on top. Pinch the edges closed, then brush the edges with egg and fold each edge over. Brush the rest of the pie with egg. With the tip of a knife, make two holes for the center for the steam to escape, Gently score the top of the pie. Bake until pie is golden brown and crisp, about 20 minutes. Transfer to a serving platter and serve.\nSerious Eats / Sydney Oland\nRead More\nChicken Pot Pie With Buttermilk Biscuit Topping\nIndividual Double-Crusted Chicken Pot Pies\nBritish\nSavory\nChicken Legs\nLeeks\nPies"
}