{
  "url": "https://www.seriouseats.com/chicken-satay-recipe-8646810",
  "image_url": "https://www.seriouseats.com/thmb/yjG1uIEVULroE7nBBzG8F5BsLBg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240507-SEA-ChickenSate-Melati-Citrawireja-14-b2368ea859b14f8da7e3e7a463b37329.jpg",
  "tags": [
    "Indonesian",
    "The Latest",
    "Chicken Thighs",
    "Southeast Asian",
    "Grilled Chicken"
  ],
  "title": "Chicken Satay",
  "full_text": "Chicken Satay\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nMarinating Time\n60 mins\nTotal\n95 mins\nServes\n24 skewers\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\npeanut sauce\n, plus more for drizzling and serving\n1/2\ncup\n(\n120\nml\n)\nkecap manis\n, plus more as needed and for serving\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n2\ntablespoons\n(\n30\nml\n)\nlime juice\nfrom\n2\nKey\nlimes\nor\n1\nPersian\nlime\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\nmakrut lime leaves\n2\npounds\n(\n907\ng\n)\nboneless, skinless chicken thighs\n(about\n8\nthighs\n), cut into 3/4-inch cubes\n25 to 30\nbamboo skewers\n, soaked in water for at least 30 minutes (see notes)\n2\nsmall\nshallots\n(\n2\nounces\n;\n57\ng\n), chopped into 1-inch pieces\n1\nmedium\nEnglish cucumber\n(\n10\nounces\n;\n285\ng\n), cut into 1-inch pieces\nFried shallots\n,\nhomemade\nor store-bought, for serving\nDirections\nIn a large bowl, whisk 1/4 cup peanut sauce with the kecap manis, oil, lime juice, salt, and lime leaves until combined. Season to taste with additional kecap manis, lime juice, and salt as needed. Add chicken to marinade and toss to evenly coat. Cover bowl tightly with plastic wrap and marinate in the refrigerator for at least 1 hour and up to 1 day.\nSerious Eats / Melati Citrawireja\nThread 4 to 5 chicken pieces onto each skewer, packing them together tightly at the pointed end. Repeat with remaining chicken and skewers; reserve leftover marinade for basting.\nSerious Eats / Melati Citrawireja\nOpen grill's bottom vent completely. Light large chimney starter 2/3 filled with charcoal briquettes (about 4 quarts). When top coals are lit and partially covered with grey ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and open lid vent fully, and allow to preheat for 5 minutes. Alternatively, set the burners on a gas grill to the medium-high setting, cover, and preheat for 10 minutes. Clean and oil grilling grate.\nSerious Eats / Melati Citrawireja\nWorking in batches if needed, place chicken skewers over hot side of grill and cook, turning often and basting occasionally with reserved marinade, until cooked through and lightly charred, 5 to 8 minutes. Transfer cooked satay to a plate or rimmed baking sheet and cover with aluminum foil while grilling the remaining skewers.\nSerious Eats / Melati Citrawireja\nArrange satay on a large platter with shallots, cucumber, and lontong, if using. Drizzle satay with peanut sauce and kecap manis. Sprinkle with fried shallots. Serve immediately with a small bowl of peanut sauce for dipping.\nSerious Eats / Melati Citrawireja\nNotes\nSome grocery stores carry bamboo skewers and you can easily purchase them online, but if you plan on making satay regularly, it’s worth investing in a set of reusable metal skewers.\nTo soak bamboo skewers, place them in a 9- by 13-inch baking dish and cover with water. Let soak for 30 minutes.\nMake-Ahead and Storage\nChicken thighs can be marinated up to 24 hours in advance.\nCooked satay can be removed from skewers and refrigerated in an airtight container for up to 3 days.\nIndonesian\nThe Latest\nChicken Thighs\nSoutheast Asian\nGrilled Chicken",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-satay.webp?"
}