{
  "url": "https://www.seriouseats.com/chicken-fried-chicken-with-cream-gravy-recipe",
  "image_url": "https://www.seriouseats.com/thmb/14OfEXl1_wXvgbiLvJ7uOMPUja4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__07__20150716-chicken-fried-chicken-recipe-food-lab-52-09f82096b16d4a4d9c0f8814be5d8c17.jpg",
  "tags": [
    "Fried Chicken",
    "Soul Food & Southern",
    "Chicken Thighs",
    "Chicken Mains"
  ],
  "title": "Chicken-Fried Chicken With Cream Gravy Recipe",
  "full_text": "Chicken-Fried Chicken With Cream Gravy Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n60 mins\nMarinating Time\n4 hrs\nTotal\n4 hrs 55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n2\ntablespoons\npaprika\n2\ntablespoons\nfreshly\nground black pepper\n2\nteaspoons\ngarlic powder\n2\nteaspoons\ndried oregano\n1/2\nteaspoon\ncayenne pepper\n4\nboneless, skinless chicken thighs\n(about\n4 ounces\neach), or\n2\nboneless, skinless chicken breasts\n(about\n8 ounces\neach),\ncut and pounded into\n4\ncutlets\n(see note)\n1\ncup\nbuttermilk\n1\nlarge\negg\n1\ntablespoon\nplus\n2\nteaspoons\nkosher salt\n, divided\n1 1/2\ncups\nall purpose flour\n1/2\ncup\ncornstarch\n1\nteaspoon\nbaking powder\n4\ncups\nvegetable shortening or\npeanut oil\n, for frying\nFor the Cream Gravy:\n2\ntablespoons\nunsalted butter\n1\nsmall\nonion\n, finely chopped (about\n3/4\ncup\n)\n2\nmedium cloves\ngarlic\n, minced (about\n2\nteaspoons\n)\n2\ntablespoons\nall purpose flour\n1\ncup\nwhole milk\n3/4\ncup\nheavy cream\nKosher sal\nt and freshly ground black pepper\nDirections\nFor the Chicken:\nCombine the paprika, black pepper, garlic powder, oregano, and cayenne pepper in a small bowl and mix thoroughly with a fork.\nOne at a time, sandwich each piece of chicken between two pieces of plastic wrap or inside an opened zipper-lock bag and pound with a meat pounder or the bottom of a heavy skillet until approximately 1/4 inch thick.\nWhisk the buttermilk, egg, 1 tablespoon salt, and 2 tablespoons of the spice mixture in a large bowl. Add the chicken and turn to coat. Transfer the contents of the bowl to a gallon-sized zipper-lock freezer bag and refrigerate for at least 4 hours and up to overnight, flipping the bag occasionally to redistribute the contents and coat the chicken evenly.\nFor the Gravy:\nWhen ready to fry the chicken, make the gravy: Heat the butter in a 10-inch heavy-bottomed nonstick skillet over medium-high until foamy. Add the onion and cook until softened, about 4 minutes (lower the heat if the butter starts to brown). Add the garlic and cook, stirring, until fragrant, about 30 seconds. Add the flour and cook, stirring constantly, until fully absorbed, about 1 minute. Add the milk in a thin stream, whisking constantly. Add the cream, whisking, and bring to a simmer, whisking constantly. Simmer, whisking, until thickened, about 3 minutes. Season to taste with salt and plenty of pepper. Keep warm while you fry the chicken.\nWhisk together the flour, cornstarch, baking powder, 2 teaspoons salt, and the remaining spice mixture in a large bowl. Add 3 tablespoons of the marinade from the zipper-lock bag and work it into the flour with your fingertips. Remove the chicken from the bag, allowing the excess buttermilk to drip off. Drop the chicken into the flour mixture and toss and flip until thoroughly coated, pressing with your hand to get the flour to adhere in a thick layer. Shake the chicken over the bowl to remove excess flour, then transfer to a large plate.\nAdjust an oven rack to the middle position and preheat the oven to 175°F. Heat the shortening or oil to 425°F in a wok or 12-inch cast iron skillet over medium-high heat, about 6 minutes. Adjust the heat as necessary to maintain the temperature, being careful not to let the fat get any hotter.\nCarefully lower 2 pieces of chicken into the pan. Adjust the heat to maintain the temperature at 325°F for the duration of cooking. Fry the chicken pieces without moving them for 2 minutes. Carefully agitate the chicken with a wire-mesh spider or tongs, making sure not to knock off any breading, and cook until the bottom is a deep golden brown, about 3 minutes. Carefully flip the chicken and continue to cook until the second side is golden brown, about 2 minutes longer.\nTransfer the chicken to a paper towel–lined plate to drain for 30 seconds, flipping once, then transfer to a wire rack set on a rimmed baking sheet and transfer to the oven to keep warm. Repeat with the remaining 2 pieces of chicken. Serve with the cream gravy.\nSpecial Equipment\nCast iron chicken fryer, 12-inch\ncast iron skillet\n, or large\nwok\n;\nrimmed baking sheet and wire rack\nNotes\nFor juicier results, use chicken thighs. If you prefer light meat, you can buy 4-ounce chicken cutlets at the supermarket, or follow our guide to\ncut your own chicken cutlets\nfrom boneless, skinless breasts.\nFried Chicken\nSoul Food & Southern\nChicken Thighs\nChicken Mains"
}