{
  "url": "https://www.seriouseats.com/chicken-paitan-broth",
  "image_url": "https://www.seriouseats.com/thmb/b8TtMY_oKJbHUMVrM-UR8dplW7Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181113-homemade-ramen-dark-broth-miso-tori-paitan-vicky-wasik-24-4df3dacf2e014c10ada11bcb4a5ae331.jpg",
  "tags": [
    "Japanese",
    "Pressure Cooked Chicken",
    "Ramen",
    "Comfort Food",
    "Noodle Mains"
  ],
  "title": "Chicken Paitan Broth (Tori Paitan Dashi) Recipe",
  "full_text": "Chicken Paitan Broth (Tori Paitan Dashi) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs 10 mins\nActive\n30 mins\nInfusing Time\n40 mins\nTotal\n3 hrs 5 mins\nServes\n3 servings\nCook Mode\n(Keep screen awake)\nIngredients\nLeftover\nstrained chicken carcass and vegetables\nfrom\nchintan shoyu ramen broth\n(see note)\nor\n1\n(\n4-pound; 1.8 kg\n)\nchicken\n,\ncut into parts\n1\nmedium\nleek\n(about\n10\nounces\n;\n300\ng\n), including dark-green parts,\nsliced crosswise very thinly\nand washed well of sand\n1\nmedium\nonion\n(about\n11\nounces\n;\n310\ng\n), peeled and\ndiced\n1\nmedium\ncarrot\n(about\n6\nounces\n;\n170\ng\n), peeled and diced\n6\nmedium cloves\ngarlic\n, minced\n1\n(\n1-inch) piece\nginger\n, peeled and thinly sliced\n1/4\nounce\nkombu\n(\n7\ng\n; about\n1\n(7- by 2-inch) piece\n)\nDirections\nIf Using Spent Chicken Carcass and Vegetables From Chintan Ramen Broth Recipe:\nPlace spent chicken carcass in a pressure cooker and cover with 6 1/4 cups (1.5L) water. (No matter what, be sure not to exceed the max-fill line of your cooker.) Bring to high pressure and cook for 1 hour and 20 minutes. Allow pressure to release naturally.\nUsing an immersion blender, blend contents of pressure cooker into a porridge-like slurry (see note). Alternatively, transfer contents of pressure cooker in batches to a high-quality countertop blender and blend. You can also use a wooden spoon or potato masher to break up and crush the chicken parts in the pot into small bits; however, you will then need to boil the mixture over high heat, stirring periodically, for 30 minutes in order to emulsify the broth.\nWorking in batches, pour mixture through a fine-mesh strainer directly into mixing bowl filled with spent vegetables and kombu from chintan broth. Press firmly on solids to extract as much liquid as possible. Discard strained chicken solids.\nLet broth steep for 30 minutes. Strain broth through a fine-mesh strainer into a clean mixing bowl, pressing firmly on vegetables to extract as much broth as possible. Discard vegetables. Transfer broth to airtight containers and refrigerate.\nIf Using Fresh Chicken and Fresh Vegetables:\nPlace chicken in a pressure cooker and cover with 6 1/4 cups (1.5L) water. (No matter what, be sure not to exceed the max-fill line of your cooker.) Bring to high pressure and cook for 2 hours. Allow pressure to release naturally.\nUsing an immersion blender, blend contents of pressure cooker into a porridge-like slurry (see note). Alternatively, transfer contents of pressure cooker in batches to a high-quality countertop blender and blend very briefly, just to break up larger bones. You can also use a wooden spoon or potato masher to break up and crush the chicken parts in the pot into small bits; however, you will then need to boil the mixture over high heat, stirring periodically, for 30 minutes in order to emulsify the broth.\nWorking in batches, strain chicken mixture through a fine-mesh strainer directly into a large heatproof mixing bowl, pressing firmly on the mixture to ensure that all the liquid has been extracted. Discard chicken solids.\nAdd broth to a pot and bring mixture to a boil over high heat. Turn off heat and add leek, onion, carrot, garlic, and ginger. Stir mixture once and add kombu. Let steep for 40 minutes.\nPour broth through a fine-mesh strainer into a clean, large heatproof mixing bowl, pressing on solids to extract as much liquid as possible. Discard vegetables. Transfer broth to airtight containers and refrigerate.\nSpecial Equipment\nImmersion\nor\ncountertop blender\n,\npressure cooker\n,\nfine-mesh strainer\n, 2 large\nmixing bowls\nNotes\nThis broth was designed specifically to use up leftover ingredients from our\nchintan broth recipe\n. After you've strained all the chicken parts and vegetables from that broth, save them—bones, meat, skin, and all—for this one.\nIf you're concerned about the possibility of your immersion blender breaking, either use a countertop blender or simply break up the bones and meat with a potato masher or wooden spoon and boil the mixture.\nMake-Ahead and Storage\nThe broth will keep in the refrigerator for up to 1 week. It can be frozen for up to 3 months.\nRead More\nHow to Make Chicken Paitan Ramen\nMiso Tori Paitan Ramen (Creamy Chicken Broth Ramen)\nStovetop Chicken Chintan Stock (Clear Chicken Stock for Ramen)\nFrom-Scratch Shio Ramen\nHomemade Ramen Noodles\nSoft-Boiled Eggs for Ramen\nJapanese\nPressure Cooked Chicken\nRamen\nComfort Food\nNoodle Mains"
}