{
  "url": "https://www.seriouseats.com/chicken-chintan-broth-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0cPXkGEYDN56Ywlu47-s6prn4XA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__03__20190313-shio-ramen-vicky-wasik-37-4fe6165f64594c98854497c3fe77a2b0.jpg",
  "tags": [
    "Soups",
    "Japanese",
    "Stovetop",
    "Whole Chicken"
  ],
  "title": "Stovetop Chicken Chintan Stock (Clear Chicken Stock for Ramen) Recipe",
  "full_text": "Stovetop Chicken Chintan Stock (Clear Chicken Stock for Ramen) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n3 hrs 5 mins\nActive\n20 mins\nSteeping Time\n45 mins\nTotal\n4 hrs\nServes\n4\nto 6 servings\nMakes\n2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nchicken\n(about\n4\npounds\n;\n1.8\nkg\n),\ncut up into\n14\nparts\n(see note)\n1\nmedium\nleek\n(about\n10\nounces\n;\n280\ng\n), including dark-green parts, washed well of sand and\nsliced crosswise very thinly\n(see note)\n1\nmedium\nyellow onion\n(about\n11\nounces\n;\n310\ng\n), peeled and\ndiced\n(see note)\n1\nmedium\ncarrot\n(about\n6\nounces\n;\n170\ng\n), peeled and diced (see note)\n6\nmedium\ncloves garlic\n, minced (see note)\n1\n(\n1-inch) piece\nginger\n, peeled and thinly sliced (see note)\n1/4\nounce\nkombu\n, or dried kelp (\n7\ng\n; about\n1\n(7- by 2-inch)\npiece\n)\nDirections\nPlace chicken breast meat in the bowl of a food processor. Pulse until meat is well chopped up and roughly resembles ground beef.\nAdd remaining chicken parts to a stockpot. Place ground chicken breast meat on top and cover with water by about 2 inches (about 2 quarts or 1.8L water).\nPlace stockpot over high heat and bring to a simmer, stirring occasionally to break up ground-meat mixture.\nAdjust heat to medium-low or low to maintain a bare simmer; the temperature of the water should register around 205°F (96°C) and a steady but gentle stream of rising bubbles should be visible, with little to no agitation on the surface of the liquid. Adjust the pot's position so that it is not directly over the eye of the burner, but off to the side, to create a convection current. (This will help regulate the temperature of the liquid.) Keep at a bare simmer for 3 hours.\nPlace chopped leek, onion, carrot, garlic, and ginger in a large heatproof mixing bowl.\nUsing a ladle or large spoon, skim off the layer of fat on top of the stock. (This fat can be strained of any debris and used as an aroma oil for ramen, or for some other purpose; it can also be discarded.) Leftover chicken parts can be used to make\nniban tori paitan\nbroth\n, or they can be discarded. Discard ground chicken breast meat.\nStrain stock through a fine-mesh strainer into the mixing bowl with the chopped vegetables. Submerge kombu in stock and let steep 45 minutes.\nStrain stock through fine-mesh strainer into a clean bowl. Vegetables and kombu can be reserved for use in niban tori paitan broth, or they can be discarded. Decant stock into sealable containers and refrigerate.\nSpecial equipment\nFood processor\n,\nstockpot\n,\nfine-mesh strainer\nNotes\nThe more finely you cut the vegetables, the better the final flavor of the stock will be. Larger pieces of leftover chicken (but not the ground breast meat) can be used to make a\nniban tori paitan broth\n, as can the leftover vegetables and kombu.\nMake-Ahead and Storage\nIn the refrigerator, the stock will keep for 1 week. In the freezer, it will keep for up to 3 months.\nThis Recipe Appears In\nHow to Make\nShio\nRamen (\"Salt-Flavored\" Ramen)\nSoups\nJapanese\nStovetop\nWhole Chicken",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/stovetop-chicken-chintan-stock-clear-chicken-stock-for-ramen-recipe.webp?"
}