{
  "url": "https://www.seriouseats.com/chicken-green-chile-taco-recipe",
  "image_url": "https://www.seriouseats.com/thmb/FFfWC-d6a39QNuCPdyiN8Ubm2mM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__08__20130818-chicken-green-chili-tacos-4-7072619835fb4806acbf658a937520b5.jpg",
  "tags": [
    "Mexican",
    "Gluten-free Mains",
    "Stovetop Chicken",
    "Chicken Thighs",
    "Green Chiles"
  ],
  "title": "Chicken Green Chile Tacos Recipe",
  "full_text": "Chicken Green Chile Tacos Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nActive\n30 mins\nCooling Time\n5 mins\nTotal\n75 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ngreen chiles\n, preferably Hatch or Anaheim (see note)\n2\nmedium\ntomatillos\n, husks removed, split in half\n1\nsmall\nyellow onion\n, peeled and split in half\n3\ncloves\ngarlic\n2\ntablespoons\nvegetable oil\n, divided\n1\ncup\nfresh\ncilantro leaves\n, roughly chopped\nKosher salt\nand freshly ground black pepper\n4\nlimes\n2\npounds\nchicken thighs\n(bone in and skin on)\n1\nsmall\nwhite onion\n, minced\n16 to 24\nwarm\ncorn tortillas\n1\nbatch\npickled red onions\n1/2\ncup\ngrated queso cotija or\nJack cheese\n1\navocado\n, sliced\nDirections\nPreheat broiler to high and adjust broiler rack to 5 to 6 inches below heating element. Toss peppers, tomatillos, yellow onion, and garlic in a medium bowl with 1 tablespoon olive oil. Place on a foil lined rimmed baking sheet and broil until vegetables are completely tender and charred on all sides, turning occasionally, about 20 minutes total. Peel peppers and remove stems and seeds when cool enough to handle. Transfer vegetables to a food processor or blender with half of the cilantro and process on high speed until smooth. Add 2 tablespoons lime juice from about 2 of the limes, season to taste with salt, and set aside.\nWhile vegetables broil, heat remaining oil in a Dutch oven over high heat until shimmering. Add chicken pieces skin side-down and cook without moving until well browned, about 6 minutes. Flip and brown second side, about 3 minutes longer. Remove to a plate and set aside. Pour off excess fat and deglaze dutch oven with 1 cup water, scraping up browned bits from bottom.\nWhen vegetable puree has been made, transfer to the Dutch oven and stir with the water to combine. Nestle the chicken pieces into it. Bring to a boil, reduce to a bare simmer, cover, and cook until chicken is completely tender, about 30 minutes. Remove chicken from sauce and place on a plate to cool.\nWhen chicken is cool enough to handle, discard skin and bones and shred meat into bite-sized pieces. Return meat to sauce and bring to a simmer. Cook until thick and saucy, then season to taste with salt and pepper if desired.\nCombine white onion and remaining cilantro in a bowl. Serve chicken with warm tortillas, onion and cilantro mixture, pickled onions, cheese, and avocado.\nThis Recipe Appears In\nHow to Make Juicy Chicken Green Chile Tacos\nMexican\nGluten-free Mains\nStovetop Chicken\nChicken Thighs\nGreen Chiles"
}