{
  "url": "https://www.seriouseats.com/chicken-inasal-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5SbSapJBYxb-quZjYSnFClwiDyw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220906-Chicken-Inasal-Julia-Hartbeck-hero-01-565b615f634d4990a91217dfdaf0fbb7.jpg",
  "tags": [
    "Filipino",
    "Chicken Legs",
    "Lemongrass",
    "Chicken Mains",
    "Grilled Chicken"
  ],
  "title": "Chicken Inasal (Filipino Grilled Chicken)",
  "full_text": "Chicken Inasal (Filipino Grilled Chicken)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nActive\n75 mins\nMarinating and Cooling Time\n6 hrs 15 mins\nTotal\n7 hrs 15 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinated Chicken:\n2/3\ncup\n(\n150\nml\n)\ncoconut vinegar\n1/2\ncup\n(\n120\nml\n)\nfresh lemon juice\n(from\n3 to 4\nlemons\n) or calamansi juice (see note)\n1/4\ncup\n(\n60\nml\n)\nMaggi seasoning\n1/2\ncup\n(\n115\ng\n) packed dark\nmuscovado sugar\n(see note)\n1/2\ncup\n(\n120\nml\n) lemon-lime soda, such as\nSprite\n3\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core finely chopped (about\n50\ng\n)\n1\n(2-inch) knob\npeeled\nfresh ginger\n(\n25\ng\n), grated\n8\nmedium\ngarlic cloves\n(\n40\ng\n), minced\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; if using table salt, use half as much by volume or the same weight\n1 1/2\nteaspoons\nfreshly\nground black pepper\n3\npounds\n(\n1.4\nkg\n) bone-in, skin-on\nchicken thighs\nor leg quarters\nFor the Annatto Oil:\n2\ntablespoons\n(\n20\ng\n)\nannatto seeds\n1\ncup\n(\n235\nml\n) refined\ncoconut oil\n(see note)\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; if using table salt, use half as much by volume or the same weight\n1\ntablespoon\n(\n5\nml\n) fresh\nlemon juice\n(from\n1\nlemon\n) or calamansi juice (see note)\nFor the Sawsawan Dipping Sauce:\n1/2\ncup\n(\n120\nml\n)\nsinamak\n(spiced coconut vinegar; see note)\n1/2\ncup\n(\n120\nml\n) fresh\nlemon juice\n(from\n3 to 4\nlemons\n) or calamansi juice, optional (see note)\n1/2\ncup\n(\n120\nml\n)\nsoy sauce\n, optional\n1 to 2\nfresh\nThai chiles\n, stemmed, whole or roughly chopped (optional)\nFor Serving:\n1\nscallion\n, ends trimmed and sliced thinly on a bias, for garnish\n1\ntablespoon\n(\n6\ng\n)\nhomemade\nor store-bought\nfried garlic\n, for garnish\nCooked white rice\nor\ngarlic fried rice\nDirections\nFor the Marinated Chicken:\nIn a large mixing bowl, whisk together coconut vinegar, lemon or calamansi juice, Maggi seasoning, muscovado sugar, lemon-lime soda, lemongrass, ginger, garlic, salt, and black pepper until sugar and salt are completely dissolved, about 1 minute. Set aside.\nSerious Eats / Julia Hartbeck\nUsing a sharp knife, make two 1-inch long slits, about 1/4-inch deep, across the skin of each chicken thigh. Flip chicken over, and, using the tines of a fork, poke holes all over the underside of each piece. Add chicken to the marinade and, using your hands, toss to thoroughly coat. Cover tightly with plastic wrap and refrigerate for at least 6 hours or up to 8 hours.\nSerious Eats / Julia Hartbeck\nFor the Annatto Oil:\nIn a small pot, heat coconut oil and annatto seeds over medium-low heat until the oil turns bright orange-red, about 10 minutes. Strain oil through a fine mesh strainer set over a medium heatproof bowl, discarding seeds. Let oil cool to room temperature. Once cool, whisk in salt and lemon or calamansi juice and set aside.\nSerious Eats / Julia Hartbeck\nFor the Sawsawan Dipping Sauce\n: In a medium bowl, whisk together sinamak, lemon juice or calamansi juice (if using), soy sauce (if using), and chiles (if using) until combined and set aside.\nSerious Eats / Julia Hartbeck\nTo Grill:\nLight one chimney full of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners of a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nSerious Eats / Julia Hartbeck\nRemove chicken from marinade, allow excess marinade to drip off, and transfer to a rimmed baking sheet; discard marinade. Brush chicken all over with annatto oil, then place chicken skin side up on cooler side of grill. Cover grill (if using a charcoal grill, open vents on lid, aligned over chicken, and open bottom vents) and cook for 5 minutes. Flip chicken, brush all over with annatto oil, cover, and cook for 5 minutes. Continue to cook chicken, flipping and brushing with annatto oil every 5 minutes, until an instant-read thermometer inserted into thickest part of the thigh registers 140°F (60°C), about 20 minutes total.\nSerious Eats / Julia Hartbeck\nBrush chicken all over with annatto oil and set, skin side down, over hotter side of grill. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of thigh registers 165°F (74°C), about 5 minutes longer; only lift lid long enough to take the temperature, as the extra oxygen can encourage flair-ups and burning. If chicken threatens to burn before internal temperature is achieved, transfer to the cooler side of the grill, cover, and continue to cook until done. Transfer chicken to a wire rack set over a rimmed baking sheet and let rest for 5 minutes.\nSerious Eats / Julia Hartbeck\nTo Use the Oven/Stovetop:\nAdjust oven rack to middle position and preheat to 425°F (218°C). Line a rimmed baking sheet with aluminum foil and place a wire rack on top. Remove chicken from marinade, allow excess marinade to drip off, and set chicken skin side down on prepared wire rack; discard marinade. Brush chicken all over with annatto oil and cook for 10 minutes. Flip chicken to skin side up, brush all over with annatto oil, and cook for 10 minutes. Continue to cook chicken, flipping and brushing with annatto, until lightly browned and an instant-read thermometer inserted into thickest part of thigh registers 165°F (74°C), about 10 minutes longer. Remove chicken from oven, brush both sides with annatto oil, and set aside.\nSerious Eats / Julia Hartbeck\nHeat a cast iron skillet or grill pan over high heat until lightly smoking. Rub skillet lightly with oil, then sear chicken skin side down until lightly charred, about 3 minutes. Transfer chicken to a wire rack set over rimmed baking sheet and let rest 5 minutes.\nSerious Eats / Julia Hartbeck\nTo Serve:\nTransfer chicken to a serving platter, garnish with scallions and fried garlic, then serve immediately with sawsawan dipping sauce and white rice or garlic fried rice alongside.\nSerious Eats / Julia Hartbeck\nSpecial Equipment\nCharcoal or gas grill, chimney starter (optional)\nNotes\nCalamansi is difficult to source fresh in the US, but occasionally Filipino groceries located in California or Florida will have them. You can also buy frozen calamansi juice from a well-stocked Asian or Filipino market; it has a better flavor than bottled options. If you’re not able to find calamansi, substitute by following a formula of one part freshly squeezed lemon juice to one-half part freshly squeezed lime juice to one-quarter part granulated sugar (by volume).\nYou can use light or dark brown sugar in place of dark muscovado sugar.\nYou can use vegetable or canola oil, or even\nschmaltz\n, instead of coconut oil.\nSpiced coconut vinegar, also known as sinamak, can be found in Asian markets and online (it can also be labeled as pinakurat, which is an extra-spicy version). If you can’t find coconut vinegar, cane vinegar, which can be found in Asian markets or online, or distilled white vinegar are acceptable substitutes.\nMake-Ahead and Storage\nYou can prepare the annatto oil, without the salt and calamansi juice, ahead of time and keep it refrigerated in an airtight container for up to 3 months. Before using, melt oil over medium-low heat then let cool to room temperature. Once cool, whisk in salt and lemon or calamansi juice.\nThe marinade, without the lemon-lime soda, can be prepared ahead of time and refrigerated in an airtight container for up to 1 week. Whisk in soda right before marinating chicken.\nLeftover chicken inasal can be refrigerated in an airtight container for up to 3 days.\nFilipino\nChicken Legs\nLemongrass\nChicken Mains\nGrilled Chicken",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-inasal-filipino-grilled-chicken.webp?"
}