{
  "url": "https://www.seriouseats.com/chicken-couscous-tfaya-recipe-11683253",
  "image_url": "https://www.seriouseats.com/thmb/Kv11glaB3EhpCLnTJOPQ-6upcLU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250218-SEA-ChickenCouscousTfaya-QiAi-Beauty1-25-2dc1463dacf946ab90933dd9f555943d.jpg",
  "tags": [
    "Chicken",
    "The Latest",
    "Moroccan",
    "Couscous"
  ],
  "title": "Chicken Couscous Tfaya (Moroccan Couscous With Braised Chicken)",
  "full_text": "Chicken Couscous Tfaya (Moroccan Couscous With Braised Chicken)\nClose\nJump to recipe\nCook\n60 mins\nTotal\n60 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n2\ntablespoons\n(\n30\nml\n)\nolive oil\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n1\nmedium\nonion\n(\n8\nounces\n;\n226\ng\n), diced\n1 1/2\nteaspoons\nground turmeric\n1 1/2\nteaspoons\nground ginger\nLight\npinch\nof\nsaffron\nthreads (optional)\n1 1/2\nteaspoons\nDiamond Crystal kosher salt\n, plus more to taste; for table salt, use half as much by volume\n1/4\nteaspoon\nground black pepper\n2 1/2\npounds\n(\n1.13\nKg\n)\nskin-in on, bone-in chicken thighs\n(alternatively, use bone-in skin on chicken pieces of choice)\n1 3/4\ncup\n(\n420\nml\n)\nhomemade chicken\nor\nvegetable stock\nor store-bought low sodium chicken or vegetable broth\n1\nsmall\nbunch\ncilantro\n, stems and leave separated, stems tied into a bundle with kitchen twine and leaves reserved for garnish\nFor the T’faya Sauce:\n2\ntablespoons\n(\n30\nml\n)\nolive oil\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\n2\npounds\nwhite or\nyellow onions\n(\n907\ng\n), thinly sliced\n1\ncup\nraisins\n(\n7\nounces\n;\n200\ng\n), soaked in hot water for 10 minutes, then drained (see notes)\n1/2\ncup\n(\n120\nml\n)\nhomemade\nchicken\nor\nvegetable stock\nor store-bought low sodium chicken or vegetable broth\n3\ntablespoons\n(\n45\nml\n)\nhoney\n3/4\nteaspoon\nground cinnamon\n1\nteaspoon\nDiamond Crystal kosher salt\n, plus more to taste; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\nFor Serving:\n1\nrecipe for cooked\nSimple Fluffy Couscous\n3/4\ncup\ntoasted sliced\nalmonds\n(\n2.5\nounces\n;\n75\ng\n)\nReserved\ncilantro leaves\nfrom above\nDirections\nFor the Chicken:\nIn a large heavy-bottomed pot or large Dutch oven, heat oil and butter over medium heat until butter is melted and shimmering. Add onions, turmeric, ginger, saffron (if using), salt, and pepper and cook, stirring occasionally, until softened and mixture is fragrant, 3 to 5 minutes.\nSerious Eats / Qi Ai\nAdd chicken and mix to combine with onions and spices, then add stock or broth and cilantro stem bundle.\nSerious Eats / Qi Ai\nIncrease heat to medium-high and bring to a boil, then cover, reduce heat to low, and simmer until chicken registers 175 to 185℉ on an instant-read, about 40 to 45 minutes. Discard cilantro bundle and season to taste with salt and pepper.\nSerious Eats / Qi Ai\nFor the T’faya Sauce:\nOnce chicken is simmering on low, in a large skillet, heat oil and butter over medium-low heat until butter is melted and shimmering. Add sliced onions, cover, and cook, stirring occasionally, until onions are soft and translucent, 15 to 25 minutes. Add drained raisins, stock, honey, cinnamon, salt, and pepper and simmer, uncovered, stirring frequently, until most of liquid has evaporated and the onions are golden brown and jammy, 15 to 20 minutes. Season to taste with salt and pepper.\nSerious Eats / Qi Ai\nSerious Eats / Qi Ai\nFor Serving:\nPlace warm cooked couscous on a large serving platter or individual plates, top with chicken and some of the broth, and spoon a generous serving of t’faya sauce over the top. Garnish with toasted sliced almonds and reserved cilantro leaves. Transfer any leftover broth to individual serving bowls and serve on the side.\nSerious Eats / Qi Ai\nSpecial Equipment\nLarge heavy-bottomed pot or large Dutch oven, large skillet, fine-mesh strainer\nNotes\nTo soak the raisin, in a heat safe bowl, add raisins and pour boiling water over them until covered. Let sit for 10 minutes, then drain in a fine-mesh strainer.\nMake-Ahead and Storage\nLeftovers can be refrigerated together in an airtight container for up to 4 days. To reheat, transfer to a baking dish and warm in a 350℉ (175℃) oven until warm.\nChicken\nThe Latest\nMoroccan\nCouscous"
}