{
  "url": "https://www.seriouseats.com/chicken-meatball-filling-for-stuffed-matzo-balls-recipe",
  "image_url": "https://www.seriouseats.com/thmb/X0-x0W3j3TQ9NiY6gVTlK4uBMPk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__11__20131118-stuffed-matzo-balls-innards-photo-caff39f82421454b9f73524b960f86fd.jpg",
  "tags": [
    "Soups",
    "Dairy-free Mains",
    "Passover",
    "Hanukkah"
  ],
  "title": "Chicken-Stuffed Matzo Balls Recipe",
  "full_text": "Chicken-Stuffed Matzo Balls Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n85 mins\nActive\n60 mins\nTotal\n105 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\nml\n)\nchicken fat\n,\nunsalted butter\n, or\nvegetable oil\n(see note)\n1\nmedium\nonion\n, finely chopped (about\n1\ncup\n)\n1 3/4\nteaspoons\n(\n7\ng\n)\nkosher salt\n, plus more to taste, divided\n1\npound\n(\n450\ng\n)\nground chicken\n(preferably dark meat; see note)\n1/2\ncup\nfresh dill\n(\n1/2\nounce\n;\n14\ng\n), finely chopped\n3\neggs\n1/2\nteaspoon\nfreshly\nground black pepper\n1/4 to 1/2\ncup\n(\n29 to 58\ng\n)\nmatzo meal\n, as needed\n7\ncups\nmatzo meal batter\n(see note)\n3\nquarts\n(\n2.8\nL\n)\nchicken soup\n, for serving\nDirections\nMelt chicken fat, butter, or oil in a medium skillet over medium-low heat. Stir in onion and 1/2 teaspoon salt. Cook, stirring frequently, until golden brown with darker browned bits, 20 to 30 minutes, reducing heat as necessary and adding a teaspoon of water if onions start to burn. Set aside to cool.\nIn a large mixing bowl, combine chicken, browned onions, dill, eggs, pepper, and 1 teaspoon salt with your hands until mixture comes together. Add 1/4 cup (29g) matzo meal and mix with hands to combine. Continue adding matzo in tablespoon-size increments until you can form neat rolled balls in your hands. Do not overwork mixture.\nPinch off a small portion of meatball mixture, press into a flat disk, and microwave until cooked, about 10 seconds. Taste for seasoning and add salt and pepper as needed.\nWet your hands with cold water and roll meatballs into 1 1/4–inch balls. If cooking meatballs plain, simmer in chicken soup until fully cooked, about 10 minutes.\nIf wrapping meatballs in matzo balls, wet your hands with cold water and pinch off a Ping-Pong-ball-sized portion of matzo ball batter. Press batter into a flat pancake and place an uncooked chicken meatball inside. Pinch up the edges and roll matzo ball in your hands until chicken is fully contained inside matzo ball batter.\nCook matzo balls at a simmer in a large pot of salted water or\nchicken stock\nuntil matzo balls and chicken are fully cooked through, 30 to 40 minutes. Serve with chicken soup and garnish with fresh dill.\nNotes\nDark-meat chicken will make for a more\nflavorful and juicy meatball\n, and cooking your onions in schmaltz (rendered chicken fat) will make them even more chicken-y. If you don't have access to schmaltz, butter or vegetable oil will do fine.\nIf you're stuffing your meatballs into matzo balls, you can use whatever matzo ball recipe you like; mine is a slight spin on the\nManischewitz\nrecipe, using schmaltz or butter in place of vegetable oil and\nchicken stock\ninstead of water. The matzo ball batter should be slightly tacky and thick enough to handle; you may need to add more matzo meal than the recipe calls for.\nThe matzo ball recipe above makes 2 cups of batter. For this amount of meatball mixture, you'll need about 7 cups, or 3 1/2 batches, of batter.\nThis Recipe Appears In\nDeep-Fried, Meatball-Stuffed, and More: Three Ways to Play With Your Matzo Balls\nSoups\nDairy-free Mains\nPassover\nHanukkah",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-stuffed-matzo-balls-recipe.webp?"
}