{
  "url": "https://www.seriouseats.com/chicken-and-wild-rice-soup-recipe-8720577",
  "image_url": "https://www.seriouseats.com/thmb/Acj2PsUF2RmwtETTfn8FF1IyB78=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240826_SEA_Chicken-and-Wild-Rice-Soup_MorganHuntGlaze_Hero_55-eb3753a4bbb34ec68bca91cd6a76fa44.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Chicken",
    "Wild Rice"
  ],
  "title": "Creamy Chicken and Wild Rice Soup",
  "full_text": "Creamy Chicken and Wild Rice Soup\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs 15 mins\nTotal\n2 hrs 30 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken Stock:\n3\npounds\n(1.35Kg) bone-in, skin-on\nchicken thighs\n3\nquarts\n(2.8L)\nwater\n2 medium\ncelery stalks\n(about 2 1/2 ounces;\n70\ng\neach), roughly chopped\n1\nlarge\ncarrot\n(6 ounces; 170g), roughly chopped\n1\nlarge\nleek\n(7 ounces; 198g), washed and rinsed well of grit, white and light green parts halved lengthwise and sliced 1/4-inch thick (about 2 1/2 cups sliced)\n3\nteaspoons\nDiamond Crystal\nkosher salt;\nfor table salt, use half as much by volume\n4\nfresh\nthyme sprigs\nFor the Soup:\n4\ntablespoons\nunsalted butter\n(2 ounces; 56g)\n4\nmedium\ncelery stalks\nwith leaves (about 2 1/2 ounces; 70g each), sliced 1/4-inch thick (about 2 cups sliced), leaves reserved for garnish\n1\nlarge\ncarrot\n(6 ounces; 170g), halved and sliced 1/4-inch thick\n1\nmedium\nfennel bulb\n(8 ounces; 226g), chopped into 1/2 inch pieces\n3\nmedium\ncloves garlic\n(15g), minced\n2\nteaspoons\nchopped\nfresh thyme leaves\n2\nteaspoons\nDiamond Crystal\nkosher salt;\nfor table salt, use half as much by volume\n3/4\nteaspoon\nfreshly\nground black pepper\n1/4 cup\nall-purpose flour\n(about\n1\nounce\n; 30g)\n1 cup uncooked\nwild rice\n(abou\nt 6 1/4\nounces\n; 175g)\n1/8\nteaspoon\nbaking soda,\noptional\n1/2\ncup\n(120ml)\nheavy cream\n1\nteaspoon\ngrated\nlemon zest\nplus 2 tablespoons (30ml) lemon juice from 1 lemon\nDirections\nFor the Chicken Stock:\nIn a large soup pot or Dutch oven, combine chicken, water, celery, carrots, leek, salt, and thyme sprigs. Bring to a simmer over medium-high heat. Reduce heat to medium and simmer, adjusting head as needed to maintain gentle simmer, until chicken is cooked through and tender, about 40 minutes.\nUsing tongs, carefully remove chicken from pot and transfer to a medium bowl. Let chicken sit until cool enough to handle, about 5 minutes. Discard skin and finely shred meat. Set shredded meat aside and return bones to pot with stock. Continue to simmer until stock is flavorful and rich, 30 to 40 minutes.\nUsing a fine-mesh strainer, strain stock into a heatproof bowl or large measuring cup. Wipe pot dry. Discard solids and use a ladle or large spoon to skim off any fat on surface of the stock. Set aside.\nSerious Eats / Morgan Hunt Glaze\nFor the Soup:\nIn the now-empty large soup pot or Dutch oven, melt butter over medium heat. Add celery, carrots, fennel, salt, and pepper and cook, stirring often, until vegetables are softened, about 8 minutes. Stir in garlic and thyme and cook until fragrant, about 1 minute.\nSerious Eats / Morgan Hunt Glaze\nSprinkle flour over vegetables; cook, stirring frequently, until evenly coated and flour begins to stick to bottom, about 2 minutes.\nSerious Eats / Morgan Hunt Glaze\nSlowly pour in the reserved chicken stock, whisking until the flour is fully incorporated. Stir in the rice and baking soda, if using, and bring to a boil over medium-high heat. Reduce heat to medium-low, and simmer until flavors meld and wild rice has split open and is tender but still retains a bit of chew, 40 to 50 minutes. Return shredded chicken to soup and simmer until heated through, about 2 minutes. Remove from heat, and stir in heavy cream, lemon zest, and lemon juice.\nSerious Eats / Morgan Hunt Glaze\nDivide soup evenly among serving bowls and top with reserved celery leaves.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nLarge soup pot or Dutch oven, tongs, fine-mesh strainer\nMake-Ahead and Storage\nThe stock can be made, strained, and refrigerated in an airtight container for up to 5 days, or frozen for up to 3 months. Shred the chicken and refrigerate in an airtight container for up to 4 days.\nAllow soup to cool to room temperature before storing in an airtight container. The soup can be refrigerated in an airtight container for up to 3 days. To reheat, microwave or simmer in a saucepan until warmed through. Avoid bringing to a rapid boil to ensure the cream does not separate.\nThe soup can be frozen in an airtight container for up to 3 months. To defrost, thaw soup in fridge overnight before reheating in the microwave or on the stove until warmed through.\nSoups\nThe Latest\nChicken\nWild Rice",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/creamy-chicken-and-wild-rice-soup.webp?"
}