{
  "url": "https://www.seriouseats.com/chickpea-stew-bacon-recipe",
  "image_url": "https://www.seriouseats.com/thmb/2QUFFTGrqo-KUbTghWV11-X4yLE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__05__20200508-chickpea-anchovies-bacon-broccoli-rabe-stew-daniel-gritzer-1-6e392a9c4cf84827a7752058a99cfded.jpg",
  "tags": [
    "Braised & Stewed Beans",
    "Chickpeas",
    "Bacon",
    "Broccoli Rabe",
    "Vegetable Mains"
  ],
  "title": "Chickpea Stew With Bacon and Broccoli Rabe Recipe",
  "full_text": "Chickpea Stew With Bacon and Broccoli Rabe Recipe\nClose\nJump to recipe\nPrep\n2 mins\nCook\n35 mins\nActive\n35 mins\nTotal\n37 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\n(\n115\ng\n)\nthick-cut bacon\n(about\n4\nrashers\n), cut crosswise into 1/4-inch strips\n1\nmedium\nred or yellow onion\n(\n8\n-\nounce\n;\n225\ng\n), cut into 1/4-inch dice\n4\nmedium\ncloves garlic\n, thinly sliced\n2\nteaspoons\nminced\nfresh rosemary\n1\nounce\n(\n30\ng\n)\noil-packed anchovy fillets\n(about\n10\nfillets\n)\n5\ncups\ncooked chickpeas\n(\n2\npounds\n;\n1\nkg\n) plus\n2\ncups\n(\n475\nml\n)\nchickpea cooking liquid\n(see note)\n1\nbunch\n(about\n1\npound\n;\n450\ng\n)\nbroccoli rabe\n, stem ends trimmed and cut into 1-inch lengths\nKosher salt\nand\nfreshly ground black pepper\nExtra-virgin olive oil\n, for drizzling\nCalabrian chile paste\nor other chile paste, for serving (optional)\nDirections\nIn a medium pot or Dutch oven, cook bacon over medium heat, stirring often, until fat has mostly rendered and bacon is lightly browned, about 6 minutes. Add onion and garlic and cook, stirring often, until it is soft and lightly golden, about 6 minutes longer. Stir in rosemary and cook for 1 minute.\nAdd anchovies and cook, stirring constantly, until anchovies are mostly dissolved, about 30 seconds. Add chickpeas and their cooking liquid along with broccoli rabe and bring to a simmer. Reduce heat to maintain simmer and cook, stirring frequently, until broccoli rabe is very tender and liquid has thickened to a saucy consistency, 10 to 15 minutes; if chickpeas become too dry, add additional bean-cooking liquid or water to loosen slightly. Season with salt and pepper.\nSpoon chickpeas into bowls with their sauce, lightly drizzle with olive oil, and serve with chili paste, if desired.\nNotes\n5 cups of cooked chickpeas comes from roughly 1 pound dried (this will vary depending on the brand of chickpea you buy; in our testing some 1-pound bags of chickpeas have yielded as much as 7 cups beans). You can use canned chickpeas in this recipe as well; they won't be quite as delicious as ones cooked from dried, but this bean stew has enough flavor to more than make up for it. If you do, you'll want to use three or four 15-ounce cans of chickpeas along with the bean liquid in the can plus as much water as necessary to make 2 cups in total; three 15-ounce cans will contribute slightly less chickpeas to the stew than the 5 cups called for in the recipe, while four cans will add about 1 cup more chickpeas—it won't make a big difference, though you may need to add more liquid for a four-can batch.\nSpecial Equipment\nMedium (roughly 4 or 5 quart) pot or\nDutch oven\nMake-Ahead and Storage\nThe stew an be refrigerated in an airtight container for up to 5 days. When reheating, you may need to add a small amount of water to thin it to your desired consistency.\nBraised & Stewed Beans\nChickpeas\nBacon\nBroccoli Rabe\nVegetable Mains"
}