{
  "url": "https://www.seriouseats.com/chicken-tagine-recipe-7109799",
  "image_url": null,
  "tags": [
    "Moroccan",
    "The Latest",
    "Chicken",
    "Braised & Stewed Chicken",
    "North African"
  ],
  "title": "Chicken M’qualli Tagine With Olives and Preserved Lemon",
  "full_text": "Chicken M’qualli Tagine With Olives and Preserved Lemon\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 30 mins\nMarinating Time\n2 hrs\nTotal\n4 hrs 40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinade:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n3\ntablespoons\n(\n45\nml\n)\nfresh lemon juice\n(from\n1\nlemon\n)\n1\nteaspoon\nground turmeric\n1\nteaspoon\nground ginger\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n4\nmedium\nchicken leg quarters\n(about\n12\nounces\n;\n340\ng\neach)\nFor the Tagine:\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n4\nlarge\nyellow onions\n(\n10\nounces\n;\n280\ng\neach), sliced\n1/4\ncup\n(\n20\ng\n) packed finely chopped\nfresh cilantro\n4\nmedium\ngarlic cloves\n(\n25\ng\n), peeled and grated or minced\n1\nteaspoon\nground turmeric\n1\nteaspoon\nground ginger\nSmall\npinch\nsaffron threads\n, if desired\nKosher salt\nand freshly ground black pepper\n2/3\ncup\n(\n160\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n1/2\ncup\nfinely chopped preserved lemon\n(flesh and rind), finely chopped (\n3.5\nounces\n;\n100\ng\n)\n3/4\ncup\nred-brown pitted olives\n, such as Kalamata (\n4.2\nounces\n;\n120\ng\n)\nCrusty bread or\ncouscous\n, to serve\nDirections\nFor the Marinade:\nIn a large bowl, whisk together olive oil, lemon juice, ground turmeric, ground ginger, and salt. Add chicken leg quarters to marinade, and, using your hands or a spatula, turn to evenly coat chicken. Cover with plastic wrap and place in the fridge for at least 2 hours or up to overnight.\nFor the Tagine:\nIn a 5.5-quart pot or Dutch Oven, heat olive oil over medium-low. Stir in sliced onions, cover, and cook, stirring occasionally, until they start to soften, 10 to 15 minutes.\nAdd cilantro, garlic, ground turmeric, ground ginger, and saffron (if using) to pot. Season with salt and pepper and cook, stirring occasionally, until onions are very soft, about 5 minutes. Remove chicken legs from marinade and add to the pot in a single layer, nestling them into the onion mixture. Pour in stock and bring to a boil over high heat. Cover pot, reduce heat to low, and simmer gently until the chicken is fully cooked and registers 165ºF (74ºC) in the thickest part, 55 to 65 minutes.\nUsing tongs, carefully remove chicken from the pot to a plate. Loosely cover with foil to keep warm and set aside.\nStir preserved lemons and olives into the sauce and continue to simmer, stirring occasionally, until all the excess liquid has evaporated and the sauce has reduced to a thick, jammy consistency and the oil separates from the onions and pools on the surface, 45 to 55 minutes. (When onions and oil separate and thicken into a jammy sauce, this is referred to as “deghmira” in Morocco.) Taste sauce and adjust seasoning, adding more salt if necessary.\nTo serve, return chicken legs to the pot to warm through in the sauce, about 5 minutes. Serve immediately with crusty bread or warm couscous.\nSerious Eats / Jen Causey\nSpecial Equipment\n5.5 quart pot or Dutch oven\nMake-Ahead and Storage\nThe dish can be made 3 days in advance and kept refrigerated.\nMoroccans often reheat the chicken and the sauce separately: gently warm up the sauce in a saucepan on the stove and reheat the chicken in the oven with the broiler turned on to allow the chicken skin to crisp up.\nMoroccan\nThe Latest\nChicken\nBraised & Stewed Chicken\nNorth African"
}