{
  "url": "https://www.seriouseats.com/chicken-hash-recipe",
  "image_url": "https://www.seriouseats.com/thmb/J4W_ZSmeJnxTI1p6Lvmrw39MMMI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__03__20130313-244129-chicken-hash-edit-a48124305ab947d6a92d3ab0c1494a0c.jpg",
  "tags": [
    "Chicken"
  ],
  "title": "Chicken Hash",
  "full_text": "Chicken Hash\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n45 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nskinless, boneless chicken breast\nor\nthighs\n, trimmed of visible fat\n2 1/2\ncups\nhomemade or store-bought\nlow-sodium chicken stock\n4\nYukon Gold potatoes\n(\n18 to 22\nounces\n), peeled, cut into 1/2-inch cubes\n5\ntablespoons\nolive oil\n, divided\n1\nlarge\nonion\n, finely chopped (1 cup)\nKosher salt\nand freshly ground black pepper\n3\nmedium\ncloves garlic\n, minced (about 3 teaspoons)\n2\ntablespoons\nza'atar\n1/2\nteaspoon\npaprika\n1/2\nteaspoon\nturmeric\n1\nteaspoon\nharissa\n, plus extra to serve on side\n1/3\ncup chopped\nfresh parsley\n4\nlarge\neggs\nDirections\nIf using chicken breasts, slice breasts on bias so they are equal thickness. Heat 2 cups broth over medium heat in medium saucepan to simmer. Add chicken and gently simmer until cooked through, about 5 minutes. Transfer to plate. When cool, cut into 1/2-inch cubes.\nAdd potatoes to broth and add water (if necessary) to just cover. Bring to boil over medium high heat. Reduce heat to medium and simmer until potatoes are easily pierced with knife, about 10 minutes. Drain potatoes and reserve (discard any remaining potato-cooking liquid).\nIn large non-stick skillet, heat 2 tablespoons oil over medium heat to shimmering. Add onion and 1/2 teaspoon salt. Cook, stirring, until onions have softened and are beginning to turn golden, 6 to 8 minutes. Add 1/2 teaspoon ground black pepper, garlic, za'atar, paprika, and turmeric, and cook until fragrant, about 30 seconds.\nAdd 2 tablespoon oil to pan. Stir in potatoes. Cook, stirring, until potatoes have browned, about 8 minutes. Stir in chicken, harissa, and remaining 1/2 cup broth. Cook, stirring, until broth has evaporated. Season to taste and stir in parsley.\nIn separate pan, heat remaining tablespoon oil to shimmering, and fry eggs. Serve with hash with extra harissa on the side.\nSpecial Equipment\n12-inch non-stick skillet\nNotes\nThis dish is a terrific way to use up leftover chicken. Find za'atar and harissa in your local Mediterranean grocery store or make your own.\nRead More\nCrispy Potato, Chorizo, and Green Chili Hash With Avocado and Eggs\nEasy Sweet Potato and Pepper Hash With Eggs\nCrispy Kale, Brussels Sprouts, and Potato Hash\nSpicy Potato, Bok Choy, and Shallot Hash\nCrispy Pork Shoulder Hash With Charred Asparagus and Serrano Chili\nChicken",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-hash.webp?"
}