{
  "url": "https://www.seriouseats.com/chicken-with-bulgur-pilaf-recipe-11687195",
  "image_url": "https://www.seriouseats.com/thmb/Mqi34xSmP0VUwNBAVOwA6JCHFoQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250220-OnePan5IngedientEasyChickenwithWarmBulgarPilaf-TwoBites-Beauty1-47-56b17476faff4cb5bce29887c20efbfc.jpg",
  "tags": [
    "Chicken Mains",
    "The Latest",
    "Quick Dinners"
  ],
  "title": "Chicken With Warm Bulgur Pilaf and Tomatoes",
  "full_text": "Chicken With Warm Bulgur Pilaf and Tomatoes\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n4\n(6- to 8-ounce)\nboneless skinless chicken breasts\n, pounded to about 3/4 inch thick\n5\ntablespoons\n(\n75\nml\n)\nextra-virgin olive oil\n, divided\n1 3/4 teaspoon Diamond Crystal Kosher salt; for table salt use half as much by volume\nFreshly ground\nblack pepper\n10\nounces\ncherry tomatoes\n, halved\n3\nscallions\n, thinly sliced, whites and greens separated\n1\ncup\nfine\nbulgur\n(\n6\nounces\n;\n170\ng\n) (see notes)\n4\nounces\nfeta cheese\n, crumbled (\n1\ncup\n)\n1/2\ncup\npitted kalamata olives, roughly chopped\nLemon wedges\nfor serving, optional\nDirections\nIf you don't have time to dry brine:\nPat chicken dry with paper towels. Sprinkle chicken with 1 1/2 teaspoons salt and 1/4 teaspoon pepper.\nIf you have time to dry brine:\nSet a wire rack over a rimmed baking sheet and arrange chicken breasts on it. Sprinkle all over with 1 1/2 teaspoons salt and 1/4 teaspoon pepper, then refrigerate, uncovered, for at least 30 minutes or up to 12 hours.\nSerious Eats / Two Bits\nBrush chicken breasts all over with 2 tablespoons oil. In a 12-inch nonstick, carbon-steel, or cast iron skillet place prepared breasts, arranging so narrow ends are opposite wider ends. Place skillet over medium-high heat and cook for 3 minutes. Flip breasts and cook on second side until lightly browned on bottom, 3 minutes.\nSerious Eats / Two Bits\nFlip breasts; reduce heat to medium; and continue to cook, flipping every 2 minutes, until exterior is well browned and thickest part of chicken registers 155℉ (68℃), 8 to 12 minutes longer. Transfer chicken to platter; let rest while preparing bulgur.\nSerious Eats / Two Bits\nTo now-empty skillet, add remaining 1 tablespoon oil, tomatoes, and scallion whites and cook until tomato skins blister and begin to release their juices and scallion whites are softened, 1 to 2 minutes. Stir in 1 1/2 cups water and bring to a boil, scraping up any browned bits. Stir in bulgur and remaining 3/4 teaspoon salt. Bring to a boil, then cover, remove from heat and let sit for 5 minutes.\nSerious Eats / Two Bits\nFluff bulgur with fork and stir in feta, olives, and remaining 2 tablespoons oil. Season with salt and pepper to taste. Slice chicken and serve with bulgur pilaf. Sprinkle with scallions greens and serve with lemon wedges, if using.\nSerious Eats / Two Bits\nSpecial Equipment\n12-inch nonstick, carbon-steel, or cast iron skillet\nNotes\nMake sure to use finely ground bulgur in this recipe, as medium or coarse bulgur will not cook fully as the recipe is written. Bulgur can be found at most Middle Eastern grocers and many supermarkets.\nMake-Ahead and Storage\nLeftover chicken and bulgur pilaf can be refrigerated separately or together in airtight containers for up to 4 days. Transfer to a baking dish, cover with aluminum foil, and reheat in a 350℉ (175℃) oven until warmed through.\nChicken Mains\nThe Latest\nQuick Dinners"
}