{
  "url": "https://www.seriouseats.com/chicken-pan-sauce-morel-mushroom-recipe",
  "image_url": "https://www.seriouseats.com/thmb/AQNDw7wMim4eHUqfTOicHoxWvJg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__05__20150525-morel-chicken-pan-sauce-5-fd639d29b677482699899b69bb639ba9.jpg",
  "tags": [
    "Chicken Mains",
    "Stovetop Chicken",
    "Chicken Breast",
    "Morel Mushroom",
    "Quick Dinners"
  ],
  "title": "Easy Pan-Roasted Chicken Breasts With Morel Mushroom Pan Sauce",
  "full_text": "Easy Pan-Roasted Chicken Breasts With Morel Mushroom Pan Sauce\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n20 mins\nResting Time\n15 mins\nTotal\n55 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole\nairline chicken breasts\nor\nboneless skin-on chicken breasts\n(\n6 to 8 ounces\neach)\nKosher salt\nand freshly ground black pepper\n1\ntablespoon\ncanola oil\n3/4\ncup\nhomemade\nor store-bought\nlow-sodium chicken stock\n1/4\ncup\ndry white wine\n1 1/2\nteaspoons\npowdered gelatin\n(see note)\n4\nounces\nmorel mushrooms\n,\ncleaned, trimmed, and split in half lengthwise\n1\nsmall\nshallot\n, minced (about\n1\ntablespoon\n)\n2\ntablespoons\nunsalted butter\n1\nteaspoon\nsoy sauce\n2\ntablespoons\nminced\nfresh chives\nDirections\nAdjust oven rack to center position and preheat oven to 450°F (230°C). Pat chicken breasts dry and season generously with salt and pepper. Heat oil in an oven-safe medium stainless steel skillet over high heat until just starting to smoke. Carefully lay chicken breasts into hot skillet skin side down. Cook without moving until skin is deep golden brown and very crisp, about 6 minutes. Carefully flip chicken breasts and transfer skillet to the oven.\nWhile chicken roasts, add stock and wine to a liquid measuring cup and sprinkle gelatin over the top. Set aside.\nSerious Eats / J. Kenji López-Alt\nCook chicken until an instant-read thermometer inserted into the thickest part of the chicken breasts registers 150°F (66°C), about 7 to 12 minutes. Remove skillet from oven and transfer chicken to a cutting board. Set aside to rest while you make the pan sauce.\nPour off all but 1 tablespoon of fat from the skillet and place over high heat. Add mushrooms and cook, stirring and tossing occasionally, until well-browned, about 4 minutes total. Add shallot and cook, stirring, until softened and fragrant, about 30 seconds. Add stock/gelatin mixture and cook, scraping up any browned bits from the bottom of the pan with a wooden spoon. Continue cooking on high heat until sauce is reduced by about two-thirds, 5 to 8 minutes. Stir in butter and soy sauce and cook at a hard boil until emulsified, about 30 seconds. Remove from heat and set aside.\nSerious Eats / J. Kenji López-Alt\nSlice chicken breasts into three pieces on a sharp bias and transfer to individual serving plates. Taste sauce and season with salt and pepper. Stir in chives. Spoon sauce over the chicken and serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nOven-safe\n10-inch skillet\nNotes\nIf morels are unavailable, you can substitute any fresh mushroom cut into 1/4-inch slices such as shiitake, cremini, oyster, matsutake, or button. If you are using homemade chicken stock with plenty of gelatin in it (it will gel when cold), you can omit the powdered gelatin in this recipe.\nRead More\nEasy Pan-Roasted Chicken Breasts With Lemon and Rosemary Pan Sauce Recipe\nPan-Roasted Chicken With Vegetables and Dijon Jus Recipe\nSautéed Morel Mushrooms Recipe\nThe Comprehensive Mushroom Shopping Guide\nChicken Mains\nStovetop Chicken\nChicken Breast\nMorel Mushroom\nQuick Dinners",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-pan-roasted-chicken-breasts-with-morel-mushroom-pan-sauce.webp?"
}