{
  "url": "https://www.seriouseats.com/chicken-vindaloo-burrito-recipe",
  "image_url": "https://www.seriouseats.com/thmb/EC62D5beqFIbKnQacTOZfKQa1FA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__08__20150828-Chicken-Vindaloo-Burritos-Close-Up-Morgan-Eisenberg-fd6169ed48a941f38a79f2bf5e866d60.jpg",
  "tags": [
    "Chicken Mains",
    "Indian",
    "Stovetop Chicken",
    "Chicken Breast"
  ],
  "title": "Chicken Vindaloo Burritos Recipe",
  "full_text": "Chicken Vindaloo Burritos Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n60 mins\nResting and Marinating Time\n60 mins\nTotal\n2 hrs 15 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken Vindaloo:\n1/3\ncup\ndistilled white vinegar\n5\ndried red chiles\n8\nmedium\ncloves garlic\n1\n(\n1-inch) piece\npeeled\nfresh ginger\n1 1/2\npounds\nboneless, skinless chicken breasts\n1\nteaspoon\ngaram masala\n1\nteaspoon\nground cumin\n1\nteaspoon\nhot\npaprika\n1/2\nteaspoon\nground turmeric\n1/2\nteaspoon\nground coriander seed\n1/2\nteaspoon\nfreshly\nground black pepper\n3\ntablespoons\nvegetable oil\n1\nlarge\nonion\n, diced\n2\ncups\ndiced yellow potatoes\n(about\n3\nmedium\npotatoes\n)\n1\ntablespoon\ntomato paste\n1/2\ncup\nhomemade chicken stock\nor store-bought\nlow-sodium chicken broth\n1/2\nteaspoon\ncornstarch\n, if necessary\nKosher salt\nFor the Rice:\n1\ncup\nuncooked basmati rice\n1/4\nteaspoon\nturmeric\n1\ntablespoon\nfresh juice\nfrom\n1\nwhole\nlemon\nKosher salt\nFor the Burritos:\n6\nlarge\nflour tortillas\n1\nlarge\ntomato\n, diced\n1\nbunch\nfresh cilantro\n, leaves and tender stems only\n6\nounces\npaneer cheese\n, crumbled\nStore-bought\nmango chutney\n, to serve\nDirections\nFor the Chicken Vindaloo:\nIn a small bowl, combine vinegar, chiles, garlic, and ginger and let stand for 30 minutes. Transfer to a blender and blend until smooth. Scrape vinegar mixture into a large zipper-lock bag, add chicken, and toss to coat. Press out excess air and seal bag. Refrigerate chicken for at least 30 minutes.\nMeanwhile, in a small bowl, mix together garam masala, cumin, paprika, turmeric, coriander, and black pepper.\nIn a Dutch oven, heat oil over medium-high heat until shimmering. Add onion and cook, stirring, until golden, about 8 minutes; regulate heat to prevent excessive browning or burning. Add marinated chicken and potatoes and cook, turning occasionally, until browned all over, about 5 minutes. Stir in spice mixture and tomato paste and cook for 1 minute. Stir in chicken broth and bring to a boil. Reduce heat to medium-low, cover, and simmer until chicken is cooked through and potatoes are tender, about 15 minutes. If sauce seems too thin, mix cornstarch with 1/2 teaspoon water to make a slurry, then stir into chicken; simmer until thickened, then remove from heat. Season with salt.\nMeanwhile, for the Rice:\nIn a medium saucepan, combine rice, 2 cups water, and turmeric. Leaving saucepan uncovered, bring to a boil and stir. Reduce heat to a simmer, cover, and cook for 12 minutes. Remove from heat. Mix in lemon juice and fluff rice with a fork. Season with salt.\nFor the Burritos:\nWorking one at a time, set a tortilla on a work surface. Place 1/2 cup rice on top in a vertical line down the center, leaving a 2-inch border above and below the line of rice. Next, spoon 1 cup chicken vindaloo over the rice, slightly overlapping it. Top with tomato, cilantro, and crumbled paneer. Tightly roll the burrito by folding in the top and bottom sides, then rolling left and right flaps. Repeat with remaining burritos.\nHeat a cast iron grill pan or skillet over high heat until hot. Working one at a time, brown burritos in skillet, turning once to brown both sides.\nServe burritos warm with mango chutney or freeze in airtight wrapping. To reheat, unwrap frozen burrito, then wrap in a damp paper towel and microwave until warmed through, about 3 minutes.\nSpecial Equipment\nBlender, cast iron grill pan or skillet\nThis Recipe Appears In\nThe Burrito Goes Global With Chicken Vindaloo\nChicken Mains\nIndian\nStovetop Chicken\nChicken Breast",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-vindaloo-burritos-recipe.webp?"
}