{
  "url": "https://www.seriouseats.com/chicken-salad-miso-corn-avocado-recipe",
  "image_url": "https://www.seriouseats.com/thmb/fV62BWA4pXc5hRMiirfO4z-1wUU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230418-SEA-Chicken-Salad-With-Avocado-Corn-and-Miso-Dressing-Hero-1-00410-VictorProtasio-c55018e5fd5d4df68663223e99acda0c.jpg",
  "tags": [
    "Japanese",
    "Sous Vide",
    "Chicken Breast",
    "Avocado",
    "Corn"
  ],
  "title": "Chicken Salad With Avocado, Corn, and Miso Dressing",
  "full_text": "Chicken Salad With Avocado, Corn, and Miso Dressing\nClose\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nActive\n20 mins\nChilling Time\n15 mins\nTotal\n90 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4\npounds\nwhole bone-in, skin-on split chicken breast halves\n(\n2 to 3\nbreast\nhalves\n)\n1 1/2\nteaspoon\n(\n4.5\ng\n)\nkosher salt\n, plus more as needed; for table salt, use half as much by volume\nFreshly ground black pepper\n1\nmedium\n(\n3\nounces\n;\n80\ng\n)\nlemon\n4\nwhole\nscallions\n(\n3\nounces\n;\n80\ng\n),\n2\nroughly\nchopped\n(\n1/3\ncup\n),\n2\nthinly\nsliced\n(\n1/3\ncup\n), plus more for garnish\n1\n(1-inch) knob\nginger\n(\n1/2\nounce\n;\n15\ng\n), thinly sliced\n1\ntablespoon\nwhite\nor\n2\nteaspoons\nyellow\nmiso paste\n1\ntablespoon\njuice\nfrom one lemon\n2\nteaspoons\nmirin\n1/2\nteaspoon\ndried mustard\n, preferably Japanese\n1\ntablespoon\nextra-virgin olive oil\n1\nsmall\nclove garlic\n, minced (about\n1/2\nteaspoon\n)\n1/2\nteaspoon\nshichimi togarashi\n, plus more for garnish\n3/4\ncup\nfresh corn kernels cut\nfrom\n2\nears\nsweet corn\n1\n(\n6 ounces; 170 g\n) whole\navocado\ncut into 1/2-inch dice (about\n3/4\ncup\n)\nDirections\nSeason chicken generously with salt and pepper. Slice 1 lemon into 1/8- to 1/4-inch slices. Place chicken in zipper-lock bags or vacuum bags and add whole roughly chopped scallions and ginger. Remove air from zipper-lock bags by closing the bags, leaving the last inch of the top unsealed. Slowly lower into a pot of water, sealing the bag completely just before it fully submerges. If using a vacuum bag, seal according to manufacturer instructions.\nSerious Eats / Victor Protasio\nIf Cooking in a Sous-Vide Precision Cooker:\nPreheat a sous-vide cooker to 155°F. Add chicken and cook for at least 1 hour and up to 4. Transfer to an ice bath and let chill for 15 minutes.\nSerious Eats / Victor Protasio\nIf Cooking in a Cooler:\nHeat 2 quarts of water in a large, heavy-bottomed saucepot or Dutch oven over medium-high heat until it registers 160°F on an instant-read thermometer. Transfer to a small cooler, add chicken, and seal cooler. Cook for at least 1 hour and up to 4, topping up with boiling water as necessary to maintain temperature of 155°F. Transfer to an ice bath and let chill for 15 minutes.\nCombine miso, lemon juice, mirin, mustard, olive oil, garlic, and togarashi in a large bowl and whisk until homogenous.\nSerious Eats / Victor Protasio\nPlace corn in a microwave-safe bowl and microwave on high power until cooked through and just starting to brown, about 1 minute. Alternatively, cook in a non-stick skillet with 1 teaspoon vegetable oil over medium-high heat until just starting to brown, about 4 minutes. Add to bowl with dressing.\nSerious Eats / Victor Protasio\nWhen chicken is cooked, remove from bags and discard scallions and ginger. Remove skin and bones from chicken and discard. Cut meat into 1/2-inch cubes and add to bowl with dressing. Add avocado. Add sliced scallions. Toss chicken to coat in dressing and season with additional salt and pepper to taste. Serve immediately, garnish with scallions and togarashi.\nSerious Eats / Victor Protasio\nSpecial Equipment\nSous vide precision cooker\nor a small beer cooler\nNotes\nShichimi togarashi\nis a Japanese seven spice blend that can be found in any Japanese supermarket. If unavailable, replace with a small pinch of cayenne pepper and a 1/4 teaspoon lemon zest.\nRead More\nThe Food Lab's Complete Guide to Sous Vide Chicken Breast\nJuicy and Tender Poached Chicken With Watercress and Miso Dressing\nFoolproof Tender Poached Chicken\nJapanese\nSous Vide\nChicken Breast\nAvocado\nCorn"
}