{
  "url": "https://www.seriouseats.com/chicken-lentil-stew-tomatoes-onions",
  "image_url": "https://www.seriouseats.com/thmb/VZd9mRRdFB00Du9dTMQtPa1LnzA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__04__20200429-Lentils-Chicken-daniel-gritzer-6d0fa2a3416243f68975f4c008985bb9.jpg",
  "tags": [
    "Middle Eastern",
    "Braised & Stewed Chicken",
    "Lentils",
    "Onions",
    "Tomato"
  ],
  "title": "Chicken and Lentil Stew With Tomatoes and Onions Recipe",
  "full_text": "Chicken and Lentil Stew With Tomatoes and Onions Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 20 mins\nActive\n2 hrs\nTotal\n2 hrs 30 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n3 1/2-pound\n(\n1.6\nkg\n)\nchicken\n1\ntablespoon\n(\n10\ng\n)\nkosher salt\n, plus more for seasoning\n1\ncup\n(\n240\nml\n)\nextra-virgin olive oil\n, divided, plus more for drizzling\n4\nmedium cloves\ngarlic\n, minced\nOne\n1-inch knob\nfresh ginger\n, peeled and minced\n1\ntablespoon\nground coriander\n2\nteaspoons\nground cumin\n1\nteaspoon\nground turmeric\n1\nteaspoon\npaprika\n1\nteaspoon\nfreshly\nground black pepper\nLarge\npinch\nred pepper flakes\n1 1/2\npounds\n(\n680\ng\n)\nFrench green\n(Le Puy), or\nyellow lentils\n1\nbay leaf\n2\nlarge (10-ounce; 280 g)\nyellow onions\n, sliced 1/2-inch-thick\n1\npound\n(\n450\ng\n)\nplum tomatoes\n, cut into 1-inch pieces\n2\ntablespoons\nminced fresh dill\nor\ncilantro\nDirections\nIn large pot or Dutch oven, combine chicken with enough water to cover. Add 1 tablespoon (10g) salt and bring to just under a simmer roughly 180°F (80°C) on an instant-read thermometer. Cook, maintaining a sub-simmer as best you can, until chicken registers 160°F (70°C) deep in the thigh, about 45 minutes.\nCarefully lift chicken from poaching liquid, allowing it to drain back into pot, then transfer to a work surface and allow to cool. Reserve poaching liquid. Clean pot or Dutch oven.\nIn the same pot or Dutch oven, combine 1/2 cup (120ml) oil with garlic and ginger and set over medium heat. Cook, stirring often, until garlic and ginger begin to gently sizzle and are just beginning to turn lightly golden, about 2 minutes. Reduce heat to medium-low and add coriander, cumin, turmeric, paprika, black pepper, and pepper flakes and continue to cook, stirring frequently, until spices are lightly toasted and fragrant, 2 to 3 minutes longer.\nStir in lentils, then add enough reserved poaching broth to just cover lentils. Add bay leaf. Increase heat to medium-high and bring to a simmer, then adjust heat to maintain simmer. Cook, stirring occasionally and adding more poaching liquid to keep lentils just covered throughout, until lentils are very tender and just beginning to break down, about 1 hour; use additional water as needed if you run out of poaching liquid before lentils have finished cooking.\nWhile lentils are cooking, remove skin from poached chicken; if desired, finely mince chicken skin and add it to lentils (it will meld into lentils during cooking and enrich the stew, but you can omit if desired). Pull meat from chicken bones and shred; discard bones.\nWhen lentils are tender and beginning to break down, add shredded chicken and continue to cook, stirring often to prevent sticking and adding poaching liquid or water little by little as needed to keep lentils from becoming overly thick and sludgy, until some of the lentils have begun to break down and thicken the stew, about 15 minutes longer. Discard bay leaf. Season with salt and keep warm.\nMeanwhile, in a large 12-inch stainless steel or cast iron skillet, heat remaining 1/2 cup (120ml) oil over high heat until very lightly smoking. Add onions, season with salt, and cook, stirring often, until deeply browned in spots and beginning to soften, about 15 minutes; lower heat as needed to prevent burning. Add tomatoes and cook, stirring frequently, until tomatoes begin to break down, about 7 minutes; reduce heat even more as needed to prevent burning. Remove from heat, stir in dill or cilantro, and season with salt to taste.\nLadle lentils into individual serving bowls and top with onion-tomato mixture. Drizzle lightly with olive oil, and serve.\nSpecial Equipment\nLarge pot or\nDutch oven\n, 12-inch\nstainless steel\nor\ncast iron\nskillet\nMake-Ahead and Storage\nThe lentil stew and topping can be refrigerated separately in airtight containers for up to 5 days; reheat each before serving (lentils may need to be thinned with additional water).\nRead More\nBengali Rice Porridge with Lentils and Chicken\nQuick and Easy Pressure Cooker Chicken, Lentil, and Bacon Stew With Carrots\nCumin-Scented Lentils With Sausage and Dandelion Greens\nMiddle Eastern\nBraised & Stewed Chicken\nLentils\nOnions\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-and-lentil-stew-with-tomatoes-and-onions-recipe.webp?"
}