{
  "url": "https://www.seriouseats.com/chicken-scarpariello-sweet-and-sour-chicken-italian-recipe",
  "image_url": null,
  "tags": [
    "Chicken Mains",
    "Italian",
    "Braised & Stewed Chicken",
    "Chicken Thighs",
    "Sausages"
  ],
  "title": "Chicken Scarpariello (Braised Chicken With Sausage and Peppers)",
  "full_text": "Chicken Scarpariello (Braised Chicken With Sausage and Peppers)\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nActive\n25 mins\nTotal\n70 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\n(\n1.15\nkg\n) bone-in, skin-on\nchicken thighs\n(\n6 to 8\nthighs\n)\nKosher salt\nand freshly ground black pepper\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n3 to 4\nlinks\nsweet or\nhot Italian sausage\n(about\n1 1/2\npounds\n;\n700\ng\n)\n1\nmedium\nonion\n, thinly sliced (about\n6\nounces\n;\n170\ng\n)\n1\nlarge\nred bell pepper\n, thinly sliced (about\n6\nounces\n;\n170\ng\n)\n2\ntablespoons\nfinely minced fresh\nsage leaves\n(about\n1/4\nounce;\n8\ng\n)\n6\ncloves\ngarlic\n, thinly sliced\n8\nhot\nor sweet pickled\ncherry\npeppers\n, thinly sliced, along with\n1/4\ncup\n(\n60\nml\n) pickling liquid from the jar\n1\ncup\n(\n240\nml\n)\ndry white wine\n1\ncup\n(\n240\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\ntablespoons\n(\n28\ng\n)\nsugar\nDirections\nAdjust oven rack to center position and preheat oven to 350°F (175°C). Season chicken generously with salt and pepper. Heat oil in a 4- to 5-quart straight-sided sauté pan or Dutch oven over medium-high heat until shimmering. Add chicken, skin side down, and cook, without moving, until well browned and crisp, about 8 minutes total, lowering heat if pan starts to smoke excessively. Flip chicken and brown lightly on second side, about 3 minutes. Transfer chicken to a large plate and set aside.\nSerious Eats / Julia Estrada\nReturn skillet to heat without draining it and add sausage. Cook until well browned on first side, about 1 1/2 minutes, reducing heat if it starts smoking. Flip sausage and cook on second side until browned, about 1 1/2 minutes longer. Remove pan from heat, transfer sausage to a cutting board, and cut each link into 3 to 4 slices.\nSerious Eats / Julia Estrada\nReturn pan to heat, add onion and bell pepper, and cook, stirring and scraping up browned bits with a wooden spoon, until softened and starting to brown, about 4 minutes. Add sage and garlic, stir to combine, and cook until fragrant, about 1 minute.\nSerious Eats / Julia Estrada\nAdd pickled cherry peppers and their liquid, stirring and scraping up browned bits from bottom of pan with a wooden spoon. Add wine and cook until liquid is reduced by half, about 2 minutes. Add chicken stock and sugar, and stir to combine. Return sausage to pan, toss to combine, then return chicken pieces to pan skin side up, nestling them down among sauce, vegetables, and sausage.\nSerious Eats / Julia Estrada\nTransfer to oven and cook until chicken is crisp and tender, about 30 minutes. Serve immediately, spooning sauce, vegetables, and sausage around chicken pieces.\nSerious Eats / Julia Estrada\nSpecial Equipment\nStraight-sided\nsauté pan\nor\nDutch oven\nNotes\nThe pickling liquid from the jarred cherry peppers can also be used to brine chicken breasts for\nfried chicken sandwiches\n.\nRead More\nChicken Cacciatore With Red Peppers, Tomato, and Onion\nChicken Cacciatore With Mushrooms, Tomato, and Onion\nChicken Vesuvio\nChicken Marsala\nChicken Mains\nItalian\nBraised & Stewed Chicken\nChicken Thighs\nSausages"
}