{
  "url": "https://www.seriouseats.com/chicken-piccata-italian-fried-cutlet-recipe",
  "image_url": "https://www.seriouseats.com/thmb/wx3BSkuavT0ZREV8zSX4Kdh1PWY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/chicken-piccata-italian-fried-cutlet-recipe-hero-03_1-935dcd4ff3a64e22859e537822bd3609.JPG",
  "tags": [
    "Chicken Cutlets",
    "Italian",
    "Fried Chicken",
    "Chicken Mains",
    "Quick Dinners"
  ],
  "title": "Chicken Piccata (Fried Chicken Cutlets With Lemon-Butter Pan Sauce)",
  "full_text": "Chicken Piccata (Fried Chicken Cutlets With Lemon-Butter Pan Sauce)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n45 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nall-purpose flour\n(\n5\nounces\n;\n140\ng\n)\n3\nlarge\neggs\n, beaten\n2\ncups\npanko bread crumbs\n(\n4\nounces\n;\n115\ng\n), roughly crushed by hand if very large\n2\nounces\n(\n60\ng\n) grated\nParmigiano-Reggiano cheese\n8\nboneless, skinless chicken cutlets\n(\n3 or 4 ounces\neach), pounded to about 1/4 inch thick\nKosher salt\nand freshly ground black pepper\nVegetable oil\n, for frying\n1/2\ncup\ndry white wine\n(\n120\nml\n)\n1 1/2\ntablespoons\ndrained\ncapers\n(\n15\ng\n)\n5\ntablespoons\nunsalted butter\n(\n70\ng\n)\n2\ntablespoons\nfresh juice\nfrom\n1\nlemon\n(\n30\nml\n)\n1 1/2\ntablespoons\nminced\nflat-leaf parsley\nDirections\nSet 3 wide, shallow bowls on a work surface. Add flour to the first one, beaten eggs to the second, and panko and Parmesan cheese to the third. Mix panko and Parmesan thoroughly.\nSerious Eats / Julia Estrada\nLine a rimmed baking sheet with parchment paper. Season chicken cutlets all over with salt and pepper. Working with one at a time, dredge a cutlet in flour with your left hand, shaking off excess. Transfer to egg dish, then turn cutlet with your right hand to coat both sides. Lift and allow excess egg to drain off, then transfer to bread crumb mixture. With your left hand, scoop bread crumbs on top of chicken, then gently press, turning chicken to ensure a good layer of crumbs on both sides. Transfer cutlet to prepared baking sheet and repeat with remaining cutlets.\nSerious Eats / Julia Estrada\nFill a large skillet with 1/4 inch oil. Heat over high heat until shimmering and just shy of smoking, about 375°F (191°C) on an instant-read thermometer.\nSerious Eats / Julia Estrada\nWorking in batches and using tongs or your fingers, gently lower cutlets into the pan, laying them down away from you to prevent hot fat from splashing toward you. Fry, gently swirling pan and rotating cutlets for even browning, and adjusting heat as necessary for a steady, vigorous bubble, until bottom side is browned and crisp, about 3 minutes. Flip cutlets and fry until other side is browned and crisp, about 3 minutes longer. Transfer to paper towels to drain and season with salt right away. Repeat with remaining cutlets, topping up oil if necessary.\nSerious Eats / Julia Estrada\nDrain all but one tablespoon oil from skillet. Add wine and bring to a boil over medium-high heat, cooking until raw alcohol smell has mostly cooked off, about 2 minutes. Add capers and butter, whisking constantly, until butter has melted. Lower heat to medium and continue whisking and reducing until a creamy, emulsified sauce forms (the time this takes will depend on your burner power and the size of your pan). If sauce over-reduces and breaks at any point, add 1 tablespoon cold water and whisk to emulsify it again. Whisk in lemon juice and parsley, season with salt and pepper, and remove from heat.\nSerious Eats / Julia Estrada\nArrange cutlets on a platter and drizzle warm butter sauce all over. Serve right away.\nSerious Eats / Julia Estrada\nSpecial Equipment\nRimmed baking sheet\n,\nlarge skillet\n,\ninstant-read thermometer\n,\nwhisk\nNotes\nYou can prepare the cutlets yourself from whole boneless, skinless chicken breasts following\nthe instructions here\n.\nRead More\nBreaded Fried Pork Cutlets\nFish Piccata\nChicken Cutlets\nItalian\nFried Chicken\nChicken Mains\nQuick Dinners",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-piccata-fried-chicken-cutlets-with-lemon-butter-pan-sauce.webp?"
}