{
  "url": "https://www.seriouseats.com/chicken-fried-steak-nuggets-beer-bourbon-gravy-recipe",
  "image_url": "https://www.seriouseats.com/thmb/gQBT28QMgzgG1h9lSeE63uGVVj4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121228-235239-bar-bites-chicken-fried-steak-nuggets-with-beer-and-bourbon-gravy-bd693c79809645bc938e9d16439037c6.jpg",
  "tags": [
    "Steaks",
    "Soul Food & Southern",
    "Frying",
    "Snacks & Appetizers",
    "Game Day"
  ],
  "title": "Chicken-Fried Steak Nuggets with Beer and Bourbon Gravy Recipe",
  "full_text": "Chicken-Fried Steak Nuggets with Beer and Bourbon Gravy Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n45 mins\nTotal\n35 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\ntop sirloin\nor top round cube steak, cut into bite-sized pieces\nKosher salt\nand freshly ground black pepper\n2\nlarge\neggs\n, beaten\n1 1/2\ncups\nwhole milk\n, divided\n1\ncup\nall-purpose flour\n1/4\nteaspoon\ncayenne pepper\n1 to 2\ncups\ncanola, vegetable, or\npeanut oil\n2\ntablespoons\nbourbon\n1/2\ncup\nbeer\n1\nsprig\nfresh thyme\nDirections\nPreheat oven to 175°F. Season the steak on all sides with salt and black pepper and set aside. In a shallow dish, combine the eggs and 1/2 cup milk. In another shallow dish, combine the flour, 1/2 teaspoon salt, 1/2 teaspoon black pepper, and cayenne. Working in batches, dredge the meat in the flour mixture, then in the egg mixture, and again into the flour mixture, shaking off any excess flour or egg wash. Lay the coated pieces of meat on a wire rack. Reserve any extra flour for use in thickening the gravy.\nAdd enough oil to just cover the bottom of a large cast iron skillet, Dutch oven, or flat-bottomed wok by 1/2 inch. Heat the oil over medium heat until shimmering. Carefully add just enough coated steak to make a single layer in the bottom of the pan. Cook until golden brown and crisp on all sides, about 1 to 2 minutes per side. Transfer the fried steaks to a paper towel-lined platter and season immediately with salt. Repeat until all steak is cooked. Keep warm in the oven while you make the gravy.\nPour out all of the grease from the skillet and into a heat-proof container. Return 1 tablespoon of the grease to the skillet and reduce the heat to low. Add 1 tablespoon of the reserved flour to the skillet and whisk to combine. Stir in the bourbon, beer, remaining 1 cup milk, and thyme and increase the heat to high. Continue whisking until the gravy comes to a boil. Reduce the heat to medium-low and continue to cook until the gravy thickens, about 5 more minutes. If the gravy is not thick enough for your liking, you can whisk in more flour if needed. Season the gravy with additional salt and pepper and transfer to a small serving dish. Serve the gravy alongside the chicken-fried steak nuggets.\nSpecial Equipment\nLarge cast iron pan, Dutch oven, or wok for frying\nSteaks\nSoul Food & Southern\nFrying\nSnacks & Appetizers\nGame Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chicken-fried-steak-nuggets-with-beer-and-bourbon-gravy-recipe.webp?"
}