{
  "url": "https://www.seriouseats.com/chicken-donburi-japanese-rice-bowl-with-spinach",
  "image_url": "https://www.seriouseats.com/thmb/BWOrdKuL2UXEpP8t_9p_J537vxI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20191203-donburi-rice-bowl-vicky-wasik-18-4c64eacd34e84f7a84cc9d6f25194f78.jpg",
  "tags": [
    "Chicken Mains",
    "Japanese",
    "Chicken Breast",
    "Spinach",
    "Rice & Grain Mains"
  ],
  "title": "Chicken Donburi (Japanese Rice Bowl) With Spinach Recipe",
  "full_text": "Chicken Donburi (Japanese Rice Bowl) With Spinach Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n25 mins\nResting Time\n5 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n) canola or other neutral cooking\noil\n9\nmedium cloves\ngarlic\n,\n8\nhalved\n(larger cloves can be cut into thirds) and\n1\nminced\n, divided\n1\n(10-ounce; 280 g) bunch\nspinach\n, thoroughly washed and spun dry\nKosher salt\n1/2\nteaspoon\n(\n2.5\nml\n)\nsesame oil\n1/2\nteaspoon\n(\n2.5\nml\n)\nrice vinegar\n2\nboneless, skin-on chicken breast\nhalves (each about\n7 ounces; 200 g\n), tender removed; or\n2\nboneless, skin-on thighs\n(each about\n5 oz; 140 g\n) and\n2\nboneless, skin-on drumsticks\n(each about\n3 ounces; 80 g\n)\n1/4\nteaspoon\n(\n1\nml\n)\nmayonnaise\n(optional)\n1/4\ncup\n(\n60\nml\n)\nsake\n1/4\ncup\n(\n60\nml\n)\ndashi\n, either\ninstant\nor\nhomemade\n(see note)\n1/4\ncup\n(\n60\nml\n)\nsoy sauce\n2\ntablespoons\n(\n30\nml\n)\nmirin\n1/2\nteaspoon\ncornstarch\n, stirred into\n1\ntablespoon\n(\n15\nml\n)\nwater\nto make a slurry\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\nTo Serve:\n6\ncups\ncooked, short-grain Japanese rice\n(see note)\nKizami nori\n(optional; see note)\n4\negg yolks\n(optional)\n2\nmedium\nscallions\n(\n1 1/2\nounces\n;\n40\ng\n), sliced thinly\nKizami beni shoga\n(pickled ginger strips) (optional; see note)\nDirections\nIn a 10-inch cast iron skillet, heat oil over medium heat until just starting to shimmer. Add sliced garlic and cook, stirring frequently, until garlic is golden brown all over, about 7 minutes, taking care not to let any garlic pieces burn. Remove garlic and reserve.\nSerious Eats / Vicky Wasik\nAdd spinach to skillet, season with salt, and cook, tossing frequently, until wilted and mostly dry, about 5 minutes. Turn off heat, add remaining 1 clove minced garlic, and stir until minced garlic becomes fragrant, about 30 seconds. Add sesame oil and vinegar and toss to combine. Transfer spinach to plate and wipe out the skillet with clean kitchen towel (no need to wash).\nSerious Eats / Vicky Wasik\nIf Using Chicken Breasts\n: Return skillet to medium-high heat and heat until just starting to smoke. Meanwhile, smear chicken skin with thin layer of mayonnaise, if using (if not, proceed with recipe). Season breasts with salt, then add to skillet, skin side down; for optimal browning, place a\ncooking weight\non top of each breast (optional). Cook until skin is well-browned and crisp, about 5 minutes. Flip breasts, lower heat to medium-low and continue to cook until thermometer inserted into thickest part of the breast registers 150°F (65°C), about 6 minutes. Transfer breasts to plate to rest.\nSerious Eats / Vicky Wasik\nIf Using Chicken Thighs and Drumsticks\n: Return skillet to medium-high heat and heat until just starting to smoke. Meanwhile, smear chicken skin with thin layer of mayonnaise, if using (if not, proceed with recipe). Season chicken with salt, then add to skillet, skin-side down; for optimal browning, place a\ncooking weight\non top of each piece of chicken (optional). Cook until skin is well-browned and crisp, about 6 minutes. Flip chicken and continue to cook until thermometer inserted into thickest part of thighs and drumsticks registers 160°F (71°C), about 1 minute longer for the drumsticks and 3 minutes longer for the thighs. As each piece of chicken reaches its doneness, transfer to a plate to rest.\nMeanwhile, add sake to skillet and cook, scraping up any brown bits on the bottom of the skillet, until sake no longer smells of alcohol, about 1 minute. Add dashi, soy sauce, mirin, and reserved sliced garlic. Bring liquid to boil, then reduce heat to medium-low and let simmer until slightly reduced and garlic cloves are fully cooked, about 4 minutes. Add cornstarch slurry in small increments to the skillet, pausing between each addition to let the mixture thicken a bit. When sauce has thickened slightly (you may not need all the slurry), turn off heat and add butter to pan, swirling and stirring until it is fully melted and incorporated into the sauce.\nSerious Eats / Vicky Wasik\nTo Assemble the Bowl:\nPlace a shy 1 1/2 cups of rice into each serving bowl. Top with kizami nori (if using). Slice chicken into 1/4-inch-wide slabs (if using breasts) or 1/4-inch-wide deboned strips (if using thighs and drumsticks) and distribute evenly in each bowl. Spoon sauce over rice and chicken. Distribute cooked spinach and garlic cloves evenly in each bowl. Top each bowl with raw egg yolk, if using, and garnish with sliced scallions and pickled ginger (if using). Serve immediately, with any excess sauce passed alongside.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nCast iron skillet\n,\ntongs\n,\ninstant-read thermometer\n,\ncooking weight\n(optional)\nNotes\nThe sauce is best when made with dashi, but you can use chicken stock, vegetable stock (low-sodium versions if using store-bought stocks), or even water as a substitute.\nYou can use any type of rice you prefer for this recipe, but short-grain Japanese rice is preferred because of the flavor and the ease with which you can pick it up with chopsticks, due to its stickiness.\nKizami\nnori is pre-shredded nori, which is available for purchase online and at most well-stocked Japanese grocery stores. Pickled ginger can also be purchased online or at a Japanese grocery store.\nRead More\nOyakodon (Japanese Chicken and Egg Rice Bowl) Recipe\nSerious Eats' Halal Cart-Style Chicken and Rice With White Sauce\nThe Ultimate Chicken Burrito Bowl Recipe\nHainanese Chicken Rice Set Recipe\nGalinhada Mineira (Brazilian Chicken & Rice) Recipe\nChicken Mains\nJapanese\nChicken Breast\nSpinach\nRice & Grain Mains"
}