{
  "url": "https://www.seriouseats.com/chicken-yellow-curry-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PNc90dKuTp6alAZQ_W0PE5dAZFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/chicken-yellow-curry-recipe-hero-02_1-646011c6065f44b684eb88c627fa511c.JPG",
  "tags": [
    "Thai",
    "Stovetop Chicken",
    "Chicken Breast",
    "Chicken Thighs",
    "Coconut Milk & Cream"
  ],
  "title": "Kaeng Kari Kai (Thai Chicken Yellow Curry) Recipe",
  "full_text": "Kaeng Kari Kai (Thai Chicken Yellow Curry) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nE\nnglish cucumber\n2\nlarge\nshallots\nor\n1/2\nmedium\nred onion\n, peeled and sliced thinly lengthwise\n1\ngreen or red\njalapeño\npepper\n, sliced thinly crosswise\n1/2\ncup\ngranulated sugar\n1/2\ncup\nwhite\ndistilled vinegar\n(no substitute)\n2\ntablespoons\nwater\n1/2\nteaspoon\nsalt\n1/4\ncup\nkari (karee) curry paste\n(see note)\n1 1/2\ncups\nfull-fat\ncoconut milk\n1\npound\nlow-starch, waxy potatoes\n, peeled (optional) and cut into 2-inch cubes\n1\npound\nmedium yellow or\nwhite onions\n, peeled and cut lengthwise into\n6\nwedges\n2\ntablespoons\nfish sauce\n, or to taste\n1\npound\nboneless, skinless chicken breasts\nor thighs, cut into 2-inch cubes\nDirections\nCut the half cucumber in half lengthwise. With the cut side down, cut each half crosswise into thin slices; place in a glass bowl. Add shallot (or red onion) slices and pepper slices to cucumber bowl; set aside.\nSerious Eats / Julia Estrada\nCombine sugar, vinegar, water, and salt in a small saucepan. Set over medium heat and cook, stirring occasionally until sugar has completely dissolved (the mixture doesn't have to be boiled), immediately remove from heat. Allow the sauce to cool down to slightly warmer than room temperature, then pour it over cucumber-shallot-pepper mixture. Stir, cover with a piece of plastic wrap, and keep chilled.\nSerious Eats / Julia Estrada\nIn a 2-quart saucepan set over medium-high heat, heat about 1/2 cup of coconut cream (the thick part that rises to the top of the can) with curry paste. Once coconut fat splits, add potato, onion, remaining coconut milk, and fish sauce to the saucepan. Add just enough water, if necessary, to keep the ingredients submerged. Bring to a boil; cover, lower the heat so the mixture simmers, and cook, stirring occasionally, until potatoes cubes are softened, about 15 minutes.\nSerious Eats / Julia Estrada\nAdd chicken to the pot. Bring mixture back to a gentle boil, cover and simmer until chicken is cooked through, 5 to 8 minutes. Check for seasoning, adding more fish sauce if necessary.\nSerious Eats / Julia Estrada\nServe with steamed jasmine rice and prepared ajat.\nSerious Eats / Julia Estrada\nNotes\nBe sure to use the correct curry paste for this recipe. Look for the word \"karee\" or \"kari\" in addition to \"yellow\" just to be certain. There's another type of curry that is called \"yellow sour curry.\" You want the former, not the latter. If there's no \"karee\" or \"kari\" on the label, hopefully there's a picture of the finished dish on it to help you. If you see chunks of potato in the picture, that's a good sign. The other kind of yellow curry doesn't contain potatoes.\nThai\nStovetop Chicken\nChicken Breast\nChicken Thighs\nCoconut Milk & Cream"
}