{
  "url": "https://www.seriouseats.com/chiles-rellenos-smothered-and-traditional-recipe",
  "image_url": "https://www.seriouseats.com/thmb/I3iCEHom7VDa2MxG_XX1NUTdQn0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20160422-chiles-rellenos-27-1be34192fc8c475da5c50b45e1c5f0b4.jpg",
  "tags": [
    "Southwestern & Tex Mex",
    "Mexican",
    "Frying",
    "Cheese",
    "Poblano Peppers"
  ],
  "title": "Chiles Rellenos (Mexican-Style Cheese-Stuffed Chiles)",
  "full_text": "Chiles Rellenos (Mexican-Style Cheese-Stuffed Chiles)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n70 mins\nActive\n60 mins\nTotal\n90 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salsa Ranchera and Chiles:\n6\npoblano\npeppers\n2\npounds\nRoma tomatoes\n(\n1\nkg\n; about\n6\nmedium\n)\n1\nsmall\nyellow onion\n(about\n6\nounces\n;\n170\ng\n), split in half, unpeeled\n2 to 3\nserrano\nchiles\n6\nmedium\ncloves garlic\n, unpeeled\n1/2\ncup\n(\n120\nml\n)\nchicken stock\nor water\n1/2\ncup\nloosely packed\ncilantro leaves\nand tender stems (\n1/2\nounce\n;\n15\ng\n)\n1\ntablespoon\n(\n15\nml\n) lard or\nvegetable oil\nKosher salt\nand freshly ground black pepper\nFor the Filling:\n1\ntablespoon\n(\n15\nml\n) lard or\nvegetable oil\n1\nsmall\nonion\n(about\n6\nounces\n;\n170\ng\n), finely diced\n1\nteaspoon\n(about\n2\ng\n)\ndried oregano\n1/2\npound\n(\n225\ng\n) fresh\nMexican chorizo\nor ground pork\nKosher salt\nand freshly ground black pepper\n10\nounces\n(\n285\ng\n) grated Jack,\npepper jack\n, Chihuahua, or cheddar cheese;\n16\nounces\n(\n450\ng\n) if making smothered version (see notes)\nTo Fry:\n2\ncups\n(\n475\nml\n)\nvegetable oil\n4\nlarge\neggs\n, separated\n1\ncup\nflour\n(\n5\nounces\n;\n140\ng\n), divided\nDirections\nFor the Salsa Ranchera and Chiles:\nAdjust rack to 4 inches below broiler and preheat broiler to high. Place poblanos, tomatoes, onion, serranos, and garlic on a foil-lined rimmed baking sheet. Broil until chiles are blackened on top, about 5 minutes. Flip chiles to expose another un-blackened surface and continue broiling for another 5 minutes. Turn chiles one more time, flip tomatoes, and continue broiling until chiles are blackened all over, a few minutes longer.\nTransfer tomatoes, onion, garlic, serranos, stock, and cilantro to the bowl of a food processor or blender. Wrap Poblanos with foil from baking sheet and set them aside to steam. Process salsa until smooth but still a little chunky.\nHeat 1 tablespoon (15ml) lard or oil in a medium saucepan until just starting to smoke. Immediately pour all of the salsa into pan (it will bubble very violently). Bring to a simmer and cook until reduced by about 1/2 cup. Season to taste with salt and pepper and set aside.\nFor the Filling:\nHeat 1 tablespoon (15ml) lard or vegetable oil in a large skillet over medium-high heat until shimmering. Add onion and cook, stirring, until softened and gently browned, about 4 minutes. Add oregano and chorizo or pork and cook, breaking it up with a wooden spoon, until cooked through, about 5 minutes. Season to taste with salt and pepper. Immediately transfer pork mixture to a bowl with grated cheese and toss to combine. Set aside.\nCarefully peel chiles without tearing them. Make a slit in one and remove most of the seeds. Spoon cheese/pork mixture into the cavity and carefully close chile back up, slightly overlapping the edges. Repeat with remaining chiles. If you are making the smothered version, you should have about 1 cup of filling left over (see notes).\nTo Fry:\nHeat oil in a large skillet over medium-high heat until it reaches 375°F (190°C). Adjust heat to maintain temperature. Whisk egg whites until stiff peaks form. Whisk in yolks one at a time until incorporated (do not over-whisk). Sprinkle with 1/4 cup flour and whisk just until flour is incorporated. Set aside.\nPlace remaining flour on a shallow plate. Gently pick up one chile and roll it in flour to coat. Transfer to egg mixture and gently turn to coat. (You may have to spoon the mixture over the top if the chile is too fragile.) Using your hands or a flexible fish spatula, carefully slip one chile into hot oil. Repeat until pan is full, making sure not to crowd it. If there are any un-battered spots on the top surfaces of the chiles, dollop a small amount of batter on top to seal them. Cook until the bottom side is golden brown, about 2 minutes. Carefully turn and cook until second side is browned, about 2 minutes longer. Transfer cooked chiles to a paper towel–lined plate. Repeat until all chiles are cooked.\nFor the Traditional Version:\nSpoon salsa into the bottom of a casserole dish. Top with chiles and spoon a little more salsa over them. Serve immediately or bake in a 375°F (190°C) oven for a few minutes to reheat if desired.\nFor the Smothered Version:\nSpoon salsa into the bottom of a casserole dish. Top with chiles and spoon a little more salsa over them. Spread remaining filling mixture over the top. Bake in a 375°F (190°C) oven until melted and bubbly, about 10 minutes. Serve immediately.\nSpecial Equipment\nRimmed baking sheet,\nfood processor\nor\nblender\n,\ninstant-read thermometer\nNotes\nChiles rellenos are typically served only with sauce on top, but you can make a cheese-covered, smothered, and baked version if you prefer.\nSouthwestern & Tex Mex\nMexican\nFrying\nCheese\nPoblano Peppers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chiles-rellenos-mexican-style-cheese-stuffed-chiles.webp?"
}