{
  "url": "https://www.seriouseats.com/chilean-semolina-pudding-with-red-wine-syrup-recipe-8582173",
  "image_url": "https://www.seriouseats.com/thmb/etPbVk9o5XFJGGBsQtNLHwELSS8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240221-SEA-semola-con-leche-y-salsa-di-vino-EstudioComo-hero-0de6a7ae49d24999a6ea07b4291fe11b.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "The Latest",
    "Desserts",
    "Cornmeal",
    "South American"
  ],
  "title": "Semola con Leche y Salsa de Vino (Chilean Spiced Semolina Dessert With Red Wine Syrup)",
  "full_text": "Semola con Leche y Salsa de Vino (Chilean Spiced Semolina Dessert With Red Wine Syrup)\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nChilling Time\n60 mins\nTotal\n110 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Red Wine Syrup:\n1\ncup\n(\n250\nml\n)\ndry red wine\n, preferably any simple, affordable\nChilean Carménère\nor\nCabernet Sauvignon\n1\ncup\ngranulated sugar\n(\n7\nounces\n;\n200\ng\n)\nFor the Semolina Pudding:\n5\ncups\n(\n1.2\nL\n)\nwhole milk\n1/2\ncup\ngranulated sugar\n(\n3 1/2\nounces\n;\n100\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt use half as much by volume\nFive\n3-inch strips\norange zest\n3\nwhole sticks\n(about\n15\ng\n)\nMexican (Ceylon) cinnamon\n1\nvanilla\npod\nor\n1/2\nteaspoon\nvanilla extract\n3 1/2\nounces\n(\n100\ng\n)\ncoarse semolina flour\n(see note)\nDirections\nFor the Red Wine Syrup:\nIn a small saucepan, heat wine and sugar over medium heat, stirring often, until boiling, then reduce heat and simmer until slightly thickened, about 15 minutes. Consistency should be similar to pomegranate syrup or honey. To check while cooking, pour a teaspoon of the syrup onto a cold flat dish so it cools down quickly. Remove from heat and let cool slightly, then pour into an airtight container and refrigerate until ready to use.\nSerious Eats / Estudio Como\nFor the Semolina Pudding:\nIn a medium Dutch oven or other heavy-bottomed pot, combine milk, sugar, salt, orange peel, and cinnamon sticks. Using a sharp paring knife, split vanilla pod lengthwise, then scrape out seeds and add them to milk along with pod; alternatively, add vanilla extract. Set over medium-low heat and, stirring frequently with a wooden spoon, bring to a gentle boil, then immediately remove from heat. Set aside to infuse for 20 minutes, stirring often to avoid skin formation on top.\nSerious Eats / Estudio Como\nUsing a slotted spoon, remove and discard orange zest, vanilla pod, and cinnamon sticks from the milk. Return milk to medium-low heat, and return to boil while stirring often. Using a whisk, gently sprinkle in semolina while whisking constantly. Continue whisking constantly until mixture is very thick and semolina is fully cooked, about 5 minutes. (Be careful to keep your face away from the pot, as the semolina can bubble and spit as it thickens.)\nSerious Eats / Estudio Como\nUsing a ladle and working quickly while the semolina is still fluid, pour hot pudding into 6 individual heat-safe serving bowls, or alternatively 1 large heat-safe serving bowl (see notes. Use a spatula to smooth the top of the pudding, then cover with plastic wrap (the plastic does not need to touch the surface of the semolina) and refrigerate until cold, 1 to 3 hours.\nSerious Eats / Estudio Como\nBefore serving, let the red wine syrup come to room temperature. The pudding can be served in its dish, or unmolded onto a plate and sliced to serve. To unmold, flip the pudding bowl quickly over a flat tray or plate and place a hot and wet dish towel over the bottom of the pudding bowl. Leave it there for about 2 minutes and gently shake and lift the bowl to unmold the pudding. The pudding should separate easily from the bowl. Serve with the chilled red wine syrup.\nSerious Eats / Estudio Como\nSpecial Equipment\nSmall saucepan\n, medium\nDutch oven\nor heavy-bottomed pot, serving dish or bowl\nNotes\nCoarse semolina is sold online by\nKing Arthur\nas well as this\nChilean brand\n.\nMake-Ahead and Storage\nThe red wine syrup can be refrigerated in an airtight container for up to 1 month.\nThe semolina pudding can be refrigerated, covered with plastic wrap, for up to 3 days. I do not recommend freezing it.\nCustards, Mousses & Puddings\nThe Latest\nDesserts\nCornmeal\nSouth American",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/semola-con-leche-y-salsa-de-vino-chilean-spiced-semolina-dessert-with-red-wine-syrup.webp?"
}