{
  "url": "https://www.seriouseats.com/chilled-beet-and-cherry-soup-recipe-8667495",
  "image_url": null,
  "tags": [
    "Cherry",
    "The Latest",
    "Soups",
    "Summer Snacks & Appetizers",
    "Beets"
  ],
  "title": "Chilled Beet and Cherry Summer Soup",
  "full_text": "Chilled Beet and Cherry Summer Soup\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nChilling Time\n4 hrs 30 mins\nTotal\n5 hrs 15 mins\nServes\n4 Servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(950ml)\ntap water\n2\nsmall beets\n, trimmed, peeled and finely chopped (8 ounces; 227g)\n1\n3-inch\ncinnamon\nstick\n1\nstar anise\n2\ncups\nfresh\nsweet red cherries\n(10 ounces; 283g), pitted, divided\n1/2\nteaspoon\nDiamond Crystal\nkosher salt; for table salt use half as much by volume\nFreshly ground black pepper\n3/4\ncup\nsour cream\nor plain yogurt (6 ounces; 170g), at room temperature, plus more for garnish\n1/4\ncup\n(60ml)\nfresh lemon juice\n(from 1 large lemon)\nDirections\nIn a medium saucepan, combine water, beets, cinnamon, star anise, and 1 cup cherries. Bring to a simmer over medium-high heat. Reduce heat to medium to maintain a simmer and cook, stirring occasionally, until beets are tender, 15 to 20 minutes.\nSerious Eats / Hannah Hufham\nDiscard cinnamon and star anise. Carefully transfer beet and cherry mixture to a blender. Secure lid on blender, remove center piece to allow steam to escape, and place a clean kitchen towel over opening. Blend, starting at low speed and gradually increasing to high, until completely smooth, about 1 minute. (Use caution when puréeing hot liquids.) Return mixture to saucepan.\nSerious Eats / Hannah Hufham\nStir in salt, pepper, and remaining 1 cup cherries and bring to a simmer over medium heat, stirring often, until cherries are slightly softened, about 5 minutes.\nSerious Eats / Hannah Hufham\nTransfer to a large heatproof bowl or jug. Let cool slightly at room temperature, about 30 minutes. Place sour cream in a small bowl, and gradually whisk in 1 cup warm soup, stirring until well-combined and no streaks remain. Whisk sour cream mixture back into soup until well blended, then stir in lemon juice. Cover and refrigerate until completely chilled, at least 4 hours or up to 3 days. Serve chilled. Garnish with a swirl of sour cream, if desired.\nSerious Eats / Hannah Hufham\nVariations\nThis soup can also be made with sour cherries. To do so, simply replace some of the sweet cherries with sour cherries and reduce the amount of lemon juice to taste.\nSpecial Equipment\nCherry pitter or chopstick, blender, large heatproof bowl\nMake Ahead and Storage\nStore soup in an airtight container in the refrigerator for up to 3 days.\nSerious Eats / Hannah Hufham\nCherry\nThe Latest\nSoups\nSummer Snacks & Appetizers\nBeets"
}