{
  "url": "https://www.seriouseats.com/chilean-beef-empanadas-recipe-11711441",
  "image_url": "https://www.seriouseats.com/thmb/6xNl6FdN3VoMK0wfokc9jRlpwR4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250408-SEA-ChileanBeefEmpanadas-Estudio-MAR-36-da459e3ae9224c439cab012ff80b97db.jpg",
  "tags": [
    "Beef",
    "The Latest",
    "Recipes",
    "Baking",
    "Savory"
  ],
  "title": "Chilean Beef Empanadas",
  "full_text": "Chilean Beef Empanadas\nClose\nJump to recipe\nPrep\n60 mins\nCook\n45 mins\nCooling Time:\n60 mins\nTotal\n2 hrs 45 mins\nServes\n6\nto 12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Empanada Filling (Pino):\n4\ntablespoons\n(\n60\nml\n)\nvegetable or extra-virgin olive oil\n, divided\n1 1/2\npounds\n(\n680\ng\n)\nflat iron or top blade steak\n, diced into 1/3- to 1/2-inch cubes\n3\nteaspoons\nDiamond Crystal kosher salt\n, divided, plus more as needed; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\n2\npounds\n(\n907\ng\n) white or yellow\nonions\n, finely diced\n1\ntablespoon\nChilean ají de color or sweet\npaprika\n1\nteaspoon\nground cumin\n1 to 2\ntablespoons\n(\n15-30\nml\n)\nChilean hot sauce\nor sriracha (optional, see notes)\n1\ntablespoon\nall-purpose flour\n2\ncups\n(\n480\nml\n)\nhomemade\nbeef stock\n,\nchicken stock\n, or\nvegetable stock\nor store-bought low-sodium chicken broth or vegetable broth\nFor the Empanada Dough:\n4\nounces\n(\n115\ng\n)\nunsalted butter\n4\nounces\n(\n115\ng\n) leaf\nlard\nor vegetable shortening\n1\ntablespoon\n(\n9\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n2\npounds\n(\n905\ng\n)\nall-purpose flour\n, plus more for dusting\n1\nteaspoon\nbaking powder\n1 1/2\ncups\n(\n355\nml\n)\nhot water\n(130 to 140°F; 55 to 60°C), divided\n2\nlarge\neggs\n, at room temperature and lightly beaten, divided\n2\ntablespoons\n(\n30\nml\n)\nChilean pisco\n(use Peruvian pisco or vodka if not available)\nTo Assemble:\n1/4\ncup\n(\n60\nml\n)\nmilk\n1\negg\nyolk\nbeaten with\n2\ntablespoons\nmilk\nto form an egg wash\n3\nhard boiled\neggs\n, peeled and cut into quarters\n12\nwhole pitted\nlarge\nblack olives\n(see notes)\n3\ntablespoons\nsmall\nraisins\n, any color\nDirections\nFor the Beef Filling:\nIn a large stainless steel skillet, cast iron skillet or wok, heat 1 tablespoon oil over high heat until shimmering. Add half the diced beef, distributing it in an even layer and cook without stirring until juicy on top and browned underneath, about 3 minutes. Season with 1 teaspoon salt and a 1/8 teaspoon pepper, then use a wooden spoon to stir to release beef from bottom of skillet. Transfer beef to a medium bowl. Repeat with 1 tablespoon oil, remaining beef, remaining 1 teaspoon salt, and remaining 1/8 teaspoon pepper.\nSerious Eats / Estudio-MAR\nRemove now-empty pot from heat, add 2 cups broth, and use a wooden spoon to scrape to release any remaining browned bits into liquid. Transfer liquid to a bowl or measuring cup and set aside.\nSerious Eats / Estudio-MAR\nReturn pot to medium heat and heat remaining 2 tablespoons oil until shimmering. Add onion and cook, stirring often, until softened, 7 to 10 minutes. Add ají de color, cumin, and hot sauce (if using). Season with 1 teaspoon salt and 1/4 teaspoon black pepper, and cook, stirring until fragrant, about 1 minute.\nSerious Eats / Estudio-MAR\nAdd flour into onion mixture and cook, using a wooden spoon to stir frequently until no lumps remain, about 2 minutes. Stir in reserved liquid, reserved browned beef and bring to a boil over high heat. Reduce heat to low and simmer, stirring occasionally, until liquid is reduced by half and onions are completely soft, 10 to 12 minutes. Season with salt to taste, if needed.\nSerious Eats / Estudio-MAR\nTransfer prepared pino to a shallow baking dish or bowl and let cool at room temperature slightly, about 20 minutes, then refrigerate until completely chilled, about 1 hour (see notes).\nSerious Eats / Estudio-MAR\nFor the Empanada Dough:\nIn a small saucepan, heat butter and lard or shortening over medium heat until melted and hot and just starting to bubble.\nSerious Eats / Estudio-MAR\nIn a large mixing bowl, thoroughly whisk together flour, salt, and baking powder. Make a well in center of flour mixture and add half of the hot water, half of the melted hot fat mixture, and half of the eggs. Using a wooden spoon, stir vigorously until combined and small lumps form. Add remaining water, fat mixture, eggs, and pisco and stir vigorously until a rough dough ball forms and separates from the sides of bowl.\nSerious Eats / Estudio-MAR\nTransfer dough to a lightly floured work surface and knead by hand until smooth, and still warm, about 3 minutes.\nSerious Eats / Estudio-MAR\nWrap dough with plastic wrap and let rest at room temperature for 15 minutes.\nSerious Eats / Estudio-MAR\nTo Assemble:\nWhen ready to assemble the empanadas, transfer pino stew to freezer until firm, 15 to 30 minutes. Adjust oven rack to middle position and preheat oven to 475°F (245°C). Line 2 rimmed baking sheets with parchment paper.\nSerious Eats / Estudio-MAR\nWhile pino par-freezes,cut dough into 12 equal pieces (4 1/2 ounces; 125 g each). Working with 1 piece of dough at a time , dust dough piece lightly with flour and roll into a ball on a lightly floured work surface. Using a rolling pin, roll into a 8 1/2-inch (21-22cm) round. Do not worry if disc is not perfectly round; edges will be trimmed later. (While rolling each piece of dough, keep remaining dough pieces covered and warm; see notes.)\nSerious Eats / Estudio-MAR\nIn lower center half of dough round, place 1/4 boiled egg, 1 olive, 2 raisins, and 1/2 cup (about 3 1/2 ounces; 100g )pino stew. Using pastry brush, lightly brush outer 1-inch edge of dough round with milk. Fold dough over filling (without stretching the dough), pressing gently on the border to seal the edges. It should look like a half moon. Don’t worry if some air is trapped inside, as empanadas will be pricked before baking.\nSerious Eats / Estudio-MAR\nUsing a pasta wheel or pizza cutter, trim excess dough to form a 3/4-inch (2cm) dough border. Lightly brush milk over sealed edge.\nSerious Eats / Estudio-MAR\nUsing your fingers, make 3 folds of the dough border inward towards the filling: 2 from the corners towards the sides of the empanada on a 75°– 80° angle towards the center, and then 1 in the center, to close the empanada. Folds should slightly overlap. Using your index finger, press firmly in the corners where foldings meet. Repeat with remaining dough pieces and filling.\nSerious Eats / Estudio-MAR\nArrange the empanadas on the prepared sheets, spacing them at least 1 inch apart. Re-whisk egg wash to recombine and brush empanadas with egg wash. Using a toothpick or tip of paring knife, prick tops of empanadas 3 to 4 times for ventilation.\nSerious Eats / Estudio-MAR\nBake one sheet tray at a time, rotating once halfway through, until golden brown, 12 to 14 minutes. Transfer the baking sheet to a cooling rack and repeat with remaining baking sheet. Let empanadas cool for 5 to 10 minutes before serving.\nSerious Eats / Estudio-MAR\nSpecial Equipment\nKitchen scale, rolling pin, pasta wheel cutter or pizza cutter, pastry brush, bench scraper\nNotes\nChilean hot sauce, known as ají Chileano can be found at some Latin grocers or purchased online. I recommend JB Ají Chileno brand.\nLook for a salty and mild variety of black olive, such as Nyons, Niçoise, or Liguirian.\nIt is common for empanadas to leak juices while baking, resulting in a drier empanada. However, this can be avoided by keeping the filling very cold during assembly, so it doesn't reach a boil when baking. Chilling the pino stew in the freezer for 15 to 30 minutes before assembling ensures the empanadas will not leak. If the filling becomes warm, chill in the freezer while assembling.\nIt is important to keep the empanada dough warm and malleable for easier shaping. To keep the dough warm, try my late Abuelita’s trick: Keep the covered dough in a bowl on an inverted lid of a stockpot half full of simmering water.\nMake-Ahead and Storage\nThe beef and onion filling (pino stew) can be made ahead and refrigerated in an airtight container for up to 2 days or frozen for up to 2 months.\nThe empanada dough can be refrigerated, wrapped in plastic wrap or in a resealable bag, for up to 3 days. Alternatively the dough can be cut into 12 portions, shaped into rounds, wrapped individually in plastic wrap and frozen for up to 2 months.\nLeftover baked empanadas can be refrigerated in an airtight container for up to 1 day or frozen for up to 1 month. Reheat on a sheet tray in a 350°F (175°C) oven until warmed through, 5 to 10 minutes or for 20 to 25 minutes from frozen.\nBeef\nThe Latest\nRecipes\nBaking\nSavory"
}