{
  "url": "https://www.seriouseats.com/chili-rubbed-mahi-mahi-tacos-with-grilled-man",
  "image_url": "https://www.seriouseats.com/thmb/ITPOkwOVAedjC_f-S0kaflLlmCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__20140709-mahi-mahi-tacos-step-4-joshua-bousel-97ffaca6af06412495ce7a9aa430fa78.jpg",
  "tags": [
    "Fish",
    "Dairy-free Mains",
    "Grilled Fish",
    "Mango",
    "Quick Dinners"
  ],
  "title": "Chili-Rubbed Mahimahi Tacos With Grilled-Mango Salsa Recipe",
  "full_text": "Chili-Rubbed Mahimahi Tacos With Grilled-Mango Salsa Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nActive\n45 mins\nResting Time\n10 mins\nTotal\n70 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Rub:\n2\nteaspoons\nchili powder\n2\nteaspoons\npaprika\n2\nteaspoons\nkosher salt\n1\nteaspoon\ndark brown sugar\n1/2\nteaspoon\ncumin\n1/2\nteaspoon\nground black pepper\n1/2\nteaspoon\ngarlic powder\nFor the Salsa:\n1\nalmost ripe mango\n, peeled and cored\n1\nsmall\nred onion\n, cut 1/2-inch rounds and skewered horizontally\n1\nsmall\njalapeño\n2\nRoma tomatoes\n, cored and finely diced\n1\nsmall\nred pepper\n, cored and finely diced\n2\ntablespoons finely chopped\nfresh cilantro\n2\ntablespoons\nlime juice\nfrom\n1\nlime\nKosher salt\n, to taste\n1\npound\nskinless, boneless mahi-mahi\n2\ntablespoons\nolive oil\n8\ncorn tortillas\n1\nlime\n, cut into wedges\nDirections\nTo make the rub:\nMix together chili powder, paprika, salt, brown sugar, cumin, black pepper, and garlic powder in a small bowl, set aside.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate.\nPlace mango, onions, and jalapeño on the grill. Cook mango until grill marks develop, 2 to 3 minutes per side. Cook onions until charred and slightly softened, 4 to 5 minutes per side. Cook jalapeño until lightly blistered and charred all over, 6 to 8 minutes total. Remove all to cutting board and let sit until cool enough to handle, about 5 minutes. Finely dice mango and onions and transfer to a medium bowl. Stem, seed, and finely diced jalapeño and transfer to bowl with mango and onion. Add in tomatoes, red pepper, cilantro, and lime juice and stir to combine. Season with salt to taste. Set aside.\nCoat fish with spice rub and brush with olive oil all over. Place fish on grill and cook until bottom of fillet begins to turn opaque and a spatula can be slid under fish with little to no resistance, about 5 minutes. Flip fish and cook until it flakes to a fork and is opaque almost all the way through, or registers between 130 to 135°F (54 to 57°C) on an instant-read thermometer inserted in middle of filet, 3 to 5 minutes more. Transfer fish to a platter, let rest for 5 minutes. Pull fish into small pieces using two forks.\nToast tortillas on grill until warm pliable, about 30 seconds. Remove from grill and top each tortilla with fish and salsa. Serve immediately with lime wedges.\nSpecial Equipment\nGrill\nFish\nDairy-free Mains\nGrilled Fish\nMango\nQuick Dinners"
}