{
  "url": "https://www.seriouseats.com/chimichanga-recipe-11689717",
  "image_url": null,
  "tags": [
    "Southwestern & Tex Mex",
    "The Latest",
    "Mains",
    "Comfort Food",
    "Frying"
  ],
  "title": "Crispy Chicken Chimichangas",
  "full_text": "Crispy Chicken Chimichangas\nJump to recipe\nCook\n90 mins\nTotal\n90 mins\nServes\n6\nMakes\n6 chimichangas\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salsa:\n3\ntomatillos\n(\n4 ounces\n;\n113\ng\n)\n5\nmedium cloves (25g)\ngarlic\n10\nchiles\nde árbol\n, stems removed (\n5\ng\n)\nKosher salt\nFor the Chicken Filling:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1\nsmall\nwhite onion\n(\n6\nounces\n;\n170\ng\n), diced\n2\nplum (Roma) tomatoes\n,\ndiced\n(\n8\nounces\n;\n225\ng\n)\n2 to 3\nserrano chiles\n, minced (\n60\ng\n)\n4\nmedium cloves\n(\n20\ng\n)\ngarlic\n, minced\n2\npounds\n(\n32\nounces\n;\n907\ng\n)\npoached chicken\nor store-bought rotisserie chicken, shredded into bite-size pieces (about 6 cups)\nFor the Chimichangas:\n2\nquarts\n(1.9 L)\nneutral oil\nsuch as canola or vegetable oil for frying\n6\nlarge\n(10-inch)\nflour tortillas\n10\nounces\n(\n283\ng\n)\nQueso Oaxaca\n, shredded (see notes)\n3\ncups\narroz rojo\nor\ncooked white rice\n(\n8\nounces\n;\n230\ng\n)\nFor Serving:\nGu\naca\nmole\nPico\nde\ngallo\nMexican Crema\nor sour\ncream\nLim\ne w\nedges\nDirections\nFor the Salsa:\nAdjust oven rack to upper-middle position and preheat oven broiler to high. Place tomatillos and garlic on an aluminum foil–lined baking sheet. Broil until garlic is blackened and well charred, 3 minutes. Remove garlic, flip tomatillos, and continue broiling until tomatillos are deeply charred, about 5 more minutes.\nSerious Eats / Amanda Suarez\nIn a blender jar, add charred tomatillo, garlic, and chiles. Blend on high speed until smooth, adding 1 to 2 tablespoons of water, if needed, about 1 minute. Season with salt to taste.\nSerious Eats / Lorena Masso\nFor the Chicken Filling:\nIn a large saucepan, add olive oil and heat over medium heat until shimmering. Add onion and cook, stirring occasionally, until slightly softened, about 5 minutes. Add tomato, serrano chiles, and garlic and continue cooking until tomatoes and chiles have softened, about 5 more minutes. Turn off heat and stir in shredded chicken.\nSerious Eats / Lorena Masso\nFor the Chimichangas:\nAdd oil to large Dutch oven or stock pot. (Oil should measure 2 inches deep.) Heat over medium-high until oil reaches 350℉ (175℃). While oil is heating, working with one tortilla at a time, spread 1/3 cup (45 g) shredded cheese just below center of tortilla in the shape of a rectangle, leaving a 2-inch border on the left and right sides and a 3-inch border on the bottom and top sides. Top cheese with a 1 cup (5 ounces) chicken mixture and mold it with your fingers into a neat cylindrical shape over the cheese. Place 1/2 cup (77 g) rice over chicken filling and use fingers to spread out to cover filling.\nSerious Eats / Lorena Masso\nFold the 2 short sides of tortilla in over the filling. Then pull one long side over the center and tuck it beneath the fillings with your fingertips. Hold the sides tight and roll until burrito is sealed and fillings fully tucked in.\nSerious Eats / Lorena Masso\nWhen ready to fry and oil reaches temperature, line a wire rack with paper towels and set in a rimmed baking sheet. Using a spider skimmer, large metal slotted spoon, or metal fish spatula, carefully transfer two chimichangas into hot oil, seam side down, and fry until bottom sides are golden brown, about 2 minutes. Using spider skimmer or tongs, gently flip and continue frying until tortilla is crisp and golden on all sides, about 2 minutes longer. Transfer to prepared wire rack when done. Return oil to 350℉ (175℃). Repeat frying process with remaining chimichangas. Let fried chimichangas sit for 5 minutes to slightly cool.\nSerious Eats / Lorena Masso\nServe chimichangas with salsa, crema, guacamole, pico de gallo, and lime wedges on the side.\nSerious Eats / Lorena Masso\nSpecial Equipment\nBlender, large saucepan, large Dutch oven or stock pot, wire rack, digital thermometer or clip-on thermometer for frying\nNotes\nQueso Oaxaca, also known as quesillo, is a fresh Mexican cheese. It can be substituted with any other melting cheese such as mozzarella or Monterey jack.\nMake-Ahead and Storage\nChimichangas should be enjoyed immediately.\nSouthwestern & Tex Mex\nThe Latest\nMains\nComfort Food\nFrying"
}