{
  "url": "https://www.seriouseats.com/chinese-spareribs-char-siu-recipe",
  "image_url": "https://www.seriouseats.com/thmb/urn-pC7SJOyq78KLEJ3jg1umyjA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/chinese-spareribs-char-siu-recipe-hero-03-2f15bd6081bd4157a36d5183b7f91060.jpg",
  "tags": [
    "Chinese",
    "Roasted Pork",
    "Pork Mains",
    "Game Day"
  ],
  "title": "Chinese Spareribs Recipe",
  "full_text": "Chinese Spareribs Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n100 mins\nMarinating and Resting Time\n8 hrs 10 mins\nTotal\n9 hrs 55 mins\nServes\n3\nto 5 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\nChinese five-spice powder\n1\nfull\nrack\nSt. Louis-style\nspareribs\n, cut into individual ribs (about\n3\npounds\ntotal) (see note)\n1/2\ncup\n(\n120\ng\n)\nhoisin sauce\n1/4\ncup\n(\n60\nml\n) Shaoxing wine or\ndry sherry\n2\ntablespoons\n(\n30\nml\n)\nsoy sauce\n1/4\ncup\n(\n80\ng\n)\nhoney\nDirections\nSprinkle five-spice powder evenly over ribs and rub until thoroughly coated. Set ribs aside.\nSerious Eats / Julia Estrada\nCombine hoisin sauce, shaoxing wine, soy sauce, and honey in a gallon-sized zipper lock bag. Add ribs to bag and mix until evenly coated. Seal bag, transfer to refrigerator, and let ribs marinate at least overnight and up to three nights.\nSerious Eats / Julia Estrada\nWhen ready to cook, preheat oven to 375°F. Remove ribs from bag, wiping off excess marinade with your fingers (reserve marinade). Line a rimmed baking sheet with foil, set a wire rack in it, and spread the ribs evenly over the rack. Cover with aluminum foil and roast until a paring knife can be inserted into the meat with minimal resistance, about 1 hour 15 minutes. Remove foil, brush ribs with marinade, increase heat to 450°F, and roast until charred, glazed, and sticky, about 20 minutes longer, rotating ribs and basting with marinade once more during cooking. Let rest 10 minutes, then serve.\nSerious Eats / Julia Estrada\nNotes\nYou can add a few drops of red food coloring to the marinade if you want a deeper red hue to your ribs.\nBaby back ribs will work just as well as St. Louis-cut.\nChinese five spice powder can be found in the spice section of most major supermarkets. You can make your own by combining 1 teaspoon powdered cinnamon, 2 teaspoons powdered fennel, 1 teaspoon powdered star anise, 1/4 teaspoon powdered cloves, and 1/2 teaspoon powdered Sichuan peppercorns (substitute ginger for Sichuan peppercorns for a different style of five spice).\nRead More\nSerious Entertaining: A Dim Sum-Inspired Chinese Food Party\nChinese\nRoasted Pork\nPork Mains\nGame Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chinese-spareribs-recipe.webp?"
}