{
  "url": "https://www.seriouseats.com/chinese-lotus-seed-buns-recipe",
  "image_url": "https://www.seriouseats.com/thmb/gLAHu4pZOV3Lr6rz7fjinVpzJa8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__08__lotus-seed-buns-shao-zhong-26-19-152a200098cc4d21924fcf6b142af447.jpg",
  "tags": [
    "Desserts",
    "Chinese",
    "Rolls & Buns"
  ],
  "title": "Light and Tender Chinese Lotus Seed Buns Recipe",
  "full_text": "Light and Tender Chinese Lotus Seed Buns Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n90 mins\nActive\n90 mins\nSoaking and Standing Time\n4 hrs 20 mins\nTotal\n6 hrs 30 mins\nServes\n10 buns\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Lotus-Seed Paste Filling:\n11\nounces\ndried lotus seeds\n(see note)\nWater\n1/4\ncup\nneutral oil\n, such as\nvegetable\nor\ncanola oil\n1/2\nto\n3/4\ncup\nsugar\nFor the Buns:\n1 1/4\ncups\nlow-protein flour\n, such as\ncake\nor\npastry\nflour\n, or\n3/4\ncup\nplus\n2\ntablespoons\nall-purpose flour\nmixed with\n2\ntablespoon\ncornstarch\n1 1/2\ntablespoons\nsugar\n1/4\nteaspoon\nactive dry yeast\n1/4\nteaspoon\nbaking powder\n1\ntablespoon\nglutinous rice flour\n(see note)\n1/4\ncup\nwater\n1\ntablespoon\nheavy cream\nYellow\nor\npink\nfood coloring\n(optional)\nDirections\nFor the Lotus-Seed Paste Filling:\nRinse lotus seeds and soak in a large bowl of water until softened, at least 4 hours or overnight.\nTear each seed in half and remove the small bitter sprout (technically the cotyledon) in the center.\nPlace lotus seeds in a large pot and add enough water to completely cover. Bring to a boil over high heat, then lower heat and simmer, adding more water if necessary to keep seeds covered, until tender, about 1 hour.\nReserve 1 cup of lotus-seed cooking water, then drain seeds.\nTransfer seeds to a food processor or blender, add a splash of reserved lotus-seed cooking water, and process to a smooth paste, adding more reserved cooking water if necessary. For a finer texture, pass lotus-seed paste through a fine sieve, though this step is optional.\nAdd lotus-seed paste and oil to a nonstick skillet and heat over medium heat, stirring with a spatula or wooden spoon until oil is incorporated.\nAdd 1/2 cup sugar and stir until incorporated. Taste, and if you want the paste more sweet, add remaining 1/4 cup sugar, 1 tablespoon at a time, until desired sweetness.\nRemove from heat and set aside. The lotus-seed paste can be made in advance and refrigerated for up to 3 days, or frozen for up to 6 months.\nFor the Buns:\nIn a large bowl, mix low-protein flour or all-purpose flour mixture with sugar, yeast, baking powder, and glutinous rice flour. Add water and stir until incorporated.\nAdd cream and mix well until a loose, shaggy dough forms. Transfer dough to a work surface and knead until dough is smooth.\nRoll dough into a 1-inch-thick rope. Cut into 10 portions.\nWorking 1 piece at a time, roll out dough pieces using a rolling pin, dowel, or glass bottle, to 3 -inch rounds.\nSet 1 scant tablespoon of lotus-seed paste in the middle of each dough round.\nWorking 1 bun at a time, wrap dough around filling to fully enclose it.\nSet buns seam-side down on a lightly floured or parchment-lined plate or baking sheet.\nPressing gently with a dough scraper or the back of a knife, create an indent on the top side of each bun.\nCover buns with plastic wrap and let stand for 20 minutes.\nLine a steamer insert with parchment paper and set up for steaming.\nIf using food coloring, brush top of each bun with food coloring using a pastry brush.\nSet buns in the prepared steamer, spacing them 1 1/2 inches apart.\nSteam buns until puffed and cooked through, about 15 minutes. Serve hot or at room temperature.\nSpecial equipment\nFood processor or blender, steamer\nThis Recipe Appears In\nHow to Make Chinese Lotus Seed Buns to Rival Any Bakery's\nDesserts\nChinese\nRolls & Buns",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/light-and-tender-chinese-lotus-seed-buns-recipe.webp?"
}