{
  "url": "https://www.seriouseats.com/chinese-steamed-whole-fish-new-year-recipe",
  "image_url": "https://www.seriouseats.com/thmb/anSyWirxWjeZtiLzb39qqO6LvLI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150213-steamed-fish-fermented-black-beans-garlic-shao-zhong-7-cdcd2bd69fb24195a0d935f2293caab6.jpg",
  "tags": [
    "Seafood Mains",
    "Chinese",
    "Stovetop Seafood",
    "Fish",
    "Easter"
  ],
  "title": "Chinese Steamed Whole Fish With Fermented Black Beans and Garlic",
  "full_text": "Chinese Steamed Whole Fish With Fermented Black Beans and Garlic\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n10 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nChinese fermented black beans\n, rinsed and patted dry\n1\nhead\ngarlic\n, peeled\n1\n(\n1- to 1 1/2-pound\n) whole white-fleshed fish, such as branzino, trout, red snapper, or\nsea bass\n, scaled and gutted\nKosher salt\nand ground white pepper\n13\nslices\nof fresh peeled\nginger\n,\n3\nleft\nwhole\nand\n10\njulienned\n, divided\n4\nmedium\nscallions\n,\n2\nhalved\nand\n2\ncut into\njulienne\n, divided\n1\nteaspoon\nsoy sauce\n2\ntablespoons\ncanola, vegetable, or\npeanut oil\n1\nbunch\nof\ncilantro\n, leaves and tender stems only, roughly chopped\n1/4\nteaspoon\nchile flakes\n, plus more to taste (optional)\nDirections\nCombine black beans and garlic cloves on a cutting board and roughly chop them together.\nRinse fish under cold running water and pat dry inside and out with paper towels. Sprinkle salt and white pepper all over fish, including inside cavity. Place 3 whole slices of ginger inside cavity.\nSet halved scallions on a heatproof plate large enough to hold the fish, while small enough to fit inside steamer. Set fish directly on top of scallions so that the scallions mostly keep fish from making direct contact with the plate.\nSet up a steamer and when it is ready, steam fish until cooked through, about 10 minutes. Carefully remove fish and plate from the steamer and pour off any accumulated juices into a bowl. Stir soy sauce into accumulated juices. Discard ginger slices from cavity of fish and scallions from underneath. Transfer fish to a serving platter.\nHeat a wok or saucepan over medium-high heat until a droplet of water evaporates rapidly when dropped onto the surface. Add oil and heat, swirling to coat wok, until shimmering. Add chopped garlic and fermented black bean mixture and cook, stirring until garlic is softened but not browned, about 1 minute. Add chile flakes, if using (add more if you want it spicier), remaining julienned scallions and ginger, cilantro, and the reserved accumulated cooking juices. Mix quickly until well combined, then spoon everything on top of the fish. Serve immediately.\nRead More\nA Guide to Celebrating the Chinese Lunar New Year at Home\n8 Lucky Foods to Ring in the Chinese New Year\nSeafood Mains\nChinese\nStovetop Seafood\nFish\nEaster",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chinese-steamed-whole-fish-with-fermented-black-beans-and-garlic.webp?"
}