{
  "url": "https://www.seriouseats.com/chinese-turnip-cake-recipe-8767303",
  "image_url": "https://www.seriouseats.com/thmb/6uJjVRIYFa1OLVdtheQ6SKXr9jE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Chinese_Turnip_Cake_With_Sausage_Bacon_and_Mushrooms_heroAntonisAchilleos-789c769465374683ae96c059c804e810.JPG",
  "tags": [
    "Lunar New Year",
    "Chinese"
  ],
  "title": "Celebrate Lunar New Year With This Savory Turnip Cake Rich in Tradition",
  "full_text": "Celebrate Lunar New Year With This Savory Turnip Cake Rich in Tradition\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nResting Time\n20 mins\nTotal\n2 hrs 5 mins\nServes\n8 servings\nMakes\n2 Cakes\nCook Mode\n(Keep screen awake)\nIngredients\n2\nounces\ndried shiitake mushrooms\n(58g; 1 3/4 cup), about 10 to 15 mushrooms\n3\npounds\n(1.3kg)\ndaikon radish\n, peeled and finely grated on a box grater\n1\ntablespoon\nplus\n2\nteaspoons\nbrown sugar\n, divided\n3\nounces\nChinese bacon\n(85g; 2/3 cup), such as lap yuk, diced, see note\n2\nChinese sausages\n(3 1/4 ounces; 100g), such as lap cheong, diced, see note\n1/4\ncup\nsmall dried shrimp\n(1 ounce; 28g), rinsed and patted dry, see note\n1\ntablespoon\n(15ml)\nsoy sauce\n8\nounces\nrice flour\n(227g; 2 1/4 cups)\nToasted sesame oil\n, for serving\n2\nscallions\n(1 ounce; 30g), white and light green parts only, chopped (about 1/4 cup)\nChopped\nfresh cilantro\n, for garnish\nToasted sesame seeds\n, for serving (optional)\nHoisin sauce\nand Sriracha, for serving\nDirections\nPlace dried shiitakes in a heatproof bowl and pour over enough hot water to cover. Soak until rehydrated and plump, about 30 minutes. Drain mushrooms, rinse under cold running water, and squeeze out excess water. Trim and discard stems and dice caps.\nSerious Eats / Antonis Achilleos\nSet a large pot, Dutch oven, or wok over medium heat and add grated daikon and 1/4 cup (60ml) water. Bring to a simmer, cover and cook, stirring occasionally, until daikon is slightly translucent, about 20 minutes. Stir in 1 tablespoon brown sugar until dissolved. Transfer everything to a bowl and set aside. Wipe Dutch oven or wok clean.\nSerious Eats / Antonis Achilleos\nIn the same Dutch oven or wok, add diced shiitakes, bacon, sausage, and dried shrimp. Cook, stirring, until bacon and sausage have rendered some fat, about 5 to 7 minutes. Add remaining 2 teaspoons brown sugar and the soy sauce and cook, stirring often, until liquid is evaporated, about 1 minute longer. Transfer everything to a bowl with the cooked daikon.\nSerious Eats / Antonis Achilleos\nAdd rice flour in thirds to the daikon mixture, mixing thoroughly between additions (make sure no traces of flour are left at the bottom). If flour mixture becomes too difficult to stir, stir in up to 2 tablespoons (30ml) water to loosen slightly; the final texture should be sticky and the mixture will be somewhat loose.\nSerious Eats / Antonis Achilleos\nScrape mixture into two 7- by 5-inch baking dishes (greased with cooking spray) or disposable aluminum baking trays. Set up a steamer large enough to hold one of the baking dishes, then, working 1 baking dish at a time, steam turnip cake until cooked through, 25 to 30 minutes. Repeat with remaining baking dish. Let cooked turnip cakes rest 20 minutes. Loosen the sides with an offset spatula or butter knife and turn it out onto a cutting board. Slice each cake into 9 even squares.\nSerious Eats / Antonis Achilleos\nHeat a large nonstick with 1 tablespoon oil over medium heat. Add cakes; cook, undisturbed, until golden brown and crisp, about 2 minutes per side. Transfer to a platter.\nSerious Eats / Antonis Achilleos\nDrizzle turnip cakes with sesame oil and top with chopped scallions, cilantro, and sesame oil, if using. Slice and serve with hoisin sauce and/or Sriracha on the side.\nSerious Eats / Antonis Achilleos\nSpecial Equipment\n2 (7- by 5-inch) baking dishes or disposable aluminum baking trays)\nNotes\nLap yuk\n(Chinese cured pork belly), Chinese sausage, and dried shrimp are available online and at Asian grocers.\nMake-Ahead and Storage\nOnce cooled, the turnip cake can be refrigerated in an airtight container for up to 2 days. The turnip cake can be tightly wrapped with plastic and frozen for up to 1 month. When ready to cook, let thaw in refrigerator overnight.\nThis Recipe Appears In\nHow to Make Savory Chinese Turnip Cakes (Law Bok Gow)\nA Guide to Celebrating the Chinese Lunar New Year at Home\nLunar New Year\nChinese"
}