{
  "url": "https://www.seriouseats.com/chinese-bean-curd-rolls-pork-dim-sum-recipe",
  "image_url": "https://www.seriouseats.com/thmb/o3KeaGqW0xND-JrSVuNhSK7RMPo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__08__20140828-bean-curd-roll-shao-zhong-20-219d3301e54048c49e5bf267bc407fec.jpg",
  "tags": [
    "Chinese",
    "Pork",
    "Mushrooms",
    "Shiitake Mushroom",
    "Wood Ear Mushrooms"
  ],
  "title": "Fu Pei Guen (Chinese Bean Curd Rolls) With Pork, Mushroom, and Ginger Recipe",
  "full_text": "Fu Pei Guen (Chinese Bean Curd Rolls) With Pork, Mushroom, and Ginger Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n30 mins\nResting Time\n30 mins\nTotal\n80 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork Filling:\n1/2\npound\nground pork\n1/4\nounce\ndried wood ear mushrooms\n, soaked in warm water until tender, then drained and chopped\n2\nteaspoons\nsesame oil\n1 1/2\nteaspoons\ncornstarch\n1\nteaspoon\nminced garlic\n(about\n1\nmedium\nclove\n)\n1\nteaspoon\nsoy sauce\n1\nteaspoon\nShaoxing wine\n1/2\nteaspoon\nminced peeled\nfresh ginger\n1/2\nteaspoon\nkosher salt\n1/2\nteaspoon\nsugar\nFor the Rolls:\n1\nounce\ndried shiitake mushroom\n, soaked in warm water until tender, then drained and thinly sliced\n1\nteaspoon\nsoy sauce\n1\nteaspoon\nsugar\n1\nteaspoon\ncornstarch\n3\nteaspoons\nvegetable\nor\npeanut oil\n, divided\n6\n(\n11- by 7-inch) sheets\ndried bean-curd skin\n(see notes)\n3 1/2\nounces\nenoki mushrooms\n1\nsmall\ncarrot\n, peeled and julienned\nFor the Sauce:\n1\ncup\nchicken stock\nor\nlow-sodium\nbroth, or\n1\ncup\nwater\nplus\n1\nteaspoon\nchicken bouillon powder\n1\nteaspoon\nShaoxing wine\n1\nteaspoon\nsoy sauce\n1\nteaspoon\noyster sauce\n1/2\nteaspoon\nminced garlic\n(about\n1\nsmall\nclove\n)\n1/2\nteaspoon\nsugar\n2\nteaspoons\ncornstarch\n1/4\ncup\nwater\n1\nteaspoon\nsesame oil\n2\nscallions\n, white and light green parts only,\njulienned\n, divided\nDirections\nFor the Pork Filling:\nIn a large bowl, add all the ingredients and mix well. Refrigerate at least 30 minutes or overnight.\nSerious Eats / Shao Z.\nFor the Rolls:\nIn a bowl, mix together shiitake mushrooms, soy sauce, sugar, cornstarch, and 1 teaspoon oil. Set aside in the refrigerator.\nFill a rimmed baking sheet about halfway with warm water. Working 1 sheet at a time, carefully immerse dried bean curd sheets until softened, about 1 minute. Stack rehydrated bean curd sheets on a paper towel-lined plate, separating each sheet with a layer of paper towels.\nSerious Eats / Shao Z.\nWorking one at a time, set 1 rectangular bean-curd sheet on a work surface. Spread 2 heaping tablespoons of pork filling about 2 inches from the top of the rectangle, leaving 1 inch of space on each side.\nSerious Eats / Shao Z.\nArrange a few enoki mushrooms on top of pork filling.\nSerious Eats / Shao Z.\nArrange a few strips of carrots on top of enoki mushrooms.\nSerious Eats / Shao Z.\nArrange a few slices of marinated shiitake mushrooms alongside carrots.\nSerious Eats / Shao Z.\nFold the top edge of the bean curd skin over the filling.\nSerious Eats / Shao Z.\nFold in the sides.\nSerious Eats / Shao Z.\nTightly roll the bean curd filling towards you, forming a neat roll. Set aside on a plate. Repeat with remaining bean curd sheets and fillings.\nSerious Eats / Shao Z.\nHeat remaining 2 teaspoons oil in a non-stick skillet. Working in batches, cook bean curd rolls, turning, until browned on both sides, about 4 minutes per batch. Transfer to a plate and let stand for 5 minutes.\nSerious Eats / Shao Z.\nCut rolls in half widthwise and transfer to a shallow dish that will fit in a steamer. Set aside.\nSerious Eats / Shao Z.\nFor the Sauce:\nIn a small saucepan, stir together chicken stock, Shaoxing wine, soy sauce, oyster sauce, minced garlic, and sugar. In a small bowl, stir together cornstarch with water. Bring chicken stock mixture to a simmer over medium-high heat, then stir in cornstarch mixture until sauce begins to thicken. Remove from heat and stir in sesame oil.\nSerious Eats / Shao Z.\nSet up a steamer. Pour sauce all over bean curd rolls. Scatter half of the scallions on top and steam until an instant-read thermometer registers 140 to 145°F (60-63°C) when inserted into the center of the rolls. Top rolls with remaining scallions and serve.\nSerious Eats / Shao Z.\nSpecial Equipment\nSteaming set up, such as a\nwok and bamboo steamer\n, or an improvised rack as pictured above;\nbaking dish\nNotes\nFresh bean curd skin can be hard to find, but the dried version works well here and is readily available at most Asian supermarkets.\nMake-Ahead and Storage\nYou can form and pan-fry the rolls a day in advance, then steam them the next day before serving.\nRead More\nHow to Throw a Dim Sum Party at Home\nWok Skills 101: Steaming\nBeancurd Sticks Broiled With Soy Sauce, Ginger, and Honey\nBeancurd Sticks Simmered With Chili Bean Paste\nChinese\nPork\nMushrooms\nShiitake Mushroom\nWood Ear Mushrooms"
}