{
  "url": "https://www.seriouseats.com/chipotle-garlic-and-cumin-fermented-hot-sauce",
  "image_url": null,
  "tags": [
    "Hot Sauces",
    "Dairy-free",
    "Gluten-free",
    "Vegan",
    "Vegetarian"
  ],
  "title": "Chipotle Fermented Hot Sauce With Garlic, and Cumin Recipe",
  "full_text": "Chipotle Fermented Hot Sauce With Garlic, and Cumin Recipe\nJump to recipe\nPrep\n20 mins\nFermentation Time\n240 hrs\nTotal\n240 hrs 20 mins\nServes\n48 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\nFor The Brine:\n3\ncups\n(\n720\nml\n)\nbottled\n, filtered, or distilled\nwater\n3\ntablespoons\n(\n30\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n2\nounces\n(\n55\ng\n)\ndried chipotle morita peppers\n(about\n20\nchile\npeppers\n), stems removed and peppers cut in half\n1 1/2\nounces\n(\n45\ng\n)\ngarlic\n(about\n6\nmedium\ncloves), thinly sliced\n2\nteaspoons\n(\n5\ng\n)\ncumin seeds\n, toasted in dry skillet until fragrant\nTo Finish the Hot Sauce:\n3/4\ncup\n(\n180\nml\n) distilled\nwhite vinegar\n1\ntablespoon\n(\n15\ng\n)\nsugar\nKosher salt\n1/8\nteaspoon\n(\n0.25\ng\n)\nxanthan gum\n(optional)\nDirections\nFor The Brine:\nIn a large bowl, whisk together water and salt until dissolved, at least 30 seconds. In a wide-mouth, 1-quart canning jar, add peppers, garlic, and cumin seeds. Pour brine into jar and stir gently to combine. Cover surface loosely with plastic wrap, ensuring full contact, and place a smaller lid on top of plastic. Seal jar with airlock lid following manufacturer's instructions.\nStore mixture in dark area away from sun and let ferment, maintaining an ambient temperature between 55°F (13°C) and 75°F (24°C) for 10 days; check mixture daily for signs of gas formation (this is a good sign). Starting on the 10th day, taste peppers or garlic daily until they taste sour like dill pickles; the total fermentation time can take anywhere from 10 to 28 days.\nFor The Sauce:\nDrain solids through fine-mesh strainer set over large nonreactive bowl; reserve liquid. You should have roughly 9 1/4 ounces (265g) solids. Transfer solids to a blender. Add 1 cup (240ml) reserved brine along with the vinegar and sugar. Discard remaining brine. Blend peppers on high speed until smooth and emulsified, 1 to 2 minutes. Season with salt. Measure sauce's pH using strips or pH-meter to ensure it is at or below a pH of 3.4; if it is too high, lower pH to 3.4 with more vinegar as needed.\nStrain blended sauce back through fine-mesh strainer set over bowl or large container, pressing on solids to extract as much liquid as possible; reserve solids for another use (see note).\nOptionally, if using xanthan gum: Rinse out blender jar. Transfer strained sauce back to blender. With blender running on high speed, slowly sprinkle in xanthan gum to avoid clumping; blend until mixture is slightly thickened, about 1 minute.\nTransfer strained hot sauce to glass bottles or jar, cover, and keep refrigerated until ready to use. Sauce can be refrigerated for up to 3 months.\nAbove photograph: Vicky Wasik. Process photographs: Tim Chin\nSpecial Equipment\n1-quart pickling jar, airlock, small fermentation weights or lids,\nhigh-speed blender\nNotes\nXanthan gum is optional in this recipe; the sauce will be slightly thinner in texture, but the flavor will be unchanged. If you want to guarantee successful fermentation, add two tablespoons of unpasteurized yogurt whey or leftover brine from previous fermentation into brine in Step 1.\nReserved strained solids from the fermentation can be stirred into soups and stews, incorporated into a compound butter, or dehydrated and used as a seasoning.\nMake-Ahead and Storage\nSauce can be refrigerated for up to 3 months.\nThis Recipe Appears In\nHow to Make Fermented Hot Sauce\nHot Sauces\nDairy-free\nGluten-free\nVegan\nVegetarian"
}