{
  "url": "https://www.seriouseats.com/chocolate-oreo-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/TIHHSzYffxJilgk77uGlPV_AD6g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/chocolate-oreo-cake-recipe-HERO-a6080fae715b4453b54800c69029e230.jpg",
  "tags": [
    "Layer Cake",
    "Cakes"
  ],
  "title": "Oreo Cake With Oreo Whipped Cream Frosting Recipe",
  "full_text": "Oreo Cake With Oreo Whipped Cream Frosting Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n25 mins\nActive\n45 mins\nChilling Time\n3 hrs 15 mins\nTotal\n4 hrs 20 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n1 1/2\ncups\nall-purpose flour\n(about\n7 1/2\nounces\n;\n212\ng\n)\n1/2\ncup\ncocoa powder\n(about\n1 1/2\nounces\n;\n42\ng\n)\n1 1/4\nteaspoons\nbaking soda\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt, use half as much by volume\n1\ncup\nplus\n4\ntablespoons\ngranulated sugar\n(about\n8 2/3\nounces\n;\n244\ng\n)\n1\ncup\nplus\n4\ntablespoons\nsour cream\n(about\n8 1/2\nounces\n;\n240\ng\n)\n2/3\ncup\n(\n160\nml\n)\nvegetable oil\n2\nlarge\neggs\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\nFor the Oreo Whipped Cream:\n50\nOreo\ncookies\n4 1/2\ncups\n(about\n1\nL\n)\nheavy cream\n2\ntablespoons\n(\n30\ng\n)\ngranulated sugar\n1\ntablespoon\n(\n15\nml\n)\nvanilla extract\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F (180°C).\nLine bottoms of two 9-inch cake pans with parchment paper\nand lightly coat the insides with non-stick pan spray. Sift flour, cocoa, baking soda, and salt into a large bowl; set aside. In a medium bowl, whisk together sugar, sour cream, oil, eggs, and vanilla until smooth.\nSerious Eats / Julia Hartbeck\nWhisk wet ingredients into dry ingredients until smooth. Divide batter evenly between prepared cake pans. Place pans together on one oven rack and bake until cake is just firm and toothpick inserted into center comes out with moist crumbs, about 25 minutes. If oven has uneven heat, pause to rotate the pans after about 12 minutes. Let cakes cool in pans for 15 minutes, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off the parchment, and return cakes right side up. Cool cakes completely on wire rack, about 1 hour.\nSerious Eats / Julia Hartbeck\nFor the Oreo Whipped Cream:\nCarefully cut 6 Oreo cookies in half; set aside. Chop remaining cookies into 1/4-inch pieces; set aside.\nSerious Eats / Julia Hartbeck\nIn the bowl of a stand mixer fitted with whisk attachment, whip 2 cups cream on medium-high speed until thick and fluffy. Transfer to a large bowl and place in refrigerator. In the same mixer bowl, whip remaining 2 1/2 cups cream, sugar, and vanilla until thick and fluffy. Using a flexible spatula, fold sweetened whipped cream into already whipped cream.\nSerious Eats / Julia Hartbeck\nTransfer 1 cup whipped cream to a small bowl and refrigerate until ready to decorate cake. Fold chopped Oreos into remaining whipped cream.\nSerious Eats / Julia Hartbeck\nTo Assemble the Cake:\nLevel cakes with a serrated knife (full directions\nhere\n) and set scraps aside for snacking. Place one layer on a heavy cast iron turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with about one-third of the Oreo whipped cream, using an offset spatula to spread it evenly from edge to edge. Top with second layer and then cover the top and sides of the cake with remaining Oreo whipped cream, spreading it as smoothly as you can (tutorial\nhere\n). Refrigerate cake to let cookies soften, about 2 hours.\nSerious Eats / Julia Hartbeck\nRe-whisk reserved whipped cream and transfer to a pastry bag fitted with star tip. Pipe 12 whipped cream rosettes around perimeter of cake and garnish with reserved Oreo cookie halves. Serve.\nSerious Eats / Julia Hartbeck\nSpecial Equipment\ntwo 9-inch cake pans,\nstand mixer\nNotes\nMake sure to only whip cream until thick and fluffy. Once the chopped Oreos soften, the cream will continue to thicken.\nLayer Cake\nCakes"
}