{
  "url": "https://www.seriouseats.com/chocolate-chip-meringue-cookies-recipe-8765371",
  "image_url": "https://www.seriouseats.com/thmb/W_IaOb_LlgO2uGj4pAhpAaT7d5w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20110630-159343-recipe-chocolate-chip-meringue-primary20120of201-7309a4bbe1c94b18a38e1922e1e93778.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Gluten-free",
    "Egg Whites"
  ],
  "title": "Chocolate Chip Meringue Cookies",
  "full_text": "Chocolate Chip Meringue Cookies\nClose\nJump to recipe\nPrep\n25 mins\nCook\n2 hrs\nCooling Time\n60 mins\nTotal\n3 hrs 25 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\negg whites\n(see notes)\n1/4\nteaspoon\ncream of tartar\n1/2\nteaspoon\nDiamond Crystal kosher\nsalt\n; for table salt, use half as much by volume\n1\ncup\n(200g) granulated\nsugar\n7\nounces\n(200g) high-quality\ndark chocolate\n, finely chopped\nDirections\nPreheat oven to 200°F (95ºC). Begin whipping egg whites in a stand mixer fitted with a whisk attachment on low speed. As the whites start to look wet and frothy, after about 45 seconds, add cream of tartar and salt and allow it to dissolve with the mixer still on low speed, about 10 seconds.\nWhile the whites are still frothy, slowly begin to add sugar in a steady stream with the mixer on low. Once you've added about 1/4 cup of the sugar, increase speed to medium and continue to gradually add sugar as the mixer runs.\nOnce all the sugar has been added, increase speed to high and whisk until meringue is thick and glossy and holds firm peaks when you lift the whisk out of it, about 4 minutes. If it's not there yet, continue to whip meringue on high speed at 30-second intervals and test again.\nOnce the meringue is at firm peak stage, spoon a tiny dot of it onto each of the 4 corners of a baking sheet and press the parchment paper liner down over it. This will anchor the parchment paper.\nCarefully fold chocolate into meringue with a rubber spatula, taking care not to deflate it.\nSpoon 1 1/2-inch to 2-inch dollops of meringue mixture onto baking sheet, spaced 1 inch apart. Try to shape meringues with a spoon so they have crags and ridges all over.\nBake until meringues harden on the outside, develop cracks, and are only slightly moist on the inside, about 2 hours (this can vary widely depending on your oven). To test for doneness, remove one meringue, allow to cool at room temperature for 5 minutes, then break open to check texture. The center should only be slightly moist at this point.\nAllow meringues to cool on a wire rack. Allow them to cool for at least 1 hour (see notes) in a dry place before storing them in a container with the lid left only partially on. Moisture and humidity will cause them to melt, so try to use them soon after baking.\nSpecial Equipment\nStand mixer\n, parchment paper\nNotes\nFor a real treat, serve the meringues 20 minutes after removing from the oven while the chocolate is still warm.\nCookies\nBaking\nGluten-free\nEgg Whites",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chocolate-chip-meringue-cookies.webp?"
}