{
  "url": "https://www.seriouseats.com/chocolate-ice-cream-bon-bon-recipe",
  "image_url": "https://www.seriouseats.com/thmb/QLT9IfNBZ2zfYMJCKNRLSAPbQoI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130729-260987-chocolate-icecream-bonbons-1fa521da06fe4b37bd4f7359c714c199.jpg",
  "tags": [
    "Ice Cream",
    "Chocolate"
  ],
  "title": "Chocolate Ice Cream Bon Bons",
  "full_text": "Chocolate Ice Cream Bon Bons\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n30 mins\nFreezing Time\n105 mins\nTotal\n2 hrs\nServes\n24 bon bons\nCook Mode\n(Keep screen awake)\nIngredients\n1\npint\nchocolate ice cream\n, or your favorite flavor (see note)\n12 to 16\nounces\nbittersweet chocolate\n, finely chopped, divided (see note)\nDirections\nUsing a baking sheet or plate that will fit in the freezer, line with parchment paper and chill in freezer for 30 minutes. Scoop rounded tablespoons of ice cream onto prepared pan and freeze until firm, about 1 hour. If desired, re-roll into round balls and re-freeze until completely firm, about 30 minutes.\nPlace the chocolate in a heatproof bowl set over a pan of barely simmering water (see note). Melt, gently stirring, until smooth. Transfer melted chocolate to a mug.\nWorking quickly, dip ice cream balls into the chocolate, one at a time, and set back onto lined pan. Freeze until chocolate is set, about 15 minutes.\nNotes\nFor the easiest handling, use a good quality, dense ice cream. Fluffy ice creams that are full of air will melt too quickly when dipped into the chocolate.\nYou may not need the full 16 ounces of chocolate to dip the balls. I call for that much to ensure that you'll have enough. Any unused melted chocolate can be reserved for another use.\nChocolate can also be melted in the microwave using 50 percent power, checking and stirring every 30 seconds until melted. If making ahead, store dipped balls between layers of parchment in an airtight container.\nMake-Ahead and Storage\nStore bon bons for up to 3 days in the freezer, nestled between sheets of parchment in an airtight container.\nRead More\nHomemade Klondike Bars Recipe\nThe Darkest Dark Chocolate Ice Cream Recipe\nHomemade Strawberry Shortcake Ice Cream Bars Recipe\nVanilla Ice Cream Sandwiches Recipe\nIce Cream\nChocolate"
}