{
  "url": "https://www.seriouseats.com/chocolate-mousse-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zr4LvXeQRdtHfFFWhbeTgktRAGo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121214-233784-chocolate-mousse-cake.1-e1d0835bd7294589ae56376640645928.jpg",
  "tags": [
    "Cakes",
    "Baking",
    "Chocolate"
  ],
  "title": "Chocolate Mousse Cake Recipe",
  "full_text": "Chocolate Mousse Cake Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nActive\n90 mins\nCooling and Chilling Time\n3 hrs 40 mins\nTotal\n4 hrs 40 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\n(\n3 3/4\nounces\n)\nall-purpose flour\n1/3\ncup\n(\n3/4\nounce\n)\ncocoa powder\n3/4\nteaspoon\nbaking soda\n1/2\ncup\nplus\n2\ntablespoons\n(about\n4 1/3\nounces\n)\npacked light brown sugar\n2/3\ncup\nsour cream\n1/3\ncup\nvegetable oil\n1\nlarge\negg\n1\nteaspoon\ninstant espresso powder\n2\nteaspoons\npure vanilla extract\n, divided\n1/4\nteaspoon\nsalt\n1/3\ncup\n(\n2 1/3\nounces\n)\ngranulated sugar\n3\nlarge\negg yolks\n2 3/4\ncups\nplus\n2\ntablespoons\nheavy cream\n, cold, divided\n20\nounces\nbittersweet chocolate\n, finely chopped, divided\n4\nounces\nsemisweet chocolate\n, finely chopped\nConfectioners' sugar\nfor dusting cake\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (180°C). Line a 9-inch springform pan with parchment and spray with nonstick pan spray.\nSift flour, cocoa, and baking soda in a small bowl; set aside. In a medium bowl, whisk brown sugar, sour cream, oil, egg, espresso powder, 1 teaspoon vanilla, and salt until combined. Whisk in dry ingredients until smooth.\nSpoon batter into prepared pan and bake until just firm and a toothpick inserted into center comes out clean, 17 to 19 minutes. Transfer pan to wire rack to cool 20 minutes, then remove cake from pan to cool completely, about 1 hour.\nIn a small bowl, whisk granulated sugar with yolks. In a medium saucepan over medium heat, bring 1/2 cup cream to simmer. Slowly whisk hot cream into egg mixture, then return entire mixture to saucepan. Cook over medium-low heat, stirring, until mixture just thickens, about 1 minute. Whisk in 1 teaspoon vanilla and 12 ounces bittersweet chocolate until smooth. Transfer to a large bowl and let cool to room temperature, about 45 minutes.\nUsing a stand mixer or hand mixer fitted with whip attachment, whip 1 1/2 cups cream to medium peak. Fold 1/3 of whipped cream into cooled chocolate mixture until combined and smooth. Fold in remaining whipped cream just until no white streaks remain.\nLine bottom and sides of springform pan with plastic wrap. When cake is cool, slice into two layers. Place one layer into bottom of pan. Fill with mousse and smooth top. Place second layer on top and gently press to adhere. Cover and chill until set, at least 3 hours.\nPlace remaining 8 ounces bittersweet chocolate in a medium bowl. In a small saucepan, heat remaining 3/4 cup plus 2 tablespoons cream until simmering. Pour over chocolate and let sit 5 minutes. Whisk until smooth.\nRemove sides of springform pan and invert cake onto a large plate. Peel off plastic wrap and replace bottom of springform pan. Invert onto wire rack and set rack into rimmed baking sheet. Pour ganache over cake, allowing it to drip over sides. Chill until set, about 30 minutes. Using an offset spatula, spread any remaining ganache around the sides of cake.\nMelt semi-sweet chocolate in microwave or in pan over bowl of barely simmering water. Spread chocolate onto back of flat baking sheet (chocolate should be spread very thin). Chill briefly until just set.\nHolding bench scraper at 45-degree angle, scrape 2 to 3-inch wide strips of chocolate until it forms a curl. If chocolate is breaking, it is too cold; let it warm up slightly (see notes). Place curls on cake and dust with confectioners' sugar. Allow cake to warm up slightly at room temperature before serving for the creamiest texture and best chocolate flavor.\nSpecial Equipment\n9-inch springform pan,\nstand mixer\nor\nhand mixer\nNotes\nIf chocolate is not forming nice curls, simply make large shards to decorate cake.\nMake-Ahead and Storage\nThis cake is easiest if made over the course of 2 days. Bake the cake and fill with mousse the first day; cover with ganache the second. Chocolate curls can be made ahead and kept wrapped and stored in a cool, dry, place.\nRead More\nBaked Chocolate Mousse Cake\nNo-Bake Chocolate Pumpkin Mousse Pie\nThe Best Chocolate for Baking\nCakes\nBaking\nChocolate"
}