{
  "url": "https://www.seriouseats.com/chocolate-shortbread-sandwich-cookies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/NVT1BpP-ZWGi2pgvtpsgXtrxkJw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__11__20121122-231051-Chocolate-Shortbread-Sandwich-Cookies.1-67d0bfed33c54d21ad0de3d0672b70f7.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Chocolate"
  ],
  "title": "Chocolate Shortbread Sandwich Cookies Recipe",
  "full_text": "Chocolate Shortbread Sandwich Cookies Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nActive\n30 mins\nCooling Time\n40 mins\nTotal\n85 mins\nMakes\n18\nto 24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nbittersweet chocolate\n, finely chopped (see note)\n3/4\ncup\nheavy cream\n2/3\ncup\n(\n2 2/3\nounces\n) plus\n1\ntablespoon\nconfectioners sugar\n, divided\n16\ntablespoons\n(\n8\nounces\n)\nunsalted butter\n, softened\n1/2\ncup\n(\n3 1/2\nounces\n)\ngranulated sugar\n1/2\nteaspoon\npure vanilla extract\n1/4\nteaspoon\nsalt\n2\ncups\n(\n10\nounces\n)\nall purpose flour\n1/2\ncup\n(\n1 1/2\nounces\n)\ncocoa powder\nDirections\nPlace chocolate in medium bowl. Heat cream in small saucepan over medium heat until simmering. Pour over chocolate and let sit 5 minutes. Add 1 tablespoon confectioners' sugar, whisk until smooth, then chill until set, about 1 hour.\nIn stand mixer fitted with paddle attachment, mix remaining 2/3 cup confectioners' sugar, butter, granulated sugar, vanilla, and salt on medium low speed until creamy. Mix in flour and cocoa until completely combined. Wrap dough in plastic wrap, forming a 6-inch disc and chill until firm, about 30 minutes.\nAdjust oven racks to medium low and medium high positions. Preheat oven to 350°F (175°C). Line two rimmed baking sheets with parchment paper.\nDivide dough in half. On lightly floured surface, roll dough to 1/8-inch thick. Cut out cookies with cutter (see note) and place evenly on baking sheets. Cut centers out of half of the cookies (see note). Bake until firm, 10 to 12 minutes, rotating pans from top to bottom and front to back halfway through baking. Let cool 5 minutes on pans, then transfer cookies and parchment to cooling rack to cool completely before filling. Repeat with any remaining dough.\nPlace pastry tip in pastry bag and fill bag with chocolate mixture. Pipe a thin layer onto each of the cookie bottoms. Sandwich together with the top cookies and serve. See note.\nSpecial Equipment\nStanding mixer, 2 rimmed baking sheets, cookie cutter, pastry bag, pastry tip\nNotes\nFor best flavor, use a good quality bittersweet chocolate.\nAny size or shape cookie cutter will work here. I used a 2 1/2-inch cutter.\nThe wide end of a pastry tip is useful to stamp the centers from the top cookies.\nFor extra chocolate appeal, dunk the cookie in melted chocolate.\nCookies\nBaking\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chocolate-shortbread-sandwich-cookies-recipe.webp?"
}