{
  "url": "https://www.seriouseats.com/chocolate-american-buttercream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LsEyrEw-3ybQ0tULhFv3238Cg8g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__02__20181220-chocolate-american-buttercream-frosting-vicky-wasik-9-451f5b91df9d41ad9d6f223bde7dfc52.jpg",
  "tags": [
    "Desserts",
    "American",
    "Gluten-free Desserts",
    "Chocolate"
  ],
  "title": "American-Style Chocolate Buttercream Recipe",
  "full_text": "American-Style Chocolate Buttercream Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n5 mins\nActive\n15 mins\nCooling Time\n30 mins\nTotal\n50 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\nheavy cream\n(about\n1/2\ncup\n;\n115\ng\n), straight from the fridge\n4\nounces\nfinely chopped\ndark chocolate\n(not chips),\naround 72%\n(about\n2/3\ncup\n;\n115\ng\n)\n12\nounces\nunsalted butter\n(\n3\nsticks\n;\n340\ng\n), softened to about 65°F (18°C)\n9\nounces\norganic powdered sugar\n(about\n2 1/4\ncups\n, spooned;\n255\ng\n), preferably tapioca-based, such as Wholesome (see notes)\n3\nounces\nhigh-fat\nDutch cocoa powder\n(about\n1\ncup\n, spooned;\n85\ng\n)\n2\nteaspoons\nvanilla extract\n, plus more to taste\n3/4\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for table salt, use about half as much by volume or the same weight\n3/4\nteaspoon\ninstant espresso powder\n, plus more to taste\nDirections\nIn a small saucepan, bring cream to a simmer. Off heat, add chopped chocolate and whisk until smooth. Set aside and cool to approximately 75°F (24°C). This can be done slowly by letting the mixture cool down over time in the saucepan, or sped up by transferring the ganache to a wide, shallow container to increase its surface area; the faster method will cool the ganache in about 30 minutes.\nSerious Eats / Vicky Wasik\nPlace butter in the bowl of a stand mixer, then sift powdered sugar and Dutch cocoa on top to ensure no lumps of either remain in the frosting. Fit stand mixer with a paddle attachment and mix on low until dry ingredients are fully incorporated.\nSerious Eats / Vicky Wasik\nAdd vanilla, salt, and espresso powder, then increase speed to medium and beat until frosting is creamy and smooth, pausing along the way to scrape bowl and beater as needed. This will take about 6 minutes, although the exact timing will vary depending on the power of the mixer and the temperature of the ingredients.\nSerious Eats / Vicky Wasik\nReduce speed to medium-low and add ganache. Once ganache is fully incorporated, pause to scrape bowl and beater with a spatula, then resume mixing a few seconds longer to ensure the frosting is homogeneous. Extending the beating time can create a lighter, paler frosting with a higher yield, while reduced beating can create a denser, darker frosting with a lower yield; which you choose depends on your personal preference. At this stage, the buttercream can be doctored to taste with additional salt, vanilla, or instant espresso powder.\nSerious Eats / Vicky Wasik\nUse buttercream right away or transfer to a large zipper-lock bag, press out air, and seal. The buttercream can be refrigerated for up to 2 weeks or frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Bring buttercream to approximately 72°F (22°C) and re-whip before use; see the troubleshooting guide below for tips on adjusting its consistency.\nTroubleshooting:\nIf too cold, the frosting may seem stiff, greasy, or curdled; to fix, melt 1/4 cup frosting until liquid, then return it to the bowl and re-whip. Conversely, if too warm, the frosting may seem soft, loose, or runny; to fix, refrigerate the bowl of frosting for 10 minutes, then re-whip. It can take time to achieve the right temperature and consistency, but it gets easier with practice.\nSpecial Equipment\nStand mixer\n,\nnonreactive fine-mesh strainer\n,\nflexible spatula\nNotes\nIf you don't have organic powdered sugar on hand, conventional powdered sugar will be fine; just add 1/2 teaspoon plain, unsulfured molasses\n(not blackstrap)\nalong with the salt and vanilla to create a similar depth of flavor. Check out our guide to the\ndifferences between conventional and organic powdered sugar\nfor more detail.\nMake-Ahead and Storage\nIn a large zipper-lock bag, the buttercream can be refrigerated for up to two weeks or frozen for up to several months.\nRead More\nCreamy Eggless Chocolate Frosting\nChocolate Swiss Buttercream\nChocolate Cake with Whipped Ganache Frosting\nThe World of Buttercreams: 6 Varieties to Try at Home\nDesserts\nAmerican\nGluten-free Desserts\nChocolate"
}