{
  "url": "https://www.seriouseats.com/chocolate-chip-cookies-for-1-recipe-8765082",
  "image_url": "https://www.seriouseats.com/thmb/atYtQ51fpqI9gBbdxcXU3lS2xn8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241219-SEA-OneBowlChocolateChipCookies-AmandaSuarez-Step-32-09a16f2eefc44059a9f6168b6e4b477a.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Baking"
  ],
  "title": "Perfect Crispy and Chewy Chocolate Chip Cookies for 1 in 20 Minutes",
  "full_text": "Perfect Crispy and Chewy Chocolate Chip Cookies for 1 in 20 Minutes\nClose\nJump to recipe\nPrep\n12 mins\nCook\n8 mins\nCooling Time\n10 mins\nTotal\n30 mins\nServes\n1\nMakes\n2 Cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1/4 cup\nall-purpose flour\n(1.125 ounces;\n32\ng\n)\n1/8\nteaspoon\nbaking soda\n1/8\nteaspoon\nkosher salt\n2 tablespoons (\n28\ng)\nunsalted butter,\nmelted and cooled slightly\n3\ntablespoons\n(44g) packed\nbrown sugar\n1\nlarge\negg yolk\n1/8\nteaspoon\nvanilla extract\n2\ntablespoons\nmilk or\ndark chocolate chips\nor chopped chunks\nDirections\nIn a small bowl, using a small whisk or fork, whisk flour, baking soda, and salt together. In a medium bowl, whisk butter and sugar vigorously until sugar is fully dissolved, about 1 minute. Vigorously whisk egg and vanilla into butter mixture until fully combined and mixture is glossy, about 1 minute. Using a rubber spatula or spoon, stir flour mixture into butter mixture until just combined, then stir in chocolate chips. Cover and refrigerate for 5 to 10 minutes, until batter is slightly thickened. Using wet hands, divide dough into 2 equal portions and roll into balls.\nSerious Eats / Amanda Suarez\nTo Bake in a Toaster Oven or Standard Oven:\nWhile dough rests, adjust toaster oven or oven rack to middle position and heat oven to 325℉ (160℃). Line a small rimmed baking sheet (quarter sheet pan) with parchment paper. Place dough balls on prepared sheet, spaced about 2 inches apart. Bake until edges of cookies are set and beginning to brown but centers are still soft and puffy, 8 to 12 minutes. Let cool on sheet pan for 10 minutes. Serve.\nSerious Eats / Amanda Suarez\nTo Bake in an Air Fryer:\nPreheat air fryer at 325℉ (160℃) for 3 minutes. Cut an 8-inch by 4-inch parchment rectangle and center it in the preheated air-fryer basket. Set dough balls on the parchment paper, spaced apart close to the perimeter of parchment paper (this ensures the parchment won’t flap over the cookie edges while baking). Bake at 325℉ (160℃) until edges of cookies are set and beginning to brown but centers are still soft and puffy, 6 to 10 minutes. Let cool on parchment for 10 minutes. Serve.\nSpecial Equipment\nSmall rimmed baking sheet, parchment paper\nMake-Ahead and Storage\nCookies can be stored in an airtight container at room temperature for up to 7 days.\nCookies\nThe Latest\nBaking"
}