{
  "url": "https://www.seriouseats.com/chocolate-angel-food-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/SsLlWuOpNCw6uK62xS5Q8olb8HI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__01__20130104-235734-chocolate-angel-food-cake.1-fd81d3e7e4954c568a106e36f04a5b59.jpg",
  "tags": [
    "Cakes"
  ],
  "title": "Chocolate Angel Food Cake Recipe",
  "full_text": "Chocolate Angel Food Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nActive\n15 mins\nCooling Time\n4 hrs 5 mins\nTotal\n5 hrs 5 mins\nServes\n10\nto 12 servings\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n3\nounces\n)\ncocoa powder\n, divided\n1 3/4\ncups\n(\n12 1/4\nounces\n)\ngranulated sugar\n, divided\n1\ncup\n(\n4\nounces\n)\ncake flour\n2\nteaspoons\ninstant espresso\n1/4\nteaspoon\nsalt\n1/2\ncup\nboiling\nwater\n1\ntablespoon\nzest\nfrom\n1\norange\n15\nlarge\negg whites\n3/4\nteaspoon\ncream of tartar\n1\norange\n, sliced thin for garnish\nDirections\nAdjust oven rack to lower-middle position and preheat oven to 350°F (175°C). Sift 1/2 cup cocoa, 3/4 cup sugar, and flour into a medium bowl; set aside.\nPlace remaining cocoa, espresso powder, and salt in large bowl. Stir in boiling water and orange zest until smooth; set aside.\nIn a standing mixer fitted with whip attachment, beat egg whites on medium speed until frothy. Add cream of tartar and continue to beat until whites are beginning to turn opaque, about 1 minute. Increase speed to medium-high and slowly add remaining cup sugar. Continue to beat until meringue forms stiff but not dry peak, 3 to 5 minutes.\nWhisk about 1 cup meringue into cocoa and water mixture to lighten (see notes). In 3 stages, gently fold in remaining whites. Sift 1/3 flour mixture onto meringue and gently fold in. In 2 additions, sift and fold remaining flour mixture into batter until combined, taking care not to deflate egg whites.\nGently spoon batter into pan (see notes). Bake until cake is puffed, just set, and toothpick inserted into center comes out clean, about 40 minutes.\nSet pan on wire rack for 5 minutes, then invert pan onto wire rack so that cake can completely cool in pan upside-down, about 4 hours (see notes). Run knife along inside of pan and invert cake onto serving plate to serve. Serve with orange slices.\nSpecial Equipment\n10-inch or 15 cup tube pan, standing mixer\nNotes\nAs you stir in the first amount of beaten egg whites into the bloomed chocolate mixture, make sure it's smooth before continuing. Take care not to deflate the egg whites as you fold into the batter.\nDo not grease the pan. The cake needs to grab onto the sides to rise properly.\nTake care inverting the pan upside down. Don't set the pan on a wine bottle—my cake fell out that way.\nCakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chocolate-angel-food-cake-recipe.webp?"
}