{
  "url": "https://www.seriouseats.com/chocolate-pastry-cream",
  "image_url": "https://www.seriouseats.com/thmb/sHF5RIq5ngahzSSWRBunJhXnJFM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201210-chocolate-pastry-cream-vicky-wasik-14-12a43b9bf93847598bc68fb24cf1d6f9.jpg",
  "tags": [
    "Pastries",
    "Chocolate",
    "Desserts"
  ],
  "title": "Chocolate Pastry Cream Recipe",
  "full_text": "Chocolate Pastry Cream Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n20 mins\nChilling Time\n2 hrs 30 mins\nTotal\n2 hrs 50 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\ngranulated sugar\n(\n1/2\ncup\n;\n115\ng\n), plain or\ntoasted\n1\nounce\n(\n3\ntablespoons\n;\n30\ng\n)\ncornstarch\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nground cinnamon\n(see notes)\nYolks\nfrom\n4\nlarge\neggs\n, straight from the fridge (\n2 1/2\nounces\n;\n70\ng\n)\n2\ncups\n(\n455\ng\n)\nwhole milk\n4\nounces\ndark chocolate\n, about\n70%\n, chopped (\n3/4\ncup\n;\n115\ng\n)\n1\nounce\nunsalted butter\n(\n2\ntablespoons\n;\n30\ng\n), cut into 1/2-inch cubes\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\nDirections\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nIn a 2-quart stainless steel saucier, whisk together sugar, cornstarch, salt, and cinnamon. Whisk in egg yolks, followed by the milk, until well combined.\nCook over medium heat, whisking constantly, until pastry cream begins to thicken, about 8 minutes. Once it thickens, continue to whisk, pausing every few seconds to check for bubbles, about 1 minute. When it begins to bubble, set a timer and continue whisking for 1 minute. This step is important to neutralize starch-dissolving protein found in egg yolks.\nOff-heat, whisk in chocolate, butter, and vanilla extract until chocolate and butter have melted and all ingredients are thoroughly combined. Strain pastry cream through a fine-mesh strainer set over a medium heatproof bowl. Immediately place plastic wrap or buttered parchment paper directly on the surface of the cream to prevent skin from forming. Transfer bowl to prepared ice bath to chill for 30 minutes, then refrigerate until cold, about 2 hours.\nWhen you are ready to use the pastry cream, whisk until smooth.\nSpecial Equipment\n2-quart stainless steel saucier,\nballoon whisk\n,\nfine-mesh strainer\nNotes\nIf you have cinnamon sticks instead of ground cinnamon, you can steep it with the milk. To do this, follow the steps for\nvanilla pastry cream\nbut substitute 1 cinnamon stick for the vanilla bean; follow the vanilla pastry cream recipe's instructions for whisking the hot milk into the eggs, then proceed with Step 3 of this recipe.\nMake-Ahead and Storage\nPastry cream can be refrigerated in an airtight container with plastic wrap or buttered parchment paper placed directly on the custard's surface for up to 3 days.\nPastries\nChocolate\nDesserts"
}