{
  "url": "https://www.seriouseats.com/chocolate-souffle-cake-how-to-make-technique-recipe",
  "image_url": null,
  "tags": [
    "Chocolate",
    "Desserts",
    "Custards, Mousses & Puddings"
  ],
  "title": "Chocolate Soufflé",
  "full_text": "Chocolate Soufflé\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n45 mins\nTotal\n40 mins\nServes\n8 soufflés\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Ramekins:\nSoftened\nunsalted butter\n, for greasing\nthe ramekins\n(approximately\n3\ntablespoons\n)\nGranulated sugar\n, for coating ramekins (approximately\n3\ntablespoons\n)\nFor the Soufflés:\n2 1/2\nounces\n(about\n1/4\ncup;\n70\ng\n)\nheavy cream\nand/or whole milk\n1 3/4\nounces\n68-71%\ndark chocolate\n, chopped (about\n1/3\ncup\n;\n50\ng\n)\n1 3/4\nounces\nunsweetened chocolate\n, chopped (about\n1/3\ncup\n;\n50\ng\n)\n1 3/4\nounces\n(\n1/2\ncup\n;\n50\ng\n)\nDutch process cocoa powder\n3 1/2\nounces\n(scant\n1/2\ncup\n;\n100\ng\n)\nwater\n1\nteaspoon\nvanilla extract\nWhites\nfrom\n8\nlarge\neggs\n, straight from the fridge (\n8 3/4\nounces\n;\n250\ng\n)\n3 1/2\nounces\n(\n1/2\ncup\n;\n100\ng\n)\ngranulated sugar\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nDirections\nPreheat oven to 400°F (205°C) with the convection fan turned off and oven rack in center position. Liberally butter the interiors of eight 4-ounce ramekins, making sure to butter right up to the upper edge of the rim of each ramekin. Sugar the buttered insides evenly, tapping out excess, and set ramekins aside.\nPlace 2 1/2 cups water in a 3-quart sauce pan on the stove over medium heat. In a large, heat-proof bowl that will sit comfortably on the pot without toppling over or touching the water below, combine cream and/or milk, dark chocolate, and unsweetened chocolate. Whisk gently until chocolate is melted, cream and/or milk are fully incorporated, and a smooth ganache has formed.\nSerious Eats / Vicky Wasik\nTurn off heat, then carefully whisk in cocoa powder, water, and vanilla extract until smooth. Leave bowl atop pot of hot water, off the heat, to keep the ganache warm.\nSerious Eats / Vicky Wasik\nIn the bowl of a stand mixer fitted with the whisk attachment, beat egg whites on high speed until they become foamy, about 20 seconds. Reduce mixer speed to medium and gradually add sugar and salt, then return to high speed and whisk the egg white mixture until firm, glossy, smooth peaks form, about 2 minutes.\nSerious Eats / Vicky Wasik\nUsing a silicone spatula, stir about 1/4 of the egg whites into the chocolate ganache until thoroughly incorporated, to lighten it. Then gently but thoroughly fold in the remaining egg whites, taking care not to deflate the mixture, until no visible whites remain. As soon as there are no more unincorporated whites, spoon soufflé mixture into prepared ramekins just to the top, then even the tops with an offset spatula. (You may prepare soufflés up to this point, and bake later; see note.)\nSerious Eats / Vicky Wasik\nEvenly space ramekins on a rimmed baking sheet and bake in the center of the oven for 12 minutes for soufflés that are wet on the inside, or 13 to 14 minutes for ones that are drier. The soufflés will have risen tall above the rims of the ramekins and look dry on top. Serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nEight 4-ounce\nramekins\n, 3-quart stainless steel\nsauce pan\n,\nwhisk\n,\nstand mixer\n,\nsilicone spatula\n,\noffset spatula\n,\nrimmed baking sheet\nNotes\nTo achieve the ideal level of richness, we prefer an equal mix of heavy cream and whole milk, but the recipe will work with one or the other (the richness will vary accordingly).\nMake-Ahead and Storage\nIf you choose to prepare the soufflés in advance: After filling each prepared ramekin with the soufflé mixture, wrap each ramekin with plastic and refrigerate for up to one day. When ready, preheat the oven and bake the soufflés, straight from the fridge, for 15 minutes, then serve immediately.\nRead More\nQuick & Easy Pumpkin-Maple Breakfast Soufflés Recipe\nSavory Cheese Soufflé Recipe\nExtra Large, Cage-Free, and More: How to Shop for Eggs\nChocolate\nDesserts\nCustards, Mousses & Puddings"
}