{
  "url": "https://www.seriouseats.com/chocolate-cherry-layer-cake-recipe",
  "image_url": null,
  "tags": [
    "Cakes",
    "Layer Cake",
    "Chocolate",
    "Cherry",
    "Easter Desserts"
  ],
  "title": "Chocolate Cherry Layer Cake Recipe",
  "full_text": "Chocolate Cherry Layer Cake Recipe\nJump to recipe\nPrep\n25 mins\nCook\n25 mins\nActive\n30 mins\nCooling Time\n45 mins\nTotal\n95 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cakes:\n4 1/2\nounces\nall-purpose flour\n, such as Gold Medal (about\n1\ncup\n, spooned;\n125\ng\n)\n4\nounces\nhigh-fat\ncocoa powder\n, natural or Dutch (about\n1 1/3\ncups\n;\n115\ng\n)\n8\nounces\nsugar\n(about\n1\ncup\nplus\n2\ntablespoons\n;\n225\ng\n)\n2\nteaspoons\n(\n10\nml\n) pure\nvanilla extract\n1 1/2\nteaspoons\nbaking soda\n3/4\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\n1/2\nteaspoon\ncinnamon\n1/4\nteaspoon\nalmond extract\n4\nlarge\neggs\n, straight from the fridge (about\n7\nounces\n;\n200\ng\n)\n6\nounces\nneutral\noil\n, such as\nsafflower\nor sunflower (about\n3/4\ncup\nplus\n2\ntablespoons\n;\n170\ng\n)\n6\nounces\npure,\nunsweetened tart cherry juice\n(\n3/4\ncup\n;\n170\ng\n) (see note)\nFor the Cherry Whipped Cream:\n2\nounces\nfreeze-dried cherries\n(about\n1\ncup\n;\n55\ng\n), plus more for garnishing (see note)\n3 1/2\nounces\nsugar\n(about\n1/2\ncup\n;\n100\ng\n)\n24\nounces\nheavy cream\n(\n3\ncups\n;\n680\ng\n)\n1/8\nteaspoon\nalmond extract\n, optional\nDirections\nFor the Cakes:\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Lightly grease two 8-inch anodized aluminum cake pans and line with parchment (explanation and tutorial\nhere\n). Sift flour and cocoa together to combine. In the bowl of a stand mixer fitted with a whisk attachment, combine sugar, vanilla extract, baking soda, salt, cinnamon, almond extract, and eggs. Whip on medium-high until foamy and light, about 5 minutes, then drizzle in oil. Reduce speed to low and add tart cherry juice, followed by sifted flour/cocoa mixture. When mixture is well combined, divide between prepared cake pans, adding about 17 3/4 ounces (505g) to each. Bake until puffed and firm, about 22 minutes; a toothpick inserted into the center of a cake will leave a few crumbs attached. Cool cakes in their pans until no trace of warmth remains, about 45 minutes.\nSerious Eats / Vicky Wasik\nFor the Cherry Whipped Cream:\nIn the bowl of a food processor, grind freeze-dried fruit and sugar until powdery and fine, about 90 seconds. Add cream and almond extract (if using), and stir with a fork to ensure no dry pockets of sugar/fruit are stuck in the corners, then pulse until thick and creamy like Greek yogurt, about 5 minutes. The time will vary with the horsepower of your machine, so watch it like a hawk to avoid making fruity butter by mistake. Cover with plastic and refrigerate until needed.\nSerious Eats / Vicky Wasik\nTo Assemble the Cake:\nUsing a serrated bread knife, trim the dome from each cake so that the layers stack neatly and can absorb moisture from the cream. Place 1 cake (cut side up) on a serving plate, cake stand, or cast iron turntable. Top with 1 cup cherry whipped cream and spread into an even layer with an offset spatula. Place second cake (cut side down) on top. Smooth cream around sides, then wipe spatula clean. Spread another cup of cherry whipped cream in an even layer on top of cake, then use remaining whipped cream to generously cover sides and decorate by swirling cream with the back of a spoon. If you like, sprinkle with freeze-dried cherries just before serving.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand-mixer\n, two 8-inch by 2- or 3-inch\nanodized aluminum cake pans\n,\nfood processor\n,\nserrated knife\n,\ncast iron turntable\n(optional),\noffset spatula\nNotes\nThis recipe works well with many different combinations of tart juice and freeze-dried fruit, so don't be afraid to branch out if you can't find (or don't like) cherry. Tart fruits, like black currant, blueberry, and cranberry, pair well with chocolate, so look for them in juiced and freeze-dried form.\nMake-Ahead and Storage\nUnder a cake dome or loosely wrapped in plastic, the cake will keep up to 24 hours at room temperature. Alternatively, the cake can be wrapped in plastic and refrigerated up to 3 days, then brought to room temperature to serve.\nRead More\nDouble-Strawberry Cake\nDevil's Food Cake\nChocolate Cherry Pound Cake\nA Guide to Cake Frosting\nCakes\nLayer Cake\nChocolate\nCherry\nEaster Desserts"
}