{
  "url": "https://www.seriouseats.com/chocolate-babka-recipe-8711555",
  "image_url": "https://www.seriouseats.com/thmb/BmDGdfXM2tH4rBDxFhcamWOQhTY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240813-SEA-ChocolateBabka-DebbieWee-HERO9-22-30f1c65ba9164b1e84e2b811f88e2a64.jpg",
  "tags": [
    "Yeast Breads",
    "The Latest",
    "Bread",
    "Chocolate",
    "Desserts"
  ],
  "title": "Rich and Tender Chocolate Babka",
  "full_text": "Rich and Tender Chocolate Babka\nClose\nJump to recipe\nPrep\n90 mins\nCook\n45 mins\nResting/Proofing/Cooling Time\n6 hrs 10 mins\nTotal\n8 hrs 25 mins\nServes\n8\nto 10\nMakes\n2 loaves\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Tangzhong:\n120g (\n1/2\ncup\n)\nwater\n28\ng\nbread flour\n(1 ounce; 3 tablespoons)\n90\ng\n(1/4 cup plus 2 tablespoons) cold\nwhole milk\n3\nlarge\neggs\n, cold\n2\nlarge\negg yolk\ns, cold\nFor the Dough:\n510g\nbread flour\n(about\n3 1/2\ncups\n; 18 ounces)\n75\ng\ngranulated sugar\n(1/4 cup plus 2 tablespoons; about 2 3/4 ounces)\n9\ng\n(1 tablespoon) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n7g (\n2 1/4\nteaspoons\n)\ninstant\nyeast\n113\ng\nunsalted butter\n(4 ounces; 8 tablespoons), cut into 1/2-inch cubes, softened, plus more for greasing\nFor the Filling:\n175\ng\n(3/4 cup)\nheavy cream\n113\ng\nunsalted butter\n(4 ounces; 8 tablespoons), cut into 1/2-inch cubes\n100g\ngranulated sugar\n(\n3 1/2\nounces\n; 1/2 cup)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n170\ng\n(6 ounces) finely chopped\ndark chocolate\n, roughly 72% cacao\n2\nteaspoons\npure\nvanilla extract\n1\nteaspoon\nground cinnamon\n1\nteaspoon\nespresso\npowder\n12g (about\n2\ntablespoons\n) sifted unsweetened natural or Dutch-process\ncocoa powder\nFor the Simple Syrup:\n50\ng\ngranulated sugar\n(1/4 cup; 1 3/4 ounces)\n60\ng\n(1/4 cup)\nwater\nDirections\nFor the Tangzhong:\nIn a medium microwave-safe bowl, whisk water and bread flour together until smooth. Microwave for 20 seconds. Whisk, then repeat 1 to 2 more times, whisking after each interval, until mixture thickens to a pudding-like consistency. If needed, continue heating mixture in 10-second intervals, stirring each time, until pudding-like consistency is achieved. Let cool, stirring occasionally, until room temperature, about 5 minutes. Once cool, add milk to the tangzhong and whisk to combine. Add whole eggs and yolks to the tangzhong mixture and whisk until well-combined and no streaks remain. Set aside.\nSerious Eats / Debbie Wee\nFor the Dough:\nIn the bowl of a stand mixer fitted with the dough hook attachment, combine bread flour, sugar, salt, and yeast, and mix on low speed for 20 seconds until well-combined. Turn off mixer, then add tangzhong all at once and mix on medium-low speed until dough is uniform and no dry flour remains, about 2 minutes; use a bowl scraper or silicone spatula to scrape down sides of bowl and dough hook as needed. Continue mixing on medium-low speed until dough is cohesive but slightly lumpy, about 5 minutes longer. Turn off mixer and scrape down sides of bowl and dough hook.\nSerious Eats / Debbie Wee\nWith the mixer running on medium-low speed, add butter 2 tablespoons at a time, making sure to wait until each addition is fully incorporated before adding the next, about 2 minutes between each addition (6 to 8 minutes total); scrape down the bowl and dough hook halfway through and as needed.\nSerious Eats / Debbie Wee\nContinue to knead dough on medium-low speed until dough is smooth, elastic, and pulls away from side of the bowl, 10 to 14 minutes, pausing to scrape down sides of bowl and dough hook as needed. The dough will be moist and stretchy; this is normal. Do not add more flour.\nSerious Eats / Debbie Wee\nIf it is still sticking to the sides of the bowl toward the end of kneading time, briefly increase the speed of the mixer and continue to knead until dough pulls away from the sides of the bowl; it should be stretchy and somewhat sticky but not wet  You can perform the\nwindowpane test\nto check if it’s ready. Use a bowl scraper to form the dough into a cohesive mass, then cover bowl with plastic wrap. Set aside to rest in a warm spot at room temperature until puffy but not quite doubled in size, about 1 hour. Transfer dough to the refrigerator and chill for at least 2 hours or up to 12 hours.\nSerious Eats / Debbie Wee\nFor the Filling:\nWhen ready to shape, combine heavy cream, butter, sugar, and salt in a small pot. Set over medium-low heat and cook, whisking continuously, until sugar is dissolved and butter is melted.\nSerious Eats / Debbie Wee\nRemove from heat and add chocolate, vanilla, cinnamon, espresso powder, and cocoa powder. Let sit until chocolate begins to soften, about 2 minutes, then whisk until smooth. Set aside to cool to room temperature while dough rests in the fridge. It should have a spreadable consistency, like creamy peanut butter.\nSerious Eats / Debbie Wee\nRoll and Fill the Dough:\nLine a 12- by 17-inch rimmed baking sheet with parchment paper and lightly dust with flour (see notes). Clear enough freezer space to accommodate the baking sheet.\nSerious Eats / Debbie Wee\nSplit the cold dough in two equal portions (each should weigh about 20 ounces; 567g). Return one portion to the bowl, loosely cover with plastic wrap, and place in refrigerator. On a lightly floured work surface, gently pat remaining portion of dough into a rectangle about 1 1/2-inches thick. Using a lightly floured rolling pin, roll dough into a 12- by 17-inch rectangle, about 1/8 inches thick. (It’s fine if it isn’t perfectly rectangular; it’s more important that it’s an even thickness.)\nSerious Eats / Debbie Wee\nUsing an offset spatula, spread half of the filling, about 1 cup plus 2 tablespoons (9 1/4 ounces; 265g), evenly over the dough, leaving a 1/2-inch border on one of the short ends but otherwise spreading the filling to the edges.\nSerious Eats / Debbie Wee\nStarting with the other short end (the one with chocolate all the way to the edge), roll dough up as tightly as possible. (If dough is sticking to the surface, use a bench scraper to gently push dough to get the rolling started.) Carefully pinch the dough together along the seam to seal. Gently pat the log to ensure even thickness. Place the log seam-side down onto prepared sheet and freeze until slightly firm, 15 minutes. Repeat with the other half of dough.\nSerious Eats / Debbie Wee\nButter two 9- by 5-inch loaf pans and line with parchment paper (approximately 8 1/2- by 12-inch sheets) crosswise so there are “wings” hanging over the long edges of the pan.\nSerious Eats / Debbie Wee\nRemove the first log from the freezer and use a sharp chef’s knife to evenly slice it down the center lengthwise.\nSerious Eats / Debbie Wee\nWith the cut sides facing up, cross the two halves into an X shape, then twist from the center, aiming for 2 full twists on each side of the X. (Do your best to keep the cut sides facing up throughout this process. Don’t be afraid to assertively coax the split log halves in order to achieve the full 2 twists.)\nSerious Eats / Debbie Wee\nPinch both ends of the twists together to seal. Gently nestle the first babka into a prepared loaf pan and set on a rimmed baking sheet. Repeat with the other log, setting the loaf pan on the same baking sheet as the first, about 2 to 3 inches apart.\nSerious Eats / Debbie Wee\nFor the Second Rise and Bake:\nCover loaf pans with a clean tea towel and let rise in a warm spot at room temperature (75 to 80ºF; 24 to 27ºC) for 1 hour. The loaves will get puffy, but will not double in size. About 20 minutes before rising time ends, adjust oven rack to lower-middle position and preheat oven to 350°F (180°C).\nSerious Eats / Debbie Wee\nBake babkas until risen and well-browned and an instant-read thermometer registers 190ºF (88ºC) when inserted in the center, 45 to 50 minutes.\nSerious Eats / Debbie Wee\nFor the Simple Syrup:\nWhile babkas bake, prepare the simple syrup. In a small saucepan, combine sugar and water. Bring to a boil over medium-high heat, stirring frequently, until sugar has dissolved, about 2 minutes. Remove from heat.\nSerious Eats / Debbie Wee\nRemove babkas from the oven, and, using a pastry brush, immediately brush both babkas with simple syrup until evenly coated and all syrup is used. Let cool in pans for 1 hour. Using the parchment paper “wings,” gently lift babkas to remove them from the pans. Cool loaves on a wire rack until room temperature, about 1 hour, before removing parchment, slicing, and serving.\nSerious Eats / Debbie Wee\nSpecial Equipment\nStand mixer\n,\nkitchen scale\n, heavy-bottomed 1-quart pot,\nbowl scraper\n, rolling pin,\nsmall offset spatula\n,\nbench scraper\n, rimmed baking sheets (\nhalf sheet pan\nand\nquarter sheet pans\n), two 9- by 5- by 3-inch\naluminized steel loaf pans\n, pastry brush (silicone is ok),\ndigital instant-read thermometer\nNotes\nTo cool chocolate filling faster, place it in the refrigerator and stir frequently. If it’s too firm, or you need to bring it to room temperature faster, you can heat it briefly over a low heat, and stir well. Or microwave it for a couple 10-second intervals.\nTwo 9- by 13-inch baking sheets can be used in place of one 12- by 17-inch baking sheet.\nMake-Ahead and Storage\nChocolate filling can be made up to a week in advance. Cool to room temperature, then refrigerate in an airtight container with plastic wrap until ready to use. Allow filling to come to room temperature before assembling.\nDouble wrapped with plastic and stored in a freezer bag or wrapped in foil, the finished babka can be frozen for up to one month. Thaw at room temperature.\nBabkas can be tightly wrapped in plastic and stored at room temperature for up to 3 days. It is best to cut slices right before serving to maintain freshness.\nYeast Breads\nThe Latest\nBread\nChocolate\nDesserts"
}