{
  "url": "https://www.seriouseats.com/chocolate-yule-log-recipe",
  "image_url": "https://www.seriouseats.com/thmb/UQDO_alIv_YClSgysyyOUjsNY0E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__11__20191108-yule-log-vicky-wasik-29-ef066dac83dc41309d7dbe11dd0dc538.jpg",
  "tags": [
    "Cakes",
    "Christmas Desserts",
    "Baking",
    "Chocolate",
    "Thanksgiving Desserts"
  ],
  "title": "Classic Chocolate Yule Log",
  "full_text": "Classic Chocolate Yule Log\nClose\nJump to recipe\nPrep\n35 mins\nCook\n20 mins\nActive\nAbout 30 mins\nCooling Time\n2 hrs 15 mins\nTotal\n3 hrs 10 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n2 1/2\nounces\npistachio oil\n, roasted hazelnut oil, or melted butter (about\n1/3\ncup\n;\n70\ng\n)\n2 1/2\nounces finely chopped\ndark chocolate\n, between\n85%\nand 100% (slightly rounded\n1/3\ncup\n;\n70\ng\n); see notes\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\n5\nlarge\neggs\n(\n8 3/4\nounces\n;\n250\ng\n)\n5 3/4\nounces\nsugar\n(about\n3/4\ncup\n;\n165\ng\n)\n1\ntablespoon\ninstant espresso powder\n3/4\nteaspoon\nbaking powder\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/2\nteaspoon\nbaking soda\n1 1/4\nounces\nwater\n(about\n2 1/2\ntablespoons\n;\n35\ng\n)\n3 3/4\nounces\nbread flour\n(about\n3/4\ncup\n, spooned;\n106\ng\n)\nFor the Ganache Frosting:\n12\nounces\nheavy cream\n(about\n1 1/2\ncups\n;\n340\ng\n)\n12\nounces\nfinely chopped\ndark chocolate\n,\nbetween 55% and 75%\n, or a blend thereof (about\n2\nheaping\ncups\n;\n340\ng\n)\nSalt\nand vanilla to taste\nFor the Filling:\n2\ncups\nsweetened whipped cream\n, buttercream, or other frosting, see notes (weight will vary)\nTo Garnish:\nMatcha powder\n, optional\nCocoa powder\n, optional\n1\nrecipe\nmeringue mushrooms\n, optional\nDirections\nGetting Ready:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). Line an aluminum half-sheet pan with parchment along the bottom, and grease with pan spray or oil.\nFor the Cake:\nIn a 1-quart stainless steel saucier, melt butter (or heat oil) over medium-low until quite hot, about 200°F (93°C). Off heat, add chopped chocolate and vanilla, and whisk until smooth. Set aside until needed, no longer than the duration of the steps below, as the mixture will thicken as it cools and become unsuitable for incorporating into the batter. The ganache should be fluid and warm for use, around 100°F/38°C (this number is provided for context; so long as the ganache is in a pourable state, its temperature does not need to be measured).\nSerious Eats / Vicky Wasik\nIn the bowl of a stand mixer fitted with a whisk attachment, combine eggs, sugar, instant espresso, baking powder, salt, and baking soda. Mix on medium-low speed until the sugar has dissolved and the dark brown mixture is homogenous, smooth, and runny, but with bubbles beginning to form throughout, about 3 minutes.\nIncrease speed to medium and whip until the mixture has lightened to a dark tan, with a lighter/more voluminous body than before. It will still be runny but thick enough to fall from the whisk in thin ribbons, about 5 minutes. Finally, increase speed to high, and continue whipping until the mixture is foamy and thick, light brown in color, and roughly doubled in volume, with a well-defined vortex pattern left in the eggs as it whips, about 8 minutes. When allowed to run off the whisk and into the bowl, the mixture should be able to briefly mound up on itself before leveling off. Please bear in mind all times are ballpark figures only and may vary considerably depending on the power and capacity of a given stand mixer, along with factors such as bowl-to-beater clearance (more on that\nhere\n). In all cases, the visual and textural cues should be the primary guideline to determine readiness.\nSerious Eats / Vicky Wasik\nOnce the foamed eggs are fluffy and thick, reduce speed to medium-high and immediately add water, followed by the warm chocolate mixture, then reduce speed to medium-low and add the sifted flour. When the flour is nearly incorporated, shut off the mixer and remove the whisk attachment. Grasping the attachment by its top, give the batter a few strokes of the whisk by hand to finish incorporating the flour. Fold the batter once or twice from the bottom up with a flexible spatula, then scrape into the prepared pan and spread into an even layer with an offset spatula. Bake until well risen and firm to the touch, but still puffy and soft enough to retain a shallow impression when gently poked, about 12 minutes. Over-baking will cause the cake to crack as it rolls.\nSerious Eats / Vicky Wasik\nImmediately after removing the cake from the oven, cover the half-sheet pan with two large strips of foil, using a kitchen towel or oven mitt to tightly crimp the foil around the edges of the pan. Allow the cake to cool until approximately 70°F or 21°C (this temperature is provided for context and can be gauged by touch rather than with a thermometer; warm cake will melt the filling, and cold cake will crack as it rolls).\nSerious Eats / Vicky Wasik\nFor the Ganache:\nWhile the cake is cooling, bring cream to a simmer in a 2-quart stainless steel saucier; once it begins to bubble, remove from heat. Whisk in chocolate, and season to taste with additional salt and vanilla or as desired with other extracts and flavorings. Set aside until the ganache has thickened and cooled into a frosting-like consistency, about 2 hours, or to a temperature around 75°F (24°C).\nAssembling the Yule Log:\nLoosen the edges of the cooled cake from the pan with a butter knife. Spread about 2 cups of freshly whipped cream (flavored or plain), buttercream, frosting, or jam in an even layer over the cake. Working along the widest end, lift the edge of the cake by the parchment underneath and gently fold it inward until it turns over itself. Continue rolling, using the parchment to lift and maneuver the cake; it will naturally peel away as you go.\nSerious Eats / Vicky Wasik\nIf you like, slice off a 4-inch chunk of cake at a sharp angle, to serve as a branch for the log. Place cake on a large platter, and to nestle the \"branch,\" place it against the main body of the roulade. This can also be done vertically, anchored with a few drinking straws inserted through the \"branch\" and into the body of the \"log.\" However the pieces are arranged, frost the roulade with a thick layer of ganache.\nSerious Eats / Vicky Wasik\nWhen the ganache has begun to thicken and set to a firmer consistency, drag the tines of a fork down the length of the cake and along the \"branches\" to create a rough texture, like tree bark. Repeat as needed to further texturize the exterior. Garnish with a sprinkling of matcha for moss, a dusting of cocoa for dirt, and meringue mushrooms to complete the effect. Serve immediately, or wrap tightly in plastic until needed. Cakes filled with whipped cream can be refrigerated up to 36 hours and taste best when allowed to stand at room temperature a few hours before serving. Cakes filled with buttercream or frosting can be stored at cool room temperature for up to 36 hours.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n,\nhalf sheet pan\n,\noffset spatula\nNotes\nBecause the cake itself depends entirely on the quality of the chocolate involved, make sure to use the best you can find, even if that means opting for a chocolate in the 80% range rather than one that's entirely unsweetened. See our roundup of\nthe best extra-dark chocolates\nfor reliable supermarket options or order online from brands like Dandelion, Tcho, Pralus, or Raaka.\nIn place of this simple whipped cream filling, fill this Yule log with whatever strikes your fancy, from the\npistachio buttercream\npictured here to a\nlight and colorful whipped cream made with freeze-dried fruit\nto\ntangy cream cheese frosting\nor even our\neggless chocolate mousse\n.\nMake-Ahead and Storage\nCakes filled with whipped cream can be refrigerated up to 36 hours and taste best when allowed to stand at room temperature a few hours before serving. Cakes filled with buttercream or frosting can be stored at cool room temperature for up to 36 hours.\nCakes\nChristmas Desserts\nBaking\nChocolate\nThanksgiving Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/classic-chocolate-yule-log.webp?"
}