{
  "url": "https://www.seriouseats.com/chocolate-mug-cake-recipe-11678945",
  "image_url": "https://www.seriouseats.com/thmb/4KsxajhAN7L8dLR8df88tC0mX18=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250212-SEA-ChcocolateMugCake-AmandaSuarez-08-c4fb883d72754b308219d8b52334ec7c.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Cakes",
    "Chocolate"
  ],
  "title": "Molten Chocolate Mug Cake",
  "full_text": "Molten Chocolate Mug Cake\nClose\nJump to recipe\nCook\n5 mins\nTotal\n5 mins\nServes\n1\nto 2\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(16\ng\n)\nall-purpose flour\n2\ntablespoons\n(\n25\ng\n)\nsugar\n4\nteaspoons\nDutch-processed\ncocoa powder\n1/4\nteaspoon\nbaking powder\n1/8\nteaspoon\nDiamond Crystal kosher salt;\nfor table salt use a pinch\n1\nounce\n(28\ng\n) milk or\ndark chocolate\nbroken into roughly 1-inch pieces or chocolate chips, divided (see notes)\n2\ntablespoons\n(28\ng\n)\nunsalted butter,\ncut into 4 pieces\n1\nlarge\negg, lightly beaten\n1\nteaspoon\nvanilla extract\nDirections\nIn a small bowl, whisk flour, sugar, cocoa, baking powder, and salt together. To a 12-ounce mug, add half of chocolate pieces with butter. Microwave butter and chocolate pieces at 50% power, stirring every 30 seconds, until melted, 1 to 2 minutes. (See notes regarding microwave power below.)\nSerious Eats / Amanda Suarez\nAdd flour mixture, egg, and vanilla and using a fork, thoroughly mix until smooth and well combined (being sure to scrape corners of mug).\nSerious Eats / Amanda Suarez\nMicrowave cake batter at 50% power until batter has doubled in size, 50 to 70 seconds.\nSerious Eats / Amanda Suarez\nPress remaining chocolate pieces into center of cake until top of chocolate pieces are flush with top of cake. Microwave cake at 50% power until cake is firm but top is just wet and tacky to the touch, 15 to 30 seconds (cake may rise above edge of mug, but should not overflow). Let cake rest for 2 minutes. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-ounce microwave-safe mug, microwave\nNotes\nI developed this recipe in a full-size 1,000-watt microwave. If the wattage of your microwave is less than or greater than 1,000 watts, you will need to increase or decrease the cooking times throughout to reach the visual cues. I recommend writing down the cooking time once you've dialed it in for your particular microwave.\nI prefer bar chocolate (milk, dark, or bittersweet), as chocolate chips are harder to insert into the cake to form the molten center, but chocolate chips will do in a pinch.\nMake-Ahead and Storage\nThe mug cake is best enjoyed immediately.\nDesserts\nThe Latest\nCakes\nChocolate"
}