{
  "url": "https://www.seriouseats.com/chocolate-mayonnaise-cake-recipe-8727794",
  "image_url": "https://www.seriouseats.com/thmb/l5YkidAdJ_A4HstAPLRjABLhNPQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241015-ChocolateMayoCake-MaureenCelestine-25-39568fdceb274ec587a02a0dfd43e8f1.jpg",
  "tags": [
    "Chocolate",
    "The Latest",
    "Cakes",
    "Desserts"
  ],
  "title": "Chocolate Mayonnaise Cake",
  "full_text": "Chocolate Mayonnaise Cake\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nCooling Time\n2 hrs\nTotal\n2 hrs 40 mins\nServes\n15\nMakes\n1 9- by 13-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nNonstick\ncooking\nspray\n320g\nall-purpose flour\n(\n11 1/4\nounces\n; 2 1/2 cups), plus more for dusting\n60\ng\nunsweetened natural\ncocoa powder\n(2 ounces; 3/4 cup)\n250g\ngranulated sugar\n(\n8 3/4\nounces\n; 1 1/4 cups)\n2\nteaspoons\n(8g)\nbaking powder\n1\nteaspoon\n(5g)\nbaking soda\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n300\nml\nstrong\nblack coffee\n(10 fluid ounces; 1 1/4 cups), at about 170°F (77ºC)\n300g\nmayonnaise\n(\n10 1/2\nounces\n; 1 1/4 cups)\n1\nteaspoon\nvanilla extract\nFor the Frosting:\n200\ng\nunsalted butter\n(7 ounces; about 14 tablespoons), softened\n40g\ncocoa powder\n(\n1 1/2\nounces\n; 1/2 cup), sifted\n420\ng\nconfectioners' sugar\n(15 ounces; 3 3/4 cups), sifted\n2\ntablespoons\n(30ml)\nwhole milk\n1\nteaspoon\nvanilla extract\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Using nonstick spray, grease a 9- by 13-inch baking pan, then dust with all-purpose flour, shaking out excess.\nUsing a fine-mesh sieve, sift flour and cocoa powder into a large bowl. Add sugar, baking powder, baking soda, and salt and whisk to combine.\nSerious Eats / Maureen Celestine\nIn another large mixing bowl, whisk coffee, mayonnaise, and vanilla extract until well combined and the mixture resembles foamy, milky coffee, about 20 seconds. Add dry ingredients and whisk until mixture just comes together and no visible dry spots remain, about 30 seconds. (Batter will be slightly lumpy; this is fine. Do not overmix.)\nSerious Eats / Maureen Celestine\nUsing a flexible rubber spatula, scrape batter into prepared pan. Bake until a cake tester inserted in the center comes out clean and cake pulls away slight from sides of pan, 35 to 38 minutes. Transfer pan to a wire rack and allow cake to cool completely, 1 1/2 to 2 hours.\nSerious Eats / Maureen Celestine\nFor the Frosting:\nIn the bowl of a stand mixer fitted with the paddle attachment or in a bowl using an electric hand mixer, beat butter on medium-high speed until creamy, about 30 seconds. Add confectioners' sugar and cocoa powder, followed by milk and vanilla extract. Mix on low speed until fully incorporated, then increase speed to medium-high and beat until smooth and fluffy, about 3 minutes more. Using a small offset spatula or flexible rubber spatula, spread frosting over cooled cake. Slice and serve.\nSerious Eats / Maureen Celestine\nSpecial Equipment\n9- by 13-inch baking pan, whisk, flexible rubber spatula, stand mixer or hand mixer\nNotes\nYou can substitute regular mayo for vegan mayonnaise, but vegan versions rises more, and have a lighter, more open crumb. If possible, avoid using reduced fat mayonnaise, which produces a denser, chewier, and less flavorful cake.\nMake-Ahead and Storage\nThe frosted cake can be loosely wrapped in plastic and refrigerated for up to 3 days—allow it to come to room temperature before eating.\nWhole or sliced unfrosted cake can also be wrapped in a layer of plastic wrap, followed by a layer of foil, and frozen for up to 3 months. Thaw at room temperature.\nChocolate\nThe Latest\nCakes\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chocolate-mayonnaise-cake.webp?"
}