{
  "url": "https://www.seriouseats.com/chocolate-peppermint-snowflake-cookies",
  "image_url": null,
  "tags": [
    "Cookies",
    "Chocolate",
    "Christmas Cookies",
    "Winter Desserts"
  ],
  "title": "Chocolate Peppermint Snowflake Cookies Recipe",
  "full_text": "Chocolate Peppermint Snowflake Cookies Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n40 mins\nChilling and Cooling Time\n2 hrs 10 mins\nTotal\n2 hrs 40 mins\nMakes\n30 cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookies:\n1 1/2\ncups\nall purpose flour\n1/2\ncup\nunsweetened cocoa powder\n, such as Valhrona\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nkosher salt\n8\ntablespoons\nunsalted butter\n, at room temperature\n1\ncup\nsugar\n1\negg\n1\negg yolk\n1\nteaspoon\nvanilla\nFor Assembly:\n2\ncups\nconfectioners sugar\n2\ntablespoons\nwater\n3\ncandy canes\n(see note)\nDirections\nFor the cookies\n: In a medium bowl, whisk together flour, cocoa powder, baking soda, baking powder, and salt; set aside.\nIn the bowl of a stand mixer fitted with a paddle attachment, cream together butter and sugar until fluffy, about 3 minutes. Add egg, egg yolk, and vanilla and beat until combined. Add dry ingredients and mix just until dough comes together. Divide dough into two pieces and wrap each in plastic wrap and refrigerate for 1 hour.\nAdjust oven rack to upper and lower middle positions and preheat oven to 350°F. Lightly flour a clean work surface. Line two baking sheets with parchment paper.\nTake out one ball of dough and roll out to 1/4-inch thick. Cut out as many cookies as possible, transferring with a spatula to the prepared cookie sheets. Repeat with remaining dough, re-rolling scraps and moving onto the next ball of dough as necessary. Bake cookies until just dry on top, about 15 minutes. Let cool 5 minutes on baking sheets then transfer to a wire rack to cool completely.\nFor assembly\n: In a medium bowl, whisk together confectioners sugar and water until smooth, adding a little more water if necessary. Take a small spoon and fill with icing. Drizzle icing over a cookie in a zig-zag pattern. Immediately sprinkle with candy cane pieces. Repeat with remaining cookies. Let icing set completely, about 1 hour, before placing cookies in an airtight container.\nSpecial equipment\nstand mixer, 4-inch cookie cutter, ziplock bag, parchment paper, rolling pin, baking sheets\nThis Recipe Appears In\nCookie Monster: Chocolate Peppermint Snowflake Cookies\nA Cookie a Day: Chocolate Peppermint Snowflake Cookies\nCookies\nChocolate\nChristmas Cookies\nWinter Desserts"
}