{
  "url": "https://www.seriouseats.com/chocolate-honeycomb-candy-recipe-8748423",
  "image_url": "https://www.seriouseats.com/thmb/KGNVVlhICt4zW1cJEozzFEcqyK4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__03__20150315-chocolate-coated-honeycomb-nila-jones-1-5581e468ce7e4f229b53acdb712f88fd.jpg",
  "tags": [
    "Desserts",
    "Peanuts",
    "Chocolate",
    "Candy",
    "Quick Snacks"
  ],
  "title": "Chocolate-Coated Caramel Honeycomb With Salted Peanuts",
  "full_text": "Chocolate-Coated Caramel Honeycomb With Salted Peanuts\nClose\nJump to recipe\nCook\n30 mins\nTotal\n30 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nteaspoon\nbaking soda\n3/4\ncup\n(5.3 ounces)\ngranulated sugar\n1\ntablespoon\n(15ml)\ncorn syrup\n3\ntablespoons\n(45ml)\nwater\n2\nounces\n(57g)\nsemi-sweet chocolate\n1/4\ncup\nsalted roasted peanuts\n(1 1/4 ounces; 35g), chopped\nDirections\nPlace the baking soda in a small bowl and line a baking sheet with parchment paper. Set aside.\nIn a 2 1/2-quart heavy-bottomed saucepan, combine sugar, corn syrup and water. Heat over medium heat, stirring, until the sugar is dissolved.\nWithout stirring, bring syrup to a boil. Continue to cook without stirring, using a pastry brush dipped in water to wash down side of saucepan (this is to wash away stray sugar crystals and prevents the syrup from crystallizing), until caramel turns a very light golden color.\nRemove caramel from the heat and whisk in the baking soda for 3 to 5 seconds; the caramel will start to bubble and swell. Pour bubbling caramel onto the lined baking sheet. Allow to cool, undisturbed, until room temperature.\nFill a saucepan with water and bring to a gentle simmer. Place chocolate in a medium heat-proof mixing bowl and set over saucepan, making sure the bowl doesn't touch the water. Cook, using a flexible spatula to stir occasionally, until chocolate has melted, 3 to 4 minutes.\nUsing a clean, dry pastry brush or the back of a spoon, spread melted chocolate over the honeycomb in an even layer. Sprinkle chopped salted peanuts all over. Let chocolate cool until set. Break candy in large chunks and serve.\nSpecial Equipment\nParchment paper, rimmed baking sheet, 2 1/2-quart heavy-bottomed saucepan, pastry brush\nNotes\nOnce you start whisking the baking soda into the caramel, it will bubble up like crazy, so make sure the pan you're using is large enough (at least 2 1/2 quarts); otherwise the hot caramel could spill over the side of the saucepan. Also, please be careful when working with hot caramel and honeycomb. This stuff is hot!\nMake-Ahead and Storage\nHoneycomb can be stored in an airtight container at room temperature for up to 5 days.\nDesserts\nPeanuts\nChocolate\nCandy\nQuick Snacks"
}