{
  "url": "https://www.seriouseats.com/chocolate-chunkers-cookie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PjEFSNCU3LMjk6tr1i4IkzeZuAU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121210-tam-chocolate-chunkers-aeb2c0bd68ef471cb718a24264806f7b.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Chocolate"
  ],
  "title": "Chocolate Chunkers Recipe",
  "full_text": "Chocolate Chunkers Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nTotal\n50 mins\nServes\n20\nto 24 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/3\ncup\nall-purpose flour\n1/4\ncup\nunsweetened cocoa powder\n1/2\nteaspoon\nsalt\n1/4\nteaspoon\nbaking powder\n3\ntablespoons\nunsalted butter\n, cut into\n3\npieces\n6\nounces\nbittersweet chocolate\n, coarsely chopped\n1\nounce\nunsweetened chocolate\n, coarsely chopped\n2\nlarge\neggs\n, at room temperature\n2/3\ncup\ngranulated sugar\n1\nteaspoon\npure vanilla extract\n6\nounces\nsemisweet chocolate\n, chopped into chunks, or\n1\ncup\nstore-bought chocolate chips or chunks\n6\nounces\npremium-quality milk\nor\nwhite chocolate\n, chopped into chunks, or\n1\ncup\nstore-bought chocolate chips\n1 1/2\ncups\ncoarsely chopped nuts\n, preferably salted peanuts or toasted pecans\n1\ncup\nmoist, plump raisins\nDirections\nCenter a rack in the oven and preheat the oven to 350°F. Line two baking sheets with parchment or silicone mats.\nSift together the flour, cocoa, salt, and baking powder.\nSet a heatproof bowl over a saucepan of simmering water. Add the butter, bittersweet and unsweetened chocolate and heat, stirring occasionally, just until melted. The chocolate and butter should be smooth and shiny but not so hot that the butter separates. Remove the bowl from the heat and set it on the counter to cool.\nWorking with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the eggs and sugar together on medium-high speed for about 2 minutes, until they are pale and foamy. Beat in the vanilla extract, then scrape down the bowl. Reduce the mixer speed to low and add the melted butter and chocolate, mixing only until incorporated. With a rubber spatula, scrape down the bowl, then, on low speed, add the dry ingredients. Mix just until the dry ingredients disappear into the dough, which will be thick, smooth and shiny. Scrape down the bowl and, using the rubber spatula, mix in the semisweet and milk (or white) chocolate chunks, nuts and raisins. You'll have more crunchies than dough at this point.\nDrop the dough by generously heaping tablespoonfuls onto the baking sheets, leaving about an inch of space between the mounds of dough.\nBake the cookies one sheet at a time for 10 to 12 minutes. The tops of the cookies will look a little dry but the interiors should still be soft. Remove the baking sheet and carefully, using a broad metal spatula, lift the cookies onto a cooling rack to cool to room temperature.\nRepeat with the remaining dough, baking only one sheet of cookies at a time and making sure to cool the baking sheets between batches.\nIf, when the cookies are cooled, the chocolate is still gooey and you'd like it to be a bit firmer, just pop the cookies into the fridge for about 10 minutes.\nCookies\nBaking\nChocolate"
}