{
  "url": "https://www.seriouseats.com/chocolate-peanut-butter-cupcakes-buttercream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5_DQyV9tCiUCk2HCLfctPUj4v6I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20111129-181397-chocolate-peanut20butter-cupcakes-63f873301f41463089456e2b40a5b4cd.jpg",
  "tags": [
    "Cakes",
    "Cupcakes",
    "Chocolate",
    "Peanut Butter"
  ],
  "title": "Chocolate Peanut Butter Cupcakes Recipe",
  "full_text": "Chocolate Peanut Butter Cupcakes Recipe\nClose\nJump to recipe\nPrep\n45 mins\nCook\n35 mins\nActive\n60 mins\nCooling and Chilling Time\n2 hrs\nTotal\n3 hrs 20 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chocolate Cupcakes:\n3/4\ncup\nall-purpose flour\n1/3\ncup\ncocoa powder\n3/4\nteaspoon\nbaking soda\n1/2\nteaspoon\nsalt\n1/2\ncup\nplus\n2\ntablespoons\ngranulated sugar\n1/2\ncup\nbuttermilk\n1/3\ncup\nvegetable oil\n1\nlarge\negg\n1\nteaspoon\nvanilla extract\nFor the Peanut Butter Buttercream:\n1/2\ncup\ngranulated sugar\n2\nlarge\negg whites\n1/8\nteaspoon\nsalt\n12\ntablespoons\nsoftened unsalted butter\n, cut into 1/2-inch pieces\n1\ncup\npeanut butter\n2\nteaspoons\npure vanilla extract\nFor the Chocolate Coating:\n8\nounces\nsemi sweet chocolate\n, finely chopped\n1 1/2\ntablespoons\nvegetable oil\nDirections\nAdjust oven rack to middle position and heat oven to 350°F. Line muffin pan with 10 cupcake cups. In medium bowl, whisk flour, cocoa, baking soda, and salt until combined; set aside.\nIn large bowl, whisk sugar, buttermilk, oil, egg, and vanilla until combined and smooth. Whisk in dry mixture until smooth. Spoon batter into cupcake cups, dividing evenly. Bake until center is just set, about 25 minutes. Let cool in pan 10 minutes, then transfer cupcakes to wire rack to cool completely.\nWhile cupcakes are cooling, prepare the buttercream. In bowl of standing mixer, whisk sugar, egg whites, and salt until combined. Set bowl over pan of simmering water and gently whisk until mixture registers 160 degrees F on instant read thermometer. Immediately transfer to mixer fitted with whisk attachment. Whip on medium-high speed until mixture resembles shaving cream and is just cool. On medium speed, whip in butter, one piece at a time, until combined and creamy. Add peanut butter and vanilla and beat until smooth. Transfer buttercream to pastry bag fitted with a plain 1/2-inch tip (#808).\nPipe about 1/3 cup frosting onto each cupcake. Chill cupcakes in fridge until buttercream is completely firm, about 1 hour.\nWhen cupcakes have chilled, make the chocolate coating. Place chocolate and oil in a medium bowl and place over a pan of barely simmering water. Gently whisk until chocolate has just melted and mixture is smooth. Transfer to a large mug.\nHolding cupcake by the bottom, carefully dip in chocolate to submerge all of the frosting. Pull up and let excess chocolate drop off for a few seconds before turning cupcake right side up. Transfer to cooling rack and repeat with remaining cupcakes. Let cupcakes rest a few minutes to allow chocolate to set and buttercream to soften before serving.\nSpecial equipment\nstandard size muffin pan, paper cupcake cups, instant read thermometer, mug, pastry bag, pastry tip\nThis Recipe Appears In\nChocoholic: Chocolate Peanut Butter Cupcakes\nCakes\nCupcakes\nChocolate\nPeanut Butter"
}