{
  "url": "https://www.seriouseats.com/chocolate-filled-shortbread-e-l-fudge-style-cookies",
  "image_url": "https://www.seriouseats.com/thmb/kX85qjNi4CJTcnzD2UmT43yUMzk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__04__20170302-el-fudge-cookie-homemade-vicky-wasik-16-5eee3ec7091e4eb599c316f4b8e2a5b6.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Chocolate",
    "Christmas Cookies"
  ],
  "title": "E.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies Recipe",
  "full_text": "E.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n45 mins\nChilling Time\n15 mins\nTotal\n55 mins\nServes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookies:\n3 1/2\nounces\nsugar\n(about\n1/2\ncup\n;\n100\ng\n)\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or use the same weight\n1/2\nteaspoon\nbaking powder\n4\nounces\nunsalted butter\n(about\n8\ntablespoons\n;\n115\ng\n), pliable but cool\n1\nounce\nmilk\n(about\n2\ntablespoons\n;\n30\ng\n), any percentage will do\n1/2\nounce\nvanilla extract\n(\n1\ntablespoon\n;\n15\ng\n)\n7 3/4\nounces\nall-purpose flour\n(about\n1 3/4\ncups\n, spooned;\n220\ng\n), plus more for dusting\nFor the Filling:\n4\nounces\npowdered sugar\n(about\n1\ncup\n, spooned;\n110\ng\n)\n1\nounce\nDutch-process cocoa powder\n(about\n1/4\ncup\n, spooned;\n30\ng\n), such as Cacao Barry Extra Brute\n3\nounces\nunsalted butter\n(about\n6\ntablespoons\n;\n85\ng\n), brought to about 72°F (22°C)\n1/4\nteaspoon\nvanilla extract\n1/8\nteaspoon\n(\n0.5\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or use the same weight\nDirections\nFor the Cookies:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). In the bowl of a stand mixer fitted with a paddle attachment, combine sugar, salt, baking powder, and butter. Mix at low speed to moisten, then increase to medium speed and cream until soft and light, about 5 minutes. Scrape bowl and beater with a flexible spatula, then resume mixing on low. Add about half of milk and vanilla; once incorporated, add about half of flour. Repeat with remaining liquid and dry ingredients, then scrape bowl and beater once more to make sure dough is well mixed.\nSerious Eats / Vicky Wasik\nOn a generously floured surface, roll dough to a 1/8-inch thickness, using as much flour as needed along the way to prevent sticking. Dust away excess flour with a pastry brush and decorate with a docking tool if you like. Cut into shapes with a cutter averaging about 2 1/2 inches in size (see note) and transfer to a parchment-lined half sheet pan. Gather up scraps, knead briefly, roll, and cut as before. Bake cookies until firm to the touch and light brown all over, about 16 minutes; if needed, rotate pan halfway through to ensure even browning. Cool directly on sheet pan and continue to step 3, or store in an airtight container for up to 3 days at room temperature.\nSerious Eats / Vicky Wasik\nFor the Filling:\nSift powdered sugar and cocoa together. In the bowl of a stand mixer fitted with a paddle attachment, combine soft butter, vanilla, and salt with about 1/3 of the sugar-cocoa mixture. Mix at low speed until dry ingredients are moistened, then add another 1/3 of sugar/cocoa and slowly increase to medium speed. Once sugar/cocoa is incorporated, reduce speed to low and add remaining mixture. Slowly increase to medium speed, then pause to scrape bowl and beater with a flexible spatula and resume mixing until creamy and smooth. (When the butter is too cold, the filling may seem stiff or thick, so take care to start with soft butter.) Transfer to a disposable pastry bag and snip the end to create a 1/4-inch opening.\nSerious Eats / Vicky Wasik\nTo Assemble the Cookies:\nFlip half of cookies upside down and pipe on approximately 1/4 ounce filling (no need to measure; this can be done by eye). Once half the cookies have been \"filled,\" any excess filling can be redistributed as needed. Top with remaining cookies and transfer finished sandwich cookies to an airtight container.\nSerious Eats / Vicky Wasik\nRefrigerate cookies 15 minutes to harden filling. If temperatures in your kitchen routinely climb above 70°F (21°C), the cookies are best stored in the fridge; bring a few to room temperature as needed to serve. Stored this way, cookies will last about 1 month. If your kitchen is generally cooler than 70°F, after chilling, cookies can be stored at room temperature for up to 1 week.\nSpecial Equipment\nStand mixer\nfitted with paddle attachment, rolling pin, docking tool (optional), pastry brush, half sheet pan, owl-shaped cutter or other small shaped cutter (see note), disposable pastry bag\nNotes\nI love this\nowl-shaped cutter at Amazon\n, which is about the size of a Keebler Elf (1 inch wide and 3 1/4 inches long), but you can use whatever cutter you have on hand. Just bear in mind that the yield, and the amount of filling required, will vary dramatically if you choose a significantly larger shape.\nCookies\nBaking\nChocolate\nChristmas Cookies"
}