{
  "url": "https://www.seriouseats.com/chocolate-dipped-tuile-cigarettes-cookies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/vVXcJmldnH_DtZiJPH6FOVE2XuA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121221-234779-chocolate-dipped-cigarettes.1-a6cef3557aad480285ff788f458baa61.jpg",
  "tags": [
    "Cookies",
    "Chocolate"
  ],
  "title": "Chocolate Dipped Tuile \"Cigarettes\" Recipe",
  "full_text": "Chocolate Dipped Tuile \"Cigarettes\" Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nActive\n60 mins\nChilling Time\n60 mins\nTotal\n2 hrs\nServes\n18 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n4\nounces\n)\nconfectioners' sugar\n1/2\ncup\nplus\n2\ntablespoons\n(\n3 1/8\nounces\n)\nall-purpose flour\n1/8\nteaspoon\nsalt\n6\ntablespoons\n(\n3\nounces\n)\nunsalted butter\n, melted\n1/2\nteaspoon\npure vanilla extract\n3\nlarge\negg whites\n3\nounces\nbittersweet chocolate\n, melted\n1\ncup\nsprinkles\nfor garnish\nDirections\nIn medium bowl, whisk sugar, flour, and salt to combine. Stir in butter, vanilla, and whites until smooth. Chill until thickened, about 1 hour.\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Line baking sheet with a silpat-style non-stick baking sheet liner (see note). Spread 2 or 3 scant tablespoon sized portions of batter into a 4- by 6-inch oval. The batter should be spread evenly and should be practically transparent.\nBake until the edges are golden brown and the center is a faint golden color (not pale). Remove pan from the oven. Use an offset spatula to immediately remove one tuile from the pan and place on a work surface bottom side down.\nImmediately roll up tuile into as tight a cylinder as possible, from the short end, with your fingers and palm, taking care not to burn yourself. Hold for a second to set, then set aside to cool. Repeat with the remaining tuiles. If the tuiles cool and become too brittle to roll, return briefly to oven to soften. Repeat with remaining batter.\nDip an end of each tuile in chocolate, dip in sprinkles, and set on a parchment paper lined tray. Refrigerate to set chocolate.\nRepeat steps 2-5 with remaining batter. Serve at room temperature.\nNotes\nA silpat will keep the tuiles from sticking to the pan. If you don't own one, spread vegetable oil on the sheet pan, but the results may not be as good. Do not use parchment paper.\nSpecial Equipment\nSilpat-style non-stick baking sheet liner\nThis Recipe Appears In\nChocoholic: Chocolate Dipped Tuile \"Cigarettes\"\nCookies\nChocolate"
}