{
  "url": "https://www.seriouseats.com/chocolate-ganache-truffles",
  "image_url": "https://www.seriouseats.com/thmb/EmsUoK_DCiJeWIQSG3nBu8T2Gpc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__12__20161208-chocolate-truffles-vicky-wasik202-cc1af9242efc42928c48b88162e8b1a3.jpg",
  "tags": [
    "Candy",
    "Chocolate",
    "Mother's Day",
    "Christmas Candies",
    "Christmas Desserts"
  ],
  "title": "Chocolate Ganache Truffles Recipe",
  "full_text": "Chocolate Ganache Truffles Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n5 mins\nCooling and Chilling Time\n4 hrs 15 mins\nTotal\n4 hrs 45 mins\nServes\n24 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nsemisweet or\nbittersweet chocolate\n(a cacao content of about 60% works best)\n1/2\ncup\ncream\n(for chocolate with 70% cacao, increase the cream by about a tablespoon or two)\n1\ntablespoon\nbutter\n(optional)\n1\ntablespoon\nrum, or other\nliquor\n(optional)\n1/2\ncup\nunsweetened cocoa powder\nfor coating the truffles (or use chopped nuts or melted and tempered chocolate)\nDirections\nChop the chocolate into fairly even, small pieces—a heavy serrated knife works well.\nSerious Eats\nHeat the cream in a saucepan over medium heat until it begins to boil. Remove from heat. Add the chopped chocolate to the cream. For an extra smooth truffle, add butter. Add any liquor here, too. Wait a minute or two until most of the chocolate and butter is melted.\nSerious Eats\nTransfer to a mixing bowl. Whisk until smooth. Once the chocolate is mostly melted, quickly but gently transfer the mixture to a bowl so that you can form your emulsion in a cooler environment.\nSerious Eats\nWhisk the mixture vigorously until it’s thick and smooth, scraping the bottom and sides of the bowl and incorporating all the cream and chocolate. If you have one, an immersion blender helps make sure the emulsion is stable.\nIf the ganache shows signs of breaking at this point (if it looks curdled or oily), you can add a few drops of cream to help re-emulsify it. A well-emulsified ganache should look like chocolate pudding: thick, smooth, and glossy. Leave it in a cool spot to firm up for at least 4 hours, ideally overnight.\nOnce the ganache has set into a uniformly firm mass, scoop out small balls with a melon baller or spoon. Roll each one briefly in the palms of your very clean (or gloved) hands. It helps if you have cold hands or are in a cool room.\nSerious Eats\nChill the truffles briefly, for about 15 minutes, while you prepare whatever you’d like to roll or enrobe them in.\nIf your ganache isn’t firm enough to scoop into balls, you can chill it in the fridge to harden. Or, whip it very briefly until the color just begins to lighten—about 30 seconds on medium-low with a hand mixer. Let it set again and it will firm up.\nRoll the truffles in cocoa powder, shaking off any excess cocoa. You can also roll them in chopped nuts or enrobe them in melted and tempered chocolate.\nSerious Eats\nStore them at room temperature for up to a week, in the fridge for 2 to 3 weeks, or in the freezer for 2 months. They taste best eaten at room temperature.\nSpecial Equipment\nImmersion blender\n(optional), melon baller (optional)\nNotes\nFor variety, consider these flavor combinations:\nSerious Eats\nRosewater-Raspberry:\nMix 2 tablespoons seedless raspberry jam with 1 tablespoon rosewater. Add to 1/2 cup boiled cream along with 8 ounces chopped chocolate. Roll in cocoa powder or enrobe in tempered chocolate and garnish with crystallized rose petals.\nSerious Eats\nMilk Chocolate and Sunflower Seed:\nUse 3 parts milk chocolate to cream. Gently stir in 1/4 cup toasted and cooled sunflower seeds for every 8 ounces of chocolate into the cooled, but not yet set ganache. Once set, form the balls and roll in cocoa powder.\nSerious Eats\nSaffron-Orange:\nAdd a pinch of saffron threads to 1/2 cup heavy cream and bring to a simmer. Turn off heat and let mixture steep for 10 minutes. Strain and bring cream to a brief boil. Add 1 tablespoon of Grand Marnier to the cream along with 8 ounces of chopped chocolate. Once set and formed, roll the truffles in cocoa powder or enrobe with melted tempered chocolate and garnish with dehydrated orange zest.\nSerious Eats\nSalt and Pepper\n: Grind a few twists of black pepper into the 1/2 cup of hot cream, along with the 8 ounces chopped chocolate, 1 tablespoon room temperature butter, and 1 teaspoon vanilla. When the ganache is set, sprinkle in up to 1/2 teaspoon of coarse sea salt as you scoop and form the truffles.\nCandy\nChocolate\nMother's Day\nChristmas Candies\nChristmas Desserts"
}