{
  "url": "https://www.seriouseats.com/chocolate-dipped-almond-horn-cookies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Cp8j_rfqA1HBgqsP5TzUaUgYrYU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120312-196764-Chocolate-Dipped-Almond-Horns-8389ab2d6ec24361bdb39ef3096f5af9.jpg",
  "tags": [
    "Cookies",
    "Chocolate",
    "Almonds",
    "Christmas Cookies"
  ],
  "title": "Chocolate Dipped Almond Horns",
  "full_text": "Chocolate Dipped Almond Horns\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nCooling and Chillign Time\n70 mins\nTotal\n105 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n10\nounces\nmarzipan\n, broken into 1-inch pieces\n4\nounces\nfinely ground\nalmonds\n2\ntablespoons\ngranulated sugar\n1\nlarge\negg white\n1 1/2\nteaspoons\npure\nalmond extract\n1\ncup\nsliced almonds\n4\nounces\nbittersweet chocolate\n, finely chopped\nDirections\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Line rimmed baking sheet with parchment paper.\nIn the bowl of a stand mixer fitted with paddle attachment, mix marzipan, ground almonds, and sugar on low speed until combined (mixture may appear dry). Mix in egg white and almond extract until combined.\nPlace sliced almonds in shallow dish and lightly crush with hands. Divide dough into 12 equal portions (about 1 rounded tablespoon each). Working one at time, roll each ball into almonds as you shape it into 4 1/2-inch ropes with blunt ends. Shape rope into U shape and place on prepared baking sheet. Continue with remaining balls of dough, evenly spacing apart from each other.\nBake cookies until just beginning to turn golden, about 15 minutes. Let cool on pan 10 minutes, then transfer to cooling rack to cool completely, about 30 minutes.\nIn microwave or in medium bowl over pan of barely simmering water, melt half of chocolate, stirring gently, then add remaining chocolate and stir to melt. Dip ends of almond horns in chocolate and place back on parchment paper lined baking sheet. Chill cookies in fridge until set. Serve cookies at room temperature.\nSpecial Equipment\nRimmed baking sheet\n,\nstand mixer\nNotes\nAlmond paste may be used instead of marzipan with the following changes: 12 ounces almond paste, 3/4 cup granulated sugar, and 2 ounces finely ground almonds.\nCookies\nChocolate\nAlmonds\nChristmas Cookies"
}