{
  "url": "https://www.seriouseats.com/chocolate-cream-pie-meringue-recipe",
  "image_url": null,
  "tags": [
    "Pies",
    "Chocolate",
    "Egg Whites",
    "Easter Desserts",
    "Valentine's Day"
  ],
  "title": "Double-Chocolate Cream Pie Recipe",
  "full_text": "Double-Chocolate Cream Pie Recipe\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n45 mins\nCooling and Chilling Time\n4 hrs 30 mins\nTotal\n5 hrs 10 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOld-fashioned flaky pie dough\n, prepared as for a blind baked pie\nFor the Filling:\n4\nounces\n72% dark chocolate\n(\n3/4\ncup\n;\n115\ng\n), roughly chopped\n1/4\nounce\nvanilla extract\n(\n1 1/2\nteaspoons\n;\n7\ng\n)\n9 1/2\nounces\nsugar\n(\n1 1/3\ncups\n;\n270\ng\n)\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; use half as much if iodized\n1/2\nteaspoon\nespresso powder\n1 1/2\nounces\nDutch cocoa powder\n(\n1/2\ncup\n;\n45\ng\n)\n1 1/4\nounces\ncornstarch\n(\n1/3\ncup\n;\n35\ng\n)\n5\nounces\negg yolk\n(shy\n1/2\ncup\n;\n140\ng\n), from about\n8\nlarge\neggs\n24\nounces\nmilk\n(\n3\ncups\n;\n680\ng\n), any percentage will do\nFor the Topping:\nSwiss meringue\nDirections\nFor the Filling:\nPlace chopped chocolate in a medium bowl, add vanilla, and suspend a large, single-mesh sieve over the top. Whisk sugar, salt, espresso powder, cocoa powder, and cornstarch together in a 3-quart stainless steel saucier. Add egg yolks and roughly 1/2 cup of the milk and whisk until smooth before adding the rest of the milk. Cook over medium-low, stirring gently with a whisk until hot to the touch; about 6 minutes.\nSerious Eats / Vicky Wasik\nIncrease heat to medium and continue whisking gently until thick and bubbly, about 5 minutes (if it's not bubbling by then, feel free to crank up the heat). When you see that first bubble, set a timer and continue whisking exactly 90 seconds. Immediately pour into the sieve, pressing with a flexible spatula until custard passes through. Fold until chocolate has melted into the custard, and cover with a heavy towel.\nSerious Eats / Vicky Wasik\nFor the Topping:\nAdjust oven rack to lower-middle position and preheat to 375°F (190°C). Prepare Swiss meringue as directed. Pour custard into the prepared crust, and dollop meringue over top. Gently spread it edge to edge with the back of a fork, using the tines to sculpt it into a pretty design. Place on a wire rack set inside a 13- by 18-inch rimmed baking sheet and bake until well browned, about 15 minutes (this set-up minimizes heat transfer to the custard).\nSerious Eats / Vicky Wasik\nTo Serve:\nCool 1 hour at room temperature, then cover loosely in plastic and refrigerate to an internal temperature of 60°F (16°C), about 3 1/2 hours. Cut with a wet chef's knife, rinsing the blade clean with cold water between each slice. Wrapped in plastic, leftovers can be refrigerated up to a week.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel saucier\n,\nballoon whisk\n,\nlarge fine-mesh sieve\n,\nwire rack\n,\nrimmed baking sheet\n,\ndigital thermometer\nNotes\nThe flavor of this pie hinges on Dutch cocoa powder—natural and raw cocoas are simply too acidic. Look for brands like Droste in grocery stores or Cacao Barry Extra Brute online (ounce for ounce it's more affordable than any supermarket brand).\nRead More\nButtery, Flaky Pie Crust\nPerfect Swiss Meringue\nBanana Cream Pie\nClassic Boston Cream Pie\nHoosier Sugar Cream Pie\nPies\nChocolate\nEgg Whites\nEaster Desserts\nValentine's Day"
}