{
  "url": "https://www.seriouseats.com/chocolate-roll-aka-giant-yodel-recipe",
  "image_url": "https://www.seriouseats.com/thmb/H0Sn6qPUeleBWCiYJ85OY78ubkk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__09__20120929-224386-chocolate-roll.1-2a965e7bcc524379a4c5294da1708c9b.jpg",
  "tags": [
    "Cakes",
    "Baking",
    "Chocolate"
  ],
  "title": "Chocolate Roll (a.k.a. Giant Yodel) Recipe",
  "full_text": "Chocolate Roll (a.k.a. Giant Yodel) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n30 mins\nCooling and Chilling Time\n85 mins\nTotal\n2 hrs 5 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n1\ncup\n(\n5\nounces\n)\nall-purpose flour\n1/4\ncup\n(\n3/4\nounce\n)\ncocoa powder\n2\nteaspoons\nbaking powder\n4\nounces\nbittersweet chocolate\n, finely chopped\n8\ntablespoons\n(\n4\nounces\n)\nunsalted butter\n3/4\ncup\n(\n5 1/4\nounces\n)\ngranulated sugar\n4\nlarge\neggs\n1/4\nteaspoon\nsalt\n1/3\ncup\nhot\nwater\nFor the Whipped Cream Filling:\n1 1/2\ncups\nheavy cream\n2\ntablespoons\ngranulated sugar\n1\nteaspoon\npure\nvanilla extract\nFor the Ganache:\n4\nounces\nbittersweet chocolate\n, finely chopped\n1/2\ncup\nheavy cream\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F (180°C). Line a 10- by 15-inch jelly roll pan with parchment paper. Sift flour, cocoa powder, and baking powder into a small bowl; set aside.\nPlace chocolate and butter in a microwave-safe bowl and microwave in 15-second increments, stopping to stir with a rubber spatula until completely melted and smooth. Set aside to cool slightly. Alternatively, place butter and chocolate in a large bowl set over a saucepan of simmering water (do not allow bottom of bowl to touch water). Heat, stirring constantly with a rubber spatula, until melted and smooth. Allow to cool slightly.\nIn the bowl of a standing mixer fitted with whip attachment, whip sugar with eggs and salt on medium-high speed until light and thick, about 5 minutes. Remove bowl from mixer and fold in chocolate mixture with rubber spatula. Fold in flour mixture and then water until just combined.\nSpread batter onto pan. Bake until just firm, 10 to 15 minutes. Do not overbake (see notes). Let cake cool about 10 minutes. Run knife along inside pan edge to loosen cake.\nPlace a clean kitchen towel over cake. Starting from the short end, carefully roll cake up with towel (with parchment paper attached), Let cake rest until just cooled.\nFor the Cream:\nIn the bowl of a standing mixer fitted with whip attachment, whip cream with sugar and vanilla on medium-high speed until medium peak. Gently unroll cake, removing towel but leaving very end rolled to ensure a good grip. Spread cream over exposed surface of cake. Carefully re-roll cake into log, removing parchment paper as you roll up. Wrap tightly with plastic wrap to keep cake in log shape as you prepare ganache.\nFor the Ganache:\nIn a medium heat-proof bowl, heat chocolate with cream, stirring frequently, in microwave or over saucepan of barely simmering water until chocolate is melted and mixture is smooth. Chill mixture until thickened slightly, about 10 minutes.\nRemove plastic wrap from cake and trim both ends of cake. Place cake on a wire rack set over a rimmed baking sheet. Spoon ganache over cake. Using an offset spatula, smooth ganache over sides and ends of cake. Chill until ganache sets, about 1 hour. Slice and serve.\nSpecial Equipment\n10- by 15-inch jelly roll pan\nNotes\nThis butter cake is more fragile than a standard sponge cake roll. To minimize breakage, avoid overbaking the cake, and fill it when it has just completely cooled (letting the cake sit for an extended amount of time wrapped up in the towel may cause breakage when unrolled). But even if some cracks occur, they can be easily spackled and hidden with the ganache.\nRead More\nHot Chocolate and Marshmallow Cake Roll\nClassic Chocolate Yule Log\nOld-Fashioned Jelly Roll\nCakes\nBaking\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chocolate-roll-aka-giant-yodel-recipe.webp?"
}