{
  "url": "https://www.seriouseats.com/chocolate-hazelnut-torte-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/GT-nIDVkiaunvb6jHhGCJoH5v-k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__04__20130403-246999-chocolate-hazlenut-torte-1b72c5e07cbd4c9fbf133f102555c12f.jpg",
  "tags": [
    "Cakes",
    "Baking",
    "Chocolate",
    "Hazelnuts"
  ],
  "title": "Chocolate Hazelnut Torte Recipe",
  "full_text": "Chocolate Hazelnut Torte Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nActive\n20 mins\nCooling Time\n50 mins\nTotal\n100 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\ndark chocolate (65-70%)\n, chopped\n5\nounces\nof\nwhole hazelnuts\n(\n1\nheaping cup\n)\n1/2\ncup\n(\n1\nstick\n)\nbutter\n, at room temperature\n1/2\ncup\nplus\n2\ntablespoons\nsugar\n4\nlarge\neggs\n, at room temperature\n1 1/2\nteaspoons\nvanilla\n1/4\ncup\nflour\n3/4\nteaspoon\nsalt\n1/2\nteaspoon\ncinnamon\nPowdered sugar\nfor garnish\nDirections\nSet oven rack to the middle of your oven, and preheat to 400°F (200°C). Grease an 8-inch round cheesecake pan with butter and set aside. (An 8-inch springform pan will work just fine as well.)\nMelt chocolate over a double boiler. Start by setting a small pot of water to boil on the stove. Once water is boiling, reduce heat to low and set a heatproof bowl into the pot so that it rests on top and does not fall in. Add chocolate to the bowl and stir constantly until completely melted. Remove chocolate from heat and allow to cool completely.\nSpread nuts evenly on a rimmed baking sheet. When oven is at temperature, slide baking sheet into oven. Roast nuts until they are golden brown, about 6 minutes. Remove nuts from oven and allow to cool completely. Lower oven temperature to 350°F (180°C).\nUsing a dry, rough washcloth, rub nuts together to remove most of the skins. Transfer nuts to the bowl of a food processor and pulse until they form a semi-fine powder, about the texture of coarse sand, 10 to 12 short pulses. Do not over chop, or you'll end up with an oily, separated mess. Set aside ground nuts.\nIn the bowl of an electric mixer fitted with the paddle attachment, beat butter and sugar on medium speed until fluffy, about 2 minutes. Add eggs and vanilla, beating until mixed. Add flour, salt, and cinnamon, beating for another 30 seconds. Pour in ground hazelnuts and scoop in chocolate, beating until well mixed, about 1 minute.\nPour batter into the greased pan and bake until a toothpick inserted in the middle of the cake comes out with just a few streaks of matte-looking chocolate, about 30 minutes. The middle may still look a little underdone, which is fine as long as the toothpick isn't covered with what looks like wet chocolate batter. Once done, remove cake from oven and allow to cool in the pan on a cooling rack.\nOnce cake is cool, carefully remove the sides of the pan. Invert cake onto a serving platter and remove parchment circle. Let sit for 20 minutes before dusting liberally with powdered sugar for garnish. Serve immediately or seal in plastic before storing in the refrigerator.\nSpecial Equipment\n8-inch\ncheesecake pan\nor springform pan\nRead More\nHazelnut Chocolate Torte With Espresso Ganache\nFlourless Nutella Chocolate Torte\nDouble Chocolate Tart\nCakes\nBaking\nChocolate\nHazelnuts"
}