{
  "url": "https://www.seriouseats.com/chocolate-covered-candy-corn-cake",
  "image_url": "https://www.seriouseats.com/thmb/Qoug_VOpD7PZToGXFEwKwh-AQB0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__10__20131005-268660-candy-corn-cake-db7d92d3152245308be92c3db6af16ab.jpg",
  "tags": [
    "Cakes",
    "Layer Cake",
    "Halloween"
  ],
  "title": "Chocolate-Covered Candy Corn Layer Cake Recipe",
  "full_text": "Chocolate-Covered Candy Corn Layer Cake Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nActive\n2 hrs\nCooling and Chilling Time\n100 mins\nTotal\n2 hrs 35 mins\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor Cake:\n7\nlarge\negg whites\n1 1/2\ncups\nmilk\n, divided\n1\nteaspoon\nvanilla extract\n4 1/2\ncups\n(\n18\nounces\n)\ncake flour\n2 1/4\ncups\n(\n15 3/4\nounces\n)\ngranulated sugar\n2\ntablespoons\nbaking powder\n1 3/4\nteaspoons\nsalt\n18\ntablespoons\n(\n9\nounces\n)\nunsalted butter\n, cut into cubes, softened\n3\ntablespoons\nbutter flavoring\n(see note)\n1/2\nteaspoon\nyellow food coloring\n3/4\nteaspoon\norange food coloring\n1/4\nteaspoon\nterra cotta food coloring\n(see note)\nFor Frosting:\n10\ntablespoons\n(\n5\nounces\n)\nunsalted butter\n, softened\n1 1/4\ncups\n(\n5\nounces\n)\nconfectioners' sugar\n1\ntablespoon\nmilk\n1\ntablespoon\nbutter flavoring\n(or to taste)\nFor Ganache:\n6\nounces\nbittersweet chocolate\n, finely chopped\n2/3\ncup\nheavy cream\nCandy corn\nto garnish cake\nDirections\nFor the cake:\nAdjust oven rack to middle position and preheat oven to 350°F. Line 3 8- by 2-inch round cake pans with parchment paper. Grease pans.\nWhisk egg whites with 1/2 cup milk and vanilla; set aside. Place flour, sugar, baking powder, and salt in stand mixer fitted with paddle attachment. Mix on low speed until combined, about 1 minute. Add butter and mix on low speed just until moistened. Add remaining 1 cup milk and mix until combined.\nIncrease speed to medium-high and mix batter until light and fluffy, about 5 minutes. Reduce speed to low and mix in reserved egg white mixture until combined. Mix in butter flavoring.\nDivide batter evenly between three bowls. Add yellow food coloring to one of the bowls until it becomes a bright shade of yellow. Add both orange and terra cotta food coloring to another bowl of batter until it becomes a deep shade of orange.\nScrape batters into the prepared pans and bake until just set and a toothpick inserted into the center comes out clean, about 23 minutes. Let cakes cool in pan for 15 minutes, then transfer to wire rack to cool completely, about an hour.\nFor the frosting:\nPlace butter, confectioners' sugar, milk, and butter flavoring in mixer fitted with paddle attachment. Beat on medium speed until light and fluffy, about 5 minutes. Flavor to taste with butter flavoring.\nTo assemble cake:\nPlace yellow layer on an 8-inch plate and spread with about 1/2 cup frosting. Place orange layer on top and spread with about 1/2 cup frosting. Place white layer on top. Use remaining frosting to fill in any gaps along the sides.\nFor the ganache: Heat chocolate and cream in a heatproof bowl set over a pan of barely simmering water, gently whisking, until melted and smooth. Let cool briefly, until the consistency is pourable but not runny.\nPlace cake (on plate) on a wire rack that's been set in a rimmed baking sheet. Pour ganache over top of cake, letting it run down the sides. Chill until ganache is set, about 20 minutes, Garnish top with candy corn.\nSpecial equipment\n3 8-inch cake pans, mixer\nThis Recipe Appears In\nChocoholic: Chocolate Covered Candy Corn Layer Cake\nCakes\nLayer Cake\nHalloween"
}