{
  "url": "https://www.seriouseats.com/chocolate-cake-doughnuts-make-at-home-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uuWxgfHraeQA0Y4aG2C1I3f9D7w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230807-SEA-ChocolateCakeDonuts-RobbyLozano-002-cf8c99fab42b40bbb920f68f953b0196.jpg",
  "tags": [
    "Doughnuts",
    "Chocolate",
    "Desserts",
    "Cakes",
    "Mother's Day"
  ],
  "title": "Chocolate Cake Doughnuts",
  "full_text": "Chocolate Cake Doughnuts\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\n45 mins\nResting and Cooling Time\n20 mins\nTotal\n65 mins\nServes\n12 doughnuts\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Doughnuts:\n2 1/2\ncups\nall-purpose flour\n(\n11 1/2\nounces\n;\n325\ng\n), plus more for dusting\n1/2\ncup\nunsweetened Dutch-processed\ncocoa powder\n(\n2\nounces\n;\n60\ng\n)\n2\nteaspoons\nbaking powder\n(\n1/4\nounce\n;\n7\ng\n)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\nlarge\neggs\n1 1/4\ncups\ngranulated sugar\n(\n8 3/4\nounces\n;\n250\ng\n)\n1\ncup\n(\n240\nml\n)\nbuttermilk\n5\ntablespoons\nunsalted butter\n, melted and cooled (\n2 1/2\nounces\n;\n70\ng\n)\n2\nquarts\nneutral\noil\n, lard, or crisco for frying\nFor the Glaze:\n1/2\n(\n120\nml\n)\ncup\nwhole milk\n5\ncups\nconfectioners sugar\n(\n17.5\nounces\n;\n496\ng\n)\n2\nteaspoons\n(\n10\nml\n)\nvanilla extract\nPinch\nkosher salt\nDirections\nFor the Doughnuts:\nIn a large bowl, whisk together flour, cocoa powder, baking powder, and salt; set aside. In a second large bowl, whisk eggs until lightened and frothy, about 1 minute. Add sugar, buttermilk, and melted butter to eggs and whisk until combined, about 1 minute. Add the wet ingredients to the dry ingredients and mix with a large rubber spatula, until smooth dough forms. Do not overmix.\nSerious Eats / Robby Lozano\nLine 2 rimmed baking sheets with parchment paper and liberally dust with flour. Turn the dough out onto  a liberally floured work surface. Fold the dough over itself so it comes together in one mass, and let rest for 10 minutes. Liberally flour the top of the dough (it will be sticky, don't be afraid to use flour).\nSerious Eats / Robby Lozano\nUsing a floured rolling pin, press to flatten and roll the dough to a uniform 1/2-inch thickness. Using a 3-inch round cutter dipped in flour, cut out rounds. Using a 1-inch round cutter dipped in flour, cut a hole out of center of each round.  Transfer doughnuts and holes to prepared sheets. Gather dough scraps, and gently reroll, repeating cutting procedure. You should have about 12 doughnuts and doughnut holes.\nSerious Eats / Robby Lozano\nTo Prepare Frying oil and Glaze Setup:\nPlace a large, heavy pot on the stove and clip on thermometer to the side of the pot. Pour in the oil and heat oil to 375ºF (190ºC) over medium heat. Set a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels. Set tongs, spider skimmer, or chopsticks aside until ready to fry.(whatever you prefer to turn the doughnuts and remove them from the hot oil).\nSerious Eats / Robby Lozano\nFor the Glaze:\nOn another burner, warm the milk in a small saucepan set over low heat until the milk begins to steam. Remove it from heat and add the confectioner's sugar, pinch of salt, and vanilla and whisk until smooth. Pour the glaze into a heat-proof bowl and set the bowl over a small saucepan of water to keep warm, set aside.\nSerious Eats / Robby Lozano\nTo Fry the Doughnuts:\nGently place 3 doughnuts into 375°F oil. Cake doughnuts will sink to the bottom of the oil, then cook for a bit before rising up. Once the doughnut bobs to the surface, fry it for about 2 more minutes. Using a spider skimmer or tongs, gently flip doughnuts and continue to fry for an additional 2 minutes on the other side. Transfer the doughnuts to the prepared cooling rack. Break one open to check that it is cooked inside. If undercooked, return the batch of doughnuts to the hot oil to fry for an additional minute. Adjust frying time for remaining doughnuts as needed.\nSerious Eats / Robby Lozano\nReturn oil to 375 degrees and repeat with remaining doughnuts and doughnut holes. Let doughnuts sit until cool enough to handle, about 10 minutes.\nSerious Eats / Robby Lozano\nTo Glaze the Doughnuts:\nSet the pot of water with the bowl of glaze over low heat and stir until it returns to a pourable glaze consistency. Remove from heat and use your fingers to carefully submerge each of the doughnuts in the glaze. Place the glazed doughnuts on a clean cooling rack to dry. The glaze will become more translucent as it dries. For best flavor, serve immediately.\nSerious Eats / Robby Lozano\nSpecial Equipment\nRolling pin, clip-on digital thermometer, tongs or spider strainer\nRead More\nYeast-Raised Doughnuts\nDoughnuts\nChocolate\nDesserts\nCakes\nMother's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chocolate-cake-doughnuts.webp?"
}