{
  "url": "https://www.seriouseats.com/chocolate-banana-pudding-recipe-11754546",
  "image_url": "https://www.seriouseats.com/thmb/otMDb9iGqvW_C4wCr5JWJMfLzTo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250612-SEA-ChocolateBananaPudding-MorganGlaze-HERO-50b0a5135db14d3d9a331ea408b32de0.jpg",
  "tags": [
    "Chocolate",
    "The Latest",
    "Summer Desserts",
    "Soul Food & Southern",
    "Banana"
  ],
  "title": "Rich and Gooey Chocolate Banana Pudding",
  "full_text": "Rich and Gooey Chocolate Banana Pudding\nClose\nJump to recipe\nPrep\n45 mins\nCook\n15 mins\nChill\n10 hrs 30 mins\nTotal\n11 hrs 30 mins\nServes\n12\nMakes\n12 cups\nCook Mode\n(Keep screen awake)\nIngredients\n3\ncups\n(\n710\nml\n)\nwhole milk\n2\ncups\n(\n480\nml\n)\nheavy cream\n, divided\n7\nounces\ngranulated sugar\n(\n198\ng\n;\n1\ncup\n), divided\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n8\nlarge\negg yolks\n(about\n5\nounces\n;\n140\ng\n), cold\n1 1/2\nounces\ncornstarch\n(\n40\ng\n;\n5\ntablespoons\n)\n8\nounces\n(\n227\ng\n)\nchocolate\n, 70% cacao, chopped (about\n1 2/3\ncups\n), plus shavings for garnish\n2\nounces\nunsalted butter\n(\n57\ng\n;\n4\ntablespoons\n), cut into 1-inch cubes\n8\nounces\n(\n227\ng\n)\ncrème fraîche\n, at room temperature\n1\nteaspoon\nvanilla extract\n1\n(11-ounce) package\nvanilla wafers\n, such as Nilla, divided\n7\nmedium-size\nripe bananas\n(about\n7\nounces\n;\n200\ng\neach), sliced into 1/2-inch rounds (about\n6\ncups\n)\n1\ntablespoon\n(\n8\ng\n)\nconfectioners' sugar\nDirections\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nSerious Eats/ Morgan Hunt Glaze\nIn a large saucepan, combine milk, 1 cup heavy cream, 1/2 cup granulated sugar, and salt. Bring to a simmer over medium heat, stirring occasionally.\nSerious Eats/ Morgan Hunt Glaze\nIn a medium bowl set on top of a dampened towel, whisk egg yolks, cornstarch, and remaining 1/2 cup granulated sugar until pale yellow, smooth, and fluffy. Pour about 1/4 of the simmering milk mixture into the egg yolk mixture, whisking constantly, until smooth and combined.\nSerious Eats/ Morgan Hunt Glaze\nWhisk egg mixture into milk mixture. Cook over medium heat, whisking constantly, until pastry cream begins to thicken, 2 to 3 minutes. Continue cooking, whisking constantly, until large bubbles form on the surface, 30 seconds to 1 minute. Remove from heat, and whisk in chocolate and butter until melted and smooth. Whisk in crème fraîche and vanilla until no streaks remain. Using a fine-mesh sieve, strain pastry cream into a clean, large heatproof bowl. Immediately place plastic wrap directly on the surface of the cream to prevent a skin from forming. Transfer bowl to prepared ice bath to chill for 30 minutes, then refrigerate until cold, about 2 hours.\nSerious Eats/ Morgan Hunt Glaze\nSet aside 12 of the wafers for garnish. When ready to assemble, whisk pastry cream until smooth. Using a flexible or offset spatula, cover bottom of a 3-quart trifle bowl with about 1 1/4 cups of chilled pastry cream. Top evenly with a 1/4 of wafers (about 18 wafers). Arrange about 1/4 of sliced bananas evenly over wafers. Repeat layering 3 more times. Top with remaining 1 1/4 cups pastry cream in an even layer; place plastic wrap directly on the surface of the pastry cream to prevent a skin from forming. Refrigerate until wafers have softened and flavors have melded, at least 8 hours and up to 24.\nSerious Eats/ Morgan Hunt Glaze\nWhen ready to serve, prepare the whipped cream: In the bowl of a stand mixer fitted with a whisk attachment, whip remaining 1 cup heavy cream and confectioners' sugar on medium speed until soft peaks form, 2 to 3 minutes. Remove plastic wrap from pudding, and top with whipped cream. Garnish with reserved vanilla wafers and shaved chocolate. Serve.\nSerious Eats/ Morgan Glaze\nEquipment\nLarge saucepan; fine-mesh strainer, 3-quart trifle bowl\nMake-Ahead and Storage\nThe pastry cream can be refrigerated in an airtight container, with plastic wrap or buttered parchment paper placed directly on the surface, for up to 3 days.\nThe finished banana-chocolate pudding can be made up to 1 day in advance. To make the banana-chocolate pudding ahead of time, follow the recipe through step 6, waiting to top the dessert with whipped cream until you're ready to serve. To store leftovers, loosely cover with plastic wrap and refrigerate for up to 5 days.\nChocolate\nThe Latest\nSummer Desserts\nSoul Food & Southern\nBanana",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rich-and-gooey-chocolate-banana-pudding.webp?"
}