{
  "url": "https://www.seriouseats.com/chocolate-swiss-buttercream",
  "image_url": "https://www.seriouseats.com/thmb/m5kHiywfMYEa5ZJaGeyCgGS4jr4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__02__20180131-chocolate-swiss-buttercream-frosting-vicky-wasik-1-2-ea362e7aa98d49109233a641f1e05233.jpg",
  "tags": [
    "Chocolate",
    "Desserts"
  ],
  "title": "Chocolate Swiss Buttercream Recipe",
  "full_text": "Chocolate Swiss Buttercream Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n35 mins\nTotal\n35 mins\nServes\n48 servings\nMakes\n6 heaping cups\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\negg whites\n(\n2/3\ncup\n;\n170\ng\n), from\n5 to 6\nlarge\neggs\n11\nounces\ntoasted sugar\n, Belgian cassonade, or\nlight brown sugar\n(about\n1 2/3\ncups\n;\n310\ng\n); (see note)\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n(plus more if needed); for iodized salt, use half as much by volume or the same weight\n1/4\nteaspoon\ncream of tartar\n16\nounces\nunsalted butter\n(\n4\nsticks\n;\n455\ng\n), softened to about 65°F (18°C)\n1\nteaspoon\n(\n5\ng\n)\nvanilla extract\n(plus more if needed)\n8 to 14\nounces\nfinely chopped\ndark chocolate, between 70 and 77%\ncocoa solids (about\n1 1/3 to 2 1/3\ncups\n;\n225 to 395\ng\n)\n1\nteaspoon\ninstant espresso powder\n(optional), dissolved in a few drops of hot water\nDirections\nFill a wide pot with at least 1 1/2 inches water, with a thick ring of crumpled tinfoil placed on the bottom to act as a \"booster seat\" that will prevent the bowl from touching the bottom of the pot. Place over high heat until steaming-hot, then adjust temperature to maintain a gentle simmer. Combine egg whites, sugar, salt, and cream of tartar in the bowl of a stand mixer. Set over steaming water, stirring and scraping constantly with a flexible spatula, until egg whites hold steady at 185°F (85°C). This should take only 10 to 12 minutes, so if the mixture seems to be moving slowly, simply turn up the heat. Once ready, transfer to a stand mixer fitted with a whisk attachment and whip at high speed for about 10 minutes, until meringue is glossy, stiff, and cool to the touch, around 90°F (32°C).\nWith mixer still running, add butter, 1 or 2 tablespoons at a time. Initially, the volume of the meringue will decrease dramatically; it may even seem soupy along the way, but as the cool butter is added, the mixture will begin to thicken and cool. In the end, the buttercream should be thick, creamy, and soft but not runny, around 72°F (22°C). Mix in vanilla extract on low speed until well combined.\nSerious Eats / Vicky Wasik\nMelt chocolate, either in a microwave or over a water bath, until fluid and warm; start at the lower end of the suggested quantity range for a \"milk\" chocolate profile, or use the maximum amount for the deepest chocolate flavor. Scrape all of the warm chocolate into stand mixer bowl at once, then immediately begin whipping on medium-high until fully incorporated. Scrape bowl with a flexible spatula to ensure there is no unincorporated chocolate lurking around sides of bowl, then continue mixing until homogeneous. If you like, adjust to taste with additional salt, vanilla, or dissolved espresso powder to add depth of flavor.\nSerious Eats / Vicky Wasik\nUse buttercream right away, or transfer to a large zipper-lock bag, press out air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to approximately 73°F (23°C) and re-whip before using.\nTroubleshooting:\nIf warmer than 76°F (24°C), the buttercream will be soft and loose; pop it in the fridge for 15 minutes and re-whip to help it thicken and cool. If colder than 70°F (21°C), the buttercream will be firm and dense, making it difficult to spread over cakes and slow to melt on the tongue, creating a greasy mouthfeel. To warm, briefly set over a pan of steaming water, just until you see the edges melting slightly, then re-whip to homogenize. Full troubleshooting guide and video\nhere\n.\nSpecial Equipment\nLarge pot,\ndigital thermometer\n,\nstand mixer\nNotes\nSugars with a caramel flavor, such as\nquick-\nor\nslow-roasted sugar\n, or even Belgian cassonade (candi) sugar, tame the sweetness of meringue while underscoring the chocolate with a rich, toasty note. Molasses-based alternatives, such as turbinado, Demerara, or American-style light brown sugar, work well, too, but will give the buttercream a tangier profile overall.\nMake Ahead and Storage\nButtercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to approximately 73°F (23°C) and re-whip before using.\nChocolate\nDesserts"
}