{
  "url": "https://www.seriouseats.com/chocolate-cake-with-whipped-ganache-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/eMUYxKWmMmneYLt5TzT7FBGE8DU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120301-195206-layer-cake-610x458-20-68b6ea825c924755a0f0385467047e1b.jpg",
  "tags": [
    "Layer Cake",
    "Chocolate",
    "Cakes"
  ],
  "title": "Chocolate Cake with Whipped Ganache Frosting",
  "full_text": "Chocolate Cake with Whipped Ganache Frosting\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n60 mins\nCooling and Chilling Time\n2 hrs 40 mins\nTotal\n3 hrs 30 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n17.4\nounces\ngranulated sugar\n12\nounces\nbutter\n, softened\n3\nlarge\neggs\n, room temperature\n7.5\nounces\nwhole milk\n3.5\nounces\nwater\n2.5\nounces\ncocoa\n12\nounces\ncake flour\n, sifted\n1\nteaspoon\nbaking soda\n1\nteaspoon\nsalt\nFor the Whipped Ganache:\n24\nounces\nsemisweet chocolate\n, chopped into small pieces\n1\nquart\nheavy cream\n1\nteaspoon\nsalt\nOptional:\nsea salt\nfor sprinkling on top\nDirections\nFor the Cake:\nPreheat the oven to 350°F (180°C). If using cake pans, smear a small amount of butter in the bottom of each and line the bottoms with circles of parchment. If baking on a single jelly roll pan, cut a stencil in the size and shape of your desired cake, then trace it onto parchment that has been trimmed to sit flat in the pan. Smear an X of butter across the center and line the bottom with parchment.\nSift flour, baking soda, and salt together and set aside. Add boiling water to cocoa and mix, set aside to cool. In the bowl of a stand mixer fitted with a paddle attachment, cream butter and sugar together on high speed for 6-8 minutes, until very light and fluffy. Add eggs one at a time and beat well after each addition. Scrape down the sides and bottom of the bowl and the beater, and beat on high speed to ensure mixture is fully mixed. Stop mixer, add cocoa water and half the milk, plus half the dry ingredients. Mix on low until incorporated. Scrape down the mixer, then add the rest of the milk and dry ingredients. Mix thoroughly on low speed, scraping down one more time. Finish mixing with a big rubber spatula by hand, taking care not to over mix. If using cake pans, divide the batter evenly into three, if using the jelly roll pan, pour batter out and smooth evenly over the sheet with an offset spatula.\nSerious Eats / Lauren Weisenthal\nBake layers on middle rack of oven for 10 minutes, then carefully turn them and allow them to bake for an additional 10, or until the surface springs back a bit to the touch and cake pulls away from the sides. Remove cake from oven and allow to cool in pan(s) for 10 minutes. Invert cakes and pull off parchment, allow them to cool completely. Cover with plastic wrap to prevent drying.\nSerious Eats / Lauren Weisenthal\nFor the Whipped Ganache:\nChop chocolate very finely and place it in the bowl of a stand mixer. Bring cream and salt to a boil. Pour cream over chocolate and allow it to sit for one minute, then whisk until completely smooth (if you have a hand blender, this makes the process go faster). Chill ganache uncovered in fridge for two hours, stirring every twenty minutes. Once ganache feels cold but is still liquid, remove it from fridge and attach the bowl to the mixer. Whip using the whisk attachment, slowly at first, gradually increasing speed to high. You will notice mixture will thicken after about a minute, watch it closely. It will begin to hold soft peaks. Watch for it to get just slightly firmer, and don’t allow it to go any further. Ice cake with whipped ganache immediately after making, as it will begin to seize up if left to sit. Refrigerate cake until you are ready to serve, up to one day, allow it to come to room temperature before serving. Sprinkle with sea salt before serving if desired.\nSpecial Equipment\nKitchen scale, stand mixer, three 8-inch cake pans or 1 jelly roll pan, parchment paper\nLayer Cake\nChocolate\nCakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chocolate-cake-with-whipped-ganache-frosting.webp?"
}