{
  "url": "https://www.seriouseats.com/chocolate-pecan-galette-recipe-8742621",
  "image_url": "https://www.seriouseats.com/thmb/w_uq7PWGq5ugX1nFSKltw5i6j04=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241108-chocolatepecangalette-AmandaSuarez_1-0ef90da5d04b4517b821cce9acc534a8.jpg",
  "tags": [
    "Pastries",
    "Chocolate",
    "Desserts",
    "Fall Desserts",
    "Thanksgiving"
  ],
  "title": "This Chocolatey Spin on Pecan Pie Is Our Favorite Riff Yet",
  "full_text": "This Chocolatey Spin on Pecan Pie Is Our Favorite Riff Yet\nClose\nJump to recipe\nPrep\n2 hrs 30 mins\nCook\n35 mins\nCooling Time\n15 mins\nTotal\n3 hrs 20 mins\nServes\n8 servings\nMakes\n1 9-inch galette\nCook Mode\n(Keep screen awake)\nIngredients\nOld-fashioned flaky pie dough\n5\ntablespoons\nunsalted butter\n, melted (2.5 ounces; 70g)\n1/3\ncup\nlight corn syrup\n(4 ounces; 115g)\n1/3\ncup packed\ndark brown sugar\n(2.2 ounces; 62g), see note\n1 1/2\nteaspoons\nvanilla extract\n1/4\ncup\nall-purpose flour\n(1.2 ounces; 32g)\n2\nlarge\negg yolks\n(1 ounce; 30g)\nplus 1\nlarge\negg\n, divided\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ncup\npecans\n, roughly chopped (3.8 ounces; 108g)\n3/4 cup finely chopped\ndark chocolate\n(3.5 ounces;\n100\ng\n), see note\n1\ntablespoon\n(15ml)\nheavy cream\nWhipped cream or\nvanilla ice cream\n, for serving (optional)\nDirections\nFor the Dough:\nPrepare Old-Fashioned Flaky Pie Dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a roughly 14-inch round. Transfer this round to a parchment-lined aluminum rimmed baking sheet, cover with plastic, and refrigerate to relax and chill dough, at least 2 hours or up to 24.\nSerious Eats / Amanda Suarez\nFor the Filling:\nAdjust oven rack to middle position and heat oven to\n400°F (205ºC). In a medium bowl, whisk together the melted butter, corn syrup, brown sugar, flour, egg yolks,vanilla extract, and salt until smooth, then stir in the pecans and chopped chocolate. Arrange mixture in a single layer on prepared dough, leaving a 3-inch border all around.\nSerious Eats / Amanda Suarez\nTo Shape the Galette:\nFold one edge of the dough border up and over 3 inches of the filling. Repeat around the edge of the galette, overlapping the dough about every 3 to 4 inches to create a wide pleat around the perimeter. Place galette in freezer to chill for 15 minutes.\nSerious Eats / Amanda Suarez\nFor the Egg Wash\n: Meanwhile, whisk together the remaining egg with the cream in a small bowl. Brush egg wash over the border of the dough. Bake for 10 minutes, then reduce the oven temperature to 350ºF (175ºC). Continue baking until the crust is light golden brown and the filling is just starting to puff and crack, 35 to 40 minutes. Transfer the baking sheet to a wire cooling rack and let cool until puffing deflates, and the filling is gently set, at least 15 minutes. Slice into wedges and serve with whipped cream or vanilla ice cream, if desired.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRolling pin, rimmed baking sheet, pastry brush\nNotes\nChocolate chips do not work well in this recipe. Because of the added stabilizers in chips used to keep their shape intact, they don’t melt quite as well as other chocolate forms.  Insead, use dark chocolate bars (from 55% to 72% cacao, depending on your preference) or high-quality chocolate such as Valrhona. For tips on shopping, and some of our favorite brands, read more\nhere\n.\nThough this recipe will work with light brown sugar, we recommend using dark brown sugar for a more robust, flavorful filling.\nMake-Ahead and Storage\nThis galette is great served warm, but the texture of the filling is best when it is slightly chewy and has cooled to room temperature.\nDo not refrigerate or store the galette in an airtight container as it may cause the galette to become soggy.\nPastries\nChocolate\nDesserts\nFall Desserts\nThanksgiving",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-chocolatey-spin-on-pecan-pie-is-our-favorite-riff-yet.webp?"
}