{
  "url": "https://www.seriouseats.com/chocolate-pot-de-cremes-recipe-8788299",
  "image_url": "https://www.seriouseats.com/thmb/0dh7-seUIbDFczz1v2tg6Ld9fQY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250208-SEA-PotDeCreme-AmandaSuarez-13-8ebf7cbd23124be3b21b65c688c2e223.jpg",
  "tags": [
    "Chocolate",
    "French",
    "Custards, Mousses & Puddings",
    "Gluten-free Desserts",
    "Desserts"
  ],
  "title": "Chocolate Pot de Crèmes",
  "full_text": "Chocolate Pot de Crèmes\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nCooling and Chilling Time\n4 hrs 15 mins\nTotal\n5 hrs 5 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n4 1/2\nounces\n(\n128\ng\n)\nbittersweet chocolate\n, about 70% cacao, finely chopped\n1 1/4\ncups\n(\n355\nml\n)\nwhole milk\n3/4\ncups\n(\n180\nml\n)\nheavy cream\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3\nlarge\negg yolks\n3/4\nounce\ngranulated sugar\n(\n22\ng\n;\n1 1/2\ntablespoons\n)\n1/4\nteaspoon\nvanilla extract\nWhipped cream\n, for topping (optional)\nChocolate\nshavings, for topping (optional)\nDirections\nAdjust oven rack to middle position and preheat to 325ºF (160ºF). Set four 4-ounce ramekins in a large roasting pan; set aside.\nSerious Eats / Amanda Suarez\nPlace chocolate in a large mixing bowl; set aside. In a small saucepan, bring milk, heavy cream, and salt to a boil over medium heat. Pour over chocolate and let sit until chocolate begins to melt, about 3 minutes. Whisk until smooth.\nSerious Eats / Amanda Suarez\nIn a small bowl, whisk yolks, sugar, and vanilla extract to combine. Add yolk mixture to chocolate mixture and whisk until smooth.\nSerious Eats /Amanda Suarez\nDivide mixture evenly between ramekins. Pour just boiled water (around 180 to 200ºF; 88 to 93ºC) into baking dish until it comes 2/3 of the way up the ramekins; be careful not to splash water into ramekins as you pour. Carefully transfer roasting pan to middle rack ot oven and bake until puddings are just set, about 45 minutes. Remove roasting pan from oven and, using oven mitts or a kitchen towel, carefully remove ramekins from roasting pan; let cool on a wire rack for 15 minutes. Refrigerate until chilled and set, about 4 hours. Top with whipped cream and chocolate shavings, if desired.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFour 4-ounce ramekins, roasting pan, small saucepan, whisk, wire rack\nNotes\nThough most custard recipes may have you press plastic against the surface of the custard, there's no need to do that here: The surface of the custard darkens during cooking and appears as a skin, but does not form an actual skin.\nMake-Ahead and Storage\nThe custards can be made up to 3 days in advance, loosely covered in plastic wrap, and refrigerated.\nChocolate\nFrench\nCustards, Mousses & Puddings\nGluten-free Desserts\nDesserts"
}