{
  "url": "https://www.seriouseats.com/chopped-liver",
  "image_url": "https://www.seriouseats.com/thmb/KD3XBFMo9m_C3sYIxMS6H2uAKN8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__10__20181023-chopped-liver-vicky-wasik-22-e276811cd55c4698b1299f4e5cd663f6.jpg",
  "tags": [
    "Chicken",
    "Sides",
    "Snacks & Appetizers"
  ],
  "title": "Classic Jewish Chopped Chicken Liver Recipe",
  "full_text": "Classic Jewish Chopped Chicken Liver Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n60 mins\nTotal\n30 mins\nServes\n14\nto 16 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\nchicken livers\nKosher salt\n1/4\ncup\n(\n60\nml\n)\nschmaltz\n, plus more as needed (see note)\n1\nmedium\nyellow onion\n(about\n8\nounces\n;\n226\ng\n), finely minced (about\n1 1/3\ncups\n)\n3\nlarge\nhard-boiled eggs\n, peeled\n1/4\ncup\n(\n50\ng\n)\ngribenes\n(browned, crispy bits of fat and onion left over from making schmaltz), finely minced (optional)\nFreshly ground black pepper\nAdditional minced gribenes and\nhard-boiled egg\n, for garnish (optional)\nMatzo\nor other crackers, for serving\nDirections\nIf Using a Grill for the Livers:\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate. Proceed to step 3.\nIf Using a Broiler for the Livers:\nPreheat broiler and move oven rack to highest position, 2 inches away from heating element. Oil a slotted broiler pan, or a wire rack set in a rimmed baking sheet.\nUsing a paring knife, clean livers well of any fat, green spots, or large veins. Season all over with kosher salt. If using a grill, grill livers over high heat, uncovered, turning frequently, until they are very lightly charred in spots and only the last traces of pink remain in their centers, about 6 minutes. If using the broiler, arrange livers on the prepared broiler pan or wire rack and broil, turning once halfway through, until exteriors are well-browned and only the last traces of pink remain in the centers, 5-8 minutes. (If you are unsure about whether the livers are done, cut them open to check.) Remove from oven or grill and set aside.\nIn a medium stainless steel or cast iron skillet, heat schmaltz or other fat over medium heat until shimmering. Add onion and cook, stirring frequently, until desired doneness is reached. For less sweet onions, with some texture remaining, cook until softened but not browned, about 3 minutes; for sweeter onions that are very soft, cook until pale golden brown, about 8 minutes. (Lower the heat at any point to prevent burning.) If you wish, you can remove half the onion when it is softened, then continue cooking the other half until browned, for the best of both worlds.\nSerious Eats / Vicky Wasik\nIn the bowl of a food processor, combine cooked livers with eggs and pulse, scraping down the sides if needed, until a rough, crumbly paste forms; try not to over-process into a smooth paste, 12-15 pulses.\nSerious Eats / Vicky Wasik\nScrape minced liver and egg mixture into a mixing bowl. Scrape in cooked onion, along with all of the cooking fat. Add minced gribenes, if using. Stir until thoroughly combined, seasoning with salt and pepper as you go.\nAdd as much extra schmaltz as needed, 1 tablespoon at a time, to reach desired consistency. Exactly how much this is will depend on several variables, including your personal preference, though we recommend that chopped liver be spreadable and moist, not dry and crumbly.\nRefrigerate chopped liver in an airtight container, with plastic pressed directly against its surface to prevent it from discoloring, for up to 5 days. Allow to come to room temperature before serving. Garnish, if desired, with additional minced hard-boiled egg and gribenes, along with matzo or crackers on the side. We find that chopped liver tastes better after an overnight rest.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n; slotted broiler pan or\nwire rack\nand\nrimmed baking sheet\n(if broiling livers), or\ngrill\n(if cooking livers on the grill);\nmedium stainless steel\nor\ncast iron skillet\nNotes\nSchmaltz (rendered chicken fat flavored with onions) is by far the superior choice of cooking fat in this recipe, but if you don't have the time to make it, you can use a neutral vegetable oil instead.\nThis recipe uses cooking methods that align with kosher practices (such as grilling or broiling the livers), but the recipe itself is not guaranteed to comply with all kosher laws; check with an expert if you have any concerns.\nMake-Ahead and Storage\nChopped liver is best after an overnight rest and can be kept refrigerated for up to five days. Avoid freezing chopped liver, as that can ruin its consistency. Always keep plastic pressed directly against the surface of the chopped liver when storing it, since it can discolor and darken when exposed to air for prolonged periods.\nChicken\nSides\nSnacks & Appetizers"
}