{
  "url": "https://www.seriouseats.com/chopped-cheese-recipe-8605284",
  "image_url": "https://www.seriouseats.com/thmb/fkof-Y-_r0HTDhK8PdD9JoVQWJU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240308-SEA-ChoppedCheese-13-fbceb49d6dca4ef5a7ed1e137fecdbd7.jpg",
  "tags": [
    "Ground Beef",
    "The Latest",
    "Sandwiches"
  ],
  "title": "Chopped Cheese",
  "full_text": "Chopped Cheese\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nTotal\n30 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(\n225\ng\n)\nground beef chuck\n, 80% lean\n1\ntablespoon\nunsalted butter\n(\n14\ng\n)\n2\n(\n7- to 8-inch-long\n) Italian hoagie or\nsub rolls\n, split lengthwise, but left attached on 1 side to create a hinge\n1\ntablespoon\n(\n15\nml\n) neutral oil, such as vegetable or\ncanola oil\n1/2\nmedium\nyellow onion\n(\n4\nounces\n;\n113\ng\n), thinly sliced\nKosher salt\nFreshly\nground black pepper\n1 1/2\nteaspoons\nsazón or\nadobo\n1\nbeefsteak\ntomato\n(\n8 to 10\nounces\n;\n225\ng\n), sliced into 1/4-inch rounds\n1/4\nhead\niceberg lettuce\n, outer leaves discarded, finely shredded\n4\nslices\namerican cheese\nToppings and\ncondiments\n, as desired\nAluminum foil\nor\nparchment paper\n, for wrapping\nDirections\nDivide meat into 2 even portions, about 4 ounces (115g) each. Form into two 4-inch patties. Season patties liberally with kosher salt and pepper, transfer to a plate, and set aside.\nSerious Eats / Two Bites\nIn a 10- or 12-inch cast iron skillet, heat butter over medium heat until melted. Place buns cut side down and toast, one at a time, until lightly golden, 2 minutes. Set aside.\nSerious Eats / Two Bites\nIn the now-empty skillet, heat oil over medium heat until shimmering. Add onions, season with 1 1/2 teaspoons salt, and cook, stirring occasionally, until softened and translucent, about 5 minutes.\nSerious Eats / Two Bites\nUsing a heat-proof spatula or wooden spoon, push onions to one side of the skillet and add the patties to the empty side of the skillet. Cook without moving, until a dark crust develops, about 3 minutes. Using a spatula, carefully flip patties and cook until dark brown crust develops on second side, about 1 minute. Using the spatula, stir in the onions and sazón while breaking up patties until meat is chopped up into bite-sized pieces no larger than 1/2 inch. Cook until meat is no longer pink, 2 minutes. Season with salt and pepper to taste.\nSerious Eats / Two Bites\nIn the pan, divide ground beef and onion mixture into 2 individual portions the length of the rolls. Shingle 2 slices of American cheese over each portion; allow cheese to melt, 1 to 2 minutes.\nSerious Eats / Two Bites\nTo Assemble:\nOn a clean work surface, lay out a 16-inch wide piece of aluminum foil or parchment paper. Place toasted roll, cut side up, onto foil at a bias. Dress bread with desired condiments, fill with meat and onion mixture, and top with tomato slices and lettuce. Close sandwich and wrap tightly with foil. Using a serrated knife, halve the sandwich crosswise, and serve immediately.\nSerious Eats / Two Bites\nSpecial Equipment\nRimmed baking sheet, cast iron skillet, heat-proof spatula or wooden spoon, aluminum foil or parchment paper, serrated knife\nNotes\nThe recipe can be doubled to serve 4.\nGround Beef\nThe Latest\nSandwiches"
}