{
  "url": "https://www.seriouseats.com/choripan-argentinian-chorizo-sandwich-recipe-8605065",
  "image_url": "https://www.seriouseats.com/thmb/fejshfYIFgt9vDAw0BM94LNW1XQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240306-SEA-Choripan-KevinVaughn-hero-75b1f412c72647da9ea643bdb58e12ef.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Sausages",
    "South American"
  ],
  "title": "Choripán (Argentinian Chorizo Sandwich)",
  "full_text": "Choripán (Argentinian Chorizo Sandwich)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nChilling Time\n3 hrs\nTotal\n3 hrs 20 mins\nServes\n6\nMakes\n5 1/2 cups salsa\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salsa Criolla:\n1\nlarge\nwhite onion\n(\n8\nounces\n;\n227\ng\n)\n1\nsmall\nred bell pepper\n(about\n6\nounces\n;\n170\ng\n), stemmed, seeded, and cut into 1/2-inch dice\n1\nsmall\nyellow bell pepper\n(about\n6\nounces\n;\n170\ng\n), stemmed, seeded, and cut into 1/2-inch dice\n1\nsmall\ngreen bell pepper\n(about\n6\nounces\n;\n170\ng\n), stemmed, seeded, and cut into 1/2-inch dice\n2\nRoma\ntomatoes\n(\n8\nounces\n;\n226\ng\n), cut into 1/2-inch dice\n1\ncup\n(\n240\nml\n)\nextra-virgin olive oil\n1/2\ncup\n(\n120\nml\n)\napple cider vinegar\nSalt\nand\nfresh cracked pepper\n, to taste\nTo Assemble:\n6\nArgentinian\nchorizo\nor other pork and\nbeef sausage\nlinks\n, approximately\n100\ng\n(3 1/2 ounces) each (see note)\n6\nFrench bread rolls\nor hoagies\n1\nrecipe\nchimichurri\nDirections\nFor the Salsa Criolla:\nIn a medium-sized bowl, combine onion, bell peppers, and tomatoes. Stir in the olive oil, apple cider vinegar, salt, and pepper until well combined. Set aside in the refrigerator. (For best results, let salsa criolla rest for 3 hours in the fridge.)\nSerious Eats / Kevin Vaughn\nFor a Charcoal Grill:\nOpen bottom vent completely. Light chimney starter filled 3/4 of the way with charcoal briquettes (about 5 quarts). Once top coals are partially covered with ash, pour out and spread coals evenly on one side of the charcoal grate. Set grilling grate in place over coals, cover, and open lid vent. Heat until grill is hot (500°F; 260°C), about 5 minutes.\nClean\nand\noil\nthe grilling grate.\nFor a Gas Grill:\nTurn all burners to high, cover, and heat the grill until hot (500°F; 260°C), about 15 minutes. Keep all burners on high and clean and oil the grilling grate.\nUsing tongs, place sausages on grilling grate indirectly over heat (near but not directly above the coals for a charcoal grill setup). Cook, turning occasionally, until well-browned and crisped on the outside and cooked through, 9 to 11 minutes. (An instant read thermometer should register 160ºF or 71ºC.)\nSerious Eats / Kevin Vaughn\nMeanwhile, use a serrated knife to slice loaves horizontally, taking care not to cut all the way through. Open gently and toast on the hotter side of the grill until golden brown, 1 to 2 minutes. Serve sausages with buns, chimichurri, and salsa criolla.\nSerious Eats / Kevin Vaughn\nSpecial Equipment\nGrill, chimney starter, serrated knife\nNotes\nA typical Argentine chorizo is made of 75% pork and 25% beef. They’re smoky and typically seasoned with paprika and garlic. Look for them at specialty butchers and meat shops and at well-stocked grocery stores. If you can’t find Argentine chorizo, you can substitute another smoky, garlicky raw, uncured sausage. Mexican-style chorizo can be substituted in a pinch, but your sandwich will likely be spicier than if you use Argentine chorizo.\nMake-Ahead and Storage\nFor deeper flavor, let salsa criolla rest for up to 3 hours in the fridge. Resting lets the flavors marry and lessens the bite of the onion and vinegar. If making salsa and chimichurri ahead of time, remove condiments from fridge 30 minutes before serving to allow them to come to room temperature.\nSandwiches\nThe Latest\nSausages\nSouth American"
}