{
  "url": "https://www.seriouseats.com/chorba-frik-freekeh-soup-recipe-11697352",
  "image_url": "https://www.seriouseats.com/thmb/TAZL5ChhuAqYazCjVIavindL2C4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250311-SEA-ChobraFrik-MaiKakish-Beauty1-24-787a17975cc845efac3c58a310858f86.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Farro & Other Wheat",
    "North African",
    "Ramadan"
  ],
  "title": "Chorba Frik (Freekeh Soup)",
  "full_text": "Chorba Frik (Freekeh Soup)\nClose\nJump to recipe\nCook\n2 hrs\nSoaking Time:\n8 hrs\nTotal\n10 hrs\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\ndried\nchickpeas\n(\n3.3\nounces\n;\n95\ng\n) (see notes)\n5\nteaspoons\n(\n15\ng\n)\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume or the same weight\n1/4\nteaspoon\nbaking soda\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1\ntablespoon\n(\n15\nml\n)\nghee\n1\npound\n(\n450\ng\n)\nboneless lamb leg\nor shoulder, cut into 3/4-inch cubes (see notes)\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n227\ng\n), finely chopped\n1\ntablespoon\n(\n15\nml\n)\ntomato paste\n1 1/2\nteaspoons\nground coriander\n1 1/2\nteaspoons\nground ginger\n1 1/2\nteaspoons\npaprika\n1 1/4\nteaspoons\ndried mint\n1\nteaspoon\nground cinnamon\n1/2\nteaspoon\nfreshly\nground black pepper\n2\nmedium\ntomatoes\n(\n8\nounces\n,\n227\ng\n),\npeeled\n, and finely chopped\n1/2\ncup\nchopped\ncilantro\n(about\n1\nounce\n;\n28\ng\n) , plus more to garnish\n1/2\ncup\ncracked\nfreekeh\n(\n3\nounces\n;\n85\ng\n), picked over and rinsed\n4\ncups\n(\n960\nml\n)\nwater\n, plus more as needed\n1\nserrano\npepper\n(about\n15\ng\n), whole\nLemon wedges\n, to serve\nDirections\nIn a medium bowl, cover chickpeas with 1 inch of room temperature water. Add 2 1/2 teaspoons salt and baking soda, stirring briefly to combine, then cover loosely and let soak at room temperature at least 8 and up to 12 hours. Drain and rinse before using.\nIn a large heavy-bottomed pot or Dutch oven, heat oil and ghee over medium-high heat until just smoking. Add lamb and cook, stirring occasionally, until lightly browned on all sides, about 8 minutes.\nSerious Eats / Mai Kakish\nReduce heat to medium, add onion, and cook, stirring occasionally and scraping bottom of pot as needed, until onion is softened, about 5 minutes. Add tomato paste, coriander, ginger, paprika, mint, cinnamon, and black pepper and cook, stirring constantly, until spices are fragrant, about 30 seconds. Stir in tomatoes, cilantro, drained chickpeas, water, 2 1/2 teaspoons salt, and chile pepper, if using. Bring to a simmer, cover, then lower heat to medium-low and cook, adjusting heat as needed to maintain simmer, until lamb and beans are tender, 1 1/4 to 1 1/2 hours.\nSerious Eats / Mai Kakish\nStir in freekeh, bring to a simmer, and cook, covered, until freekeh is tender, 15 to 18 minutes. Soup should be hearty but still brothy enough to qualify as a chunky soup; add additional water to thin if needed. Season with salt to taste.\nSerious Eats / Mai Kakish\nSerious Eats / Mai Kakish\nDivide soup into individual bowls, sprinkle with more cilantro, and serve with lemon wedges.\nSerious Eats / Mai Kakish\nSpecial Equipment\nKitchen scale, large heavy-bottomed pot or Dutch oven, fine-mesh strainer\nNotes\nAlthough less commonly used in chorba frik, canned chickpeas may be used instead of dried ones. If using canned chickpeas, omit step 1, and substitute with one 15-ounce can drained and rinsed chickpeas. Reduce salt to 2 teaspoons and add the canned chickpeas at the same time as the freekeh.\nBeef chuck may be used in place of the lamb in the recipe, following the same steps as written.\nGhee can be purchased from Middle Eastern, Indian, and South Asian grocery stores. It is also increasingly found in many American grocery stores.\nCracked freekeh can be purchased from Middle Eastern grocery stores and ordered online.\nMake-Ahead and Storage\nLeftovers can be refrigerated in an airtight container for up to 4 days. The chickpeas and freekeh absorb more and more of the liquid the longer the soup sits; be sure to add more water to restore the desired soup consistency and adjust with salt and pepper to taste.\nSoups\nThe Latest\nFarro & Other Wheat\nNorth African\nRamadan",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chorba-frik-freekeh-soup.webp?"
}