{
  "url": "https://www.seriouseats.com/choreg-armenian-easter-bread",
  "image_url": "https://www.seriouseats.com/thmb/F7kpIbJis8KMyf1XWrZGcMJLs4Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210330-Choereg-AndrewJanjigian-5-1-d6b97c717d6346ff844c92ab818ff689.jpg",
  "tags": [
    "Middle Eastern",
    "Yeast Breads",
    "The Latest"
  ],
  "title": "Choreg (Armenian Easter Bread) Recipe",
  "full_text": "Choreg (Armenian Easter Bread) Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n45 mins\nActive\n90 mins\nProofing and Chilling Time\n20 hrs 10 mins\nTotal\n21 hrs 30 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Tangzhong:\n80\ng\n(\n2.8\nounces\n; a little over\n1/3\ncup\n)\nwhole milk\n40\ng\n(\n1.5\nounces\n; about\n1/4\ncup\n)\nbread flour\nFor the Dough:\n60\ng\n(\n2\nounces\n;\n1/4\ncup\n)\nwhole milk\n3\nlarge\neggs\n(\n165\ng\n)\n70\ng\n(\n2.3\nounces\n; about\n1/3\ncup\n)\nsugar\n325\ng\n(\n11.25\nounces\n; about\n2 1/2\ncups\n)\nbread flour\n9\ng\n(\n2 1/2\nteaspoons\n)\ninstant yeast\n5\ng\n(\n1 1/2\nteaspoons\n)\nwhole nigella seeds\n5\ng\n(\n1 1/2\nteaspoons\n)\nmahlab seeds\n, ground\n9\ng\n(\n1\ntablespoon\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n85\ng\n(\n3\nounces\n;\n6\ntablespoons\n)\nunsalted butter\n, cold, cut into 1/2-inch dice\nTo Finish and Bake:\n1\nlarge\negg\n(\n55\ng\n), beaten with a pinch of\nkosher salt\nand\n1\nteaspoon\n(\n5\nml\n)\nwater\n1\ntablespoon\n(\n9\ng\n) hulled\nsesame seeds\n1\nteaspoon\n(\n3\ng\n)\nnigella seeds\nDirections\nFor the Tangzhong:\nIn a 2-quart stainless steel saucier or 10-inch skillet, whisk together 80 grams milk and flour. Set over medium heat and cook, whisking constantly, until mixture comes together in a thick, mashed potato–like paste, about 2 minutes. Remove from heat, and using a rubber spatula, scrape into a stand mixer bowl (do not set bowl into stand mixer yet); set aside.\nFor the Dough:\nAdd milk, eggs, and sugar to flour paste and whisk vigorously until thoroughly combined. Add flour, yeast, nigella, and mahlab. Set bowl onto stand mixer, and, using a dough hook, mix on low speed until just combined and no dry flour remains, 2 to 4 minutes. Cover and set aside for 30 minutes.\nAdd salt and mix on low speed until thoroughly incorporated, about 1 minute. Add butter, increase speed to medium, and mix until butter is fully incorporated into dough and dough just starts to clear sides of bowl (it will remain webby, sticky, and attached to bottom of bowl), 12 to 15 minutes.\nTransfer dough to a lightly-oiled medium bowl, cover loosely with plastic wrap, and let sit at warm room temperature (75°F/24°C) for 45 minutes.\nUsing lightly moistened hands, fold dough over itself by gently lifting and folding edge of dough toward middle. Turn bowl 90 degrees; fold again. Turn bowl and fold dough 4 more times (total of 6 turns). Cover again with plastic wrap and let sit for 45 minutes.\nRepeat folding as described in step 5, cover, and let rest until dough is risen by about half, 30 to 90 minutes. Cover tightly and refrigerate for 12 to 18 hours. If making a large choereg loaf, proceed to step 7; if making rolls, proceed to step 9.\nFor a Large Choereg:\nTurn dough onto a clean, lightly-floured surface, but do not deflate. Flour top of dough and cut into 3 equal portions (about 280g or 9.75 ounces each). Roll and shape each portion into an even 5-inch log. Cover with plastic wrap, and rest for 30 minutes.\nLightly flour work surface. Using hands, roll each log from center into a 15-inch rope (do not taper ends). Repeat with remaining dough balls. Arrange strands in parallel, with short ends of ropes facing you, and then gently press together ends of ropes farthest from you, with center rope on top. Separate ends of ropes closest to you in fan shape, leaving center rope in place. Lift right rope over center rope and set it to the right of the left rope. Lift center rope and set it in the rightmost position, where right rope was originally positioned. Lift left rope over now-center rope (originally right rope) and set it in center position. Repeat braiding process until ropes of dough are entirely braided, then gently press ends together to seal. Transfer to parchment-lined baking sheet, cover loosely with plastic wrap, and allow to rise at warm room temperature (75°F/24°C) until almost doubled in size, 1 1/2 to 2 hours. Proceed to step 11.\nFor Rolls:\nTurn dough onto a clean, lightly-floured surface, but do not deflate. Flour top of dough and cut into 12 equal portions (70g or 2.5 ounces each). Roll and shape each portion into an even 2-inch log. Cover loosely with plastic wrap and rest for 30 minutes.\nUsing hands, roll each log from center into a 10-inch-long rope. Form rope into loop, leaving 3 inches of overhang on top end. Form into knot by pulling overhang under lower strand and through center of loop. Transfer to parchment-lined baking sheet, arranging rolls in a 4-by-3 pattern. Repeat with remaining logs. Cover loosely with plastic wrap, and allow to rise at warm room temperature (75°F/24°C) until almost doubled in size, 1 1/2 to 2 hours.\nTo Finish and Bake:\n30 minutes before baking, adjust oven rack to middle position for a large choereg, or upper-middle position for rolls, and preheat oven to 325°F (165°C). Brush surface of dough (loaf or rolls) with egg wash and let rest for 5 minutes. Brush again with egg wash, and sprinkle with sesame and nigella.\nFor a Large Choereg:\nBake until golden brown, 30 to 40 minutes, rotating baking sheet halfway through baking. Transfer baking sheet to wire rack and let cool for 5 minutes. Using a spatula, remove loaf from baking sheet and return to wire rack. Let cool at least 2 hours before slicing and serving.\nFor Rolls:\nBake until golden brown, 20 to 25 minutes, rotating baking sheet halfway through baking. Transfer baking sheet to wire rack and let rolls cool on baking sheet at least 15 minutes before serving.\nSpecial Equipment\nstand mixer, bench scraper, pastry brush, flexible spatula\nNotes\nNigella seed and mahlab (sour cherry seed kernels) are available in Middle Eastern grocery stores (nigella can also be found in South Asian markets, where it’s called kalonji) or online.\nIf not already ground, the mahlab should be ground to a fine powder in a spice grinder before use.\nThe dough is quite sticky, particularly before refrigerating; it’s relatively easy to shape when cold.\nWhen shaping dough, flour hands, countertop, and exterior of dough well, but try not to incorporate excess flour into the center of the loaf.\nWhen making ropes, it’s best to lightly coat your hands and the exterior of the dough with flour, but avoid excess flour on the counter itself, to maintain sufficient friction.\nMake-Ahead and Storage\nChoereg is best if eaten within 24 hours of baking, though it will keep for a few days if stored in a zipper lock bag.\nMiddle Eastern\nYeast Breads\nThe Latest"
}