{
  "url": "https://www.seriouseats.com/chorizo-potato-tacos-how-to-food-lab-recipe",
  "image_url": null,
  "tags": [
    "Tacos",
    "Sausages",
    "Mexican",
    "Russet Potatoes",
    "Cinco de Mayo"
  ],
  "title": "Crispy Potato and Chorizo Tacos Recipe",
  "full_text": "Crispy Potato and Chorizo Tacos Recipe\nJump to recipe\nCook\n45 mins\nActive\n40 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nrusset potatoes\n, cut into 1/2-inch dice (about\n3\nlarge\npotatoes)\nKosher salt\n1\ntablespoon\nwhite vinegar\n6\ntablespoons\nvegetable oil\n, divided\n1\npound\nfresh\nMexican chorizo\nor\nvegan Mexican chorizo\n12 to 16\nwarm soft\ncorn tortillas\n, for serving\n1\nwhite onion\n, minced, for serving\n1/2\ncup\nchopped fresh cilantro leaves\n, for serving\nHomemade\nor store-bought\nsalsa verde\n, for serving\n2\nmedium\nlimes\ncut into\n8\nwedges\neach, for serving\nDirections\nPlace potatoes in a large pot and cover with cold water by 1 inch. Add vinegar and 2 tablespoons salt. Bring to a boil over high heat and cook until potatoes are just cooked through, about 5 minutes after coming to a boil. Drain potatoes and let rest over sink until mostly dry.\nSerious Eats / Eric Kleinberg\nHeat 4 tablespoons vegetable oil in a large nonstick or cast iron skillet over medium-high heat until lightly smoking. Add potatoes, shake to distribute around the pan, and cook, tossing and stirring occasionally until very crisp and golden brown on all sides, about 15 minutes.\nSerious Eats / Eric Kleinberg\nMeanwhile, heat remaining oil in a medium nonstick or cast iron skillet over high heat until shimmering. Add chorizo and cook, stirring, until heated through. Continue cooking, stirring and tossing frequently, until all the liquid has evaporated, some fat breaks out, the chorizo starts sizzling, and eventually is quite dry and well-browned, about 15 minutes.\nSerious Eats / Eric Kleinberg\nTransfer cooked chorizo to pan with potatoes. Toss to combine and season to taste with salt. Serve chorizo and potato mixture immediately with tortillas, onions, cilantro, salsa, and limes on the side.\nSerious Eats / Eric Kleinberg\nTacos\nSausages\nMexican\nRusset Potatoes\nCinco de Mayo"
}