{
  "url": "https://www.seriouseats.com/choron-sauce-hollandaise-bearnaise-tomato-recipe",
  "image_url": "https://www.seriouseats.com/thmb/oIoFcw1icGFopstR7Ag3HjxxTj0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160817-steak-choron-sauce-vicky-wasik-9-e2d4955cbefd4cc58faf4670b6bd5518.jpg",
  "tags": [
    "Condiments & Sauces",
    "French",
    "Vegetarian",
    "Tomato"
  ],
  "title": "Choron Sauce (Tomato-Spiked Béarnaise Sauce)",
  "full_text": "Choron Sauce (Tomato-Spiked Béarnaise Sauce)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nActive\n35 mins\nTotal\n60 mins\nServes\n8 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\npounds\n(\n567\ng\n) ripe\nplum tomatoes\n(about\n6 to 7\nmedium\nplum tomatoes), diced (about\n3 to 3 1/4\ncups\n), see notes\n1/2\ncup\n(\n120\nml\n) dry\nwhite wine\n1/4\ncup\n(\n60\nml\n)\nwhite wine vinegar\n3\nsprigs\nchervil\n, leaves finely minced, stems reserved separately (optional; if not using add an extra sprig of tarragon)\n3\nsprigs\ntarragon\n, leaves finely minced, stems reserved separately\n1\nsmall\nshallot\n(\n1.2\nounces\n;\n33\ng\n), roughly chopped\n1/2\nteaspoon\nwhole black\npeppercorns\n2\nlarge\negg yolks\nKosher salt\n1 1/2\nsticks\nunsalted butter\n(\n12\ntablespoons\n;\n6\nounces\n;\n170\ng\n)\nDirections\nIn a medium saucepan, heat tomatoes over medium-high heat, stirring occasionally, until tomatoes begin to release their liquid, 3 to 5 minutes. Bring to a simmer, then lower heat to medium and cook, stirring occasionally, until much of the excess liquid has cooked off but the tomatoes aren't totally dry, 10 to 15 minutes.\nTransfer tomatoes and any juices to a fine-mesh strainer. Strain the tomatoes of seeds and skin, pushing all the pulp and juices through; use a wooden spoon and a scraping motion to pass the tomato flesh through into a bowl below; you should have about 3/4 cup.\nPlace strained tomato in a medium non-stick skillet; cook over medium heat, stirring frequently until deeper red in color, thickened, and reduced to 1/2 cup, about 2 to 4 minutes. Set aside.\nCombine wine, vinegar, herb stems, shallots, and black peppercorns in a small saucepan. Bring to a simmer over medium-high heat then reduce heat to medium-low to maintain a gentle simmer. Cook until reduced to about 1 1/2 tablespoons of liquid, 10 to 20 minutes. Carefully strain liquid through a fine-mesh strainer into a small bowl, pressing on the solids with the back of a spoon to extract as much liquid as possible.\nCombine wine reduction, egg yolks, and a pinch of salt in the bottom of a tall cup or container that barely fits the head of an immersion blender. Cook butter in a small saucepan over high heat, swirling constantly, until melted and foaming subsides. Transfer butter to a 1-cup liquid measuring cup.\nPlace head of immersion blender into the bottom of the cup with the wine reduction and turn it on. With the blender constantly running, slowly pour hot butter into cup. It should emulsify with the egg yolk and wine reduction. Continue pouring until all butter is added. Sauce should be thick and creamy (see notes). Add 1/4 to 1/2 cup tomato puree, blending until evenly combined and desired color and flavor is reached. Season to taste with salt. Stir in chopped tarragon and chervil, if using. Serve immediately, or transfer to a small lidded pot and keep in a warm place for up to 1 hour before serving. Béarnaise cannot be cooled and reheated.\nSpecial Equipment\nImmersion blender\n,\ntall container\nthat fits blender head,\nsmall saucepan\n,\nfine-mesh strainer\n, small lidded pot (optional)\nNotes\nYou can also substitute 2 tablespoons (32g) tomato paste instead of the reduced fresh tomato puree in this recipe. Skip the tomato puree cooking steps, make béarnaise as directed, and add tomato paste in place of the puree in Step 6.\nIf your sauce is thin and runny, transfer to a large bowl set over a pot of barely simmering water. Whisk constantly and vigorously until sauce is thickened.\nCondiments & Sauces\nFrench\nVegetarian\nTomato"
}