{
  "url": "https://www.seriouseats.com/choux-pastry",
  "image_url": null,
  "tags": [
    "Pastries",
    "French",
    "Easter Desserts"
  ],
  "title": "How to Make Choux Pastry (Pâte à Choux)",
  "full_text": "How to Make Choux Pastry (Pâte à Choux)\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nActive\n20 mins\nTotal\n25 mins\nServes\n18 puffs\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n235\ng\n) water or\nmilk\n(see note)\n6\ntablespoons\n(\n84\ng\n)\nunsalted butter\n, cut into 1/2-inch cubes\n2\nteaspoons\n(\n8\ng\n)\nsugar\n(optional; see note)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n4 1/2\nounces\nall-purpose flour\n(\n1\ncup\n;\n128\ng\n) , sifted\n4\nlarge\neggs\n(\n200\ng\n)\nDirections\nIn a 3-quart stainless-steel saucier or saucepan, combine water (or milk), butter, sugar (if using), and salt.\nSerious Eats / Vicky Wasik\nSet over high and and cook until liquid comes to a rolling boil and butter has fully melted, about 2 minutes (the small butter cubes should be fully melted just about at the same time the liquid hits a strong boil).\nSerious Eats / Vicky Wasik\nRemove from heat and add flour. Using a wooden spoon or stiff silicone spatula, thoroughly mix in flour until no lumps remain (make sure to hunt down and smash out any stubborn ones).\nSerious Eats / Vicky Wasik\nReturn saucepan to medium-high heat and cook, stirring very frequently, until dough registers 175°F (80°C) on an instant-read thermometer; if you don't have a thermometer, other signs the dough is ready include a thin starchy film forming all over the inside of the saucier and the dough pulling together into a cohesive mass.\nSerious Eats / Vicky Wasik\nTo use a stand mixer:\nTransfer dough to a stand mixer fitted with the paddle and beat at medium speed until dough registers 145°F on an instant-read thermometer (you need the dough cool enough that it doesn't cook the eggs when they hit it).\nSerious Eats / Vicky Wasik\nAdd eggs one at a time, making sure each is fully beaten into the dough before adding the next; it can help to start the mixer at medium-low speed for the first egg and then increase the speed to medium once the choux batter begins to develop.\nSerious Eats / Vicky Wasik\nScrape down sides of mixer bowl, then mix once more at medium speed just to ensure the choux batter is fully mixed, about 5 seconds.\nSerious Eats / Vicky Wasik\nAlternatively, to incorporate eggs by hand:\nLet dough cool in saucepan, stirring frequently, until it registers 145°F on an instant-read thermometer. Add eggs 1 at a time, stirring well between additions until each egg is fully incorporated before adding the next, until a smooth, shiny paste forms.\nUse choux right away, or hold at room temperature for up to 2 hours before using; how you use the choux will depend on the application, though it’s important to prevent a skin from forming, either by transferring the choux right away to a pastry or zipper-lock bag and keeping it sealed, or pressing plastic wrap directly against the choux’s surface.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart saucier\nor\nsaucepan\n,\nStand mixer\n,\npastry bag and tip\n(optional)\nNotes\nSugar is optional. At the very least, choux should be seasoned with salt. If it's going to be used for a dessert, a small amount of sugar can also be added to gently push it in a sweet direction.\nThe choux can be made up to 2 hours before using; keep at room temperature in a sealed pastry bag or with plastic pressed against its surface to prevent a skin from forming.\nPastries\nFrench\nEaster Desserts"
}