{
  "url": "https://www.seriouseats.com/chouquettes",
  "image_url": "https://www.seriouseats.com/thmb/bh2I07TVFaS-1yN4TaKnosbKH0g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201210-choux-chouquettes-vicky-wasik-7-48c584e6cc4a4044bd6b95c82f1eecc6.jpg",
  "tags": [
    "Desserts",
    "French",
    "Pastries",
    "Snacks & Appetizers",
    "Easter Desserts"
  ],
  "title": "Chouquettes",
  "full_text": "Chouquettes\nClose\nJump to recipe\nPrep\n15 mins\nCook\n55 mins\nActive\n40 mins\nTotal\n70 mins\nServes\n35 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\nchoux pastry\n(made with milk and the optional sugar),\ntransferred to a pastry bag\nfitted with a 1/2-inch plain round tip (see note)\n1\nlarge\negg\nwhisked with\n1\ntablespoon\nwater\nPearl (nib) sugar\n, for decorating puffs (see note)\nDirections\nAdjust oven rack to middle position and preheat to 400°F (204°C). Line one aluminum half-sheet tray with parchment paper. Pipe a small amount of choux paste under each corner of parchment paper (the dough acts as a glue and keeps the paper in place as you pipe).\nTo pipe the puffs, hold the filled pastry bag at a 90° angle, apply steady downward pressure, and pipe a 1-inch wide puff onto tray. To stop piping, cease applying pressure and swirl the pastry tip away. Continue to pipe puffs about 1 inch apart, for a total of about 24 puffs. To smooth the surface of any uneven puffs, dip a finger into cold water and gently pat down any bumps.\nUsing a pastry brush, gently brush a light layer of egg wash on each mound, being careful not to let excess egg wash drip down onto the parchment.\nSprinkle a generous pinch of pearl sugar on top of each mound, pushing down very gently to ensure it adheres to the surface. Bake until chouquettes are puffed, deeply golden brown, and feel hollow when lifted, about 20 minutes. Turn off oven, crack the door open, and let stand for 30 minutes to allow chouquettes to dry and fully set.\nThe chouquettes are best eaten within several hours of being baked.\nSpecial Equipment\nDisposable pastry bags\nNotes\nIf you don't have a pastry bag and tips, you can make do by transferring the choux paste to a gallon zipper-lock bag and snipping a roughly 1/2-inch hole in one corner of the bag and squeezing the choux mounds out of it.\nIf you want to make sure that each puff is the right size, you can prepare a template ahead of time. Take one sheet of parchment paper and, using a 1-inch round cutter as a guide, trace circles, then flip paper upside down and set it on the baking sheet.\nPearl sugar, sometimes also sold as nib sugar, are large grains of white sugar that won't melt during baking. They're crisp but airy, creating a pleasing texture that's sweet and crunchy but not hard.\nMake-Ahead and Storage\nThe baked chouquettes can be refrigerated in an airtight container for up to 3 days. Wrapped tightly in plastic and kept in an airtight container, they can be frozen for up to 1 month. To refresh refrigerated or frozen chouquettes, transfer to a baking sheet and reheat in a 350°F (176°C) oven until crisp, about 5 minutes.\nDesserts\nFrench\nPastries\nSnacks & Appetizers\nEaster Desserts"
}