{
  "url": "https://www.seriouseats.com/choux-au-craquelin",
  "image_url": null,
  "tags": [
    "Pastries",
    "Baking",
    "French",
    "Easter Desserts",
    "The Latest"
  ],
  "title": "Choux au Craquelin Recipe",
  "full_text": "Choux au Craquelin Recipe\nJump to recipe\nPrep\n80 mins\nCook\n30 mins\nActive\n30 mins\nTotal\n110 mins\nServes\n18 choux au craquelin\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\n(\n1/2\ncup\n;\n115\ng\n)\nlight brown sugar\n4\nounces\n(1 stick;\n115\ng\n)\nunsalted butter\n, cut into 1/2-inch cubes, and softened to about 68°F (20°C)\n4\nounces\n(about\n1\nscant cup\n;\n115\ng\n)\nall-purpose flour\n, sifted\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nOne\nrecipe\nchoux pastry\n(made with\nwater\n),\ntransferred to a pastry bag\nfitted with a 1/2-inch plain round tip\nOne\nrecipe\nvanilla\n,\nchocolate\n, or\nlemon\npastry cream\n, or\none\nrecipe\ncrème légère\n, transferred to a pastry bag fitted with a 1/4-inch plain round tip (see note)\nDirections\nTo Make the Craquelin Top by Hand:\nIn a medium bowl and using a flexible spatula, mash together brown sugar and butter, then stir until smooth and creamy, about 3 minutes.\nSerious Eats / Debbie Wee\nAdd flour and salt, thoroughly mixing until no dry flour remains and a damp, crumbly meal has formed, about 2 minutes.\nSerious Eats / Debbie Wee\nAlternatively, to Make the Craquelin Top in a Stand Mixer:\nIn the bowl of a stand mixer fitted with the paddle attachment, beat the brown sugar and butter on medium speed until smooth and creamy, about 2 minutes.\nSerious Eats / Debbie Wee\nScrape down the bowl and beater with a flexible spatula. Add flour and salt, then beat on medium-low speed until no dry flour remains and a damp, crumbly meal has formed, about 2 minutes.\nSerious Eats / Debbie Wee\nUsing your hands, bring dough together to form a ball (it will be a bit sticky but do not add extra flour). Place a sheet of parchment paper on a work surface and set dough on top. Shape dough into a roughly 6- by 8-inch flat rectangle.\nSerious Eats / Debbie Wee\nCover with a second sheet of parchment paper. Using a\nrolling pin\n, roll out dough into a 1/8-inch-thick rough rectangle 1/8 inch thick (it should be about 12-by-14 inches in size); reposition both sheets of parchment paper as needed to minimize creasing. Transfer dough, along with parchment paper, to a rimmed baking sheet and freeze until cold, about 5 minutes (or refrigerate until cold, about 15 minutes). Meanwhile, line a second baking sheet with parchment paper.\nSerious Eats / Debbie Wee\nRemove top sheet of parchment paper. Using a 2-inch round cutter, stamp out 18 pieces of craquelin. Working quickly, transfer craquelin rounds to the prepared baking sheet in a single layer, and return to freezer; you may need to slide an offset spatula under the cut-outs to loosen them from the parchment paper. If desired, craquelin dough scraps can be re-rolled out, chilled, and cut into new rounds (see Make Ahead section for more on holding extra, uncooked rounds).\nSerious Eats / Debbie Wee\nAdjust oven racks so that one is in upper-middle position, the other is in lower-middle position, and preheat oven to 375°F (191°C). Line two aluminum baking sheets with parchment paper. Pipe a small amount of choux paste under each corner of parchment paper (the dough acts as a glue and keeps the paper in place as you pipe).\nHolding the filled pastry bag at a 90° angle, apply steady downward pressure and pipe a 2-inch-wide choux (see note). To stop piping, cease applying pressure and swirl pastry tip away. Continue to pipe choux about 3 inches apart, for a total of 9 choux. Repeat with second tray. Top each choux with a craquelin cut-out, making sure it’s positioned parallel to the floor of the baking sheet, then press down slightly to ensure it adheres to the highest point of the piped choux. Bake both trays, switching racks and rotating trays front to back after 20 minutes, until choux au craquelin are puffed, deeply golden brown, and feel hollow when lifted, about 30 minutes total. For sandwich-style choux au craquelin, proceed to the next step; for piped-in choux au craquelin, proceed to step 11.\nSerious Eats / Debbie Wee\nTo Fill Sandwich-Style Choux au Craquelin:\nTurn off oven. Let trays rest in oven with oven door partially open for 30 minutes. Remove from oven and let cool completely, about 15 minutes. Using a serrated knife, slice each puff in half to create a top and bottom \"bun.” Transfer your choice of filling (see notes section below for filling instructions) to a pastry bag fitted with a 3/4-inch star tip. Working with one at a time, begin piping with steady pressure to generously fill the bottom half of each choux. Cover with the top half of each choux. Repeat until all choux au craquelin are filled. Serve immediately.\nSerious Eats / Debbie Wee\nTo Fill Piped-In Choux au Craquelin:\nWorking quickly, while choux au craquelin are still hot, gently insert the tip of a paring knife into the underside of each choux and rotate in a circular motion to create a small hole about 1/4 inch in size, then return to tray. Set both trays in the turned-off but still warm oven with the door partially open for 30 minutes. Remove from oven and let cool completely, about 15 minutes.\nSerious Eats / Debbie Wee\nWorking with one at a time, insert tip of pastry cream–filled bag into hole in each choux and begin piping with steady pressure until filled (you can tell because the choux will feel heavy and pastry cream will start to overflow the hole). Wipe away any excess pastry cream. Repeat until all choux au craquelin are filled. Serve immediately.\nSerious Eats / Debbie Wee\nSpecial Equipment\nRolling pin,\nround cutters\n,\ndisposable pastry bags\nNotes\nIf you want to make sure that each puff is the right size, you can prepare a template ahead of time. Take one sheet of parchment paper and, using a 2-inch round cutter as a guide, trace 9 circles that are 3 inches apart. Flip paper upside down and set it on the baking sheet. Repeat with a second piece of parchment paper.\nTo enjoy the choux au craquelin unfilled, you can skip poking holes in the bottoms. Once both trays are done baking, simply turn off the oven and leave the door partially open for 30 minutes (Step 9), then serve immediately.\nFor Sandwich-Style Choux au Craquelin\nIf you're making sandwich-style choux au craquelin, you'll need a greater volume of filling than this recipe provides. There are several ways to arrive at the right amount:\nPastry cream:\nMake a double batch of any of the pastry cream recipes (or make a batch each of the different flavors).\nWhipped cream:\nIn a large mixing bowl or in the bowl of a stand mixer fitted with the whisk attachment, combine 2 cups heavy cream, sugar to taste, and a splash of vanilla extract. Whisk by hand or mix at medium speed until thick peaks form (peaks should not be loose or stiff in structure).\nCrème légère:\nMake a single batch of crème légère.\nMake-Ahead and Storage\nFilled and unfilled choux au craquelin are best consumed on the day they’re made.\nUncooked craquelin cut-outs can be stored in an airtight container in the refrigerator for up to 3 days or in the freezer for up to 1 month.\nTo store unfilled choux au craquelin, wrap them tightly in plastic and place in an airtight container; they can be kept frozen for up to 1 month. To refresh, preheat oven to 350°F (177°C). Transfer frozen choux au craquelin to a sheet tray and reheat until crisp, about 5 minutes. If filling, let cool at room temperature first before doing so.\nPastries\nBaking\nFrench\nEaster Desserts\nThe Latest"
}