{
  "url": "https://www.seriouseats.com/chupin-de-pescado-argentine-fish-tomato-stew-recipe-7499672",
  "image_url": "https://www.seriouseats.com/thmb/YG3aI0fOJv5b3rWAC6VkW6UePV0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230517-SEA-Chupin--Kevin-Vaughn-hero-21d64546c69a4cf185a62c6ee5193979.jpg",
  "tags": [
    "Fish",
    "The Latest",
    "Tomato",
    "South American"
  ],
  "title": "Chupín de Pescado (Argentine Fish and Tomato Stew)",
  "full_text": "Chupín de Pescado (Argentine Fish and Tomato Stew)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nTotal\n105 mins\nMakes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\n(5-ounce; 140 g)\nportions firm-fleshed white fish, such as snapper,\nsea bass\n, monkfish, or catfish (see notes)\nKosher or fine\nsea salt\nAll-purpose flour\n, for dusting (about\n1/2\ncup\n;\n65\ng\n)\n1/2\ncup\n(\n120\nml\n) canola or other neutral\noil\n1\nlarge\nyellow onion\n(about\n10\nounces\n;\n285\ng\n), diced\n1\nmedium\ncarrot\n(about\n4\nounces\n;\n115\ng\n), peeled and diced\n1\nmedium\nred bell pepper\n(about\n4\nounces\n;\n115\ng\n), stemmed, seeded, and diced\n3/4\ncup\n(\n200\nml\n) dry\nwhite wine\n, such as chardonnay or sauvignon blanc\n1\n(14.5-ounce; 411 g) can\nwhole peeled tomatoes with their juices or\n5\nripe\nplum\ntomatoes\n(about\n1 1/4\npounds\n;\n565\ng\ntotal), tomatoes crushed or diced\n1/2\nteaspoon\ndried oregano\n1/2\nteaspoon\nsmoked paprika\n1/4\nteaspoon\nground cumin\n2\ncups\n(\n473\nml\n)\nvegetable stock\n, fish stock, or water (see notes)\n1 1/2\npounds\n(\n750\ng\n)\nrusset potatoes\n(about\n3\nlarge\npotatoes), halved lengthwise, then cut into 1/2-inch-thick slices\n1/2\ncup\n(\n100\ng\n)\nfrozen peas\n(see notes)\nDirections\nSeason fish with salt. Spread flour in a wide, shallow bowl, then lightly dust fish all over in flour, shaking off any excess, and transfer to a plate.\nSerious Eats / Kevin Vaughn\nIn a 5-quart Dutch oven, heat oil over medium heat until shimmering. Working in batches if necessary to avoid crowding the pot, add fish and cook, turning once, until golden on both sides, about 5 minutes per side. Return fish to plate and set aside; leave oil in pot.\nSerious Eats / Kevin Vaughn\nAdd onions to Dutch oven, season lightly with salt, and cook over medium-low heat, stirring occasionally, until softened and translucent, about 10 minutes. Add carrots and cook, stirring occasionally, until softened, about 5 minutes. Add bell pepper and continue to cook, stirring, until softened, about 5 minutes longer. Add white wine, bring to a boil over high heat, then reduce heat to a simmer and cook until raw alcohol smell is mostly gone, about 3 minutes.\nSerious Eats / Kevin Vaughn\nAdd tomatoes and their juices, oregano, smoked paprika, and cumin and cook, stirring occasionally, until slightly thickened, about 15 minutes. Add stock (or water) along with the potatoes, bring to a simmer, and cook until a paring knife inserted into the potatoes slides in with only a touch of resistance, about 20 minutes.\nSerious Eats / Kevin Vaughn\nReturn fish to pot, nestling it into the liquid and vegetables, and cook until meat is cooked through, about 10 minutes (the actual cooking time will depend heavily on the thickness of your particular pieces of fish, so keep an eye on it). Add peas and cook until just heated through. Serve right away.\nSerious Eats / Kevin Vaughn\nNotes\nAny mild yet firm white-fleshed freshwater or saltwater fish is acceptable in this dish; while I have had it made from freshwater fish, along Argentina’s Atlantic Coast, similar preparations of chupín call for saltwater fish like grouper and hake. If the fish has edible skin (such as snapper and sea bass), feel free to leave it on. If you buy a whole fish and break it down yourself (or have the fishmonger butcher it for you), look for one that is between 2 and 3 pounds (1-1.4kg). you can remove the head and tail (reserve those for broth; see below), then cut the body crosswise into three roughly 1- to 2-inch-thick, bone-in steaks. You can then split each of those steaks vertically through the middle so that you end up with six nice-sized bone-in fish \"chops.\" Alternatively, you can buy the fish as steaks, or as fillets, whether with or without bones, though it's best to get thick and meaty fillets that will hold together in the stew, not thin flaky ones that will fall to pieces.\nIf you buy a whole fish to make this, you can prepare a quick fish broth from the head and tail: In a medium sauce pot, combine fish head and tail, 1 quartered yellow onion, the cloves on 1 head garlic garlic, 5 sprigs fresh thyme, 1 teaspoon whole black peppercorns, and a pinch of salt and cover with water (at least 1 quart; 1L). Bring to a bare simmer, then continue to cook at a bare simmer for 30 minutes. Strain and discard solids.\nThis recipe can also work with fresh peas, though if you use them, you should add them just before the carrots to give them more time to soften.\nFish\nThe Latest\nTomato\nSouth American",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/chupn-de-pescado-argentine-fish-and-tomato-stew.webp?"
}