{
  "url": "https://www.seriouseats.com/churros-recipe-11680433",
  "image_url": "https://www.seriouseats.com/thmb/R-eLqXKFkRKzOQEv7X10RYd_7Uo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250218-SEA-Churros-AmandaSuarez-30-53f11155b6a24d749ad0c91d1db9d2b4.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Breakfast & Brunch",
    "Spanish",
    "Portuguese Cuisine"
  ],
  "title": "Truly Great Churros",
  "full_text": "Truly Great Churros\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nFreezing Time\n30 mins\nTotal\n80 mins\nServes\n4\nto 6\nMakes\n12 churros\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\n(\n355\nml\n)\nwater\n12\ntablespoons\n(\n168\ng\n)\nunsalted butter\n, cut into 1/2-inch cubes\n4\nteaspoons\n(\n16\ng\n)\nsugar\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n9\nounces\nall-purpose flour\n(\n2\ncups\n;\n256\ng\n), sifted\n2\nlarge\neggs\nNeutral\noil\n, such as peanut or canola, for frying\nCinnamon sugar\n, optional (see notes)\nThick hot chocolate\n, for dipping (optional; see notes)\nDirections\nIn a 3-quart stainless-steel saucier or saucepan, combine water (or milk), butter, sugar, and salt.\nSerious Eats / Amanda Suarez\nSet over high and and cook until liquid comes to a rolling boil and butter has fully melted, about 4 minutes.\nSerious Eats / Amanda Suarez\nRemove from heat and add flour. Using a wooden spoon or stiff silicone spatula, thoroughly mix in flour until no lumps remain (make sure to hunt down and smash out any stubborn ones).\nSerious Eats / Amanda Suarez\nReturn saucepan to medium-high heat and cook, stirring very frequently, until dough registers 175°F (80°C) on an instant-read thermometer; if you don't have a thermometer, other signs the dough is ready include a thin starchy film forming all over the inside of the saucier and the dough pulling together into a cohesive mass.\nSerious Eats / Amanda Suarez\nLet dough cool in saucepan, stirring frequently, until it registers 145°F on an instant-read thermometer. Add eggs 1 at a time, stirring well between additions until each egg is fully incorporated before adding the next, until a smooth, shiny paste forms.\nSerious Eats / Amanda Suarez\nTransfer choux dough to a pastry bag fitted with a roughly 1/2-inch (15mm) star piping tip. Line a rimmed baking sheet with parchment and, using a ruler as a guide and a permanent marker for easily visible lines, draw 12 evenly spaced 7-inch lines. Flip paper over, then, holding the bag at a 45° angle, lightly drag the tip along the surface of the paper and apply steady downward pressure, while slowly piping a 1-inch wide line of choux following a single line on the template. To stop piping, cease applying pressure and move the pastry tip up and over toward the opposite end of the churro before completely lifting away. Continue to pipe until tray is full. Transfer to freezer and freeze until firm, at least 30 minutes. (If desired, you can skip this freezing step and instead pipe the pastry directly into the frying oil, snipping each length free with lightly oiled kitchen shears before piping the next, though this is a little trickier than freezing.)\nSerious Eats / Amanda Suarez\nSet a wire rack inside a rimmed baking sheet and line rack with paper towels. In a large Dutch oven or fryer, heat 2 inches of oil over medium-high heat to 350°F (175°C). Working in batches to avoid crowding the oil, fry frozen choux sticks until puffed and deep golden, about 2 minutes. Using a spider or strainer, carefully transfer churros to prepared wire rack and let drain. If using cinnamon sugar, toss churros in it while still warm to adhere, and/or serve with hot, thick chocolate (if desired) for dipping on the side.\nSerious Eats / Amanda Suarez\nNotes\nTo make cinnamon sugar, mix 1 cup sugar with 1/2 teaspoon and a pinch of salt.\nFeel free to use any\nhot chocolate recipe\nyou like, though it's important to make it thick enough to function as a dip that can coat the churros when dunked into it; thin drinking chocolate will not do.\nSpecial Equipment\nPastry bag and 1/2-inch (15mm) star piping tip (or another roughly similar size star piping tip); instant-read or probe thermometer for frying, kitchen shears (if not freezing churros), wire rack, rimmed baking sheet\nMake-Ahead and Storage\nOnce frozen, the churro sticks can be transferred to a zipper-lock bag and frozen for up to 1 month. Fry directly from frozen as directed in the recipe.\nDesserts\nThe Latest\nBreakfast & Brunch\nSpanish\nPortuguese Cuisine"
}