{
  "url": "https://www.seriouseats.com/cincinnati-chili-recipe-8402230",
  "image_url": "https://www.seriouseats.com/thmb/1zK1T9D0N0GN__YFV5A_2Ikfa3A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231115-SEA-CincinnatiChili-AmandaSuarez-hero-a514c4778b1a4050b7fea964b8e3b373.jpg",
  "tags": [
    "Chili",
    "The Latest",
    "Stovetop",
    "Ground Beef"
  ],
  "title": "Cincinnati Chili",
  "full_text": "Cincinnati Chili\nClose\nJump to recipe\nCook\n4 hrs\nTotal\n4 hrs\nServes\n8\nto 10\nMakes\n2 1/2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chili:\n2 pounds (\n900\ng\n)\nground beef\n, preferably 80% lean\n2 medium sweet\nonions\n(about 8 ounces;\n227\ng\neach), finely minced\n6\ncloves\ngarlic\n, finely minced or grated\n3/4\ncup\ntomato paste\n(one 6-ounce can)\n2 tablespoons (\n30\nml)\nred wine vinegar\n1 tablespoon (\n15\nml\n)\nWorcestershire sauce\n3\nbay\nleaves\n1 1/2 tablespoons (\n15\ng\n) Diamond Crystal\nkosher salt;\nfor table salt, use half as much by volume or the same weight, plus more to taste\n1/3 cup (\n50\ng\n) active\ndry yeast\n2 tablespoons (\n15\ng\n)\nchili powder\n2 tablespoons (\n15\ng\n) sweet\npaprika\n1\nteaspoon\nground allspice\n1/2 teaspoon\ncayenne pepper, plus more to taste\n1\nteaspoon\nground cinnamon\n1\nteaspoon\nground cumin\n1\nteaspoon\noregano\n1\nteaspoon ground\nwhite pepper (can substitute black pepper if necessary)\n1/2\nteaspoon\nground cloves\n1/2\nteaspoon\nground ginger\nTo Serve:\n1 1/2\npounds (\n680g) dried\nspaghetti\n1/4\ncup (60ml)\nextra-virgin olive oil\n1/4\ncup (57g)\ntomato paste\n1 medium sweet\nonion\n(about\n8\nounces\n; 227g), grated (optional)\nOne 1\n5\n-\nounce\n(425g)\ncan kidney beans\n, warmed and drained (optional)\n1 1/2\npounds\n(680g) medium\ncheddar\n, finely shredded using the small holes on a box grater\nThin\n,\nvinegary\nhot sauce\n, such as Frank’s Red Hot or Crystal\nOyster\ncrackers\nDirections\nFor the Chili:\nIn a large Dutch oven, combine 1 quart (1L) cold water with the beef. Using a stiff whisk or potato masher, stir vigorously until beef is broken up and a thick slurry forms, about 2 minutes. Add 1 more quart (1L) water along with the onions, garlic, tomato paste, vinegar, Worcestershire sauce, bay leaves, salt, yeast, chili powder, paprika, allspice, cayenne, cinnamon, cumin, oregano, white pepper, cloves, and ground ginger and mix well.\nSerious Eats / Amanda Suarez\nSet Dutch oven over high heat and bring to a boil, stirring frequently. Lower heat to maintain a gentle simmer and cook, stirring and scraping occasionally, until chili has thickened to a coherent texture, no longer soupy but not yet thick enough to stand a spoon in, and the flavors have melded, about 3 hours. Season with additional salt, if desired.\nSerious Eats / Amanda Suarez\nTo Serve:\nIn a large pot of salted boiling water, cook spaghetti until softened and no longer al dente, about 2-3 minutes longer than box directions. Meanwhile, in a large bowl, whisk together olive oil and tomato paste. Using tongs, transfer cooked spaghetti to tomato paste mixture, allowing excess water to drain back into the pasta pot each time. Toss until evenly coated.\nSerious Eats / Amanda Suarez\nDivide spaghetti among (preferably oval; see notes) serving plates, then top with a few generous ladles of chili, a scattering of onion and/or beans (if desired), and a generous pile of shredded cheddar cheese (about 3 ounces per serving). Serve with hot sauce and oyster crackers at the table, for diners to add as desired.\nSerious Eats / Amanda Suarez\nNotes\nCincinnati chili just doesn't look right on a round plate. It doesn't eat right, either. Native Cincinnatians start at one (short) side and methodically work our way to the other, cutting the noodles with the sides of our forks and scattering oyster crackers as we go. On a round plate, the chili feels formless. But, you know, use what you’ve got.\nMake-Ahead and Storage\nThe chili can be refrigerated for up to 5 days in an airtight container. Reheat gently before serving.\nChili\nThe Latest\nStovetop\nGround Beef"
}