{
  "url": "https://www.seriouseats.com/cioppino-recipe-8766189",
  "image_url": "https://www.seriouseats.com/thmb/Du5iV_rzlfVS_y3xZIuKYbAacOM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-cioppino-vicky-wasik-35-442bc0d48eec4e3fa2529f42e52797a8.jpg",
  "tags": [
    "Seafood",
    "American",
    "Italian-American"
  ],
  "title": "A Step-by-Step Guide to Making Restaurant-Quality Cioppino at Home",
  "full_text": "A Step-by-Step Guide to Making Restaurant-Quality Cioppino at Home\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs\nTotal\n2 hrs 20 mins\nServes\n6\nto 8 Servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Seafood Stock:\n2 tablespoons (\n30\nml\n)\nextra-virgin olive oil\n1\nmedium\nyellow onion\n(8 ounces; 227g), diced (about 2 cups)\n1 medium head\nfennel\n(9 ounces;\n255\ng\n), trimmed of fronds and stalks (fronds reserved), then roughly diced (about 1 1/2 cups)\n2 large\ncelery ribs\n(about 3 1/2 ounces; 100g each), diced (about\n1\ncup\n)\n4 medium\ncloves garlic\n(\n20\ng\n), smashed\n1/4 cup (\n65\ng\n)\ntomato paste\n6\nblue crabs\n, rinsed (optional)\n2 1/2\nounces\nreserved\nshrimp\nshells (see below)\n1 cup (\n240\nml\n) dry\nwhite wine\n2 1/2 pounds (\n1.1\nkg\n) non-oily white\nfish\nheads and/or bone cages, such as snapper, bass, or halibut, washed well\nFour 8–fluid ounce (\n240\nml\n) bottles\nclam juice\n3\nsprigs flat-leaf\nparsley\n2\ndried\nbay leaves\n10\nwhole black\npeppercorns\nFor the Roasted Red Pepper Salsa:\n2\nred bell peppers\n(6 ounces;\n170\ng\n)\n1/4 cup (\n60\nml\n)\nextra-virgin olive oil\n1 tablespoon (\n15\nml\n)\nfresh lemon juice\n1\ntablespoon\n(15ml) chile paste, such as Calabrian chile paste,\nsambal oelek\n, or sriracha\n1/4 cup minced fresh herbs, such as flat-leaf\nparsley\nleaves and tender stems and reserved fennel fronds (3/4 ounce;\n20\ng\n)\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Cioppino:\n1/4 cup (\n60\nml\n)\nextra-virgin olive oil\n1 medium\nyellow onion\n(8 ounces;\n227\ng\n), finely diced (1 1/2 cups)\n1 medium head\nfennel\n(9 ounces;\n255\ng\n), trimmed of fronds and stalks (fronds reserved), finely diced (1 1/2 cups)\n6 medium\ncloves garlic\n(\n30\ng\n), minced\n1/4\nteaspoon\nred pepper flakes\n2\nteaspoons\n(10g) chile paste, such as Calabrian chile paste,\nsambal oelek\n, or sriracha (optional)\n4\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\nOne 28-ounce (\n794\ng\n) can whole peeled\ntomatoes\n, tomatoes crushed well by hand or a potato masher\n2 1/2\nquarts\n(1.9L) Seafood\nStock\n(recipe above)\n3/4 pound (\n340\ng\n) cleaned\nsquid\nbodies and tentacles, bodies cut crosswise into 1/2-inch rings\n2 pounds\nmussels\n(about 36 mussels;\n900\ng\n), de-bearded and rinsed\n1 dozen\nlittleneck clams\n, purged\n1 pound (\n454\ng\n) halibut or other firm white-fleshed\nfish\n, cut into 2-ounce portions\n3/4 pound (\n340\ng\n)\nshrimp\n, shelled and deveined (shells reserved for seafood stock, above)\n8 ounces (\n227\ng\n) jumbo\ncrabmeat\n(optional)\nSourdough\nbread\nslice\ns, toasted, rubbed with garlic, and drizzled with extra-virgin olive oil, for serving\nDirections\nFor the Seafood Stock:\nIn a large, 8- or 12-quart heavy-bottomed pot, heat olive oil over medium-high heat until shimmering. Add onion, fennel, celery, and garlic, and cook, stirring, until softened and beginning to brown, about 7 minutes. Stir in tomato paste and cook for 1 minute.\nAdd crabs (if using) and shrimp shells, and cook, stirring and scraping often, until shells are cooked through and turning red, 3 to 4 minutes.\nAdd white wine, bring to a boil, then cook until raw alcohol smell is gone, about 4 minutes. Add fish heads and bones along with the clam juice. Cover with water (at least 2 1/2 quarts). Add parsley, bay leaves, and black peppercorns. Bring to a boil, reduce heat to a simmer over medium low heat, and cook for 1 hour. Strain seafood stock and reserve until ready to make cioppino. You should have about 2 quarts (1.9L); add enough water to bring total volume of the stock up to 2 1/2 quarts (2.4L), then set aside.\nMeanwhile, for the Roasted Red Pepper Salsa:\nWorking directly over the flame of a gas burner or under a broiler, cook the red bell peppers, using tongs to turn occasionally, until deeply charred all over, about 10 minutes. Transfer to a heatproof bowl, cover with plastic, and let stand 5 minutes.\nUsing paper towels, rub charred skin off peppers. Stem and seed peppers, then roughly chop flesh and add to a blender jar or tall, narrow vessel compatible with an immersion blender.\nAdd olive oil, lemon juice, chile paste and minced fresh herbs and, using an immersion blender, blitz until fairly smooth. Stir in salt, then set aside or refrigerate for up to 5 days until ready to use.\nFor the Cioppino:\nIn a large 8- or 12-quart, heavy bottomed pot, heat olive oil over medium heat until shimmering. Add onion, fennel, garlic, red pepper flakes, and chile paste (if using). Season with 2 teaspoons salt, and cook, stirring often, until very soft but not browned, about 15 minutes; lower heat if necessary to prevent browning.\nAdd crushed tomatoes and their juices along with the 2 1/2 quarts (2.4L) Seafood Stock. Bring to a simmer over medium heat. Add squid and cook at a gentle simmer over medium low heat  for 18 minutes. Increase heat to medium high; add mussels and and clams. Bring to a simmer and reduce heat to medium; cook until they just begin to pop open, about 3 minutes. Season halibut with 3/4 teaspoon salt, gently add to broth, cook for 2 minutes. Season shrimp with 1/2 teaspoon salt, then add to broth, cook until shrimp is just pink and halibut is just cooked through, about 1 minute. Remove from heat, all the mussels and clams should be open (discard any that are unopened). Using tongs and a spider or slotted spoon, pick out 20 mussels and transfer to a medium bowl. Shell the mussels, add the mussels back into the broth, and discard the shells. Season broth with remaining 3/4 teaspoon salt.\nIf using crabmeat, add to a strainer and lower into the simmering broth until just warmed through, about 30 seconds, then remove and arrange on a small serving bowl. Divide stew among bowls. Garnish with reserved fennel fronds, and serve with toasted sourdough, the Roasted Red Pepper Salsa, and warmed crab (if using).\nSpecial Equipment\nLarge heavy-bottomed pot, tongs, immersion blender, spider or slotted spoon\nNotes\nTo purge clams, set them in a large mixing bowl and cover with cold water. Add a generous amount of salt (about 2 tablespoons Diamond Crystal kosher salt per 1 quart water) and let stand 30 minutes. Lift clams from water, discard water and rinse out bowl. Repeat this process until no sand is visible in the bottom of the bowl.\nIf you live in an area where Dungeness crabs are available and want to splurge, you could use cooked Dungeness in place of the lump crabmeat suggested here; divide the Dungeness crabs into manageable pieces and warm in the broth before serving.\nMake-Ahead and Storage\nThe seafood stock can be refrigerated for up to 3 days or frozen for up to 5 months. The red pepper salsa can be refrigerated in an airtight container for up to 5 days.\nSeafood\nAmerican\nItalian-American"
}