{
  "url": "https://www.seriouseats.com/citrus-marinated-tofu-with-onions-and-peppers",
  "image_url": "https://www.seriouseats.com/thmb/YlBEpCGMtXYfNyVAqnylldi9UGc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120229-195128-dinner-tonight-citrus-marinated-tofu-with-onions-and-peppers-primary-5ef45f35ab224ea7befd0b7d559f0892.jpg",
  "tags": [
    "Tofu"
  ],
  "title": "Citrus-Marinated Tofu with Onions and Peppers Recipe",
  "full_text": "Citrus-Marinated Tofu with Onions and Peppers Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n30 mins\nMarinating Time\n15 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\nchopped fresh cilantro\n, divided\n2/3\ncup\nfresh\nlime juice\n1/4\ncup\nminced garlic\n3 1/2\nteaspoons\nground cumin\n, divided\n3/4\nteaspoon\nsmoked paprika\n, divided\nKosher salt and freshly ground black pepper\n1\n(\n1-pound) block\nmedium tofu\n, cut into 1/2-inch slices\n4\ntablespoons\nextra-virgin olive oil\n, divided\n1\ntablespoon\nhoney\n1\nmedium\nred onion\n, cut into 1/4-inch rounds\n3\nred bell\npeppers\n, stemmed, seeded, cut into 1/4-inch thick slices\nDirections\nAdjust oven rack to bottom third position. Preheat oven to 450°F. Meanwhile, in a small bowl, combine 1/4 cup cilantro, lime juice, garlic, 3 teaspoons ground cumin, and 1/2 teaspoon paprika. Season with a pinch of salt and pepper. Stir well. Pour half of this mixture into a large plastic bag. Add the tofu, and carefully toss. Set aside at room temperature for 15 minutes.\nPour the other half of the marinade into a blender, along with 1/4 cup cilantro, 2 tablespoons olive oil, and the honey. Puree until smooth. Season to taste with salt and pepper.\nIn a large bowl, toss the red onion and bell pepper with 2 tablespoons olive oil, 1/2 teaspoon cumin, 1/4 teaspoon paprika, and a pinch of salt and pepper. Line a large baking sheet with aluminum foil. Transfer the pepper and onion mixture to one half of the baking sheet.\nDrain the tofu and season both sides with salt and pepper. Place pieces on the empty half of the baking sheet.\nTransfer baking sheet to the oven. Cook until vegetables are tender, and the tofu is lightly browned, 20 to 25 minutes. Make sure to stir the vegetables and carefully flip the tofu halfway through.\nDivide the mixture between four plates. Drizzle with the sauce and garnish with cilantro. Serve with white rice or corn tortillas.\nTofu"
}