{
  "url": "https://www.seriouseats.com/citrus-salad-with-xo-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/lmiIFkjG_4EMynv0yVkTjIoL5FI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190411-citrus-salad-xo-sauce-vicky-wasik-3-7af4c88dcf594952bed8417190067e5d.jpg",
  "tags": [
    "Salads",
    "Fruit",
    "No-Cook Salads",
    "Grapefruit",
    "Orange"
  ],
  "title": "Citrus Salad With XO Sauce and Meyer Lemon Dressing Recipe",
  "full_text": "Citrus Salad With XO Sauce and Meyer Lemon Dressing Recipe\nClose\nJump to recipe\nPrep\n10 mins\nActive\n10 mins\nTotal\n10 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n)\nmixed citrus fruit\n(such as oranges, grapefruit, pomelos, tangelos, clementines, mandarins, and tangerines), peeled and cut into 1/4-inch-thick rounds, juices reserved separately (see note)\n2\nmedium\nscallions\n(\n40\ng\n), white and green parts divided, white parts minced, green parts thinly sliced on a bias\n12\nsprigs\n(\n12\ng\n)\nfresh cilantro\n, leaves and tender stems divided, stems minced\n1\nsmall\ngreen or red\nThai chile\n, stemmed and minced (see note)\n1\nteaspoon\nfinely grated\nzest\nfrom\n1\nMeyer lemon\n(see note), plus\n1\ntablespoon\n(\n15\nml\n)\njuice\n1\ntablespoon\n(\n15\nml\n)\nhoney\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n1\nteaspoon\n(\n5\nml\n)\ntoasted sesame oil\n(optional)\nKosher salt\n1/4\ncup\n(\n75\ng\n)\nXO sauce\n3\ntablespoons\n(\n45\ng\n)\nroasted peanuts\n, coarsely chopped (optional)\nDirections\nIn a small bowl, combine reserved citrus juice, white scallion parts, cilantro stems, chile, lemon zest and juice, and honey. Whisking constantly, slowly drizzle in olive oil, followed by sesame oil (if using). Season to taste with salt.\nShingle citrus rounds on a large serving platter, pausing to spoon dressing over each layer of citrus before shingling more on top. Using a spoon, evenly drizzle remaining dressing over the citrus, followed by small spoonfuls of XO sauce, making sure to use some of the aromatic oil from the XO. Season citrus lightly with salt.\nSprinkle with peanuts (if using), followed by green scallion parts and cilantro leaves. Serve immediately.\nSpecial Equipment\nWhisk\nNotes\nSave any juice that ends up on your cutting board while slicing the citrus rounds, and be sure to squeeze out juice from any scrap end pieces of the fruit. It'll be delicious in the salad's dressing.\nThai chiles are very spicy, but adjustments can be made to modify the heat of the dressing as needed. For a milder dish, you can either use less chile or use a milder chili altogether, such as a stemmed and seeded jalapeño. Of course, you can also omit the chile entirely.\nIf you can't find Meyer lemons, substitute with a regular lemon.\nMake-Ahead and Storage\nThis dish comes together in a flash and is best enjoyed immediately.\nThis Recipe Appears In\nHow to Make XO Sauce, the Cook’s Condiment\nSalads\nFruit\nNo-Cook Salads\nGrapefruit\nOrange",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/citrus-salad-with-xo-sauce-and-meyer-lemon-dressing-recipe.webp?"
}