{
  "url": "https://www.seriouseats.com/classic-fresh-key-lime-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/4S0oB8hd7XWf1ZPZvROdMkESHMg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SeriousEats_KeylimePie_Robby-Lozano_Beauty-1_255_1-23eef560d92b4bf396ce0c5cb3358ae2.jpg",
  "tags": [
    "Pies",
    "American",
    "Baking",
    "Lime"
  ],
  "title": "Key Lime Pie",
  "full_text": "Key Lime Pie\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n30 mins\nChilling and Cooling Time\n5 hrs 15 mins\nTotal\n6 hrs 5 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n10\nwhole\ngraham crackers\n(\n5.5\nounces\n;\n155\ng\n)\n3\ntablespoons\ngranulated sugar\n(\n1.5\nounces\n;\n43\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n5\ntablespoons\nunsalted butter\n, melted and cooled (\n2.5\nounces\n;\n75\ng\n)\nFor the Filling:\n1\n(14-ounce; 397 g) can\nsweetened condensed milk\n4\nlarge\negg yolks\n1/2\ncup\n(\n118\nml\n) freshly squeezed\nkey lime juice\n(from approximately\n20\nKey limes\n)\n2\nteaspoons\ngrated Key\nlime zest\n, plus more for garnish\nFor the Topping:\n1/4\ncup\n(\n65\ng\n)\nmascarpone cheese\n2\ntablespoons\n(\n15\ng\n)\npowdered sugar\n3/4\ncup\n(\n177\nml\n)\nheavy whipping cream\nDirections\nPreheat oven to 375°F (190ºC). Place the graham crackers, sugar, and salt in the bowl of a food processor. Process for approximately 20 to 30 seconds, until the grahams are uniform, small crumbs. Add the melted butter and pulse until incorporated, about 5 pulses. Firmly press the mixture into the bottom and sides of the springform pan (the sides of the crust should only be about 1 inch tall). Chill the crust in the fridge for 15 minutes, then bake in preheated oven until set and lightly browned on the edges, 8 to 10 minutes. Transfer pan to a wire rack; let crust cool completely, about 30 minutes. Reduce the oven temperature to 325°F (160ºC).\nSerious Eats / Robby Lozano\nIn the bowl of the food processor, combine the sweetened condensed milk, egg yolks, Key lime juice, and zest. Process for 10 seconds, then stop, scrape down the sides, and process again until smooth and creamy, about another 10 seconds. Using a silicone spatula, scrape the mixture into the bottom of the cooled crust. Bake at 325°F (160ºC) for 13 to 16 minutes, until it is firm but still jiggles in the center (watch it closely, this pie will set up very quickly). Transfer to a wire rack to cool slightly, about 30 minutes, then place the pie in the fridge to chill for at least four hours.\nSerious Eats / Robby Lozano\nWhen ready to serve, release and remove the sides of the springform pan and transfer pie to a serving plate. In a large bowl, whisk together mascarpone and powdered sugar until smooth and creamy. Gradually add the cream and whisk until mixture holds soft peaks, 1 to 2 minutes.  Pipe or top the pie with the cream mixture and garnish with Key lime zest. Serve immediately.\nSerious Eat / Robby Lozano\nSpecial Equipment\n8-inch springform pan; food processor; silicone spatula\nPies\nAmerican\nBaking\nLime"
}