{
  "url": "https://www.seriouseats.com/classic-vanilla-butter-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/aJRoRhN0yFe8LXFz1CGJ_pekjp0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__05__20170412-vanilla-layer-cake-vicky-wasik-23-5da8c6517dcd43da91f048a75f6e8bc5.jpg",
  "tags": [
    "Layer Cake",
    "Cakes",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Classic Vanilla Butter Cake Recipe",
  "full_text": "Classic Vanilla Butter Cake Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n35 mins\nActive\n60 mins\nCooling and Chilling Time\n2 hrs\nTotal\n3 hrs 10 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n16\nounces\nplain or\ntoasted\nsugar\n(about\n2 1/4\ncups;\n455\ng\n)\n4 1/2\nteaspoons\nbaking powder\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n8\nounces\nunsalted butter\n(\n16\ntablespoons\n;\n225\ng\n), soft but cool, about 60°F (16°C)\n3\nlarge\neggs\n, brought to about 65°F (18°C)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\n16\nounces\nwhole milk\n(about\n2\ncups\n;\n455\ng\n), brought to about 65°F (18°C)\n16\nounces\nall-purpose flour\n(about\n3 1/2\ncups\n, spooned;\n455\ng\n)\nTo Finish:\n1\nrecipe\nSwiss buttercream\nDirections\nFor the Cake:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). Lightly grease three 8-inch anodized aluminum cake pans and line with parchment (explanation and tutorial\nhere\n). If you don’t have 3 pans, it’s okay to bake the cakes in stages, the batter will keep at room temperature until needed.\nIn the bowl of a stand mixer fitted with the paddle attachment, combine sugar, baking powder, salt, and butter. Mix on low speed to roughly incorporate, then increase to medium and beat until fluffy and light, about 5 minutes. About halfway through, pause to scrape the bowl and beater with a flexible spatula.\nSerious Eats / Vicky Wasik\nWith the mixer still running, add the eggs one at a time, letting each fully incorporate before adding the next, then dribble in the vanilla. Reduce speed to low and sprinkle in about 1/3 of the flour, then drizzle in 1/3 of the milk. Repeat with remaining flour and milk, working in thirds as before.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nScrape the bowl and beater with a flexible spatula, and resume mixing on medium speed for about 3 seconds to ensure everything is well combined. The batter should look creamy and thick, registering between 65 and 68°F (18 and 20°C) on a digital thermometer. (Significant deviation indicates ingredients were too warm or too cold, which can lead to textural problems with the cake.)\nFold batter once or twice from the bottom up with a flexible spatula, then divide evenly between prepared cake pans (about 20 ounces or 565g if you have a scale). Stagger pans together on the oven rack, and bake until puffed, firm, and pale gold, about 32 minutes. If your oven has very uneven heat, pause to rotate the pans after about 20 minutes. Alternatively, bake 2 layers at once and finish the third when they’re done.\nSerious Eats / Vicky Wasik\nCool cakes directly in their pans for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off the parchment, and return cakes right-side-up (covered in plastic, the cakes can be left at room temperature for a few hours). Prepare the buttercream.\nSerious Eats / Vicky Wasik\nFor the Crumb Coat:\nLevel cakes with a serrated knife (full directions\nhere\n) and set the scraps aside for snacking. Place one layer on a heavy cast iron turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with exactly 1 cup buttercream, using an offset spatula to spread it evenly from edge to edge. Repeat with the second and third layers, then cover the sides of the cake with another cup of buttercream, spreading it as smoothly as you can (tutorial\nhere\n). Refrigerate cake until the buttercream hardens, about 30 minutes.\nTo Finish:\nRewhip remaining buttercream to restore its creamy consistency, then use to finish and decorate the chilled cake as desired. Let the cake sit at room temperature for at least an hour before serving, otherwise it will be too cold inside. Cut with a chef’s knife to serve, and cover the exposed edges with leftover buttercream to keep the cake moist. Under a cake dome, the cake will keep for 3 days at room temperature.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\ndigital thermometer\n,\nthree 8-inch anodized aluminum cake pans\n,\nserrated knife\n,\ncast iron turntable\n(optional),\noffset spatula\nNotes\nProblems such as doming, cracking, shrinking, heavy crust development, and a coarse or wet crumb stem from excessive gluten formation due to the use of high protein flour. Cakes in particular benefit from all-purpose flours made from a blend of red and white wheat, such as bleached Gold Medal or Pillsbury.\nRead More\nThe Best Aromatic Vanilla Extracts\nA Guide to Cake Frosting\nWhite Cake With Brown Butter and Toasted Sugar\nTriple Coconut Cake\nLayer Cake\nCakes\nMother's Day\nFather's Day"
}