{
  "url": "https://www.seriouseats.com/classic-butternut-squash-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-xx6eLBm9ESUkYnW4DjHBtgFgZE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/classic-butternut-squash-soup-recipe-hero-03_1-74afd1ace5604fe096192819e1eaa7a9.JPG",
  "tags": [
    "Soups",
    "Butternut Squash",
    "Fall Mains",
    "Thanksgiving Appetizers",
    "Christmas Appetizers"
  ],
  "title": "Classic Butternut Squash Soup",
  "full_text": "Classic Butternut Squash Soup\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nActive\n30 mins\nTotal\n85 mins\nServes\n6 servings\nMakes\n2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n2 1/2–pound; 1 kg\n)\nbutternut squash\n,\npeeled, seeded, and cut into 1-inch cubes\n1\nlarge (\n8-ounce; 215 g\n)\ncarrot\n, peeled and cut into 1-inch chunks\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n7\ntablespoons\n(\n100\ng\n)\nunsalted butter\n, divided (see notes)\n1\nlarge (\n8-ounce; 215 g\n)\nyellow onion\n, thinly sliced\n4\nmedium cloves\ngarlic\n, thinly sliced\n4\ncups\n(\n1\nL\n) homemade or store-bought\nlow-sodium\nchicken\nor\nvegetable\nstock\n, plus more as needed\n2\nsprigs\nfresh thyme\n1\nbay leaf\nKosher salt\nand freshly ground black pepper\n3/4\ncup\n(\n180\nml\n)\nheavy whipping cream\n1/4\ncup\n(\n60\nml\n)\nsour cream\nPinch\nground cinnamon\nPinch\nnutmeg\n20\nfresh sage leaves\n(optional; see notes)\nDirections\nPreheat oven to 425°F (220°C). Toss squash and carrot with olive oil and arrange on 2 rimmed baking sheets, being sure not to overcrowd the sheets. Roast until squash and carrot are very well browned on a couple of sides, about 40 minutes; use a thin metal spatula to turn pieces 2 or 3 times during cooking. Set aside.\nSerious Eats / Julia Estrada\nIn a large saucepan, cook 2 tablespoons butter over medium-high heat until just starting to brown. Add onion and garlic, lower heat to medium, and cook, stirring, until soft and lightly golden, about 10 minutes; lower heat as necessary to prevent burning.\nSerious Eats / Julia Estrada\nAdd squash and carrot to saucepan and remove from heat. Pour 1/2 cup (120ml) stock into each baking sheet and scrape up any browned bits, then pour into saucepan. Add remaining stock, thyme sprigs, and bay leaf and return to medium-high heat. Bring to a simmer, then lower heat and simmer until vegetables are very soft, about 10 minutes. Discard thyme sprigs and bay leaf.\nSerious Eats / Julia Estrada\nUsing a high-powered blender, standard countertop blender or immersion blender, blend soup until completely smooth. Season with salt and pepper. Return soup to saucepan and thin, if necessary, with additional stock until desired consistency is reached. Keep warm.\nSerious Eats / Julia Estrada\nMeanwhile, in a stand mixer, or using a handheld mixer or whisk, beat cream and sour cream with cinnamon, nutmeg, and a pinch of salt, until stiff. Set aside.\nSerious Eats / Julia Estrada\nIf making frizzled sage leaves, melt remaining 5 tablespoons butter in a small skillet over medium-high heat, swirling gently, until foamy and just beginning to brown. Add sage leaves, swirling to submerge, and cook until frizzled, about 15 seconds. Using a slotted spoon, transfer sage to a paper towel to drain. Sprinkle very lightly with salt.\nSerious Eats / Julia Estrada\nLadle soup into warmed bowls, spoon dollops of spiced whipped cream into each one, and top with frizzled sage, if using. Serve right away.\nSerious Eats / Julia Estrada\nSpecial Equipment\nHigh-powered blender\n,\nstandard countertop blender\n, or\nimmersion blender\n;\n2 rimmed baking sheets\nNotes\nOf the seven tablespoons of butter, five are used for making the frizzled sage; if you decide to omit the sage, you will need only two tablespoons of butter.\nRead More\nHow to Make Creamy Vegetable Soups Without a Recipe\nMiso-Squash Soup with Sesame-Ginger Apples\nMexican Butternut Squash Soup with Ancho Chile, Crema, and Pepita\nSoups\nButternut Squash\nFall Mains\nThanksgiving Appetizers\nChristmas Appetizers"
}