{
  "url": "https://www.seriouseats.com/classic-pound-cake-recipe-8758207",
  "image_url": "https://www.seriouseats.com/thmb/11hFbsbhyjJFpt7QFBiPzm6JsY8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241210-ClassicPoundCake-AmandaSuarez-01-369d897deb5f4508b0caf96496bcc080.jpg",
  "tags": [
    "Cakes",
    "The Latest"
  ],
  "title": "Classic Pound Cake",
  "full_text": "Classic Pound Cake\nClose\nJump to recipe\nPrep\n20 mins\nCook\n70 mins\nCooling Time:\n75 mins\nTotal\n2 hrs 45 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n198\ng\nbleached cake flour\n(\n7\nounces\n;\n1 1/2\ncups\n), plus extra for flouring pan\n1\nteaspoon\nbaking powder\n4\nlarge eggs\n, room temperature\n10\ng\n(\n2\nteaspoons\n)\nvanilla extract\n227\ng\n(2 sticks)\nunsalted butter\n, softened plus extra for greasing pan\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n248\ng\nsugar\n(\n8 3/4\nounces\n;\n1 1/4\ncups\n)\n60\ng\n(\n1/4\ncup\n)\nwhole milk\n, room temperature\nDirections\nAdjust oven rack to middle position and heat oven to 325°F (160°C). Generously butter a 9- by 5-inch (or 8 1/2- by 4 1/2-inch) loaf pan; dust pan liberally with flour and knock out excess flour.\nIn a medium bowl, whisk flour and baking powder to combine; set aside. In a 2-cup liquid measuring cup or medium bowl, whisk eggs and vanilla until combined; set aside.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter and salt on medium-high speed until shiny, smooth, and creamy, 2 to 3 minutes, scraping down bowl as needed. Reduce speed to medium and gradually pour in sugar (this should take about 60 seconds). Once all sugar is added, increase speed to medium-high and beat until mixture is fluffy and almost white in color, 5 to 8 minutes, scraping down bowl as needed.\nSerious Eats / Amanda Suarez\nReduce speed to medium and gradually add egg mixture in slow, steady stream (this should take 60 to 90 seconds). Scrape down bowl. Increase speed to medium-high and beat mixture until light and fluffy, 3 to 4 minutes (mixture may look slightly broken).\nSerious Eats / Amanda Suarez\nStop mixer and scrape down bowl. On low speed, add 1/3 of the flour mixture, beat until just combined, then add milk and beat until combined. Add another 1/3 of the flour mixture, beat until just combined, then repeat with remaining flour. Scrape bottom of bowl to ensure that batter is homogenous.\nSerious Eats / Amanda Suarez\nTransfer batter to prepared loaf pan and smooth surface with rubber spatula. Bake until golden brown and wooden skewer inserted in center of cake comes out clean, 1 hour 10 minutes to 1 hour 20 minutes (see notes). Let cake cool in pan on wire rack for 15 minutes. Invert cake onto wire rack, then turn cake right side up. Let cake sit on wire rack until mostly cool, at least 1 hour. Slice and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nStand mixer with paddle attachment, 9- by 5-inch or 8 1/2- by 4 1/2 -inch loaf pan\nNotes\nIf the top of the pound cake starts to turn too dark before the center of the pound cake is fully cooked, loosely cover the top with a piece of aluminum foil and let finish baking until center of the cake is fully baked.\nMake-Ahead and Storage\nLeftover cake can be stored in an airtight container at room temperature for up to 5 days.\nCakes\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/classic-pound-cake.webp?"
}