{
  "url": "https://www.seriouseats.com/classic-duck-confit-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LdVImuWAyuQY9pYuh2HUXpxsw48=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200107-duck-confit-44-vicky-wasik-a9d310a1fcc3404190eb28853896762d.jpg",
  "tags": [
    "Fats & Oils",
    "Poultry Fats",
    "Duck Mains"
  ],
  "title": "Traditional Duck Confit",
  "full_text": "Traditional Duck Confit\nClose\nJump to recipe\nPrep\n10 mins\nCook\n4 hrs 5 mins\nActive\n20 mins\nCuring Time\n24 hrs\nTotal\n28 hrs 15 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nduck\nlegs\n(about\n2 1/4\npounds\ntotal;\n1\nkg\n) (see note)\n1\ntablespoon\nplus\n1\nteaspoon\n(\n16\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n6\nlarge\nshallots\n(\n12\nounces\n;\n340\ng\n), quartered\n1\nsmall\nonion\n(\n4\nounces\n;\n110\ng\n), cut into 2-inch pieces (see note)\n6\nmedium cloves\ngarlic\n(\n30\ng\n)\n1/2\nbunch\n(\n2\nounces\n;\n55\ng\n)\nflat-leaf parsley leaves and tender stems\n, roughly chopped\n10\nsprigs\nfresh thyme\n2\nteaspoons\n(\n6\ng\n)\nwhole black peppercorns\n2\nto\n4\ncups\n(\n475\nto\n950\nml\n)\nrendered duck fat\n(see note)\nDirections\nThe Day Before Cooking Confit:\nSeason duck legs evenly on all sides with salt; set aside. Combine shallots, onion, garlic, and parsley in food processor bowl and pulse until finely chopped but not puréed, about 15 pulses.\nSerious Eats\nTransfer half the vegetable mixture to a nonreactive container that can fit duck legs snugly, such as a baking dish, and spread in an even layer. Scatter half the thyme sprigs and peppercorns over vegetable mixture, then arrange duck legs skin-side up in an even layer on top, pressing them into vegetable mixture. Distribute remaining thyme sprigs and peppercorns over duck legs, followed by the vegetable mixture, spreading it evenly so legs are well-coated. Cover tightly with plastic wrap and refrigerate for at least 24 hours and up to 48 hours.\nAlternatively, combine duck legs, vegetable mixture, thyme, and peppercorns in a 1-gallon zipper-lock bag. Seal bag, pressing out as much air as possible. Massage bag until duck legs are evenly coated on all sides. Lay bag flat on rimmed baking sheet and refrigerate for at least 24 hours and up to 48 hours.\nSerious Eats\nWhen Ready to Cook:\nAdjust oven rack to middle position and preheat oven to 225°F (105°C). Melt duck fat, either in 3-quart saucier over low heat or in a microwave-safe bowl in the microwave. Remove duck legs from cure, wiping away as much of the cure mixture as possible before rinsing legs gently under cold water to remove all seasonings; discard cure. Pat duck legs dry with paper towels, then arrange in single layer in saucier with duck fat (if using), making sure they are completely submerged in fat. Alternatively, arrange duck legs snugly in a small baking dish and cover with melted duck fat, making sure legs are fully submerged in fat.\nCover saucier or baking dish with lid or aluminum foil, and transfer to oven. Cook until duck is completely tender and meat shows almost no resistance when pierced with a paring knife, and skin has begun to pull away from bottom of the drumstick, 3 1/2 to 4 hours.\nSerious Eats\nRemove from oven and cool duck to room temperature in its cooking vessel, removing lid but keeping it submerged in fat. Once cool, cover container tightly and transfer to refrigerator, where confit can be stored for up to 1 month.\nSpecial Equipment\nFood processor\n,\n3-quart stainless steel saucier\n,\nrimmed baking sheet\nNotes\nThis recipe will work with all breeds of duck, but it was developed using Pekin (also known as Long Island) and Alina ducks.\nIf you don't have a spare onion for the allium cure, substitute with an additional 3 to 4 shallots.\nThe amount of duck fat needed for this recipe is dependent on the size of your cooking vessel. You need enough rendered duck fat to fully cover the legs and keep them submerged throughout cooking. You can\nrender duck fat yourself from breaking down whole ducks\nor purchase containers of rendered duck fat at well-stocked supermarkets or online.\nThis recipe can easily be scaled up or down for any number of duck legs you want to make; just note that the ratio of rendered fat to duck may change dramatically as the size and shape of the cooking vessel does.\nMake-Ahead and Storage\nDuck confit can be refrigerated in an airtight opaque container, with legs completely submerged in fat, for up to 1 month. The duck fat from the confit can be reused at least 2 more times for subsequent batches of confit; after the third use, taste it for salinity as it will eventually become too salty.\nRead More\nHow to Make Classic Duck Confit (and Give It a Koji Twist)\nBreak Out Your Nonstick Skillet for the Best Crispy Duck Leg Confit\nFats & Oils\nPoultry Fats\nDuck Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/traditional-duck-confit.webp?"
}