{
  "url": "https://www.seriouseats.com/classic-chicken-and-wild-rice-hotdish-from-th",
  "image_url": "https://www.seriouseats.com/thmb/aQkko4YCR35mUBH4EfhOBIaRjns=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__12__20131216-277053-cook-the-book-chicken-and-wild-rice-hot-dish-a0aa94c511e749d8917803ab8dde3c77.jpg",
  "tags": [
    "Chicken Mains",
    "Midwestern",
    "Savory",
    "Wild Rice"
  ],
  "title": "Classic Chicken and Wild Rice Hotdish From 'The New Midwestern Table'",
  "full_text": "Classic Chicken and Wild Rice Hotdish From 'The New Midwestern Table'\nClose\nJump to recipe\nPrep\n5 mins\nCook\n80 mins\nActive\n30 mins\nTotal\n85 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\nnatural wild rice\nFine sea salt\nand freshly ground black pepper\n1\ndried\nbay leaf\n6\ntablespoons\n(\n3/4\nstick\n)\nsalted butter\n, plus more, at room temperature, for the baking dish\n2\nleeks\n, white and green parts, cut into small dice (\n2 1/2\ncups\n)\n3\nstalks\ncelery\n, cut into small dice\n3\ntablespoons\nall-purpose flour\n1 1/2\ncups\nwhole milk\n2/3\ncup\nheavy cream\n3/4\ncup\nchicken stock\n,\nlow-sodium\nstore-bought or homemade\n3/4\nteaspoon\ndried thyme leaves\n, or\n1 1/2\nteaspoons\nfresh\n1/4\nteaspoon\ngrated\nnutmeg\n2\ncups\nroughly chopped cooked chicken meat\n4\nounces\naged Gouda\nor aged cheddar cheese, grated (\n1 1/2\ncups\n)\n2\ncups\ncoarsely ground buttery crackers, such as\nRitz\nor Club (about\n2\nsleeves\n)\n2\ntablespoons\nextra-virgin olive oil\nDirections\nPut the rice in a fine-mesh sieve and rinse it under cold running water, swishing the rice with your hand until the water runs clear. Transfer the rice to a medium bowl, and add water to cover. Pour off any black bits or floating kernels, pour the rice back into the sieve to drain, and then put it in a small saucepan. Add 1 1/4 cups water, a pinch of salt, and the bay leaf, and bring to a simmer. Cover the pan and reduce the heat to low. Steam for 25 minutes, or until the rice is tender and the water has evaporated.\n(If liquid remains after the rice is done, drain it in a sieve.)\nMeanwhile, preheat the oven to 375°F.\nWhile the rice cooks, heat the butter in a large, high-sided skillet over medium heat. Add the leeks and celery, and season with 1/4 teaspoon each of salt and pepper. Cook until tender, about 10 minutes.\nAdd the flour to the vegetables and stir until well combined with the butter. Pour in the milk and bring to a simmer, whisking to prevent any lumps. Add the cream, chicken stock, thyme, nutmeg, and 1/2 teaspoon each of salt and pepper. Simmer over low heat until the floury taste dissipates, about 5 minutes. Add the cooked chicken, wild rice (minus the bay leaf), and half of the cheese, and heat until the cheese melts.\nPut the crushed crackers in a heavy plastic bag and add 1/4 teaspoon pepper and the olive oil. Shake to combine, and set aside.\nRub a 9 × 13-inch baking dish with a thin layer of soft butter. Pour the hotdish mixture into the dish and top with the remaining cheese. Bake for 25 minutes.\nPull the dish from the oven, sprinkle the cracker mixture evenly over the top, and bake until the crackers turn dark golden brown and the hotdish bubbles in the center, about 25 minutes. Serve immediately.\nNotes:\nIf you have leftover gravy on hand, by all means use it in place of the chicken stock in this recipe.\nYou can use a supermarket rotisserie chicken for the cooked chicken, but in that case, reduce the salt by 1/4 teaspoon.\nIf you have cooked wild rice on hand, use 2 cups for this recipe.\nChicken Mains\nMidwestern\nSavory\nWild Rice"
}