{
  "url": "https://www.seriouseats.com/classic-marshmallows-recipe",
  "image_url": "https://www.seriouseats.com/thmb/J6OP80rfuOTwNq7Lj5xUDps227E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20101206-marshmallows-primary-a83e957191074678b149dad2448067e6.JPG",
  "tags": [
    "Candy",
    "Stovetop"
  ],
  "title": "Classic Marshmallows, and Some Variations Recipe",
  "full_text": "Classic Marshmallows, and Some Variations Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n10 mins\nActive\n25 mins\nResting Time\n12 hrs\nTotal\n12 hrs 35 mins\nServes\n96 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\nconfectioners' sugar\n1/2\ncup\npotato starch\n(or cornstarch)\n1\nteaspoon\nbutter\n1\ncup\nwater\n, divided\n2\ncups\ngranulated sugar\n2\n(\n1/4-ounce) packets\nof\nunflavored powdered gelatin\n(about\n5\nteaspoons\n)\n1\ntablespoon\nvanilla extract\n(or other flavorings, see variations in note)\n3\nlarge\negg whites\n, at room temperature (see note on eggless marshmallows above)\nPinch\nsalt\n1/8\nteaspoon\ncream of tartar\nDirections\nSift together potato starch and confectioners sugar.\nPrepare a 13- by 9-inch baking pan by lightly buttering inner surface and sifting sugar-starch powder over it.\nPour 1/2 cup of water into the bowl of a stand mixer fitted with a whisk attachment. Sprinkle gelatin powder into water and let stand.\nPour remaining 1/2 cup of water and sugar into a saucepan over medium-high heat. Stir occasionally until sugar is dissolved. Leave undisturbed once sugar is dissolved. When sugar is dissolved and syrup begins to boil, leave undisturbed until temperature on a candy thermometer reaches 240°F (116°C), about 5 minutes.\nCarefully pour the hot syrup into the bowl, gently stirring until gelatin is fully dissolved in the syrup. Gradually increasing the speed to high, beat the mixture until almost tripled in volume and thick, shiny, soft peaks have formed, about 10 minutes. Add vanilla extract.\nWhile syrup/gelatin mixture is beating, pour egg whites and pinch of salt in a deep mixing bowl. With an electric hand mixer, whisk eggs until they begin to foam. Sprinkle in cream of tartar, gradually increase speed to high and beat until shiny and firm peaks form, about 3 minutes.\nSwitch to paddle attachment on the stand mixer and incorporate egg whites into syrup/gelatin mixture on medium-low speed, stopping to scrape the bottom and sides of the bowl. When mixture is fully blended, after 2-3 minutes, spread into prepared pan.\nSift sugar-starch powder over the top surface of the marshmallow. Allow to set overnight. If the air is very dry, cover partly with a plate or plastic wrap.\nRun a small offset spatula around edges of pan and turn marshmallow out onto a surface that has been dusted with sugar-starch powder.\nUse cookie cutters, scissors, or a sharp chef’s knife to cut the marshmallow into pieces. If using a knife, cut into cubes by pressing down, not sawing back and forth – it will bounce back. Dip cut marshmallows into sugar-starch powder to coat evenly, shaking off excess powder. Store up to a week in a closed container.\nSpecial Equipment\n13- by 9-inch baking pan\n,\nstand mixer\n,\nhand mixer\nNotes\nEgg-Free:\nReduce sugar to 1 1/2 cups. Skip steps 5 and 6 and proceed directly to spreading the marshmallow-y fluff into the prepared pan. Continue with step 7.\nCocoa-Amaretti:\nPrepare 1 cup of finely crushed amaretti cookies. Instead of confectioners sugar and starch, coat surface of the baking pan with amaretti crumbs. Sift 1⁄4 cup cocoa into syrup/gelatin mixture over low speed. Add 1 teaspoon almond extract instead of vanilla extract to beaten syrup. Sprinkle the top of the marshmallows with crumbs. Once marshmallows are set and cut, coat exposed sides with crumbs.\nMatcha/Green Tea:\nSift 1/2 teaspoon of matcha powder into the confectioners sugar/starch dusting powder. Instead of vanilla, sift 2 teaspoons matcha powder into beaten syrup/gelatin mixture over low speed until well-blended.\nEspresso:\nDissolve 2 tablespoons of instant espresso powder into 1/2 cup of water before adding the gelatin powder. Leave out vanilla extract.\nCoconut:\nToast one cup of sweetened, shredded coconut. Coat inside surface of baking pan with coconut and sprinkle on top of marshmallow mixture. Once marshmallows are set and cut, dip exposed sides into coconut to coat.\nVanilla Bean:\nAdd the scrapings of 2 vanilla beans to egg whites before whipping. Leave out vanilla extract.\nPeppermint:\nInstead of using vanilla extract, add 1 1/2 teaspoons peppermint extract to beaten sugar syrup instead. Drip 6 to 8 drops of red food coloring on top of marshmallows before they set in the pan and drag a toothpick through the dye to create a swirly pattern.\nRead More\nVegan Marshmallows Recipe\nCandy\nStovetop"
}