{
  "url": "https://www.seriouseats.com/classic-risotto-recipe-8347844",
  "image_url": "https://www.seriouseats.com/thmb/0imHE4Dein01o5KeWxmWf-oIc44=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231004-SEA-Risotto-AmandaSuarez-hero-456742f010f343f39f09e8c34b07ab56.jpg",
  "tags": [
    "White Rice",
    "The Latest",
    "Italian"
  ],
  "title": "The Key Techniques for Perfect Risotto",
  "full_text": "The Key Techniques for Perfect Risotto\nClose\nJump to recipe\nPrep\n0 mins\nCook\n35 mins\nTotal\n35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\nHalf of\n1\n(\n8-ounce; 225 g\n)\nyellow onion\n, finely minced\nKosher salt\n2\ncups\nshort- or medium-grain\nrisotto rice\n(\n14\nounces\n;\n400\ng\n), such as carnaroli\n1/2\ncup\n(\n120\nml\n)\ndry white wine\n2\nquarts\n(\n2\nL\n) hot chicken or vegetable\nstock\nor low-sodium store-bought chicken broth\n3/4\ncup\nfinely grated\nParmigiano-Reggiano cheese\n(\n3\nounces\n;\n85\ng\n)\n4\ntablespoons\n(\n60\ng\n) cold\nunsalted butter\n, cubed\nDirections\nSet serving plates in a very low over or other warm location to keep warm until serving time. In a 3- or 5-quart saucier or medium Dutch oven, heat olive oil over medium heat until shimmering. Add onion, season lightly with salt, and cook, stirring frequently, until onion is translucent and soft but not browned, about 5 minutes.\nSerious Eats / Amanda Suarez\nIncrease heat to medium-high, add rice, and continue to cook, stirring constantly, until rice is evenly coated in oil and toasted but not browned, 2 to 3 minutes. Rice should smell nutty and grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center.\nSerious Eats / Amanda Suarez\nAdd white wine and cook until wine is almost completely evaporated, about 30 seconds. Add 1/2 cup of stock and season lightly with salt. Cook, stirring constantly with a rubber spatula or wooden spoon, until liquid is mostly absorbed, 1 to 2 minutes. Continue to cook, adding stock in 1/2-cup increments while stirring constantly, until rice is almost fully softened but still retains a noticeable al dente bite in the center, 15 to 20 minutes. Add enough stock so that there is enough liquid in the pot for the rice flow like lava when you stir it. Remove from heat.\nSerious Eats / Amanda Suarez\nAdd cheese and butter and stir or toss vigorously until cheese and butter are fully melted and emulsified and a creamy, satiny glaze coats each grain of rice. Keep in mind that the risotto will tighten up in the time it takes to plate and serve it, so adjust with more stock as needed to achieve a free-flowing consistency, leaving it looser than you think it should be. Season with additional salt, if needed.\nSerious Eats / Amanda Suarez\nSpoon risotto onto warmed plates (plates are more traditional than bowls), shaking gently to spread risotto out over each plate in an even layer. Serve right away.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n3- or 5-quart saucier\nor\nmedium Dutch oven\nMake-Ahead and Storage\nSee section above on the restaurant trick for making risotto in advance. Once finished, risotto is best eaten right away, though leftovers can be fried into a pancake in a preparation called\nrisotto al salto\n.\nWhite Rice\nThe Latest\nItalian"
}