{
  "url": "https://www.seriouseats.com/classic-lemon-meringue-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/9VFqo0xQxcOIgSyvcStxGYDIzsw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231113-SEA-LemonMeringuePie-FredHardy-03-1519d9ad68484041bdfaba3c09b67411.jpg",
  "tags": [
    "Pies",
    "Pie Dough",
    "Lemon"
  ],
  "title": "Lemon Meringue Pie",
  "full_text": "Lemon Meringue Pie\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n60 mins\nCooling Time\n2 hrs 50 mins\nTotal\n3 hrs 50 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n1/2\nrecipe\neasy pie dough\n, shaped in a 9-inch pie plate and chilled for at least 2 hours\nFor the Lemon Filling:\n1 3/4\ncups\nplus\n1\ntablespoon\n(\n415\nml\n)\nwater\n1/2\ncup\nplus\n1\nteaspoon\n(\n140\nml\n) freshly squeezed\nlemon juice\n(from about\n4\nlemons\n)\n1\nteaspoon\nlemon zest\n1 1/4\ncups\ngranulated sugar\n(\n8 3/4\nounces\n;\n248\ng\n), divided\n5\ntablespoons\ncornstarch\n(\n1 1/2\nounces\n;\n42\ng\n)\n1/2\nteaspoon\nkosher salt\n; for table salt use half as much by volume\n4\nlarge\negg yolks\n3\ntablespoons\n(\n43\ng\n) cold\nunsalted butter\n, cut into 1/2-inch pieces\nFor the Meringue:\n4\nlarge\negg whites\n(\n4 1/4\nounces\n;\n120\ng\n)\n1/2\ncup\ngranulated sugar\n(\n3 1/2\nounces\n;\n100\ng\n)\n1\npinch\nkosher salt\n1\npinch\ncream of tartar\n1/2\nteaspoon\nvanilla extract\nDirections\nFor the Crust:\nAdjust oven racks to upper middle position (about 8-inches from broiler) and lowest position and preheat the oven to 425°F (220°C). Lightly prick chilled pie shell all over bottom in 1/2-inch intervals. Line pie shell with a double layer of 14-inch square of parchment paper or aluminum foil, covering edges to prevent burning. Fill with sugar, pie weights, or dried beans.\nSerious Eats / Fred Hardy\nTransfer to a parchment or foil-lined rimmed baking sheet and bake on lowest rack for 15 minutes. Reduce oven temperature to 375°F (190°C). Carefully remove liner and pie weights from par baked crust and bake the now uncovered crust until golden brown, about 5 minutes. Set aside and let cool.\nSerious Eats / Fred Hardy\nFor the Lemon Filling:\nIn a medium saucepan, combine the water, lemon juice, and zest. In a medium bowl, whisk 1 1/4 cups sugar, cornstarch, and salt until combined then add to the saucepan. In a separate bowl, whisk the egg yolks until combined and add to the saucepan. Cook over medium heat, whisking continuously, until the mixture thickens and bubbles, 7 to 8 minutes.\nSerious Eats / Fred Hardy\nWhisk continuously for an additional two minutes once bubbling, then remove from heat. Whisk in butter until fully combined and melted. Strain the curd through a fine-mesh strainer directly into the baked and cooled pie shell and scrape filling off the underside of the strainer into the pie shell. Press plastic wrap directly onto the surface of the filling. Let cool at room temperature for 30 minutes, then refrigerate until well chilled, at least 2 hours or up to 24 hours.\nSerious Eats / Fred Hardy\nFor the Meringue:\nFill a medium saucepan one quarter full with water. Set the saucepan over medium heat, and bring water to a simmer.\nSerious Eats / Fred Hardy\nIn a stand mixer bowl, combine egg whites, 1/2 cup sugar, salt, and cream of tartar and place over the saucepan with simmering water. Heat, whisking constantly, until sugar is dissolved and egg whites are warm to the touch, 2 to 3 minutes. Test by rubbing between your fingers. Transfer mixer bowl to stand mixer fitted with whisk attachment. Starting on low speed, whip heated egg whites, gradually increasing speed to high, until stiff and glossy peaks form, 8 to 10 minutes. Add vanilla, and mix until combined.\nSerious Eats / Fred Hardy\nFor Assembling the Pie:\nRemove the plastic from the top of the chilled filling.  Spoon the meringue evenly around the edge and then center of pie, attaching the meringue to the pie crust (to prevent shrinking while under the broiler). Using back of spoon, create attractive swirls and peaks in meringue.\nSerious Eats / Fred Hardy\nAdjust oven to broiler setting. Broil the pie on the upper-middle rack set about 8-inches from the broiler element until the tips of the meringue are toasted and browned, about 2 minutes (see notes) Let cool for 10 minutes. Slice and serve.\nSerious Eats / Fred Hardy\nSpecial Equipment\nMedium saucepan, 9-inch pie plate, fine-mesh strainer\nNotes\nMake the meringue right before serving so that it doesn't form a rubbery skin on top.\nClosely monitor the pie while broiling the meringue to prevent burning.\nPies\nPie Dough\nLemon"
}