{
  "url": "https://www.seriouseats.com/classic-sage-and-sausage-stuffing-or-dressing-recipe",
  "image_url": null,
  "tags": [
    "Thanksgiving",
    "Thanksgiving Side Dishes",
    "Sage",
    "Fall Sides",
    "Christmas Sides"
  ],
  "title": "Classic Sage and Sausage Stuffing (Dressing)",
  "full_text": "Classic Sage and Sausage Stuffing (Dressing)\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 15 mins\nActive\n45 mins\nCooling Time\n25 mins\nTotal\n2 hrs 50 mins\nServes\n10\nto 14 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\n(\n1.25\nkg\n) high-quality sandwich bread or soft Italian or\nFrench bread\n(about\n2\nloaves\n), cut into 3/4-inch dice (about\n5\nquarts\n)\n8\ntablespoons\nbutter\n(\n1\nstick\n;\n4\nounces\n;\n115\ng\n)\n1 1/2\npounds\n(\n680\ng\n)\nsage sausage\n, removed from casing\n1\nlarge\nonion\n, finely chopped (about\n12\nounces\n;\n350\ng\n)\n4\nlarge\nribs\ncelery\n, finely chopped (about\n12\nounces\n;\n350\ng\n)\n2\ncloves\ngarlic\n, minced or grated on a Microplane grater\n1/4\ncup\nminced\nfresh sage leaves\n(or\n2\nteaspoons\ndried sage leaves)\nKosher salt\nand freshly ground black pepper, if needed (see note)\n1\nquart\nlow-sodium\nhomemade\nor store-bought\nlow-sodium chicken\nor\nturkey\nstock\n(\n4\ncups\n;\n1\nL\n), divided\n3\nlarge\neggs\n1/4\ncup\nminced parsley leaves\n, divided\nDirections\nAdjust oven racks to lower-middle and upper-middle positions. Preheat oven to 275°F (135°C). Spread bread evenly over 2 rimmed baking sheets. Stagger trays on oven racks and bake until completely dried, about 50 minutes total, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool. Increase oven temperature to 350°F (180°C).\nSerious Eats / Morgan Hunt Glaze\nIn a large Dutch oven, melt butter over medium-high heat until foaming subsides (do not allow butter to brown), about 2 minutes. Add sausage and mash with a stiff whisk or potato masher to break up into fine pieces (largest pieces should be no bigger than 1/4 inch). Cook, stirring frequently, until only a few bits of pink remain, about 8 minutes. Add onion, celery, garlic, and sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.\nSerious Eats / Morgan Hunt Glaze\nWhisk remaining chicken stock, eggs, and 3 tablespoons parsley in a medium bowl until homogeneous. Stirring constantly with a wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes and fold gently until evenly mixed.\nSerious Eats / Morgan Hunt Glaze\nUse part of stuffing to stuff turkey, if desired (see note). To cook remaining stuffing, transfer to a buttered 9- by 13-inch rectangular baking dish (or 10- by 14-inch oval dish), cover tightly with aluminum foil, and bake until an instant-read thermometer reads 150°F (66°C) when inserted into center of dish, about 45 minutes. Remove foil and continue baking until golden brown and crisp on top, 15 to 20 minutes longer. Remove from oven, let cool for 5 minutes, sprinkle with remaining parsley, and serve.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\n2 rimmed baking sheets\n,\nDutch oven\n,\n9- by 13-inch baking dish\nor 10- by 14-inch oval dish,\ninstant-read thermometer\nNotes\nIf desired, dried or fresh fruits and nuts can be folded into the stuffing along with the bread cubes in step 3.\nThis recipe makes an excellent bird stuffing, producing enough to stuff several small birds or two to three 18- to 22-pound birds. Bake the extra in a buttered baking dish.\nIf using homemade or low-sodium stock, season to taste with salt and pepper before adding.\nMake-Ahead and Storage\nThe stuffing can be prepared through step 3 and placed in a buttered baking dish a day in advance. Remove from the refrigerator and allow the stuffing to come to room temperature for at least 1 hour before baking the next day.\nHow to Scale Down This Recipe\nThis recipe can be scaled down by half. Divide all ingredients by two; use 2 eggs instead of 3; use 1 rimmed baking sheet instead of two to dry the bread; bake stuffing in a 10-inch cast iron or carbon steel skillet instead of a 9- by 13-inch baking dish.\nRead More\nSage and Sausage Stuffin's (Stuffing Muffins) Recipe\nOyster Stuffing With Fennel, Tarragon, and Sausage Recipe\nChorizo and Green Olive Stuffing Recipe\nSouthern Cornbread Dressing With Oysters and Sausage Recipe\nStuffing Waffles Recipe\nThanksgiving\nThanksgiving Side Dishes\nSage\nFall Sides\nChristmas Sides"
}