{
  "url": "https://www.seriouseats.com/classic-apple-strudel-austrian-pastry-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uQW-Z1wraxbEXlkNZkRci98vj0k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__11__20141023-Apple-Streudel-Yvonne-Ruperti-1-d2293576df424ea9a8710227c7c5daa7.jpg",
  "tags": [
    "Pies",
    "Pastries",
    "Apple"
  ],
  "title": "Apple Strudel Recipe",
  "full_text": "Apple Strudel Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n60 mins\nActive\n45 mins\nResting Time\n60 mins\nTotal\n2 hrs 25 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Strudel Dough:\n2 1/2\ncups\n(\n12 1/2\nounces\n)\nall-purpose flour\n1/2\nteaspoon\nsalt\n3\ntablespoons\nplus\n1/2\nteaspoon\nvegetable oil\n10 to 12\ntablespoons\nlukewarm\nwater\nFor the Apple Filling:\n14\ntablespoons\n(\n7\nounces\n)\nunsalted butter\n, divided\n2\nounces\nfresh\nbread crumbs\n1/3\ncup\n(\n1 3/4\nounces\n) toasted\nhazelnuts\n, finely chopped\n3/4\ncup\n(\n5 1/4\nounces\n) plus\n1\ntablespoon\ngranulated sugar\n, divided\n1/4\nteaspoon\nplus\n1/8\nteaspoon\ncinnamon\nPinch\nsalt\n5\nlarge\nbaking apples such as\nGolden Delicious\n, Granny Smith, or Gala (about\n2\npounds\n), peeled, cored, cut into 1/2 inch cubes\n1/2\ncup\nraisins\n5\nteaspoons\njuice\nand\n1\nteaspoon\nzest\nfrom\n1 to 2\nlemons\nDirections\nFor the Strudel Dough:\nStir flour, salt, 3 tablespoons oil, and 10 tablespoons water in a large bowl until almost combined and the mixture looks shaggy. If the mixture appears dry, add more water, one tablespoon at a time. You should have a dough that is soft and tacky, but not sticky.\nPlace the dough on a lightly floured surface and gently knead until the dough is smooth and elastic, about 5 minutes. Form dough into a ball and lightly coat dough with remaining 1/2 teaspoon oil. Place in bowl, lightly cover, and let rest 1 hour. While dough is resting, start the filling.\nSerious Eats /Yvonne Ruperti\nFor the Apple Filling:\nHeat 3 tablespoons butter in a medium skillet over medium-low heat until melted. Add bread crumbs and cook, stirring constantly, until crumbs are moistened and lightly toasted, about 2 minutes. Transfer to a medium bowl and let cool.\nAdjust oven rack to middle position and preheat oven to 425°F (220°C). Place a large sheet of parchment paper on your work surface, then cover the table with a large clean cloth. On a lightly floured cutting board, roll dough into a 10- by 12-inch rectangle. Flip the board and the dough onto the center of the cloth and remove board.\nSerious Eats /Yvonne Ruperti\nWorking carefully, begin to stretch dough from the center out. This can be achieved by placing your hand, palm down, underneath the dough and gently pulling out to the edge. You can also place your fingertips under the dough to gently stretch. Avoid tearing the dough. If the dough does tear, gently patch together. Stretch the dough until it is a rectangle of approximately 18- by 30-inches and paper thin. The dough should be of even thickness throughout, and thin enough to see through it. Trim off any thick edges with kitchen sheers.\nSerious Eats /Yvonne Ruperti\nMelt remaining butter and brush a thin coat over the dough (extra butter will be used to brush on top of the strudel before baking). Sprinkle chopped hazelnuts over dough. Spread bread crumb mixture in a 12-inch strip at the far end of the dough, leaving a border of 6 to 8 inches from the end and 3 inches from both edges.\nStir 3/4 cup sugar, cinnamon, and salt in large bowl to combine. Mix in apples, raisins, lemon juice, and zest until just combined. Immediately spoon apple mixture on top of the bread crumbs.\nSerious Eats /Yvonne Ruperti\nUsing the cloth, lift the end of dough over the strudel to cover. Continue to lift the cloth to roll up the strudel. Halfway through, fold the edges in to seal and continue to roll to the end. The strudel should be approximately 16 to 18 inches long. Roll the strudel directly onto the parchment paper, then lift parchment paper with strudel and transfer to a baking sheet. If the strudel doesn't fit perfectly straight onto the pan, gently curve it to fit. Brush with remaining butter and sprinkle with remaining tablespoon sugar.\nSerious Eats /Yvonne Ruperti\nBake for 20 minutes, then reduce oven to 350°F (180°C). Continue to bake until strudel is golden and apples are tender, about 30 minutes more. Transfer pan to wire rack and let cool. Slice and serve with fresh whipped cream or vanilla sauce.\nSpecial Equipment\nLarge clean cloth (24- by 36-inch),\nrolling pin\nRead More\nCranberry Apple Strudel Recipe\nPeach Walnut Strudel Recipe\nGâteau Invisible (Invisible Apple Cake) Recipe\nApple Recipes Perfect For Fall\nPies\nPastries\nApple",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/apple-strudel-recipe.webp?"
}