{
  "url": "https://www.seriouseats.com/classic-bread-pudding-recipe-8743825",
  "image_url": "https://www.seriouseats.com/thmb/MqyYyTaIGJYRrxyrYVgy_Hei6HE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241108-SEA-BreadPudding-AmandaSuarez-Hero2-24-f3a6acf418ab4093bbde97b9cb58b541.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Bread Pudding"
  ],
  "title": "Bread Pudding",
  "full_text": "Bread Pudding\nClose\nJump to recipe\nCook\n75 mins\nCooling Time\n30 mins\nTotal\n105 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4 pound (\n567\ng)\nof\nenriched loaf bread,\npreferably a rich eggy bread like brioche or challah, cut into 1- to 1 1/2 inch cubes (see notes)\n2\nlarge\neggs plus 6 large\negg\nyolks\n3/4 cup plus 1 tablespoon\ngranulated suga\nr\n(5 ¼\nounces\nplus 1/2 ounce), divided\n4 teaspoons (\n20\nml)\nvanilla extract\nor 1 vanilla bean, split and seeds scraped\n1\nteaspoon\ngrated orange\nor lemon zest, optional\n3/4\nteaspoon\nground\ncinnamon, divided\n1/2\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt use half as much by volume\nPinch\nground\nnutmeg\n2\ncups\nheavy cream\n(see notes)\n2\ncups\nwhole milk\n(see notes)\n2\ntablespoons\nunsalted butter\n, melted\n1/2\ncup\ndried fruit\n(such as raisins, currants, dried cherries, or chopped dried apricots) and/or 1/2 cup toasted chopped nuts (such as pecans, walnuts, almonds, or hazelnuts), optional\nDirections\nAdjust oven rack to middle position. Heat oven to 275°F (130°C). On a rimmed baking sheet, spread bread in an even layer and bake, rotating sheet and stirring bread cubes several times during baking, until bread is completely dried, but not browned or changed in color, 30 to 40 minutes. Remove from oven and set aside to cool. Adjust oven temperature to 350F (175C).\nSerious Eats / Amanda Suarez\nIn a large bowl, add eggs, egg yolks, granulated sugar, vanilla extract or scraped vanilla seeds, 1/2 teaspoon cinnamon, nutmeg, citrus zest, if using, and salt and whisk to combine. Whisk in cream and milk (or half and half) until combined. Stir in bread and dried fruit and/or nuts, if using, and let sit, pressing down on bread occasionally, for 5 minutes. Stir gently to combine, ensuring the cubes of bread left unsubmerged on the top are now submerged on the bottom, and press gently on bread occasionally until bread is saturated and custard is mostly absorbed, about 5 minutes more.\nSerious Eats / Amanda Suarez\nCarefully transfer mixture to a 13- by 9-inch baking dish and gently press cubes into custard. Using a pastry brush, dab melted butter over top of bread.\nIn a small bowl, combine the remaining 1 tablespoon sugar and remaining 1/4 teaspoon cinnamon and sprinkle the cinnamon-sugar mixture evenly over top.\nSerious Eats / Amanda Suarez\nPlace bread pudding on a rimmed baking sheet and bake until custard has just set, top is lightly browned and crisp, and pressing center of pudding with finger reveals no runny liquid, about 30 minutes. (An instant-read thermometer inserted into center of pudding should read about 170℉; 75℃.) Transfer to wire rack and cool until pudding is set, about 30 minutes. Serve warm.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n13 by 9-inch baking dish\nNotes\nYou can substitute the heavy cream and milk for 1 quart (.95L) half and half.\nMake-Ahead and Storage\nYou can assemble the pudding through step 3 up to 2 days ahead and store it, covered, in the refrigerator. Pop it into the oven at 350℉ (175°C) and bake until hot, 1 or 2 hours before you want to serve it.\nOnce cooled, leftover bread pudding can be covered and refrigerated for up to 2 days. Reheat covered with aluminum foil in the oven at 350℉ (175°C) until warmed through. Remove foil an continue baking until top is crisp, about 10 additional minutes.\nDesserts\nThe Latest\nBread Pudding"
}