{
  "url": "https://www.seriouseats.com/classic-creamy-carrot-soup-recipe-5219000",
  "image_url": "https://www.seriouseats.com/thmb/v8pfG3pX_zwQ5ahpyIozfyZv1j8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/beauties-1-ac50c9ac5a6a4a46b796ff4414cf2442.jpg",
  "tags": [
    "Carrots"
  ],
  "title": "Classic Creamy Carrot Soup",
  "full_text": "Classic Creamy Carrot Soup\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nTotal\n85 mins\nServes\n4\nto 6 servings\nMakes\n2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Lemon-Herb Yogurt:\n1/2\ncup\n(\n4 1/4\nounces\n;\n120\ng\n)\nplain full-fat Greek yogurt\n2\ntablespoons\n(\n30\nml\n)\nfresh lemon juice\nfrom\n1\nlemon\n2\ntablespoons\n(\n8\ng\n)\nfinely chopped flat-leaf parsley\nleaves and tender stems\nFor the Carrot Soup:\n2 1/2\npounds\n(\n1.1\nkg\n)\ncarrots\n(about\n12\nmedium\ncarrots), peeled, halved lengthwise, and cut into 1/2-inch thick slices, divided\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, divided\nKosher salt\n1\nlarge\nleek\n(\n10 1/2\nounces\n;\n300\ng\n), white and pale green parts only, thinly sliced\n1\nlarge\nyellow onion\n(\n12\nounces\n;\n340\ng\n), thinly sliced\n2\nmedium\ngarlic cloves\n, peeled and smashed under the flat side of a knife\n3\nsprigs\nflat-leaf parsley\n5\ncups\n(\n1.2\nL\n)\nhomemade\nor store-bought\nvegetable stock\n, plus more as needed\n1\ncup\n(\n235\nml\n) fresh or store-bought\ncarrot juice\n, plus more as needed\n4\ntablespoons\nunsalted butter\n(\n2\nounces\n;\n60\ng\n), divided\n2\ntablespoons\n(\n30\nml\n)\nfresh lemon juice\nfrom\n1\nlemon\nDirections\nFor the Lemon-Herb Yogurt:\nIn a small bowl, whisk together Greek yogurt, lemon juice, and parsley until well combined. Cover and refrigerate.\nDebbie Wee\nFor the Carrot Soup:\nAdjust oven rack to middle position and preheat to 375°F (190°C). On a parchment-lined rimmed baking sheet, toss half of the carrots (1 1/4 pounds) with 1 tablespoon (15ml) oil; season with salt. Roast, stirring halfway through, until carrots are tender and deep golden brown in spots, about 25 minutes. Set aside.\nDebbie Wee\nIn a large Dutch oven or pot, heat remaining 2 tablespoons (30ml) oil over medium heat until shimmering. Add leek, onion, and garlic, and cook, stirring frequently, until softened but not browned, 7 to 10 minutes.\nDebbie Wee\nAdd remaining carrots along with the roasted carrots, parsley sprigs, vegetable stock, and carrot juice. Season lightly with salt. Bring to a boil over high heat, then lower to maintain a steady simmer. Cook, stirring occasionally, until all the carrots are completely tender, about 25 minutes. Discard parsley.\nDebbie Wee\nLadle half of liquid and solid ingredients into a blender jar and add half of the butter (1 ounce; 2 tablespoons). Remove the blender lid plug (this will allow steam pressure to escape), close lid, and set a folded clean dish towel on top to cover the hole in the blender lid (keep your hand on the towel to hold it in place). Starting at the lowest speed and gradually increasing to the highest, blend the soup until it is completely smooth. Transfer soup to a large pot (if an even smoother texture is desired, pass soup base through a fine-mesh strainer into the pot). Repeat with remaining soup and butter. If soup is too thick, thin as needed with additional vegetable stock or carrot juice to desired consistency (the consistency should not be a thick purée, but rather a silky, creamy, soup-like one).  Whisk in lemon juice and season to taste with salt.\nDebbie Wee\nDivide soup among warmed bowls and drizzle with lemon-herb yogurt.\nDebbie Wee\nSpecial Equipment\nRimmed baking sheet, Dutch oven, blender, fine mesh strainer\nNotes\nCarrot juice can be found in most grocery stores, refrigerated in the produce section. Look for 100% pure carrot juice.\nMake-Ahead and Storage\nThe soup can be prepared ahead of time and refrigerated in an airtight container for up to 5 days or frozen for up to 3 months. The lemon herb yogurt can be prepared ahead of time and refrigerated in an airtight container for up to 5 days.\nCarrots",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/classic-creamy-carrot-soup.webp?"
}