{
  "url": "https://www.seriouseats.com/classic-panna-cotta-vanilla-bean-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8i3AD5zLDlL9xolPh9tEZMI7qPc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__07__20170523-panna-cotta-vicky-wasik-17-ee64a98c54c042009b4fcbb7122e27b0.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "Spring Desserts",
    "Desserts"
  ],
  "title": "Vanilla Bean Panna Cotta Recipe",
  "full_text": "Vanilla Bean Panna Cotta Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nActive\n15 mins\nSteeping and Chilling Time\n5 hrs\nTotal\n5 hrs 25 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Flavored Base:\n14\nounces\nheavy cream\n(about\n1 3/4\ncups\n;\n395\ng\n)\n8\nounces\nwhole milk\n(about\n1\ncup\n;\n225\ng\n)\n1\nTahitian\nvanilla bean\n, split lengthwise, seeds reserved (see note)\n2 1/2\nounces\nsugar\n(about\n1/3\ncup\n;\n70\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or use the same weight\nFor the Gelatin:\n1/4\nounce\nunflavored gelatin powder\n(about\n2 1/8\nteaspoons\n, though volume may vary by brand;\n7\ng\n), such as NOW Foods (see note)\n2\nounces\nwhole milk\n(about\n1/4\ncup\n;\n55\ng\n)\n1/2\nteaspoon\nvanilla extract\nTo Serve:\n6 to 8\nounces\nfresh fruit\n(volume will vary;\n170 to 225\ng\n), plain or sprinkled with sugar to taste (optional)\nDirections\nFor the Flavored Base:\nIn a 3-quart stainless steel saucier, combine cream, milk, and vanilla bean pod over medium heat. When it is steaming-hot, remove from heat, cover to prevent evaporation, and steep between 1 and 24 hours, depending on your schedule or preferred intensity of flavor (see note). Meanwhile, rub vanilla seeds into sugar to break up clumps, then combine with salt.\nSerious Eats / Vicky Wasik\nFor the Gelatin:\nJust before proceeding to step 3, combine gelatin powder, milk, and vanilla extract in a small bowl, mixing with a fork until smooth; set aside to bloom for about 10 minutes.\nSerious Eats / Vicky Wasik\nRewarm dairy until steaming-hot. Remove vanilla pod and use a flexible spatula to scrape out the flavorful goo inside to mix with the dairy. (The pod can be washed, dried, and reused in another recipe.) Off heat, whisk in vanilla/sugar mixture and bloomed gelatin. Transfer to a 4-cup measuring cup with a spout and cool until lukewarm, stirring from time to time to ensure the panna cotta remains homogeneous.\nSerious Eats / Vicky Wasik\nOnce cool, set aside 6 ramekins or small serving glasses and fill each with about 3 1/2 ounces (1 shy cup; 100g) of the panna cotta base. Cover each with plastic and refrigerate until softly set, at least 4 hours, or longer if you'd like a firmer consistency. (The panna cotta's texture will continue to evolve over time; however, after 12 hours of chilling, it will reach its maximum firmness and will not set up any further.) Serve individual panna cottas with fresh or\nlightly macerated fruit\n, if desired.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel saucier\n,\nwhisk\n,\nflexible spatula\n,\nlarge measuring cup with spout\n, 6 (1/2-cup-capacity) serving dishes\nNotes\nI prefer the more neutral flavor and aroma of bovine gelatin compared to varieties derived from pork, but any brand of powdered American gelatin will work quite well. Be aware that outside the US, powdered gelatin may be formulated to a slightly higher strength. Take care when adapting the recipe to sheet gelatin, and read up on the\nunexpected variables that may cause gelatin to misbehave\n.\nIn place of or in addition to a split vanilla bean, the milk and cream can be steeped with aromatic ingredients like cinnamon sticks, fresh ginger, lemon peel, peach pits, cocoa nibs, lemongrass, etc.\nRead More\nVanilla, Cinnamon, and Lime Panna Cotta\nHow to Macerate Fruit\nCustards, Mousses & Puddings\nSpring Desserts\nDesserts"
}