{
  "url": "https://www.seriouseats.com/classic-turkey-club-sandwich-recipe-8431741",
  "image_url": null,
  "tags": [
    "Sandwiches",
    "The Latest",
    "Turkey",
    "Bacon"
  ],
  "title": "Turkey Club Sandwich",
  "full_text": "Turkey Club Sandwich\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n16\nslices\ncenter-cut applewood smoked\nbacon\n(\n14\nounces\n;\n396\ng\n) (not thick cut, see notes)\n12\nslices\nhearty\nwhite sandwich bread\n(see notes)\n16\n(1/4-inch-thick) slices\nvine-ripened tomatoes\n(from about\n3\n(6-ounce)\ntomatoes)\n1/2\nteaspoon\nkosher salt\n; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\n3/4\ncup\nmayonnaise\n(\n6\nounces\n,\n170\ng\n), divided\n8\nromaine lettuce\nleaves\n(\n6\nounces\n;\n170\ng\ntotal), cut in half crosswise\n16\nslices\ndeli turkey\n(about\n1\npound\n;\n454\ng\ntotal), preferably hickory smoked\n16\n(4-inch)\ntoothpicks\nDirections\nAdjust oven racks to upper-middle and lower-middle positions. Heat oven to 400°F (205℃). Line 2 rimmed baking sheets with parchment paper. Arrange bacon slices in a single layer (slightly overlapping if needed) on prepared baking sheets. Bake bacon, switching and rotating baking sheets halfway through, until browned and crisp, 15 to 20 minutes. Use tongs to transfer cooked bacon to a paper towel–lined plate to drain and reserve rendered fat. Heat broiler.\nSerious Eats / Fred Hardy\nBrush bread slices very lightly on both sides with reserved bacon fat, then arrange on 2 clean baking sheets. Working one baking sheet at a time, broil on the upper-middle rack (about 6-inches from broiler), flipping bread slices halfway through, until bread is light golden brown on both sides, 1 to 2 minutes per side. Set aside.\nSerious Eats / Fred Hardy\nSprinkle tomato slices all over with salt and pepper; set aside.\nSerious Eats / Fred Hardy\nUsing a butter knife or offset spatula, spread 1 tablespoon mayonnaise evenly over 1 side of each bread slice. Place 4 prepared bread slices on a clean work surface, mayonnaise side up. Layer 2 cut lettuce leaf halves, 2 tomato slices, 2 cooked bacon slices, and 2 turkey slices—in that order—on the prepared bread slices arranged on the counter. Slightly overlap the ingredients as needed to fit within the parameters of the sandwich bread.\nSerious Eats / Fred Hardy\nTop the 4 sandwiches with 1 prepared bread slice each, mayonnaise-side down. Press gently to secure. Repeat layering 2 lettuce leaf halves, 2 tomato slices, 2 cooked bacon slices, and 2 turkey slices on top of the bread slices of each prepared sandwich.\nSerious Eats / Fred Hardy\nTop with the remaining 4 bread slices, mayonnaise side down. Press gently to secure and insert 4 toothpicks into each sandwich, spaced evenly to create 4 quadrants. Use a serrated knife to cut each sandwich on the diagonal to create triangular quarters. Serve.\nSerious Eats / Fred Hardy\nSpecial Equipment\n2 rimmed baking sheets, wire rack, butter knife or offset spatula, toothpicks, serrated knife\nNotes\nCenter-cut bacon, such as Smithfield brand, produces uniformly cooked slices that are evenly shaped to fit on the bread nicely. Using regular-cut bacon, as opposed to thick-cut bacon, ensures the bacon turns very crisp and breaks easily when biting into the stacked sandwich.\nA sturdy, thinly sliced sandwich bread, such as Pepperidge Farm Farmhouse Hearty White Bread, is ideal for this recipe. It’s sturdy enough to stack and hold the larger amount of ingredients in this club sandwich and not so thick that it will create an overly bready club sandwich.\nSandwiches\nThe Latest\nTurkey\nBacon"
}