{
  "url": "https://www.seriouseats.com/cochinita-pibil-yucatan-barbecue-mexican-smoked-pork-recipe",
  "image_url": "https://www.seriouseats.com/thmb/u2cm7KvGo12sKL3dNj9mToy6Atw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160510-cochinita-pibil-recipe-27-e190334085914655ba0724ca64d9ce74.jpg",
  "tags": [
    "Mexican",
    "Smoked Pork",
    "Pork Shoulder",
    "Tacos",
    "Cinco de Mayo"
  ],
  "title": "Cochinita Pibil (Yucatán-Style Barbecued Pork)",
  "full_text": "Cochinita Pibil (Yucatán-Style Barbecued Pork)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n4 hrs 45 mins\nActive\n60 mins\nMarinating Time\n60 mins\nTotal\n6 hrs 5 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinade:\n1\nwhole\nhead\ngarlic\n, separated into individual unpeeled cloves\n2\ntablespoons\n(\n30\nml\n)\nlard\nor\nvegetable oil\n1/4\ncup\nachiote (annatto) seeds\n(\n1 1/2\nounces\n;\n40\ng\n)\n2\ntablespoons\n(about\n6\ng\n)\nMexican oregano\n3\nwhole\ncloves\n1\n(\n3-inch\n)\nCeylon cinnamon\nstick\n, or\n1\n(1/2-inch) piece\nof\ncassia cinnamon\n(see note)\n2\ntablespoons\n(about\n8\ng\n)\nwhole black peppercorns\n1\ntablespoon\n(about\n4\ng\n)\nwhole cumin seeds\n1\ntablespoon\n(about\n4\ng\n)\nwhole allspice berries\n3/4\ncup\n(\n175\nml\n)\nbitter\n(Seville)\norange juice\n, or\n1/4\ncup\n(\n60\nml\n) each\nlime\n,\norange\n, and\ngrapefruit juice\n1/4\ncup\n(\n60\nml\n)\nwhite vinegar\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\nKosher salt\nFor the Pork:\n4\npounds\n(\n1.8\nkg\n)\nboneless pork shoulder\nor\n6\npounds\n(\n2.7\nkg\n)\nbone-in pork shoulder\n, cut into 2-inch-thick slabs\n6\nto 8\nbanana leaves\n(see note)\n2\nRoma tomatoes\n, sliced\n1\nred or green\nbell pepper\n, sliced\n1\nwhite onion\n, sliced\n12\nbay leaves\nTo Serve:\nWarm corn tortillas\nYucatán-style pickled onions and salsa\nDirections\nThread garlic cloves onto a metal skewer and grill directly over the flame of a gas grill until completely blackened on all sides, 3 to 4 minutes. Alternatively, toss in a dry skillet over high heat until blackened. Peel blackened skins when cool enough to handle.\nSerious Eats / J. Kenji López-Alt\nHeat oil or lard in a skillet over medium heat until shimmering. Add achiote, oregano, cloves, cinnamon, black peppercorns, cumin, and allspice and cook, tossing and stirring, until fragrant, about 2 minutes. Transfer to a blender along with peeled garlic, bitter-orange juice, vinegar, soy sauce, and a big pinch of salt. Blend until smooth. Season to taste with more salt. It should be quite salty and have a consistency like ketchup. If too thick, thin it with water until it flows slowly.\nSerious Eats / J. Kenji López-Alt\nPour marinade over meat and rub it in with your hands. Cover, refrigerate, and let it rest at least 1 hour and up to overnight.\nSerious Eats / J. Kenji López-Alt\nLay out 2 to 3 overlapping banana leaves on a work surface. Place 1 piece of pork in the center and layer with some of the tomatoes, bell pepper, onion, and bay leaves.\nSerious Eats / J. Kenji López-Alt\nForm a tight parcel by folding the bottom side up and the top side down, then rolling in the sides. Secure parcel with kitchen twine and transfer pork to an oven-safe baking sheet or disposable aluminum baking tray. Repeat with remaining pork and banana leaves.\nSerious Eats / J. Kenji López-Alt\nLight 3/4 chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high, cover, and preheat for 10 minutes.\nPlace a few large hardwood chunks on coals (no need to soak). Place aluminum tray or baking sheet on the side opposite the fire and close lid. Smoke pork, aiming for a temperature between 250 and 300°F (120 and 150°C) inside the chamber the whole time, until a metal skewer inserted into pork shows no resistance, 4 to 5 hours total. (Adjust heat by adding coals and/or adjusting the air vents.) Add extra wood chunks to coals once per hour.\nSerious Eats / J. Kenji López-Alt\nRemove pork from grill and transfer parcels to a deep platter or shallow bowl. Unwrap banana leaves, shred pork with two forks, stir it into drippings, stuff it into tortillas with pickled red onions and salsa, and serve immediately.\nSpecial Equipment\nMetal skewer\n;\nsmoker\nor grill (\ncharcoal\nor\ngas\n); 1 pound (450g) hardwood chunks, such as hickory, mesquite, or applewood\nNotes\nLook for \"true\" or Ceylon cinnamon, which has a thinner, more scroll-like bark and a milder flavor. It's available in specialty spice shops or in Latin markets. If unavailable, regular cassia cinnamon can be used in its place (use half the amount called for).\nBanana leaves can be found in the freezer section of most Asian supermarkets.\nRead More\nYucatán-Style Hot Dried-Chili Salsa (K'uut Bi Ik) Recipe\nExtra-Hot Yucatán-Style Roasted-Habanero Salsa (Chile Tamulado) Recipe\nHomemade Tacos Al Pastor Recipe\nCharcoal-Grilled Al Pastor Skewers Recipe\nNo-Waste Tacos de Carnitas With Salsa Verde Recipe\nMexican\nSmoked Pork\nPork Shoulder\nTacos\nCinco de Mayo",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cochinita-pibil-yucatn-style-barbecued-pork.webp?"
}