{
  "url": "https://www.seriouseats.com/coconut-milk-recipe-recipe-8386881",
  "image_url": "https://www.seriouseats.com/thmb/hImqKsiPq5QMY1-GYxeePjvssYk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231201-SEA-CoconutMilk-KarinaMatalon-06-feb006003a26400b9d639490025bf80a.jpg",
  "tags": [
    "Drinks",
    "The Latest",
    "No-Cook Fruit",
    "Coconut"
  ],
  "title": "How to Make Coconut Milk",
  "full_text": "How to Make Coconut Milk\nClose\nJump to recipe\nPrep\n20 mins\nTotal\n20 mins\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\ndry\ncoconut\n(about\n1 1/2\npounds\n;\n680\ng\n)\nDirections\nPlace the coconut on a folded kitchen towel on top of a cutting board (this creates a steady work surface).\nUsing a screwdriver, and tapping it with a hammer if necessary, puncture and open 2 of the 3 eyes on top of the coconut. Pour the coconut water through the opened eyes into a 4-cup (1L) measuring cup or or large bowl, then add enough water, if needed, to total 3 cups (710ml); set aside.\nSerious Eats / Karina Matalon\nUsing a hammer, crack the now-drained coconut shell fully open. Remove kitchen towel from the cutting board. Using a spoon or small knife, carefully pry out coconut meat, separating it from the shell. Make sure to remove all hard shell pieces, though it is okay if bits of the thin brown skin remain attached to the meat.\nSerious Eats / Karina Matalon\nTransfer coconut meat and reserved coconut water mixture to a high-powered blender and blend, tamping with the blender's tamper (if it has one) or stopping and scraping down the sides as needed, until coconut mixture is thoroughly pureed into a milky slurry.\nSerious Eats / Karina Matalon\nLine a fine-mesh strainer with a double layer of cheesecloth and set it over a large bowl. Pour the blended coconut slurry into the prepared strainer. Gather the cheesecloth up around the slurry, then twist directly over the strainer to enclose the slurry. Continue to twist and squeeze cheesecloth over the strainer, tightening the packet and expressing coconut milk as you go, until no more coconut milk can be expressed and only the now-dry coconut pulp remains in the touch. Discard coconut pulp and reserve strained coconut milk; you should have about 3 cups (710ml).\nSerious Eats / Karina Matalon\nSpecial Equipment\nScrewdriver, hammer, high-powered blender, fine-mesh strainer with cheesecloth.\nMake-Ahead and Storage\nThe freshly made coconut milk can be stored in an airtight container and refrigerated for up to 2 days or frozen for up to 4 weeks. Thaw in the refrigerator until liquid, about 24 hours, before using.\nDrinks\nThe Latest\nNo-Cook Fruit\nCoconut"
}