{
  "url": "https://www.seriouseats.com/coconut-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/TEkZD5LDwsTHEBtnyYuA-kfjuAg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__05__20170410-coconut-dulce-chocolate-ganache-layer-cake-vicky-wasik-3-d8f04208bfa54b3d9afaf07f32db0ab4.jpg",
  "tags": [
    "Layer Cake",
    "Coconut",
    "Cakes"
  ],
  "title": "Triple Coconut Cake Recipe",
  "full_text": "Triple Coconut Cake Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n35 mins\nActive\n90 mins\nCooling and Chilling Time\n2 hrs 50 mins\nTotal\n3 hrs 45 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n16\nounces\nplain or\ntoasted\nsugar\n(about\n2 1/4\ncups\n;\n455\ng\n)\n4 1/2\nteaspoons\nbaking powder\n2 1/4\nteaspoons\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n4\nounces\nunsalted butter\n(\n8\ntablespoons\n;\n115\ng\n), soft but cool, about 60°F (16°C)\n4\nounces\nvirgin coconut oil\n(about\n2/3\ncup\n;\n115\ng\n), such as Vita Coco, creamy and soft, about 72°F (22°C)\n3\nlarge\neggs\n, brought to about 65°F (18°C)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n); Tahitian works particularly well\n12\nounces\nall-purpose flour\n(about\n2 2/3\ncups\n, spooned;\n340\ng\n) (see notes)\n2\nounces\ncoconut flour\n(about\n2/3\ncup\n, spooned;\n55\ng\n), such as Bob's Red Mill\n18\nounces\nunsweetened, full-fat coconut milk\n(about\n2 1/4\ncups\n;\n510\ng\n), well stirred, leftovers reserved for ganache\nTo Finish:\n1\nrecipe\ncreamy coconut frosting\n1\nrecipe\ncaramelized white chocolate ganache\n, made with coconut milk\n7\nounces\n(\n195\ng\n)\nsweetened coconut flakes\n, lightly toasted\nDirections\nFor the Cake:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). Lightly grease three 8-inch anodized aluminum cake pans and line with parchment (explanation and tutorial\nhere\n). If you don’t have three pans, it’s okay to bake the cakes in stages; the batter will keep at room temperature until it's needed.\nIn the bowl of a stand mixer fitted with a paddle attachment, combine sugar, baking powder, salt, butter, and virgin coconut oil. Mix on low speed to roughly incorporate, then increase to medium and beat until fluffy and light, about 5 minutes. Halfway through, pause to scrape the bowl and beater with a flexible spatula.\nWith the mixer still running, add eggs one at a time, letting each fully incorporate before adding the next, then dribble in vanilla. Pause mixing and sift together the all-purpose and coconut flours, then resume mixing on low. Sprinkle in about 1/3 of flour mixture, then drizzle in 1/3 of coconut milk. Repeat with remaining flour and coconut milk, working in thirds as before.\nScrape bowl and beater with a flexible spatula and resume mixing on medium speed for about 3 seconds to ensure everything is well combined. The batter should look creamy and thick, registering between 65 and 68°F (18 and 20°C) on a digital thermometer. (Significant deviation indicates ingredients were too warm or too cold, which can lead to textural problems with the cake.)\nUsing a flexible spatula, fold batter once or twice from the bottom up, then divide evenly between prepared cake pans (about 20 ounces or 565g each, if you have a scale). Stagger pans together on oven rack and bake until puffed, firm, and pale gold, about 35 minutes. If your oven heats very unevenly, pause to rotate the pans after about 20 minutes. Alternatively, bake 2 layers at once and finish the third when they’re done.\nCool cakes directly in their pans for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off parchment, and return cakes right side up. (Covered in plastic, the cakes can be left at room temperature for a few hours.) Prepare the frosting.\nFor the Crumb Coat:\nLevel cakes with a serrated knife (full directions\nhere\n) and set scraps aside for snacking. Place 1 layer on a heavy cast iron turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top cake layer with exactly 1 cup frosting, using an offset spatula to spread it evenly from edge to edge. Repeat with second and third layers, then cover sides of cake with another cup of frosting, spreading it as smoothly as you can (tutorial\nhere\n). Refrigerate cake until frosting hardens, about 30 minutes, and repeat if desired for a thicker coat. Meanwhile, prepare the ganache as directed.\nTo Finish:\nPlace the chilled and crumb-coated cake on a wire rack nested in a half sheet pan.\nPour lukewarm ganache over the top\n, working from the center out to ensure even coverage. If needed, use a clean offset spatula to nudge the ganache along, or rap the pan against the countertop to create vibrations that will level the ganache. Once ganache has stopped flowing, cover top and sides of cake with toasted coconut flakes.\nTo Serve:\nLet cake sit at room temperature for at least an hour before serving, or until it reaches an internal temperature of about 72°F (22°C). Cut with a chef’s knife to serve and cover the exposed edges with leftover buttercream to keep the cake moist. Under a cake dome, the cake will keep for 3 days at room temperature.\nSpecial equipment\nStand mixer, three 8-inch anodized-aluminum cake pans (preferably 3 inches deep), digital thermometer, serrated knife, cast iron turntable (optional), 7-inch offset spatula, wire rack, half sheet pan\nNotes\nProblems such as doming, cracking, shrinking, heavy crust development, and a coarse or wet crumb stem from excessive gluten formation due to the use of high-protein flour. Cakes in particular benefit from all-purpose flours made from a blend of red and white wheat, such as bleached Gold Medal or Pillsbury.\nThis Recipe Appears In\nHow to Make the Ultimate Coconut Layer Cake\nLayer Cake\nCoconut\nCakes"
}