{
  "url": "https://www.seriouseats.com/coconut-shrimp-recipe",
  "image_url": "https://www.seriouseats.com/thmb/JuGfmT4VDDLEZZS0hm5o7B-NoCE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110416-coconut-shrimp-pupu-tiki6-04fc71067ab240aea8f5244bce33d328.jpg",
  "tags": [
    "Shrimp",
    "Dairy-free Snacks & Appetizers",
    "Fried Seafood",
    "Coconut",
    "Hors D'Oeuvres"
  ],
  "title": "Coconut Shrimp",
  "full_text": "Coconut Shrimp\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n45 mins\nResting Time\n10 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Shrimp:\n24\n(\n12/15 count)\njumbo shrimp\n(about\n2\npounds\n), peeled and deveined\nKosher salt\n1\ncup\nshredded unsweetened coconut\n1/2\ncup\npanko-style bread crumbs\n2\nwhole eggs\n3/4\ncup\nflour\n, divided\nFor the Sweet Chili Sauce:\n2\ncloves\ngarlic\n, grated on a microplane\n1\ntablespoon\ndried red chile flakes\n, or\n2-3\nThai bird\nchiles\n, finely sliced\n1/2\ncup\npalm sugar\nor brown sugar\n1/2\ncup\nrice wine vinegar\n1/2\ncup\nplus\n1\ntablespoon\nwater\n1\ntablespoon\ncornstarch\n1\ntablespoon\nThai fish sauce\nTo Finish:\n2\nquarts\ncanola\n,\nvegetable\n, or\npeanut oil\nDirections\nSeason shrimp with salt and set aside. Mix coconut and panko in a large mixing bowl and whisk to combine. Mix eggs and 2 tablespoons flour in a large mixing bowl and whisk until homogenous. Place remaining flour in a large mixing bowl.\nAdd shrimp to bowl with flour and toss to coat evenly. Transfer shrimp to egg mixture, shaking off excess flour. Toss to coat thoroughly. Hold the bowl with the coconut mixture in your left hand, and tossing constantly, pick up shrimp one at a time with your right hand, allow excess batter to drip off, and toss in the coconut mixture. The shrimp should end up evenly coated without sticking to each other.\nSerious Eats / J. Kenji López-Alt\nTransfer the shrimp to a plate, wiping batter and crumbs off of their tails as you go. Set aside for 10 minutes.\nMeanwhile, make the sauce. Combine the garlic, chile flakes, sugar, vinegar, and 1/2 cup water in a small saucepan and heat until sugar is dissolved. Mix together remaining water and cornstarch in a small bowl to create a smooth slurry. Whisk it into the sauce and bring to a boil over medium-high heat to thicken. Remove from heat and whisk in fish sauce. Set aside.\nHeat oil in a large wok or Dutch oven to 375°F as measured on an instant read thermometer. Lower shrimp into oil one at a time and fry, agitating constantly with a metal spider until deep golden brown and crisp on all sides, about 3 minutes total. Transfer shrimp to a bowl lined with paper towels, season with kosher salt, and toss to coat. Serve immediately, with dipping sauce on the side.\nSerious Eats / J. Kenji López-Alt\nMake-Ahead and Storage\nShrimp can be stored in the freezer after frying. Let them cool to room temperature, transfer to a large plate, then place in the freezer until frozen. Transfer to a zipper-lock bag and store for up to three months. To reheat, bake frozen shrimp on a pre-heated 400°F oven on a rimmed baking sheet until crisp, about 25 minutes, flipping once halfway through baking. Alternatively, fry directly from the freezer in 375°F oil until crisp and heated through, about 3 minutes.\nRead More\nShrimp Toast\nThai Shrimp Cakes with Sweet Chili Sauce\nShrimp Tempura with Creamy Spicy Yuzu Sauce\nShrimp\nDairy-free Snacks & Appetizers\nFried Seafood\nCoconut\nHors D'Oeuvres",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/coconut-shrimp.webp?"
}