{
  "url": "https://www.seriouseats.com/coconut-layer-cake-with-chocolate-glaze-recipe",
  "image_url": "https://www.seriouseats.com/thmb/FTKZAaXVvjK-JpyuCOkN7tXbNqQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110413-127677-Serious-Sweets-Coconut-Cake-PRIMARY-bb20e3cd767948e8a36633280eb6ac18.jpg",
  "tags": [
    "Layer Cake",
    "Chocolate",
    "Coconut",
    "Cakes"
  ],
  "title": "Coconut Layer Cake with Chocolate Glaze Recipe",
  "full_text": "Coconut Layer Cake with Chocolate Glaze Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n25 mins\nActive\n60 mins\nCooling and Chilling Time\n105 mins\nTotal\n2 hrs 40 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 3/4\ncups\ncake flour\n1\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nsalt\n1 3/4\ncups\nsugar\n1\ncup\n(\n2\nsticks\n) plus\n2\ntablespoons\nunsalted butter\n, softened\n1\n(\n15-ounce) can\ncream of coconut\n4\nlarge\neggs\n, separated\n2\nteaspoons\nvanilla extract\n1\ncup\nbuttermilk\n2 1/4\ncups\npacked sweetened flaked coconut\n4\nounces\ncream cheese\n, softened\n1 1/2\ncups\nconfectioners' sugar\n1/2\ncup\ndry-roasted macadamia nuts\n, chopped\n1/2\ncup\nheavy cream\n1/2\ncup\ndark corn syrup\n9\nounces\nbittersweet chocolate\n, finely chopped\nDirections\nAdjust oven racks to upper middle and lower middle positions and preheat oven to 350°F. Butter and flour (or spray with baking spray) three 9-inch round cake pans.\nWhisk flour, baking powder, baking soda, and 1/2 teaspoon salt in medium bowl; set aside. With mixer fitted with paddle attachment, beat sugar and 1 cup butter on medium-high speed until light, about 2 minutes. Add 1 cup cream of coconut and beat until fluffy, about 1 minute. Beat in egg yolks and vanilla extract.\nReduce speed to low and add reserved flour mixture in 3 additions, alternating with buttermilk. Mix just until combined, scraping sides and bottom of bowl with rubber spatula as needed. Add 2 cups coconut and beat just until combined.\nFit mixer with whisk attachment and place egg whites in clean, dry mixing bowl. Beat whites on medium-low speed until whites begin to froth, about 1 minute. Increase speed to medium-high and beat whites until stiff peaks form, 2 to 3 minutes. Fold beaten whites into batter with rubber spatula.\nDivide batter equally between prepared cake pans, smoothing out top with rubber spatula. Place two cake pans side-by-side on top rack and third cake pan on bottom rack. Bake until cake tester inserted in center of cakes comes out clean, about 15 to 20 minutes, alternating cake positions halfway through baking. Transfer cakes to cooling racks and cool 10 minutes in pans. Turn cakes directly onto racks and cool completely, about 1 hour.\nMeanwhile, fit mixer with whisk attachment and whip cream cheese, remaining cream of coconut (about 1⁄4 cup), and remaining 2 tablespoons butter on medium-high speed until light, 1 to 2 minutes. Reduce speed to low and add confectioners’ sugar. Mix on low until incorporated, then increase speed to medium-high and whip until fluffy, 2 to 3 minutes. Fold macadamia nuts into frosting with rubber spatula.\nArrange one cake layer, top-side down on cake plate or parchment paper (see notes). With offset spatula, spread with half of cream cheese frosting. Top with second cake layer, top-side down. Spread with remaining cream cheese frosting, then top with third cake layer, top-side down. Press cake down gently with your hand.\nBring cream and corn syrup to simmer in medium saucepan. Remove from heat. Add chocolate and whisk until melted and smooth.\nSpread 1 cup glaze over top and sides of cake with offset spatula. Freeze until glaze is almost set, about 5 minutes. Pour remaining glaze over cake working quickly to smooth sides and top. Sprinkle with remaining 1/4 cup coconut. Refrigerate cake until glaze is firm, 30 minutes to 1 hour. Serve.\nSpecial Equipment\nThree 9-inch round cake pans, large offset spatula, electric mixer\nThis Recipe Appears In\nLet Them Eat: Coconut Layer Cake with Chocolate Glaze\nLayer Cake\nChocolate\nCoconut\nCakes"
}