{
  "url": "https://www.seriouseats.com/coconut-cream-pie-recipe-7376208",
  "image_url": "https://www.seriouseats.com/thmb/c6WBxzYa4t-yNeykif_KLSnhUsM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230406-SEA-CoconutCremePie-AmandaSuarez-heroFINAL-781f42cfa3cd48cea66a7c34c0bf4435.jpg",
  "tags": [
    "Pies",
    "The Latest",
    "Desserts",
    "Coconut"
  ],
  "title": "Coconut Cream Pie",
  "full_text": "Coconut Cream Pie\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nChilling and Cooling Time\n4 hrs 45 mins\nTotal\n5 hrs 15 mins\nMakes\n1 9-inch pie\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\ncornstarch\n(\n1\nounce\n;\n28\ng\n)\n1/3\ncup\ngranulated sugar\n(\n2.5\nounces\n;\n70\ng\n)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n4\nlarge\negg yolks\n(\n2\nounces\n;\n56\ng\n)\n1\n(13.5-ounce; 380 g) can\ncoconut milk\n1 1/4\ncups\nwhole milk\n(\n296\nml\n)\n2\ncups\nsweetened shredded coconut\n(\n6\nounces\n;\n170\ng\n)\n1/2\nteaspoon\nvanilla extract\n1/2\nrecipe\nButtery, Flaky\nPie Crust\n,\nblind-baked\nper instructions\n1\nrecipe\nwhipped cream\n, for topping\n1\ncup\nflaked coconut\n(\n1.7\nounces\n;\n50\ng\n), for topping\nDirections\nIn a medium heat-proof bowl, stir together cornstarch, granulated sugar, and salt. Whisk in egg yolks until smooth.\nSerious Eats / Amanda Suarez\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nSerious Eats / Amanda Suarez\nIn a 2-quart saucier or saucepan, combine coconut milk, whole milk, and vanilla extract. Set over medium-low heat and bring to a simmer. Remove from heat and, while whisking constantly, slowly pour milk into egg yolk mixture in a thin stream until all of it has been added.\nSerious Eats / Amanda Suarez\nReturn the mixture to the same saucepan. Cook over medium heat, whisking constantly, until the custard begins to thicken, about 4 minutes. Once it thickens, continue to whisk, pausing every few seconds to check for bubbles, about 1 minute. When it begins to bubble, set a timer and continue whisking for 1 minute.\nSerious Eats / Amanda Suarez\nRemove from heat, then strain the custard through a fine-mesh strainer set over a heatproof medium bowl. Fold in sweetened shredded coconut and immediately place plastic wrap directly on the surface of the custard. Transfer bowl to prepared ice bath to chill for 30 minutes, then scrape the custard into the prepared blind-baked pie crust. Press plastic wrap directly onto the surface of the custard and refrigerate until set, about 4 hours.\nSerious Eats / Amanda Suarez\n30 minutes before you plan to serve the pie, adjust oven rack to middle position and preheat oven to 350ºF (175ºC). Spread flaked coconut on a rimmed baking sheet and toast, shaking the pan occasionally, until golden brown, about 8 minutes. Remove from oven and allow coconut to cool to room temperature, about 15 minutes.\nSerious Eats / Amanda Suarez\nWhen ready to serve, top pie with whipped cream and garnish with toasted flaked coconut.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n2 medium heat-proof bowls, 2-quart saucier or saucepan, whisk, fine-mesh strainer, rimmed baking sheet\nMake-Ahead and Storage\nThe pie crust can be made and filled with custard up to three days in advance; top with whipped cream and toasted flaked coconut just before serving.\nPies\nThe Latest\nDesserts\nCoconut"
}