{
  "url": "https://www.seriouseats.com/coco-bread",
  "image_url": "https://www.seriouseats.com/thmb/xsxeISVtps0fictRMktUWrqTIXE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__08__20200825-Jamaican-Coco-Bread-daniel-gritzer-2-8e59413b973a46fe969aad3cf1bf1643.jpg",
  "tags": [
    "Yeast Breads",
    "Jamaican",
    "Sides"
  ],
  "title": "Coco Bread Recipe",
  "full_text": "Coco Bread Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n1 mins\nActive\n60 mins\nProofing Time\n60 mins\nTotal\n91 mins\nServes\n10\nto 25 servings\nCook Mode\n(Keep screen awake)\nIngredients\n625\ng\n(\n1\npound\n6\nounces\n;\n5\ncups\n) low protein\nall-purpose flour\n, such as Gold Medal Blue Label, plus more for dusting\n85\ng\n(\n3\nounces\n;\n1/4\ncup\nplus\n2\ntablespoons\n)\nsugar\n14\ng\n(\n0.5\nounces\n;\n4\nteaspoons\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\n12\ng\n(\n0.4\nounces\n;\n1\nrounded\ntablespoon\n)\ninstant dry yeast\n, such as SAF; not RapidRise or active dry (more info\nhere\n)\n56\ng\n(\n2\nounces\n;\n4\ntablespoons\n) melted\nunsalted butter\n, plus more for brushing and greasing\n355\ng\n(\n12.5\nounces\n;\n1 1/2\ncups\n)\nwhole milk\n, warmed to about 100°F (38°C)\nDirections\nIn a large bowl, whisk together flour, sugar, salt, and yeast.\nAdd melted butter to dry ingredients and stir with a wooden spoon until well combined. Add warmed milk and stir until dry ingredients are fully incorporated and a slightly sticky dough begins to form.\nScrape dough out onto a lightly floured work surface and knead, dusting lightly with additional flour as needed to prevent sticking, until a soft, elastic dough forms, 5 to 10 minutes.\nWash, dry, and then grease the mixing bowl. Return dough to bowl, cover with plastic, and let proof at warm room temperature until puffy, light, and roughly doubled in size, 1 to 2 hours. In a chilly kitchen, the dough will need more time to rise, and in a warmer kitchen, it will move faster.\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Line 2 rimmed baking sheets with parchment paper. Turn dough out onto a lightly floured work surface. To make small coco breads, divide dough into 45g (1 1/2-ounce) portions; to make larger ones, divide into 115g (4-ounce) portions. This recipe yields either 25 small or 10 large portions.\nWorking with one portion of dough a a time, gently roll each portion into a ball, then, using a rolling pin and dusting very lightly with flour as needed to prevent sticking, roll out into 1/8-inch-thick (3mm) rounds. Brush top side of round with melted butter, then fold in half to form a half-moon shape. Brush top surface of half-moon with additional melted butter, then fold once more to form a quarter-circle. Transfer to prepared baking sheet. Repeat with remaining dough portions; leave about 1 1/2 inches of space between each portion of dough on the baking sheet.\nWorking with one baking sheet at a time, bake coco breads until puffed and lightly golden on top, about 15 minutes for smaller coco breads and 20 minutes for larger ones. Repeat with remaining baking sheet of coco breads. Brush baked coco breads with additional melted butter, if desired. Serve.\nSpecial Equipment\nDigital scale, rimmed baking sheets (see notes)\nNotes\nWhile more efficient with two baking sheets, this recipe can be made with just one: Simply portion, roll, and form half the dough into coco breads and bake; cover unused dough to prevent drying out. Transfer baked coco breads to a wire rack to cool slightly, and allow baking sheet to cool before arranging next batch of coco breads on it. You can reuse the same piece of parchment paper for the second batch.\nMake-Ahead and Storage\nThe coco breads are best eaten fresh, but can be kept in an airtight container for up to 5 hours before serving; rewarm before serving.\nYeast Breads\nJamaican\nSides"
}