{
  "url": "https://www.seriouseats.com/coconut-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/13ECSZ6BWChuM2uh8PgpSEHB1Xc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__05__20170410-coconut-dulce-chocolate-ganache-layer-cake-vicky-wasik-9-57da59323d7246cab59f517a4f13f907.jpg",
  "tags": [
    "Pastries",
    "Cakes"
  ],
  "title": "Creamy Coconut Frosting Recipe",
  "full_text": "Creamy Coconut Frosting Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n35 mins\nTotal\n35 mins\nServes\n48 servings\nMakes\n6 heaping cups\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\negg whites\n(\n2/3\ncup\n;\n170\ng\n), from\n5 to 6\nlarge\neggs\n12\nounces\nturbinado sugar\n(about\n1 3/4\ncups\n;\n340\ng\n), such as Trader Joe's\n3/4\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; use half as much if iodized\n1/4\nteaspoon\ncream of tartar\nScraped seeds from\n1\nTahitian vanilla bean\n, such as Beanilla\n16\nounces\nunsalted butter\n(\n4\nsticks\n;\n450\ng\n), softened to about 65°F (18°C)\n4\nounces\nvirgin coconut oil\n(about\n2/3\ncup\n;\n115\ng\n), such as Vita Coco, creamy and soft, about 72°F (22°C) (see note)\n1\nteaspoon\n(\n5\nml\n) Tahitian\nvanilla extract\n, such as Beanilla\nDirections\nFill a wide pot with at least 1 1/2 inches water, with a thick ring of crumpled tinfoil placed on the bottom to act as a \"booster seat\" that will prevent the bowl from touching the bottom of the pot. Place over high heat until steaming-hot, then adjust temperature to maintain a gentle simmer. Combine egg whites, turbinado sugar, salt, cream of tartar, and vanilla seeds in the bowl of a stand mixer. Set over steaming water, stirring and scraping constantly with a flexible spatula, until egg whites reach 185°F (85°C). This should take only 10 to 12 minutes, so if mixture seems to be moving slowly, simply turn up the heat. Once ready, transfer to a stand mixer fitted with a whisk attachment and whip at high speed about 10 minutes, until meringue is glossy, stiff, and cool to the touch, around 90°F (32°C).\nWith mixer still running, add butter, 1 or 2 tablespoons at a time, followed by coconut oil. Initially, the volume of the meringue will decrease; it may even seem soupy along the way, but as the cool butter is added, the mixture will begin to thicken and cool. In the end, the buttercream should be thick, creamy, and soft but not runny, around 72°F (22°C). Mix in vanilla extract on low speed until well combined.\nUse buttercream right away, or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to 72°F and re-whip before using.\nTroubleshooting:\nIf warmer than 74°F (23°C), the buttercream will be soft and loose; pop it in the fridge for 15 minutes and re-whip to help it thicken and cool. If colder than 68°F (20°C), the buttercream will be firm and dense, making it difficult to spread over cakes and slow to melt on the tongue, creating a greasy mouthfeel. To warm, briefly set over a pan of steaming water, just until you see the edges melting slightly, then re-whip to help it soften and warm. You can find a full troubleshooting guide and video\nhere\n.\nSpecial equipment\nLarge pot, digital thermometer, stand mixer\nNotes\nThis recipe depends on the quality of the virgin coconut oil, which can vary significantly from brand to brand. If you don't already have a favorite in mind, I've found Vita Coco to have the most vibrant flavor and aroma. It's available online and in supermarkets nationwide, so keep an eye out for the bright blue label.\nThis Recipe Appears In\nHow to Make the Ultimate Coconut Layer Cake\nPastries\nCakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/creamy-coconut-frosting-recipe.webp?"
}