{
  "url": "https://www.seriouseats.com/coctel-de-camarones-colombian-style-shrimp-ceviche-cocktail-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0vL233qHs_tflw2SjyNf2DJBHZc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__20120501-colombian-shrimp-cocktail-cocteles-camarones-ceviche-4-86561605cf7e477c88241430331c130f.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Colombian",
    "Shrimp"
  ],
  "title": "Coctel de Camarones (Colombian-Style Shrimp Ceviche Cocktail) Recipe",
  "full_text": "Coctel de Camarones (Colombian-Style Shrimp Ceviche Cocktail) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n25 mins\nMarinating Time\n15 mins\nTotal\n30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\npeeled small shrimp\n(see note)\nKosher salt\n1/4\nteaspoon\nbaking soda\n2\ntablespoons\njuice\nfrom about\n4\nlimes\n3\ntablespoons\nmayonnaise\n2\nteaspoons\nextra-virgin olive oil\n(see note)\n2\ntablespoons\nketchup\n1/4\ncup\nfinely minced\nonion\nHot sauce\n(such as\nTabasco\n) to taste\n1\ntablespoon\nminced\nfresh parsley\nleaves (optional)\nFreshly\nground black pepper\nSaltine crackers\nfor serving\nDirections\nCombine shrimp, 1 teaspoon kosher salt, and baking soda in a medium bowl and toss to coat. Place in refrigerator and let rest for 15 minutes.\nIn a medium bowl, combine 1 tablespoon lime juice, mayonnaise, olive oil, ketchup, and onion and stir until homogenous. Add hot sauce to taste and stir to combine. Add parsley and season to taste with salt and black pepper. Set aside.\nAdd shrimp to medium pot and cover with 3 cups cold water. Add remaining 1 tablespoon salt with remaining 1 tablespoon lime juice. Place over medium-high heat and heat until water is barely steaming and registers 170°F (77°C) on an instant-read thermometer; adjust heat to maintain this temperature for remainder of cooking. Cook shrimp until pink and firm to the touch, about 7 minutes total. Drain carefully, rinse under cold running water, and spin dry in salad spinner. Add shrimp to bowl with sauce and toss to combine. Serve immediately with crackers and extra limes for squeezing.\nSerious Eats / J. Kenji López-Alt\nNotes\nFor best results, use small, raw, shell-on shrimp and peel yourself (shelled shrimp tend to be a little mangled). Avoid par-cooked shrimp, as they will not absorb flavor properly. Traditional Colombian-style coctel is made with straight-up mayo, ketchup, and hot sauce. I like adding some extra-virgin olive oil for extra flavor.\nRead More\nCartagena-Style Ceviche is the Chicago Deep Dish of Shrimp Cocktails\nSnacks & Appetizers\nColombian\nShrimp"
}