{
  "url": "https://www.seriouseats.com/cola-chicken-cantonese-style-chicken-poached-in-soy-sauce-and-cola",
  "image_url": "https://www.seriouseats.com/thmb/mhd1eoBMPVPk-8hN0yma9AO1gZo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200117-coca-cola-chicken-vicky-wasik-26-41493f82b338454e9fc05ed5b250b612.jpg",
  "tags": [
    "Poaching",
    "Chinese-American",
    "Poached Chicken",
    "Chicken",
    "Whole Chicken"
  ],
  "title": "Soy Sauce Chicken With Cola Recipe",
  "full_text": "Soy Sauce Chicken With Cola Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n85 mins\nActive\n15 mins\nResting Time\n10 mins\nTotal\n100 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n1\n(\n3 1/2- to 4-pound; 1.6 to 1.8 kg\n)\nchicken\n, backbone removed and chicken cut in half lengthwise through breastbone\n1\ntablespoon\n(\n12\ng\n)\nkosher salt\n1/4\ncup\n(\n60\nml\n)\nChinese rose wine\nor Shaoxing wine, divided (see notes)\nFor the Poaching Liquid:\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n1\nlarge\nshallot\n(\n50\ng\n), thinly sliced\n2\ngarlic\ncloves\n, peeled and smashed\n1\n(\n2-inch) piece\nginger\n, peeled and thinly sliced\n5\npieces\nwhole star anise\n1\n(2-inch)\ncinnamon stick\n, smashed\n1/4\nteaspoon\nground\nwhite pepper\n3\ncups\n(\n710\nml\n)\nCoca-Cola\n(\n2\n(12-ounce) cans\n)\n1 3/4\ncups\n(\n420\nml\n)\ndark soy sauce\n1\ncup\n(\n240\nml\n)\nwater\n3/4\ncup\n(\n175\nml\n)\nhoney\n2\nscallions\n, cut into 3-inch pieces and lightly smashed\nTo Serve:\nSteamed white rice\nSliced scallions\nDirections\nFor the Chicken:\nUsing clean hands, rub salt generously over chicken skin to remove any rough imperfections. Using a brush, brush 2 tablespoons (30ml) wine over surface of chicken. Set aside.\nSerious Eats / Vicky Wasik\nFor the Poaching Liquid:\nIn a Dutch oven, heat oil over medium-high heat until shimmering. Add shallot, garlic, ginger, star anise, and cinnamon and cook, stirring occasionally, until fragrant, about 1 minute. Stir in white pepper and cook until fragrant, about 30 seconds longer. Stir in Coca-Cola, soy sauce, water, honey, and scallions. Bring mixture to a boil, and simmer, stirring occasionally, until bubbling subsides, about 15 minutes.\nTo Poach:\nStir in remaining 2 tablespoons (30ml) wine. Gently lower chicken in pot, breast-side up, and return to boil over medium heat. Reduce heat to low, cover, and simmer for 10 minutes. Uncover and carefully flip chicken breast-side down. Cover and simmer 10 minutes longer. Turn off heat and let chicken stand, covered, until thickest part of breast registers 150°F (66°C) and legs register 165°F (74°C), 20 to 30 minutes. Transfer chicken, breast-side-up, to a serving platter, cover loosely with foil, and let rest for at least 10 minutes before serving.\nSerious Eats / Vicky Wasik\nMeanwhile, bring poaching liquid to a simmer, and cook, uncovered, until slightly reduced and thickened, 10 to 15 minutes. Adjust seasoning with water or salt to taste. Ladle liquid over rested chicken to lacquer and fill in any light spots. Serve over steamed white rice, passing extra poaching liquid and sliced scallions at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nDutch oven\n,\ninstand-read thermometer\nNotes\nMei kuei lu chiew is a Chinese rose wine that works particularly well in this dish, as it complements and amplifies the floral notes in the soda. If you can't find it, Shaoxing wine is a perfectly serviceable substitute. Both can be found at Chinese markets or online.\nMake-Ahead and Storage\nStored in the braising liquid, the chicken will keep for up to one week in the refrigerator in a tightly sealed container; it will become more flavorful as it sits. The poaching liquid can be strained and refrigerated for up to one week, or frozen for up to six months. The poaching liquid can be used to poach more chicken, and the more chicken you poach in it, the better it will taste.\nRead More\nHainanese Chicken Rice Set\nCold-Start Your Way to the Tenderest Poached Chicken\nCherry Coke-Glazed Country Ham\nPoaching\nChinese-American\nPoached Chicken\nChicken\nWhole Chicken"
}