{
  "url": "https://www.seriouseats.com/colcannon-recipe-11694899",
  "image_url": "https://www.seriouseats.com/thmb/iIv5TcF4d74heCjeaV9yUJjIOtQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250304-SEA-Colcannon-HannahHufham-Beauty1-89-fbadad3690c6446fbcc1130fc7d4c618.jpg",
  "tags": [
    "Vegetable Sides",
    "The Latest",
    "Irish",
    "Mashed Potatoes"
  ],
  "title": "Colcannon (Irish Mashed Potatoes With Cabbage)",
  "full_text": "Colcannon (Irish Mashed Potatoes With Cabbage)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\n(\n1.14\nkg\n) medium starch yellow\npotatoes\n(such as Yukon Golds), peeled and cut into 1- to 2-inch cubes\n4\nmedium\nscallions\n(\n1 1/2\nounces\n;\n43\ng\ntotal), white and green parts thinly sliced and divided\n6\ntablespoons\n(\n85\ng\n)\nunsalted butter\n, plus more for serving\n3\nmedium cloves\ngarlic\n(\n15\ng\n), minced\n1/2\nhead\nsmall\ncabbage\n(\n1\npound\n;\n455\ng\n), halved lengthwise, cored, then cut crosswise into 1/2-inch-thick slices (about\n3\ncups\n)\n3/4\ncup\n(\n180\nml\n)\nwhole milk\n, plus more as needed\n2\ntablespoons\nfinely chopped laver seaweed\n(also sold in sheets as nori; optional, see notes)\n1\ntablespoon\n(\n9\ng\n)\nDiamond Crystal kosher salt\n, plus more to taste; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\n, plus more for garnish\nDirections\nIn a large pot or Dutch oven, cover potatoes with water and bring to a boil over medium-high heat. Reduce heat to medium and simmer until tender, 15 to 20 minutes.\nSerious Eats / Hannah Hufman\nWhile potatoes are cooking, in a large saucepan, melt butter over medium heat. Once butter is melted, add white and light green scallion slices and garlic and cook, stirring often, until fragrant and translucent, about 1 minute. Add cabbage and cook, stirring occasionally, until cabbage is tender, 6 to 8 minutes. Stir in milk and seaweed, if using, bring to a simmer, then remove from heat.\nSerious Eats / Hannah Hufman\nIn a colander, drain potatoes, shaking off any excess water. Set a ricer or food mill over now-empty pot and pass potatoes through. Add milk and cabbage mixture, salt, pepper, and half of sliced green scallion tops; fold until just combined. If potatoes are too thick, fold in additional hot milk as needed for desired potato texture. Season with additional salt to taste, if needed. Transfer to a serving bowl and sprinkle with remaining scallion greens. Top with pats of butter and black pepper. Serve.\nSerious Eats / Hannah Hufman\nSpecial Equipment\nLarge pot or Dutch oven, large saucepan, colander, ricer or food mill\nNotes\nLaver is the name of a type of algae sometimes used in the cuisines of Ireland and Wales; nori is made from a related algae and can be used as well. It adds a subtle vegetal savoriness in this recipe, but is not traditional and can be omitted\nVegetable Sides\nThe Latest\nIrish\nMashed Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/colcannon-irish-mashed-potatoes-with-cabbage.webp?"
}