{
  "url": "https://www.seriouseats.com/cold-fermented-fontina-parmigiano-and-oregano",
  "image_url": "https://www.seriouseats.com/thmb/IsLQdFg7QwpUJgvZZUE-6KocRcY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100923-pizza-lab-fermentation-01-e40b181fb6864d65903d89d05bb900d3.jpg",
  "tags": [
    "Pizza",
    "Oregano"
  ],
  "title": "Cold Fermented Fontina, Parmigiano, and Oregano Pizza Recipe",
  "full_text": "Cold Fermented Fontina, Parmigiano, and Oregano Pizza Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n45 mins\nProofing Time\n10 hrs 10 mins\nTotal\n11 hrs 30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n20\nounces\n(\n4\ncups\n)\nItalian tipo \"00\" flour\n(see notes), plus extra for dusting dough\n0.3\nounce\n(about\n2 1/4\nteaspoons\n)\nkosher salt\n, plus extra for assembly\n0.2\nounce\n(about\n1\nteaspoon\n)\nactive dry yeast\n0.2\nounce\n(about\n2\nteaspoons\n)\nsugar\n12\nounces\nwater\n1\npound\nfontina cheese\n, grated (about\n3\ncups\n)\n6\ntablespoons\nextra-virgin olive oil\n6\nounces\nParmigiano-Reggiano\n, finely grated (about\n2\ncups\n)\nSea salt\n12\nsprigs\noregano\nDirections\nCombine flour, salt, yeast, and sugar in the bowl of a stand mixer fitted with a dough hook attachment. Whisk to combine. Add water and knead on low speed just until mixture comes together and no dry flour remains. Allow to rest for 10 minutes. Knead on low speed for an additional ten minutes. The mixture should come together into a cohesive mass that barely sticks to the bottom of the bowl as it kneads. Depending on the type of flour used, you may need to add up to 1/2 cup additional flour. If dough sticks heavily to bottom of bowl, add flour 1 tablespoon at a time with mixer running until it forms a mass that just barely sticks to the bowl. Cover bowl tightly with plastic or transfer the dough to two gallon-sized zipper lock bags, seal, and refrigerate at least overnight, and up to 5 days.\nTransfer the dough to a floured work surface and dust the top with additional flour. Using a bench scraper, divide the dough into six even pieces, approximately six ounces each. Using floured hands, shape each piece into a neat ball by gathering the dough towards the bottom. Coat four small containers with non-stick cooking spray or olive oil (large cereal bowls work great for this) and add one dough ball to each bowl. Lightly spray top of dough ball with non-stick cooking spray. Cover tightly with plastic wrap, and allow to rise at room temperature for 2 hours (dough should roughly double in volume).\nTransfer 1 ball of dough to a medium bowl filled with flour and flip to coat. Lift it and gently pat off the excess flour. Transfer it to a floured surface and gently stretch it into a 10-inch circle, leaving the outer 1-inch edge slightly thicker than the center. The best way to do this it to start by gently stretching with your fingertips. Pick up the slightly stretched dough and place it on the opened face of your left hand. Toss it back and forth between your opened hands, rotating it slightly with each toss until it stretches out to around 8-inches in diameter. Return it to the work surface. With your left hand flat in the center of the round, use your right hand to stretch the edge of the dough out, rotating as needed until it is an even 10-inches in diameter.\nHave your cheeses, olive oil, sea salt, and oregano leaves ready and close to the stovetop. Preheat the broiler to high and arrange the rack such that you can just barely fit a 12-inch heavy-bottomed oven-proof cast iron or stainless steel skillet on top of it. Dust skillet with flour, tap out excess, then heat the skillet over high heat and heat until lightly smoking, about three minutes. Transfer one dough round to the skillet. It should fill up the entire bottom surface. Working quickly, spread 1/6th of fontina over surface followed by 1/6th of Parmigiano, leaving the outer 1-inch border un-sauced. Season with sea salt salt. Drizzle with 1 tablespoon olive oil, and scatter 2 oregano stems over surface. Transfer skillet to broiler and broil until pizza is puffed and darkly charred in spots (this can take anywhere between 1 1/2 to 4 minutes, depending on the strength of your broiler). Return the skillet to the stovetop and cook until the bottom is darkly charred in spots, using a thin metal spatula to peek after about 1 minute (depending on the skillet you use, you may skip this step if the pizza is already charred). Transfer the pizza to a cutting board and serve immediately. Repeat steps 3 and 4 to bake remaining pizzas.\nThis Recipe Appears In\nThe Pizza Lab: How Long Should I Let My Dough Cold Ferment?\nPizza\nOregano"
}