{
  "url": "https://www.seriouseats.com/cold-korean-noodle-soup-mul-naengmyun-recipe",
  "image_url": "https://www.seriouseats.com/thmb/eMa11yru7BWVtpyWKB0uKgocaiM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140908-cold-korean-noodle-soup-daniel-gritzer-9-5859afa700d94e0cb33acf0d27f7c440.jpg",
  "tags": [
    "Korean",
    "Dairy-free Mains",
    "Brisket",
    "Boiled Eggs",
    "Pear"
  ],
  "title": "Mul Naengmyun (Korean Cold Noodle Soup With Asian Pear and Cucumber)",
  "full_text": "Mul Naengmyun (Korean Cold Noodle Soup With Asian Pear and Cucumber)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n35 mins\nActive\n40 mins\nCooling and Freezing Time\n14 hrs 5 mins\nTotal\n15 hrs 15 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\n(\n1.9\nL\n) homemade or store-bought\nlow-sodium chicken stock\n3\nwhole\nscallions\n(\n2\nounces\n;\n55\ng\ntotal), divided (\n1\nleft\nwhole\n,\n2\nthinly\nsliced\nfor garnish)\n1\n(1-inch) piece\nfresh peeled ginger\n(\n1/2\nounce\n;\n15\ng\n)\n4\nmedium\ncloves garlic\n(\n20\ng\n)\n1\n(1/4-ounce; 7 g) packet\nunflavored gelatin\nsoftened in\n1/4\ncup\nwater\nfor 1 minute (optional but recommended if using store-bought broth)\n1/2\npound\n(\n226\ng\n) thinly sliced\nbeef brisket\nKosher salt\n1\n(12-ounce; 350 g) package\nKorean pickled radish\nwith brine (see note), julienned, plus brine to taste\n4\nportions\nKorean naengmyun noodles\n(\n3 1/2 ounces; 100 g\neach), see note\n1/2\ncup\njulienned\ncucumber\n(\n2 1/2\nounces\n;\n70\ng\n) from\n1\nEnglish cucumber\n, for garnish\n1/2\ncup\njulienned peeled\nAsian pear\n(\n2 1/2\nounces\n;\n70\ng\n) from pear, for garnish\n4\nlarge\nhard-boiled eggs\n, peeled and halved lengthwise\nRice vinegar\n, for serving\nMustard or\nmustard oil\n, for serving\nDirections\nIn a medium pot, bring stock, whole scallion, ginger, and garlic to a simmer over medium-high heat. Reduce heat to medium-low; cover and simmer, for 20 minutes. If using store-bought broth, stir in optional softened gelatin until dissolved.\nGently poach brisket slices in simmering broth over medium-low heat until just cooked, about 30 seconds to 1 minute. Using a wire mesh spider or a slotted spoon, transfer brisket to a plate and let cool slightly, about 5 minutes, then cover with plastic wrap and refrigerate until ready to use. While brisket is cooling, season broth with salt to taste. Add pickled radish brine to taste (you want the broth very slightly sweet and tart). Strain broth through a fine mesh strainer into a large heatproof container, discarding solids, and refrigerate, uncovered, until chilled, about 2 hours.\nSkim and discard all fat from surface of chilled broth. Transfer broth to freezer until frozen, at least 12 hours. Remove broth from freezer, and let stand at room temperature until softened, about 30 minutes.\nMeanwhile, bring a large pot of salted water to a boil over high. Add noodles, cook, undisturbed, according to package directions. Run under cold water until chilled, about 1 minute, then squeeze out excess water, arrange noodles in deep bowls; set aside.\nMicrowave broth on high in 30-second intervals until partially defrosted. Using a butter knife, break partially frozen broth up into ice shards. Using the back of a spoon or a bottom of a measuring cup, crush ice shards into a wet slush texture.\nSpoon slushy broth all around and top with pickled radishes, cucumber, Asian pear, eggs, chilled poached brisket, and remaining sliced scallions. Serve, passing rice vinegar and mustard or mustard oil at the table for diners to season to taste.\nNotes\nIf you can find pickled Korean radishes, you can add their brine to the broth for a slightly sweet-tart flavor. If not, add a very small amount of sugar and rice vinegar to taste for a similar effect. Naengmyun noodles can be found at Korean markets; they are often sold pre-portioned, making it easy to select the right number of servings (if not, each serving should be roughly 100 grams uncooked noodles).\nKorean\nDairy-free Mains\nBrisket\nBoiled Eggs\nPear",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mul-naengmyun-korean-cold-noodle-soup-with-asian-pear-and-cucumber.webp?"
}