{
  "url": "https://www.seriouseats.com/cold-sichuan-noodles-with-spinach-and-peanuts-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Eo-1HG-OzOjRCvcH9YhaSQnX4qs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__08__20120826-spicy-noodles-with-spinach-recipe-1-e87aab736fb34eafaacda63d53e9efaa.jpg",
  "tags": [
    "Chinese",
    "Dairy-free Mains",
    "Dairy-free Sides",
    "Vegan Mains",
    "Vegan Sides"
  ],
  "title": "Cold Sichuan-Style Noodles with Spinach and Peanuts Recipe",
  "full_text": "Cold Sichuan-Style Noodles with Spinach and Peanuts Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n30 mins\nTotal\n25 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\nbunch\nspinach\n, trimmed and washed (about\n2\nquarts\nspinach leaves\n)\n1\ntablespoon\ncrushed red chiles\n, preferably Chinese\n2\nteaspoons\ntoasted and ground Sichuan\npeppercorns\n, divided\n1/4\ncup\nvegetable oil\n1\ntablespoon\ntoasted sesame seed oil\n1\ntablespoon\nsoy sauce\n2\ntablespoons\nChinkiang vinegar\n(see note)\n1\ntablespoon\nfermented chile broad bean paste\n2\nteaspoons\nsugar\n12\nounces\nfresh wheat noodles\n(see note)\n1/4\ncup\ntoasted peanuts\n, roughly chopped\n1/4\ncup\nchopped pickled mustard root\n(see note)\n2\nsmall\nfresh red chiles\n, sliced\n1/4\ncup sliced\nscallion greens\nDirections\nBring a large pot of salted water to a boil over high heat. Add spinach and cook just until wilted, about 30 seconds. Remove with a strainer and run under cold water until chilled. Press out excess moisture, then wrap in a clean kitchen towel and squeeze to wring out water until spinach is dry and compressed. Roll the spinach into a tight ball and slice finely. Set aside.\nCombine chiles and half of Sichuan peppercorns in a small saucepan and heat over medium-high heat, stirring often, until a toasted aroma starts coming from them, about 1 1/2 minutes. Add oil and cook until the oil starts to bubble slightly. Remove from heat and set aside until ready to use.\nIn a small bowl combine sesame seed oil, soy sauce, vinegar, broad bean paste, and sugar. Stir to combine.\nAdd noodles to boiling water and cook according to package directions until just cooked through. Transfer to a strainer and run under cold water until well chilled. Place noodles in a large serving bowl and add spinach. Add chile oil and soy sauce mixture and toss to coat. Sprinkle with peanuts, mustard roo, sliced chiles, scallion greens, and reserved Sichuan peppercorns. Serve immediately.\nNotes\nChinkiang vinegar can be found in most Asian markets. Any kind of Chinese black vinegar can be used in its place. Pickled mustard root is found either in the refrigerated or canned goods section of most Asian markets. You can replace it with chopped cabbage kimchi if unavailable. Fresh wheat noodles can be found in most Asian grocers. If unavailable, six ounces of dried wheat noodles or even spaghetti will work fine.\nChinese\nDairy-free Mains\nDairy-free Sides\nVegan Mains\nVegan Sides"
}