{
  "url": "https://www.seriouseats.com/cold-sesame-noodles-5198660",
  "image_url": "https://www.seriouseats.com/thmb/TxmXBg9PYLcI4_oKbBdQdixNtJQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210714-potato-starch-chewy-noodles-vicky-wasik-seriouseats-28-5885ee362a0345d38ac0f649ba808827.jpg",
  "tags": [
    "Noodles",
    "Stovetop",
    "East Asian",
    "Vegan Mains",
    "The Latest"
  ],
  "title": "Cold Sesame Noodles",
  "full_text": "Cold Sesame Noodles\nJump to recipe\nPrep\n40 mins\nCook\n40 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the sauce:\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n3\nmedium\ngarlic cloves\n(\n15\ng\n), thinly sliced\nOne\n1-inch piece\nfresh ginger\n, peeled and thinly sliced\n2\npieces\nwhole star anise\n3\nwhole\ncloves\n2\ntablespoons\n(\n30\nml\n)\ntoasted sesame oil\n2\ntablespoons\n(\n30\nml\n)\ncold water\n1\ntablespoon\n(\n15\ng\n)\nsugar\n2\nteaspoons\n(\n10\nml\n)\nrice wine vinegar\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; if using\ntable salt\n, use half as much by volume or same weight\n1\nteaspoon\n(\n5\nml\n)\nsoy sauce\n¾\nteaspoon\nground white pepper\n1\ntablespoon\n(\n9\ng\n)\ntoasted sesame seeds\nFor the noodles:\nKosher salt\n1 ¼\ncups\n(\n6 ⅛\nounces\n;\n175\ng\n)\npastry\nor\ncake flour\nsuch as Bob’s Red Mill (see note)\n¾\ncup\n(\n5\nounces\n;\n145\ng\n)\npotato starch\n(see note)\n¾\ncup\n(\n180\nml\n)\nboiling water\nVegetable oil\n, for greasing\nTo serve:\n6\nounces\n(\n170\ng\n)\ncelery\n(about\n2\nlarge ribs\n), cut cross-wise on a slight bias into 1/8-inch thick strips\n4\nounces\n(\n115\ng\n)\nEnglish cucumber\n(about\n½\nof an\nEnglish cucumber\n), cut into matchsticks\n½\nounce\n(\n15\ng\n) fresh\ncilantro sprigs\n, trimmed and cut into 2-inch lengths\nDirections\nFor the Sauce:\nIn a small saucepan, heat oil, garlic, ginger, star anise, and cloves over medium heat until garlic begins to sizzle. Continue to cook, swirling pot occasionally, until garlic begins to brown, about 4 minutes. Strain oil into a medium heat-proof bowl; discard solids. Let cool for 2 minutes. Whisk in sesame oil, water, sugar, rice vinegar, salt, soy sauce, and white pepper until smooth, about 30 seconds. Whisk in sesame seeds and set aside.\nVicky Wasik\nFor the Noodles:\nFill a large bowl with cold water. In a large pot, bring 4 quarts (4L) water along with a healthy pinch of salt to boil over high heat. Meanwhile, in the bowl of a food processor, pulse together pastry flour, potato starch, and 1 teaspoon (3g) kosher salt (if using table salt, use half as much by volume or same weight) until well combined. With processor running, add all the boiling water at once and process until dough forms and runs around processor blade, 30 seconds to 1 minute.\nVicky Wasik\nTransfer dough to a clean work surface. Knead dough until smooth and cohesive (dough should not stick to hands or resist kneading), about 30 seconds. Divide dough evenly into two portions and cover one portion loosely with plastic wrap. Lightly grease work surface with vegetable oil, making sure surface is well coated.\nVicky Wasik\nSet one portion of dough onto oiled work surface and press to flatten. Flip and press again to coat both sides in oil. Using a rolling pin, gently roll dough to a roughly 13-inch square, measuring 1/32- to 1/16-inch thick. Using a bench knife or pizza cutter, cut dough into 3/8-inch-thick strips.\nVicky Wasik\nCarefully peel strips off counter and add to pot of boiling water. Cook, stirring occasionally, until noodles are opaque and chewy, about 8 to 10 minutes. Using a spider or fine-mesh strainer, transfer noodles to prepared bowl of cold water. Rinse noodles under cold running water until noodles are cool and water runs clear, about 60 seconds (you can expedite this step by draining the noodles once or twice while rinsing). Let noodles sit in water until ready to serve. Repeat with remaining dough.\nVicky Wasik\nTo Serve:\nDrain noodles well and transfer to a large bowl. Add cucumbers, celery, and sauce, and toss gently until combined and noodles are well dressed. Divide between bowls, sprinkle with cilantro, and serve.\nVicky Wasik\nNotes\nLow-protein flours such as pastry or cake flour work best for this recipe. If you substitute with all-purpose flour, the color will be slightly yellow and the dough will be less smooth.\nBe sure to use unmodified potato starch such as Bob’s Red Mill Premium Quality Unmodified Potato Starch. Using modified potato starch may produce slightly different results in texture and appearance.\nMake Ahead and Storage\nThe noodles are best made right before serving.\nNoodles\nStovetop\nEast Asian\nVegan Mains\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cold-sesame-noodles.webp?"
}