{
  "url": "https://www.seriouseats.com/com-tam-vietnamese-broken-rice-recipe-7197808",
  "image_url": "https://www.seriouseats.com/thmb/6V--I8vYbYlaMxGYmy0DJ33aoqA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230309-SEA-VietnameseBrokenRice-VyTran-hero-0a90ab8378d9453b98b77441bb61914a.JPG",
  "tags": [
    "Vietnamese",
    "The Latest",
    "White Rice",
    "Southeast Asian",
    "Rice & Grains"
  ],
  "title": "Cơm Tấm (Vietnamese Broken Rice)",
  "full_text": "Cơm Tấm (Vietnamese Broken Rice)\nClose\nJump to recipe\nPrep\n65 mins\nCook\n115 mins\nMarinating and Cooling Time\n9 hrs 15 mins\nTotal\n12 hrs 15 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Grilled Pork:\n1/4\ncup\n(\n60\nml\n) warm\nwater\n1/4\ncup\n(\n60\nml\n)\nfish sauce\n1/4\ncup\n(\n50\ng\n)\nsugar\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1/4\ncup\n(\n30\ng\n)\nchopped shallot\n(about\n1\nlarge\nshallot)\n1/4\ncup\n(\n30\ng\n) sliced\nscallions\n(white and green parts)\n2\ntablespoons\n(\n24\ng\n)\nchopped garlic\n(about\n5\nmedium\ncloves)\n1/2\nteaspoon\nfreshly\nground black pepper\n1 1/2\npounds\n(about\n680\ng\n)\nskin-on, boneless pork butt\n, thinly sliced 1/8-inch thick (see note)\n8-inch\nwooden skewers\n, soaked for 30 minutes before threading to prevent burning\nFor the Pork-and-Egg Meatloaf:\n1\nounce\n(\n30\ng\n)\ncellophane noodles\n, preferably made from mung beans\n1/2\nounce\n(\n16\ng\n)\nwood ear mushrooms\n3\nlarge\neggs\n, separated\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1/2\ntablespoon\n(\n12\ng\n)\nsugar\n1/4\nteaspoon\nfreshly\nground black pepper\n12\nounces\n(\n344\ng\n)\nground pork\n1/4\ncup\n(\n30\ng\n) finely\nchopped shallot\n(about\n2\nshallots\n)\n2\ntablespoons\n(\n15\ng\n)\nsliced scallions\n(green parts only)\nFor the Shredded Pork:\n12\nounces\n(\n340\ng\n)\nboneless, skinless pork butt\n, halved\n3 1/2\nounces\n(\n99\ng\n) packaged fresh or\nfrozen shredded pork skin\n, such as Bì Heo Tươi Tây Hồ brand, completely thawed, (see note)\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n, divided\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n2\ntablespoons\n(\n25\ng\n)\nminced garlic\n(about\n3\ncloves\n)\n1\ntablespoon\n(\n9\ng\n) store-bought (such as Thính Saigon brand) or\nhomemade\nroasted rice powder\n(if homemade, follow the linked recipe but using jasmine rice in place of glutinous rice; see note)\nFor the Broken Rice:\n3\ncups\n(\n600\ng\n)\nbroken jasmine rice\n, such as Three Ladies or Parrot brand\n3\ncups\n(\n720\nml\n)\nwater\nFor the Drizzling Sauce:\n1/2\ncup\n(\n90\nml\n) warm\nwater\n1/4\ncup\n(\n50\ng\n)\nsugar\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n, plus more to taste\n1\ntablespoon\n(\n15\nml\n) fresh\nlime juice\n1\ntablespoon\n(\n12\ng\n)\nchopped garlic\n(about\n1 1/2\ncloves\n)\n1\nbird’s eye chile\n, thinly sliced (optional)\nFor the Scallion Oil:\n1 1/2\ncups\n(\n180\ng\n)\nscallions\n(green parts only)\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n1/4\nteaspoon\nsugar\nTo Assemble and Serve:\n2\nLebanese cucumbers\n, sliced\n2\ntomatoes\n, sliced\n1\nhead\nbutter lettuce\n, washed and leaves separated\nPickled carrot and daikon\n, for serving\nPickled leeks\n, for serving (see note)\nDirections\nFor the Grilled Pork:\nIn a large mixing bowl, combine water, fish sauce, sugar, and vegetable oil and whisk until sugar has dissolved. Add shallot, scallion, garlic, and pepper to the bowl. Add pork to the marinade and mix well to coat. Cover and refrigerate at least 8 hours and up to 1 day.\nSerious Eats / Vy Tran\nWhen ready to grill, thread marinated pork on soaked skewers. Light\n1 chimney full of charcoal\n. When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to high. Cover and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nSerious Eats / Vy Tran\nSet skewers over coals or burners and cook until lightly browned on both sides, about 2 minutes. Move meat to cooler side of grill and cook, turning frequently and basting meat with the marinade, until cooked through and no pink remains, 12 to 15 minutes; stop basting about 5 minutes before the end of cooking time to avoid contamination with raw meat juices. Set aside and keep warm.\nSerious Eats / Vy Tran\nMeanwhile, for the Pork-and-Egg Meatloaf:\nIn a small bowl, soak cellophane noodles in 2 cups warm water for 15 minutes. Drain softened noodles, blot dry with paper towels to remove any excess water, then use kitchen shears to cut them into 1-inch strands. Set aside.\nSerious Eats / Vy Tran\nMeanwhile, in another small bowl, soak wood ear mushrooms in 1 cup warm water for 15 minutes. Drain and rinse them thoroughly; squeeze out any excess moisture, then blot dry on paper towels. Discard any tough stems. Chop into roughly 1/4-inch pieces, and set aside.\nSerious Eats / Vy Tran\nIn a large bowl, beat egg whites until bubbly but still liquidy, about 1 minute. Whisk in fish sauce, sugar, and pepper. Mix in ground pork, cellophane noodles, wood ear mushrooms, shallots, and scallions until thoroughly combined.\nSerious Eats / Vy Tran\nLine a 4- by 7-inch loaf pan or round ceramic baking dish with parchment paper (choose whichever vessel will best fit inside a steamer setup). Spoon in pork mixture, pressing down to pack tightly. Place a steamer over a saucepan of vigorously boiling water. Transfer meatloaf mixture to steamer, cover, and steam at medium-high heat until meatloaf is puffed and a skewer inserted in the center comes out clean, 25 minutes.\nSerious Eats / Vy Tran\nBeat egg yolks lightly in a bowl. Open lid of steamer and pour egg yolks on top of meatloaf. Cover and steam until yolk is set, 5 to 10 minutes longer. Remove meatloaf from heat and set aside. Let cool for at least 1 hour (cutting into the meatloaf while still hot may make it fall apart). When ready to serve, unmold meat loaf and cut into 1/2-inch-thick slices.\nSerious Eats / Vy Tran\nFor the Shredded Pork:\nIn a medium bowl, soak shredded pork in just enough warm water to cover for 15 minutes. Rinse and drain thoroughly. Squeeze out as much water as possible. Spread pork skin out on a tray lined with paper towels to absorb excess moisture.\nSerious Eats / Vy Tran\nIn a medium saucepan, bring 3 cups (710ml) water to a boil over medium-high heat. Add 1 teaspoon salt and stir to dissolve. Add pork butt and cook until meat thermometer registers 145°F (63°C) in the center of the thickest part, about 20 minutes. Remove from pan and plunge into a bowl of ice water to cool. Drain and pat dry with paper towels.\nSerious Eats / Vy Tran\nIn a 10-inch stainless-steel skillet, heat oil over medium-high heat until shimmering. Sear pork butt on all sides until a nice brown crust forms, about 5 minutes. Remove from heat. When cool enough to handle, slice pork into matchsticks. In a large bowl, combine pork matchsticks, pork skin, garlic, roasted rice powder, and remaining 1 teaspoon salt and mix well. Set aside.\nSerious Eats / Vy Tran\nFor the Broken Rice:\nRinse broken rice with cold water until no longer cloudy, then drain. In a rice cooker, combine 3 cups of water with rinsed broken rice and cook according to the manufacturer's instructions.  Alternatively, to cook on the stovetop, in a large 4- or 5-quart pot, combine water and rinsed rice and bring to a boil over medium-high heat. Cover, reduce heat to low, and cook for 10 minutes. Remove from heat and let rice rest, covered, for 10 minutes, then uncover pot and fluff rice to allow excess moisture to escape. Keep warm.\nSerious Eats / Vy Tran\nFor the Drizzling Sauce:\nIn a medium bowl, combine water, sugar, fish sauce, and lime juice and mix until sugar has dissolved. Stir in garlic and chile. Set aside.\nSerious Eats / Vy Tran\nFor the Scallion Oil\n: In a medium microwave-safe bowl, combine scallion, oil, salt, and sugar. Cover with plastic wrap and microwave for 60 seconds. Remove wrap and mix well.\nSerious Eats / Vy Tran\nTo Assemble and Serve:\nRemove grilled pork from skewers. Divide rice onto serving plates. Arrange warm grilled pork (on or off skewer, as desired), slightly warm sliced pork-and-egg meatloaf, and shredded pork around rice. Drizzle scallion oil over rice and meat. Add lettuce, tomatoes, and cucumber next to meat. Serve with drizzling sauce, pickled vegetables, and pickled leeks on the side.\nSerious Eats / Vy Tran\nSpecial Equipment\nRice cooker\n,\nsteamer,\n4- by 7-inch loaf pan\nor\nround ceramic baking dish\n,\n8-inch wooden skewers\nNotes\nIf you have trouble finding a butcher to slice the pork butt thinly for you, try the butcher at a Vietnamese or Chinese market, as this is not an uncommon request for them. To slice your own, freeze the pork butt until partially frozen, then slice thinly with a very sharp knife.\nYou can make your own roasted rice powder using this Thai\nrecipe\n, but note that Vietnamese use uncooked jasmine rice instead of the glutinous rice called for in the Thai version. For store-bought roasted rice powder, look for brand Thính Saigon in market's seasoning section.\nPre-packaged pork skin can be found in the refrigerated or frozen section at Asian supermarkets. If you cannot find pre-packaged pork skin, you can make your own using this\nrecipe\n.\nPickled leeks taste similar to pickled ramps and can be found at Asian supermarkets in glass jars in the canned food section.\nMake-Ahead and Storage\nSince this recipe has multiple components, marinate the pork, prepare the drizzling sauce, and cook the pork-egg meatloaf the day before. On the day of, make the shredded pork, scallion oil, cook the rice, and grill the marinated pork.\nThe drizzling sauce can be made 2 days ahead and diluted with water if it thickens in the fridge.\nThe pork-egg meatloaf can be made 2 days ahead and rewarmed in the microwave or re-steamed.\nVietnamese\nThe Latest\nWhite Rice\nSoutheast Asian\nRice & Grains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cm-tm-vietnamese-broken-rice.webp?"
}