{
  "url": "https://www.seriouseats.com/competition-style-barbecue-chicken-thighs",
  "image_url": "https://www.seriouseats.com/thmb/LY4dAMJnR4mbUdVqIIecgA05ciY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120424-203333-comp-thighs-00374f9b87e84fcfaaff939ad37e15cb.jpg",
  "tags": [
    "Chicken Mains",
    "Grilled Chicken",
    "Chicken Thighs",
    "Memorial Day"
  ],
  "title": "Competition-Style Barbecue Chicken Thighs Recipe",
  "full_text": "Competition-Style Barbecue Chicken Thighs Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs 35 mins\nActive\n2 hrs 30 mins\nChilling and Resting Time\n4 hrs 30 mins\nTotal\n7 hrs 20 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Rub:\n1/2\ncup\nkosher salt\n6\ntablespoons\nturbinado sugar\n3\ntablespoons\nfreshly ground white pepper\n4\nteaspoons\nlemon pepper\n4\nteaspoons\ngarlic powder\n2\nteaspoons\nonion powder\n2\nteaspoons\npowdered citric acid\n(optional, see note)\n1\nteaspoon\ndry mustard\nFor Chicken:\n12\nmeaty chicken\nthighs\n, about\n5\npound\n1 1/2\ncups\nlow-sodium chicken broth\n12\ntablespoons\nmargarine\n, cut into 1 tablespoon pieces\n2\ncups\ncompetition-style barbecue sauce\n, such as Blues Hog or Meat Mitch\n1\ncup\nwhite grape juice\n3/4\ncup\nagave nectar\n2\nsmall chunks\napple wood\nDirections\nTo make the rub, combine salt, sugar, white pepper, lemon pepper, garlic powder, onion powder, powdered citric acid, and dry mustard in a small bow. Set aside.\nCarefully remove skin from chicken thighs by running finger between skin and meat and gently pulling to separate. Lay thighs side-by-side and and trim each one into uniform, trapezoid shapes, removing excess fat. Turn thighs over and cut away muscle along the back of the thigh bone.\nUsing a paring knife, carefully scrape excess fat from chicken skins. Trim skins so they’re slightly smaller than the thighs (the skin should wrap around the thigh, fully covering the front and about half of the back). Reattach skins by threading toothpicks on both sides of bottom of the thigh, securing meat and skin together. Refrigerate for 4 hours to overnight.\nUsing a marinade injector, inject 1/2 ounce of chicken stock into left and right side of thigh meat. Pat dry with paper towels. Sprinkle back of each thigh with 1/2 tablespoon of White BBQ Rub and let sit at room temperature for 20 minutes.\nFire up\nsmoker\nor\ngrill\nto 250°F, adding chunks of smoking wood chunks when at temperature. Place 6 tablespoons of margarine in each pan. Rest one chicken thigh on top of each piece of margarine, skin-side up. Sprinkle tops of thighs with 1/2 tablespoon of White BBQ Rub. Place in smoker and smoke for 1 hour.\nCover each pan with aluminum foil and continue to cook for 1 hour more.\nIn a medium saucepan, combine barbecue sauce and grape juice. Heat sauce over medium heat until warmed through.\nRemove thighs from smoker and remove toothpicks. Using tongs or gloved hands, submerge each thigh into warm sauce. Shake off excess sauce and place thighs back in smoker, directly on grill grate. Cook until sauce is caramelized, 20 to 30 minutes more.\nSpread out a large sheet of aluminum foil. Squirt 12 swirls of agave nectar onto foil and sprinkle a pinch of White BBQ Rub on each swirl.\nRemove thighs from smoker and place each, skin-side down, on an agave swirl. Let rest for 10 minutes, then serve\nSpecial equipment\nSmoker or grill, marinade injector, 2 disposable aluminum pans\nThis Recipe Appears In\nBarbecue: Competition-Style Chicken Thighs\nChicken Mains\nGrilled Chicken\nChicken Thighs\nMemorial Day"
}