{
  "url": "https://www.seriouseats.com/conchas-recipe-6746940",
  "image_url": "https://www.seriouseats.com/thmb/UN8jjZnsDpTE9qeatI2nmNxKFdE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221005-Conchas-LorenaMasso-37-f7c85813afa743339b71404a683dce90.JPG",
  "tags": [
    "Lard",
    "Mexican",
    "The Latest"
  ],
  "title": "Conchas",
  "full_text": "Conchas\nClose\nJump to recipe\nPrep\n75 mins\nCook\n25 mins\nChilling Time\n8 hrs\nTotal\n9 hrs 40 mins\nServes\n16 servings\nMakes\n16 4-inch conchas\nCook Mode\n(Keep screen awake)\nIngredients\nFor the concha crust:\n8\nounces\nprocessed lard\n(\n1\ncup\n;\n227\ng\n), such as Armour (see note)\n4\nounces\npowdered sugar\n(\n1\ncup\n;\n114\ng\n), sifted\n9\nounces\nall-purpose flour\n(\n2\ncups\n;\n256\ng\n), such as Gold Medal\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\n1\ntablespoon\n(\n8\ng\n)\nnatural cocoa powder\n, sifted\nFor the concha dough:\n2\ntablespoons\n(\n18\ng\n)\ninstant yeast\n, such as SAF\n21\nounces\nbread flour\n(about\n4 1/2\ncups\n;\n600\ng\n)\n2\ntablespoons\n(\n12\ng\n)\nnonfat powdered milk\n4 1/2\nounces\nsugar\n(heaping\n1/2\ncup\n;\n125\ng\n)\n1\ntablespoon\nplus\n1\nteaspoon\n(\n12\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much volume or the same weight\n6\nlarge\neggs\n(\n300\ng\n), brought to about 65°F (18°C)\n3\nounces\n(\n85\ng\n)\nwater\n, about 80°F (26°C)\n5 1/2\nounces\nunsalted butter\n(\n3/4\ncup\n;\n160\ng\n), cut into 1-inch cubes, and softened to about 65°F (18°C)\n3\nounces\nprocessed lard\n(\n6\ntablespoons\n;\n80\ng\n), such as Armour (see note)\nDirections\nTo make the concha crust\n: In the bowl of a stand mixer fitted with the paddle attachment, beat lard on medium speed until smooth and creamy, about 30 seconds. Using a flexible spatula, scrape down bowl and paddle attachment. Add powdered sugar and all-purpose flour and beat on a medium-low speed until no dry flour remains and a smooth paste forms, about 4 minutes. Scrape down bowl and paddle, add vanilla, and beat on medium-low speed until vanilla is fully incorporated, about 30 seconds.\nSerious Eats / Lorena Masso\nRemove half of the paste (about 300g) from the bowl and, using your hands, shape into a roughly 6-inch rectangle. Wrap in plastic wrap and refrigerate until cold, about 1 hour.\nSerious Eats / Lorena Masso\nMeanwhile, add cocoa powder to the remaining half of the paste in the bowl, then beat on medium-low speed until powder is fully incorporated, about 30 seconds. Remove paste from the bowl and, using your hands, shape into a roughly 6-inch rectangle. Wrap in plastic wrap and refrigerate until cold, about 1 hour.\nSerious Eats / Lorena Masso\nDivide vanilla-flavored paste into 8 equal portions (about 30g each), forming each into a smooth ball, and transfer to a parchment-lined rimmed baking sheet. Repeat with chocolate-flavored paste. Cover tightly with plastic wrap and refrigerate for at least 1 hour and up to 3 days.\nTo make the concha dough\n: In a large bowl, whisk together yeast, bread flour, powdered milk, sugar, and salt until thoroughly combined, about 30 seconds. Set aside.\nSerious Eats / Lorena Masso\nIn the bowl of a stand mixer fitted with the dough hook attachment, add eggs and water and mix on low speed until combined, about 1 minute. Add flour mixture, increase speed to medium-low, and mix until flour is completely absorbed and a rough dough forms, about 2 minutes. Increase speed to medium and mix until a cohesive dough forms (it will remain attached to bottom of bowl and be sticky), about 5 minutes.\nSerious Eats / Lorena Masso\nReduce speed to medium-low. With the mixer running, alternate adding butter and lard a few cubes or tablespoons at a time, pausing to scrape down bowl and hook as needed, until thoroughly incorporated, about 10 minutes. Increase speed to medium and mix until dough has become smooth and shiny and pulls away from the sides to form around the dough hook (the dough should not be sticky), 8 to 10 minutes. To test the dough, tear off a small piece and stretch gently in all directions; when the dough is ready, it can be pulled into a thin, translucent sheet.\nSerious Eats / Lorena Masso\nUsing a bowl scraper, transfer dough to a lightly-oiled large bowl, cover tightly with plastic wrap, and let rest at room temperature for 15 minutes. With two clean wet hands, slide hands under left and right side of dough and gently pick it up from the middle, letting the ends fold under itself. Cover with plastic and let dough rest for another 15 minutes. Rotate bowl 90 degrees and repeat folding process. Cover tightly with plastic wrap and refrigerate overnight or up to 12 hours.\nSerious Eats / Lorena Masso\nLine three rimmed baking sheets with parchment paper. Turn dough onto a clean, floured surface, but do not deflate. Divide into 16 equal portions (80g each). Working with one portion at a time, pull edges of the dough towards the center, pinching ends together, to create a tight ball. Place the seam side down on the counter, then cup dough beneath your palm and work it in quick circular motions to form a smooth ball. Transfer to a prepared baking sheet. Repeat with remaining portions of dough, for a total of 5 to 6 balls per baking sheet. Cover dough balls loosely with plastic wrap to prevent the dough from drying out while preparing the crust.\nSerious Eats / Lorena Masso\nTo prepare the concha crust by hand:\nFold a 12- by 16-inch sheet of parchment paper in half crosswise, open the folded paper like a book, and grease the inside with cooking spray. Remove one portion of the concha crust from the refrigerator, place portion in the center of one half of the prepared parchment paper and cover with the other half. Using a rolling pin, roll out into a 4-inch circle about 1/8-inch thick. Carefully peel away top half of parchment paper and transfer crust to the palm of your hand, peeling away the rest of the paper. Top a dough ball with the crust, tucking sides underneath, then press down slightly to flatten the crust and ensure it adheres to the dough. Repeat with remaining concha crust and dough, re-greasing parchment paper after each use.\nSerious Eats / Lorena Masso\nTo prepare the concha crust in a tortilla press:\nCut the sides of a 6 1/2- by 5 7/8-inch plastic sandwich bag so that it opens like a book, place the open bag in the tortilla press, and grease the inside with cooking spray. Remove one portion of the concha crust from the refrigerator, place portion in the center of one half of the prepared bag, cover with the other half, and press into a 4-inch circle about 1/8-inch thick. Carefully peel away top half of bag and transfer crust to the palm of your hand, peeling away the rest of the bag. Top a dough ball with the crust, tucking sides underneath, then press down slightly to flatten the crust and ensure it adheres to the dough. Repeat with remaining concha crust and dough, re-greasing the plastic bag after each use.\nWorking with one concha at a time, hold a butter knife at a 30-degree angle and position the knife at one end, close to the middle, then make a curved line across the top to the other end (be sure to score only the crust and not the dough underneath). Repeat scoring above and below the first curved line, for a total of 6 to 7 lines per concha (the lines should resemble a seashell in appearance; see note). Repeat with remaining conchas.\nSerious Eats / Lorena Masso\nCover loosely with plastic wrap, and allow to rise at warm room temperature (75°F/24°C) until almost doubled in size, about 2 hours. (The scoring will open up and the dough will have a light wiggle.)\nSerious Eats / Lorena Masso\nThirty minutes before baking, adjust oven racks so that one is in upper-middle position, the other is in lower-middle position, and preheat oven to 350°F (177°C). Bake two trays of conchas, switching racks and rotating trays front to back after 10 minutes, until puffed and golden brown, about 20 minutes total. As soon as two trays are fully baked, remove from oven and set third tray in oven to bake.\nSerious Eats / Lorena Masso\nTransfer conchas to a wire rack and cool for 5 minutes. Serve warm or let cool completely before serving.\nSerious Eats / Lorena Masso\nSpecial Equipment\nStand mixer, rimmed baking sheets, wire rack, rolling pin or tortilla press\nNotes\nProcessed lard is hydrogenated to make the fat shelf-stable and does not impart a pork flavor. If preferred, the lard in the concha crust can be replaced with an equal amount of unsalted butter by weight.\nIf desired, you can purchase a plastic or stainless steel concha cutter to achieve the seashell pattern on the crust online. For this recipe, you’ll need one that’s 3.25 inches in diameter.\nMake-Ahead and Storage\nConchas can be stored in an airtight container at room temperature for up to 3 days. To freeze conchas, wrap individual conchas tightly in two layers of plastic wrap, transfer to a zipper-lock bag, and freeze for up to 1 month. To defrost, leave out individually wrapped conchas at room temperature until softened, 1 to 2 hours.\nLard\nMexican\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/conchas.webp?"
}