{
  "url": "https://www.seriouseats.com/concord-grape-cake-fall-desserts-recipe",
  "image_url": "https://www.seriouseats.com/thmb/1r1NG4xL7BRrpgFcGmqO-Q0OGtI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__10__20111031-127677-LTE-Grape-Cake-PRIMARY-6c63df4ccfeb4eeb8e5e3581c3a73281.jpg",
  "tags": [
    "Cakes",
    "Baking",
    "Grape"
  ],
  "title": "Concord Grape Cake Recipe",
  "full_text": "Concord Grape Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n65 mins\nActive\n75 mins\nCooling Time\n100 mins\nTotal\n3 hrs\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n3\ntablespoons\nunsalted butter\n, melted\n2\nlarge\neggs\n, at room temperature\n1/2\ncup packed\nlight brown sugar\n1/2\nteaspoon\nsalt\n1/3\ncup\nsweet white wine\n, at room temperature\n1/3\ncup\nmilk\n, at room temperature\n3/4\ncup\nvegetable oil\nFinely grated\nzest\nof\n1\nwhole\nlemon\n1 1/2\ncups\nall-purpose flour\n1\ntablespoon\nbaking powder\n12\nounces\nConcord grapes\n, split in half, seeds removed\nFor the Concord Grape Jam:\n1\npound\nConcord grapes\n1\ncup\nsugar\n1\ntablespoon\nlemon juice\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 375°F. Grease 9-inch round cake pan with 1 tablespoon butter. Line bottom of pan with parchment paper and coat and grease once again with whatever butter is left on the pastry brush.\nBeat eggs and brown sugar on medium-high speed until pale yellow and foamy, about 2 minutes. Add salt, wine, milk, oil, and lemon zest and beat until combined, about 1 minute.\nCombine flour and baking powder in small bowl. Lower mixer speed to low and add flour mixture. Beat just until combined, scraping sides and bottom of bowl with rubber spatula as necessary. Fold in grapes.\nScrape batter into prepared pan and bake until cake tester inserted in middle of cake comes out clean, rotating pan halfway through baking, 25 to 30 minutes.\nCool cake in pan about 10 minutes, then turn over onto large plate. Immediately invert onto cooling rack set over parchment-lined baking sheet (to catch any drips).\nFor the Concord Grape Jam:\nWhile cake is cooling, place a small plate in the freezer.\nRemove the grape skins by pinching the grapes and place them in a food processor. Pulse with 1/4 cup sugar until completely pureed.\nCombine pureed skins, peeled grapes, lemon juice, and remaining 3/4 cup sugar in medium heavy-bottomed saucepan. Bring mixture to boil over medium-high heat, then reduce to medium-low and simmer, stirring frequently, until thickened and reduced to 1 cup, 25 to 30 minutes.\nStrain hot jam into a glass measuring cup; discard seeds (strained jam will measure about 3/4 cup). To test for doneness, drop a tablespoon of jam on the chilled plate and allow to stand for 1 minute. Tilt the plate: if the jam runs, return it to the saucepan and simmer 3 to 5 minutes and test again. Jam is done when it stays in a mound.\nSpread warm jam over warm cake and let cool completely, about 1 hour. Serve.\nSpecial Equipment\nElectric mixer, one 9-inch round cake pan, parchment paper, pastry brush, rubber spatula, cooling rack, food processor, medium heavy-bottomed saucepan, strainer\nCakes\nBaking\nGrape",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/concord-grape-cake-recipe.webp?"
}