{
  "url": "https://www.seriouseats.com/congee-rice-porridge-minced-pork-crispy-shallots-recipe",
  "image_url": "https://www.seriouseats.com/thmb/4XKoRFIYKjjGMFY1DyKW53ptyDQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/congee-rice-porridge-minced-pork-crispy-shallots-photo-06-FredHardy-01202023-05-bb90e0ce4a29400d93924a7e2525aa99.JPG",
  "tags": [
    "Rice & Grain Mains",
    "Chinese",
    "Stovetop",
    "Pork",
    "Rice & Grains"
  ],
  "title": "Congee (Rice Porridge) With Minced Pork and Crispy Shallots",
  "full_text": "Congee (Rice Porridge) With Minced Pork and Crispy Shallots\nClose\nJump to recipe\nPrep\n0 mins\nCook\n80 mins\nActive\n20 mins\nTotal\n80 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nrice\n6\ncups\nhomemade or store-bought\nlow-sodium chicken stock\n1\n(1-inch) piece\nginger\n, sliced thick\n1 to 2\ncups\nwater\nKosher salt\n4\nshallots\n, sliced into thin rings\n6\ntablespoons\nvegetable oil\n8\nounces\nground pork\n1\nbunch\ngreen onions\n, sliced for garnish\nWhite pepper\nto taste\nDirections\nIn a heavy bottomed saucepan over medium heat, bring rice, chicken broth, ginger, and 1 teaspoon salt to simmer. Reduce heat to low and gently simmer, stirring and gently mashing occasionally, until rice is softened, broken down, and mixture is creamy and the consistency of porridge, 60 to 75 minutes. Add water to adjust consistency as it cooks. (See notes.)\nSerious Eats / Fred Hardy\nWhile rice is cooking, prepare shallots and pork. In a skillet, heat oil with shallots over medium heat. Cook, stirring, until shallots are golden and crispy, about 5 minutes, adjusting heat so the shallots don't burn. Pour shallots and oil into a bowl.\nSerious Eats / Fred Hardy\nIn the same unwashed skillet, cook pork with 1/4 teaspoon salt over medium heat until cooked through and browned, breaking up the pork into small pieces as it cooks, about 4 minutes.\nSerious Eats / Fred Hardy\nWhen porridge is ready, stir in pork and season to taste with salt. Ladle into bowls and top with shallots (and shallot oil to taste) and green onions. Sprinkle with white pepper to taste.\nSerious Eats / Fred Hardy\nNotes\nYou can also start with cooked rice, adding chicken broth and adjusting the amount of liquid to achieve the desired consistency. Make sure to stir while rice is cooking so it doesn't burn on bottom of pot. When the rice has swelled, I mash it a bit to help it break down.\nRead More\nGround Pork and Corn Congee (Chinese Rice Porridge)\nBrown Rice Congee With Beef, Shiitake, and Garlic Chips\nMulti-Grain Congee (Chinese Rice Porridge)\nDak Juk (Korean Chicken and Rice Porridge)\nBengali Rice Porridge With Lentils and Chicken\nRice & Grain Mains\nChinese\nStovetop\nPork\nRice & Grains"
}