{
  "url": "https://www.seriouseats.com/connecticut-style-warm-buttered-lobster-rolls",
  "image_url": "https://www.seriouseats.com/thmb/3CMdfGcOGtOo3ipC2cQsmEx6rTA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220915-Connecticutlobsterroll-AmandaSuarez-10-d2cd6c5a45e44f22b4195cea63f47c72.JPG",
  "tags": [
    "Lobster",
    "New England",
    "Poached Seafood",
    "Seafood Mains",
    "Sandwiches"
  ],
  "title": "Connecticut-Style Warm Buttered Lobster Rolls",
  "full_text": "Connecticut-Style Warm Buttered Lobster Rolls\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n30 mins\nCooling Time\n5 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlobsters\n, about\n1 1/2 pounds\neach (see notes)\n1\nstick\n(\n8\ntablespoons\n)\nbutter\n8\ntop-split hot dog buns\n, preferably Pepperidge Farm brand\n1/4\ncup\nfinely sliced\nscallion greens\nor chives\nKosher salt\nand freshly ground black pepper\nDirections\nKill each lobster by pressing the tip of a heavy chef's knife in the crack just behind the eyes in the center of the carapace (see notes). Press down firmly, then split head in half. Using kitchen towels, twist off tail and claws (including knuckles) from carapace. Save carapace for another use. If desired, press each tail flat against the cutting board and insert wooden skewers along their entire length to keep them straight (this helps prevent it from curling when it cooks for easier cutting later, but isn't required).\nSerious Eats / Amanda Suarez\nPlace a steamer insert in the bottom of a large lidded stock pot and add 1-inch of water. Bring to a boil over high heat. Add a single layer of lobster claws and tails (about half the lobster) and cover pot. Let steam for exactly 2 minutes. Transfer lobsters to sink and set under running cold water. Return liquid to a boil and repeat with remaining lobster tails and claws.\nSerious Eats / Amanda Suarez\nAs soon as lobster is cool enough to handle, remove meat from shell using kitchen shears, lobster crackers, and/or the back of a heavy cleaver to help crack the shells (It's OK if the meat gets a little mangled). Roughly chop into bite-size pieces and set on double layer of paper towels to drain.\nSerious Eats / Amanda Suarez\nMelt 1 tablespoon of butter in a heavy bottomed 12-inch skillet over medium-low heat. Swirl to coat pan. Add 4 buns with one cut side down. Cook, pressing on buns gently and moving them around the pan until golden brown on first side. Remove from pan, add another tablespoon of butter, and toast second side. Repeat with second batch of buns.\nSerious Eats / Amanda Suarez\nMelt remaining butter in skillet over medium heat. As soon as butter is melted, add lobster meat. Cook, tossing constantly and using a spoon to gently fold meat and butter over itself in the skillet until lobster is mostly opaque (butter should not sizzle), about 3 minutes. Add scallion greens and continue to cook until lobster is cooked through, about 1 minute longer. Season to taste with salt and pepper.\nSerious Eats / Amanda Suarez\nDivide lobster filling evenly between rolls. Spoon excess juices over each roll. Serve immediately.\nSerious Eats / Amanda Suarez\nNotes\nI prefer using smaller 1- to 1 1/2-pound lobsters rather than larger ones. Lobster carapaces can be discarded or frozen and saved to make stock.\nIf you don't have the stomach to knife your lobsters to death, you can boil them whole in step 2.\nLobster\nNew England\nPoached Seafood\nSeafood Mains\nSandwiches",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/connecticut-style-warm-buttered-lobster-rolls.webp?"
}