{
  "url": "https://www.seriouseats.com/construction-gingerbread-recipe",
  "image_url": null,
  "tags": [
    "Christmas Desserts",
    "Christmas Cookies"
  ],
  "title": "Construction Gingerbread Recipe",
  "full_text": "Construction Gingerbread Recipe\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n15 mins\nCooling Time\n35 mins\nTotal\n90 mins\nServes\n6\nto 8 servings\nMakes\n1 sheet\nCook Mode\n(Keep screen awake)\nIngredients\n2\nounces\nbrown sugar\n(\n1/4\ncup\n;\n56\ng\n)\n2\nteaspoons\nground cinnamon\n1 1/4\nteaspoons\nground ginger\n1/4\nteaspoon\nground cloves\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much\n4\nounces\nlight corn syrup\n(\n1/3\ncup\nplus\n1\ntablespoon\n;\n115\ng\n) (see note)\n1 1/2\nounces\nunsalted butter\n(\n3\ntablespoons\n;\n45\ng\n), very soft (about 72°F)\n1/4\nounce\nvanilla extract\n(\n1 1/2\nteaspoons\n;\n7\ng\n)\n6 1/4\nounces\nall-purpose flour\n(\n1 1/3\ncups\n;\n175\ng\n), plus more for dusting\nDirections\nFor the Dough:\nTrim a sheet of parchment paper to fit the interior of a half sheet pan. Adjust oven rack to lower-middle position and preheat to 350°F (175°C). Combine brown sugar, cinnamon, ginger, cloves, salt, corn syrup, butter, and vanilla in the bowl of a stand mixer fitted with a paddle attachment. Mix on low until smooth, then sprinkle in flour and continue mixing to form a stiff dough. Turn onto a lightly floured surface and knead until smooth. Proceed immediately, or wrap in plastic and set aside at room temperature until needed, up to 24 hours. (Larger batches should be divided into 14-ounce portions.)\nSprinkle prepared parchment with flour, place dough on top, and flatten into a rectangle. Sprinkle with more flour and roll to fit just within edges of parchment, leaving dough about 3/16 inch thick. Using both hands, transfer parchment to a half sheet pan. Cut according to your gingerbread house template, using an X-Acto or paring knife. Leave a narrow border of dough around cutouts to minimize spreading, but trim away larger areas of excess dough to gather and re-roll, or turn into paste (see directions below).\nBake gingerbread until dry to the touch and golden brown, about 25 minutes. Immediately cut along pre-scored lines with a sharp knife or pizza wheel. Cool completely in pan, then transfer cutouts to a safe place. Scraps can be nibbled, or ground in a food processor to use in recipes that call for cookie crumbs.\nFor the Paste:\nReturn scraps to mixing bowl and resume mixing on low speed. Begin adding water, 1 teaspoon at a time, until scraps form a stiff but pipeable paste. Thoroughly scrape bowl and beater with a flexible spatula to eliminate lumps, then continue mixing until perfectly smooth. Transfer to a piping bag fitted with a small round tip. Pipe designs, such as fences and railing, onto a parchment-lined half sheet pan and bake until pale gold, about 12 minutes. Cool completely before handling. If you like, assemble with\nSturdy Royal Icing\n.\nSpecial Equipment\nYou'll need special equipment for making a gingerbread house, including a\nstand mixer\nwith paddle attachment,\nrolling pin\n,\nhalf-sheet pan\n, gingerbread house template, and a\npiping bag\nfitted with\nsmall round tip\n(optional, for piped gingerbread).\nNotes\nDue to the unique viscosity and pH of each, alternative sweeteners, such as golden syrup, molasses, sorghum, agave nectar, and even dark corn syrup, can create a sticky dough that's more inclined to puff in the oven.\nRead More\nBraveTart's House of Horror: How to Make a Super-Spooky Halloween Gingerbread House\nChristmas Desserts\nChristmas Cookies"
}