{
  "url": "https://www.seriouseats.com/copycat-chicken-nuggets-with-sweet-n-sour-sauce",
  "image_url": null,
  "tags": [
    "Mains By Ingredient",
    "American",
    "Chicken Thighs",
    "Chicken Mains",
    "Snacks & Appetizers"
  ],
  "title": "Homemade Chicken Nuggets With Sweet 'n' Sour Sauce Recipe",
  "full_text": "Homemade Chicken Nuggets With Sweet 'n' Sour Sauce Recipe\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n30 mins\nChilling and Resting Time\n100 mins\nTotal\n2 hrs 20 mins\nServes\n5 servings\nMakes\n30 nuggets\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Nuggets:\n1\npound\n(\n450\ng\n)\nboneless, skinless chicken thighs\n, cut into 1-inch pieces\n1\nteaspoon\n(\n5\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1\nteaspoon\n(\n3\ng\n)\nchicken-flavored broth powder\n, such as Orrington Farms\n1/2\nteaspoon\nfinely ground\nwhite pepper\n1/2\nteaspoon\ngarlic powder\n1/2\nteaspoon\nonion powder\nNeutral oil\nsuch as canola or nonstick cooking spray, for greasing\nFor the Sauce:\n1/2\ncup\n(\n160\ng\n)\napricot jam\nor preserves\n2\ntablespoons\n(\n40\ng\n)\ncorn syrup\n2\ntablespoons\n(\n30\nml\n)\nwater\n5\nteaspoons\n(\n25\nml\n)\ndistilled white vinegar\n1 1/2\nteaspoons\n(\n4\ng\n)\ncornstarch\n1\nteaspoon\n(\n3\ng\n)\nchicken-flavored broth powder\n, such as Orrington Farms\n1/2\nteaspoon\n(\n3\nml\n)\nsoy sauce\n1/2\nteaspoon\n(\n3\ng\n)\nyellow mustard\n1/8\nteaspoon\ncayenne pepper\n1/8\nteaspoon\ngarlic powder\n1/8\nteaspoon\nfinely ground\nwhite pepper\nTo Coat and Fry:\n1/2\ncup\n(\n2.5\nounces\n;\n70\ng\n)\nall-purpose flour\n2\ntablespoons\n(\n16\ng\n)\ncornstarch\n1\nteaspoon\n(\n3\ng\n)\nchicken-flavored broth powder\n, such as Orrington Farms\n1/2\nteaspoon\n(\n1.5\ng\n)\nbaking powder\n1/2\nteaspoon\nfinely ground\nwhite pepper\n3/4\ncup\n(\n180\nml\n)\nwater\n4\ncups\n(\n950\nml\n)\nvegetable oil\n, for frying\nDirections\nFor the Nuggets:\nIn a medium mixing bowl, using clean hands, mix chicken and salt until thoroughly combined. Cover and refrigerate for at least 45 minutes and up to 2 hours.\nLightly grease a baking sheet. Transfer chicken to bowl of food processor. Add broth powder, white pepper, garlic powder, and onion powder and process, scraping down sides with spatula as needed, until a smooth and uniform paste forms, about 1 minute. Using lightly wet hands, divide chicken into 1 tablespoon (15g) portions. Roll portions into balls and gently flatten between palms, forming 1/2-inch thick nugget shapes. Place formed nuggets on lightly greased baking sheet.\nMeanwhile, For the Sauce:\nIn a small saucepan, combine jam, corn syrup, 2 tablespoons (30ml) water, vinegar, cornstarch, broth powder, soy sauce, mustard, cayenne pepper, garlic powder, and white pepper. Using an immersion blender, blend until throughly combined and smooth. Set over medium-high heat and cook, stirring occasionally, until mixture boils and becomes clear, 2 to 3 minutes. Transfer sauce to a heatproof bowl and let cool at room temperature. Set aside.\nTo Coat and Fry:\nIn a large bowl, thoroughly whisk together flour, cornstarch, broth powder, baking powder, and white pepper, at least 30 seconds. Working 1 piece at a time, coat chicken nuggets in flour mixture, pressing gently to adhere, then shake off excess and return to baking sheet. Let dusted nuggets rest for 15 minutes; reserve flour mixture.\nSerious Eats / Tim Chin\nIn a Dutch oven, heat oil over medium-high heat until it registers 350°F (175°C) on an instant-read thermometer. Set a wire rack in a rimmed baking sheet. Add 3/4 cup (180ml) water to flour mixture and whisk until smooth. Add half of nuggets to batter and toss gently until submerged. Working in 2 batches, remove nuggets one at a time from batter, allowing any excess batter to drip back into bowl, and carefully add to hot oil. Cook nuggets, flipping every 30 seconds, until nuggets puff up and begin to brown, 4 to 5 minutes. Transfer nuggets to prepared wire rack. Return oil to 350°F and repeat with remaining nuggets. Let second batch of nuggets rest on wire rack for at least 5 minutes before moving to next step to let coating set.\nSerious Eats / Tim Chin\nBring oil to 375°F (190°C). Carefully return all nuggets to oil and cook, flipping occasionally, until deep golden brown and very crispy, about 4 minutes. Return nuggets to rack and let stand for 2 minutes. Serve with sauce.\nSpecial Equipment\nFood processor\n,\nimmersion blender\n,\nDutch oven\n,\ninstant-read thermometer\n,\nwire rack\nand\nrimmed baking sheet\nMake-Ahead and Storage\nThe nuggets can be frozen for up to 3 months after the first frying step. To do so, set them on the wire rack after the first frying as instructed in the recipe, then allow to cool to room temperature. Transfer to zipper-lock bags and seal, pressing out as much excess air as you can, then place in freezer. To cook, heat a pot of oil to 350°F (175°C) and, working in batches, add the nuggets directly from the freezer. Fry until heated through and deep golden brown outside, 4 to 6 minutes.\nMains By Ingredient\nAmerican\nChicken Thighs\nChicken Mains\nSnacks & Appetizers"
}