{
  "url": "https://www.seriouseats.com/coq-au-vin-chicken-red-wine-braise-recipe",
  "image_url": "https://www.seriouseats.com/thmb/xJkYkVBKZdlBLLi5-1rAfa31YTQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/coq-au-vin-chicken-red-wine-braise-recipe-hero-01_2-985a89509805473caaa3d71cfc98919a.JPG",
  "tags": [
    "Chicken Mains",
    "French",
    "Braised & Stewed Chicken",
    "Whole Chicken"
  ],
  "title": "Coq au Vin (Chicken Braised in Red Wine)",
  "full_text": "Coq au Vin (Chicken Braised in Red Wine)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs 40 mins\nActive\n90 mins\nTotal\n3 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole small\nchickens\n(about\n3 pounds\n;\n1.4 kg\neach, see notes), each chicken\ncut into 4 pieces, backbones reserved for stock\n2\ncups\n(\n475\nml\n)\ndry red wine\n8\nounces\n(\n225\ng\n)\npearl onions\n(see notes)\n1/4\npound\n(\n113\ng\n) slab\nbacon\nor\nsalt pork\n, cut into 1- by 1/4- by 1/4-inch sticks\nKosher salt\nand freshly\nground black pepper\n8\nounces\n(\n225\ng\n)\nbutton\nor\ncremini mushrooms\n, woody stems trimmed if necessary, quartered\n3\nmedium\ncarrots\n(\n10\nounces\n;\n280\ng\ntotal), diced (about\n1 1/2\ncups\n)\n4\nmedium\ncloves garlic\n, crushed\n2\nsprigs\nthyme\n2\nbay leaves\n2\ncups\n(\n475\nml\n) gelatinous\nhomemade\nchicken stock\n(see notes) or\nlow-sodium chicken broth\n3\ntablespoons\n(\n40\ng\n) cold\nunsalted butter\n, cubed\n1/4\ncup\nminced\nflat-leaf parsley\nDirections\nPreheat oven to 350°F (180°C). Add chicken to a 1-gallon zipper-lock bag. Pour in wine and seal bag, pressing out air. Let stand while you prepare the remaining ingredients.\nSerious Eats / Julia Hartbeck\nUsing a paring knife, trim off the ends of each onion and score a light \"X\" into one cut side. Bring a small pot of water to a boil over high heat. Add onions and cook until outer layers are soft, about 1 1/2 minutes. Drain onions and run under cool water until cold enough to handle. Peel onions with your fingers and discard peels.\nSerious Eats / Julia Hartbeck\nIn a large Dutch oven or rondeau, cook bacon over medium-high heat, stirring and reducing heat as necessary to prevent scorching, until browned and fat has rendered, about 10 minutes. Remove from heat and, using a slotted spoon, transfer bacon to a paper towel-lined plate. Reserve drippings in Dutch oven.\nSerious Eats / Julia Hartbeck\nRemove chicken from zipper-lock bag, reserving wine, and pat dry. Season with salt and pepper. Return Dutch oven with rendered bacon fat to medium-high heat and, working in batches, add chicken, skin side down, and cook until browned, about 7 minutes. Turn and brown other side, about 5 minutes, reducing heat as needed if bottom of Dutch oven is getting too dark. Transfer browned chicken to a wire rack set over a rimmed baking sheet. Reserve at room temperature.\nSerious Eats / Julia Hartbeck\nOnce all chicken is browned, add mushrooms to Dutch oven and cook over medium-high heat, stirring frequently, until browned, 10 to 12 minutes. Add pearl onions, carrots, and garlic and cook, stirring, until lightly browned, 5 to 8 minutes. Add bacon, wine, thyme, and bay leaves and bring to a simmer, stirring up any browned bits.\nSerious Eats / Julia Hartbeck\nStir in stock. Add chicken legs skin side up, nestling them into the Dutch oven so that they are partially submerged but top of skin is above the liquid. Pour in any accumulated juices from chicken. Transfer to oven and cook, uncovered, for 1 hour.\nSerious Eats / Julia Hartbeck\nAdd chicken breasts, nestling them skin side up amongst the legs, and return to the oven. Cook until breasts are just cooked through (they should register 145 to 150°F/63°C to 66°C on an instant-read thermometer), 20 to 25 minutes.\nSerious Eats / Julia Hartbeck\nTransfer chicken breasts and legs to a clean rack set over a rimmed backing sheet. Set Dutch oven over medium-low heat and simmer, stirring occasionally, until sauce is lightly viscous, looks slightly glossy, and tastes rich, 15 to 18 minutes. Whisk in butter, then season with salt (if necessary) and pepper. Stir in half of parsley.\nSerious Eats / Julia Hartbeck\nReturn chicken to pot, spooning sauce on top. Garnish with remaining parsley. Serve right away with buttered potatoes, pasta, or rice.\nSerious Eats / Julia Hartbeck\nSpecial Equipment\nLarge\nDutch oven\nor\nrondeau\nNotes\nIf you can't find small 3-pound chickens, use one 4-pound chicken plus 1 pound of chicken legs.\nFrozen pearl onions can be used in place of fresh; to use frozen onions, cook direct from frozen, skipping Step 2.\nThe chicken stock should have enough gelatin in it that it sets like jello when chilled. If it is thinner than that, you will need to add gelatin. Pour the stock into a large bowl and sprinkle with two packets of unflavored gelatin. Let the gelatin fully hydrate. The stock will have a grainy appearance but will smooth out once added to the recipe.\nMake-Ahead and Storage\nThis braise can be made ahead and tastes even better the next day: Complete the recipe through Step 7, then let cool at room temperature for one hour before transferring the Dutch oven to refrigerator; reheat gently in 350°F oven before proceeding with Step 8.\nRead More\nWhy I Only Buy Whole Chickens (and You Can, Too!)\nHow to Break Down a Chicken\nGrilled Coq au Vin\nCoq au Riesling\nChicken Mains\nFrench\nBraised & Stewed Chicken\nWhole Chicken"
}