{
  "url": "https://www.seriouseats.com/coquilles-saint-jacques-recipe-8723608",
  "image_url": "https://www.seriouseats.com/thmb/Ib7-MQRifeHWR0y4BXbKkwfPz4E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241004-SEA-CoquillesStJacques-AmandaSuarez-00_15-05b3dee05a32498b8d0f9defbfd224f7.jpg",
  "tags": [
    "Scallops",
    "The Latest",
    "French",
    "Seafood"
  ],
  "title": "Coquilles Saint-Jacques",
  "full_text": "Coquilles Saint-Jacques\nClose\nJump to recipe\nCook\n45 mins\nTotal\n45 mins\nServes\n4\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Breadcrumb Topping:\n1/2 cup\npanko breadcrumbs\n(1 ounce;\n28\ng\n)\n2\ntablespoons\ngrated\nGruyere\ncheese (1/2 ounce; 15g)\n1/2\nteaspoon\nminced\nfresh thyme\nleaves\n2 tablespoons (\n30\ng\n)\nunsalted butter\n, melted\nKosher salt\nFor the Scallops:\n3/4\ncup\n(180ml) dry\nwhite wine\n2\nsprig\ns\nfresh thyme\nplus 1/2 teaspoon minced fresh thyme leaves, divided\n1\nbay leaf\n4\nmedium\nshallots\n(5 ounces; 140g), 1 peeled and halved,\n3\nfinely minced, divided\n8\nounces\n(225g) button or\ncremini mushrooms\n, stems removed and reserved, caps finely minced\nOne\n8\n-\nounce\n(237ml) bottle\nclam juice\n1/2\nteaspoon\ninstant dashi\n, such as Ajinomoto (optional)\nWhole milk\n(about\n1\ncup\n)\n1\ntablespoon\n(15ml)\nvegetable or other neutral oil\n1/2\npound\n(225g) dry\nsea scallops\nKosher salt\n2 1/2\ntablespoons\n(27g)\nunsalted butter\n2 1/2\ntablespoons\n(20g)\nall purpose flour\n1\nlarge\negg yolk\nDirections\nFor the Breadcrumb Topping:\nIn a small bowl, stir together panko, Gruyere, and thyme until thoroughly combined. Drizzle in melted butter, stirring until panko is evenly coated. Season lightly with salt.\nSerious Eats / Amanda Suarez\nFor the Scallops:\nIn a small saucepan, combine wine with thyme sprigs, bay leaf, halved shallot, and reserved mushroom stems. Bring to a simmer over medium heat and cook until raw alcohol smell has mostly cooked off, about 4 minutes. Add clam juice and continue to simmer until liquid is reduced to about 3/4 cup (180ml), about 10 minutes. Strain into a heatproof 2-cup measuring cup, pressing on solids to extract liquid; discard solids. Let cool slightly.\nSerious Eats / Amanda Suarez\nStir in instant dashi, if using, until fully dissolved, then stir in enough milk to total 1 3/4 cups (415ml). Set aside.\nSerious Eats / Amanda Suarez\nIn a 3-quart saucier or sauté pan, heat oil over high heat until shimmering. Season scallops with salt and add to pan. Cook, without flipping or moving, until moderately browned on bottom, about 3 minutes. Using a thin metal spatula, flip scallops, cook for 30 seconds on second side, then transfer to a plate. Lower heat to medium.\nSerious Eats / Amanda Suarez\nAdd minced shallots to pan and cook, stirring and scraping bottom of pan, until starting to soften and turn translucent, about 2 minutes. Add minced mushrooms and cook, stirring and scraping bottom of pan, until mushrooms have released their liquid and are starting to brown, about 5 minutes. Stir in minced thyme and season lightly with salt.\nSerious Eats / Amanda Suarez\nAdd butter and cook until melted, then stir in flour until a lump-free paste forms with the mushroom mixture. Slowly whisk in reserved wine-milk mixture, making sure no lumps form as you go. Bring to a boil over medium-high heat and cook, stirring and scraping bottom of pan frequently to prevent scorching, until mixture has thickened to a thick and creamy consistency. Season lightly with salt, if needed. Remove from heat and let cool about 2 minutes.\nSerious Eats / Amanda Suarez\nIn a medium heatproof mixing bowl, whisk egg yolk while very slowly adding hot mushroom sauce; start out adding the cup or so of hot sauce in tiny additions, speeding up slightly after that point until all of the mushroom mixture is blended with the yolk. Return to saucepan set over medium heat, and cook, stirring and scraping bottom of pot constantly, until mixture has further thickened to a thick cream-sauce consistency. Remove from heat and let cool while stirring and scraping often to prevent residual heat in the pot from cooking scrambling the yolk.\nSerious Eats / Amanda Suarez\nTurn on broiler and set oven rack to upper position. Whisk any accumulated scallop juices into the mushroom sauce, then cut scallops into large pieces. In a small bowl, toss scallops with enough of the mushroom sauce to coat generously.\nSerious Eats / Amanda Suarez\nScoop sauced scallops into cleaned scallop shells, ramekins, or small gratin dishes. Spoon more mushroom sauce on top so scallops are generously dressed.\nSerious Eats / Amanda Suarez\nSprinkle an even layers of breadcrumbs on top of each serving, then broil until golden brown. Serve right away.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nSmall saucepan, 3-quart saucier, scallops shells or ramekins or gratin dishes (see notes)\nMake-Ahead and Storage\nThe breadcrumb mixture can be made up to 1 day in advance and refrigerated until ready to use (you may need to bring it back to room temp before sprinkling on scallops).\nThe scallops and sauce can be fully made through step 9, then covered with plastic and refrigerated for up to 1 day. Top with breadcrumbs and broil until fully heated through and golden on top (if you use a deeper vessel like ramekins, you may need to warm the scallops through in a moderate oven before switching to the broiler for further browning).\nNotes\nScallops shells can come from live scallops (if you're lucky), ordered online (look for ones intended for food service use), or you can just use ramekins or gratin dishes.\nScallops\nThe Latest\nFrench\nSeafood",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/coquilles-saint-jacques.webp?"
}