{
  "url": "https://www.seriouseats.com/corn-creme-brulee-recipe-11758116",
  "image_url": "https://www.seriouseats.com/thmb/6q1Ha06IYqNPdlIuS-ND9Yz2vM4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240823-SEA-CornCremeBrulee-AmandaSuarez20-a0677d8ff6cc42f6984375e17ddb0498.jpg",
  "tags": [
    "Recipes",
    "Custards, Mousses & Puddings",
    "Summer Desserts",
    "Desserts",
    "Summer"
  ],
  "title": "This One Ingredient Takes Crème Brûlée Over the Top",
  "full_text": "This One Ingredient Takes Crème Brûlée Over the Top\nClose\nJump to recipe\nPrep\n25 mins\nCook\n35 mins\nChilling Time\n3 hrs\nTotal\n4 hrs\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\nears\nfresh\nsweet corn\n, shucked\n1 1/2\ncups\n(360ml)\nheavy cream\n1/2\ncup\n(120 ml)\nwhole milk\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use a pinch\n3\nlarge\negg yolks\n(42g)\n1/4\ncup\n(50 g)\ngranulated sugar\n, plus more for topping\n1\nteaspoon\npure\nvanilla extract\nor paste (optional)\nDirections\nAdjust oven rack to middle position and preheat oven to 325°F (163°C). Set four shallow 8-ounce ramekins (or four 6-ounce standard ramekins) in a 9- by 13-inch baking dish; set aside.\nSerious Eats / Amanda Suarez\nCut kernels off cobs (\nsee the best way to cut corn from the cob here\n); you should have about 1 cup (320g) of kernels.\nSerious Eats / Amanda Suarez\nIn a medium saucepan, combine corn kernels and cobs, cream, milk, and salt. Bring to a simmer over medium heat. Remove from heat, cover, and let steep for 15 minutes.\nSerious Eats / Amanda Suarez\nUsing tongs, remove corn cobs from cream and discard. Carefully transfer cream mixture and corn kernels to a blender. Blend until smooth and creamy, about 15 seconds.\nSerious Eats / Amanda Suarez\nIn a small bowl, whisk yolks, sugar, and vanilla, if using, to combine. Add this sugar-egg mixture into corn cream in the blender and blend until combined, about 10 seconds.\nSerious Eats / Amanda Suarez\nSet a fine-mesh strainer over a 4-cup measuring cup. Pour custard base through, pressing to express liquid from solids. Divide custard base evenly among the ramekins.  (For shallow ramekins, fill with 6 ounces of liquid each. For standard ramekins, fill them to the lip.) You may have a few tablespoons of extra custard.\nSerious Eats / Amanda Suarez\nCarefully transfer baking dish to middle rack of oven. Pour just-boiled—but not boiling—water (around 180º to 200ºF or 88º to 93ºC) into baking dish until it comes 2/3 of the way up the ramekins; be careful not to splash water into ramekins.  Bake until custards are just set, 30 to 35 minutes. Remove from oven, and, using towels, oven mitts, or silicone-coated tongs, carefully transfer ramekins to a cooling rack. Allow custards to cool to room temperature, about 1 hour. Refrigerate until set, uncovered, at least 3 hours.\nSerious Eats / Amanda Suarez\nTo finish and serve, top the surface of each ramekin with an even layer of sugar (about 1 to 2 teaspoons per ramekin). Working in a circular motion, use a kitchen blowtorch to pass a flame over the top of each crème brûlée, 1 to 2 inches away from the surface of the custard, until the sugar has caramelized and melted into a glossy, crackling sheet and turned golden brown. (How closely and how long you should torch your custards will depend on the strength of your blowtorch; watch the sugar carefully as you pass the torch over the surface of the custard to avoid scorching your crème brûlées.) Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFour 8-ounce ramekins (5-inch in diameter) or four standard 6-ounce ramekins, 9- by 13-inch baking dish, blender, whisk, fine-mesh strainer, kitchen blowtorch\nMake-Ahead and Storage\nThe custards can be made through step 7 up to 2 days ahead and refrigerated uncovered. Wait to caramelize the sugar topping until you are ready to serve; after an hour, the crisp sugar topping will soften and liquify.\nRecipes\nCustards, Mousses & Puddings\nSummer Desserts\nDesserts\nSummer"
}