{
  "url": "https://www.seriouseats.com/cornbread-oyster-stuffing-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PPdFW9KuWXRN0dQtjcNGgTURZUY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__11__20151102-oyster-cornbread-stuffing-vicky-wasik-20-4870c5299a0041ce8d2c5d5d7d6e8fe2.jpg",
  "tags": [
    "Sides",
    "Thanksgiving Stuffings",
    "Cornbread",
    "Sausages",
    "Oysters"
  ],
  "title": "Southern Cornbread Dressing With Oysters and Sausage Recipe",
  "full_text": "Southern Cornbread Dressing With Oysters and Sausage Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n60 mins\nCooling Time\n30 mins\nTotal\n95 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\nSouthern-style unsweetened cornbread\n(about\n2 1/2\npounds\n;\n1 1/4\nkg\n), cut into 3/4-inch dice\n1\nstick\nunsalted butter\n(\n4\nounces\n;\n113\ng\n), plus more for greasing dish\n1\npound\n(\n454\ng\n)\nsweet Italian sausage\n, removed from casing\n1\nlarge\nonion\n, finely chopped (\n300\ng\n; about\n2\ncups\n)\n2\nlarge ribs\ncelery\n, finely chopped (\n200\ng\n; about\n1\ncup\n)\n1/2\nmedium\nfennel bulb\n, finely chopped (\n200\ng\n; about\n1\ncup\n)\n2\nmedium\ncloves garlic\n(\n10\ng\n), minced\n1\nteaspoon\nminced\nfresh thyme\n3\ncups\n(\n710\nml\n) homemade\nchicken stock\nor\nlow-sodium broth\n, divided\n4\nlarge\neggs\n(\n2 ounces\n;\n57 g\neach)\n2\ntablespoons\nminced\nfresh tarragon\nleaves\n1/4\ncup\nminced\nflat-leaf parsley leaves\n(about\n1/4\nounce\n;\n8\ng\n), divided\n2\ncups\nraw oysters\nand their liquor (\n470\nmilliliters\n; about\n32\nmedium\noysters\n), oysters chopped (see notes)\nKosher salt\nand freshly\nground black pepper\nDirections\nAdjust oven racks to lower-middle and upper-middle positions. Preheat oven to 425°F (220°C). Spread cornbread evenly over 2 rimmed baking sheets. Stagger sheets on oven racks and bake until lightly toasted, about 10 minutes. Remove from oven and allow to cool, about 15 minutes.\nWhile bread is cooling: In a large Dutch oven, melt butter over medium-high heat until foaming subsides, about 2 minutes, without allowing butter to brown. Add sausage and, using a stiff whisk or potato mashers, break up into fine pieces (largest pieces should be no bigger than 1/4 inch). Cook, stirring frequently, until only a few bits of pink remain, about 8 minutes. Add onion, celery, fennel, garlic, and thyme and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.\nWhisk remaining chicken stock, eggs, tarragon, and 3 tablespoons of parsley in a medium bowl until homogeneous. Stirring constantly with a wooden spoon, slowly pour egg mixture into sausage mixture. Add cornbread cubes, oysters, and oyster liquor and fold gently until evenly mixed. Season lightly with salt and pepper (1 teaspoon salt and 1/2 teaspoon pepper). Transfer dressing to a buttered 9- by 13-inch rectangular baking dish or 10- by 14-inch oval dish.\nSerious Eats / Vicky Wasik\nAdjust oven rack to center of oven and preheat oven to 375°F (190°C). Uncover dressing and bake until an instant-read thermometer reads 150°F (66°C) when inserted into center of dish and dressing is crisped on top, about 45 minutes. Remove from oven, let cool for 15 minutes, sprinkle with remaining 1 tablespoon of parsley, and serve.\nSpecial Equipment\nTwo rimmed baking sheets, 9- by 13-inch rectangular baking dish (or 10- by 14-inch oval dish), stiff wire whisk or potato masher, instant-read thermometer\nMake-Ahead and Storage\nThe dressing can be prepared through step 3, covered with aluminum foil, and refrigerated for up to 2 days in advance or wrapped tightly in plastic wrap and frozen for up to 6 months. If cooking from frozen, bake from frozen for full amount of time.\nThe dressing can be baked and, once cooled, wrapped tightly in plastic wrap for up to 6 months. Bake in a 350ºF (175ºC) oven until warmed through.\nNotes\nYou can shuck your own fresh oysters (see the video above for instructions), ask your fishmonger to do it, or buy containers of raw shucked oysters. Our tests showed that the stuffing tastes just as good with pre-shucked oysters as with freshly shucked. The easiest way to chop the oysters is to snip them in a container using kitchen shears; that way you don't lose their juices to the cutting board.\nSides\nThanksgiving Stuffings\nCornbread\nSausages\nOysters"
}