{
  "url": "https://www.seriouseats.com/cornbread-muffins-5209786",
  "image_url": "https://www.seriouseats.com/thmb/pV7AN_U7UymCr735b1nOODboqbg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210929-cornbread-muffins-vicky-wasik-14-23282518121f4df5a30fb3a432998033.jpg",
  "tags": [
    "Thanksgiving",
    "Cornmeal",
    "Corn",
    "Thanksgiving Side Dishes",
    "The Latest"
  ],
  "title": "Cornbread Muffins",
  "full_text": "Cornbread Muffins\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nCooling\n5 mins\nTotal\n35 mins\nMakes\n12 muffins\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\ncups\n, spooned (\n5 1/2\nounces\n;\n155\ng\n),\nall-purpose flour\n1\ncup\n(\n5\nounces\n;\n146\ng\n) fine- or medium-ground\nyellow cornmeal\n, such as Bob’s Red Mill\n1/4\ncup\n(\n2\nounces\n;\n57\ng\n)\ngranulated sugar\n1\ntablespoon\n(\n12\ng\n)\nbaking powder\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume or use the same weight\n8\ntablespoons\n(\n4\nounces\n;\n113\ng\n)\nunsalted butter\n, melted\n2\nlarge\neggs\n, cool room temperature\n1\ncup\n(\n260\ng\n) canned\ncream-style sweet corn\n1/2\ncup\n(\n4\nounces\n;\n113\ng\n)\nwhole milk\n, cool room temperature\n1/4\ncup\n(\n2\nounces\n;\n56\ng\n)\nsour cream\n, cool room temperature\nNonstick cooking spray\n, for greasing the muffin pan\nDirections\nAdjust oven rack to middle position and preheat to 425°F (220°C). In a large bowl, whisk together flour, cornmeal, sugar, baking powder, and salt.\nVicky Wasik\nIn a medium bowl, whisk together melted butter, eggs, creamed corn, milk, and sour cream until homogenous.\nVicky Wasik\nWhisk wet ingredients into dry ingredients until well combined. Do not over-mix.\nVicky Wasik\nLightly grease a 12-cup muffin nonstick or aluminum muffin pan with cooking spray. Divide batter evenly among the cups, about 76g (5 tablespoons) each, then firmly tap muffin pan on the counter to even out batter. This is enough to almost completely fill each cup with batter, but do not be alarmed; it will rise but spread very little overall.\nVicky Wasik\nBake until firm to touch, light golden in color, and a toothpick inserted into cornbread comes out clean, 18 to 20 minutes. Let cool 5 minutes, then use a small offset spatula to lift each muffin from the pan. Serve warm.\nVicky Wasik\nSpecial Equipment\nNonstick or aluminum muffin pan, small offset spatula.\nNotes\nFor scallion cornbread, fold 1 cup (3 ounces; 80g) thinly sliced scallions into the batter.\nFor pimento cheese cornbread, fold 1 cup (4 ounces) shredded cheddar cheese and one 4-ounce jar pimientos, drained, into the batter.\nFor brown butter and sage cornbread, melt the recipe's 8 tablespoons butter in a medium saucepan over medium-high heat. Cook, gently swirling pan constantly, until particles begin to turn golden brown and butter smells nutty, about 5 minutes. Remove from heat and continue swirling the pan until the butter is a rich brown, about 15 seconds longer. Transfer to a medium bowl and allow to cool completely, about 20 minutes, whisking occasionally. Proceed with the recipe, folding 1 tablespoon of minced fresh sage into the batter.\nMake-Ahead and Storage\nLeftover cornbread muffins can be stored at room temperature in a sealed container for up to 3 days.\nTo freeze baked cornbread muffins, store in an air-tight sealable plastic bag. Let thaw at room temperature, then wrap in aluminum foil and reheat in a 350°F (177°C) oven until warm, about 15 minutes. Alternatively, wrap the muffins in a damp paper towel and microwave in 15-second intervals until warm.\nThanksgiving\nCornmeal\nCorn\nThanksgiving Side Dishes\nThe Latest"
}