{
  "url": "https://www.seriouseats.com/corn-pudding-recipe-8677467",
  "image_url": "https://www.seriouseats.com/thmb/5xVfFB_r4-YqEEslMGSJksmZTeU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240710-Corn-Pudding-Lorena-Masso18-SEA-22-045e27bea766400187b54a37e1cc9ae9.jpg",
  "tags": [
    "Corn",
    "The Latest",
    "Thanksgiving Side Dishes",
    "Vegetarian",
    "Summer"
  ],
  "title": "Pennsylvania Dutch Corn Pudding",
  "full_text": "Pennsylvania Dutch Corn Pudding\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nCooling Time\n10 mins\nTotal\n80 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1 tablespoon (\n14\ng\n)\nunsalted butter\n, melted, plus more for greasing\n2 1/4 cups\ncorn\nkernels (\n340\ng\n; 12 ounces) from 3 to 4 large ears of corn, see notes\n1\ntablespoon\n(8g)\ncornstarch\n2\nteaspoons\n(15g)\ngranulated sugar\n1 1/4\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\n2\nlarge\neggs\n1 cup (\n240\nml\n)\nwhole milk\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Generously butter a 7-inch round or a 8- by 8-inch baking dish.\nSerious Eats / Lorena Masso\nIn the bowl of a food processor, pulse corn kernels until thick, creamy, and some kernels are still visible, about 20 seconds. Set aside. (See notes.)\nSerious Eats / Lorena Masso\nIn a medium bowl, whisk cornstarch, granulated sugar, salt, and pepper to combine. Add eggs, followed by the corn, milk, and melted butter, whisking until well combined. Pour into prepared baking dish.\nSerious Eats / Lorena Masso\nBake, uncovered, until edges are golden brown and the center no longer jiggles, 50 to 60 minutes. Remove corn pudding from oven and allow to rest 10 minutes, or until cool enough to eat. Serve immediately.\nSerious Eats / Lorena Masso\nSpecial Equipment\n7-inch round or 8- by 8-inch baking dish, food processor\nNotes\nRemoving kernels from fresh corn can be a messy affair; I do this by running a sharp knife along the sides of the cob, but feel free to employ the assistance of a corn stripper. And though some recipes suggest grating the corn, I found this technique even messier and unnecessarily labor-intensive, so I've used a food processor to blitz the kernels instead.\nThe processed corn should be pulplike, with visible chunks or pieces of kernel remaining. It should not be completely puréed or liquified, or the pudding will take much longer to bake.\nThis recipe also works with canned or thawed frozen yellow sweet corn, and will yield a similar taste and texture. Drain the corn very thoroughly, and increase the baking time by 5-10 minutes to account for the additional moisture, or you’ll run the risk of watery pudding.\nMake-Ahead and Storage\nCorn pudding can be refrigerated in an airtight container for up to 3 days.To reheat, microwave on medium-high power, stirring every 30 seconds until warmed through. Alternatively, place leftovers in a baking dish and reheat, uncovered, in a 350°F (175° C) oven until warmed through, 15 to 20 minutes.\nCorn pudding can be frozen in an airtight container for up to three months. Thaw in the refrigerator before reheating in the microwave or oven.\nCorn\nThe Latest\nThanksgiving Side Dishes\nVegetarian\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pennsylvania-dutch-corn-pudding.webp?"
}