{
  "url": "https://www.seriouseats.com/cornflake-marshmallow-treats-recipe-7369472",
  "image_url": "https://www.seriouseats.com/thmb/aqd8fh65wWLjTj7dLpc83S8Srls=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230323-SEA-CornflakeCripsies-AmandaSuarez-77f40ddf71de441a93653c1bfd9f415f.JPG",
  "tags": [
    "Dessert Bars",
    "The Latest",
    "Desserts",
    "Quick Snacks"
  ],
  "title": "Cornflake Marshmallow Treats",
  "full_text": "Cornflake Marshmallow Treats\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nCooling Time\n30 mins\nTotal\n65 mins\nMakes\n9\nto 12\nCook Mode\n(Keep screen awake)\nIngredients\n7\nheaping\ncups\n(\n252\ng\n)\ncorn flakes\n4\ntablespoons\n(\n56\ng\n)\nunsalted butter\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\nOne\n12-ounce bag\nof\nmarshmallows\n, any size\nFlaky salt\n, to garnish\nDirections\nPreheat oven to 325ºF (160ºC). Line two rimmed baking sheets with parchment and divide cereal evenly between the two sheets. Using your hands, gently crumble the cornflakes to break them up into smaller pieces. (They should not be as small as breadcrumbs; aim for the size slightly larger than that of Rice Krispies.) Toast in the oven, using a spatula to stir the grains occasionally, until deep golden brown, about 10 minutes. Remove from oven and cool for 5 minutes. When cool, lift both sides of the parchment to form a “sleeve” and transfer corn flakes to a large bowl. Set aside.\nSerious Eats / Amanda Suarez\nWhile the corn flakes toast, line a 9- by 9-inch baking dish with parchment and coat evenly with nonstick baking spray. Set aside.\nIn a large pot, melt 4 tablespoons unsalted butter over medium heat, stirring and swirling, until solids turn golden brown and the butter smells nutty, 3 to 4 minutes. Reduce heat to low. Add salt, followed by marshmallows. Using a rubber spatula, stir until the marshmallows have just melted, about 4 minutes. Stir in toasted corn flakes, folding well to incorporate.\nSerious Eats / Amanda Suarez\nTransfer to prepared baking dish, using a rubber spatula greased with nonstick baking spray to coax the mixture into the pan. Garnish with flaky salt. Allow bars to cool for 30 minutes before portioning.\nSerious Eats / Amanda Suarez\nTo portion, remove bars from the baking dish and place on a cutting board. Use a serrated knife to cut bars into squares, rectangles, or your desired shape.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n2 rimmed baking sheets, parchment paper, 9- by 9-inch baking dish, nonstick baking spray\nNotes\nTo make these treats vegetarian, substitute the regular marshmallows with a vegetarian-friendly alternative.\nMake-Ahead and Storage\nThe bars can be kept at room temperature for up to 1 week, but are best enjoyed within 5 days. Store in an airtight container.\nDessert Bars\nThe Latest\nDesserts\nQuick Snacks"
}