{
  "url": "https://www.seriouseats.com/corned-beef-hash-recipe-5509275",
  "image_url": "https://www.seriouseats.com/thmb/yTjmztY9DyfrXqqgwnwXi6x96Sg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220629-CornedBeefHash-Amanda-Suarez-heo-7f573da7fd2b45168c52091dc5ced59e.jpg",
  "tags": [
    "Potatoes",
    "Yukon Gold Potatoes",
    "The Latest",
    "Brisket"
  ],
  "title": "Corned Beef Hash",
  "full_text": "Corned Beef Hash\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nTotal\n55 mins\nServes\n2\nto 4 servings, depending on your mood\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\nYukon Gold potato\n(\n13\nounces\n;\n370\ng\n), cut into 1/2-inch (1.3 cm) cubes (see note)\n1\nquart\n(\n0.9\nL\n)\nwater\n1\ntablespoon\nplus\n1/4\nteaspoon\n(\n10\ng\n) Diamond Crystal\nkosher salt\n, divided, plus more to taste; if using\ntable salt\nuse half as much by volume or same weight\n1\ntablespoon\n(\n15\nml\n) distilled\nwhite vinegar\n2\ntablespoons\nunsalted butter\n1/2\na\nlarge\nwhite\nor\nSpanish onion\n(\n3.5\nounces\n;\n100\ng\n), unevenly chopped (see above)\n8\nounces\n(\n230\ng\n)\ncooked corned beef brisket\n, fat removed and diced, meat shredded by hand into 1-inch (2.5cm) pieces\n1\nmedium\ngreen bell pepper\n(\n7\nounces\n;\n200\ng\n), diced\nCrispy fried eggs\n, for serving\nChimichurr\ni\n, for serving\nDirections\nCombine potatoes, water, 1 tablespoon (9g) salt, and vinegar in a pot and bring to a boil over medium-high heat. Reduce heat to maintain a simmer and cook for 4 minutes; potatoes will still be quite firm. Drain potatoes and let cool for at least 15 minutes.\nSerious Eats / Amanda Suarez\nMelt butter in a 10-inch cast iron pan over medium-high heat. Once butter stops foaming, add onions along with 1/4 teaspoon (1g) salt and stir to thoroughly coat onions in fat. Cook, stirring frequently, until larger pieces of onion soft and translucent and smallest pieces of onion are browning and threatening to char, about 4 minutes. Using tongs or slotted spoon, transfer onions to small bowl, leaving as much butter as possible in the pan.\nSerious Eats / Amanda Suarez\nAdd diced corned beef fat to pan and cook, stirring frequently, until it renders all of its liquid fat and bits and pieces are very crisp, about 2-3 minutes. Using tongs or slotted spoon, transfer crispy bits to bowl with onions, leaving as much fat as possible in the pan.\nSerious Eats / Amanda Suarez\nAdd the now-cool potatoes to the pan and, using a wooden spoon, pack the cubes down into a single layer. Cook without stirring for 3-4 minutes. Toss potatoes, using wooden spoon to assist you, then pack them down again and cook, without stirring , 2-3 minutes. Toss potatoes again, pack down again, and cook, without stirring, 2-3 minutes. The potatoes should be relatively evenly browned and crisp.\nSerious Eats / Amanda Suarez\nAdd diced green bell pepper to pan, toss with potatoes to distribute. Using the wooden spoon, pack mixture down in a single layer and cook, without stirring, until some pepper pieces begin to char, 2 minutes.\nSerious Eats / Amanda Suarez\nAdd cooked onions, corned beef fat, and shredded corned beef, and toss to combine. Using wooden spoon, pack mixture down into the pan, being careful not to break up potatoes. Cook, without stirring, until shreds of parts of mixture in contact with the bottom of the pan become crisp and slightly charred, 2 minutes. Toss mixture before serving to distribute crispy bits more seamlessly into the mix. Serve immediately with crispy fried eggs and chimicchuri on the side.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n10-inch cast iron pan\n,\n3-quart saucier\n,\nwooden spoon\n,\ntongs\nNotes\nYou can use a russet potato, if you like, cut into the same dice. Adjust the parcooking time for the potatoes in Step 1 to 6 minutes.\nMake-Ahead and Storage\nSurprisingly enough, corned beef hash keeps quite well in the refrigerator, and cold corned beef hash is delicious when eaten straight out of a plastic container while standing in front of your refrigerator. In a sealed container, corned beef hash will keep for up to one week in the refrigerator.\nRead More\nCorned Beef Brisket, Potatoes, Cabbage, and Carrots for St. Patrick's Day\nBrussels Sprouts, Potatoes, and Turkey Hash\n12 Breakfast Potato Recipes\nPotatoes\nYukon Gold Potatoes\nThe Latest\nBrisket"
}