{
  "url": "https://www.seriouseats.com/costillas-a-la-riojana-argentine-pork-chops-recipe-7153214",
  "image_url": "https://www.seriouseats.com/thmb/LOfUFCVjgBrGk9AKn4KJW8vjrbQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230301-Costillas-a-la-Riojana-VickyWasik21-55bb93d67f7445759dfdcad29368698f.JPG",
  "tags": [
    "South American",
    "The Latest",
    "Pork Mains",
    "Pork",
    "Pork Chop"
  ],
  "title": "Costillas a la Riojana (Argentine Pork Chops With Fried Eggs and Vegetables)",
  "full_text": "Costillas a la Riojana (Argentine Pork Chops With Fried Eggs and Vegetables)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nTotal\n70 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\n(\n8-ounce\n)\nbone-in pork rib chops\n, about 1 inch thick (\n225\ng\neach)\nKosher salt\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1\nmedium\nred bell pepper\n(\n5\nounces\n;\n150\ng\n), stemmed, seeded, and very thinly sliced\n1\nmedium\ngreen bell pepper\n(\n5\nounces\n;\n150\ng\n), stemmed, seeded, and very thinly sliced\n1\nlarge\nyellow onion\n(\n12\nounces\n;\n340\ng\n), thinly sliced\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n1\nteaspoon\ndry basil\n1\nteaspoon\ndry oregano\n1/2\nteaspoon\nfine ground white pepper\n1\ncup\nplus\n2\ntablespoons\n(\n265\nml\n)\ndry white wine\n2/3\ncup\nfrozen peas\n(\n3 1/2\nounces\n;\n100\ng\n)\n2\nto\n4\ncrispy fried eggs\n, for serving\nDirections\nSeason pork chops all over with salt and set on a wire rack set in a rimmed baking sheet for at least 40 minutes or refrigerate, uncovered, for up to 24 hours.\nSerious Eats / Vicky Wasik\nIn a 12-inch stainless-steel or cast iron skillet or large Dutch oven, heat olive oil over medium heat until shimmering. Add red and green bell peppers and onion along with a large pinch of salt and cook, stirring often, until softened and onions have lightly browned, about 15 minutes; lower heat if necessary to prevent excessive browning. Transfer cooked vegetables to a heatproof bowl and set aside. Clean pot or skillet.\nSerious Eats / Vicky Wasik\nPat pork chops dry with a paper towel. In the cleaned pot or skillet, melt butter over medium-high heat until foaming. Working in batches if necessary to not overcrowd the skillet, place pork chops in skillet and cook over medium-high heat until evenly browned on both sides, about five minutes per side. Transfer pork chops to a platter and set aside.\nSerious Eats / Vicky Wasik\nLower heat to medium and add basil, oregano, and white pepper to remaining butter in skillet and cook, stirring constantly, until fragrant, about 15 seconds. Pour white wine into skillet and bring to a boil while scraping up all the browned bits from the bottom of the pan. Cook until raw alcohol smell has largely cooked off, then add the cooked bell peppers and onions to the skillet and simmer, stirring often, until jammy, about 20 minutes; add additional water 1 or 2 tablespoons at a time, if needed, to keep vegetables from becoming overly dry. Season with salt.\nSerious Eats / Vicky Wasik\nNestle pork chops in the vegetables, reduce heat to low to maintain a simmer and cook until pork chops register 130 to 140°F (54 to 60°C) on an instant-read thermometer for medium and sauce has thickened to a gravy-like consistency (add water, if needed, if the vegetables are too dry), about 10 minutes. Add frozen peas and cook until warmed through, about 5 minutes.\nSerious Eats / Vicky Wasik\nServe pork chops with crispy fried eggs on top (you can serve 2 chops with one crispy fried egg per person or 1 chop each with a fried egg for 4 people).\nSerious Eats / Vicky Wasik\nSpecial Equipment\n12-inch stainless-steel or cast-iron skillet or large Dutch oven\nSouth American\nThe Latest\nPork Mains\nPork\nPork Chop"
}