{
  "url": "https://www.seriouseats.com/cranberry-crumble-galette-recipe-8758840",
  "image_url": "https://www.seriouseats.com/thmb/ghitwosX-tQn57stbIz4rLKsuCU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241209-CranberryCrumbleGalette-Melati-Citrawireja13-06dcc7a45c51479c8c203fb8e970c4b5.jpg",
  "tags": [
    "The Latest",
    "Desserts",
    "Fall Desserts",
    "Christmas",
    "Winter Desserts"
  ],
  "title": "Cranberry Crumble Galette",
  "full_text": "Cranberry Crumble Galette\nClose\nJump to recipe\nPrep\n30 mins\nCook\n50 mins\nTotal\n80 mins\nServes\n6\nto 8\nMakes\n1 8-inch galette\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crumble:\n64\ng\nall-purpose flour\n(2 1/4 ounces; 1/2 cup)\n40g\ndark brown sugar\n(about\n1 1/2\nounces\n; 3 tablespoons)\n30\ng\ngranulated sugar\n(1 ounce; 2 tablespoons)\n1/2\nteaspoon\nground cinnamon\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n56g\nunsalted butter\n(\n2\nounces\n; 4 tablespoons), at room temperature, cut into 1/2-inch slices\nFor the Filling:\n340\ng\nfresh or frozen\ncranberries\n(12 ounces; about 3 cups)\n132g\ngranulated sugar\n(about\n4 3/4\nounces\n; 2/3 cup)\n2\ntablespoons\n(30ml)\norange liqueur\n, such as Cointreau or Grand Marnier or\nhomemade orange liqueur\n, or orange juice\n1/4\nteaspoon\nground cinnamon\nTo Assemble:\n1\npie dough\n,\nhomemade\nor store-bought\n2\ntablespoons\n(30ml)\nmilk or cream\n, for brushing\nGranulated or sparkling\nsugar\n, for finishing\nVanilla ice cream\n, for serving (optional)\nDirections\nFor the Crumble:\nIn a medium bowl, whisk the flour, dark brown sugar, granulated sugar, cinnamon, and salt to combine. Add butter to flour mixture and toss with fingers until butter pieces are thoroughly coated with flour and sugar mixture. Using your fingertips, smash each cube flat and continue pressing and breaking up butter until mixture is sandy and you have pea-size crumbles of dough. (Avoid overworking the mixture as it may get too warm and begin to form large clumps; if this happens, refrigerate mixture until firm, then re-crumble into small pieces.) Refrigerate until ready to use.\nSerious Eats / Melati Citrawireja\nFor the Filling:\nIn a large bowl, toss cranberries, sugar, orange liqueur or orange juice, and cinnamon to combine. Set aside.\nSerious Eats / Melati Citrawireja\nAdjust oven rack to middle position and preheat to 400ºF (200ºC). Line a 13- by 18-inch rimmed baking sheet with parchment paper; set aside.\nSerious Eats / Melati Citrawireja\nTo Assemble:\nLightly flour a work surface and roll pie dough into a 12-inch round. Transfer dough to lined baking sheet and arrange cranberries in center of dough, leaving about a 2-inch border of dough all around. Scatter crumble evenly over cranberries, leaving the outermost 1-inch of cranberries exposed. (Most of the crumble should be exposed rather than covered with folded dough.) Fold one edge of dough border up and over the filling toward the center. Working around the edge of the galette, repeat, overlapping the dough every 3 inches or so, until the edge is pleated.\nSerious Eats / Melati Citrawireja\nUsing a pastry brush, lightly brush the dough with cream or milk, then sprinkle sugar evenly over crust. Bake until crust begins to brown, about 15 minutes,  then reduce oven temperature to 350°F (175ºC) and bake until galette is a deep golden brown and filling is thick and bubbling, 30 to 35 minutes more. (If the crumble begins to get too dark before filling is fully cooked, lightly tent the center of the galette with foil or transfer to lower rack of the oven.\nSerious Eats / Melati Citrawireja\nLet cool for at least 30 minutes. Serve warm with vanilla ice cream, if desired.\nSerious Eats / Melati Citrawireja\nThe Latest\nDesserts\nFall Desserts\nChristmas\nWinter Desserts"
}