{
  "url": "https://www.seriouseats.com/cranachan-scottish-whipped-cream-with-whisky-raspberries-and-toasted-oats",
  "image_url": "https://www.seriouseats.com/thmb/tEAKxQu654k9lADEbFn0yhDgN5o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__01__20180116-cranachan-vicky-wasik-1-3-0eb9fcde3d3d41b1b207aa60ee571711.jpg",
  "tags": [
    "Desserts",
    "Scottish",
    "Raspberry",
    "Heavy Cream",
    "Oats"
  ],
  "title": "Cranachan (Scottish Whipped Cream With Whisky, Raspberries, and Toasted Oats) Recipe",
  "full_text": "Cranachan (Scottish Whipped Cream With Whisky, Raspberries, and Toasted Oats) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n25 mins\nSoaking Time\n20 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n475\nml\n)\nheavy cream\n1/4\ncup\nrolled\n(\n30\ng\n) or\nsteel-cut\n(\n45\ng)\noats\n(see note)\n12\nounces\n(\n340\ng\n)\nfresh raspberries\n, divided\n1\nteaspoon\n(\n5\nml\n)\nfresh juice\nfrom\n1\nwhole\nlemon\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n, melted\nKosher salt\n2\ntablespoons\n(\n30\ng\n)\nmascarpone cheese\n(optional)\n3\ntablespoons\n(\n45\nml\n)\nScotch whisky\n(see note)\n2\ntablespoons\n(\n30\nml\n)\nhoney\n, plus more for drizzling\nDirections\nPreheat oven to 400°F (200°C). In a medium bowl, combine cream with oats and let soak 20 minutes.\nMeanwhile, in a medium bowl, crush 8 ounces of the raspberries with a spoon to make a pulpy purée. Stir in lemon juice. Set remaining 4 ounces whole raspberries aside.\nSerious Eats / Vicky Wasik\nUsing a fine-mesh strainer, strain oats, collecting the cream in a bowl; use a spoon or rubber spatula to press out as much cream as possible. Set cream aside.\nSerious Eats / Vicky Wasik\nIn a small oven-safe skillet or on an aluminum baking sheet, stir soaked oats with melted butter and toast in oven, tossing and stirring frequently, until deeply browned, about 20 minutes (you want the oats to darken nearly to the point of being burnt, but don't actually burn them).\nStrain oats on paper towels, and sprinkle with a generous pinch of salt.\nFor a More Dense, Mousse-Like Cream:\nIn a food processor, combine reserved cream with mascarpone (if using), Scotch, and honey, along with a pinch of salt. Process until a dense whipped cream forms.\nSerious Eats / Vicky Wasik\nFor a More Standard, Lighter Whipped Cream:\nIn a stand mixer fitter with the whisk, or using electric beaters or a hand whisk, combine reserved cream with mascarpone (if using), Scotch, and honey, along with a pinch of salt. Beat until a stiff whipped cream forms.\nSerious Eats / Vicky Wasik\nTo Assemble:\nIn individual serving glasses, spread an even layer of whipped cream. Top with a layer of the raspberry purée. Sprinkle some toasted oats on top, then add one more layer of the whipped cream to fill (or nearly fill) the glasses. Garnish each with the reserved whole raspberries, sprinkle additional toasted oats on top, and drizzle with honey. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n,\nstand mixer\n, or\nwhisk\nNotes\nYou can use rolled or steel-cut oats; rolled make lighter, crispier toasted flakes, while steel-cut oats have a more firm and crunchy bite.\nYou can use all sorts of Scotch here, including deeply smoky and peaty ones, though most of our tasters preferred a lighter, more honeyed style. Blended Scotch is a more cost-effective choice here; Dewar's is one good option.\nRead More\nMixed Berry Trifle\nCranberry Trifle\nTangy Strawberry Fools\nLemon-Blueberry Fools\nDesserts\nScottish\nRaspberry\nHeavy Cream\nOats",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cranachan-scottish-whipped-cream-with-whisky-raspberries-and-toasted-oats-recipe.webp?"
}