{
  "url": "https://www.seriouseats.com/creamy-parmesan-stock-5184256",
  "image_url": "https://www.seriouseats.com/thmb/LcdCVcFVgrh01BvmGDq6JGdgV8Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230822-SEA-creamy-parmesan-stock-5184256-hero-01-Qi-Ai-79d05832a3ea4dfda2f30ddb98ab6dc3.jpg",
  "tags": [
    "Parmesan",
    "The Latest"
  ],
  "title": "Creamy Parmesan Stock",
  "full_text": "Creamy Parmesan Stock\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nCooling Time\n15 mins\nTotal\n55 mins\nServes\n4 servings\nMakes\n4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n9\nounces\n(\n255\ng\n)\nParmesan\nrind scraps (about 1 1/2- by 3 1/2-inch pieces)\n6\ncups\n(\n1.5\nL\n)\nwater\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\nDirections\nUsing a paring knife or vegetable peeler, scrape away and remove any mold residue or excess cheese from the Parmesan rinds. Place rinds in a fine-mesh strainer and rinse under cool water for 30 seconds.\nSerious Eats / Qi Ai\nIn a 3-quart saucier or large saucepan, combine rinds with water and salt and bring to simmer over medium heat. Reduce heat to maintain gentle simmer and cook for 30 minutes, stirring occasionally with a wooden spoon to ensure that rinds don’t stick to bottom of the saucepan.\nSerious Eats / Qi Ai\nWhile Parmesan mixture simmers, set up a tall and narrow vessel suitable (about 6 cup vessel) for an immersion blender. Set up an immersion blender and set aside until ready to use (see notes). Place a fine mesh strainer covered with cheesecloth over a heatproof bowl and set aside until ready to use. (Once the rinds are softened, the blending process must happen quickly or the rinds will begin to harden again. That is why setting up the immersion blender is imperative.)\nSerious Eats / Qi Ai\nWorking quickly while the Parmesan mixture is still very hot, remove from heat and transfer mixture to prepared vessel. Using the immersion blender, pulse, starting at low speed and gradually increasing to high speed, until liquid is creamy and Parmesan rinds are broken down into coarse-breadcrumb-size pieces, 1 to 2 minutes. Strain stock through prepared fine-mesh strainer. Let cool to room temperature, then transfer to an airtight container and refrigerate or freeze until ready to use.\nSerious Eats / Qi Ai\nSpecial Equipment\nFine-mesh strainer, 3-quart saucier or large saucepan,\nimmersion\nor\ncountertop blender\n.\nNotes\nA countertop blender may be used, but it is essential to clean the blender immediately before the cheese hardens on the blades.\nMake-Ahead and Storage\nParmesan stock can be refrigerated in an airtight container for up to 5 days and frozen for up to 3 months.\nParmesan\nThe Latest"
}