{
  "url": "https://www.seriouseats.com/creamy-chanterelle-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/g0M7hEFKiz29cEWb9kN1f2fgODs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__01__20140130-chanterelle-soup-29-3a4a94013ef448a487108f43b2bd916e.jpg",
  "tags": [
    "Soups",
    "Chanterelle Mushrooms",
    "Winter Mains"
  ],
  "title": "Creamy Chanterelle Mushroom Soup Recipe",
  "full_text": "Creamy Chanterelle Mushroom Soup Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n75 mins\nActive\n15 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nchanterelle mushrooms\n, cleaned and trimmed, trimmings reserved (see note)\n1 1/2\nquarts\nlow-sodium\nhomemade or store bought\nchicken broth\n7\ntablespoons\nbutter\n, divided\n1 1/2\nmedium\nshallots\n, thinly sliced (about\n1\ncup\n), plus\n1/2\nshallot\nminced (about\n2\ntablespoons\n)\n3\nmedium cloves\ngarlic\n, thinly sliced (about\n1\ntablespoon\n)\n1\ntablespoon\nflour\n1\ncup\ndry sherry\nor\nwhite wine\n2\nbay leaves\n6\nthyme\nsprigs\n, plus\n1/2\nteaspoon\npicked\nthyme leaves\nKosher salt\nand\nfreshly ground black pepper\n1\ntablespoon\nvegetable oil\nDirections\nSet 1/2 cup mushrooms aside for garnish. Place mushroom trimming in a medium saucepan. Add chicken stock and bring to a boil. Reduce to a sub-simmer and keep warm.\nMelt 2 tablespoons butter in a medium saucepan over medium heat. Add shallots and garlic and cook, stirring frequently, until very soft but not browned, about 8 minutes. Add mushrooms (except for garnish) to pot and cook, stirring frequently, until excess liquid evaporates and mushrooms start to sizzle, about 10 minutes.\nSerious Eats / J. Kenji López-Alt\nAdd flour and stir to incorporate. Cook for 30 seconds. Add sherry or white wine and cook, stirring constantly and scraping bottom of pan, until thick and syrupy, about 1 minute. Place a fine-mesh strainer over the soup and pour the mushroom-infused broth through it. Discard mushroom scraps. Add bay leaves and thyme sprigs. Bring soup to a simmer and adjust heat to maintain a bare bubble. Let simmer for 30 minutes.\nSerious Eats / J. Kenji López-Alt\nDiscard bay leaves and thyme and transfer soup to a blender. Close blender and blend, starting on low speed and slowly getting faster. Once blender is at full speed, add 4 tablespoons butter, one tablespoon at a time, until fully incorporated. Continue blending until completely smooth. Rinse out pot and pour soup back into it through a fine-mesh strainer. Season to taste with salt and pepper.\nSerious Eats / J. Kenji López-Alt\nTo serve, heat oil in a medium saucepan over high heat until lightly smoking. Add reserved mushrooms and cook, tossing continuously, until browned, about 2 minutes. Add minced shallots and thyme sprigs and toss until fragrant, about 15 seconds. Add 2 tablespoons water and the remaining tablespoon of butter. Remove from heat and season with salt and pepper.\nSerious Eats / J. Kenji López-Alt\nLadle soup into warm bowls and top with sautéed mushroom mixture. Serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nBlender\nNotes\nThis recipe will work with any mushroom. To trim chanterelles, scrape the sides of the stems with a sharp paring knife, then cut off the very bottom portion of the stem. Reserve trimmings. Split larger mushrooms in halves or quarters.\nRead More\nHow to Make Creamy Vegetable Soups Without a Recipe\nThe Comprehensive Mushroom Shopping Guide\nQuick and Easy Creamy Mushroom Soup Recipe\nVegan Cream of Mushroom Soup With Crispy Shiitake Chips Recipe\nCreamy Pasta With Mushrooms (Pasta ai Funghi) Recipe\nSoups\nChanterelle Mushrooms\nWinter Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/creamy-chanterelle-mushroom-soup-recipe.webp?"
}