{
  "url": "https://www.seriouseats.com/creamy-tortellini-soup-recipe-8752811",
  "image_url": "https://www.seriouseats.com/thmb/FB2uvZ_ATyZMQphNa50M4xf_H0o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241126CreamyTortelliniUpVoteSoup-AmandaSuarez-00_hedenote-5fe2d12984c84fe6b5b76e0f88925328.jpg",
  "tags": [
    "Soups",
    "The Latest"
  ],
  "title": "Creamy Tortellini \"Upvote\" Soup",
  "full_text": "Creamy Tortellini \"Upvote\" Soup\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nTotal\n45 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1 1/2\npounds\nmild or\nspicy Italian sausage\n, removed from casing\n1\nmedium\nonion\n(8 ounces; 227g), finely chopped\n3\nmedium\ncloves garlic\n(1/2 ounce; 15g), finely chopped\n3\nmedium\ncelery ribs\n(about 5 3/4 ounces; 165g) with leaves, finely chopped\n1\nlarge\ncarrot\n(about 2 3/4 ounces; 75g), finely chopped\n1\nmedium\nfennel bulb\n(\n8\nounces\n;\n226\ng\n), finely chopped\n1 1/2\nteaspoons\nfennel seeds\n1/4\nteaspoon\ncrushed red pepper flakes\n(optional)\n1/4\ncup\ntomato paste\n(\n3 1/2\nounces\n;\n100\ng\n)\n1/4\ncup\nall-purpose flour\n(about\n1\nounce\n;\n32\ng\n)\n6\ncups\n(1.4L)\nhomemade chicken or vegetable stock\nor store-bought low-sodium broth\n4\nounces\nlacinato or curly kale\nor other hardy greens, such as collards or Swiss chard (about\n113\ng\n;\n2\ncups\n)\n1\ncup\n(\n240\nml\n)\nheavy cream\n6\nounces\n(\n170\ng\n) fresh or frozen\ncheese tortellini\nPesto\n,\nhomemade\nor store-bought, for serving (optional)\nGrated Parmigiano-Reggiano\n, for serving (optional)\nDirections\nIn a 5-quart soup pot or Dutch oven, heat olive oil over medium heat until shimmering. Add sausage and cook, stirring to break up the meat and scraping bottom of pot, until well browned, 6 to 8 minutes. Using a slotted spoon, remove sausage from pot; set aside. If meat has rendered an excessive amount of fat, use a metal or other heat-safe spoon to ladle most of it out, leaving 2 to 3 tablespoons in the pot. (If, conversely, you have less than about 2 tablespoons of fat left, add extra olive oil.) Add onion, garlic, celery, carrot, fennel, fennel seeds, and crushed red pepper flakes (if using), and cook, stirring and scraping bottom of pot, until vegetables are softened and release some moisture, about 8 minutes.\nSerious Eat / Amanda Suarez\nAdd tomato paste, stirring to coat vegetables evenly, and cook until paste is a dark red, about 3 minutes. Sprinkle flour over vegetables and cook, stirring frequently, until evenly coated and flour begins to stick to bottom, about 2 minutes.\nSerious Eat / Amanda Suarez\nSlowly pour in stock or broth, stirring until flour is fully incorporated. Bring to a boil over medium-high heat. Add kale and return sausage to soup; reduce heat to a simmer until kale is tender and flavors meld, 8 to 10 minutes.\nSerious Eat / Amanda Suarez\nMeanwhile: Bring a medium saucepan of salted water to a boil. Add tortellini and cook, stirring, until just shy of al dente, about 2 minutes less than package instructions. Using a colander, drain tortellini; set aside.\nRemove soup from heat. Add heavy cream gradually, stirring to combine, followed by the tortellini. Season to taste with salt and pepper as needed.\nSerious Eat / Amanda Suarez\nDivide into bowls and top with pesto and Parmigiano-Reggiano, if using. Serve immediately to prevent tortellini from overcooking.\nSerious Eat / Amanda Suarez\nSpecial Equipment\n5-quart soup pot or Dutch oven, medium saucepan, colander\nMake-Ahead and Storage\nThe soup can be made through step 3 and refrigerated in an airtight container for up to 5 days or frozen for up to 1 month. Thaw overnight in the fridge if frozen, then reheat over medium-high heat until simmering before proceeding with step 4.\nLeftovers can be refrigerated in an airtight container for up to 4 days (use a slotted spoon to remove cooked tortellini and store in a separate airtight container to prevent it from absorbing too much liquid). Gently reheat soup in a pot over medium-low heat until warmed through and return tortellini to soup. Simmer until tortellini is warm, about 3 minutes.\nSoups\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/creamy-tortellini-upvote-soup.webp?"
}