{
  "url": "https://www.seriouseats.com/creamed-shishitos",
  "image_url": null,
  "tags": [
    "Shishito Pepper",
    "Stovetop Vegetables",
    "Heavy Cream",
    "Vegetable Sides",
    "Easter Side Dishes"
  ],
  "title": "Creamed Shishito Peppers",
  "full_text": "Creamed Shishito Peppers\nJump to recipe\nCook\n20 mins\nTotal\n20 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n8\nounces\n(\n225 to 285\ng\n)\nshishito peppers\n, stemmed and thinly sliced into rounds (yielding about\n3\ncups\n;\n200\ng\nsliced peppers)\n2\nmedium\nshallots\n(\n80\ng\n), thinly sliced\n2\ngarlic cloves\n(\n10\ng\n), thinly sliced\nKosher salt\nand freshly\nground black pepper\n1\ncup\n(\n240\nml\n)\nheavy cream\n1\nounce\n(\n30\ng\n) grated\nParmigiano-Reggiano\nPinch\nfreshly ground or\ngrated nutmeg\nDirections\nIn a 10-inch skillet or 3-quart saucier, heat oil over medium heat until shimmering. Add shishitos, shallots, and garlic, season with salt and pepper, and cook, stirring frequently with a rubber spatula, until vegetables are softened but not browned and shishitos are still bright green, 5 to 7 minutes.\nAdd heavy cream, season lightly with salt, and bring to a rapid simmer. Continue to cook, adjusting heat as necessary to maintain a rapid simmer, stirring frequently to keep vegetables from sticking and cream from scorching on the sides of the pan, until cream is reduced to a saucy consistency, 5 to 7 minutes.\nRemove from heat, add grated cheese and nutmeg, and season with salt and pepper to taste. Serve right away, or cool and refrigerate in an airtight container for future use.\nSpecial Equipment\n10-inch skillet\nor\n3-quart saucier\nMake-Ahead and Storage\nCreamed shishitos can be refrigerated in an airtight container for up to 5 days. Gently reheat on the stovetop or in the microwave, adding a little cream as needed to achieve the proper consistency.\nRead More\nButter-Basted Steak With Creamed Shishitos and Tomatoes Recipe\nGrilled Skewered Shishito Peppers With Teriyaki Glaze Recipe\nThe Food Lab's Creamed Spinach Recipe\nCreamed Leeks Recipe\nShishito Pepper\nStovetop Vegetables\nHeavy Cream\nVegetable Sides\nEaster Side Dishes"
}