{
  "url": "https://www.seriouseats.com/creamy-cole-slaw",
  "image_url": null,
  "tags": [
    "Coleslaw",
    "Labor Day",
    "Cabbage",
    "Vegetable Sides",
    "Memorial Day"
  ],
  "title": "Classic Coleslaw",
  "full_text": "Classic Coleslaw\nJump to recipe\nPrep\n30 mins\nCook\n0 mins\nActive\n30 mins\nSalting Time\n5 mins\nTotal\n35 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Slaw Mix:\n1\nlarge\nhead\ngreen cabbage\n, about\n3 1/2\npounds\n, finely shredded on a mandoline or by hand (see notes)\n1\nlarge\nred onion\n, finely sliced on a mandoline or by hand\n1\nlarge\ncarrot\n, peeled and grated on the large holes of a box grater (see notes)\n1/4\ncup\nroughly chopped\nfresh parsley\nleaves\n1\ncup\nwhite sugar\n1/2\ncup\nkosher salt\nFor the Dressing:\n3/4\ncup\nmayonnaise\n1/4\ncup\napple cider vinegar\n2\ntablespoons\nDijon mustard\n1\ntablespoon\nfreshly\nground black pepper\n3\ntablespoons\nsugar\nDirections\nFor the Slaw Mix:\nCombine cabbage, onion, carrot, and parsley in a large bowl, leaving plenty of room to toss (you may have to use 2 large bowls if your bowls are not large enough). Sprinkle with sugar and salt and toss to combine. Let rest 5 minutes, then transfer to a large colander and rinse thoroughly under cold running water.\nSerious Eats / J. Kenji López-Alt\nTransfer rinsed mixture to a salad spinner and spin dry. Alternatively, transfer to a large rimmed baking sheet lined with a triple layer of paper towels or a clean kitchen towel and blot mixture dry with more paper towels. Return to large bowl and set aside.\nSerious Eats / J. Kenji López-Alt\nFor the Dressing:\nCombine mayonnaise, vinegar, mustard, black pepper, and sugar in a medium bowl and whisk until homogenous.\nSerious Eats / J. Kenji López-Alt\nPour dressing over cabbage mixture and toss to coat. Taste and adjust seasoning with more salt, pepper, sugar, and/or vinegar if desired.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nMandoline\n(see notes)\nNotes\nThis recipe is easiest to produce with a mandoline-style slicer, though you can also finely shred the cabbage by hand. To slice cabbages on a mandoline, split the head in half, cut out the core using the tip of a sharp chef's knife, then quarter the cabbage and slice it with the mandoline set to 1/16 of an inch.\nWhen grating the carrot, make sure to hold at a steep vertical bias so that the shreds are long instead of short.\nRead More\nSuper-Simple Tangy Buttermilk Coleslaw Recipe\nColeslaw With Creamy Chili Vinaigrette\nHot Slaw Dogs\nColeslaw\nLabor Day\nCabbage\nVegetable Sides\nMemorial Day"
}