{
  "url": "https://www.seriouseats.com/creamy-vegan-saag-paneer-tofu-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uYP4_8CKFr6ecg9EnTPquGPDbGY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160330-vegan-saag-paneer-tofu-cauliflower-recipe-16-8639ec7d04f44152ad31a5fb8e5057c3.jpg",
  "tags": [
    "Spinach",
    "Indian",
    "Vegetarian Mains",
    "Paneer",
    "Tofu"
  ],
  "title": "Creamy Vegan Saag Paneer (With Tofu) Recipe",
  "full_text": "Creamy Vegan Saag Paneer (With Tofu) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n40 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(\n350\ng\n)\nextra-firm tofu\n1\ntablespoon\n(\n15\ng\n) yellow\nmiso paste\n3\ntablespoons\n(\n45\nml\n)\nlemon juice\n, divided, plus\n1\ntablespoon\n(\n5\ng\n)\nzest\n, from\n2 to 3\nlemons\n3\ntablespoons\n(\n45\nml\n)\nvegetable oil\n, divided\nKosher salt\nand freshly ground black pepper\n6\nounces\nalmond, soy, rice, or\ncashew milk\n(\n2/3\ncup\n;\n170\nml\n)\n6\nounces\ncauliflower florets\nor peeled sunchokes (\n170\ng\n; about\n1/3\nof a small\nhead\nof\ncauliflower\n)\n4\nmedium\ncloves\ngarlic\n(about\n20\ng\n), finely minced\n1\n(1-inch) knob\nginger\n(about\n20\ng\n), peeled and finely minced\n1 to 4\ngreen or red\nThai chiles\n(depending on your heat preference), stemmed and finely minced\n1\nteaspoon\nground coriander seeds\n1\nteaspoon\nground cumin seeds\n1\nteaspoon\nground turmeric\n1\ncardamom\npod\n, smashed\n8\nounces\n(\n225\ng\n)\nmature spinach\n, curly if available (see note)\n8\nounces\n(\n225\ng\n)\narugula\nor mustard greens, tough mustard green stems removed and discarded (see note)\nDirections\nFor the Tofu \"Paneer\":\nAdjust oven rack to center position and preheat oven to 375°F (190°C). Press tofu firmly between paper towels to remove excess moisture. Cut into 1 1/2–inch cubes and set aside. In a medium bowl, whisk together miso paste, 2 tablespoons (30ml) lemon juice, lemon zest, and 1 tablespoon (15ml) oil. Season generously with salt and pepper. Add tofu and toss to coat. Spread tofu evenly over a foil-lined rimmed baking sheet. Place in oven and bake until golden brown, about 20 minutes. Sauce may darken a little against the foil; this is fine. Set tofu aside.\nSerious Eats / J. Kenji López-Alt\nMeanwhile, for the Cauliflower Purée:\nCombine nut milk and cauliflower in a small saucepan. Season with salt and bring to a simmer. Cook until cauliflower is tender, about 10 minutes. Purée mixture using a hand blender or countertop blender. Set aside.\nSerious Eats / J. Kenji López-Alt\nFor the Spinach:\nHeat remaining 2 tablespoons (30ml) vegetable oil in a large saucepan or saucier over medium heat until shimmering. Add garlic, ginger, and chiles and cook, stirring, until fragrant and lightly browned, about 1 minute. Add coriander, cumin, turmeric, and cardamom pod and cook, stirring, until fragrant, about 30 seconds. Add spinach and arugula or mustard greens one handful at a time, stirring and adding more as the greens wilt (see note).\nReduce heat to low and cook, stirring occasionally, until greens are fully wilted, about 5 minutes. Stir in cauliflower purée and continue to cook until greens are very tender, about 5 minutes longer. Stir in tofu cubes and heat through. Stir in remaining lemon juice, season with salt, adjust consistency with a little water if necessary, and serve.\nSpecial Equipment\nCountertop blender\nor\nimmersion blender\n,\nrimmed baking sheet\nNotes\nMature curly spinach works best for this dish, as it has a more robust flavor and more tender texture when braised. Flat-leaf spinach will do. Avoid baby spinach, which turns mushy when cooked. If you can't find mature fresh spinach, you can also use frozen spinach: Defrost and drain it well, then add it all at once in Step 3, rather than a handful at a time. If you prefer, you can use 100% spinach instead of a combination of spinach and arugula or mustard greens.\nRead More\nSarson Ka Saag\nPalak Paneer\nGrilled Naan\nSpinach\nIndian\nVegetarian Mains\nPaneer\nTofu"
}