{
  "url": "https://www.seriouseats.com/cream-cheese-buttercream-recipe",
  "image_url": null,
  "tags": [
    "Cakes",
    "Dairy Milk"
  ],
  "title": "Cream Cheese Buttercream Frosting Recipe",
  "full_text": "Cream Cheese Buttercream Frosting Recipe\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nActive\n45 mins\nChilling Time\n60 mins\nTotal\n110 mins\nServes\n48 servings\nMakes\n6 heaping cups\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\nmilk\n, any percentage will do (about\n1 1/2\ncups\n;\n340\ng\n)\n1\nvanilla bean\n, split lengthwise\n8\nounces\nsugar\n(about\n1\ncup\nplus\n2\ntablespoons\n;\n225\ng\n)\n1 1/2\nounces\ncornstarch\n(about\n1/3\ncup\n, spooned;\n45\ng\n)\n3\nlarge\neggs\n, straight from the fridge\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\n16\nounces\nfull-fat Philadelphia cream cheese\n, softened to about 65°F/18°C (\n2\neight-ounce packages\n;\n455 g\n)\n12\nounces\nunsalted butter\n, softened to about 65°F/18°C (\n3\nsticks\n;\n340\ng\n)\n1\nounce\nfreshly squeezed lemon juice\n(about\n2\ntablespoons\n;\n30\ng\n)\nDirections\nFor the Custard:\nIn a 3-quart stainless steel saucier, combine the milk and vanilla bean and bring to a simmer over medium heat. When it begins to bubble, shut off the heat, cover, and steep 30 minutes. Alternatively, cover and refrigerate until needed, up to 24 hours to extract the deepest vanilla flavor. Meanwhile, whisk the sugar and cornstarch together in a medium bowl, followed by the eggs.\nReturn milk to a simmer and discard vanilla bean after scraping out the flavorful pulp inside. Ladle 1/2 cup hot milk into the eggs and whisk to combine. Repeat with a second and third ladleful, then pour the warmed eggs into the pot. Cook over medium heat, whisking constantly, until the custard turns thick and lumpy, about 3 minutes. After it begins to bubble sluggishly, continue cooking and whisking 2 full minutes to neutralize a starch-dissolving protein found in the yolks, and until the custard is smooth.\nOff heat, stir in vanilla extract, then pour custard into a large baking dish to speed the cooling process. Press a sheet of plastic against the surface and refrigerate until thick and cool, about 1 hour, or to roughly 68°F (20°C). Alternatively, refrigerate up to 1 week and stand at room temperature until warmed to roughly 68°F.\nFor the Buttercream:\nIn the bowl of a stand mixer fitted with a paddle attachment, beat the softened cream cheese and butter on medium speed until fluffy and light, about 5 minutes. Meanwhile, stir the thick pudding in its dish to create a thick, dough-like mass. Scrape the bowl and beater with a flexible spatula, then switch to whisk attachment and whip on medium speed. Add pudding a few tablespoons at a time, then drizzle in the lemon juice; if you like, season to taste with a pinch of salt (see note). Scrape the bowl once more and whip a few seconds to ensure no lumps remain. The buttercream should be light and creamy, but thick enough to hang upside down from a spoon.\nUse buttercream immediately, or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to approximately 72°F (22°C) and re-whip before using.\nIf the buttercream seems stiff or dense (feeling greasy rather than melting on your tongue), scoop a cup into a small bowl and microwave until completely melted, about 30 seconds. Return melted buttercream to the bowl and whip 15 seconds on medium-high. Conversely, if it seems loose or gooey, refrigerate the entire bowl 15 minutes, then whip 3 minutes on medium-high. Despite its different formulation, problems with this buttercream can be diagnosed and solved according to this guide for\nfixing Swiss meringue buttercream\n.\nSpecial equipment\nStand mixer\n, flexible spatula, whisk,\n3-quart stainless steel saucier\nNotes\nThe natural sodium content found in cream cheese will season the frosting quite nicely, but feel free to whip in an additional pinch of salt if you find the buttercream too sweet.\nMake-Ahead and Storage\nThe cream cheese buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to approximately 72°F (22°C) and re-whip before using.\nThis Recipe Appears In\nHow to Make a Showstopping Carrot Cake\nCakes\nDairy Milk"
}