{
  "url": "https://www.seriouseats.com/creamy-bean-dip-roasted-tomato-salad-recipe-11729700",
  "image_url": "https://www.seriouseats.com/thmb/LHkhsoJ7tfaLrr35ylAu_-KpleU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__05__20200511-White-Bean-Dip-Puttanesca-Tomato-Salad-sasha-marx-83e5ebd6fcec471dad8991fd4342909b.jpg",
  "tags": [
    "White Beans",
    "Recipes",
    "Dips",
    "Snacks & Appetizers",
    "Beans"
  ],
  "title": "This Easy, Creamy Bean Dip Is the Ultimate Snack",
  "full_text": "This Easy, Creamy Bean Dip Is the Ultimate Snack\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nCooling and Resting Time\n20 mins\nTotal\n55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Tomato Salad:\n1\npound\ncherry tomatoes\n(about\n1\npint\n;\n450\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\n1/2\nounce\nflat-leaf parsley leaves\n(\n1\nloosely packed\ncup\n;\n15\ng\n), roughly chopped\n1/4\ncup\n(\n50\ng\n)\npitted black olives\n, such as Niçoise, Taggiasca, or Kalamata\n1\noil-packed anchovy\nfillet\n(\n5\ng\n), minced (optional)\nPinch\nred pepper flakes\n, gochugaru (Korean chile powder), or Aleppo pepper\nFor the White Bean Dip:\n1\ntablespoon\nplus\n1\nteaspoon\n(\n20\nml\n)\nfresh lemon juice\nfrom\n1\nwhole\nlemon\n1\nmedium\ngarlic clove\n(\n5\ng\n)\n2\ncups\n(\n425\ng\n)\ncooked dry white beans\n, drained, or\n1\n(15-ounce; 425 g) can\nlow-sodium white beans, drained and rinsed\n(see note)\n1\ntablespoon\n(\n15\nml\n)\nbean cooking liquid\n, from a\npot of beans cooked from dry\n, plus more as needed (see note if using canned beans)\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\nFor Serving:\n1\nloaf\nrustic\nsourdough bread\n, thickly sliced, drizzled with olive oil, and broiled until heavily toasted or warmed pita bread\nDirections\nFor the Tomato Salad:\nAdjust oven rack to middle position and preheat oven to 425°F (220°C). In a 10-inch stainless steel skillet or on a small rimmed eighth- or quarter-sheet pan, combine tomatoes with olive oil, season lightly with salt and pepper, and shake pan to evenly coat tomatoes with oil. Transfer to oven and roast until tomato skins just begin to shrivel and split, 20 to 25 minutes. Set aside to cool for at least 10 minutes.\nTransfer tomatoes and all of the juices that accumulated in the baking sheet (or skillet) to a medium bowl with parsley, olives, anchovy, and red pepper flakes. Using a spoon, gently stir to combine, season to taste with salt and pepper, and set aside (salad can be covered and left out at room temperature for up to 2 hours, or refrigerated in an airtight container for up to 2 days).\nFor the White Bean Dip:\nWhile the tomatoes are roasting, place lemon juice in a small bowl. Using a Microplane, finely grate the garlic and immediately add to the lemon juice (alternatively, you can use a garlic press or finely mince the garlic with a knife). Set aside for 10 minutes.\nIn the bowl of a food processor, combine beans, bean cooking liquid, and garlic-lemon juice mixture. Process beans, scraping down sides of food processor bowl as needed with a rubber spatula, into a mostly smooth paste, about 1 minute. With food processor running, slowly stream in olive oil, and continue to process until mixture is very smooth, about 3 minutes longer. Season with salt and pepper to taste and adjust consistency with additional bean cooking liquid if necessary. Bean dip can be served right away or refrigerated in an airtight container for up to 1 week.\nFor Serving:\nTransfer bean dip to large, wide serving bowl and use back of large spoon to spread bean dip up sides of bowl, leaving well at center. Spoon tomato salad in center of well. Serve with bread.\nSpecial Equipment\nRimmed quarter baking sheet or 10-inch stainless steel skillet,\nfood processor\nNotes\nCooked dried beans (and their cooking liquid) have much better flavor and texture than canned beans, so we highly recommend using them in this recipe, if possible.\nIf using canned beans, substitute bean cooking liquid with 1 tablespoon (15ml) hot water, adding more as needed to achieve the desired consistency. Canned beans won't purée as smoothly as cooked dried beans, but using hot water helps achieve a smoother texture.\nMake-Ahead and Storage\nThe white bean dip can be refrigerated in an airtight container for up to 1 week. The tomato salad can be refrigerated in an airtight container for up to 2 days. Bring both to room temperature before serving.\nWhite Beans\nRecipes\nDips\nSnacks & Appetizers\nBeans",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-easy-creamy-bean-dip-is-the-ultimate-snack.webp?"
}