{
  "url": "https://www.seriouseats.com/cream-puffs",
  "image_url": "https://www.seriouseats.com/thmb/Uxg9gCPsrrN701cTxZV3zMK6Tbg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201210-choux-cream-puffs-vicky-wasik-16-527cbfe85c4b458cb5f9986b907dc6a3.jpg",
  "tags": [
    "Pastries",
    "French",
    "Easter Desserts"
  ],
  "title": "Cream Puffs",
  "full_text": "Cream Puffs\nClose\nJump to recipe\nPrep\n30 mins\nCook\n25 mins\nActive\n25 mins\nCooling Time\n30 mins\nTotal\n85 mins\nServes\n18 cream puffs\nCook Mode\n(Keep screen awake)\nIngredients\nOne\nrecipe\nChoux Pastry\n(made with water and optional sugar),\ntransferred to a pastry bag\nfitted with a 1/2-inch plain round tip (see note for sandwiched puffs)\nOne\nrecipe\nvanilla\n,\nchocolate\n, or\nlemon\npastry cream\n, transferred to a pastry bag fitted with a 1/4-inch plain round tip\nPowdered sugar\n, for dusting\nDirections\nTo Make the Choux Puffs:\nAdjust oven rack to middle position and preheat to 400°F (204°C). Line two aluminum half-sheet trays with parchment paper. Pipe a small amount of choux paste under each corner of parchment paper (the dough acts as a glue and keeps the paper in place as you pipe).\nSerious Eats / Vicky Wasik\nTo pipe the puffs, hold the filled pastry bag at a 90° angle, apply steady downward pressure, and pipe a 2-inch wide puff onto a tray. To stop piping, cease applying pressure and swirl the pastry tip away. Continue to pipe puffs about 3 inches apart, for a total of 9 puffs. Repeat with the second tray. To smooth the surface of any uneven puffs, dip a finger into cold water and gently pat down any bumps. If using, dust puffs evenly with powdered sugar.\nSerious Eats / Vicky Wasik\nBake both trays until choux is puffed, golden brown, and hollow feeling, about 25 minutes.\nSerious Eats / Vicky Wasik\nWorking quickly while puffs are still hot, gently insert the tip of a paring knife into the underside of each puff and rotate in a circular motion to create a small hole, about 1/4-inch in size.\nSerious Eats / Vicky Wasik\nReturn puffs to trays and place in the turned-off oven with the door partially open for 30 minutes.\nSerious Eats / Vicky Wasik\nTo Fill Piped-In Cream Puffs:\nWorking one at a time, insert tip of pastry cream–filled bag into hole in each choux puff and begin piping with steady pressure until filled (you can tell because the puff will feel heavy and pastry cream will start to overflow the hole). Wipe away any excess pastry cream. Repeat until all cream puffs are filled. Serve immediately.\nSerious Eats / Vicky Wasik\nAlternatively, to Fill Sandwich-Style Puffs:\nUsing a serrated knife, slice each puff in half to create a top and bottom \"bun.” Transfer your choice of filling (see notes section below for filling instructions) to a pastry bag fitted with a 1/2-closed star tip. Working one at a time, begin piping with steady pressure to generously fill the bottom half of each puff. Cover with the top half of each puff. Repeat until all cream puffs are filled. Serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel saucier\n,\nstand mixer\n,\ndisposable pastry bags\nNotes\nIf you want to make sure that each puff is the right size, you can prepare a template ahead of time. Take one sheet of parchment paper and, using a 2-inch round cutter as a guide, trace 9 circles that are 3 inches apart. Flip paper upside down and set it on the baking sheet. Repeat with a second piece of parchment paper.\nFor Sandwich-Style Puffs\nIf you're making sandwich-style puffs, you'll need a greater volume of filling than this recipe provides. There are several ways to arrive at the right amount:\nPastry cream:\nMake a double batch of any of the pastry cream recipes (or make a batch each of different flavors.\nWhipped cream:\nIn a large mixing bowl or in the bowl of a stand mixer fitted with the whisk attachment, combine 2 cups heavy cream, sugar to taste, and a splash of vanilla extract. Whisk by hand or mix at medium speed until thick peaks form (peaks should not be loose or stiff in structure).\nCrème légère:\nMake a single batch of\ncrème légère.\nMake-Ahead and Storage\nFilled cream puffs are best consumed on the day they’re made.\nTo store unfilled cream puffs, wrap them tightly in plastic and place in an airtight container; they can be kept frozen for up to 1 month. To refresh puffs, preheat oven to 350°F (177°C). Transfer frozen puffs to a sheet tray and reheat until crisp, about 5 minutes. Let cool at room temperature before filling.\nPastries\nFrench\nEaster Desserts"
}