{
  "url": "https://www.seriouseats.com/creamy-irish-style-oatmeal-with-brown-sugar",
  "image_url": "https://www.seriouseats.com/thmb/UxYrjRzmmpmYihsf8NfOC1R6_WU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__02__20190214-how-to-cook-oatmeal-vicky-wasik-6-5148ed2770c6486ba21c53456d9dfde1.jpg",
  "tags": [
    "Oatmeal",
    "Irish",
    "Easter",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Creamy Irish-Style Oatmeal With Brown Sugar Recipe",
  "full_text": "Creamy Irish-Style Oatmeal With Brown Sugar Recipe\nClose\nJump to recipe\nCook\n30 mins\nActive\n25 mins\nTotal\n30 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n6 1/3\nounces\n;\n180\ng\n)\nsteel-cut oats\n(also sold as pinhead or Irish oats; see note), such as Bob's Red Mill\n3\ncups\n(\n700\nml\n) cold\nwater\nor\nwhole milk\n(or some combination thereof), plus more water if needed (see note)\nKosher\nor\nsea salt\nUnsalted butter\nor\ncream\n, for serving (optional)\nBrown sugar\n, for serving\n(see note)\nDirections\nIf you prefer a deeper, more complex flavor, dry-toast the oats in the cooking pot over high heat, stirring and tossing constantly, until lightly toasted and fragrant, then remove from heat and proceed.\nIf making overnight oats, combine oats and water/milk in a medium saucepan or 3-quart saucier and let stand, covered, overnight (if using milk, let the oats soak in the refrigerator overnight). If not making overnight oats, combine oats and water/milk in the saucepan and proceed with cooking immediately.\nBring oats and water/milk to a simmer over medium-high heat, seasoning lightly with a pinch of salt. Reduce heat to maintain a gentle simmer and cook uncovered, stirring frequently but slowly, until porridge is well-thickened but still flows slightly, about 5 minutes for overnight oats and 20 minutes for un-soaked oats.\nSerious Eats / Vicky Wasik\nIf oats are still too firm to your taste, stir in additional water 1/4 cup (60ml) at a time, and continue cooking, until desired texture of oats is reached.\nScoop porridge into warmed bowls and top with a pat of butter and/or a splash of cream. Sprinkle brown sugar on top. Serve.\nSpecial Equipment\nThree-quart saucier\nNotes\nMost steel-cut oats work best with the overnight method as described here, but we have found some artisan brands that have a slightly more powdery texture; those do better if you pour off the soaking water, rinse the grains lightly, then add fresh water to cook them. If your overnight oatmeal is overly thick and starchy, you may want to try that soaking method instead.\nHow much milk you use will determine the richness and creaminess of the final porridge.\nFor a more traditional Scottish-style oatmeal, cook oats in water only and omit the brown sugar.\nRead More\nBananas Foster Oatmeal With Walnuts and Peanut Butter\nVegan Toasted Oatmeal With Maple Syrup, Cranberries, and Raspberries\nOatmeal with Cranberry Orange Hazelnut Compote\nStrawberry-Almond Baked Oatmeal\nOatmeal\nIrish\nEaster\nMother's Day\nFather's Day"
}