{
  "url": "https://www.seriouseats.com/creamy-garlic-pasta-5324331",
  "image_url": "https://www.seriouseats.com/thmb/dzMM_Rbvq8iVSUSSJKA6UuWnb8g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2022-05-10-Sho_s-The-Pasta-Amanda-Suarez-_6-c23ed7dba563476cb04912b69416e20e.jpg",
  "tags": [
    "Spaghetti, Bucatini, & Linguine",
    "American",
    "Stovetop Pasta",
    "Mains",
    "The Latest"
  ],
  "title": "Creamy Garlic Pasta",
  "full_text": "Creamy Garlic Pasta\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nTotal\n35 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nhead\nof\ngarlic cloves\n, peeled and kept whole if small, sliced in half if particularly large\n1/4\ncup\nplus\n1\ntablespoon\n(\n74\nml\n)\nextra-virgin olive oil\n1\ntablespoon\nplus\n1\nteaspoon\n(\n12\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; if using table salt, use half as much by volume or same weight\n1/2\npound\n(\n225\ng\n)\nspaghetti\n1/2\nteaspoon\nhoney\n2\nounces\n(\n57\ng\n)\nParmigiano Reggiano\n, grated, plus more for serving\nJuice\nfrom\n1\nlime\n1\nlime\n, halved, for serving\nDirections\nFill a 3-quart saucier with 3 quarts cold water, add salt, and bring to a boil over high heat.\nAmanda Suarez / Serious Eats\nWhile the water heats, combine olive oil and garlic cloves in a pasta pan or wok and place over low heat. Cook, stirring ocasionally, until garlic takes on a light golden color and cloves become meltingly soft, about 15 minutes.\nAmanda Suarez / Serious Eats\nAdd spaghetti to now-boiling water and cook until just al dente, about 1 to 2 minutes less than package instructions.\nAmanda Suarez / Serious Eats\nWhile pasta cooks, when garlic just starts to take on golden coloring, add honey to pan and stir to combine. Increase heat to medium high and cook, stirring constantly, until garlic cloves just start to lightly brown in spots, about 2 minutes. Add 1/2 cup of pasta water, increase heat to high, and bring to a boil.\nAmanda Suarez / Serious Eats\nAdd cooked pasta to pan with garlic sauce. Cook, stirring and tossing constantly, until sauce becomes creamy and emulsified, about 2-3 minutes. If the pan looks like it is becoming oily and the pasta is starting to fry at any time, add pasta water from the pasta pot a 1/4 cup at a time and cook, tossing and stirring the pasta consantly, until sauce becomes emulsified.\nAmanda Suarez / Serious Eats\nTurn off heat and add grated cheese. Toss and stir pasta until cheese melts seamlessly into the sauce. Add lime juice and toss to distribute. Season to taste with salt. Serve immediately with halved limes and more grated cheese alongside.\nAmanda Suarez / Serious Eats\nSpecial Equipment\n3-quart saucier, perfect pasta pot or wok, box grater.\nMake-Ahead and Storage\nThis dish is best served immediately.\nSpaghetti, Bucatini, & Linguine\nAmerican\nStovetop Pasta\nMains\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/creamy-garlic-pasta.webp?"
}