{
  "url": "https://www.seriouseats.com/creme-brulee-recipe-7107199",
  "image_url": "https://www.seriouseats.com/thmb/USpfCul06w7RVj3yLWW1iCZ0p6M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230208-CremeBrulee-AmandaSuarez-hero-5fa5d07a77c4474a9c1bb6165d5c402b.JPG",
  "tags": [
    "Custards, Mousses & Puddings",
    "The Latest",
    "French",
    "Desserts"
  ],
  "title": "Crème Brûlée",
  "full_text": "Crème Brûlée\nClose\nJump to recipe\nPrep\n75 mins\nCook\n45 mins\nCooling Time\n4 hrs 30 mins\nTotal\n6 hrs 30 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\n(355ml)\nheavy cream\n1 1/2\ncups\n(355ml)\nwhole milk\n1\nvanilla bean\n, split lengthwise and scraped\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n7\nlarge\negg yolks\n(98g)\n1/2\ncup\n(100g)\ngranulated sugar\nJust-boiled water\n, for the water bath\nRaw or\ngranulated sugar\n, for topping (see note)\nDirections\nIn a 3-quart saucepan, combine heavy cream, whole milk, vanilla bean and seeds, and salt. Bring to a gentle simmer over medium-low heat, then remove from heat, cover, and let stand 1 hour.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and preheat oven to 325ºF (163ºC). In a large bowl, whisk yolks with granulated sugar until smooth (do not combine the sugar and yolks until you are ready to add the dairy; if left to stand before adding the dairy, the sugar will absorb moisture from the yolks and leave behind hard, clumpy bits, something pastry chefs refer to as “burning” the yolks). Set a fine-mesh strainer over yolk mixture and pour cream mixture through; discard vanilla bean. Whisk custard base until thoroughly combined.\nSerious Eats / Amanda Suarez\nSet six 4-ounce ramekins in a 9- by 13-inch baking dish. Divide custard base evenly among the ramekins, filling them 1/4 inch from the top of the rim. (If you have a few tablespoons of extra custard, that’s okay.) Pour just-boiled—but not boiling—water (around 180º to 200ºF; 88º to 93ºC) into baking dish until it comes 2/3 of the way up the ramekins; be careful not to splash water into the ramekins as you pour. Carefully transfer baking dish to middle rack of oven and bake until custards are just set (they should jiggle slightly in the middle and register 175ºF/79ºC to 178ºF/81ºC on an instant-read thermometer inserted in the center), about 35 minutes. Remove from oven, and, using towels or silicone-coated tongs, carefully transfer ramekins to a cooling rack. Allow custards to cool to room temperature, about 1 hour. Refrigerate until set, uncovered, at least 4 hours.\nSerious Eats / Amanda Suarez\nTo finish and serve, let custards stand for 20 minutes at room temperature. Right before serving, top the surface of each custard with an even layer of raw sugar (about 2 teaspoons per ramekin), swirling the ramekins to distribute the sugar evenly. Working in a circular motion, use a butane blowtorch to pass a flame over the top of each crème brûlée, 1- to 2-inches away from the surface of the custard, until the sugar has caramelized and melted into a glossy, crackling sheet and turned golden brown (how closely and how long you should torch your custards will depend on the strength of your blowtorch; watch the sugar carefully as you pass the torch over the surface of the custard to avoid scorching your crème brûlées). Alternatively, for a broiler method, see notes.\nSerious Eats / Amanda Suarez\nCool slightly for 1 to 2 minutes, then serve immediately.\nSerious Eats / Amanda Suarez\nNotes\nThough it isn’t our recommended method, you can use your broiler to caramelize your crème brûlées if you don’t have a blowtorch. To do so, preheat your broiler, and set an oven rack 3 to 4 inches away from the flame. Top the surface of each custard with an even layer of raw sugar (about 2 teaspoons per ramekin) and broil until the sugar has melted, about 5 minutes. Keep an eye out, as broiler strength can vary quite a bit and the sugar may burn if left unattended.\nThough I liked the results of using raw sugar more, opting for granulated sugar is lower-risk given its finer grain size and less likely to overbrown compared to already-brown raw sugar.\nIf you don’t have ramekins, you can bake the custard in a single 2-quart baking dish set in a larger baking dish with a hot water bath.\nI Tested 10 Ramekins to Find the Best Ones for Soufflés, Custards, and More\nSpecial Equipment\n3-quart saucepan\n;\nwhisk\n; six 4-ounce ramekins; blowtorch (recommended)\nMake Ahead and Storage\nThe custards can be made up to 2 days ahead and refrigerated uncovered. Avoid caramelizing the sugar topping until you are ready to serve; after 20 minutes, the crisp sugar topping will soften and liquify.\nCustards, Mousses & Puddings\nThe Latest\nFrench\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crme-brle.webp?"
}