{
  "url": "https://www.seriouseats.com/creme-anglaise-recipe-7108153",
  "image_url": "https://www.seriouseats.com/thmb/ERQqyE5ZN2K-VRCSML-5f3Ra63E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220213-CremeAngalise-AmandaSuarez-hero-5a8154761676428da74a65666bda2059.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "The Latest",
    "French",
    "Desserts"
  ],
  "title": "Crème Anglaise",
  "full_text": "Crème Anglaise\nClose\nJump to recipe\nPrep\n35 mins\nCook\n15 mins\nTotal\n50 mins\nServes\n8 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\n(\n375\nml\n)\nwhole milk\n1/2\nvanilla\nbean\n, split and scraped, or\n1/4\nteaspoon\nvanilla extract\nTwo\n3- by 1-inch strips\norange zest\nfrom\n1\nlarge\norange\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use a pinch\n5\nlarge\negg yolks\n(\n75\ng\n)\n1/4\ncup\n(\n50\ng\n)\ngranulated sugar\nDirections\nIn a 2-quart saucier or saucepan, combine milk, vanilla bean and scraped seeds (or extract), orange zest (if using), and salt. Set over medium-low heat and cook, stirring frequently with a rubber spatula, until milk registers 190ºF (88ºC) on an instant-read thermometer, 3 to 5 minutes. Remove from heat, cover, and set aside to steep for 30 minutes.\nWhen the milk has steeped for 25 minutes, whisk together 1/4 cup (50g) sugar and egg yolks in a medium bowl until sugar is dissolved and mixture turns pale yellow, 2 to 3 minutes. Set a fine-mesh strainer over bowl with egg mixture, and slowly pour one-third of milk mixture into yolk mixture to temper, whisking constantly to prevent yolks from curdling. Add remaining milk mixture, whisking constantly until well-combined; set aside but don’t clean strainer; wipe out saucepan.\nStrain custard through fine-mesh strainer into now-empty saucier; you should have 2 cups of liquid. Return to stovetop; once again set aside but don’t clean strainer, and wipe out bowl. Cook over medium-low heat, stirring constantly with a rubber spatula or wooden spoon to prevent egg yolks from curdling, until mixture registers 175ºF (79.5ºC) on an instant-read thermometer and thickens slightly so that it coats the back of a spoon, 3 to 5 minutes. Working quickly, remove from heat and pour crème anglaise through fine-mesh strainer back into now-empty bowl. Place piece of plastic wrap directly on surface of crème anglaise to prevent skin from forming, and refrigerate until ready to use.\nSpecial Equipment\n2-quart saucier,\ninstant-read thermometer\n, strainer\nMake-Ahead and Storage\nThe crème anglaise can be made up to 3 days in advance and kept refrigerated.\nCustards, Mousses & Puddings\nThe Latest\nFrench\nDesserts"
}