{
  "url": "https://www.seriouseats.com/crepe-cake-recipe-7501699",
  "image_url": "https://www.seriouseats.com/thmb/k_VskUYpARC9RfUnfjSc4B26iXU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230523-SEA-CrepeCake-RobbyLozano-03-cf98f48111f7457e8e97d291265133be.jpg",
  "tags": [
    "Dairy Milk",
    "The Latest",
    "French",
    "Desserts"
  ],
  "title": "Crêpe Cake (Gâteau de Crêpes)",
  "full_text": "Crêpe Cake (Gâteau de Crêpes)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n80 mins\nChilling Time\n6 hrs 30 mins\nTotal\n8 hrs 20 mins\nMakes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crêpes:\n6\nlarge\neggs\n(\n12\nounces\n;\n330\ng\n)\n3\ncups\n(\n720\ng\n)\nwhole milk\n1 1/2\ncups\nall-purpose flour\n(\n7\nounces\n;\n195\ng\n)\n1/3\ncup\ngranulated sugar\n(\n2.3\nounces\n;\n67\ng\n)\n5\ntablespoons\nunsalted butter\n, melted (\n2.5\nounces\n;\n70\ng\n)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Pastry Cream Filling:\n1\nvanilla bean\npod\n1\ncup\n(\n240\ng\n)\nwhole milk\n1/4\ncup\ngranulated sugar\n(\n1.75\nounces\n;\n50\ng\n)\n1 1/2\ntablespoons\ncornstarch\n(\n0.4\nounces\n;\n12\ng\n)\n3\nlarge\negg yolks\n(\n1.9\nounces\n;\n55\ng\n)\n2\ncups\n(\n475\nml\n)\nheavy whipping cream\n1/4\ncup\npowdered sugar\n, sifted (\n1\nounce\n;\n30\ng\n)\nCooking spray\n3\ntablespoons\ngranulated sugar\n(\n1.3\nounce\n,\n38\ng\n)\nDirections\nFor the Crêpe Batter\n: Place eggs, milk, flour, sugar, melted butter, and salt in a blender. Start blender on low speed and increase to high. Blend until smooth, about 1 minute. Cover blender with plastic wrap, and refrigerate for at least 2 hours or up to 24 hours. (Leaving the batter in the blender will help with portioning the batter during cooking.)\nAfter crêpe batter has chilled, line a rimmed baking sheet with parchment. Lightly stir crêpe batter to re-emulsify if needed. Lightly coat a 10.5-inch crêpe pan or 10-inch nonstick skillet with cooking spray and set over medium heat. Lift pan off heat and, holding the pan’s handle in one hand, pour 1/4 cup batter into center of pan, swirling and tilting pan immediately to spread batter in a thin, even layer over bottom of pan.\nSerious Eats / Robby Lozano\nLet cook until top looks dry, about 1 minute. Using a silicone spatula, gently loosen edges of crêpe; slide the spatula horizontally under the edge of the crêpe and quickly flip crêpe. Cook on second side until crêpe begins to turn golden brown in spots and top appears dry, about 1 minute. Slide crêpe onto prepared baking sheet. Repeat with remaining batter, coating pan lightly with cooking spray between each crêpe and placing additional parchment paper between layers of crêpes to prevent sticking as needed. (You’ll need 20 crêpes for the cake; you should have a total of 22 crêpes.) Set aside crêpes at room temperature, uncovered, until ready to assemble cake.\nSerious Eats / Robby Lozano\nFor the Pastry Cream Filling:\nIn a 2-quart saucepan, combine milk and scraped vanilla bean along with its seeds. Bring to a bare simmer over medium heat. Remove from heat, cover to prevent evaporation, and let steep for 10 minutes.\nSerious Eats / Robby Lozano\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nSerious Eats / Robby Lozano\nIn a medium heatproof mixing bowl set on top of a dampened towel (this serves as a stable base), stir together sugar and cornstarch. Whisk in egg yolks until mixture is pale, yellow, and smooth, about 1 minute. Uncover infused milk and remove vanilla bean. While whisking continuously, slowly pour milk into egg yolk mixture in a thin stream, until all of it has been added.\nSerious Eats / Robby Lozano\nReturn mixture to the same saucepan. Cook over medium heat, whisking constantly until pastry cream begins to thicken, about 5 minutes. Once it thickens, continue to whisk, pausing every few seconds to check for bubbles, about 1 minute. Pour pastry cream through a fine-mesh sieve set over the heatproof medium bowl. Immediately place plastic wrap directly on the surface of the cream to prevent a skin from forming. Transfer bowl to prepared ice bath to chill for 30 minutes, then refrigerate until cold, about 2 hours.\nSerious Eats / Robby Lozano\nOnce the pastry cream has chilled, place heavy cream and powdered sugar in the bowl of a stand mixer fitted with the whisk attachment. Whisk on medium-high speed until stiff peaks form, 2 to 3 minutes. Whisk chilled pastry cream until smooth, then gently fold whipped cream into the pastry cream in 3 additions, folding well after each addition to evenly incorporate.\nTo Assemble:\nPlace 1 crêpe on a cake stand. Using an offset spatula, spread about 3 tablespoons of the pastry cream in an even layer over the crêpe, leaving a 1/2-inch border from the edge. Top with second crêpe, and repeat process with the remaining crêpes until you lay the final crêpe on top. Loosely cover with plastic wrap until the filling has set, at least 2 hours and up to 12 hours.\nSerious Eats / Robby Lozano\nSprinkle remaining granulated sugar in an even layer over the top of the chilled cake. Working in a circular motion, use a butane blowtorch to pass a flame over the top of the cake (1 to 2 inches away from the surface) until sugar is caramelized, golden brown, and has melted into a glossy sheet. (See notes.) Slice and serve immediately.\nSerious Eats / Robby Lozano\nSpecial Equipment\nBlender, rimmed baking sheet, parchment paper, whisk, 10.5-inch crêpe pan, silicone spatula, 2-quart saucepan, fine-mesh sieve, cake stand, offset spatula, blowtorch\nNotes\nTo prepare the crêpe batter without a blender, place eggs, milk, flour, sugar, melted butter, and salt in a large mixing bowl and whisk until thoroughly combined. Cover the bowl with plastic wrap and refrigerate for at least 2 hours or up to 24 hours.\nHow closely and how long you torch the cake will depend on the strength of your blowtorch.\nDairy Milk\nThe Latest\nFrench\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crpe-cake-gteau-de-crpes.webp?"
}