{
  "url": "https://www.seriouseats.com/crepes-suzette-recipe-8729143",
  "image_url": "https://www.seriouseats.com/thmb/6UMhzYYBCl7OZFSqMn2YLI6qAHU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241016-CrepesSuzette-AmandaSuarez-30-97c0c2af9a784f298307583340d49873.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "French",
    "Orange"
  ],
  "title": "Crepes Suzette",
  "full_text": "Crepes Suzette\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nTotal\n45 mins\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Orange Sugar:\n1/4 cup plus 1 tablespoon\ngranulated sugar\n(about 2 1/4 ounces;\n65\ng\n)\n1\ntablespoon\nfinely grated\norange zest\nfrom 2 medium navel oranges\nFor the Batter:\n2\nlarge\neggs\n1 1/4\ncups\n(300ml)\nwhole milk\n1 tablespoon\nunsalted butter\n(about\n1/2\nounce\n; 14g), melted and cooled slightly\n1\nteaspoon\nvanilla extract\n1\ntablespoon\norange\nsugar\n, see above\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1 cup\nall-purpose flour\n(\n4 1/2\nounces\n; 128g)\nFor the Sauce:\n8\ntablespoons\nunsalted butter\n(4 ounces; 113g)\n1/4\ncup\norange\nsugar\n, see above\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2/3\ncup\n(160ml)\norange juice\nfrom 2 medium oranges\n3\ntablespoons\n(45ml)\norange liqueur\n, such as Cointreau or Grand Marnier\nDirections\nFor the Orange Sugar:\nIn a small bowl, combine granulated sugar with orange zest. Using your fingers, rub them together until mixture is fragrant and well combined, about 30 seconds. Set aside for 10 minutes.\nSerious Eats / Amanda Suarez\nFor the Crepe Batter:\nIn a blender, combine eggs, whole milk, vanilla extract, melted butter, 1 tablespoon of the prepared orange sugar, and salt. Blend until smooth, about 10 seconds. Add flour and 1 tablespoon of orange and sugar mixture. Start blender on low speed and gradually increase to high, and blend until smooth, about 20 seconds. (See notes for instructions on preparing the batter without a blender.)\nSerious Eats / Amanda Suarez\nTo Cook the Crepes:\nIn a 10-inch nonstick skillet or crepe pan, melt 1 tablespoon butter over medium heat, swirling to coat pan. Tip out excess butter and reserve. While holding the pan’s handle in one hand, pour in 3 to 4 tablespoons (45 to 60ml) batter into center of the pan, swirling and tilting pan immediately to spread batter into a thin, even layer.\nSerious Eats / Amanda Suarez\nLet cook until top of crepe looks dry, about 20 seconds. Using a flexible rubber spatula, gently lift one edge of crepe. Using your fingers, carefully flip crepe. Cook on second side for 10 seconds, then transfer to a large plate or rimmed baking sheet. Repeat with remaining batter. When crepes have cooled, fold into quarters by folding each crepe in half, then folding in half again. Set aside.\nSerious Eats / Amanda Suarez\nFor the Sauce:\nIn a 10-inch nonreactive skillet (such as stainless steel), melt butter over medium heat. Add remaining 1/4 cup orange sugar, salt, and orange juice, stirring to combine. Bring to a simmer, and allow sauce to cook until slightly thickened and has reduced by about 1/3, about 10 minutes. Reduce heat to low.\nSerious Eats / Amanda Suarez\nWorking with 1 crepe at a time, use tongs to gently dip both sides of folded crepe into sauce, then release into the sauce. Repeat with remaining crepes. Add orange liqueur and tilt pan to ignite alcohol from a gas burner, and cook, shaking the pan, until flames have died out and sauce thickens slightly, about 1 minute. (Alternatively, use a long-handled lighter or kitchen torch, carefully ignite sauce.) Spoon sauce over crepes and serve immediately.\nSerious Eats / Amanda Suarez\nSerious Eats / Amanda Suarez\nSpecial Equipment\nBlender, 10-inch nonstick skillet or crepe pan, flexible rubber spatula, 10-inch nonreactive skillet (such as stainless steel), long-handled lighter or kitchen torch\nNotes\nTo prepare crepe batter without a blender: In a large bowl, whisk eggs, whole milk, vanilla extract, melted butter, 1 tablespoon of orange sugar, and salt together until no streaks remain. Add flour, whisking well to combine.\nMake-Ahead and Storage\nThe crepe batter can be prepared up to 24 hours in advance and refrigerated in an airtight container. Once sauced, the crepes suzette should be eaten immediately.\nDesserts\nThe Latest\nFrench\nOrange",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crepes-suzette.webp?"
}