{
  "url": "https://www.seriouseats.com/crispy-vegan-kung-pao-tofu-recipe",
  "image_url": "https://www.seriouseats.com/thmb/L4h3lQGD7Z8lLBRSM0h4aZVuJ_M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2014__02__2021-02-12-Kung-Pao-Tofu-MHOM-14-9194c5c6b3764db8965016646554abd3.jpg",
  "tags": [
    "Tofu Stir-fry",
    "Tofu",
    "Chinese",
    "Vegan Mains",
    "Vegetarian Mains"
  ],
  "title": "Crispy Kung Pao Tofu Recipe",
  "full_text": "Crispy Kung Pao Tofu Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n45 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\nquarts\nvegetable or\npeanut oil\n1/2\ncup\nplus\n2\nteaspoons\ncornstarch\n, divided\n1/2\ncup\nall-purpose flour\n1/2\nteaspoon\nbaking powder\nKosher salt\n1/2\ncup\ncold\nwater\n1/2\ncup\nvodka\n1\npound\nextra-firm tofu\n, cut into 3/4-inch cubes, carefully dried (see notes)\n1/4\ncup\nwater\nor vegetable stock\n1\ntablespoon\nsoy sauce\n1\ntablespoon\nSichuan broad bean chili paste\n1\ntablespoon\nChinkiang vinegar\n2\nteaspoons\nsugar\n3\nscallions\n, whites finely minced, and greens finely sliced, reserved separately\n3\ncloves\nminced garlic\n(about\n1\ntablespoon\n)\n1\ntablespoon\nminced\nfresh ginger\n2\ntablespoons\nSichuan peppercorns\n, divided\n12\nhot Chinese dry chile\npeppers\n2\nsmall\nleeks\n, white and light green parts only, cut into 1/4-inch slices (about\n1/2\ncup\ntotal)\n2\nribs\ncelery\n, split in half lengthwise and cut into 3/4-inch pieces\n1\nlong\ngreen Chinese hot pepper\n, stemmed and seeded, cut into 3/4-inch squares\n1/2\ncup\nroasted peanuts\nCooked white rice\n, for serving\nDirections\nHeat oil in a wok to 350°F (177°C). Whisk together 1/2 cup cornstarch, flour, baking powder, and 1 teaspoon kosher salt. Add water and vodka and whisk until a smooth batter is formed, adding up to 2 tablespoons additional water if batter is too thick. It should have the consistency of thin paint and fall off of the whisk in thin ribbons that instantly disappear as they hit the surface of the batter in the bowl.\nSerious Eats / Melissa Hom\nAdd tofu and carefully turn to coat. Working one at a time, lift one piece and allow excess batter to drip off. Carefully lower into hot oil. Repeat with remaining tofu until wok is full. Fry, using a metal spider or slotted spatula to rotate and agitate pieces as they cook until evenly pale golden and crisp all over, about 6 minutes. Transfer to a paper towel-lined plate. Repeat until all tofu is fried. Carefully pour oil out of wok into a heatproof container and reserve.\nSerious Eats / Melissa Hom\nCombine stock, soy sauce, bean paste, vinegar, sugar, and remaining 2 teaspoons cornstarch in a small bowl. Set aside. Combine scallion whites, garlic, and ginger in a second small bowl. Set aside. Coarsely grind half of peppercorns in a mortar and pestle or spice grinder.\nSerious Eats / Melissa Hom\nSet a fine-mesh strainer over a heatproof bowl or saucepan. Return 1/4 cup of the reserved oil to wok and heat over medium-high heat until shimmering. Add remaining half of peppercorns and chiles and cook, stirring, for 5 seconds. Immediately drain through fine-mesh strainer. Pick out chiles and set aside. Discard cooked peppercorns.\nSerious Eats / Melissa Hom\nReturn infused oil to wok and heat over high heat until lightly smoking. Add leeks, celery, and long pepper and cook, stirring and tossing, until vegetables are lightly charred and tender-crisp, about 1 1/2 minutes. Clear a space in the center of the wok and add the scallion/ginger/garlic mixture. Cook, stirring, until fragrant, about 30 seconds. Add peanuts, dried chiles, and drained tofu. Stir sauce mixture and add to wok. Cook, tossing and folding ingredients together until tofu is fully coated. Add scallion greens and ground peppercorns and toss to combine. Serve immediately with white rice.\nSerious Eats / Melissa Hom\nSpecial Equipment\nWok\n,\nfine-mesh strainer\nNotes\nTo dry tofu, line a rimmed baking sheet with paper towels. Place tofu slices on top in a single layer. Cover with another layer of paper towels and press gently to remove excess moisture.\nTofu Stir-fry\nTofu\nChinese\nVegan Mains\nVegetarian Mains"
}