{
  "url": "https://www.seriouseats.com/crispy-pork-hash-recipe-11739886",
  "image_url": "https://www.seriouseats.com/thmb/B1AXKu9OMz8nW2l3JBSdQCgf_Hg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__06__20200614-pork-shoulder-hash-sasha-marx-0f199ab4f7d54ab1acd359d192a70b44.jpg",
  "tags": [
    "Pork Shoulder",
    "Recipes",
    "Pork",
    "Asparagus"
  ],
  "title": "The Best Way to Use Up Leftover Pork Is This Easy One-Pan Meal",
  "full_text": "The Best Way to Use Up Leftover Pork Is This Easy One-Pan Meal\nClose\nJump to recipe\nPrep\n5 mins\nCook\n55 mins\nTotal\n60 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Hash:\n1 1/2\npounds\n(\n675\ng\n)\nYukon gold\nor russet\npotatoes\n, cut into 3/4-inch dice (see note)\n2\ntablespoons\n(\n30\nml\n) distilled\nwhite vinegar\nKosher salt\nand freshly ground black pepper\n10\nounces\n(\n285\ng\n)\nasparagus\n(about\n1\nbunch\n), woody ends trimmed\n1\nfresh\nserrano\nchile\n(about\n10\ng\n)\n1/4\ncup\n(\n60\nml\n) rendered pork fat from\nroast pork shoulder\nor\nvegetable oil\n, divided (see note)\n12\nounces\n(\n340\ng\n)\nroast pork shoulder\n, pulled into 2-inch long pieces (see note)\n1/2\nteaspoon\nground coriander\n1/4\nteaspoon\nchile powder\n1/4\nteaspoon\nground cumin\nReserved drippings\nfrom\nroast pork shoulder\n(optional)\nFor Serving:\nThinly sliced\nscallions\nand/or roughly chopped fresh cilantro leaves and tender stems\nFried eggs\n(optional)\nWarmed corn or\nflour tortillas\n(optional)\nLime wedges\nHomemade\nor store-bought\nsalsa verde\n(optional)\nDirections\nFor the Hash:\nPlace potatoes in a 3-quart saucepan and cover with 2 quarts cold water. Add vinegar and 2 tablespoons kosher salt. Bring to a boil over high heat. Reduce to a simmer and cook until barely tender, about 7 minutes after coming to a boil. Drain potatoes in a colander, then set aside.\nMeanwhile, heat a large cast iron skillet over high heat for 5 minutes. Add asparagus and serrano to the pan and arrange in a single layer. Cook, turning occasionally until asparagus and serrano are charred all over and asparagus is just cooked through, 4 to 6 minutes for thin spears, 5 to 8 minutes for thick spears. Carefully add 1 teaspoon (5ml) pork fat (or vegetable oil) to the skillet, toss to coat vegetables, and season lightly with salt and pepper. Transfer vegetables to cutting board. Once vegetables are cool enough to handle, cut asparagus into 2-inch pieces and de-seed and finely mince the serrano. Set aside.\nWipe out skillet, return it to stovetop, and lower heat to medium. Add 1 tablespoon plus 2 teaspoons (25ml) pork fat (or vegetable oil) and pulled roast pork shoulder to now-empty skillet, and arrange pork in a single layer. Season lightly with salt and pepper, and cook, stirring occasionally, until pork is golden brown and crisp on all sides, 8 to 10 minutes. Using a slotted spoon, transfer pork to a plate and set aside.\nAdd remaining 2 tablespoons (30ml) pork fat (or vegetable oil) to skillet and increase heat to medium-high. Add potatoes and arrange in as even a single layer as possible. Season lightly with salt, and cook, stirring and tossing occasionally, until potatoes are deep brown and crisp on all sides, about 20 minutes. Add coriander, chili powder, and cumin and cook, stirring frequently, until fragrant, about 30 seconds. Return pork, asparagus, and serrano to the skillet, along with any drippings reserved from roast pork shoulder (if you have saved them), toss to combine, and continue to cook until all components are heated through, about 2 minutes. Season with salt and pepper.\nFor Serving:\nSprinkle scallions and/or cilantro over the hash, and top with fried eggs (if using). Serve right away, passing warmed tortillas (if using), lime, and salsa verde at the table.\nSpecial equipment\n3-quart saucepan\n,\nlarge cast iron skillet\nNotes\nYukon gold potatoes will hold together and will have slightly creamier centers and less crispness than russets. Russets will give you crispier results, but the potatoes will fall apart a bit.\nReserved rendered pork fat from a roast pork shoulder will produce the most flavorful hash, but if you didn't save any fat (or used it up already), vegetable oil will work as well. Along with using reserved pork fat, the flavor of the hash is also improved with the addition of any reserved drippings from the roast pork shoulder. Moral of the story: Don't waste anything when you roast a pork shoulder.\nThis recipe has been tested with both leftover roast picnic shoulder and pork butt, and while both cuts work well, we prefer the tenderness and extra fattiness of pork butt. You can read more about the difference between the two cuts\nhere\n.\nMake-Ahead and Storage\nThe hash is best enjoyed right away, but it can be refrigerated in an airtight container for up to 2 days. Reheat and re-crisp in a cast iron skillet with 1 tablespoon (15ml) of rendered pork fat or vegetable oil before serving.\nThis Recipe Appears In\nThe Food Lab: How to Make the Best Potato Hash\nRoast a Pork Shoulder and Feast For Days\nPork Shoulder\nRecipes\nPork\nAsparagus",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-way-to-use-up-leftover-pork-is-this-easy-one-pan-meal.webp?"
}