{
  "url": "https://www.seriouseats.com/crispy-braised-chicken-white-beans-chile-verde-hatch-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/YQAirfzVidhBN5vfSgGnam_IR3E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__09__20130816-hatch-green-chili-31-33757a734d3d40869dafb99b64b24f77.jpg",
  "tags": [
    "Chicken Mains",
    "Braised & Stewed Chicken",
    "White Beans",
    "Chicken Legs",
    "Green Chiles"
  ],
  "title": "Crispy Braised Chicken With White Beans and Chile Verde Recipe",
  "full_text": "Crispy Braised Chicken With White Beans and Chile Verde Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs 10 mins\nActive\n40 mins\nSoaking Time\n8 hrs\nTotal\n10 hrs 25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nsmall white beans\n, rinsed and picked over\nKosher salt\n2\nquarts\nhomemade or store-bought\nlow-sodium chicken broth\n2\nbay leaves\n3/4\npound\nHatch (Anaheim) chiles\n(see note)\n2\ntablespoons\nvegetable oil\n4\nchicken legs\nFreshly\nground black pepper\n1\nlarge\nonion\n, thinly sliced (about\n1 1/2\ncups\n)\n4\nmedium\ncloves garlic\n, thinly sliced\n1\ntablespoon\nground cumin\n1\nteaspoon\nground coriander seed\n1/2\ncup\nroughly chopped\nfresh cilantro leaves\n, plus more for garnish\n1\ntablespoon\nfresh lime juice\n, plus\n1\nwhole\nlime\ndivided into 8 wedges\nSour cream\nor\nMexican crema\nfor serving\nDirections\nCover white beans with 1 gallon (4 quarts) water. Add 1/4 cup salt and stir until dissolved. Cover and let rest at room temperature at least 8 hours and up to 24. Drain and rinse beans.\nPlace beans in a large pot and add chicken broth and 1 bay leaf. Bring to a simmer and cook, stirring occasionally and topping up with water to keep beans submerged until beans are tender but still slightly firm in the center, about 45 minutes. Drain beans, reserving liquid in a large bowl.\nWhile beans cook, roast chiles directly over an open gas flame until charred on all sides, about 5 minutes per chile. Transfer chiles to a covered bowl or a heavy paper bag as they are ready and seal tightly. Alternatively, broil chiles on a rimmed baking sheet 6 inches from broiler element, turning until charred on all sides and transfer to a covered bowl or a heavy paper bag. Once all chiles are cooked, keep sealed for 15 minutes to allow them to steam. Transfer steamed chiles to bowl with drained bean cooking liquid.\nPeel and de-seed the chiles submerged under the bean cooking liquid. Transfer the flesh to a cutting board, leaving the charred skin and seeds behind. Once all chiles are peeled, carefully strain and reserve liquid. Discard skins and seeds. Roughly chop chile flesh. Set chopped chiles and liquid aside.\nAdjust oven rack to lower-middle position and preheat oven to 350°F. Heat oil in a large straight-sided sautée pan over high heat until shimmering. Season chicken with salt and pepper and place in pan skin side-down. Cook without moving until well browned on first side, about 8 minutes. Flip and brown lightly on second side, about 4 minutes longer. Transfer chicken to a large plate.\nAdd onions and garlic to pan and cook, stirring constantly and scraping up browned bits with a wooden spoon until softened, about 6 minutes. Add cumin and coriander and cook until fragrant, about 30 seconds. Add chopped chilies and reserved bean cooking/chili soaking liquid. Bring to a simmer and cook until reduced by 1/3, about 10 minutes. Stir in cilantro and 1 tablespoon lime juice. Sauce should be relatively thick. If watery, allow to reduce until there is no water pooling at the top of the pan.\nTransfer contents to the jar of a blender, food processor, or a large bowl with a hand blender. Pulse until roughly pureed. Season to taste with salt and pepper. Return chile sauce to sauté pan and stir in the cooked beans and remaining bay leaf. Nestle chicken into beans leaving the skin exposed and transfer to the oven. Cook, uncovered, until chicken is completely tender and skin is very crisp, and beans are cooked through, about 45 minutes. Sprinkle with extra cilantro and serve immediately with lime wedges and sour cream.\nThis Recipe Appears In\nThe Food Lab: Crispy Braised Chicken With White Beans and Chile Verde\nChicken Mains\nBraised & Stewed Chicken\nWhite Beans\nChicken Legs\nGreen Chiles",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crispy-braised-chicken-with-white-beans-and-chile-verde-recipe.webp?"
}