{
  "url": "https://www.seriouseats.com/crispy-buffalo-fried-cauliflower-recipe",
  "image_url": null,
  "tags": [
    "Cauliflower",
    "Vegan Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Frying",
    "Snacks & Appetizers"
  ],
  "title": "Crispy Buffalo Fried Cauliflower (Vegan) Recipe",
  "full_text": "Crispy Buffalo Fried Cauliflower (Vegan) Recipe\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n15 mins\nTotal\n35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\npeanut oil\n1/2\ncup\ncornstarch\n1/2\ncup\nall purpose flour\n1/2\nteaspoon\nbaking powder\nKosher salt\n1/2\ncup\nwater\n1/2\ncup\nvodka\n1\nhead\ncauliflower\n, cut into 1-inch florets\n1/3\ncup\nhot sauce\n, such as Frank's\n1\nmedium clove\ngarlic\n, minced\n1/4\ncup\npicked\ncelery leaves\n(optional)\nDirections\nPreheat oil to 350°F in a large wok, Dutch oven, or deep fryer.\nCombine cornstarch, flour, baking powder, and 2 teaspoons kosher salt in a large bowl and whisk until homogenous. Add water and vodka and whisk until a smooth batter is formed, adding up to 2 tablespoons additional water if batter is too thick. It should have the consistency of thin paint and fall off of the whisk in thin ribbons that instantly disappear as they hit the surface of the batter in the bowl.\nAdd cauliflower to batter. Working one at a time, lift one piece and allow excess batter to drip off. Carefully lower into hot oil. Repeat with remaining cauliflower until wok or fryer is full. Do not crowd pan. (You'll be able to fit about half of the cauliflower in each batch). Fry, using a metal spider or slotted spatula to rotate and agitate pieces as they cook until evenly golden brown and crisp all over, about 6 minutes. Transfer to a paper towel-lined plate and season immediately with salt. Keep warm while you fry the remaining cauliflower.\nCombine hot sauce, garlic, and 1 tablespoon oil from fryer in a large bowl and whisk to combine. Toss fried cauliflower with sauce and serve immediately, sprinkled with celery leaves (if using).\nSpecial equipment\nDutch oven\nor\nwok\nfor deep frying,\nwhisk\n,\ninstant-read thermometer\nor\nprobe thermometer\nThis Recipe Appears In\nThe Best Fried Cauliflower (Buffalo and Korean Style)\nFor the Wispiest, Crispiest Deep-Fried Crusts, Grab the Vodka\nCauliflower\nVegan Snacks & Appetizers\nVegetarian Snacks & Appetizers\nFrying\nSnacks & Appetizers"
}