{
  "url": "https://www.seriouseats.com/crispy-fried-chocolate-wontons-recipe",
  "image_url": "https://www.seriouseats.com/thmb/E8ws3j8Tx6A3IvTdu1HuEZWSzRw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120604-209100-crunchy-fried-chocolate-wontons-dca6dcf8cd1944d7b168dd0919088a48.jpg",
  "tags": [
    "Desserts",
    "Frying",
    "Chocolate"
  ],
  "title": "Crunchy Fried Chocolate Wontons Recipe",
  "full_text": "Crunchy Fried Chocolate Wontons Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n10 mins\nActive\n45 mins\nTotal\n30 mins\nServes\n30 wontons\nCook Mode\n(Keep screen awake)\nIngredients\n30\n(\n2 1/2-inch square\n)\nwonton wrappers\n3\nounces\nbittersweet chocolate\n, finely chopped\nWater\nfor brushing wontons\n1/4\ncup\nconfectioners' sugar\n1/4\nteaspoon\nChinese five-spice powder\n3\nquarts\ncanola, vegetable, or\npeanut oil\nfor frying\nDirections\nWorking six at a time, lay out wonton wrappers on a work surface, with one corner pointing toward the top. (Keep unused wontons covered while working to keep them from drying out.) Place 1/2 teaspoon chopped chocolate in the center of the top half of each wonton, keeping chocolate about 1/2-inch from edge.\nLightly brush the top left and top right edges of wontons with water. Lift up bottom point and fold over chocolate to touch top point, forming a triangle. Press edges to seal well, gently pressing out air in the pocket before sealing (see notes).\nPlace assembled wontons on towel lined plate and cover with lightly dampened paper towel while you finish the remaining wontons. In a small bowl, stir together sugar and five-spice powder; reserve.\nFill a heavy duty pot with 2 inches oil. Heat on medium heat to 360°F (182°C). Working in 2 or 3 batches, carefully lower in wontons one at a time. Fry until golden brown, flipping and agitating with chopsticks, tongs, or a wire mesh spider as they cook, about 45 seconds (see notes). Drain on paper towel-lined plate. Adjust heat as necessary between batches to keep temperature at 360°F.\nSift sugar/spice mixture over wontons and serve, either as-is or with ice cream.\nSpecial Equipment\nLeave-in probe thermometer\nor\ninstant-read thermometer\nNotes\nMake sure the wontons are sealed well to prevent chocolate from seeping out during frying.\nI found that starting to flip the wontons immediately is easier than waiting for one side to brown, because it helps prevent the wonton from getting top heavy on one side. By doing this it will be easier to keep the wonton flipped over to the second side.\nRead More\nCrispy Cinnamon-Sugar-Coated Cream Cheese Wontons with Nutella-Dulce de Leche Dipping Sauce\nDesserts\nFrying\nChocolate"
}