{
  "url": "https://www.seriouseats.com/crispy-duck-confit-with-mixed-bitter-greens-salad",
  "image_url": "https://www.seriouseats.com/thmb/jpNw-3lEjwT3-8lel_-wKyYt_0E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200107-duck-confit-46-vicky-wasik-7d608a2365ed4bfca171dbb392386545.jpg",
  "tags": [
    "Salads",
    "Stovetop",
    "Duck"
  ],
  "title": "Crispy Duck Confit With Mixed Bitter Greens Salad Recipe",
  "full_text": "Crispy Duck Confit With Mixed Bitter Greens Salad Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n10 mins\nTotal\n20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlegs\ntraditional\nor\nsous vide\nduck confit\n, brought to room temperature and gently removed from fat\n1\nteaspoon\n(\n5\nml\n)\nduck fat\nfrom duck confit\n1\npound\n(\n450\ng\n)\nmixed leafy bitter greens\n, washed and dried (see note)\nSimple vinaigrette\n, for dressing the salad\nKosher salt\nand freshly\nground black pepper\nDirections\nGently pat duck skin dry with paper towels. Heat a large nonstick skillet over medium-low heat for 2 minutes. Add duck fat to skillet, and spread with a paper towel until no visible fat remains. Add duck legs to skillet, skin-side down, and cook, using a weight or small cast iron skillet to press down on the duck legs for even browning and crisping of the skin. Cook, checking and shifting duck legs occasionally to ensure even browning of skin, until skin is deeply browned and crisp, 8 to 10 minutes. Carefully flip duck legs over, and continue to cook until meat is warmed through, 1 to 2 minutes. Transfer duck legs to a plate or rimmed baking sheet.\nIn a large mixing bowl, gently toss greens with 2 to 3 tablespoons (30 to 45ml) of vinaigrette, using your hands to lightly and evenly dress greens, adding more vinaigrette as needed. Season to taste with salt and pepper.\nDivide salad evenly between individual plates and top with duck legs. Serve.\nSpecial equipment\nNonstick skillet,\nChef's Press cooking weights\n(optional)\nNotes\nFor the best salad, use a mixture of tender, delicate leafy bitter greens such as mustard greens, frisée, arugula, mizuna, and watercress along with more robust ones, such as radicchio, and endive.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately.\nThis Recipe Appears In\nBreak Out Your Nonstick Skillet for the Best Crispy Duck Leg Confit\nSalads\nStovetop\nDuck"
}