{
  "url": "https://www.seriouseats.com/crispy-salmon-with-lentils-du-pay-mustard-creme-fraiche-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Fu5BPIQzdC-1Z8qPJwSrlRpwcCU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100916-crispysalmonlentils-07374dad39f74cc3bbfeab268147a6df.jpg",
  "tags": [
    "Seafood Mains",
    "French",
    "Stovetop Seafood",
    "Lentils",
    "Salmon"
  ],
  "title": "French in a Flash: Crispy Salmon with Lentils du Puy and Two-Mustard Crème Fraîche Recipe",
  "full_text": "French in a Flash: Crispy Salmon with Lentils du Puy and Two-Mustard Crème Fraîche Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmall\ncarrot\n, diced as finely as possible\n2\nsmall\nshallots\n, diced as finely as possible\n1\ntablespoon\nolive oil\n, plus\n1\ntablespoon\nLeaves of\n2\nstems\nfresh thyme\nSalt\nand pepper\n1 1/4\ncups\nlentils du Puy\n1/3\ncup\ndry white wine\n3 1/2\ncups\nvegetable stock\nor water\n1\ntablespoon\nfreshly chopped\nflat leaf parsley\n1 1/4\npounds\nsalmon fillet\n, skin on, cut into\n4\nportions\n2\ntablespoons\nunsalted butter\n, room temperature\n2\ntablespoons\nolive oil\n1/2\ncup\ncreme fraiche\n2\ntablespoons\nDijon mustard\n2\ntablespoons\nwhole grain mustard\nZest\nof\n1\nlemon\nFresh thyme\n,\nlemon slices\n, and\nmixed olives\nfor garnish\nDirections\nBegin by making the lentils. Over medium-low heat, sauté the carrots and shallot in 1 tablespoon of olive oil. Season them with the thyme leaves, salt, and pepper, and cook for 5 minutes, until they are just sweating and soft and fragrant.\nAdd in the lentils, and season again with salt and pepper.\nIncrease the heat to high, and pour in the white wine. Stir, and cook until the wine is absorbed. Add the stock or water. Cover, and bring to a boil. Once the water boils, reduce the heat to low, keep covered, and cook for around 25 minutes, until the lentils are tender, but still have a good bite to them, and hold their shape. Drain out any excess liquid, and toss with the remaining 1 tablespoon of olive oil, and the parsley. Adjust seasonings as needed.\nFor the salmon, season the fillets with salt and pepper on both sides, and paint the soft butter on the skin side of the salmon. Use all of it, even if it looks excessive. This is what makes the skin so crispy and perfect.\nHeat a large sauté pan on medium heat, and add the 2 tablespoons olive oil. When it shimmers, carefully add the salmon, skin side down. It will splatter a bit, so drop the salmon into the pot slowly, and away from you. Cook for 5 minutes, then turn over, and cook for 3 minutes, or until you've achieved desired doneness.\nWhile the salmon cooks, prepare the mustard crème fraîche. Stir together the crème fraîche, 2 mustards, and lemon zest, and season with salt and pepper.\nTo serve this dish, spoon a mound of the lentils on a plate, and perch the salmon on top. Spoon the crème fraîche over the hot fish, and let it melt into the filet and into the lentils. Serve more sauce alongside. Garnish with a few lemon slices, some fresh twigs of thyme, and a few mixed olives.\nNotes\nSalmon comes in so many different varieties these days. You use whichever you prefer. I, honestly, prefer to spend less, and avoid the Sockeye or wild in this preparation only because I think the farmed salmon has thicker, flakier flesh. But if you prefer wild salmon, by all means, go for it.\nCrème fraîche\ncan be hard to find, or expensive. If that is the case where you live, whip up a batch of your own by whisking together equal parts of sour cream and heavy cream. Cover the container, and allow it to sit in the fridge overnight.\nVoila!\nCrème fraîche.\nI strongly recommend that you find\nlentils du Puy\nfor this recipe. As you can see from the photograph, they are small, dark, and rounder than regular ol' lentils, and they are so much firmer to the bite once they're cooked. Other lentils just turn to mush. I buy mine in the bulk section at Whole Foods.\nSeafood Mains\nFrench\nStovetop Seafood\nLentils\nSalmon",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/french-in-a-flash-crispy-salmon-with-lentils-du-puy-and-two-mustard-crme-frache-recipe.webp?"
}