{
  "url": "https://www.seriouseats.com/crispy-crunchy-homemade-nutella-recipe-8757711",
  "image_url": "https://www.seriouseats.com/thmb/nEEps95ZKKnGgsFfN6Kv7cGpWoc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20190430-chocolate-hazelnut-spread-vicky-wasik-8c1d6fe433f64abf9574636c60ab8926.jpg",
  "tags": [
    "Hazelnuts",
    "Chocolate",
    "Gluten-free"
  ],
  "title": "Homemade Hazelnut Spread",
  "full_text": "Homemade Hazelnut Spread\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nCooling Time\n5 hrs\nTotal\n5 hrs 30 mins\nServes\n16 servings\nMakes\n2 heaping cups\nCook Mode\n(Keep screen awake)\nIngredients\n3\nfluid ounces\nwater\n(about 6 tablespoons; 85g)\n4 fluid ounces golden syrup or\ncorn syrup\n(\n113\ng\n; about 1/3 cup)\n5 1/4 ounces granulated\nsugar\n(\n150\ng\n; about 3/4 cup)\nShy\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n9\nounces\nhazelnuts\n, toasted, skinned, and roughly chopped (255g; about 2 cups)\nShy\n1/2\nteaspoon\nbaking soda\n4\nounces\ndark chocolate\n, roughly 60% cacao solids (113g; about 2/3 cup, finely chopped), melted\n1/2\nounce\ncocoa powder\n, preferably\nDutch-process\n(15g; about 2 heaping tablespoons)\n1\nfluid\nounce\nroasted-hazelnut oil\nor neutral oil (30g; about 2 tablespoons); see note\nDirections\nTo Make the Brittle:\nLightly grease a half-sheet pan and set aside. In a 3-quart saucier or saucepan, combine water, golden syrup or corn syrup, sugar, salt, and prepared hazelnuts and set over medium heat. Using a heat-proof spatula, scrape and stir until sugar has dissolved and the candy begins to bubble around the edges, about 5 minutes.\nSerious Eats / Vicky Wasik\nContinue cooking and stirring until the candy darkens to a tawny amber or foxy brown, registering between 320 and 340°F (160 and 171°C) on a candy thermometer, about 10 minutes more depending on the desired temperature. (The risk of error is high with handheld thermometer styles, so be sure to use a clip-on.) For more delicate caramel notes and a cleaner hazelnut flavor, stop at the low end of that range; for a bolder, bittersweet flavor, aim for the higher end of the range.\nSerious Eats / Vicky Wasik\nRemove from heat, then immediately stir in baking soda, folding with the heat-proof spatula until the candy is evenly foamy, then pour onto the prepared sheet pan. Cool to room temperature, then proceed immediately to the next step. If the candy is allowed to sit out for extended periods of time after cooling, it will turn tacky and soft. Alternatively, wrap the cooled candy tightly in plastic and store in an airtight container for up to 1 week at cool room temperature or for several months in the fridge or freezer.\nSerious Eats / Vicky Wasik\nTo Make the Chocolate-Hazelnut Spread:\nBreak the brittle into pieces and transfer to the bowl of a food processor. Pulse several times to pulverize the candy, then let food processor run continuously until the brittle transforms into a thick, peanut butter–like paste. This typically takes between 3 and 5 minutes, but that range can vary substantially depending on the size and power of the machine.\nSerious Eats / Vicky Wasik\nAdd cocoa powder and process until well distributed. With the machine still running, pour in melted chocolate, along with roasted hazelnut oil. Scrape the blade and bowl, particularly around the bottom and in the corners, then continue processing until homogeneous and relatively smooth.\nSerious Eats / Vicky Wasik\nTransfer to an airtight container and store up to 1 month at cool room temperature or several months in the fridge. When freshly made, the mixture will be loose-bodied, with a tacky texture from the warm candy bits. As the spread cools, its texture will become delicately crisp; the spread will set with a firm, truffle-like consistency over the course of 24 to 36 hours at cool room temperature. This mixture can be used as a cookie filling or truffle center, as a crispy\nice cream swirl\n, or as a spread for toast,\ncrepes\n, and\nFrench toast\n.\nSpecial Equipment\n3-quart stainless steel saucier\n,\nheat-resistant spatula\n,\nclip-on digital thermometer\n,\nhalf-sheet pan\n,\nfood processor\nNotes\nAfter the spread has set, additional hazelnut oil may be stirred in to adjust the consistency as desired.\nMake-Ahead and Storage\nThe prepared brittle can be wrapped tightly in plastic, then sealed in an airtight container, where it will keep at cool room temperature for about 1 week or for several months in the fridge or freezer.\nRead More\nFrom Napoleon to Nutella: The Birth of the Chocolate- Hazelnut Spread\nFlourless Nutella Chocolate Torte\nOvernight Chocolate-Hazelnut Breakfast Buns\nBrie and Nutella Grilled Cheese\nHazelnuts\nChocolate\nGluten-free",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-hazelnut-spread.webp?"
}