{
  "url": "https://www.seriouseats.com/croquetas-de-jamon-recipe-11680423",
  "image_url": "https://www.seriouseats.com/thmb/WZDGVzhQw6wDrWZlYgG7QFXEi4s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250304-CroquetasdeJamon-AmandaSuarez-14-e45747d8684c4667aa1b48a9445df903.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Frying",
    "Spanish"
  ],
  "title": "Croquetas de Jamón",
  "full_text": "Croquetas de Jamón\nClose\nJump to recipe\nPrep\n45 mins\nCook\n45 mins\nChilling\n8 hrs\nTotal\n9 hrs 30 mins\nServes\n6\nto 12 servings\nMakes\n24 croquetas\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n473\nml\n)\nwhole milk\nHam ends or trimmings\n(optional; see notes)\n4\ntablespoons\n(\n60\ng\n)\nunsalted butter\n(see notes)\n4\ntablespoons\n(\n60\ng\n)\nextra-virgin olive oil\n1/2\nmedium\nyellow onion\n(\n4\nounces\n;\n113\ng\n), finely minced\n4\nounces\n(\n113\ng\n)\nSpanish dry-cured ham\n, such as jamón serrano, minced (see notes)\n1/2\ncup\nplus\n2\ntablespoons\nall-purpose flour (\n80\ng\n), plus\n1\ncup\nall-purpose flour\n(for dredging), divided\nKosher salt\nPinch\nfreshly grated nutmeg\n2\nlarge\neggs\n, beaten\n1 1/2\ncups\npanko breadcrumbs\n, for breading (see notes)\nVegetable of other neutral\noil\n, for frying\nDirections\nIn a small saucepan, heat milk over medium with the ham ends/trimmings (if using), then hold, covered, just below a simmer until ready to use.\nSerious Eats / Amanda Suarez\nIn a 3-quart saucepan or saucier, melt butter with olive oil over medium heat until butter is melted. Add onion and cook, stirring, until very soft but not browned, about 8 minutes. Meanwhile, remove and discard ham trimmings from milk (if using).\nSerious Eats / Amanda Suarez\nStir in minced jamón followed by 1/2 cup plus 2 tablespoons (80g) flour until flour has formed a paste with the fat the evenly coats all the solid ingredients. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add hot milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Continue until all milk has been added and mixture has thickened to a paste-like consistency. Remove from heat and season croqueta filling with salt and nutmeg.\nSerious Eats / Amanda Suarez\nScrape filling into a small heat-proof baking dish, rimmed eighth sheet pan, or other vessel that can hold the mixture in an even layer. Cover with plastic and refrigerate until fully chilled and set, at least 6 hours and up to overnight.\nSerious Eats / Amanda Suarez\nWhen ready to form croquetas, line a rimmed baking sheet with parchment. and set three wide, shallow bowls on a work surface. Fill the first bowl with the remaining 1 cup flour, the second with beaten eggs, and the third with panko. Wetting hands as necessary to prevent sticking and working in batches as you go, form filling mixture into roughly 2-inch by 1-inch cylinders. Place them first in the flour, rolling until well coated, then shake off excess and transfer to eggs. Gently roll to coat evenly with egg wash, lifting each croqueta to allow excess egg to drain off, then transfer to panko. Gently roll and press panko onto croquetas until fully coated. Transfer breaded croquetas to prepared baking sheet and repeat with remaining filling until all croquetas are breaded (you should have about 24). Cover with plastic, transfer to the refrigerator, and chill for at least 2 and up to 24 hours.\nSerious Eats / Amanda Suarez\nWhen ready to fry, in a Dutch oven or wide pot, heat at least 1 inch of oil over medium-high heat until 340°F (170°C) on an instant-read or frying thermometer. Set a wire rack in a rimmed baking sheet and line with paper towels. Working in batches to avoid crowding the oil, fry croquetas until golden brown all over, 2 to 3 minutes. Using a spider skimmer, transfer to paper towels to drain, then repeat with remaining croquetas. Serve right away.\nSerious Eats / Amanda Suarez\nNotes\nHam ends or trimming help infuse a deeper ham flavor into the milk; you can often buy them at a discount from a good deli or specialty store with a cured meats counter, often at a discount (since the ends frequently otherwise end up in the garbage). Look for ends or trimmings from dry-cured hams like jamón serrano or Italian prosciutto. It is totally fine if you can't find this ingredient, the recipe will still work and turn out great without it.\nCombining butter and olive oil offers the flavors of each, but you can also use 8 tablespoons of just one or the other, if desired.\nIf you can't find Spanish ham, Italian prosciutto crudo will work as a substitute.\nIf you want a finer breadcrumb coating, feel free to blitz the panko in a food processor to a finer breadcrumb size before using. You can also use fine breadcrumbs in place of the panko, if desired.\nSpecial Equipment\nSmall saucepan; 3-quart saucepan or saucier; wide pot (for frying); instant-read or frying thermometer; rimmed baking sheet with wire rack (if you don't have this, you can just transfer the croquetas to paper towels on a plate to drain)\nMake-Ahead and Storage\nThe cooked filling can be refrigerated, wrapped in plastic, for up to 3 days before forming into cylinders and breading.\nThe breaded croquetas can be refrigerated, covered, for up to 2 days before frying. If desired, you can freeze the breaded croquetas on the parchment-lined baking sheet, then transfer to zipper-lock bags. Keep frozen until ready to fry; you can fry them directly from frozen.\nSnacks & Appetizers\nThe Latest\nFrying\nSpanish"
}