{
  "url": "https://www.seriouseats.com/croquembouche-recipe-6931001",
  "image_url": "https://www.seriouseats.com/thmb/k0Dli62YY-zYi-hpLt-nRMW2h5k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221216-croquembouchehero-AmandaSuarez-e4f5c53427994cb195e31b47c3606a94.jpg",
  "tags": [
    "French",
    "The Latest",
    "Cakes",
    "Desserts",
    "Christmas Desserts"
  ],
  "title": "Croquembouche",
  "full_text": "Croquembouche\nClose\nJump to recipe\nPrep\n60 mins\nCook\n75 mins\nTotal\n2 hrs 15 mins\nServes\n8\nto 12 servings\nMakes\n1 twelve-inch croquembouche\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cream Puffs:\nOne\nrecipe\nchoux pastry\n(made with a combination of milk and water, and the optional sugar),\ntransferred to a pastry bag\nfitted with a 1/2-inch plain round tip\nPowdered sugar\n, for dusting\nOne\nrecipe\ncrème légère\n(see note), transferred to a pastry bag fitted with a 1/4-inch plain round tip\nFor the Caramel:\n21\nounces\nsugar\n(\n3\ncups\n;\n600\ng\n), divided\n6\nounces\nwater\n(\n12\ntablespoons\n;\n170\ng\n), divided\nDirections\nFor the Cream Puffs:\nAdjust oven racks so that one is in upper-middle position, the other is in lower-middle position, and preheat oven to 400°F (205°C). Take one sheet of parchment paper and, using a 1 1/4-inch round cutter, trace 25 circles that are 1 inch apart. Flip paper upside down and place on a rimmed baking sheet. Pipe a small amount of choux paste under each corner of parchment paper (the dough acts as a glue and keeps the paper in place as you pipe). Repeat with a second piece of parchment paper and a rimmed baking sheet.\nSerious Eats / Amanda Suarez\nHolding the filled pastry bag at a 90° angle, apply steady downward pressure to pipe puffs onto a prepared tray, filling each circle completely. To stop piping, cease applying pressure and swirl the pastry tip away. Repeat with second prepared tray. To smooth the surface of any uneven puffs, dip a finger into cold water and gently pat down any bumps. Dust puffs evenly with powdered sugar.\nSerious Eats / Amanda Suarez\nBake both trays, switching racks and rotating trays front to back after 20 minutes, until puffed, golden brown, and hollow feeling, about 25 minutes total.\nSerious Eats / Amanda Suarez\nWorking quickly while puffs are still hot, gently insert the tip of a paring knife into the underside of each puff and rotate in a circular motion to create a small hole, about 1/4 inch in size. Return puffs to trays and place in the turned-off oven with the door partially open and let stand for 30 minutes to allow puffs to dry and fully set.\nSerious Eats / Amanda Suarez\nInsert tip of crème légère–filled bag into hole in each puff and begin piping with steady pressure until filled (you can tell because the puff will feel heavy and cream will start to overflow the hole). Wipe away any excess crème légère. Repeat until all puffs are filled and set aside; reserve leftover crème légère for another use.\nSerious Eats / Amanda Suarez\nPlace one sheet of parchment paper on top of a cake turntable or stand followed by an 8-inch disposable cake round or the 8-inch removable bottom of a springform or tart pan wrapped in aluminum foil. Set aside.\nSerious Eats / Amanda Suarez\nFor the Caramel:\nIn a 3-quart saucepan or saucier, combine 10 1/2 ounces sugar (1 1/2 cups; 300g) and 3 ounces water (6 tablespoons; 85g) water over medium heat. Stir with a fork until syrup comes to a boil, about 4 minutes, then simmer without stirring until syrup is honey-colored, roughly 5 minutes, shaking and swirling as needed to ensure even caramelization. Continue cooking, without stirring or swirling, until syrup is medium amber, about 1 minute longer. Carefully pour the hot caramel into a small glass bowl.\nSerious Eats / Amanda Suarez\nWhile wearing latex gloves, hold each puff upside down and carefully dip the top in the caramel, letting any excess drip off. Return dipped puff to the tray caramel-side up. Repeat with remaining puffs. If the caramel starts to thicken, microwave in 10-second increments, stirring after each increment, until caramel is loose in consistency.\nSerious Eats / Amanda Suarez\nWash and dry the used saucepan. In now-clean saucepan, combine remaining 10 1/2 ounces sugar (1 1/2 cups; 300g) and 3 ounces water (6 tablespoons; 85g) water over medium heat. Stir with a fork until syrup comes to a boil, about 4 minutes, then simmer without stirring until syrup is honey-colored, roughly 5 minutes, shaking and swirling as needed to ensure even caramelization. Continue cooking, without stirring or swirling, until syrup is medium amber, about 1 minute longer. Carefully pour the hot caramel into a separate small glass bowl.\nSerious Eats / Amanda Suarez\nTo Assemble and Serve the Croquembouche:\nArrange the 9 largest caramel-topped puffs in a circle so they’re touching one another on the prepared cake round (this helps gauge the width of the base). Removing puffs from the circle one at a time, dip one side of the rounded edge of each puff into the caramel then press the dipped side, with the caramel-top facing outward, into its space on the cake round, angling it slightly inward and holding it in place until the caramel hardens, about 3 seconds. Repeat with remaining puffs to form the first layer of the croquembouche.\nSerious Eats / Amanda Suarez\nTo build successive layers, repeat the dipping process with the remaining puffs and caramel. As you build, you’ll reduce the number of puffs in each successive layer by one, positioning each puff in the gap between the bottom two puffs. If you have a space that needs to be filled in order to make a full layer, take one puff, dip a rounded edge in the caramel, and position the puff sideways in the empty space to complete the layer. If the caramel starts to thicken, microwave in 10-second increments, stirring after each increment, until caramel is loose in consistency.\nSerious Eats / Amanda Suarez\nOnce you reach your second-to-last layer, dip the bottom of one puff, stick it to the bottom of another puff, then dip the rounded edge of the conjoined puffs in the caramel and position it on top. Dip and place your final puff on top of the conjoined puffs. (You may have a couple leftover puffs, which you can eat or share).\nSerious Eats / Amanda Suarez\nAt this point the caramel should be quite viscous with a consistency similar to honey (if the caramel is even thicker like rubber cement, microwave in 5-second increments, stirring after each increment, until it loosens a bit). Dip the tines of the fork in the caramel, letting it drip back into the bowl until it falls in a thin thread. Then, move the fork in a circular motion around the croquembouche from top to bottom to form hair-like strands of caramel. Repeat until croquembouche is covered in caramel strands.\nSerious Eats / Amanda Suarez\nServe croquembouche within 2 hours of being assembled. To serve, guests can break off puffs as desired or you can use scissors to cut apart puffs and transfer to serving plates.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nDisposable latex gloves, cake turntable or stand, 8-inch disposable cake round (optional)\nNotes\nIf you prefer to fill the puffs with pastry cream or whipped cream, you will need a greater volume of filling (roughly 3 cups).To use pastry cream, make a double batch of any of the pastry cream recipes―\nvanilla\n,\nchocolate\n, or\nlemon\n―or make a batch each of two different flavors. To use whipped cream, make a double batch of\nwhipped cream\n(sweetened, flavored, or plain).\nMake-Ahead and Storage\nA croquembouche is best enjoyed immediately, ideally within 2 hours once assembled; left to stand longer and both the caramel and puffs will soften.\nTo store unfilled cream puffs, wrap them tightly in plastic and place in an airtight container; they can be kept frozen for up to 1 month. To refresh puffs, preheat oven to 350°F (177°C). Transfer frozen puffs to a sheet tray and reheat until crisp, about 5 minutes. Let cool at room temperature before filling.\nCrème légère can be prepared ahead of time and refrigerated in an airtight container for up to 3 days.\nFrench\nThe Latest\nCakes\nDesserts\nChristmas Desserts"
}