{
  "url": "https://www.seriouseats.com/croque-monsieur-recipe",
  "image_url": null,
  "tags": [
    "The Latest",
    "French",
    "Roasting",
    "Cheese",
    "Ham"
  ],
  "title": "Cheesy, Gooey Croques Monsieurs",
  "full_text": "Cheesy, Gooey Croques Monsieurs\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5 1/2\ntablespoons\n(\n80\ng\n)\nunsalted butter\n, plus more if necessary, divided\n1 1/2\ntablespoons\n(\n12\ng\n)\nall-purpose flour\n1\ncup\n(\n235\nml\n)\nmilk\n6\nounces\n(\n170\ng\n)\ngrated Gruyère\n,\nComté\n, or\nSwiss cheese\n, plus more if desired, divided\nKosher salt\nand freshly\nground black pepper\n8\n(1/4 inch thick) slices\nsoft bread, such as\nbrioche\nor good-quality\nsandwich bread\n8\nounces\n(\n225\ng\n) good-quality thinly\nsliced ham\n(about\n16\nslices\n)\n4\nteaspoons\n(\n20\nml\n)\nDijon mustard\nDirections\nPreheat oven to 350°F (180°C). In a small saucepan, heat 1 1/2 tablespoons butter with flour over medium-high heat, until butter has melted and formed a paste with flour. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisk in milk until smooth and cook, whisking, until sauce comes to a simmer and begins to thicken slightly. Lower heat to low and cook, stirring, until sauce is thick enough to coat the back of a wooden spoon, about 3 minutes. Whisk in 4 ounces cheese (reserving the rest for inside the sandwiches) until smooth, moving saucepan on and off heat to keep it hot enough to melt cheese but not so hot that it bubbles rapidly. Season Mornay sauce with salt and pepper and keep warm.\nIn a large cast iron skillet, working in batches, toast both sides of each slice of bread in remaining butter over medium heat until golden, about 2 minutes per side; swirl pan and rotate bread for even browning, and add more butter as necessary if pan dries out.\nSerious Eats / Vicky Wasik\nTransfer bread to a work surface. Arrange ham on top of half the bread slices, then spread a generous layer of Mornay sauce on top of ham. Sprinkle with remaining grated cheese. Spread Dijon mustard on each of the remaining bread slices and close sandwiches. Spread additional Mornay sauce on top of each sandwich from edge to edge; sprinkle additional grated cheese on top, if desired.\nSerious Eats / Vicky Wasik\nTransfer sandwiches to a baking sheet and heat in oven until sandwiches are warmed throughout and cheese is melted. Turn on broiler, then broil sandwiches on top rack until lightly browned on top, about 2 minutes. (Keep an eye on them, as some broilers are very powerful.) Serve right away.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nCast iron skillet\n,\nbaking sheet\nNotes\nTo make a Croque Monsieur into a Croque Madame, simply top each sandwich with a fried egg with a runny yolk.\nThe Latest\nFrench\nRoasting\nCheese\nHam"
}