{
  "url": "https://www.seriouseats.com/crown-roast-of-pork-recipe",
  "image_url": null,
  "tags": [
    "Pork Mains",
    "Christmas",
    "Gluten-free Mains",
    "Roasted Pork",
    "Pork"
  ],
  "title": "Easy Crown Roast of Pork Recipe",
  "full_text": "Easy Crown Roast of Pork Recipe\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 10 mins\nActive\n10 mins\nResting Time\n30 mins\nTotal\n2 hrs 45 mins\nServes\n12\nto 30 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n6- to 10\n-\npound\n(\n2.7- to 4.5\nkg\n)\ncrown roast of pork\n(\n12 to 20\nchops\n; see note)\nKosher salt\nand freshly\nground black pepper\nDirections\nPreheat oven to 250°F (120°C) and adjust oven rack to center position. Season pork roast liberally with salt and pepper (see note) and place on a wire rack set in a rimmed baking sheet. Transfer to oven and roast until internal temperature reaches 140°F (60°C), about 2 hours. Remove from oven and tent with foil for at least 15 minutes and up to 45 minutes. Meanwhile, increase oven temperature to 500°F or 260°C (see note). Return roast to oven and cook until crisp and browned on the exterior, about 10 minutes. Remove from oven, tent with foil, allow to rest for 15 minutes, then carve by slicing in between each rib and serve.\nSpecial Equipment\nWire rack\n,\nrimmed baking sheet\n,\ninstant-read thermometer\nNotes\nAsk your butcher for your crown roast at least a day or two in advance to make sure they can order it and prepare it. Aim for around one and a half chops per person, or two chops per person if you want leftovers.\nOther aromatics, like minced garlic or chopped herbs, can be added along with the salt and pepper if desired.\nTo prevent the ends of the ribs from burning, cap each with a piece of aluminum foil.\nRead More\nPork Loin Roast With Winter Vegetables\nGarlic- and Herb-Roasted Pork Loin With Crackling and Spiced Apple Chutney\nUltra-Crispy Slow-Roasted Pork Shoulder\nCuban-Style Roast Pork Shoulder With Mojo\nPork Mains\nChristmas\nGluten-free Mains\nRoasted Pork\nPork"
}