{
  "url": "https://www.seriouseats.com/crusty-dinner-rolls-recipe",
  "image_url": "https://www.seriouseats.com/thmb/hblcVkUr9EMza49Q48m3MOx4DxY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__11__20161103-hard-dinner-rolls-vicky-wasik-21-eeaa7e57882c4ffdbe7ac344267ad90c.jpg",
  "tags": [
    "Rolls & Buns",
    "Sides",
    "Thanksgiving Side Dishes",
    "Christmas Sides"
  ],
  "title": "The Best Dinner Rolls (Fluffy, Crusty, and Chewy) Recipe",
  "full_text": "The Best Dinner Rolls (Fluffy, Crusty, and Chewy) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n50 mins\nActive\n30 mins\nRising/Cooling Time\n9 hrs 30 mins\nTotal\n10 hrs 40 mins\nServes\n12 rolls\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Yukone:\n6\nounces cold\nwater\n(\n3/4\ncup\n;\n170\ng\n)\n2 1/2\nounces\nbread flour\n(\n1/2\ncup\n;\n70\ng\n)\nFor the Dough:\n13 3/4\nounces\nbread flour\n(\n2 3/4\ncups\n;\n380\ng\n)\n1/2\nounce\nsugar\n(\n1\ntablespoon\n;\n15\ng\n)\n2 1/2\nteaspoons\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume or use the same weight\n1 1/2\nteaspoons\n(\n6\ng\n)\ninstant dry yeast\n, such as SAF; not RapidRise or active dry\n6\nounces\ncold\nwater\n(\n3/4\ncup\n;\n170\ng\n)\nDirections\nFor the Yukone:\nIn a 2-quart stainless steel saucier or 10-inch skillet, combine water and flour. Cook over medium heat, whisking constantly, until mixture comes together in a thick, mashed potato–like paste, about 2 minutes. Scrape onto a plate, spread into a 1-inch layer, and cool until no warmer than 100°F (38°C), about 20 minutes.\nFor the Dough:\nPulse flour, sugar, salt, and yeast in a food processor fitted with a metal blade. Once combined, add cooled yukone and water. Process until dough is smooth, about 90 seconds.\nTransfer to a lightly greased bowl (the dough will be slightly warm and incredibly sticky), cover with plastic, and refrigerate until roughly doubled in bulk, between 60 and 90 minutes depending on temperature of yukone.\nTurn dough onto a clean, un-floured surface, but do not deflate. Cut into 12 roughly equal portions (2 1/4 ounces or 60g each), cupping each beneath your palm and working in quick circular motions to form a smooth ball. Arrange on a parchment-lined rimmed baking sheet, cover with plastic, and refrigerate overnight until puffy and soft, between 8 and 10 hours.\nTo Finish:\nAdjust oven rack to lower-middle position and preheat to 400°F (200°C). Fill a deep pot with about 3 inches of water and bring to a boil over high heat. Meanwhile, line a baking sheet or cutting board with a thick layer of paper towels. Cut parchment between each roll with a pair of scissors. Working with 4 dough pieces at a time, use parchment to lift and drop rolls into boiling water so that they are upside down. Boil exactly 60 seconds, then flip right side up with a slotted spoon (so the bottoms can skin over) and transfer to paper towels. (Along the way, the parchment squares can be gently tugged free or allowed to slip off on their own.)\nArrange rolls on a parchment-lined rimmed baking sheet; these can be baked immediately or left at room temperature up to 4 hours. Bake until blistered and golden brown all over, about 35 minutes.\nRolls can be served immediately or held at room temperature for up to 6 hours. Reheat in a hot oven for 5 to 10 minutes before serving if rolls have cooled and you prefer them hot.\nSpecial Equipment\n2-quart stainless steel\nsaucier\nor 10-inch\nskillet\n,\nfood processor\n,\nrimmed baking sheet\nNotes\nWith two long, slow rises, this recipe lets you knock out the work (and cleanup) of making and shaping the rolls a day in advance. After boiling, the rolls can be baked immediately or held another 4 hours at room temperature to better suit your schedule.\nRolls & Buns\nSides\nThanksgiving Side Dishes\nChristmas Sides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-dinner-rolls-fluffy-crusty-and-chewy-recipe.webp?"
}