{
  "url": "https://www.seriouseats.com/cryo-poached-pears-5211042",
  "image_url": "https://www.seriouseats.com/thmb/mnHs2L9wucsoz9u3ofzf6JZzYc8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211001-frozen-pears-vicky-wasik-19-d5162c62d41e413a9d0b73bbbec522dd.jpg",
  "tags": [
    "Pear",
    "Chinese",
    "Desserts",
    "Features",
    "The Latest"
  ],
  "title": "Cryo-Poached Asian Pears With Goji Syrup",
  "full_text": "Cryo-Poached Asian Pears With Goji Syrup\nClose\nJump to recipe\nPrep\n85 mins\nCook\n85 mins\nFreezing and Thawing Time\n18 hrs\nTotal\n20 hrs 50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\nAsian pears\n, about\n10 1/2\nounces\n(\n300\ng\n) each\n2\ntablespoons\nwhole\ndried goji berries\n2\ntablespoons\n(\n16\ng\n) Chinese Southern\nalmonds\n(see note)\n2\ntablespoons\n(\n16\ng\n) Chinese Northern\nalmonds\n(see note)\n1\ntablespoon\n(\n36\ng\n) yellow lump rock\nsugar\n(roughly\n1\n(1 1/2-inch)\nlump\n), plus more if needed\n1\ntablespoon\ndried sweet osmanthus or\nchrysanthemum\nDirections\nWash Asian pears well, getting rid of any dirt or debris on the surface of the fruit.\nSeal the Asian pears in a zipper-lock bag, then place in freezer until frozen solid, at least 3 hours. Remove pears from freezer and allow to thaw completely at room temperature, about 3 hours. Repeat this process until the pears' skins have darkened and pears feel tender within their skins, at least 2 more times although more rounds may be required for larger fruits.\nVicky Wasik\nPlace the frozen pears in a large bowl and cover with cold water to thaw for a final time.\nVicky Wasik\nIn a small bowl, cover the goji berries, southern almonds, and northern almonds with cold water and let soak for 15 minutes, then drain.\nVicky Wasik\nIn a small saucepan, combine rock sugar, osmanthus or chrysanthemum flowers, and 1 1/2 cups (355g) water. Set over medium heat and bring to a boil. Stir to dissolve the sugar, about 1 minute. Remove syrup from heat and let steep for 10 minutes.\nVicky Wasik\nStrain the syrup and discard the flowers. Return syrup to the pot along with the goji berries, southern almonds, and northern almonds. Bring to a simmer over medium heat, then reduce heat to maintain a simmer until the goji berries are entirely softened, about 10 minutes. Adjust sweetness with additional rock sugar, if necessary. Set aside to cool, then transfer to a container and refrigerate until chilled, about 1 hour.\nVicky Wasik\nOnce the pears are fully thawed, set a small cutting board inside a rimmed baking sheet to contain juices. Cut pears into quarters, then slice off any core from each quarter. Carefully slice flesh from skin and discard skin.\nVicky Wasik\nCut each quarter lengthwise into thin slices, then serve cold in a shallow bowl, spooning the syrup, goji berries, and almonds on top.\nVicky Wasik\nNotes\nGoji berries, Chinese almonds, rock sugar, dried osmanthus, and dried chrysanthemum can all be found at well-stocked Chinese markets. Note that packages of Chinese almonds are often not labeled with enough detail in English to help identify Northern versus Southern almonds, but the two types are almost always sold near each other, and can be distinguished by their size, with Southern almonds being larger than Northern ones. Northern almonds are only consumed cooked, as they contain cyanide and are mildly toxic.\nMake-Ahead and Storage\nThe pears can be stored in a sealed bag or container in the freezer for up to 9 months, during any stage of the freezing and thawing process.\nThe syrup can be made up to 1 week in advance and refrigerated in an airtight container until ready to use.\nPear\nChinese\nDesserts\nFeatures\nThe Latest"
}