{
  "url": "https://www.seriouseats.com/cuban-style-pollo-a-la-plancha-marinated-and-griddled-chicken",
  "image_url": null,
  "tags": [
    "Cuban",
    "Recipes by World Cuisine",
    "Chicken Breast",
    "Stovetop Chicken",
    "Chicken Mains"
  ],
  "title": "Cuban-Style Pollo a la Plancha (Marinated and Griddled Chicken) Recipe",
  "full_text": "Cuban-Style Pollo a la Plancha (Marinated and Griddled Chicken) Recipe\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nActive\n45 mins\nMarinating Time\n30 mins\nTotal\n85 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nmedium cloves\ngarlic\n1/4\ncup\n(\n60\nml\n) freshly squeezed\norange juice\n(from about\n1\norange\n)\n1/4\ncup\n(\n60\nml\n) freshly squeezed\nlime juice\n(from about\n2\nlimes\n)\n1 1/2\nteaspoons\nground cumin\n1 1/2\nteaspoons\ndried oregano\n1\nteaspoon\nfreshly ground black pepper\n1/2\nteaspoon\nground allspice\n(optional)\nKosher salt\n4\nboneless, skinless chicken breast\nhalves (about\n10\nounces\n;\n285\ng\neach) or\n8\nchicken cutlets\n1\ntablespoon\n(\n15\nml\n) neutral\noil\nsuch as\ncanola\nor\nvegetable\n, plus more as needed\n1\nlarge\nwhite or yellow onion\n(about\n3/4\npound\n;\n340\ng\n); sliced crosswise into 1/4 inch thick rings\nCooked long-grain rice and black beans\n, for serving\nPicked\ncilantro leaves\n, for serving\nLime wedges\n, for serving\nDirections\nUsing a blender or food processor, purée garlic, orange juice, lime juice, cumin, oregano, black pepper, allspice (if using), and 2 teaspoons kosher salt until well blended. (Alternatively, to make with a mortar and pestle, pound the garlic with the salt to form a paste, then mix in the rest of the ingredients. Alternatively, finely grate or mince the garlic and stir together with the remaining ingredients in a small bowl.)\nSerious Eats / Aaron Hutcherson\nIf using chicken breast halves, cut into cutlets following\nour instructions here\n, pounding to an even thickness of about 1/4 inch. (If desired, you can butterfly the breast halves by not fully cutting all the way through, so that they open like a book; butterflied breasts also need to be pounded to an even thickness.)\nSerious Eats / Aaron Hutcherson\nPlace chicken cutlets in a large zipper-lock bag or shallow baking or glass storage dish. Add marinade, making sure it coats chicken evenly all over. Press out excess air and seal zipper-lock bag, or cover dish with plastic or a lid. Refrigerate for 30 minutes; if chicken is in a dish, turn it once halfway through.\nSerious Eats / Aaron Hutcherson\nRemove the chicken breasts from the marinade and wipe off any excess. In a stainless steel skillet, heat oil over medium-high heat until shimmering. Working in batches, if necessary, to prevent crowding the pan, add the chicken cutlets and cook until golden brown on each side, 2 to 3 minutes per side. Transfer cooked cutlets to a platter and cover with foil or place in a low oven to keep warm. Repeat with remaining chicken, adding more oil if the pan gets too dry.\nSerious Eats / Aaron Hutcherson\nIn the same skillet that you cooked the chicken, add more oil if the pan is dry and heat over medium-high heat until shimmering. Add the onion rings, season with salt, and sauté until the onions have softened a bit and started to brown, 7 to 10 minutes; lower heat and/or add a small splash of water if the contents of the pan threaten to burn.\nSerious Eats / Aaron Hutcherson\nArrange cutlets on serving plates and top with browned onions. Serve with black beans and rice and garnish with cilantro leaves and lime wedges.\nSpecial Equipment\nBlender\n,\nfood processor\n, or\nmortar and pestle\n;\nmeat pounder\n;\nstainless steel skillet\nMake-Ahead and Storage\nThe marinade can be blended in advance and refrigerated for up to 5 hours before using. However, it is best not to marinate the chicken for much longer than the recommended 30 minutes.\nRead More\nPalomilla (Cuban Steak and Onions)\nCuban-Style Roast Pork Shoulder With Mojo\nMojo Sauce Recipe\nCuban\nRecipes by World Cuisine\nChicken Breast\nStovetop Chicken\nChicken Mains"
}