{
  "url": "https://www.seriouseats.com/cuban-fritas-seasoned-cheeseburger-shoestring-potatoes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PW-5Yfjb50gZUAEILyLsxv9IjO8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__06__20130611-burger-week-grilled-burger-variations-06-8e86b01fe2074b4689a6a736dffb2e8a.jpg",
  "tags": [
    "Burgers",
    "Cuban",
    "Grilled Beef",
    "Ground Beef"
  ],
  "title": "Cuban Fritas (Seasoned Cheeseburgers With Shoestring Potatoes and Spicy Sauce) Recipe",
  "full_text": "Cuban Fritas (Seasoned Cheeseburgers With Shoestring Potatoes and Spicy Sauce) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n35 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npotato\n, peeled and cut into 1/8th inch matchsticks with a mandoline or by hand\n1\nquart\ncanola oil\nKosher salt\n1/4\ncup\nketchup\n1/2\ncup\nmayonnaise\n1\ntablespoon\nground cumin\n, divided\n1\ntablespoon\npaprika\n, divided\n2\ncloves\ngarlic\n, finely minced (about 2 teaspoons), divided\n1\nteaspoon\nwhite vinegar\n1\nteaspoon\nsugar\nKosher salt\nand freshly ground black pepper\n12\nounces\nground beef\n8\nounces\nground pork\nSliced American\n, cheddar, Swiss, or pepper jack\ncheese\n, as desired\nSliced onions, shredded iceberg lettuce, sliced tomatoes, and\npickles\n, as desired\n4\ntoasted\nhamburger buns\nDirections\nRinse cut potatoes in a bowl of cold water, changing water as necessary until water runs clear. Drain carefully and dry on paper towels.\nIn a deep cast iron skillet, fryer, or wok, heat oil to 350°F. Carefully lower potatoes into oil. Cook potatoes without moving, adjusting heat to maintain temperature, until bubbles from potatoes slow down and potatoes are a pale golden blond, about 3 minutes. Continue cooking, agitating potatoes occasionally with a metal spider or tongs until potatoes are deep golden brown, about 3 minutes longer. Carefully transfer potatoes to a paper towel-lined bowl and season immediately with salt. Allow to cool completely. After cooling, potatoes can be stored in an airtight container at room temperature for up to 3 days.\nIn a small bowl, combine ketchup, mayonnaise, 1 teaspoon cumin, 1 teaspoon paprika, 1 clove of garlic, vinegar, and sugar. Season to taste with salt and pepper. Set aside.\nCombine beef, pork, remaining cumin, remaining garlic, and remaining paprika in a large bowl and mix by hand just until combined. Form into 4 large burger patties.\nWhen ready to serve, season burger patties generously with salt and pepper and cook burgers to desired doneness on a hot grill or in a skillet on the stovetop (135°F for medium) topping with cheese for the last minute of cooking as desired. Transfer to a plate and allow to rest for 5 minutes.\nPlace onions, lettuce, tomatoes, and pickles (if using) on bottom buns and top with burger patties. Spoon sauce on top of patties, cover with fried shoestring potatoes, and close burgers, pressing down gently until they just hold together. Serve immediately.\nBurgers\nCuban\nGrilled Beef\nGround Beef",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cuban-fritas-seasoned-cheeseburgers-with-shoestring-potatoes-and-spicy-sauce-recipe.webp?"
}