{
  "url": "https://www.seriouseats.com/cuban-tasajo-recipe-11752850",
  "image_url": "https://www.seriouseats.com/thmb/Tx3hhICUsO7mgDmZPI58Yd2kRIw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250320-SEA-LorenaMasso-Tasajo-Beauty1-42-c76fde0e77464c8983552b26d1eb4359.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Recipes by World Cuisine",
    "Mains",
    "Cuban"
  ],
  "title": "Cuba’s Boldest Beef Dish Is Salty, Garlicky, and Completely Underrated",
  "full_text": "Cuba’s Boldest Beef Dish Is Salty, Garlicky, and Completely Underrated\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nSoaking and Marinating Time:\n8 hrs\nTotal\n8 hrs 30 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beef:\n1 1/2\npounds\n(\n680\ng\n)\ntasajo\n(dry-cured beef) (see notes)\nFor Fried Tasajo (Tasajo Frito):\n1\nsmall\nwhite onion\n(\n4\nounces\n;\n113\ng\n), halved and thinly sliced\n1\ntablespoon\nlime juice\nfrom\n1\nlime\n5\nmedium\n(\n25\ng\n)\ngarlic cloves\n, minced\n1/2\nteaspoon\nfreshly\nground black pepper\n1/4\ncup\n(\n60\nml\n)\nolive oil\n, plus more as needed\nFor Stewed Tasajo (Aporreado de Tasajo):\n2\ntablespoons\n(\n30\nml\n)\nolive oil\n1\ngreen bell pepper\n(about\n6\nounces\n;\n170\ng\n), stemmed, seeded, and thinly sliced\n1\nred bell pepper\n(about\n6\nounces\n;\n170\ng\n), stemmed, seeded, and thinly sliced\n1\n(8-ounce) can\n(\n227\ng\n)\nSpanish-style or plain unseasoned tomato sauce\n3/4\nteaspoon\nground cumin\n1/2\nteaspoon\nfreshly\nground black pepper\n3/4\nteaspoon\ndried oregano\n1\ncup\n(\n240\nml\n)\nwater\n1/2\ncup\n(\n120\nml\n)\ndry white wine\nCuban black beans with rice\nfor serving\nDirections\nFor the Beef:\nRemove the outer layer of fat and salt with a spoon or butter knife and discard. Cut beef into 4 to 6 smaller pieces. Place cut beef in a large bowl and fill with warm (120℉) water and soak for 10 minutes. Using gloves, if desired, massage meat to remove as much remaining fat and salt as possible. Repeat soaking and massaging process 2 more times.\nIn a large pot or Dutch oven, add the prepped beef and enough cold water to cover the meat and bring to a boil. Cover and reduce heat to medium; simmer for 30 minutes. Carefully pour out water from pot while using tongs or a large spoon to keep meat in the pot; discard water and replace with fresh water. Return to boil and continue cooking until beef is tender enough to pull apart, about 1 hour. Use a spider skimmer or large slotted spoon to transfer meat to a large bowl. Let sit until cool enough to handle, about 10 minutes. At this point, taste a small shred of the beef. If it is too salty, transfer to a fine-mesh strainer and rinse under cool running water in 15-second intervals until desired salt level.\nSerious Eats / Lorena Masso\nWith the tasajo in the large bowl, wearing gloves if desired, use fingers or forks to shred meat into 1/4-inch pieces and remove any remaining fibrous pieces and gristle, as needed. Mix in onion, lime juice, garlic, and black pepper. Cover bowl tightly with plastic wrap or a lid and refrigerate for at least 6 hours and up to 16 hours before cooking.\nSerious Eats / Lorena Masso\nFor Fried Tasajo:\nIn a large skillet, heat oil over medium-high heat until shimmering. Working in batches to prevent crowding the pan, spread the shredded beef in a thin, even layer. Cook for 4 to 5 minutes uninterrupted, flip beef with a spatula, and continue cooking for another 4 to 5 minutes until all sides are crispy and bright red. If needed, add an additional tablespoon of oil to the skillet between batches. Serve with white rice and black beans, if desired.\nSerious Eats / Lorena Masso\nFor Stewed Tasajo (Aporreado de Tasajo):\nIn a large skillet, heat 2 tablespoons oil over medium-high heat until shimmering. Add green and red bell peppers and cook until peppers are tender, about 8 minutes.\nStir in tomato sauce, cumin, black pepper, oregano, water, and wine. Bring to a simmer, cover, and cook over medium heat for 5 minutes.\nStir in beef and return to a simmer; cook until sauce thickens and reduces slightly and coats beef, about 15 to 20 minutes. Serve with white rice and black beans, if desired.\nSpecial Equipment\nLarge pot or Dutch oven, spider skimmer or large slotted spoon, fine-mesh strainer, large skillet, lid for skillet if stewing the tasajo\nNotes\nTasajo isn't available in every grocery store, but you can usually find it in Latin markets, especially in cities with large Caribbean or Central American communities. It can also be found for purchase online.\nMake-Ahead and Storage\nLeftover fried or stewed tasajo can be refrigerated in an airtight container for up to 5 days.\nRead More\nPalomilla (Cuban Steak and Onions)\nMachaca Guisada (Northern Mexican Braised Dried Beef)\nRopa Vieja Recipe\nThe Latest\nRecipes\nRecipes by World Cuisine\nMains\nCuban"
}