{
  "url": "https://www.seriouseats.com/cullen-skink-scottish-smoked-fish-chowder",
  "image_url": "https://www.seriouseats.com/thmb/Q5Dtvs1rfu7c-EotSV-vzmj73SU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__01__20190116-cullen-skink-vicky-wasik-16-de4514c7a0314276ab8c5e170cc2f317.jpg",
  "tags": [
    "British",
    "Stovetop Seafood",
    "Heavy Cream",
    "Haddock",
    "Yukon Gold Potatoes"
  ],
  "title": "Cullen Skink (Scottish Smoked Fish Chowder) Recipe",
  "full_text": "Cullen Skink (Scottish Smoked Fish Chowder) Recipe\nClose\nJump to recipe\nCook\n40 mins\nActive\n30 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n950\nml\n)\nwhole milk\n1\nbay leaf\n1\npound\n(\n450\ng\n)\nfinnan haddie\n(\nScottish smoked haddock\n), or homemade\ncold-smoked fish\n(see note)\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n1\nmedium\n(\n8-ounce\n;\n225 g\n)\nyellow onion\n, finely diced\n1\npound\n(\n450\ng\n)\nYukon gold potatoes\n, peel on or off as desired, cut into 1/4-inch cubes\n1/2\ncup\n(\n120\nml\n)\nheavy cream\nKosher\nor\nsea salt\nand freshly\nground black pepper\nPinch\ncayenne pepper\n(optional)\nFinely minced chives\n, for garnish\nDirections\nIn a 3-quart saucepan, heat milk with bay leaf over medium heat until nearly simmering. Add fish and cook until just starting to flake. Using a slotted spoon, remove fish to paper towels to drain; set aside. Discard bay leaf. Transfer milk to heatproof mixing bowl or other container; set aside.\nSerious Eats / Vicky Wasik\nWash saucepan and return to medium heat. Add butter and cook until melted. Add onion and cook, stirring frequently, until nicely softened but not browned, about 6 minutes.\nReturn milk to saucepan and add potatoes. Return milk to bare simmer. Then cook until potatoes are tender, about 10 minutes; stir and scrape saucepan occasionally to prevent milk from scorching.\nUsing a potato masher or large wooden spoon, crush potatoes in pot until partially mashed. You want a good range of potato bits, some so small they thicken the broth but also larger chunks.\nSerious Eats / Vicky Wasik\nRemove and discard any skin or bones from fish; then flake into the soup. Add cream. Season with salt and pepper, and, if desired, stir in pinch of cayenne. Serve, sprinkling chives on top of each bowl.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart saucepan\n, smoking gun or\ncocktail smoker\n(optional; see note)\nNotes\nReal finnan haddie is an incredible ingredient and it's worth tracking down, but you can also cold-smoke any lean white-fleshed fish (like haddock, cod, or halibut) at home, if you have the appropriate equipment. To do it, make a brine by dissolving 60g (~2 oz.) salt and 30g (~1 oz.) sugar, along with 2 bay leaves and 15 whole black peppercorns, in 500ml (~17 fl. oz.) water over high heat. Remove from heat and add an additional 1500ml (~51 fl. oz.) cold water (you could also add 500g (~17 oz.) ice to chill the brine rapidly). Make sure brine has cooled fully; then add fish (skin on or off, as desired), and let soak, refrigerated, for 1 hour. Remove fish from brine, set on a wire rack in a rimmed baking sheet, and let stand at room temperature, uncovered, for 1 to 2 hours.\nTransfer fish to refrigerator and leave, uncovered, for at least 1 hour and up to 24 hours longer. Using a real cold-smoking rig, smoke fish following the smoker's instructions with cherry or other wood until deeply smoked, about 4 hours. Alternatively, put fish in a zipper-lock bag, and, using a smoking gun, inflate bag with smoke. Seal, then refrigerate for 30 minutes. Add another blast of smoke to bag; then refrigerate again for 30 minutes. Repeat this process for a total of 5 or 6 smoking and resting cycles (or longer, if you want an even deeper smoke flavor). Then proceed with recipe as written.\nMake-Ahead and Storage\nThe finished soup can be refrigerated for up to four days. Reheat gently before serving.\nRead More\nKedgeree (British Curried Rice With Smoked Haddock)\nTea Smoked Fish\nEasy, Creamy One-Pot Salmon Chowder\nBritish\nStovetop Seafood\nHeavy Cream\nHaddock\nYukon Gold Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cullen-skink-scottish-smoked-fish-chowder-recipe.webp?"
}