{
  "url": "https://www.seriouseats.com/curried-squash-souffle-hor-mok-recipe-11706531",
  "image_url": "https://www.seriouseats.com/thmb/QPudqJDfhi4vQH7s28vBq-NyIMo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250227-CurrySquashSouffle-MelatiCitrawireja-Beauty1-11-bc0fe808011e4076afc1bb9b1ceadb15.jpg",
  "tags": [
    "Butternut Squash",
    "The Latest",
    "Thai",
    "Vegetarian"
  ],
  "title": "Curried Squash Soufflé",
  "full_text": "Curried Squash Soufflé\nClose\nJump to recipe\nPrep\n5 mins\nCook\n100 mins\nTotal\n105 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Squash:\n25\nounces\npeeled and seeded\nbutternut squash\nflesh (\n700\ng\n, from about\n1\nmedium\nsquash\n), cut into 1-inch cubes (about\n5\ncups\n)\n2\ntablespoons\n(\n30\nml\n) neutral\noil\n, such as canola\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Curry and Topping:\n1\ntablespoon\n(\n15\nml\n) unrefined\ncoconut oil\n3\ntablespoons\nred curry paste\n(\n1 1/2\nounces\n;\n45\ng\n), such as Mae Ploy\nOne\n13\n1/2\n-\nounce\ncan full-fat\ncoconut milk\n, divided\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(15 ml)\nsoy sauce\n(see notes)\n5\nlarge\neggs\n, separated\n1\ntablespoon\ncornstarch\n1\ntablespoon\n(15 ml) cold\nwater\n2\nfresh\nmakrut lime leaves\n, de-ribbed and cut into very thin ribbons (see notes)\n1\ntablespoon\nmedium hot red\nchile\n, such as Thai bird's eye or Fresno, seeded, stemmed, and cut into thin slivers (see notes)\nDirections\nFor the Squash:\nAdjust oven rack to middle position and preheat oven to 400°F (205°C). Toss squash with oil and salt, then arrange on a rimmed 13- by 18-inch baking sheet, making sure to not overcrowd. Roast, stirring occasionally, until squash is tender and beginning to brown, 30 to 45 minutes. Remove from oven and set aside. Reduce oven to 375°F (190°C).\nSerious Eats / Melati Citrawireja\nFor the Curry:\nIn a wok or large sauté pan, heat coconut oil over medium heat until shimmering. Add curry paste and cook, stirring constantly, until fragrant, about 2 minutes. Add roasted squash, stirring to coat it with the curry paste. Add salt and soy sauce. Continue cooking over medium heat, stirring occasionally, until the mixture slightly darkens in color, 3 to 4 minutes. Reduce heat to medium-low and gradually add half the coconut milk (200ml; about 3/4 cup plus 1 tablespoon). Simmer, stirring and scraping bottom and sides frequently, until sauce is thick, pudding-like, and has reduced by 1/3, about 5 minutes. Season to taste with additional salt and soy sauce as needed and let cool for 5 minutes.\nSerious Eats / Melati Citrawireja\nIn a food processor, purée curried squash mixture smooth. Let cool for 5 minutes. Add yolks and process until thoroughly incorporated. Transfer mixture to a large mixing bowl.\nSerious Eats / Melati Citrawireja\nIn the bowl of a stand mixer fitted with a whisk attachment, whip egg whites on medium speed until stiff, glossy peaks form, about 5 minutes. Using a flexible spatula, add about 1/3 beaten whites into squash mixture and gently fold to combine. Gently fold in remaining whites until mixture is smooth and no streaks remain. Carefully scrape mixture into an ungreased 8- by 8-inch square baking dish. Bake until the soufflé has puffed up by about 1 inch and the top is just firm to the touch, about 30 minutes.\nSerious Eats / Melati Citrawireja\nIn a 2-quart saucepan, bring remaining 3/4 cup plus 1 tablespoon (about 200ml) coconut milk to a simmer over medium heat. In a small bowl, whisk cornstarch and cold water until smooth. Stream cornstarch mixture into coconut milk, whisking to incorporate, and cook, stirring constantly, until the mixture is thick enough to coat the back of a spoon, about 1 minute. Remove from heat and set aside.\nSerious Eats / Melati Citrawireja\nTop curried squash with coconut milk, leaving a 1-inch border around the edge. Garnish with makrut lime leaves and chile and serve with jasmine rice.\nSerious Eats / Melati Citrawireja\nSerious Eats / Melati Citrawireja\nSpecial Equipment\nRimmed 13- by 18-inch baking sheet, wok or large sauté pan, food processor stand mixer, 8- by 8-inch baking dish, 2-quart saucepan\nNotes\nRefined coconut oil or neutral oil like canola or vegetable can be used in place of unrefined coconut oil.\nTamari can be used in place of soy sauce.\nFresh makrut lime leaves can be purchased at Southeast Asian grocery stores. To remove the tough ribs of Makrut lime leaves: fold the leaf in half lengthwise so that the rib is exposed to one side, then slice it off with a sharp knife. If you can’t find makrut lime leaves, you can garnish the soufflé with fresh zest from one lime.\nWhile I prefer Fresno chiles for the bright color and moderate heat, you can substitute red bell peppers for a milder flavor or bird’s eye chiles for more heat.\nMake-Ahead and Storage\nThe squash can be roasted and even puréed up to 3 days in advance and refrigerated in an airtight container.\nThe squash curry can be baked and refrigerated up to 1 day in advance. The curry will have deflated slightly, but will still taste good. To reheat, bake curry at 375ºF (190ºC) until warmed through, about 15 minutes. Garnish with lime leaves and chiles and serve.\nButternut Squash\nThe Latest\nThai\nVegetarian"
}