{
  "url": "https://www.seriouseats.com/customizable-strawberry-jam-recipe",
  "image_url": "https://www.seriouseats.com/thmb/13LCNkWCsZF1myjfGQ4xbsg5EVQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__07__20170717-preserving-strawberry-jam-vicky-wasik-4-f67927f78a0341c690b182b91576d4c1.jpg",
  "tags": [
    "Condiments & Sauces",
    "Vegetarian",
    "Jams & Jellies",
    "Strawberry",
    "Summer"
  ],
  "title": "Bright and Fruity Strawberry Jam, Your Way",
  "full_text": "Bright and Fruity Strawberry Jam, Your Way\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n25 mins\nTotal\n35 mins\nServes\n48\nto 64 servings\nMakes\n6\nto 8 jars\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n22\nounces\n;\n625\ng\n) roughly chopped hulled\nstrawberries\n(see notes)\n2\ntablespoons\n(\n30\nml\n)\nfresh juice\nfrom\n1\nwhole\nlemon\n, plus more if needed\n2\ncups\ngranulated sugar\n(\n14\nounces\n;\n400\ng\n)\n1/3\ncup\npowdered low-sugar pectin\n(\n1 1/2\nounces\n;\n45\ng\n), such as Ball or Sure-Jell, plus more if needed (see notes)\nDirections\nCombine strawberries and lemon juice in a large nonreactive saucepan and set over medium heat until simmering. Stir in sugar and bring mixture to a full boil over medium-high heat, then reduce to a simmer. Stir in pectin until dissolved, return heat to medium-high and bring to a full rolling boil. As soon as mixture reaches a full boil, cook for 1 minute, then remove from heat. Let stand 5 minutes.\nSerious Eats / Vicky Wasik\nTo Check the Jam Set:\nSpoon 1 tablespoon (15ml) jam onto a small dish and allow to cool completely, to room temperature. Run a finger through the jam. If the jam remains separated, it is properly set; if it runs back together, it is not. If not set, add an extra 1 tablespoon lemon juice and 1 tablespoon low-sugar pectin, then return to a boil and boil for 1 minute longer. Repeat jam set test until jam is properly set.\nCarefully scrape any foam or scum from surface of jam. Transfer jam to clean jars, leaving 1/4 inch space at the top; seal jars. Jam can be refrigerated up to 3 weeks or frozen up to 3 months. If heat-processing jam, process for 8 minutes.\nSpecial Equipment\n3-quart stainless steel saucepan, 8-ounce canning jars\nNotes\nYou can choose how finely to chop the strawberries: Leave them in bigger pieces for a chunkier jam, or chop them up smaller (or even mash them with a potato masher) for a smoother jam.\nThis recipe is formulated to work with low-sugar pectin; substituting other types of pectin will not work here unless you know how to alter the recipe accordingly. Be mindful that one brand of low-sugar pectin, Pomona's, works very differently from the others and will not work here.\nRead More\nThe Best Strawberry Ice Cream\nStrawberry Balsamic Sauce\nRhubarb-Strawberry Margaritas\nCondiments & Sauces\nVegetarian\nJams & Jellies\nStrawberry\nSummer"
}