{
  "url": "https://www.seriouseats.com/custard-pie-recipe-11759784",
  "image_url": "https://www.seriouseats.com/thmb/U8GbLAYHW3c0SVRgUCknDTzMijo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250623-SEA-custardpie-MorganHuntGlaze-HERO-030ed3d7c364406d844b294923b0757e.jpg",
  "tags": [
    "Pies",
    "The Latest",
    "Recipes",
    "Custards, Mousses & Puddings",
    "Desserts"
  ],
  "title": "The Creamy, Silky Pie You Can Make With What's Already in Your Kitchen",
  "full_text": "The Creamy, Silky Pie You Can Make With What's Already in Your Kitchen\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nChilling/Steeping\n4 hrs\nTotal\n5 hrs 10 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n1\nvanilla bean\npod\n, split lengthwise (see notes)\n5 1/4\nounces\ngranulated sugar\n(\n149\ng\n;\n3/4\ncup\n)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1 1/2\ncups\n(\n355\nml\n)\nheavy cream\n1 1/2\ncups\n(\n355\nml\n)\nwhole milk\n3\nlarge\neggs\nplus 2 large egg yolks\n1/2\nrecip\ne\neasy pie dough\n,\nor store-bought dough shaped in a 9-inch pie plate and chilled for at least 2 hours and par baked\n1/4\nteaspoon\nfreshly grated\nnutmeg\nDirections\nCut vanilla bean in half lengthwise. Using tip of paring knife, scrape out vanilla seeds and transfer seeds into a medium bowl. Add sugar and rub seeds into sugar to break up clumps, then mix in salt; set aside.\nAdjust oven rack to middle position and preheat to 300°F (150°C). In a medium saucepan, combine heavy cream, milk, and vanilla bean pod. Bring to a gentle simmer over medium heat. Remove from heat, cover to prevent evaporation, and steep for 1 hour.\nSerious Eats/ Morgan Hunt Glaze\nOnce cream mixture has steeped for 1 hour, bring cream mixture back to a simmer over medium heat. Meanwhile, in a large bowl set on top of a dampened kitchen towel to prevent slipping, whisk eggs, egg yolks, and reserved sugar–vanilla bean mixture until pale yellow, smooth, and fluffy. Pour about 1/4 of the simmering cream mixture into egg mixture, whisking constantly, until smooth and combined. Whisk egg mixture into milk mixture in saucepan, add nutmeg, and whisk to combine.\nUsing a fine-mesh sieve, strain custard into prepared pie crust; discard solids. Bake until just set, center slightly jiggles, and an instant-read thermometer inserted into pie registers 175°F (80°C), 50 to 55 minutes. Cover edges of crust with aluminum foil to prevent overbrowning if needed. Carefully transfer to a wire rack and cool to room temperature, about 2 hours, then cover loosely and chill in refrigerator for at least 3 hours. Serve.\nSerious Eats/ Morgan Hunt Glaze\nSpecial Equipment\nMedium saucepan, kitchen towel, fine-mesh strainer, wire rack\nNotes\nYou can substitute 1 teaspoon of vanilla bean paste for the whole vanilla bean. If using vanilla bean paste, skip the steeping step and whisk the paste into the egg and sugar mixture instead. The milk and cream should still be brought to a simmer before tempering the eggs, as directed. We do not recommend substituting vanilla extract in this recipe, as its flavor is not as intense as that of vanilla bean or vanilla bean paste.\nMake-Ahead and Storage\nPie crust can be made up to 1 day in advance. Leftover pie can be loosely covered with plastic wrap and refrigerated for up to 5 days.\nPies\nThe Latest\nRecipes\nCustards, Mousses & Puddings\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-creamy-silky-pie-you-can-make-with-whats-already-in-your-kitchen.webp?"
}