{
  "url": "https://www.seriouseats.com/custard-creams-recipe-8732937",
  "image_url": "https://www.seriouseats.com/thmb/0nC10C3zW_cC8N_p2RjVN15qlQg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241023-CustardCreams-DebbieWee-HERO4_1-b71cbbf7f4ac49e386c3fa0ceb8a9006.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Desserts",
    "British"
  ],
  "title": "Custard Creams",
  "full_text": "Custard Creams\nClose\nJump to recipe\nPrep\n45 mins\nCook\n14 mins\nChilling Time\n90 mins\nTotal\n2 hrs 29 mins\nServes\n15\nMakes\n15 2-inch biscuit sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Biscuits:\n170g\nall-purpose flour\n(6 ounces;\n1 1/3\ncups\n)\n35\ng\ncustard powder\n(1 1/4 ounces; 1/4 cup)\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use a pinch\n113\ng\nunsalted butter\n(4 ounces; 8 tablespoons), softened\n100g caster or\nsuperfine sugar\n(\n3 1/2\nounces\n; 1/2 cup), see notes\n1\nlarge\negg yolk\n, at room temperature\n1\nteaspoon\nvanilla\npaste or extract (see notes)\n1\ntablespoon\n(15ml)\nwhole milk\nFor the Buttercream:\n1\ntablespoon\n(15ml)\nwhole milk\n18\ng\n(2 tablespoons)\ncustard powder\n70g\nunsalted butter\n, softened (\n2 1/2\nounces\n; 5 tablespoons)\n140\ng\nconfectioners’ sugar\n(5 ounces; 1 1/4 cups), sifted, plus more as needed\n1\nteaspoon\nvanilla\npaste or 1 teaspoon vanilla extract\nDirections\nLine a 13- by 18-inch rimmed baking sheet with parchment; set aside.\nFor the Biscuits:\nIn a medium bowl, whisk together all-purpose flour, custard powder, and salt. Set aside.\nSerious Eats / Debbie Wee\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter and sugar on medium-high speed until creamy, about 1 minute. Add egg yolk and vanilla bean paste or extract and beat on medium-high speed until fully incorporated, about 20 seconds. Add dry ingredients and mix on medium speed until dough just comes together, about 45 seconds, pausing halfway through to scrape bowl with a flexible spatula. With the mixer running, add milk and mix until a thick dough forms, about 10 seconds. (Alternatively, you can prepare the dough using an electric hand mixer.)\nSerious Eats / Debbie Wee\nUse your hands to gently press the dough together; it will feel soft and slightly sticky. Flatten into an 8-inch disc, wrap tightly with plastic wrap, and refrigerate until firm, about 1 hour.\nSerious Eats / Debbie Wee\nOn a generously floured surface, roll chilled dough to about 5-mm thickness. With a 1 1/2- by 2-inch rectangular cutter, cut biscuits and use an offset spatula to transfer to prepared baking sheet, leaving at least 3/4-inch between each. Gather scraps, knead, re-roll, and cut as before. (If dough feels warm or sticks to the rolling pin, refrigerate for 10 minutes or until firm enough to roll.) You should have 30 rectangles. Refrigerate baking sheet with cookies for 30 minutes. (If a 13- by 18-inch rimmed baking sheet won’t fit in your refrigerator, you can bake the biscuits on two or three 9- by 13-inch rimmed baking sheets instead.)\nSerious Eats / Debbie Wee\nWhile dough chills, adjust oven rack to middle position and preheat oven to 350°F (175°C). Bake biscuits until golden with very lightly brown edges, about 13 minutes, then cool on baking sheet for 5 minutes. Using an offset spatula, transfer biscuits to a wire rack to cool completely while you prepare the buttercream.\nSerious Eats / Debbie Wee\nFor the Buttercream:\nIn a small microwave-safe bowl, heat milk on medium-high power until very warm to the touch, 8 to 10 seconds. Add custard powder and whisk until a thin yellow paste forms, 5 to 10 seconds.\nSerious Eats / Debbie Wee\nIn the bowl of a stand mixer fitted with paddle attachment, whip butter on medium-high speed until smooth and creamy, about 30 seconds. Add confectioners’ sugar, milk and custard powder mixture, and vanilla paste. Mix on medium-high until smooth and creamy, about 1 minute.\nThe buttercream should be soft and creamy, but firm enough to hold its shape when piped. If it feels too thin, add powdered sugar, 1 teaspoon at a time, until thick enough to pipe.\nUsing a flexible spatula, scrape buttercream into a piping bag.\nSerious Eats / Debbie Wee\nUsing scissors, cut a 1/2-inch hole in the piping bag. Pipe 1 to 2 teaspoons of buttercream onto the flat side of half the biscuits, then sandwich with remaining biscuits.\nSerious Eats / Debbie Wee\nSpecial Equipment\n13- by 18-inch rimmed baking sheet, stand mixer or hand mixer, flexible spatula, rolling pin; 1 1/2- by 2-inch custard cream or rectangular cutter, offset spatula, wire rack, piping bag\nNotes\nCaster or superfine sugar is finer than regular granulated sugar; it can be found in most grocery stores and online.\nThe biscuit dough tastes best with vanilla paste, which adds depth of flavor and pretty specks of vanilla bean. However, good-quality vanilla extract (not flavoring) will work in a pinch.\nFor traditional-looking custard creams, Amazon and other online sources sell an embossed cutter that makes patterns similar to the one on store-bought custard creams. If you plan to serve your custard creams for a special occasion, it's worth splurging on the pretty cutter. However, you can also cut the dough with a plain rectangle—about 1 1/2 x 2 inches works best.\nMake-Ahead and Storage\nThe biscuit dough can be wrapped tightly in plastic wrap and refrigerated for up to 24 hours. Allow refrigerated dough to stand at room temperature for 15 minutes prior to rolling.\nLeftover custard creams can be stored in an airtight container at room temperature for up to 5 days. The biscuits will soften as they sit, and the buttercream may deepen in color.\nTo freeze custard creams, layer filled or unfilled biscuits between sheets of parchment and freeze in an airtight container for up to 3 months. Thaw at room temperature.\nCookies\nThe Latest\nDesserts\nBritish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/custard-creams.webp?"
}