{
  "url": "https://www.seriouseats.com/daan-tat-hong-kong-style-egg-tart-5208534",
  "image_url": "https://www.seriouseats.com/thmb/fC0A7kbJtkVIfRC3znNtdHW-WmA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Hong-Kong-Egg-Tart-Tim-Chin_Hero_2-5e46bcecfcdb4120a34f2dfb6760676e.jpg",
  "tags": [
    "Chinese",
    "Eggs",
    "Pastries",
    "Custards, Mousses & Puddings",
    "The Latest"
  ],
  "title": "Daan Tat (Hong Kong-Style Egg Tart)",
  "full_text": "Daan Tat (Hong Kong-Style Egg Tart)\nClose\nJump to recipe\nPrep\n40 mins\nCook\n20 mins\nCooling/Resting Time\n4 hrs 45 mins\nTotal\n5 hrs 45 mins\nMakes\n16 tarts\nCook Mode\n(Keep screen awake)\nIngredients\nFor The Butter Block:\n1 1/3\ncups\n(\n6 1/4\nounces\n/\n180\ng\n), spooned,\nall-purpose flour\n, such as King Arthur\n16\ntablespoons\n(\n2\nsticks\n/\n226\ng\n) unsalted\nEuropean-style butter\n, chilled and cut into 8 pieces (see note)\nFor The Dough:\n6\ntablespoons\n(\n90\nml\n) bottled or filtered\nwater\n1\nlarge\negg yolk\n(\n15\ng\n)\n1 1/3\ncups\n(\n6 1/4\nounces\n/\n180\ng\n), spooned,\nall-purpose flour\n, plus more for dusting\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; if using\ntable salt\n, use half as much by volume or the same weight\nFor The Filling:\n1/2\ncup\nplus\n2\ntablespoons\n(\n150\nml\n)\nwater\n1/2\ncup\n(\n3 1/2\nounces\n/\n100\ng\n)\nsugar\n1/4\ncup\n(\n60\nml\n)\nevaporated milk\n2\nlarge\neggs\n(\n110\ng\n)\n2\nlarge\negg yolks\n(\n30\ng\n)\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\nDirections\nFor The Butter Block:\nIn the bowl of a food processor, process flour and butter until a smooth paste forms and begins to gather around the blade, about 30 seconds. Scrape butter mixture onto large sheet of plastic wrap and cover with second sheet of plastic wrap. Gently press into rough 6-inch square and bring ends of plastic wrap over center to form a neat parcel. Using bench scraper, gently square the sides. Place in refrigerator and cool until slightly firmed, about 30 minutes.\nTim Chin\nFor The Dough:\nIn a small bowl, whisk water and egg yolk until smooth and combined, about 30 seconds; set aside. In now-empty bowl of food processor, pulse flour and salt until combined. With processor running, add egg yolk mixture and process until dough runs around processor blade, about 30 seconds. Transfer dough to lightly floured counter and knead until smooth, about 30 seconds. Press dough into rough 6-inch square, transfer to parchment paper-lined baking sheet, cover with plastic wrap, and freeze until slightly firmed, about 25 minutes.\nTim Chin\nRemove butter block and dough from refrigerator/freezer and let rest on counter. Butter block will be ready when it reaches between 68° and 72°F (20-22°C), or when it gives way and is pliable when gently pressed, about 10 minutes. If too cool and firm, continue resting on counter until ready. The chilled dough block should have a similarly malleable texture as well.\nTim Chin\nOn a generously floured work surface, roll the dough to a 13-inch by 6-inch rectangle. (Tip: to help straighten the sides, you can use a bench scraper as a straight edge to press and pull the dough into a neater rectangle.) Unwrap butter block and place in center of dough. Fold top and bottom flaps of dough over butter so they meet in center, pressing seam together with fingertips to seal. Using a rolling pin or your fingers, press or pinch the open sides of dough together to seal in the butter block.\nTim Chin\nRotate dough 90 degrees so middle seam is perpendicular to the edge of the counter (dust the counter lightly with additional flour throughout this process as needed). Roll vertically to a roughly 16-inch by 6-inch rectangle. Fold top and bottom edge of dough to center, then fold in half again to form 4-inch by 6-inch rectangle. Rotate dough 90 degrees, then roll vertically once more to a 16-inch-long rectangle, and fold exactly as before. Place dough on the same parchment-lined baking sheet, wrap with plastic, and return to freezer for 30 minutes.\nTim Chin\nTransfer dough to a floured work surface so that the open edges are parallel to the counter edge and let rest until dough is pliable enough to gently bend when flexed, about 5 minutes. Using a rolling pin, gently beat and press the dough until it is pliable enough to roll without cracking. Roll vertically to a roughly 16-inch by 6-inch rectangle. Fold top and bottom edge of dough to center, then fold in half again to form a 4-inch by 6-inch rectangle. Place dough on the same parchment-lined baking sheet, wrap tightly with plastic, and refrigerate for 2 hours or freeze for up to 1 month.\nTim Chin\nTo Shape and Bake:\nTransfer dough to floured work surface and divide in half, covering one piece loosely with plastic wrap. Let rest until the dough can be worked without cracking, about 10 minutes, although the timing will vary depending on the temperature of your kitchen and precise thickness of the dough. Working with one dough portion at a time, gently beat and press dough with rolling pin until dough is pliable. Roll to a 15-inch square measuring about 1/8-inch thick. Using a 3 3/4-inch ring cutter, cut 8 circles of dough; discard dough scraps or save for another use. Working with one circle at a time, press dough into a lightly greased tart mold, starting from center to edges, until dough clears sides of mold by about 1/8 inch. Using a fork, lightly poke holes in center of dough. Repeat with remaining dough. Transfer tart shells to freezer and chill until firm, about 30 minutes.\nTim Chin\nFor The Filling:\nIn a large bowl, whisk water and sugar until dissolved. Whisk in evaporated milk until combined and mixture cools slightly. Whisk in eggs, egg yolks, vanilla, and salt until smooth and combined; at this stage the mixture will be quite thin. Strain mixture through a very fine-mesh sieve into a 2-cup measuring cup, cover with plastic wrap, and refrigerate for 1 hour or up to 24 hours.\nTim Chin\nAdjust oven rack to middle position and heat oven to 400°F (204°C). Arrange frozen tart shells on rimmed baking sheet and bring egg mixture to counter. Carefully pour egg mixture into tarts, stopping  1/4 inch from the rim. Bake tarts until pastry just begins to brown and custard is just set, pausing to rotate halfway through baking, 16 to 20 minutes. Let tarts cool in molds for 5 minutes. Unmold, cool an additional 10 minutes, and serve.\nTim Chin\nSpecial Equipment\nFood processor, sixteen 3-inch stainless steel tart pans, 3.75-inch ring cutter.\nNotes\nEuropean-style butters such as Plugra, Lurpak, or Kerrygold are churned longer, and feature at least 82 percent butterfat, compared to 80 percent in American style butters. That extra fat gives the butter a softer texture, which makes rolling the dough easier—and the resulting pastry flakier.\nMake-Ahead and Storage\nWrapped tightly in plastic, the laminated dough can be kept frozen for up to one month. Alternatively, the lined tart shells can be wrapped in plastic and frozen for a month instead.\nChinese\nEggs\nPastries\nCustards, Mousses & Puddings\nThe Latest"
}