{
  "url": "https://www.seriouseats.com/daube-de-boeuf-a-la-gasconne-gascon-style-beef-stew-recipe-8786904",
  "image_url": "https://www.seriouseats.com/thmb/psgw-yzLD43nRF2wbX-EAhFWR8g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250208-SEA-DaubedeBoeufAlaGasconneGasconStyleBeefStew-MaureenCelestine-hero-1d68dcc0edce4ace92be4970f04ca4c0.jpg",
  "tags": [
    "Mains",
    "The Latest",
    "French",
    "Braised & Stewed Beef",
    "Comfort Food"
  ],
  "title": "Daube de Boeuf à la Gasconne (Gascogne-Style Beef Stew)",
  "full_text": "Daube de Boeuf à la Gasconne (Gascogne-Style Beef Stew)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n3 hrs 30 mins\nTotal\n3 hrs 50 mins\nServes\n6\nto 8\nMakes\n8\nto 10 cups\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.4\nKg\n)\nboneless beef chuck roast\n1 1/4\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt use half as much by volume\n3/4\nteaspoon\nfreshly\nground black pepper\n, divided\n2\ntablespoons\nolive oil\nor duck fat\n4\nounces\n(\n113\ng\n)\nbacon\n, cut into 1/4-inch wide strips\n1\nmedium\nonion\n(\n8\nounces\n;\n226\ng\n), diced\n2\nlarge\ncarrots\n(\n8\nounces\n;\n225\ng\ntotal), peeled and cut crosswise into 1/2-inch thick rounds\n2\nlarge\nparsnips\n(\n8\nounces\n;\n225\ng\ntotal), peeled and cut crosswise into 1/2-inch thick rounds\n4\nmedium\ngarlic cloves\n, minced\n3\ntablespoons\nall-purpose flour\n1/4\ncup\n(\n60\nml\n)\nbrandy\n(preferably Armagnac), see notes\nOne\n750ml bottle\nfull-bodied red wine\n(preferably Madiran or Cahors), see notes\n2\ncups\nhomemade beef stock\nor\nhomemade chicken stock\nor store-bought low-sodium chicken broth\n4\nsprigs\nfresh thyme\n8\npitted\nprunes\n(about\n2\nounces\n), roughly chopped\nChopped\nfresh parsley\nfor garnish\nPotatoes or crusty bread\nfor serving (optional)\nDirections\nAdjust oven rack to bottom position and preheat oven to 275℉ (135℃).\nTrim off any large and hard fat pieces from chuck roast, then cut into 1 1/2-inch pieces. Pat dry with paper towels and sprinkle all over with 3/4 teaspoon salt and 1/2 teaspoon black pepper.\nSerious Eats / Maureen Celestine\nHeat olive oil or duck fat in a large heavy-bottomed pot or Dutch oven over medium-high heat until shimmering. Cook half of beef until browned on all sides, 4 to 5 minutes. Adjust heat to avoid burning. Transfer the browned beef to a plate, then repeat with remaining beef.\nSerious Eats / Maureen Celestine\nReduce heat to medium and add the bacon to the pot with the rendered beef fat. Cook, stirring frequently, until just starting to brown, about 4 minutes. Add the onions, carrots, and parsnips, and cook, stirring frequently, until the vegetables start to soften, about 3 minutes, adjusting heat as needed to avoid scorching the vegetables. Sprinkle vegetables with remaining 1/2 teaspoon salt and 1/4 teaspoon black pepper.\nSerious Eats / Maureen Celestine\nAdd the garlic and flour and cook, stirring frequently, until fragrant and no dry flour remains, about 1 minute. Remove pot from heat, add the brandy, stir, then return to heat and cook for 1 minute.\nSerious Eats / Maureen Celestine\nSlowly whisk in wine, stock or broth, thyme, and prunes. Bring the mixture to a simmer over medium-high heat and simmer until slightly thickened, about 5 minutes. Add the beef and juices from the plate to the pot. Cover and transfer to the oven. Cook until the beef is fork tender, 2 1/2 to 3 hours.\nSerious Eats / Maureen Celestine\nRemove stew from oven. If necessary, place over a burner and simmer uncovered, stirring occasionally, for up to 20 minutes to reduce and thicken stew to desired consistency. Use a ladle to skim excess liquid fat from top of stew and serve right away, garnished with parsley. Or—for the best tasting stew—omit skimming step, cool stew, and reserve for the next day. To serve the next day, let stew rest at room temperature until no longer hot, about 1 hour, then cover and refrigerate overnight. When ready to serve, spoon off hardened fat from the top and reheat stew on stovetop over medium heat until hot, about 15 minutes. Garnish with parsley before serving.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nLarge heavy-bottomed pot or Dutch oven, ladle\nNotes\nArmagnac provides this dish with a distinct robust flavor, but you can substitute your favorite brandy if Armagnac is unavailable.\nThe red wine in this recipe is an important ingredient. If possible, use a good quality Madiran wine from the Gascogne region of France. A good substitute is Cahors, also from southwest France. If both are unavailable, reach for a malbec.\nMake-Ahead and Storage\nThe stew can be cooled to room temperature and then refrigerated in an airtight container for up to 4 days or frozen for up to 2 months. Remove the fat layer before reheating on the stovetop. Garnish with parsley just before serving.\nMains\nThe Latest\nFrench\nBraised & Stewed Beef\nComfort Food"
}