{
  "url": "https://www.seriouseats.com/dawali-recipe-6503524",
  "image_url": "https://www.seriouseats.com/thmb/2kbGQRA-o-iKDb61ycrJJCu30jA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/09072022-Dawali-MaiKakish-Hero-855fb8e29d46497d8027c0bb63cde61c.JPG",
  "tags": [
    "Middle Eastern",
    "White Rice",
    "The Latest"
  ],
  "title": "Dawali (Palestinian Stuffed Grape Leaves)",
  "full_text": "Dawali (Palestinian Stuffed Grape Leaves)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n90 mins\nTotal\n2 hrs 30 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1\npound\n(\n450\ng\n) short or\nmedium grain rice\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n,\nmelted butter\n, or\nghee\n(or a combination)\n1 1/2\nteaspoons\n(\n6\ng\n)\nground allspice\n1\nteaspoon\n(\n5\ng\n)\ntomato paste\n1\nteaspoon\n(\n4\ng\n)\nground cinnamon\n1/2\nteaspoon\nfreshly\nground black pepper\n1/4\nteaspoon\nfreshly grated\nnutmeg\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\nuse half as much by volume or the same weight\n1\npound\n(\n450\ng\n)\nground beef\nor a combination of\nground lamb\nand beef\nFor the Broth:\n4\ncups\n(\n940\nml\n)\nwater\n(substitute with\nchicken stock\nor\nlow-sodium broth\nif you are not using lamb chops or beef short ribs below)\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n1/2\nteaspoon\nground allspice\n1/4\nteaspoon\nground cinnamon\n1/4\nteaspoon\nfreshly\nground black pepper\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\nuse half as much by volume or the same weight\nTo Assemble and Cook the Grape Leaves:\n1\npound\n(\n450\ng\n)\nfresh grape leaves\nor\njarred grape leaves\nin brine (about\n80 to 100\nmedium\nsized\nleaves\n; see note)\n12\nlamb cutlets\nor\n6\nbone-in beef short ribs\n(optional)\nKosher salt\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n3\nmedium\n(\n6-ounce\n;\n170 g\n)\nplum\nor\nglobe tomatoes\n, cored and sliced crosswise into roughly 1/2-inch-thick rounds\n2\ntablespoons\n(\n10\nml\n)\nfresh lemon juice\n(only if using jarred grape leaves)\nPlain yogurt\n, to serve\nDirections\nFor the Filling:\nIn a large bowl, stir together the rice, olive oil (or butter/ghee), allspice, tomato paste, cinnamon, black pepper, nutmeg, and salt until thoroughly combined. Add the ground meat and mix until evenly incorporated.\nSerious Eats / Mai Kakish\nFor the Broth:\nIn a medium bowl, whisk together the water (or broth) with tomato paste, allspice, cinnamon, and black pepper until thoroughly combined; season with 1 tablespoon (9g) salt. Set aside.\nSerious Eats / Mai Kakish\nTo Assemble and Cook the Grape Leaves:\nIf using jarred grape leaves, drain, then place in a heatproof bowl and gently pull apart leaves slightly. Pour boiling water over leaves until covered by at least 2 inches. Let stand 15 minutes, then drain and rinse thoroughly. For both fresh and jarred grape leaves, using a paring knife, cut out the tough central stem and any other thick and tough veins.\nSerious Eats / Mai Kakish\nOn a work surface, lay out as many grape leaves as you can fit, with the vein side up and stem end closest to you. Spoon about 2 teaspoons of the stuffing above the cut-out stem section of each leaf (you may need a little more or less depending on the size of the leaf). Using your fingers, form the stuffing into a thin log about 1/2 inch thick, leaving about 1 inch of uncovered leaf on either end.\nSerious Eats / Mai Kakish\nFold the sides of the grape leaves over the stuffing, then, working from the stem ends, roll the leaves up over the filling and away from you, making sure to roll them securely enough that they hold but not so tightly that there's no space for steam to penetrate or the rice to swell (if rolled too tightly, the rolls are likely to burst during cooking; this may happen to a few anyway, which shouldn't be considered a failure). Repeat with the remaining grape leaves and filling, reserving several large leaves to line and cover the pot.\nSerious Eats / Mai Kakish\nIf you are using lamb chops or beef short ribs, season all over with salt. Heat the olive oil in a 6- or 7-quart nonstick pot or heavy-bottomed pot or Dutch oven over medium heat until shimmering. Add the meat and sear on all sides until browned, about 10 minutes. Remove from the heat, then pack the tomato slices between the pieces of meat to fully cover the bottom of the pot. Lay enough reserved grape leaves on top to create a flat surface. If you are not using the lamb chops or beef short ribs, drizzle the bottom of the pot with the olive oil, then line with sliced tomatoes and cover with a few unrolled grape leaves.\nSerious Eats / Mai Kakish\nArrange the stuffed grape leaves in the pot in either concentric circles or rows.\nSerious Eats / Mai Kakish\nCover the stuffed grape leaves with more reserved grape leaves, then top with an inverted plate slightly smaller than the diameter of the pot (this weighs down the stuffed grape leaves and prevents them from moving when the liquid comes to a boil).\nSerious Eats / Mai Kakish\nPour reserved broth over the grape leaves.\nSerious Eats / Amanda Suarez\nSet the pot over medium-high heat and bring to a boil, then lower heat to maintain a simmer. Cover pot and cook at a gentle simmer until rice is meltingly tender, 1 hour 45 minutes to 2 hours; if using jarred grape leaves, add the lemon juice 5 minutes before removing from the heat. Remove from heat and tilt the pot to one side; if much more than a very thick trickle of liquid pools, then carefully pour or spoon off the excess liquid into a bowl and reserve (it can be used to reheat leftover stuffed grape leaves later).\nSerious Eats / Mai Kakish\nCover pot and let rest 20 to 30 minutes. When ready to serve, uncover and carefully remove the plate. Place an inverted serving platter over the pot, then quickly flip the pot over and carefully lift to reveal the stuffed grape leaves and meat (if using). If the pot you're using isn't nonstick, it's possible some tomato may not release right away; that's okay, simply scrape out anything that's stuck and add it to the platter. Shake the platter lightly back and forth to help the stuffed grape leaves come apart so you can serve individual pieces (tongs are the easiest way to transfer them to plates). Serve generously, at least 10 per person, and  offer plain yogurt on the side.\nSerious Eats / Mai Kakish\nSpecial Equipment\n6 - 7 quart nonstick pot, enameled Dutch oven, or heavy-bottomed stainless-steel pot\nNotes\nWhile the taste of fresh grape leaves is superior, in most cases it is much easier to find the jarred varieties. Quality varies from brand to brand, as does size and freshness, and in many cases it will take you a few tries to settle on a brand you like. I recommend using jars found in Middle Eastern grocery stores, including brands such as California, Alafia, or Orlando, but make sure you look at harvest date: The earlier in the spring it was harvested, the better, because by the time you get to summer harvest dates, the leaves are much bigger and less tender. In any case, always make sure you cut off the stem and remove any veins that appear too thick or hard.\nMake-Ahead and Storage\nThe stuffing can be prepared and the grape leaves rolled up to 1 day in advance.\nLeftovers can be refrigerated up to 4 days. To reheat, place grape leaves in a pan, add some leftover cooking liquid or water, cover, and simmer until piping hot.\nMiddle Eastern\nWhite Rice\nThe Latest"
}