{
  "url": "https://www.seriouseats.com/dense-rich-chewy-new-england-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/93X3GkVG2TnE5SlZy8w7okIMF2M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150408-chewy-new-england-ice-cream-vicky-wasik-3-ed2d5019e261450b871c03ded3a7dbb7.jpg",
  "tags": [
    "Ice Cream",
    "Evaporated Milk",
    "Heavy Cream",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "New England-Style Ice Cream Recipe",
  "full_text": "New England-Style Ice Cream Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n45 mins\nChurning/Freezing Time\n10 hrs 30 mins\nTotal\n10 hrs 45 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n8\nlarge\negg yolks\n3/4\ncup\nsugar\n1/4\ncup\ncorn syrup\n1 1/2\ncups\nheavy cream\n1 1/2\ncups\nevaporated milk\n(a little more than 1 can), divided\n2\nteaspoons\narrowroot starch\n1\nteaspoon\nvanilla extract\n1/2 to 1\nteaspoon\nkosher salt\nDirections\nIn a heavy-bottomed saucepan, whisk together egg yolks, sugar, and corn syrup until well combined. Add cream and 1 1/4 cups evaporated milk and whisk to combine. In a small bowl, stir remaining 1/4 cup evaporated milk with arrowroot starch until is dissolved and forms a slurry with no lumps. Set aside.\nPlace saucepan over medium-low heat and cook, whisking frequently, until the custard's temperature reaches 170°F (77°C). (Custard is ready when it coats a spoon and a finger swiped across the back leaves a clean line.)\nRemove from heat and stir in arrowroot starch slurry, vanilla extract, and salt. Pour custard through a fine-mesh strainer into an airtight container and chill in an ice bath or refrigerator until temperature drops to 40°F (4°C), about 4 hours for ice bath, up to overnight for refrigerator.\nChurn ice cream until it just takes on a firm soft serve consistency without any runniness; a spoon pressed across the top should leave a clean impression that doesn't collapse. Then, working very quickly, transfer ice cream to a wide, flat airtight container and chill in the bottom-back of a well-stocked freezer for at least 6 hours, preferably overnight. Avoid opening freezer door during hardening if possible. When ice cream is fully hardened, serve with plenty of mix-ins.\nSpecial Equipment\nIce cream maker\nRead More\nReal Talk: Stop Bashing Ice Cream Stabilizers\nCream Science: On Whipping, Butter, and Beyond\nDo I Need to Use Eggs in Ice Cream (and How Many?)\nUse Liquid Sugars Like Corn Syrup for Smoother, Less Icy Sorbet\nThe Best Way to Store Ice Cream in Your Freezer\nIce Cream\nEvaporated Milk\nHeavy Cream\nMother's Day\nFather's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/new-england-style-ice-cream-recipe.webp?"
}