{
  "url": "https://www.seriouseats.com/detroit-chocolate-bumpy-cake-with-chocolate-fudge-recipe",
  "image_url": "https://www.seriouseats.com/thmb/A0VrH5zKigY8HUYVuk5WhRrVC9M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120509-205735-bumpy-cake-1012627ec04f406c8b5c0a458ba91705.jpg",
  "tags": [
    "Cakes",
    "Chocolate",
    "Sheet Cake"
  ],
  "title": "Bumpy Cake (Chocolate Cake with Vanilla Buttercream and Chocolate Fudge) Recipe",
  "full_text": "Bumpy Cake (Chocolate Cake with Vanilla Buttercream and Chocolate Fudge) Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n40 mins\nActive\n90 mins\nCooling Time\n2 hrs 45 mins\nTotal\n3 hrs 50 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n1\ntablespoon\nunsalted butter\n1/2\ncup\nplus\n2\ntablespoons\nunsweetened Dutch process cocoa\npowder\n1/2\ncup\nhot\nblack coffee\n1/2\ncup\ncanola oil\n1\ncup\nbuttermilk\n1 1/2\nteaspoons\nbaking soda\n1/2\nteaspoon\nsalt\n1\ntablespoon\npure\nvanilla extract\n2\nlarge\neggs\n, lightly beaten\n3/4\ncup\ndark brown sugar\n, firmly packed\n3/4\ncup\nwhite sugar\n2\ncups\nall-purpose flour\nFor the Buttercream Frosting:\n1/4\ncup\nunsalted butter\n1/4\ncup\nvegetable shortening\n2 1/2\ncups\nconfectioners' sugar\n1\nteaspoon\nvanilla extract\nFor the Pourable Fudge Frosting:\n1/2\ncup\nbuttermilk\n, room temperature\n2 1/2\ncups\nconfectioners' sugar\n1\nteaspoon\nvanilla extract\n1\ncup\nsugar\n1/3\ncup\nunsweetened Dutch process cocoa powder\n1/3\ncup\ndark corn syrup\n1/4\nteaspoon\nsalt\n16\ntablespoons\n(\n2\nsticks\n)\nunsalted butter\n, cut into tablespoon-sized pieces\nDirections\nSet oven rack to the middle position and preheat oven to 375°F (190°C). Grease a 9- by 13-inch pan or baking dish with butter. Add 2 tablespoons cocoa powder to pan and shake and tap pan gently until the butter is completely coated in cocoa. Tip out excess.\nIn the bowl of a stand mixer, combine 1/2 cup cocoa and coffee, beat on medium speed for 30 seconds. Add oil, beat for 30 seconds; add buttermilk, beat for 30 seconds; add baking soda, beat for 30 seconds; add salt, beat for 30 seconds; add vanilla, beat for 30 seconds; add eggs, beat for 30 seconds; add sugars, beat for 30 seconds. Add flour and beat about 5 minutes to remove any lumps. Batter may begin to bubble.\nPour batter into prepared pan and use spatula to smooth top. Bake until cake tester comes out clean, 35 to 40 minutes. Transfer to a rack and allow to cool for at least 30 minutes. Transfer to the freezer for at least an hour and up to overnight.\nFor the Buttercream:\nIn the bowl of a stand mixer fitted with a paddle attachment, cream together butter and shortening on medium speed until light and fluffy, about 3 minutes. Add confectioners’ sugar and mix to fully incorporate, about 1 minute. Add vanilla extract and mix until blended, about 30 seconds. Transfer frosting to a piping bag fitted with a large round tip. Refrigerate for at least 15 minutes to firm up frosting.\nPipe frosting crosswise into seven 1-inch wide lines spaced 1-inch apart (each \"bump\" should run the length of the cake, 9 inches long). Return cake to freezer for at least 30 minutes to set the frosting.\nSerious Eats / Alexandra Penfold\nFor the Fudge\n: In a large bowl, whisk together buttermilk, confectioners' sugar, and vanilla and set aside. In a medium saucepan, combine sugar, cocoa, corn syrup, salt, and 1 stick of butter. Stir occasionally to fully incorporate butter as it's melting then bring mixture to a boil over medium-high heat.\nCook until mixture registers 240°F (116°C) on a candy or instant-read thermometer (a small amount dropped into cold water should form a soft, malleable ball), then remove from heat. While whisking constantly, add hot mixture to buttermilk mixture. Add remaining butter pieces and continue whisking until fully incorporated and mixture has cooled (frosting must be only slightly warm).\nSerious Eats / Alexandra Penfold\nRemove frosted cake from freezer and pour cooled frosting over the cake in long strokes to cover buttercream rolls completely. Note: Frosting will be thin and saucelike. Working quickly and evenly you'll be able to completely cover the bumps with a thin layer of frosting, while \"frosting runoff\" will create fudgy pockets along the surface beside the bumps that will firm up in the freezer. Return cake to freezer for at least 30 minutes more to set. A smaller, paring knife is most effective for cutting while maintaining the cake's unique look. Serve chilled and store leftovers in refrigerator or freezer.\nSpecial Equipment\n9- by 13-inch\nbaking dish\nor\npan\n,\nstand mixer\n, piping bag and large round piping tip,\ncandy thermometer\nRead More\nDevil's Food Cake\nChocolate Skillet Cake With Milk Chocolate Frosting\nGerman Double-Chocolate Cake\nThe World of Buttercreams: 6 Varieties to Try at Home\nCakes\nChocolate\nSheet Cake"
}