{
  "url": "https://www.seriouseats.com/deviled-eggs-shrimp-jalapeno-radish-recipe",
  "image_url": null,
  "tags": [
    "Deviled Eggs",
    "Boiled Eggs",
    "Shrimp"
  ],
  "title": "Deviled Eggs With Shrimp, Jalapeño, and Radish Recipe",
  "full_text": "Deviled Eggs With Shrimp, Jalapeño, and Radish Recipe\nJump to recipe\nPrep\n20 mins\nCook\n5 mins\nActive\n30 mins\nTotal\n25 mins\nMakes\n8 deviled egg halves\nCook Mode\n(Keep screen awake)\nIngredients\n6\nhard boiled\nor\nhard steamed eggs\n, peeled and halved lengthwise\n3\ntablespoons\nmayonnaise\n1\ntablespoon\nfresh lemon juice\nfrom\n1\nwhole\nlemon\n, lemon halves reserved\n1\ntablespoon\nminced\ncilantro leaves\nand tender stems, plus more for garnish\n2\nteaspoons\nfinely diced\njalapeño\n, plus more for garnish\n1\ntablespoon\nfinely diced\nradish\n, plus more for garnish\nKosher salt and freshly ground black pepper\n8\nmedium\nshell-on\nshrimp\nVery thinly sliced\njalapeño\n, for garnish\nRadish\nmatchsticks, for garnish\nCilantro leaves\n, for garnish\nDirections\nPlace all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add 2 tablespoons mayonnaise, 2 teaspoons lemon juice, half or cilantro, half of jalapeño, and half of radish and, using a sturdy whisk, mash until combined. Season to taste with salt and pepper.\nTransfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap).\nPlace shrimp in a small saucepan and cover with cold water. Bring to a simmer over high heat and remove from heat. Let stand for 1 minute, then rinse shrimp under cold running water. Peel and roughly chop shrimp. Dry carefully on paper towels. In a small bowl, combine chopped shrimp, remaining tablespoon mayonnaise, remaining teaspoon lemon juice, remaining cilantro, jalapeño, and radishes, and season to taste with salt and pepper.\nCut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Place a jalapeño slice on top of each egg and top with shrimp salad. Garnish with cilantro leaves, radish matchsticks, and diced jalapeño. Serve immediately.\nThis Recipe Appears In\n9 In-Your-Face Deviled Egg Variations\nDeviled Eggs\nBoiled Eggs\nShrimp"
}