{
  "url": "https://www.seriouseats.com/deviled-eggs-carbonara-recipe",
  "image_url": null,
  "tags": [
    "Deviled Eggs",
    "Stovetop Eggs",
    "Parmesan",
    "Boiled Eggs",
    "Pancetta & Guanciale"
  ],
  "title": "Deviled Eggs Carbonara (Crispy Pancetta, Pork Fat, Parmesan Crisps, and Black Pepper) Recipe",
  "full_text": "Deviled Eggs Carbonara (Crispy Pancetta, Pork Fat, Parmesan Crisps, and Black Pepper) Recipe\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n15 mins\nTotal\n30 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\nfinely grated\nParmigiano-Reggiano\n4\nounces\npancetta\n, finely diced\n6\nlarge\nhard-boiled\nor\nhard-steamed eggs\n, peeled and halved lengthwise\n2\ntablespoons\nmayonnaise\n1\nteaspoon\ndistilled\nwhite vinegar\nKosher salt\nand freshly ground black pepper, plus coarsely cracked pepper, for garnish\nMinced parsley\n, for garnish\nDirections\nPreheat oven to 300°F and line a baking sheet with silpat. Sprinkle 4 tablespoons of Parmigiano-Reggiano in two 4-inch rounds on silpat and bake until lightly browned and melted, about 10 minutes. Let cheese crisps cool until crisp. Break each cheese crisp into 4 pieces.\nMeanwhile, cook minced pancetta in small skillet over medium-high heat until pancetta is browned and crisp and fat has rendered, about 5 minutes. Drain crisped pancetta through strainer, reserving rendered fat, and transfer to paper-towel lined plate. You should have about 2 tablespoons crisped pancetta and at least 1 tablespoon rendered fat. Let cool slightly.\nPlace all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add 1 tablespoon crispy pancetta, 1 tablespoon rendered fat, mayonnaise, vinegar, and remaining 2 tablespoons Parmigiano-Reggiano to the yolks and, using a sturdy whisk, mash and stir together until thoroughly combined. Season with salt, and very generously with ground black pepper.\nTransfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Garnish deviled eggs with crispy pancetta, cracked black pepper, cheese crisps, and parsley. Serve immediately.\nSpecial equipment\nBaking sheet\n, baking mat, whisk\nThis Recipe Appears In\n9 In-Your-Face Deviled Egg Variations\nDeviled Eggs\nStovetop Eggs\nParmesan\nBoiled Eggs\nPancetta & Guanciale"
}