{
  "url": "https://www.seriouseats.com/deviled-eggs-chorizo-smoked-paprika-recipe",
  "image_url": null,
  "tags": [
    "Deviled Eggs",
    "Soul Food & Southern",
    "Boiled Eggs",
    "Quick Snacks"
  ],
  "title": "Deviled Eggs With Crispy Chorizo, Chorizo Oil, and Smoked Paprika Recipe",
  "full_text": "Deviled Eggs With Crispy Chorizo, Chorizo Oil, and Smoked Paprika Recipe\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n20 mins\nTotal\n15 mins\nServes\n8 deviled egg halves\nMakes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\ndry-cured Spanish style chorizo\n, finely diced\n6\nlarge\nhard-boiled\nor\nhard-steamed eggs\n, peeled and halved lengthwise\n3\ntablespoons\nmayonnaise\n1 1/2\nteaspoons\nminced parsley\n, plus more for garnish\n1\ntablespoon\nfresh lemon juice\nfrom\n1\nwhole\nlemon\n1 1/2\nteaspoons\nsherry vinegar\nKosher salt\nand freshly\nground black pepper\nPinch\nsmoked paprika\n, plus more for garnish\nDirections\nHeat chorizo in a small skillet over medium heat and cook, stirring frequently, until chorizo is crisp and fat is rendered, about 2 minutes. Transfer chorizo to a paper towel-lined plate, reserving extra fat separately.\nPlace all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add mayonnaise, parsley, lemon juice, and vinegar and, using a sturdy whisk, mash and stir together until thoroughly combined. Season to taste with salt and pepper.\nTransfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Garnish with crispy chorizo, drizzle with chorizo oil, and sprinkle with parsley and smoked paprika. Serve immediately.\nThis Recipe Appears In\n9 In-Your-Face Deviled Egg Variations\nDeviled Eggs\nSoul Food & Southern\nBoiled Eggs\nQuick Snacks"
}