{
  "url": "https://www.seriouseats.com/dim-sum-steamed-chinese-pork-ribs-recipe-5218065",
  "image_url": "https://www.seriouseats.com/thmb/y0FWMHG4JrrSd1pnm0UsNAa5lyQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/KenjiPorkRibs_Andrew-Valantine-d54c995e5fc84b6881f6086573bf65c5.JPG",
  "tags": [
    "Chinese",
    "Pork",
    "The Latest",
    "Breakfast & Brunch"
  ],
  "title": "Dim Sum–Style Steamed Pork Ribs With Fermented Black Beans Recipe",
  "full_text": "Dim Sum–Style Steamed Pork Ribs With Fermented Black Beans Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nBrining and Marinating Time\n60 mins\nTotal\n105 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\npork spare ribs\n, cut into individual ribs and chopped crosswise into 3/4-inch pieces (see note)\nFor the Brine:\n2\ncups\n(\n475\nml\n)\nwater\n1 1/2\nteaspoons\n(\n6\ng\n)\nbaking soda\n(see note)\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\nFor the Marinade:\n2\nteaspoons\n(\n8\ng\n)\nkosher salt\n1\ntablespoon\n(\n15\nml\n)\nShaoxing wine\nor dry sherry\n1\nheaping\ntablespoon\n(\n10\ng\n) douchi (dried Chinese\nfermented black soybeans\n; see note)\n2\nteaspoons\n(\n10\nml\n)\ntoasted sesame oil\n1\nteaspoon\n(\n4\ng\n)\ngranulated sugar\n1/2\nteaspoon ground\nwhite pepper\nTo Cook:\n1/4\ncup\n(\n32\ng\n)\ncornstarch\n1\ntablespoon\n(\n15\nml\n) peanut, rice bran, canola, or other\nneutral cooking oil\nWater\n, as needed\n1/2\nof a\njalapeño pepper\n, seeds and white ribs removed, green flesh finely diced (you can also use red or green bell pepper, or any fleshy pepper you’d like)\nSteamed white rice\n, for serving\nDirections\nIn a large bowl, cover the ribs with cold water and set in the sink. Wash the ribs, roughly swirling and squeezing them like you’re wringing out clothes (if the bones are very sharp, use gloves). When the water gets very cloudy, drain and replace it. Repeat this process until the water is mostly clear even after thoroughly agitating and squeezing the ribs, about 5 minutes. (This should take at least 5 to 6 changes of water.) Drain.\nSerious Eats / Andrew Valantine\nFor the Brine:\nIn a large bowl, stir together the water, baking soda, and salt until the solids are fully dissolved. Add the ribs and let stand at least 30 minutes at room temperature or, for more tender results, transfer to a sealed container and refrigerate for up to 12 hours.\nSerious Eats / Andrew Valantine\nDrain ribs, firmly squeezing the meat to expel excess liquid. Line a large rimmed baking sheet with a clean kitchen towel or a few layers of paper towels. Spread the ribs on top in a single layer and roll up the towel, pressing to remove excess moisture. Alternatively, you can spread the drained ribs in a salad spinner basket and spin it to remove excess moisture. Transfer ribs to a large bowl.\nSerious Eats / Andrew Valantine\nFor the Marinade:\nAdd the salt, wine, douchi, sesame oil, sugar, and white pepper to the ribs and toss to incorporate, massaging the meat until it is thoroughly coated in marinade. Proceed immediately to next step, or, for best results, let marinate for at least 30 minutes at room temperature or up to 12 hours in the fridge.\nSerious Eats / Andrew Valantine\nTo Cook:\nAdd cornstarch to ribs and marinade, tossing to combine. If there is any dry cornstarch remaining in the bowl, add water 1 teaspoon at a time, tossing thoroughly until no dry starch remains. Add the oil and jalapeño and toss to combine.\nSerious Eats / Andrew Valantine\nIn a wok or saucepan, bring 2 inches of water to a boil over high heat. Place a large bamboo steamer or steaming rack above the water. Transfer the ribs to a heatproof plate large enough to hold them in a single layer (if necessary, cook in batches or stacked bamboo steamers). Set the plate in the steamer, cover, and steam over high heat until ribs are cooked through and tender, about 15 minutes. Pork can be served immediately with steamed white rice, or you can reduce heat to low and hold it in the steamer for up to 45 minutes until you’re ready to serve it (make sure to replenish the water if it starts to run low).\nSerious Eats / Andrew Valantine\nSpecial Equipment\nWok, bamboo steamer basket or steaming rack\nNotes\nThis dish is traditionally made from the thin, lower ends of pork ribs, which have plenty of connective tissue and fat. You can typically find pork ribs chopped and ready for this recipe at any Chinese butcher. If you cannot find them, you can use a heavy cleaver to slice St. Louis–cut spare ribs at home. Slice a rack of ribs between each rib to separate into individual ribs, then, working with one rib at a time with the meatier side facing up, use a heavy cleaver to cut it into 3/4- to 1-inch lengths with very hefty whacks. Alternatively, you can use boneless country-style ribs for this recipe, cutting the meat into 3/4- to 1-inch cubes. If using boneless ribs, you’ll only need 3/4 of a pound (340g) of ribs.\nIf you already have\nsodium carbonate\nin your kitchen that you’ve made for Chinese or Japanese noodles, use 1 teaspoon (3g) of sodium carbonate in place of the baking soda for more tender results. Otherwise, baking soda will work just fine.\nDouchi are dried fermented black soybeans. They can be found at any Chinese supermarket and well-stocked Western supermarkets. If you can’t find them, you can substitute a tablespoon of prepared Chinese black bean sauce, though the color of the ribs will be darker when cooked.\nChinese\nPork\nThe Latest\nBreakfast & Brunch\nThe Wok\nWhy The Wok?\nEssays & Profiles\nWok Recipes\nWok Skills 101\nWok Skills 102\nThe Wok Gear Guide\nThe Importance of the Wok\nQ&A: Grace Young & Her Woks\nFrom China: The Future of the Wok\nSan Francisco's Iconic Wok Shop\nExcerpt: The Science of Woks\nDim Sum–Style Steamed Pork Ribs\nTofu With Peas and Silky Egg\nSichuan Stir-Fried Potatoes\nChinese Scrambled Eggs With Tomato\nTaiwanese Deep-Fried Squid Balls\nThai Chicken and Curry Stir-Fry\nJapanese Shrimp in Chili Sauce\nStir-Frying\nDeep-Frying\nBraising\nSteaming\nSmoking\nPassing-Through\nEssential Knife Skills for Wok Cooking\nSetting Up a Wok Cooking Station\nHow to Season Your Wok\nHacking Wok Hei at Home\nBest Flat-Bottomed Woks\nThe Best Torches for Wok Hei\nThe Full Wok Accessory Guide\nOutdoor Wok Burners Picks",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/dim-sumstyle-steamed-pork-ribs-with-fermented-black-beans-recipe.webp?"
}