{
  "url": "https://www.seriouseats.com/dim-sum-classics-how-to-make-crystal-skin-shrimp-dumplings-har-gow-recipe-from-scratch",
  "image_url": "https://www.seriouseats.com/thmb/32UoxSLWxE2iVJSl5rVSQN-3uAQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230804-SEA-HarGow-RobbyLozano-018-b7fbb20f1be94abfa38cfe58ee953833.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Chinese",
    "Stovetop",
    "Shrimp",
    "Christmas Appetizers"
  ],
  "title": "Har Gow (Crystal Skin Shrimp Dumplings)",
  "full_text": "Har Gow (Crystal Skin Shrimp Dumplings)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nActive\n30 mins\nResting Time\n60 mins\nTotal\n2 hrs\nMakes\n20 dumplings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n1/2\ncup\n(\n120\nml\n)\nwater\n, boiling hot\n3/4\ncup\nwheat starch\n(\n3 1/2\nounces\n;\n98\ng\n), see notes\n6\ntablespoons\ntapioca flour\nor\ntapioca starch\n(\n1 3/4\nounces\n;\n50\ng\n)\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n2\nteaspoons\n(\n30\nml\n)\nvegetable\nor\ncanola oil\n, plus more for rolling dough\nFor the Shrimp Filling:\n1/2\npound\n(\n227\ng\n)\nshrimp\n, shelled and deveined\n1\nteaspoon\nbaking soda\nOne\n2- by 3-inch piece\npork fatback\n(about\n2\nounces)\n1\n(\n5\nml\n)\nteaspoon\nvegetable\nor\ncanola oil\n1\nteaspoon\ncornstarch\n3/4\nteaspoon\nShaoxing wine\n1/2\nteaspoon\nminced\nginger\n1/2\nteaspoon\nminced garlic\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n1/2\nteaspoon\ngranulated sugar\n1/4\nteaspoon\nground white pepper\nBlack vinegar,\nfor serving\nDirections\nFor the Dough:\nIn a medium bowl, whisk together wheat starch, tapioca flour/starch, and salt. Add oil and boiling water. With a silicone spatula, mix until a shaggy dough is formed, 1 to 2 minutes. Turn dough out onto a table and knead until a smooth ball forms, about 1 minute. Wrap dough tightly in plastic wrap and set aside at room temperature.\nSerious Eats / Robby Lozano\nFor the Filling:\nFill a small pot halfway with water and bring to a boil over high heat. Add fatback and boil for 10 minutes. Drain well and transfer fatback to a paper-towel lined plate and let cool slightly, about 10 minutes.When the fatback is cool to the touch, remove and discard the skin (if the skin is attached) and mince and reserve the fat.\nSerious Eats / Robby Lozano\nMeanwhile, in a medium bowl, cover shrimp with cold water (about 1 1/2 cups) and stir in baking soda. Refrigerate 30 minutes.\nSerious Eats / Robby Lozano\nDrain and rinse shrimp under cold running water, then pat dry with paper towels. Chop shrimp into 1/4- to 1/2- inch pieces and place in a medium bowl. Add minced fatback, oil, cornstarch, Shaoxing wine, ginger, garlic, salt, sugar, and ground white pepper. Mix well and refrigerate covered for at least 30 minutes or up to 1 hour.\nSerious Eats / Robby Lozano\nTo Assemble:\nCut the dough in half. Rewrap half of the dough in plastic wrap to prevent drying; set aside. Roll the other dough half into a 12-inch long rope. Cut the rope into 12 equal sized portions, about 1/4 ounce (7g) each. Lightly oil your hands, rolling pin, and work surface. Working with 1 cut dough piece at a time (keep remaining dough pieces covered with plastic wrap), roll dough into a circle about 3 1/4- to 3 1/2-inches in diameter. Repeat with the remaining cut dough portions and the other half of the dough, applying more oil to your hands, rolling pin, and work surface as needed. Lay the finished wrappers side-by-side on a baking sheet and cover loosely with plastic wrap while shaping remaining wrappers.\nSerious Eats / Robby Lozano\nWorking with 1 wrapper at a time, place 2 teaspoons of shrimp filling in center of wrapper. Fold the wrapper in half over the filling, and pinch to seal one of the bottom corners (it can be on the left or right, depending on what feels most natural to you). Holding the dumpling in your non-dominant hand, use your thumb and forefinger on the dominant hand to create pleats, one at a time, next to the sealed corner, pleating until you’ve reached the other end. Press along the top to reinforce pleating and ensure it is well sealed. Transfer shaped har gow to a parchment-lined sheet tray. Repeat with remaining wrappers and filling.\nSerious Eats / Robby Lozano\nTo steam, bring 4 cups water to a boil in a flat-bottomed wok or 12-inch skillet. Lightly grease two parchment rounds that measure about 1-inch less in diameter than your steamer baskets. Place parchment rounds in two bamboo steamer baskets. (Alternatively, line bottom of steamer baskets with cabbage leaves). Arrange dumplings on prepared parchment so that they are not touching; stack baskets and cover. Adjust heat as needed to maintain simmer and set steamer in wok or skillet. Steam until har gow wrappers are translucent, about 7 minutes, or 9 minutes if steaming dumplings from frozen. Off heat, remove steamer from wok and let rest, covered, for 1 minute. Serve warm with black vinegar.\nSerious Eats / Robby Lozano\nSpecial Equipment\nRolling pin,\nsteamer\nNotes\nWheat starch is available at Asian grocery stores and can also be ordered online.\nPleating dumplings can be a little tricky (see\nthis post for instructions on folding purse-shaped dumplings\n).\nWhile this recipe is written for 2 steamer baskets to save in time, it will also work with one steamer basket.\nMake-Ahead and Storage\nTo freeze the dumplings, place the dumplings in a single layer and not touching on a sheet tray or a large plate lined with wax paper. Freeze until frozen, about 1 hour, then transfer har gow to a zip-lock bag or sealed container. Steam the dumplings straight from the freezer following directions in step 7.\nRead More\nWok Skills 101: Steaming\nChinese Fried Pork and Cabbage Dumplings With Homemade Wrappers (guo tie)\nThe Best Japanese Pork and Cabbage Dumplings (Gyoza)\nPork and Shrimp Siu Mai (Steamed Chinese Dumplings)\nHow to Throw a Dim Sum Party at Home\nHors D'Oeuvres\nChinese\nStovetop\nShrimp\nChristmas Appetizers"
}