{
  "url": "https://www.seriouseats.com/diner-style-ham-and-cheese-omelette-for-two-recipe-food-lab",
  "image_url": null,
  "tags": [
    "Omelettes",
    "American",
    "Ham",
    "Breakfast & Brunch",
    "Easter"
  ],
  "title": "Diner-Style Ham and Cheese Omelette for Two Recipe",
  "full_text": "Diner-Style Ham and Cheese Omelette for Two Recipe\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4 or 5\nlarge\neggs\nKosher salt\nand freshly\nground black pepper\nSmall\nbunch\nchopped\nchives\n,\ntarragon\n, or\nparsley\n2\ntablespoons\n(\n25\ng\n)\nunsalted butter\n, divided\n4\nounces\n(\n110\ng\n)\nham steak\n, diced\n2 to 3\nounces\n(\n80\ng\n)\ngrated cheddar cheese\nDirections\nCombine eggs, salt, pepper, and herbs in a medium bowl and whisk until homogeneous and frothy, about 1 minute. Allow to rest at room temperature for 10 to 15 minutes. Eggs should darken in color significantly.\nMeanwhile, melt 1 tablespoon butter in a 10-inch nonstick skillet over medium heat, swirling, until lightly browned. Add ham and cook, stirring frequently, until it has begun to brown on the edges, about 3 minutes. Transfer ham to a small bowl, add cheese, and toss to combine. Wipe out skillet with a paper towel and return it to medium heat.\nAdd remaining 1 tablespoon butter to pan and cook until lightly browned. Re-whisk eggs until foamy, then add to skillet and cook, using a silicone spatula to push edges in toward the center as they set and tilting pan to spread uncooked egg underneath. Continue pushing in edges of the eggs and tilting skillet, working all around pan, until omelette is almost set, about 45 seconds.\nSerious Eats / J. Kenji López-Alt\nSprinkle ham and cheese over half of omelette, remove from heat, cover, and let omelette sit until it reaches the desired consistency, about 1 minute.\nSerious Eats / J. Kenji López-Alt\nUsing silicone spatula, loosen edges of omelette from skillet and shake skillet to ensure it's not stuck. Carefully fold omelette in half, then slide onto a serving plate and serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\n10-inch nonstick skillet\n,\nsilicone spatula\nRead More\nWestern Omelette With Bell Pepper, Onion, Ham, and Cheese Recipe\nDiner-Style Asparagus, Bacon, and Gruyère Omelette for Two Recipe\nChinese-Style Layered Omelette Recipe\nSoufflé Omelette With Cheese Recipe\nOmelettes\nAmerican\nHam\nBreakfast & Brunch\nEaster"
}