{
  "url": "https://www.seriouseats.com/dinner-tonight-swiss-chard-and-pasta-soup",
  "image_url": "https://www.seriouseats.com/thmb/Wr7feKHfht-NBaz52QWytqbAPv4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20101231-192009-dinner-tonight-chard-chicken-liver-soup-primary-fb6da3cae8984c15920317192fe86346.jpg",
  "tags": [
    "Soups",
    "Pastas",
    "Chard"
  ],
  "title": "Swiss Chard and Pasta Soup Recipe",
  "full_text": "Swiss Chard and Pasta Soup Recipe\nClose\nJump to recipe\nCook\n45 mins\nActive\n45 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nvegetable oil\n7\nounces\norzo pasta\n(or\npasta de pluma\n)\n1\nsmall\nwhite onion\n, finely chopped\n2\nclove\ngarlic cloves\n, minced\n12\nounces\ncanned tomatoes\n, finely chopped\n8\ncups\nchicken broth\n4\nchicken livers\n, cleaned and chopped\n4\ncups\ncoarsely chopped\nSwiss chard\n1\nsmall bunch\nItalian parsley\nSalt\nCroutons\nDirections\nPour the oil into a large pot set over medium heat. When warm, add the pasta and cook, stirring often, until it is lightly browned, 3 to 5 minutes. Remove the pasta and drain in a strainer. Remove all but one tablespoon of the oil.\nWith the heat still on medium, add the onion and garlic. Cook, stirring occasionally, until the onion is translucent, about 5 minutes. Add the tomatoes, stir well, and cook until the liquid has reduced, about 10 minutes.\nMeanwhile, pour 1 cup of the broth into a small saucepan and bring to a bare simmer. Add the chopped livers, and reduce the heat to low. Cook until the livers are tender but still a little pink inside, about 10 minutes. Turn off the heat and set aside when done.\nWhen the tomatoes have reduced, pour in the remaining broth and bring to a boil over high heat. Add the Swiss chard, the parsley, and the pasta. Reduce the heat to medium, season to taste with salt, and cook until the the pasta is cooked and the chard is tender, about 15 minutes. Add the livers and cook for an additional 5 minutes.\nWhen done, discard the parsley. Ladle the soup into bowls, season to taste with salt, and garnish with croutons.\nSoups\nPastas\nChard"
}