{
  "url": "https://www.seriouseats.com/dinuguan-filipino-pork-blood-stew-5196555",
  "image_url": "https://www.seriouseats.com/thmb/cBY8ZcZ0M5_z_7e4Cbb9q-0TE4Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/DinuguanHero_1-384fcefcef654ec1b00d8fed18a8dc2c.jpg",
  "tags": [
    "Filipino",
    "Pork",
    "Braised & Stewed Pork",
    "Pork Mains",
    "The Latest"
  ],
  "title": "Dinuguan (Filipino Pork Blood Stew)",
  "full_text": "Dinuguan (Filipino Pork Blood Stew)\nClose\nJump to recipe\nCook\n2 hrs 30 mins\nTotal\n2 hrs 30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork:\n2\ntablespoons\n(\n30\nml\n)\ncanola oil\n2\ngarlic cloves\n, minced\n1/4\nmedium\nred onion\n(about\n2\nounces\n;\n60\ng\n), finely diced\nOne\n2-inch knob\nfresh ginger\n(\n25\ng\n), peeled and minced\n1 1/4\npounds\n(\n565\ng\n)\nboneless country-style pork ribs\n, cut into 3-inch pieces (see note)\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1\nteaspoon\nfreshly\nground black pepper\n6\ncups\n(\n1.4\nL\n)\nvegetable stock\nor\nwater\nFor the Blood Sauce:\n1/2\ncup\n(\n120\nml\n)\nspiced coconut vinegar\n, divided (see note)\n1\npound\n(\n450\ng\n) fresh\npork blood\n1\ntablespoon\n(\n15\nml\n)\ncanola oil\n6\nmedium\ngarlic cloves\n, minced\n1/4\nmedium\nred onion\n(about\n2\nounces\n;\n60\ng\n), finely diced\n2 to 3\nbird’s eye chiles\n, stemmed, to taste (see note)\nFish sauce\n, to taste\nCooked white rice\n, for serving\n1\nscallion\n, ends trimmed and sliced thinly on a bias, for garnish\nHomemade\nor store-bought\nfried garlic\n, for garnish\nDirections\nFor the Pork:\nIn a Dutch oven, heat oil over high heat until shimmering. Add garlic, onion, and ginger, and cook, stirring frequently, until light brown in color, about 2 minutes. Add pork and cook, stirring frequently, until pork is well browned on all sides and garlic, onion, and ginger are dark brown in color, about 5 minutes. Add fish sauce and black pepper.\nRezel Kealoha\nAdd vegetable stock or water, cover, bring to a boil, and cook for 30 minutes. Lower heat to maintain a simmer and continue to cook, covered, until pork is fork tender and almost falling apart, about 1 1/2 hours.\nRezel Kealoha\nStrain pork mixture through a fine-mesh strainer set over a large heatproof bowl; reserve strained braising liquid (you should have about 2 cups; 475ml). Transfer strained pork, garlic, onion, and ginger to a separate large bowl; set aside.\nRezel Kealoha\nFor the Blood Sauce:\nIn a medium mixing bowl, combine 1/4 cup (60ml) vinegar and pork blood; set aside.\nRezel Kealoha\nIn a 4-quart saucepan, heat oil over high heat until shimmering. Add garlic and onion and cook, stirring frequently, until light brown in color, about 2 minutes. Stir in remaining 1/4 cup vinegar and bring to a boil.\nRezel Kealoha\nAdd blood and vinegar mixture and chiles and stir to combine.\nLower heat to maintain a steady simmer and cook, stirring occasionally, until sauce reduces slightly and thickens in consistency, about 10 minutes. If sauce is too thick and viscous, stir in reserved braising liquid in 1/4 cup (60ml) increments to reach desired consistency.\nRezel Kealoha\nStir in fish sauce, 1 tablespoon at a time, until sufficiently seasoned. (If the sauce gets chunky or lumpy, use an immersion blender to smooth it out; if you don’t have an immersion blender, you can transfer sauce to a blender).\nRezel Kealoha\nFill serving bowls with rice, top with blood sauce followed by pork, then garnish with scallions and fried garlic. Serve.\nRezel Kealoha\nSpecial equipment\nDutch oven\nNotes\nYou can substitute boneless country-style pork ribs with skin-on, boneless pork shoulder. To substitute pork shoulder, cut into 3-inch cubes and follow the instructions above for pork ribs.\nYou can find spiced coconut vinegar in Asian specialty markets and online. If you can’t find coconut vinegar, cane vinegar is a great substitute, which can also be found in Asian markets and online. If all else fails, you can use apple cider vinegar.\nWe recommend using fresh pork blood. To substitute frozen blood, thaw blood in the refrigerator overnight. Take note that frozen blood often has vinegar added; if your frozen blood has vinegar in the ingredient list, omit the 1/2 cup vinegar called for in the recipe and add vinegar in 1/4 cup increments to taste.\nTraditionally, finger chiles, which are called siling mahaba, are used in the Philippines, but it’s hard to find them in the US. This recipe calls for 2 to 3 bird’s eye chiles depending on how spicy you want it. You can also substitute with an equal amount of jalapeño peppers or anaheim chiles.\nMake-ahead and Storage\nThe blood sauce can be refrigerated in an airtight container for up to 3 days or frozen for up to 1 month. You can reheat the blood sauce in the microwave or on the stovetop until warm.\nFilipino\nPork\nBraised & Stewed Pork\nPork Mains\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/dinuguan-filipino-pork-blood-stew.webp?"
}