{
  "url": "https://www.seriouseats.com/diy-sugar-cubes-homemade-sugar-cube-recipe",
  "image_url": "https://www.seriouseats.com/thmb/YBe2f2YXxfw-n_F9VKkZoqnDUks=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__diyvsbuy-sugarcubes-71537f6ec4fe4f7aa9a73417a6b4115a.jpg",
  "tags": [
    "Candy"
  ],
  "title": "DIY Sugar Cubes Recipe",
  "full_text": "DIY Sugar Cubes Recipe\nClose\nJump to recipe\nPrep\n10 mins\nActive\n5 mins\nResting Time\n8 hrs\nTotal\n8 hrs 10 mins\nServes\n10\nto 12 cubes\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\nsugar\n1/2\nteaspoon\nwater\nDirections\nCombine sugar and water until the texture is even. The sugar should still be crumbly, just slightly moistened. If it is watery, you have put in too much water and should add more sugar.\nMeasure about 1 heaping teaspoon per cube and press the mixture down firmly into a candy mold (see notes). Let cubes sit at room temperature overnight to harden, then remove from molds. Store in an airtight container at room temperature for up to 2 years.\nSpecial Equipment\nCandy molds or small ice cube tray or cake pan\nNotes\nIf you are using floral water instead of plain water, you can do a straight substitution. However, if you'd like to use bitters or an extract (like vanilla or almond), use 1/4 teaspoon water and 1/4 teaspoon bitters or extract in place of the 1/2 teaspoon of water called for in the recipe. For colored cubes, you could split the water with food color in the proportion suggested above or use all food coloring in place of the water for very brightly colored cubes.\nI used 1-teaspoon candy molds to make my sugar cubes. You could also use small ice cube molds. Another method is to spread the mixture 1/4 inch thick into a small cake pan and score with a knife to make 1/4 inch squares, then let dry and cut into cubes.\nRead More\nThe Serious Eats Guide to Sugar\nChampagne Cocktail Recipe\nOld Fashioned Cocktail Recipe\nCandy"
}