{
  "url": "https://www.seriouseats.com/diy-sesame-sticks-recipe",
  "image_url": "https://www.seriouseats.com/thmb/BBrhyxbziEqbLubdFmkc9Kfk7R8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__09__20121004-224074-sesamesticks-recipetop-4d6be2c554284beda9fd5aa66dde4ae7.jpg",
  "tags": [
    "Sesame & Tahini",
    "Vegan Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Snacks & Appetizers"
  ],
  "title": "DIY Sesame Sticks Recipe",
  "full_text": "DIY Sesame Sticks Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n45 mins\nResting Time\n45 mins\nTotal\n70 mins\nServes\n12 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nwhole wheat flour\n(about\n5\nounces\n;\n142\ng\n)\n1/2\ncup\ntoasted sesame seeds\n(about\n2\nounces\n;\n57\ng\n)\n1/4\ncup\nfine cracked wheat\n(about\n1.5\nounces\n;\n43\ng\n)\n1/4\nteaspoon\nturmeric\n1/4\nteaspoon\nbeet root powder\n(optional)\n1 1/2\nteaspoons\ngarlic powder\n, or to taste\n2 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n1/4\ncup\n(\n60\nml\n)\nsesame oil\n(plain, not toasted finishing oil)\n1/4\ncup\n(\n60\nml\n) plus\n2\ntablespoons\nwater\nCanola oil\n, for frying\nDirections\nIn a medium bowl, whisk together flour, sesame seeds, cracked wheat, turmeric, beet powder (if using), garlic powder, and salt until thoroughly combined.\nSerious Eats / Molly Sheridan\nIn a small bowl, whisk together oil and water. Stir wet ingredients into dry ingredients. Combine thoroughly, kneading any remaining bits into the dough by hand.\nDivide dough in half and wrap each in plastic, flattening into 3/4-inch-thick disks. Refrigerate for 30 minutes to allow dough to firm up before rolling.\nPour canola oil to a depth of 1 1/2 inches in a large pot or a large deep-sided skillet; heat oil over medium to 350°F (177°C). Line a rimmed baking sheet with paper towels; set aside. On a lightly floured surface, roll out dough to 1/8-inch thickness and, using a knife or pizza wheel, cut into small rectangles (approximately 1/4-inch by 3/4-inch). Alternatively, roll and cut dough to your desired shape, reworking the scraps until all the dough is used.  (Uniformity is more important than size to assure even cooking.) Leave the pieces as they are or roll each one quickly between your palms to form thin rods.\nSerious Eats / Molly Sheridan\nWorking in 3 batches, carefully add shaped dough to hot oil and fry, stirring occasionally, until deeply golden brown, about 90 seconds. Using a slotted spoon or spider, transfer fried sesame sticks to prepared baking sheet. Repeat with remaining dough, allowing the hot oil to return to 350°F in between batches. Let cool completely, about 15 minutes. Store in an airtight container.\nSerious Eats / Molly Sheridan\nSpecial Equipment\nWhisk, large pot or large deep-sided skillet, thermometer, rimmed baking sheet, slotted spoon\nI used beet powder because it is an ingredient listed in most commercial versions of the sticks. However, it seems to be more for color than for taste, so you may eliminate it if desired.\nSesame & Tahini\nVegan Snacks & Appetizers\nVegetarian Snacks & Appetizers\nSnacks & Appetizers"
}