{
  "url": "https://www.seriouseats.com/diy-amaretto-homemade-almond-liqueur-recipe",
  "image_url": "https://www.seriouseats.com/thmb/CaNU-CS6UkDw0cuOxl4pT-7a7TE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__diyvsbuy-amaretto-adbf5a5d00c34cb5b7a926ceabe3c916.jpg",
  "tags": [
    "Vodka",
    "Apricot",
    "Brandy & Cognac"
  ],
  "title": "DIY Amaretto Recipe",
  "full_text": "DIY Amaretto Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n10 mins\nActive\n30 mins\nInfusing Time\n624 hrs\nTotal\n624 hrs 50 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\ndried apricots\n1 1/2\ncups\ndistilled water\n(divided)\n1/4\ncup\napricot kernels\n(see note)\n1/4\ncup\nraw almonds\n1\ntablespoon\nfennel seeds\n1\nteaspoon\nmahlab\n(dried\nsour cherry kernels\n; see note)\n1\nallspice berry\n1\ncardamom pod\n1 1/2\ncups\n100-proof vodka\n(divided: see note)\n1\ncup\nbrandy\n1/2\ncup\nwhite sugar\n1/2\ncup\nturbinado sugar\n(see note)\n1\nteaspoon\nvanilla extract\n(optional)\nDirections\nChop the dried apricots coarsely and soak them in 1 cup warm distilled water to rehydrate, about 30 minutes.\nChop the apricot kernels and almonds coarsely. Smash fennel, mahlab, allspice, and cardamom with the mortar and pestle. They should just be broken, not finely ground.\nOnce the apricots are soft, dump any excess water and place the apricots in a sealable glass jar along with the spices. Pour in 1 cup of vodka and all the brandy. Seal and shake the jar. Let steep for 25 days, shaking frequently.\nStrain out the solids through the fine-mesh strainer, pressing down to extract as much liquid as possible then filter through a strainer lined with a large coffee filter.\nWhile the liquid is filtering, caramelize the white sugar by cooking it over medium heat in a sauce pot, stirring frequently. It will start to melt into a brown liquid. At the same time, in a second sauce pot, boil the turbinado sugar and 1/2 cup of water on medium heat to make simple syrup (see note).\nAfter about 10 minutes, the white sugar will be completely caramelized and the turbinado sugar and water will be completely integrated into a simple syrup. Turn off the heat for the simple syrup, and reduce the heat on the caramelized sugar to low. Slowly pour the hot simple syrup into the caramelized syrup a little bit at a time, stirring to incorporate it so that it doesn't harden. Small chunks may form, but they will melt as you continue to cook it. Once it is a thick mixture with no chunks, pour it into a glass jar to cool. Add the remaining 1/2 cup of vodka to this syrup.\nAfter the amaretto liquid has passed through the coffee filter, add the sugar mixture (and vanilla extract, if desired) to taste (see note). Once you are happy with the level of sweetness, let the combined mixture rest for 1 to 3 days before use. Store at room temperature for 6 months.\nSpecial Equipment\nMortar and pestle\n,\nfine-mesh strainer\n, coffee filter\nNotes\nMany health food stores carry apricot kernels, but you can also order them online. They look like almonds, but are bitter.\nMahlab are the dried kernels of a species of sour cherry, used frequently in Mediterranean cooking. It's also known as English cherry or rock cherry. Many spice shops and Mediterranean markets carry it, but you can also order it online.\nIf you cannot get 100-proof vodka, standard 80-proof vodka will also work.\nStraining through a coffee filter is a slow process, but it is necessary to remove the fine sediment.\nYou can substitute white sugar for the turbinado sugar or vice versa. Keep in mind that turbinado sugar is much richer, so you'll have to adjust by taste in the final product.\nUse caution when caramelizing sugar, since it will be scalding hot. It will turn to hard candy if you combine it with a cool liquid, so it is important you use hot simple syrup to mix.\nWhen adding the sugar mixture, start by adding less than you think you'll need and then tasting, especially if you choose to add vanilla extract at the end.\nRead More\nDIY Hazelnut Liqueur\nDIY Apricot Liqueur\nDIY Amaro\nGodfather Cocktail\nVodka\nApricot\nBrandy & Cognac",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-amaretto-recipe.webp?"
}