{
  "url": "https://www.seriouseats.com/diy-banana-liqueur-homemade-creme-de-banane-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8M5QZk6IxfRoppw3i7Fc5nsD-Ao=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__08__diybananaliqueur-ff212da498e74a10a43032eef3415df8.jpg",
  "tags": [
    "Liqueurs & Fortified Wines",
    "Banana"
  ],
  "title": "DIY Banana Liqueur",
  "full_text": "DIY Banana Liqueur\nClose\nJump to recipe\nPrep\n96 hrs\nCook\n10 mins\nActive\n10 mins\nTotal\n96 hrs 10 mins\nServes\n14 servings\nMakes\n1 2/3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\nbananas\n, peeled and sliced (see notes)\n1 1/2\ncups\nlight\nrum\n(see notes)\n1/2\ncup\nwater\n1/2\ncup\nturbinado sugar\n(see notes)\nDirections\nPlace banana slices in a sealable glass jar, then add rum. Seal and shake. Let mixture steep for 3 days at room temperature away from direct sunlight. Strain out the fruit, then filter mixture through two layers of cheesecloth, pressing down to extract liquid. Repeat the straining to get any debris that made it through the initial pass. (See notes.)\nHeat water and sugar in a pot on medium heat until it boils and forms a syrup, 7 to 10 minutes. Let syrup cool.\nCombine syrup with banana infusion. Seal in bottle or jar, then shake to mix. Let rest for a minimum of one day.\nSpecial Equipment\nFine-mesh strainer\n, cheese cloth\nNotes\nJust-ripened bananas will give the best result, though a slightly overripe banana will also work. Avoid green bananas or bananas that are already brown inside.\nThe character of rum gives depth to this liqueur, but you could also use vodka if you prefer.\nTurbinado sugar, sometimes called raw sugar, is available at most grocery stores. If you substitute white sugar, you may need to use more, so add slowly and adjust to taste. Other sweeteners, such as agave nectar, honey, and brown sugar, can be used but you will need to use less and adjust to taste.\nDouble straining is very important in this recipe, since the bananas will disintegrate a bit and leave some goo behind. Any leftover unstrained bits will cause off flavors over time.\nMake-Ahead and Storage\nBanana liqueur can be stored in the refrigerator for up to 2 months.\nLiqueurs & Fortified Wines\nBanana",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-banana-liqueur.webp?"
}