{
  "url": "https://www.seriouseats.com/diy-cherry-liqueur-how-to-make-your-own-cherry-heering-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zN1yYyg8wdHN-IQIWrMyKZd5nvo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/diy-cherry-liqueur-how-to-make-your-own-cherry-heering-recipe-hero-02-c12d7cfd605845c6853d1e351c414a2f.JPG",
  "tags": [
    "Liqueurs & Fortified Wines"
  ],
  "title": "DIY Cherry Liqueur",
  "full_text": "DIY Cherry Liqueur\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n20 mins\nInfusing Time\n288 hrs\nTotal\n288 hrs 15 mins\nServes\n20 servings\nMakes\n2 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n6\ncups\nBing cherries\n, pitted (see note)\n1\ncup\nbrandy\n(see note)\n1/2\ncup\nvodka\n1\ncup\nwater\n1\ncup\nsugar\n1\ncinnamon stick\n, broken (optional, see note)\nDirections\nPlace pitted cherries in a sealable glass jar and, using a wooden spoon or muddler, muddle them to release some juice. Drain juice into a small pot and set aside. Add brandy, vodka, and cinnamon stick to jar with muddled cherries. Seal and shake jar. Let muddled cherries mixture steep for one week at room temperature, shaking every few days; keep out of direct sunlight.\nSerious Eats / Eric Kleinberg\nIn the meantime, add sugar and water to pot with reserved cherry juice. Bring to a boil over high heat, and cook, stirring frequently, until sugar dissolves. Remove from heat and let cool. Once cool, pour into a separate jar, cover, and refrigerate.\nSerious Eats / Eric Kleinberg\nAfter one week has passed, add chilled cherry syrup to jar with muddled cherry mixture, shake to combine, and let steep for an additional 2 to 5 days.\nSerious Eats / Eric Kleinberg\nStrain contents of jar through fine-mesh strainer lined with cheesecloth into a sterilized glass jar or bottle. Store in the refrigerator for up to 3 months.\nSerious Eats / Eric Kleinberg\nSpecial Equipment\nSmall pot\n,\nfine-mesh strainer\n,\ncheesecloth\n, glass jar\nNotes\nBing cherries are sweet and easy to find. However, you could use tart cherries for a less sweet result, or mix a variety of cherries together. If using frozen, let them defrost before use. To add a little bitterness and a slight almond flavor, you could leave the pits in some or all of the cherries.\nIf you prefer a stronger brandy flavor, substitute more brandy for the vodka. Other spirits such as bourbon and rum could also work well.\nCinnamon is optional; you could skip or substitute another spice such as allspice, cardamom, or mace.\nMake-Ahead and Storage\nCherry liqueur can be stored in a sealed jar in the refrigerator for up to 3 months.\nRead More\nBrandied Cocktail Cherries Recipe\nDIY Blackberry Liqueur Recipe\nTart Cherry Cocktail Recipe\nLiqueurs & Fortified Wines",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-cherry-liqueur.webp?"
}