{
  "url": "https://www.seriouseats.com/diy-cultured-buttermilk-recipe",
  "image_url": "https://www.seriouseats.com/thmb/lkobG2PSXRBo21WhvoYyc1mrLh4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__11__20121115-229182-DIY-buttermilk-recipe-c35e8ac21192473893343054d8ecfeee.jpg",
  "tags": [
    "Buttermilk"
  ],
  "title": "DIY Cultured Buttermilk Recipe",
  "full_text": "DIY Cultured Buttermilk Recipe\nClose\nJump to recipe\nPrep\n5 mins\nActive\n2 mins\nCulturing/Chilling time\n30 hrs\nTotal\n30 hrs 5 mins\nServes\n2 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nbuttermilk\n(store-bought or activated dried starter)\n2\ncups\nmilk\n(whole, 2%, or skim, depending on your nutritional needs and preferences)\nDirections\nIn a mason jar or other glass container, thoroughly mix the starter and milk. Cover with a coffee filter or piece of cheese cloth (do not seal tightly with a lid) and leave to culture out of drafts at a warm room temperature (between 70-78°F or 21-26°C is recommended) until milk has clabbered (10-24 hours).\nTo test if the milk has thickened, tip the jar slightly. It should move away from the wall of the jar as a single mass. Just as with yogurt making, once the milk sets, it will get more tart the longer you allow the culturing to continue.\nRefrigerate to halt culturing for at least 6 hours. Stir before using.\nSpecial Equipment\nMason jar or other glass container, coffee filter or cheesecloth\nNotes\nYou can make larger (or smaller) volumes as needed. I use a ratio of one tablespoon starter for every cup milk with reliable results. Unless your culture was not designed to be perpetuated (some freeze-dried options fall into this category), you can reserve a bit of each batch to culture the next.\nSome recipes indicate that you should pasteurize your milk (at 180°F) before culturing or at least warm it to 76°F (24°C). This step is entirely unnecessary, as store-bought milk is all pasteurized before it hits the shelves.\nRead More\nButtermilk Ice Cream\nThe Best Buttermilk-Brined Southern Fried Chicken\nThe Food Lab's Buttermilk Biscuits\nButtermilk Vanilla Waffles\nBest Buttermilk Blue Cheese Dressing\nButtermilk"
}