{
  "url": "https://www.seriouseats.com/diy-tonic-water-homemade-tonic-for-gin-recipe",
  "image_url": "https://www.seriouseats.com/thmb/gp4x4zOZ2tp9VeeKERrPT8Q3EOw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210615-DIY-Tonic-Water-Recipe-liz-voltz-hero-horz-1-103a1325ee864105b2172534c0b61a74.jpg",
  "tags": [
    "Non-Alcoholic Drinks"
  ],
  "title": "DIY Tonic Water Recipe",
  "full_text": "DIY Tonic Water Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n70 mins\nActive\n70 mins\nChilling Time\n2 hrs\nTotal\n3 hrs 20 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlemon\n1\nlime\n2\ncups\nwater\n2\nteaspoons\ncut cinchona bark\n(see notes)\n1 1/4\nteaspoons\ncitric acid powder\n(see notes)\n1\nstalk\nlemongrass\n, sliced (about\n2/3\ncup\n)\n1 1/2\ncups\nsugar\n(see notes)\n6\ncups\ncarbonated water\nDirections\nZest lemon and lime and place in a medium saucepan. Juice lemon and lime and add juice to saucepan, along with water, cinchona bark, citric acid powder, lemongrass, and sugar. Bring to a boil on high heat.\nSerious Eats / Liz Voltz\nReduce heat to medium-low and cook for 45 minutes. Remove from heat and let mixture steep for 20 minutes.\nSerious Eats / Liz Voltz\nStrain mixture through two layers of cheesecloth placed in a fine-mesh sieve. Strain again if there are still particles to be removed. This liquid is the tonic syrup (see notes).\nSerious Eats / Liz Voltz\nPlace tonic syrup in a sealable glass container and refrigerate for at least 2 hours before use.\nSerious Eats / Liz Voltz\nTo make tonic water, combine syrup with carbonated water, mixing 1 part syrup to 4 parts water. Do not combine them in a large batch unless you intend to use all the tonic water at once. Instead, combine syrup and fresh carbonated water for each individual use.\nSerious Eats / Liz Voltz\nNotes\nLhasa Karnak sells cinchona bark online and at their Berkeley locations. Some Latin or Asian markets carry it as well. I used cut bark rather than powder because it is easier to filter and provides a bold flavor.\nCitric acid powder, also known as sour salt, is easy to find at most markets, but you can order it online from Amazon, too.\nYou can substitute agave nectar for the sugar, but be aware that you will need less—about 2/3 cup of agave for every 1 cup of sugar.\nIf you don't have cheesecloth, you can strain the mixture through a fine-mesh sieve and then strain again through a coffee filter.\nNon-Alcoholic Drinks",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-tonic-water-recipe.webp?"
}