{
  "url": "https://www.seriouseats.com/diy-gomme-syrup-recipe-how-to-make-gum-syrup-for-cocktails",
  "image_url": "https://www.seriouseats.com/thmb/KxjoKfutVBqaX6iE-u4K4s0ceMM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__072712-215518-diyvsbuy-gommesyrup-534940d474a9436c92aed623f895f964.jpg",
  "tags": [
    "Cocktails"
  ],
  "title": "DIY Gomme Syrup Recipe",
  "full_text": "DIY Gomme Syrup Recipe\nClose\nJump to recipe\nCook\n20 mins\nActive\n15 mins\nStanding Time\n3 hrs\nTotal\n3 hrs 20 mins\nServes\n10 servings\nMakes\n1 1/4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\nwater\n(divided)\n4\ntablespoons\npowdered gum arabic\n1 1/3\ncups\nsugar\nDirections\nHeat 1/4 cup of water to a near-boil, about 3 minutes. Put gum powder in a glass or small jar, then slowly stir in hot water. Stir together until all the powder is integrated. (Some small white clumps may remain.) Let this mixture sit for 2 to 3 hours. When it looks more like a gel, stir again to smooth out the mixture. (It's OK if there is a small layer of white foam.)\nHeat remaining water with sugar until it forms a syrup, about 7 to 10 minutes. Turn off heat, and then slowly stir in the gum mixture. Simmer on low heat for about 5 minutes while stirring briskly. Do not bring to a boil. You'll end up with a very thick syrup that may have a fine layer of white foam on top. Let this cool.\nOnce the syrup is cooled, stir again and skim off small clumps or thick foam, if any. Transfer to a glass jar or bottle and store in the refrigerator for up to 5 months.\nNotes\nGum arabic is also known as acacia gum or mesca. Some baking specialty stores or\nnatural foods stores\ncarry it. You can also order it from Amazon. Be sure to buy food-grade gum. Adding one tablespoon of vodka to the mixture before storing will extend the life of your syrup for another month or more.\nCocktails"
}