{
  "url": "https://www.seriouseats.com/diy-allspice-dram-make-your-own-st-elizabeths-pimento-dram-recipe",
  "image_url": "https://www.seriouseats.com/thmb/a0AkXG2Xh9ePMFC3I_k5w8dqn9g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__0201812-191974-diyvsbuy-allspicedram-bd80090af7f44b2dadc4830117264b33.jpg",
  "tags": [
    "Rum"
  ],
  "title": "DIY Allspice Dram Recipe",
  "full_text": "DIY Allspice Dram Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n15 mins\nInfusing Time\n336 hrs\nTotal\n336 hrs 20 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\nwhole allspice berries\n1\ncup\nlight rum\n1\ncinnamon stick\n1 1/2\ncups\nwater\n2/3\ncup\nbrown sugar\nDirections\nCrush allspice berries in a mortar and pestle or grind them in a spice grinder. You want coarse, large pieces and not a fine grind.\nPlace crushed allspice in a sealable glass jar and pour rum on top. Seal the jar and shake well. Let this mixture steep for 4 days, shaking daily. On day 5, break up the cinnamon stick and add it to the mixture.\nAfter 12 days total steeping (see notes), strain out the solids through a fine-mesh strainer. Then strain again through a coffee filter into your final bottle or jar.\nHeat water and sugar on medium until boiling, stirring to dissolve, about 5 minutes. Let syrup cool, then add it to the strained allspice infusion. Shake and let rest for a minimum of 2 days before using (see notes).\nSpecial Equipment\nMortar and pestle\n(or\nspice grinder\n),\nfine-mesh strainer\n, coffee filters\nNotes\nUnlike many DIY liqueurs, opening and sampling your allspice dram as you go isn't going to give you a good indication of what the final product will taste like. While it may smell strong (and taste strong) early in the steeping process, the extra time is necessary.\nIf you choose to substitute an overproof rum, you may need to let the final strained liqueur rest longer.\nMake-Ahead and Storage\nStore at room temperature for one to two months. It isn't going to spoil, but the flavor will change over time if you keep it too long.\nRead More\nAncient Mariner\nJalisco Pear\nLion's Tail\nDIY Falernum\nRum",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-allspice-dram-recipe.webp?"
}