{
  "url": "https://www.seriouseats.com/diy-homemade-grape-soda-recipe-concord-grape",
  "image_url": "https://www.seriouseats.com/thmb/TZ93t0AszfcgxNsOKM9G8pjAhKE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130208-239870-diygrapesoda-1ad6368e65394065b9c5f6317a2318b4.jpg",
  "tags": [
    "Non-Alcoholic Drinks",
    "Grape"
  ],
  "title": "DIY Grape Soda Recipe",
  "full_text": "DIY Grape Soda Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n30 mins\nResting/Chilling Time\n72 hrs\nTotal\n72 hrs 40 mins\nServes\n4\nto 6 servings\nMakes\n1 1/2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n3\ncups\nConcord grape juice\n(see note)\n2 1/2\ncups\nfiltered water\n1/2\ncup\nlight agave nectar\n(see note)\n1\ntablespoon\nzest\nfrom\n1\nlemon\n(preferably\nMeyer lemon\n)\n1/8\nteaspoon\nChampagne yeast\nDirections\nCombine grape juice, water, agave nectar, and lemon zest in a large pot and bring to a boil over medium heat. Reduce to a bare simmer and cook for 30 minutes, stirring occasionally.\nLet the mixture cool to room temperature, then strain out the lemon zest. Add the yeast and cover the pot with a kitchen cloth. Let sit for 24 hours.\nPour the liquid into a clean plastic soda bottle, leaving 1- to-2 inch space at the top. Put the cap on tightly and let rest at room temperature for 24 hours.\nOpen the bottle to check the carbonation, being careful to release the gas slowly to avoid explosion or overflowing. If you are happy with the amount of carbonation, put the closed bottle in the refrigerator for 24 hours before serving. Otherwise, reseal bottle and allow to continue to ferment until desired carbonation level is achieved. Keep refrigerated for up to 2 weeks.\nSpecial Equipment\nMicroplane grater, fine-mesh strainer, funnel, plastic bottle with cap\nNotes\nYou can juice Concord grapes for this recipe or buy 100% pure Concord grape juice. If you'd like to use sugar instead of agave nectar, use half as much by volume. If using an alternative sweetener such as stevia, consult the packaging to see how much to use, as it varies based on whether the sweetener is liquid, powdered, or mixed with other ingredients.\nChampagne yeast (also called Prise de Mousse) can be found in most brew shops. You can order it online. A 10-gram vial is enough to make gallons of soda.\nNon-Alcoholic Drinks\nGrape"
}