{
  "url": "https://www.seriouseats.com/diy-elderflower-cordial-st-germain-homemade-recipe",
  "image_url": "https://www.seriouseats.com/thmb/r-CpvDrQuvk-RXtIbEBYZecPB4w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/diy-elderflower-cordial-st-germain-homemade-recipe-hero-23e9c5fbf82c4c0c8be88d135e99306b.jpg",
  "tags": [
    "Non-Alcoholic Drinks"
  ],
  "title": "DIY Elderflower Cordial",
  "full_text": "DIY Elderflower Cordial\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n15 mins\nInfusing Time\n24 hrs\nTotal\n24 hrs 15 mins\nServes\n16 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nwater\n2\ncups\nsugar\n1/4\ncup\ndried elderflowers\n(see note)\n1\nMeyer lemon\n(see note)\n1 1/2\nteaspoons\ncitric acid\n(see note)\nDirections\nBring water and sugar to a boil over medium heat until sugar dissolves, 5 to 7 minutes. Remove from heat and let simple syrup cool.\nSerious Eats / Qi Ai\nWash and slice Meyer lemon and place in a sealable glass jar along with elderflower and citric acid powder. Pour in cooled simple syrup, seal, and shake. Store in refrigerator for a minimum of 24 hours (and up to 72 hours, if stronger flavor is desired).\nSerious Eats / Qi Ai\nStrain cordial through cheesecloth into desired container, pressing down to extract all the liquid. Store in a sealed glass container in refrigerator for up to 3 months (see note).\nSerious Eats / Qi Ai\nSpecial Equipment\nCheesecloth\nNotes\nDried elderflowers can be found in many Latin grocery stores. Some homebrew and winemaking shops carry them as well. If you have access to fresh elderflower blossoms, do not dry them, as they will produce a more fragrant and delicate cordial when used fresh. You will, however, have to use at least twice as much by volume. Be sure to pick them when they smell fresh rather than when they start to yellow on the plant.\nMeyer lemons can be found in high-end grocery stores during the winter citrus season. If not available, half a regular lemon and half an orange can be used in the place of one Meyer lemon.\nCitric acid powder, also known as sour salt, is easy to find at many markets, but you can order it online from Amazon, too. It not only boosts the acidity of the cordial, but it also acts as a preservative.\nMake-Ahead and Stoarge\nStore in a sealed glass container in refrigerator for up to 3 months. If you omit citric acid, store for no more than 3 weeks, or until cordial appears cloudy. If you use vodka as a preservative in place of citric acid, store for no more than 6 weeks, or until cordial appears cloudy.\nRead More\nOrgeat Recipe\nOleo-Saccharum (Lemon Syrup) Recipe\nDIY Orange Liqueur Recipe\nBeretta's Pamplemousse Recipe\nNon-Alcoholic Drinks",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-elderflower-cordial.webp?"
}