{
  "url": "https://www.seriouseats.com/diy-coconut-rum-homemade-captain-morgans-recipe",
  "image_url": "https://www.seriouseats.com/thmb/sS-7GhaeBeRGfdFLjWCWbY1h2vM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__diyvsbuy-coconutrum-f176c4f9ef60433c9015f1ce6f83bd03.jpg",
  "tags": [
    "Rum",
    "Coconut"
  ],
  "title": "DIY Coconut Rum Recipe",
  "full_text": "DIY Coconut Rum Recipe\nClose\nJump to recipe\nPrep\n10 mins\nActive\n15 mins\nInfusing Time\n336 hrs\nTotal\n336 hrs 10 mins\nServes\n20 servings\nMakes\n2 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\n,\nripe coconut\n2 1/2\ncups\nlight rum\nDirections\nLocate the three black dots, or \"eyes,\" on the coconut. Hold the coconut securely, then pierce a hole through one of the eyes by tapping the screwdriver with the hammer. Drain the coconut water out and reserve it for another use.\nWith a firm hold on the coconut with one hand, use the other hand to tap forcefully around the center equator of the coconut with the hammer. Rotate the coconut and continue to tap along the equator until you see a crack forming. (Some stores will even start a hairline crack in the coconut in order to make this process easier.) Once the crack has gone across most of the coconut, pry the coconut apart with your hands or with the screwdriver.\nUse a sharp knife to separate the white coconut meat from the coconut shell. Discard shell. Chop coconut meat into chunks—you will get around 10 ounces of coconut meat.\nPlace the coconut chunks in a sealable glass jar and pour in rum. Seal and shake. Let it steep for a minimum of 2 weeks and up to 3 weeks, shaking often. Sample as you go to see how the flavor is progressing. Once desired flavor is achieved, remove the coconut chunks. Strain through cheesecloth or coffee filter, then store in a glass bottle or jar at room temperature for up to a year.\nSpecial Equipment\nHammer, screwdriver or ice pick, sharp knife, cheesecloth or coffee filter\nNotes\nIf you cannot find a whole coconut, you can substitute dehydrated, unsweetened coconut chunks. Soak them in warm water until they are moist again, about 30 minutes. The flavor will not be as bright as with a fresh coconut, and you may have to adjust your steeping time.\nIf you have access to a fresh coconut, don't be scared off by having to crack it open—it's easier than it seems and the sweet flavor is worth the extra effort. Be sure to select a ripe coconut that's brown on the outside, rather than a green young coconut. When you shake it, you should hear a lot of liquid slosh around. (I was able to get 12 ounces of coconut water out of mine.) Your coconut meat should be white without any mold. I've outlined my method for opening a coconut here, but use whichever method you feel is the most safe and effective for you.\nIf you decide to add spices or herbs to your steeping mixture, keep in mind that they will release their flavor more quickly than the coconut. So you should put them in the jar toward the end of the steeping time, and remove them if the flavor starts to take over.\nRead More\nThe Serious Eats Guide to Rum\nRum\nCoconut",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-coconut-rum-recipe.webp?"
}