{
  "url": "https://www.seriouseats.com/doenjang-jjigae-korean-fermented-bean-paste-stew",
  "image_url": "https://www.seriouseats.com/thmb/sEPCZGtTNTbi4pGM0nGl3e-UB24=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181102-doenjang-jjigae-vicky-wasik-10-8fbe8600e58c4b2d95095d5ab3098885.jpg",
  "tags": [
    "Soups",
    "Korean",
    "Stovetop Seafood",
    "Clams",
    "Anchovies"
  ],
  "title": "Doenjang Jjigae (Korean Fermented Bean Paste Stew) Recipe",
  "full_text": "Doenjang Jjigae (Korean Fermented Bean Paste Stew) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n30 mins\nPurging Time\n60 mins\nTotal\n105 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Stock:\n2 1/2\ncups\n(\n600\nml\n) rice-rinsing water or\nwater\n(see note)\n10-15\ndried anchovies\n, heads and entrails removed\n1\npiece\ndashima (also sold as\nkombu\n, which is the Japanese name)\nFor the Stew:\n1/2\npound\n(\n250\ng\n) littleneck or\nmanila clams\nKosher\nor sea\nsalt\n4\ndried shiitake\nmushrooms\n1/2\nsummer\nsquash\n(about\n5\nounces\n;\n150\ng\n), such as\nzucchini\n, sliced crosswise about 1/8 inch thick\n1/2\nsmall\nonion\n(\n1 1/2\nounces\n;\n40\ng\n), sliced\n1\n(2-inch)\npiece\ndaepah (Korean giant scallion), white part only, or\n2\nmedium\nscallions\n, white and light green parts only, thinly sliced\n1 1/2\nounces\n(\n40\ng\n) dallae (\nKorean wild chives\n), outer skin of bulb peeled and discarded, chives washed well, then cut into 2-inch lengths (optional)\n1\nmedium\nclove garlic\n, minced\n2 to 3\ntablespoons\ndoenjang\n(Korean fermented soybean paste), such as Togul\n1/2\nfresh red chile pepper\n, thinly sliced\n1/2\nfresh green chile pepper\n, thinly sliced\nJoseon ganjang\n(Korean \"soup\" soy sauce), to taste (optional)\nHot rice and\nkimchi\n, for serving\nDirections\nFor the Stock:\nIn a medium saucepan, combine rice-rinsing water (or water) with anchovies and dashima and bring to a low simmer. Cover the saucepan halfway with a lid and maintain low simmer for 15 minutes. Taste an anchovy; if it still has a noticeable amount of flavor left in it, continue simmering until most of the flavor has been cooked out. Strain, discarding solids.\nMeanwhile, For the Stew:\nFill a large bowl with cold water and stir in enough salt to make it salty like the sea. Add clams and let stand 30 minutes. Lift clams from water and discard purging water; if there is sand in the bottom of the bowl, rinse it out and repeat this process until clams no longer release sand into the water (usually 2 to 3 purging cycles). Drain clams, discarding any that are gaping open and refuse to close when prodded.\nIn a small heatproof bowl, cover mushrooms with boiling water and let steep until rehydrated, about 10 minutes. Drain, then slice mushroom caps 1/4 inch thick.\nSerious Eats / Vicky Wasik\nAdd stock to a large saucepan or earthenware pot. Bring to a boil. Add mushrooms, summer squash, onion, scallion, and wild chives (if using). Return to a boil and cook until the vegetables are beginning to become tender, about 5 minutes. Add garlic and doenjang (try dissolving the doenjang through a sieve to prevent lumps from forming).\nSerious Eats / Vicky Wasik\nSimmer for 2 minutes longer, then add clams. Cook until clams begin to pop open. Add red and green chiles and continue cooking until all the clams are open.\nTaste the broth, and add joseon ganjang, if desired, to increase the savory, salty flavor. Serve doenjang jjigae hot, with sides of rice and kimchi.\nNotes\nSsal-ddeumul\n(쌀뜨물, or rice-rinsed water) is a useful ingredient in Korean cooking, both for its nutrients and the mild, starchy flavors it adds to food. Use the cloudy water that runs off from the second or third time you wash your uncooked rice (not the first, which might have dust and other impurities).\nMake-Ahead and Storage\nThe stew can be stored in the refrigerator for up to 4 days, then reheated when ready to serve. Thin with water if it becomes too reduced and salty.\nRead More\nHow To Stock a Korean Pantry\nAn Introduction to the Spicy, Funky World of Korean Soups and Stews\nAn Introduction to Korean Barbecue\nKimchi 101\nSoups\nKorean\nStovetop Seafood\nClams\nAnchovies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/doenjang-jjigae-korean-fermented-bean-paste-stew-recipe.webp?"
}