{
  "url": "https://www.seriouseats.com/dolma-recipe-8629703",
  "image_url": "https://www.seriouseats.com/thmb/A1ofyn7zHLSB07MBXXW-MmYT9AU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240422-SEA-Dolma-Amanda-Suarez-10-8dd001c44b5a4384b6bb69c17e855d89.jpg",
  "tags": [
    "Armenian",
    "The Latest",
    "Bell Peppers",
    "Ground Beef",
    "Braised & Stewed Vegetables"
  ],
  "title": "Dolma (Rice-and-Meat Stuffed Vegetables)",
  "full_text": "Dolma (Rice-and-Meat Stuffed Vegetables)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n60 mins\nTotal\n2 hrs\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n10\nlarge\nred, yellow, orange, or green\nbell peppers\n(about\n5 3/4 ounces\n;\n166 g\neach)\n7\ncups\n(\n1.7\nL\n)\nwater\n, divided\n1 1/4\ncups\nlong-grain white rice\n(\n10 1/2\nounces\n;\n300\ng\n)\n3/4\npound\n(\n340\ng\n)\nground lamb\nor\n85% lean ground beef\n4\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; if using\ntable salt\n, use half as much by volume\n1/4\nteaspoon\nbaking soda\n6\ntablespoons\nunsalted butter\n(about\n3\nounces\n;\n84\ng\n), divided\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n226\ng\n), finely minced\n6\nmedium cloves\ngarlic\n(\n30\ng\n), 4 minced and 2 crushed, divided\n1\nteaspoon\ndried basil\n1\nteaspoon\ndried mint\n1/2\nteaspoon\nfreshly ground\nblack pepper\n1/2\nteaspoon\nground dried\nAleppo pepper\n(or\npaprika\nor\ngochugaru\n; see notes)\n2\ntablespoons\nfresh parsley\nflat-leaf parsley leaves\n, chopped\nOne\n6-ounce can\ntomato paste\n, divided\n1\ntablespoon\n(\n15\nml\n)\nMiddle Eastern mild red pepper paste\n3\ntablespoons\n(\n45\nml\n)\nlemon juice\nfrom\n1\nwhole\nlemon\nPlain yogurt\n, for serving\nDirections\nUsing a sharp knife, cut 1/2 inch off the stem end of peppers and set aside. Carefully run a paring knife along the cavity of the pepper to remove core, seeds, and ribs. Repeat with remaining peppers. Discard stems and finely mince pepper tops.\nSerious Eats / Qi Ai\nIn a medium saucepan, bring 4 cups (960ml) water to a boil over high heat. Add rice and return to a rolling boil, stirring occasionally, until rice is al dente, 5 to 7 minutes. (There should still be a firm core of undercooked rice in the center of each grain). Using a fine-mesh strainer, drain rice over the sink and immediately rinse with cold running water until rice is cool and water runs clear, about 1 minute. Place strainer over now empty pot and set aside to drain.\nSerious Eats / Qi Ai\nIn a large bowl, combine lamb or beef with 2 teaspoons salt and 1/4 teaspoon baking soda. Knead gently to combine set aside. Adjust oven rack to the lower middle position and heat oven to 375˚F (190ºC).\nSerious Eats / Qi Ai\nIn an 8-quart Dutch oven, melt 4 tablespoons (56g) butter over medium heat. Cook onion, pepper trimmings, and 1/2 teaspoon salt, stirring frequently,  until onion is softened and translucent, 8 to 10 minutes. Add minced garlic, basil, mint, black pepper, and Aleppo pepper. Cook, stirring constantly, until fragrant, about 30 seconds. Transfer onion mixture to bowl with meat. (Do not wash out pot.) Add rice to meat mixture, along with parsley, 2 tablespoons (30ml) tomato paste, and pepper paste. Knead mixture gently until uniform.\nSerious Eats / Qi Ai\nUsing a spoon, fill prepared peppers with rice and meat mixture, leaving about 1/4-inch headspace in each one. (Each pepper should get about 1/2 cup or 120g of filling.)\nSerious Eats / Qi Ai\nIn the same Dutch oven, combine 3 cups (720ml) water, crushed garlic cloves, lemon juice, remaining tomato paste, 2 tablespoons (28g) butter, and 1 1/2 teaspoons salt. Bring to a boil over high heat. Remove from heat and place vegetables in pot, cut sides up, packing them side by side as tightly together as needed in a single layer. Cover and heat over medium-high heat until liquid comes to vigorous simmer, about 5 minutes.\nSerious Eats / Qi Ai\nSet an overturned small ovenproof plate directly on peppers to weigh them down. Cover Dutch oven with lid and transfer to oven. Cook until rice is fully tender and peppers are soft, about an hour.\nSerious Eats / Qi Ai\nUsing tongs, carefully transfer peppers to a high-sided serving platter. Season sauce to taste, and ladle over and around peppers. Serve with yogurt and additional Aleppo pepper on the side.\nSerious Eats / Qi Ai\nSpecial Equipment\n8-quart Dutch oven, fine-mesh strainer, tongs\nNotes\nYou can find Aleppo pepper at Middle Eastern markets or online. Korean gochugaru or paprika can be substituted for the Aleppo pepper in this recipe.\nMake-Ahead and Storage\nThe filling can be made up to 24 hours in advance and refrigerated in an airtight container.\nThe uncooked, filled vegetables can be made up to 24 hours in advance and refrigerated in an airtight container.\nArmenian\nThe Latest\nBell Peppers\nGround Beef\nBraised & Stewed Vegetables",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/dolma-rice-and-meat-stuffed-vegetables.webp?"
}