{
  "url": "https://www.seriouseats.com/double-berry-habanero-hot-sauce",
  "image_url": null,
  "tags": [
    "Hot Sauces",
    "Dairy-free",
    "Gluten-free",
    "Vegan",
    "Vegetarian"
  ],
  "title": "Habanero Fermented Hot Sauce With Berries",
  "full_text": "Habanero Fermented Hot Sauce With Berries\nJump to recipe\nPrep\n10 mins\nFermentation Time\n168 hrs\nTotal\n168 hrs 10 mins\nServes\n32\nto 40 servings\nMakes\n2\nto 2 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\nFor The Mash:\n8\nounces\n(\n225\ng\n)\nblackberries\n8\nounces\n(\n225\ng\n)\nblueberries\n5 1/3\nounces\n(\n150\ng\n)\nhabanero chile peppers\n(about\n25\npeppers\n), stemmed\n3\ntablespoons\n(\n30\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\nuse half as much by volume or the same weight\nTo Finish the Hot Sauce:\n1/4\ncup\n(\n60\nml\n) distilled\nwhite vinegar\n2\nteaspoons\n(\n10\ng\n)\nsugar\nDirections\nFor The Mash:\nIn a food processor, pulse blackberries, blueberries, peppers, and salt in a food processor until berries release liquid and mixture is coarsely pureed, about 12 to 15 pulses.\nSerious Eats / Tim Chin\nTransfer mash to wide-mouth, 1-quart canning jar. Tap jar lightly on palm to remove any air pockets. Cover surface of mash with plastic wrap, pressing gently to ensure full contact, and weigh down with fermentation weight or small jar lid. Seal jar with airlock lid following manufacturer's instructions.\nSerious Eats / Tim Chin\nStore pepper mash in dark area away from sun and let ferment, maintaining an ambient temperature between 55°F (13°C) and 75°F (24°C), for 7 days; check mixture daily for signs of gas formation (mash will climb up sides of jar; this is a good sign). Starting on the 7th day, taste mash daily until it has reached a pleasantly sour flavor; the total fermentation time can take anywhere from 7 to 10 days.\nSerious Eats / Tim Chin\nTo Finish the Hot Sauce:\nTransfer mash to a blender. Add vinegar and sugar, and blend on high speed until smooth and emulsified, about 1 minute. Measure pH using strips or pH-meter to make sure sauce is about 3.4; if it is too high, lower pH to 3.4 with more vinegar, as needed.\nSerious Eats / Tim Chin\nStrain sauce through a fine-mesh strainer set over a nonreactive bowl or large container, pressing on solids to extract as much liquid as possible; reserve solids for another use (see note).\nSerious Eats / Tim Chin\nTransfer strained hot sauce to glass bottles or jar, cover, and keep refrigerated until ready to use. The sauce can be refrigerated for up to 1 month (note that because of additional sugars from the fruit, it can continue to ferment as it sits; this shouldn't be an issue under refrigeration, but can cause bubbling if left at room temperature for a while).\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n, 1-quart wide-mouth jar, small\nfermentation weight\nor small lid,\nairlock\n,\nblender\nNotes\nIf you prefer a slightly spicier sauce, increase the amount of habanero chiles to 7 ounces (200g), and decrease the blackberries and blueberries to 7 ounces (200g) each. For a much milder sauce, decrease the chile amount to 3 1/2 ounces (100g), and the berries to 8 3/4 ounces (250g) each. It’s best not to exceed 14 days of fermentation; the vibrant color will begin to fade.\nReserved strained solids from the fermentation can be mixed into a bloody mary, a salsa or relish, or blended into mayonnaise.\nMake-Ahead and Storage\nThe hot sauce can be refrigerated for up to 1 month (note that because of additional sugars from the fruit, it can continue to ferment as it sits; this shouldn't be an issue under refrigeration, but can cause bubbling if left at room temperature for a while).\nRead More\nHow to Make Fermented Hot Sauce\nThe Science of Lactic Acid Fermentation\nHabanero Hot Sauce Recipe\nPapaya-Habanero Hot Sauce Recipe\nHot Sauces\nDairy-free\nGluten-free\nVegan\nVegetarian"
}