{
  "url": "https://www.seriouseats.com/double-caramel-flan-recipe",
  "image_url": null,
  "tags": [
    "Custards, Mousses & Puddings",
    "Mexican",
    "Cinco de Mayo",
    "Easter",
    "Mother's Day"
  ],
  "title": "Double-Caramel Flan Recipe",
  "full_text": "Double-Caramel Flan Recipe\nJump to recipe\nPrep\n15 mins\nCook\n70 mins\nActive\n30 mins\nChilling Time\n8 hrs\nTotal\n9 hrs 25 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Caramel:\n3/4\ncup\n(\n5 1/2\nounces\n;\n150\ng\n)\nsugar\nFor the Custard:\n1/2\ncup\n(\n3 1/2\nounces\n;\n100\ng\n)\nsugar\n2\ncups\n(\n17\nounces\n;\n470\ng\n)\nheavy cream\n(for toasted cream version see note)\n1\ncup\n(\n9\nounces\n;\n250\ng\n)\nmilk\n3\nlarge\neggs\n(about\n5 3/4\nounces\n;\n165\ng\n)\n3\negg\nyolks\n(about\n1 1/2\nounces\n;\n40\ng\n)\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n; for\niodized salt\n, use half as much by volume or the same weight\n1\nteaspoon\n(\n5\ng\n)\nvanilla extract\nMaldon salt\nto taste\nDirections\nPreheat the oven to 325°F (160°C) and adjust the rack to the middle position. Bring 3 quarts of water to a boil to use in a water bath during baking.\nFor the Caramel:\nIn a 3-quart saucepan or saucier, add 3/4 cup (5 1/2 ounces; 150g) sugar and 3 tablespoons (1 1/2 ounces; 45g) of water. Cover with a lid and bring to a simmer over medium heat, about 3 minutes. Once the sugar has dissolved, remove the lid and cook sugar until it caramelizes and reaches the shade of golden you prefer. Carefully pour the hot caramel into a 9-inch pie plate, 2-quart soufflé dish, or another oven-safe, 2-quart baking dish. Immediately pick up the dish to swirl the caramel and evenly coat the bottom and sides. Set aside.\nSerious Eats / Vicky Wasik\nFor the Custard:\nIn the same unwashed pot that the caramel was cooked in, add the remaining 1/2 cup (3 1/2 ounces; 100g) sugar and 2 tablespoons (1 ounce; 30g) water. Once again, cook the sugar until it caramelizes and reaches your preferred shade of golden. Add the cream and milk and bring to a simmer, stirring to dissolve the caramel.\nSerious Eats / Vicky Wasik\nTempering With a Blender:\nPour the caramel, cream, and milk mixture into the pitcher of a blender. Turn blender on to low and, while the blender is running, add whole eggs, yolk, salt, and vanilla.\nTempering Eggs With a Whisk:\nIn a large mixing bowl, whisk together the whole eggs, yolks, salt, and vanilla. Slowly whisk the hot cream mixture into the eggs one ladleful at a time until it is all fully incorporated. Pour into the prepared caramel-lined dish and cover lightly with plastic wrap or foil.\nBaking the Custard:\nPrepare a roasting pan, casserole dish, or another oven-safe pan large enough to accommodate the dish holding the custard by placing a ring of foil or a wire rack inside it to act as a booster seat. Rest custard dish on top and place in oven. Once in the oven, pour boiling water into the roasting dish until about halfway up the side of the custard dish. Bake until the custard is just set to the touch, with a slight jiggle in the center and an instant-read thermometer reads 175°F (80°C) in the center, about 45 minutes. Cool fully in the refrigerator at least 2 hours, preferably overnight. When ready to serve, run a paring knife or offset spatula along the edge to loosen the flan from the dish and flip over onto a rimmed plate to catch the caramel sauce. Sprinkle with Maldon salt to taste. Keep in the fridge covered for 3 to 5 days.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nBlender\n,\ninstant-read thermometer\n,\npie dish\n,\nroasting pan\nor\ncasserole dish\nNotes\nFor an extra layer of savory and nutty flavor, toast the dairy for the flan. Combine the milk and cream with 1 teaspoon (5g) baking soda. For the pressure cooker method, pour the dairy and baking soda mixture into mason jars and gently screw on the lids until just finger-tight. Place the lids in a pressure cooker with a rack insert and 1 inch of water. Bring to full pressure and cook for 2 hours. For the sous vide method, transfer the dairy and baking soda mixture to vacuum-sealed bags and cook at 180°F (82°C) for 24 hours. Use the dairy as usual in the flan recipe.\nMake-Ahead and Storage\nThe flan will keep for 3 to 5 days covered in the refrigerator.\nRead More\nLeche Flan (Filipino Baked Custard)\nFlan Pâtissier (French Custard Tart)\nCrème Brûlée\nMexican Chocolate Flan\nCustards, Mousses & Puddings\nMexican\nCinco de Mayo\nEaster\nMother's Day"
}