{
  "url": "https://www.seriouseats.com/doughnut-muffins-recipe-11733378",
  "image_url": "https://www.seriouseats.com/thmb/QqY0jOh7C-CnG4fStM44Fw84CMU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250421-SEA-DoughnutMuffins-MorganHuntGlaze-Beauty1-87-976e3b3d184a4dceafe7ec634313dd3d.jpg",
  "tags": [
    "Muffins",
    "The Latest",
    "Recipes",
    "Desserts",
    "Doughnuts"
  ],
  "title": "Doughnut Muffins: All the Joy of a Doughnut, None of the Deep-Frying",
  "full_text": "Doughnut Muffins: All the Joy of a Doughnut, None of the Deep-Frying\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nCooling Time:\n15 mins\nTotal\n50 mins\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Batter:\n256\ng\nbleached cake flour\n(\n9\nounces\n;\n2\ncups\n), such as Swans Down\n1 1/2\nteaspoons\nbaking powder\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nground nutmeg\n(see notes)\n1/4\nteaspoon\nbaking soda\n170\ng\nsour cream\n(\n6\nounces\n; about\n3/4\ncup\n), at room temperature\n113\ng\ngranulated sugar\n(\n4\nounces\n; about\n1/2\ncup\nplus\n1\ntablespoon\n)\n113\ng\nunsalted butter\n(\n4\nounces\n;\n8\ntablespoons\n), melted, plus more for greasing\n42\ng\nneutral cooking oil\n(\n1 1/2\nounces\n;\n1/4\ncup\n), such as canola\n1\nlarge\negg\nplus\n1\negg\nyolk\n, at room temperature\nFor the Coating:\n100\ng\ngranulated sugar\n(\n3 1/2\nounces\n;\n1/2\ncup\n)\n1\nteaspoon\nground cinnamon\nPinch\nkosher salt\n28\ng\nunsalted butter\n(\n1/2\nounce\n;\n2\ntablespoons\n), melted\nDirections\nAdjust oven rack to middle position, and preheat oven to 400°F (205°C). Grease a 12-cup muffin pan with butter; set aside.\nSerious Eats / Morgan Hunt Glaze\nPrepare the Batter:\nIn a large bowl, whisk together flour, baking powder, salt, nutmeg, and baking soda in a large bowl to combine. In a medium bowl, whisk sour cream, sugar, butter, oil, egg, and egg yolk until smooth. Add sour cream mixture to flour mixture, folding in using a flexible rubber spatula until no streaks of flour remain. (Batter will be thick and dense.)\nSerious Eats / Morgan Hunt Glaze\nPlace buttered muffin pan in oven; heat until butter is melted, just starting to brown, and smells nutty, about 2 minutes.\nSerious Eats / Morgan Hunt Glaze\nUsing oven mitts or a kitchen towel, carefully remove hot pan from oven. Working quickly, portion batter into prepared muffin pan using a 1/4 cup measuring cup.\nSerious Eats / Morgan Hunt Glaze\nReturn pan to oven, and bake until tops are lightly golden, sides are browned, and a toothpick or cake tester inserted into center of muffin comes out clean, about 15 minutes. Immediately remove muffins from pan; place muffins on a wire rack.\nSerious Eats / Morgan Hunt Glaze\nFor the Coating:\nIn a wide, shallow bowl whisk sugar, cinnamon, and salt to combine. As soon as muffins are cool enough to hold comfortably, working with one muffin at a time, use a pastry brush to brush each muffin all over with melted; place in cinnamon-sugar mixture, and turn to evenly coat.\nSerious Eats / Morgan Hunt Glaze\nReturn muffin to wire rack, and repeat process with remaining muffins. Let cool until just warm, about 15 minutes, or cool completely, about 45 minutes. Serve warm or at room temperature.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\n12-cup muffin pan, toothpick or cake tester, wire rack, pastry brush\nNotes\nNonstick baking spray can be used to grease the muffin tin, but it won’t have the same flavor as the browned butter.\nIf using fresh nutmeg, finely grate it on a microplane and use 3/4 teaspoon.\nFor maximum crunch, let the muffins cool to room temperature.\nMake-Ahead and Storage\nThe muffins are best eaten on the day they’re made. Once cooled, the muffins can be stored in an airtight container at room temperature for up to 2 days, but may soften as they sit.\nMuffins can be frozen without their sugar coating in an airtight container for up to 2 months. Let thaw in refrigerator for at least 8 hours. To sugar them after thawing, place them in a 325°F (160°C) oven until just warm, then proceed with step 6 of recipe. (If you freeze muffins once they have been sugared, the sugar will dissolve as they thaw.)\nMuffins\nThe Latest\nRecipes\nDesserts\nDoughnuts"
}