{
  "url": "https://www.seriouseats.com/dry-fried-chow-fun-with-chinese-broccoli-recipe",
  "image_url": "https://www.seriouseats.com/thmb/75P-3297d2s0IDeLuCFohCm6qjM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110614-chow-fun-primary-d7ce0a0e377b4de38211cd962df4be31.jpg",
  "tags": [
    "Rice Noodles",
    "Chinese",
    "Vegetarian Mains",
    "Stir-Fry Noodles",
    "Broccoli"
  ],
  "title": "Dry-Fried Chow Fun with Chinese Broccoli Recipe",
  "full_text": "Dry-Fried Chow Fun with Chinese Broccoli Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nfresh chow fun noodles\n(see notes)\n6\ntablespoons\ncanola, vegetable, or\npeanut oil\n2/3\npound\nChinese broccoli\n(or regular broccoli, cut into small florets)\n1\nlarge\nonion\n, finely sliced from pole-to-pole\n2\ncups\nscallion greens\ncut into 1-inch segments\n2 to 3\ntablespoons\nwhole fermented black beans\n2\ntablespoons\ndark soy sauce\n1/4\ncup\noyster sauce\nDirections\nSlice noodles lengthwise into 3/4- to 1-inch segments and set aside. Heat 1 tablespoon oil in large wok over high heat until smoking. Add Chinese broccoli and cook without disturbing until well-browned, about 1 minute. Toss and continue to cook, stirring occasionally until tender but still bright green, about 2 minutes longer. Transfer broccoli to large bowl and set aside.\nHeat another tablespoon oil in wok until smoking. Add onion and cook, stirring occasionally, until well-browned and tender, about 2 minutes total. Transfer to bowl with broccoli.\nHeat remaining 1/4 cup oil in wok over high heat until smoking. Add noodles and cook, carefully lifting and separating noodles until completely heated through and lightly charred. Add broccoli, onions, scallions, black beans, soy sauce, and oyster sauce to wok. Carefully fold ingredients together, being careful to break noodles as little as possible. Cook until all ingredients are heated through and noodles are relatively dry (there should be no soupy sauce leftover). Transfer to a warm serving platter and serve.\nSpecial Equipment\nLarge\nwok\nNotes\nYou need a supply of fresh steamed rice noodles for this recipe. Check your local Chinatown or a good Asian grocery. Steamed rice noodles need to be used the day they are made. Do not refrigerate them or they will become brittle and stale very rapidly.\nRead More\nEverything You Can Do With A Wok\nHow To Make Crispy Tofu\nRice Noodles\nChinese\nVegetarian Mains\nStir-Fry Noodles\nBroccoli"
}