{
  "url": "https://www.seriouseats.com/dry-aged-roast-duck-breast",
  "image_url": "https://www.seriouseats.com/thmb/xz4dCfTdY3mMwOr1IiZDXoW-p1o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200109-duck-crowns-roasting-shio-koji-beauties-vicky-wasik3-b2463d69411a4e0cb77330ed592df34c.jpg",
  "tags": [
    "Duck Mains",
    "Duck",
    "Christmas",
    "Roasting",
    "Thanksgiving Dinner"
  ],
  "title": "Dry-Aged Roast Duck Breast Recipe",
  "full_text": "Dry-Aged Roast Duck Breast Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n10 mins\nCooling Time\n15 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ndry-aged duck crowns\n(see notes)\nKosher salt\nFor Serving:\nCoarse sea salt\nRed wine duck jus\n(optional)\nDirections\nAdjust oven rack to middle position, and preheat oven to 425°F (220°C). Using a sharp knife, remove wishbone from each duck crown, then pluck any remaining feathers from the breast area. If ducks have not been brushed with shio koji, season them all over with kosher salt (there is no need to salt them if they have been treated with shio koji). Transfer, breast side up, to a wire rack set in foil-lined rimmed baking sheet.\nRoast ducks, rotating baking sheet after 8 minutes until internal temperature registers between 120°F (49°C) and 125°F (52°C) on an instant-read thermometer at the thickest part of the breast, about 16 minutes.\nSerious Eats / Vicky Wasik\nTransfer baking sheet to kitchen counter, and let duck crowns rest until internal temperature registers between 130°F (54°C) for medium-rare and 135°F (57°C) for medium on an instant-read thermometer at the thickest part of the breast, about 15 minutes. If duck does not reach target internal temperature, return to oven to finish cooking, taking care not to overcook it.\nSerious Eats / Vicky Wasik\nOnce rested, transfer duck crowns to cutting board, carve breasts, then slice into pieces; reserve carcasses for\nduck stock\n. Serve right away, passing coarse sea salt and duck jus (if using) at the table.\nSerious Eats / Vicky Wasik\nNotes\nA duck \"crown\" describes a whole bone-in duck breast without the legs attached. Instructions for breaking down whole ducks to yield duck crowns can be found\nhere\n. Instructions for dry-aging ducks can be found\nhere\n. Our preferred treatment for duck skin for this recipe is to brush it with blended\nshio koji\nthroughout the dry-aging process.\nThis recipe was developed with Pekin and Alina ducks, but it will work with Muscovy ducks as well.\nSpecial Equipment\nRimmed baking sheet\n,\nwire cooling rack\n,\ninstant-read thermometer\nMake-Ahead and Storage\nOnce roasted, the duck is best enjoyed immediately.\nRead More\nHow to Dry-Age Duck at Home\nDuck Mains\nDuck\nChristmas\nRoasting\nThanksgiving Dinner",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/dry-aged-roast-duck-breast-recipe.webp?"
}