{
  "url": "https://www.seriouseats.com/dubai-chocolate-triangles-phyllo-recipe-11694632",
  "image_url": "https://www.seriouseats.com/thmb/M-atu14ZJO44Q6Bz0RuT7rZdC8o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250306-SEA-DubaiChocolateTriangles-AmandaSuarez-Step-30-53013569232f4161ad089c4917f06166.jpg",
  "tags": [
    "Desserts",
    "The Latest"
  ],
  "title": "Dubai Chocolate Phyllo Triangles",
  "full_text": "Dubai Chocolate Phyllo Triangles\nClose\nJump to recipe\nPrep\n30 mins\nCook\n20 mins\nCooling Time:\n45 mins\nTotal\n95 mins\nServes\n14\nto 16\nMakes\n14\nto 16\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1\nounce\nunsalted butter\n(\n28\ng\n;\n2\ntablespoons\n)\n2\nounces\n(\n57\ng\n) dried or frozen thawed\nkataifi dough\n, chopped (see notes)\n1\nounce\ntoasted\npistachios\n(\n28\ng\n; about\n1/4\ncup\n), chopped\n194\ng\npistachio cream\n(\n6 3/4\nounces\n;\n3/4\ncup\n)\n28\ng\ntahini\n(\n1\nounce\n;\n1/4\ncup\n)\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Chocolate:\n3\nounces\nbittersweet chocolate\n(\n85\ng\n; about\n1/3\ncups\n), 60-70% cacao, roughly chopped\n1/4\ncup\n(\n60\nml\n)\nheavy cream\n1\nteaspoon\nlight corn syrup\n(optional)\nFor the Triangles:\n16\nsheets\nphyllo\n(\n8\nounces\n;\n227\ng\n), thawed and rested at room temperature\n4\nounces\nunsalted butter\n(\n113\ng\n;\n8\ntablespoons\n), melted\n1\nounce\ntoasted\npistachios\n(\n28\ng\n; about\n1/4\ncup\n), chopped\nFlaky sea salt\n, for topping (optional)\nDirections\nFor the Filling:\nIn a small skillet, melt butter over medium heat until foamy, about 2 minutes. Add kataifi pastry and cook, stirring often and breaking up clumps with a wooden spoon, until browned, about 4 to 5 minutes. Transfer to a medium bowl and let rest at room temperature until cooled, about 15 minutes\nSerious Eats / Amanda Suarez\nAdd pistachios to kataifi bowl along with pistachio cream, tahini, and salt. Using a flexible spatula, gently fold to combine; set aside.\nSerious Eats / Amanda Suarez\nTo Assemble and Cook:\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Line a 13- by 18-inch rimmed baking sheet with parchment paper; set aside. Unroll the phyllo sheets and, using a sharp knife or pizza wheel, cut dough into 6- by 11-inch strips. Cover phyllo strips with a lightly damp kitchen towel until ready to use to prevent them from drying out.\nPlace one phyllo strip on a clean work surface with the short side facing you. Brush entire strip with melted butter. Fold it in half lengthwise like a book, bringing the left edge to meet the right edge, to create a strip that is 3 by 11 inches. Brush again with butter. Place a heaping tablespoon of filling (about 20g) about 1 inch from the bottom of the strip towards the right side. Fold the left bottom corner of the phyllo strip over filling to tightly enclose and form a triangle. Continue folding the triangle, flipping right and then left until you reach the end of the strip. Use a sharp knife or kitchen scissors to trim any excess phyllo pastry.\nSerious Eats / Amanda Suarez\nPlace folded triangle seam-side down on prepared baking sheet and cover loosely with another damp kitchen towel until ready to bake. Repeat with remaining phyllo strips and filling, arranging each pastry on the baking sheet about 1 inch apart.\nSerious Eats / Amanda Suarez\nBake, rotating baking sheet front to back halfway through, until lightly golden and crisp, 18 to 20 minutes. Let the triangles cool completely.\nFor the Ganache:\nPlace chocolate in a medium heatproof measuring cup or mug. In a small saucepan, stir together heavy cream and corn syrup, if using, and bring to a simmer over medium heat, about 4 minutes. Pour over chocolate and let stand until chocolate softens, about 1 minute, then stir until smooth. Cool chocolate mixture until warm but still pourable (100 to 105ºF; 38 to 40ºC), about 3 minutes.\nSerious Eats / Amanda Suarez\nHolding triangles by one corner, carefully dip half the pastry in chocolate to coat, letting any excess chocolate drip back into the cup before returning pastry to baking sheet. Sprinkle chocolate with chopped pistachios before it sets.\nSerious Eats / Amanda Suarez\nRepeat with remaining triangles. Refrigerate until set, about 10 minutes.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nSharp knife, pizza wheel, or kitchen scissors, 9-by-13-inch rimmed baking sheet, ruler, instant-read thermometer\nNotes\nYou can easily find dried kataifi online and frozen kataifi at many Mediterranean and Middle Eastern markets, often in the frozen pastry aisle.\nDesserts\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/dubai-chocolate-phyllo-triangles.webp?"
}