{
  "url": "https://www.seriouseats.com/duchess-potatoes-recipe-5220157",
  "image_url": "https://www.seriouseats.com/thmb/K86-84zMOJ1J_xSSoU4GZzodVjY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Duchess-Potatoes-beauties-02-274475eda6dc491b8ee406d22c0e9264.jpg",
  "tags": [
    "Potatoes",
    "French",
    "The Latest"
  ],
  "title": "Pommes Duchesse (Duchess Potatoes)",
  "full_text": "Pommes Duchesse (Duchess Potatoes)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nTotal\n60 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.4\nkg\n)\nYukon Gold potatoes\n, peeled and cut into 1-inch pieces (see note)\nKosher salt\nand freshly\nground black pepper\n1/3\ncup\n(\n80\nml\n)\nheavy cream\nPinch\nfreshly grated\nnutmeg\n6\ntablespoons\n(\n90\ng\n)\nunsalted butter\n, melted\n1\nlarge\negg\nplus\n2\nyolks\n, lightly beaten\nNonstick cooking spray\n(for piped individual portions only)\nMelted\nclarified butter\n, for brushing (optional)\nDirections\nAdjust oven rack to middle position and preheat oven to 450°F (230°C). In a medium pot, combine potatoes, 2 quarts cold water, and 2 teaspoons salt. Bring to a boil over high heat, then reduce heat to maintain a simmer. Cook until potatoes are tender and offer little resistance when pierced with a paring knife, about 10 minutes. Drain potatoes, then return to now-empty pot.\nSerious Eats / Amanda Suarez\nSet pot over low heat and cook, shaking constantly, until moisture has evaporated from potatoes, 30 seconds to 1 minute. Remove from heat.\nSerious Eats / Amanda Suarez\nUsing a ricer or food mill, pass potatoes into a medium bowl. Using a flexible spatula, stir in butter. Once butter is fully incorporated, stir in cream and nutmeg. Season with salt and pepper to taste. Stir in beaten egg mixture until combined, taking care not to over-mix the potatoes.\nSerious Eats / Amanda Suarez\nFor Individual Portions:\nLine a rimmed baking sheet with parchment paper and grease lightly with nonstick cooking spray. Transfer potato mixture to a pastry bag fitted with a 1/2-inch star tip. To pipe the potatoes, hold the filled pastry bag at an 80° angle, apply steady downward pressure, and pipe a 3-inch-wide mound, working in a circular motion. To stop piping, cease applying pressure and swirl the pastry tip away. Continue to pipe portions about 2 inches apart, for a total of 12 portions. Lightly coat portions with clarified butter (if using), taking care not to undo the piped design.\nSerious Eats / Amanda Suarez\nFor a Casserole:\nGrease a 2-quart baking dish, then set it on a rimmed baking sheet. Transfer 2/3 of potato mixture to prepared baking dish. Transfer remaining 1/3 to a pastry bag fitted with a 1/2-inch star tip. Using a flexible or offset spatula, smooth potato mixture in baking dish in an even layer. Pipe remaining potato on top by holding filled pastry bag at an 80° angle, and applying steady downward pressure to form small mounds in an even decorative pattern. Lightly coat portions with clarified butter (if using), taking care not to undo the piped design.\nSerious Eats / Amanda Suarez\nTransfer to oven and bake until golden brown, 15 to 20 minutes for individual portions, and about 25 minutes for a casserole; rotating baking sheet halfway through baking. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRicer or food mill, disposable pastry bag, 1/2-inch star tip, rimmed baking sheet, 2-quart baking dish (optional)\nNotes\nWe feel that creamy full-flavored Yukon Golds make the best duchess potatoes, but russets also work for this recipe. Duchess potatoes made with russets have a fluffier and slightly drier interior; if you want the texture to be closer to the Yukon Gold version, add 1 to 2 tablespoons more cream to the potato mixture in step 3.\nMake-Ahead and Storage\nThe potato mixture can be prepared through step 4, and the baking sheet of piped portions or casserole can be covered and refrigerated overnight. Allow potatoes to sit at room temperature for at least 30 minutes before baking.\nPotatoes\nFrench\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pommes-duchesse-duchess-potatoes.webp?"
}