{
  "url": "https://www.seriouseats.com/duck-a-lorange",
  "image_url": null,
  "tags": [
    "Duck Mains",
    "French",
    "Roasting",
    "Roasts",
    "Mother's Day"
  ],
  "title": "Duck à l'Orange Recipe",
  "full_text": "Duck à l'Orange Recipe\nJump to recipe\nPrep\n25 mins\nCook\n5 hrs\nActive\n5 hrs\nChilling Time\n60 mins\nTotal\n6 hrs 25 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nduck\n(about\n5\npounds\n;\n2.25\nkg\n) (see notes)\nVegetable oil\n, for drizzling\nKosher salt\n1\nmedium\n(\n2 1/2\nounces\n;\n71\ng\n)\ncarrot\n, diced (about\n1/2\ncup\n)\n1\nmedium\nyellow onion\n, diced (\n8\nounces\n;\n227\ng\n)\n1\nlarge\ncelery rib\n, diced (\n2 1/2\nounces\n;\n71\ng\n)\n2\nquarts\n(\n2\nliters\n)\nbrown beef\nor\nbrown\nchicken stock\n(see notes)\n1\ntablespoon\n(\n15\nml\n)\ntomato paste\n(optional)\n4\nounces\n(\n115\ng\n)\ngranulated sugar\n(about\n1/2\ncup\nplus\n1\ntablespoon\n)\n1/2\ncup\n(\n118\nml\n)\nred wine vinegar\nZest\nof\n1\nmedium\nnavel orange\nor\n2\nmedium\nbitter oranges\n, cleaned of any white pith and cut into a fine julienne\n2\ntablespoons\n(\n30\nml\n) fresh\nnavel orange juice\nor\n1/4\ncup\n(\n60\nml\n)\nbitter orange juice\n2\ntablespoons\nfresh lemon juice\n(omit if using bitter orange juice)\nFreshly\nground white\nor\nblack pepper\n2\ntablespoons\n(\n30\ng\n) cold\nunsalted butter\n, cut into 1/2-inch cubes\n1\nteaspoon\ncornstarch\nor\narrowroot\n(optional, only if needed)\nDirections\nIf desired, you can spatchcock the duck (see notes). To do so, use poultry shears to remove the backbone by cutting along both sides of the spine from the cavity to neck ends, then flip the duck and press down on the breast to flatten it.\nTrim away any excess skin around the duck's neck and cavity openings. Cut off duck wingettes and wing tips at the joint, leaving the drumettes connected to the duck; remove neck and any giblets from the cavity. Refrigerate trimmed wing ends, neck, and spine (if using) until ready to make the sauce; reserve giblets and trimmed skin for another use, or discard.\nSerious Eats / Vicky Wasik\nPrick duck skin all over with a sharp paring knife, especially where the skin is thickest, being careful not to cut into the meat below. In a large pot of boiling water and while wearing heavy kitchen gloves to protect your hands from the heat, dip the duck into the water for 2 minutes. Remove, allowing boiling water to drain off before transferring duck, breast side up, to a wire rack set in a rimmed baking sheet.\nSerious Eats / Vicky Wasik\nSeason duck all over, inside and out, with kosher salt. Refrigerate uncovered for at least 1 hour and up to 24 hours.\nSerious Eats / Vicky Wasik\nWhen ready to roast the duck and make the sauce, preheat oven to 425°F (220°C) and set rack in middle position. Set trimmed wings and neck (plus backbone, if you've spatchcocked the duck) on a rimmed baking sheet along with the diced carrot, onion, and celery and drizzle lightly with oil, rubbing to coat all over; if using tomato paste (it will help darken an overly white stock), rub it all over the duck and vegetables as well.\nRoast duck trimmings and vegetables, stirring one or twice, until browned all over, about 25 minutes (check often, as you do not want anything to scorch or burn).\nAdd stock to a large saucepan and bring to a simmer. Transfer roasted duck trimmings and vegetables to the stock. Pour some boiling water onto the baking sheet and scrape up any browned bits, then add that liquid to the stock, as well.\nGently simmer stock and vegetables until reduced by about half, 1 to 2 hours (timing can vary wildly as evaporation rates depend on the pot dimensions and other factors, so keep an eye on it); occasionally skim off and discard any scum or rendered fat that accumulates on the surface.\nSerious Eats / Vicky Wasik\nUsing a fine mesh strainer, strain stock and discard solids. Add stock to a smaller saucepan and continue to gently simmer until reduced to about 1 cup (225ml), 1 to 1 1/2 hours; continue to occasionally skim off any scum and keep watch while cooking as reduction time may vary. Set aside.\nMeanwhile, increase oven to 450°F (230°C). Roast duck (you can leave it on the wire rack set in the rimmed baking sheet) for 30 minutes; this can produce some smoke, so open your windows if necessary.\nReduce oven to 300°F (150°C) and continue to roast duck until an instant-read thermometer registers around 175°F in the thickest parts of the thigh and breast, about 45 minutes if the duck is spatchcocked and 1 hour if whole (it's okay if some parts of the duck get hotter, it's meant to be well done and will not harm the duck). Remove duck from oven and set aside to rest.\nWhile duck is roasting, add sugar to a small saucepan. Add 1/4 cup water and set over medium heat. Stir with a fork until syrup comes to a boil, then simmer without stirring until syrup is a very light honey color, roughly 6 minutes, shaking and swirling as needed to ensure even caramelization. Continue cooking until syrup is a deep amber color, about 1 to 4 minutes longer.\nSerious Eats / Vicky Wasik\nRemove from heat and add vinegar in very small increments while carefully swirling the saucepan; the caramel will boil and bubble violently at first, so adding the vinegar in very small amounts at first will help prevent a boil-over. Once the gastrique has calmed down, you can add the remaining vinegar more quickly, swirling the whole time. Some of the caramel may seize up at first, but it will dissolve back into the solution on its own.\nReturn gastrique to medium heat and bring back to a boil, then reduce heat to maintain a strong simmer and cook until it is very slightly reduced, about 2 minutes; stir, if needed, to dissolve any last traces of hardened sugar, then set aside.\nIn a clean small saucepan, bring about 1 cup of water to a rolling boil. Add orange zest and cook until softened, about 2 minutes for navel orange zest and 15 minutes for bitter orange zest. Drain and set blanched zest aside.\nSerious Eats / Vicky Wasik\nWhen ready to serve, return duck to oven just long enough to reheat and re-crisp the skin, 5 to 15 minutes, depending on how much it's cooled off.\nMeanwhile, add navel orange and lemon juices (or bitter orange juice) to reduced stock and bring to a simmer over medium heat, stirring often. Reduce heat to medium-low and simmer gently, stirring often and adjusting heat as needed, until reduced enough to lightly coat the back of a spoon, about 5 minutes.\nSerious Eats / Vicky Wasik\nAdd gastrique 1 teaspoon at a time until sauce tastes nicely sharp with a clear sweet-sour character. You want to taste the gastrique but not have it clobber the sauce; too much can ruin the sauce (you may only need a 2 to 4 teaspoons to accomplish this). You will have leftover gastrique, which you can reserve for another use (it can be drizzled on grilled or roasted vegetables or used in another sauce).\nSeason sauce with salt and pepper. Working over very low heat, whisk in butter until the sauce is silky and smooth; do not allow it to boil once the butter is added, lest the sauce break.\nThe sauce at this point should lightly coat the back of a spoon, and if you drag your finger through it, it should leave a clear path. If it doesn't, it may be too thin (a sign your stock didn't have enough gelatin in it originally). If this happens, add 1 or 2 teaspoons cornstarch or arrowroot to a small bowl and stir in a spoonful or two of the sauce to make a slurry with no lumps, then whisk that slurry back into the sauce, allowing it to gently simmer for a minute or two to thicken the sauce.\nAdd blanched zest and let gently simmer, stirring constantly over low heat for 1 minute to infuse the sauce.\nSerious Eats / Vicky Wasik\nCarve duck and serve, spooning sauce on top or alongside.\nSpecial Equipment\nWire rack\n,\nrimmed baking sheet\n,\ninstant read thermometer\n,\npoultry shears\n(optional)\nNotes\nOne whole duck has enough meat for two hungry diners or four less famished ones. If you are serving more people, consider doubling the recipe (you will need to double everything except the gastrique, of which this recipe produces more than enough).\nYou can leave the duck whole, or spatchcock it by using poultry shears to remove the backbone by cutting along both sides of the spine from the cavity to neck ends. Then flip the duck and press down on the breast to flatten it. Both approaches work well. The advantage of spatchcocking the duck is that you gain the backbone for the sauce, and it cooks a little faster. Leaving the duck whole is less work, and still produces great results, though.\nThis recipe requires a good quality homemade stock that's loaded with natural gelatin and flavor from beef or chicken bones and aromatic vegetables. Mass-market store-bought stocks and broths will not work here (they will make a very poor sauce), but if you live near a good butcher or other store that sells higher-quality frozen homemade beef stock, you can use it here (you'll know if it's good enough if the stock retains a firm gelled consistency at refrigerator temperatures).\nMake-Ahead and Storage\nThe duck trimmings and aromatic vegetables can be roasted in advance, infused into the stock, and the stock can be strained and reduced down to 1 cup ahead of finishing the sauce; refrigerate in an airtight container until ready to use. The gastrique can be made up to 5 days ahead and kept refrigerated. The duck can be roasted fully and then set aside at room temperature for up to 2 hours before returning to oven to reheat and crisp before serving.\nDuck Mains\nFrench\nRoasting\nRoasts\nMother's Day"
}