{
  "url": "https://www.seriouseats.com/duck-cracklings-recipe",
  "image_url": "https://www.seriouseats.com/thmb/pLuhds_PuTnuoWKQDWT0gBwhrC8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200102-duck-Gribenes-Snack-13-cd7ac936b7be47c994877bac0ced3743.jpg",
  "tags": [
    "Quick Snacks",
    "Duck",
    "Stovetop"
  ],
  "title": "Crispy Duck Cracklings With Za'atar and Sea Salt Recipe",
  "full_text": "Crispy Duck Cracklings With Za'atar and Sea Salt Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nActive\n10 mins\nTotal\n65 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n)\nduck skin and fat\n(from\n2\nwhole ducks\n), cut into 2-inch pieces\n1/2\ncup\n(\n120\nml\n)\nwater\n1\ntablespoon\n(\n8\ng\n) store-bought or homemade\nza'atar spice blend\n(see notes), plus extra as desired\nCoarse sea salt\nDirections\nIn a 3-quart saucier or saucepan, combine duck skin and fat with water and set over medium-low heat. Cook, stirring occasionally with rubber spatula to prevent skin from sticking to the bottom of the saucepan, until mixture begins to simmer and bubble rapidly, and liquid is cloudy, 10 to 15 minutes.\nSerious Eats / Vicky Wasik\nContinue to cook, stirring occasionally, until fat is fully rendered and turns golden and clear, and bubbles begin to subside, 25 to 30 minutes. Continue to cook until duck skin pieces are golden brown and crisp on all sides, about 5 minutes. Remove from heat and allow to cool slightly.\nSerious Eats / Vicky Wasik\nSet a fine-mesh strainer over a heatproof bowl. You can line the strainer with cheesecloth if you have on hand. Strain contents of saucepan through the prepared strainer.\nSerious Eats / Vicky Wasik\nImmediately transfer duck skin to a medium bowl, sprinkle with za'atar and season with sea salt to taste. Toss to evenly coat cracklings with spice mixture, adding more za'atar if desired. Transfer cracklings to a serving bowl, and serve right away. Transfer rendered duck fat to an airtight container and refrigerate for up to 6 months or freeze for up to 1 year.\nSpecial Equipment\n3-quart saucier\n,\nfine-mesh strainer\nNotes\nZa'atar is a Middle Eastern spice mixture most often made with sumac, sesame seeds, thyme, and oregano. Store-bought versions often have varying amounts of added salt, so be sure to taste it before seasoning the cracklings with sea salt. Za'atar can now be found at many well-stocked grocery stores as well as online.\nMake-Ahead and Storage\nDuck cracklings are best enjoyed immediately. Rendered duck fat can be refrigerated in an airtight container for up to six months or frozen for up to one year.\nRead More\nHow to Render Duck Fat and Make Crispy Quacklings in One Shot\nHow to Break Down Whole Ducks Like a Pro\nHow to Get the Most Dang for Your Duck\nSchmaltz (Rendered Chicken Fat)\nMicrowave-Rendered Chicken Fat\nZa'atar (Middle Eastern Herb Blend)\nQuick Snacks\nDuck\nStovetop"
}