{
  "url": "https://www.seriouseats.com/dulces-alfajores-de-chocolate-havanna-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KHPmksZr0iI7x_DSr64KZdVIh9M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__11__20111118-127677-Dulces-Alfajores-Chocolate-PRIMARY-e882588e6d2d420a80409899fa27ac22.jpg",
  "tags": [
    "Cookies",
    "South American",
    "Baking",
    "Chocolate"
  ],
  "title": "Alfajores de Chocolate (Argentine Chocolate-Dulce de Leche Sandwich Cookies) Recipe",
  "full_text": "Alfajores de Chocolate (Argentine Chocolate-Dulce de Leche Sandwich Cookies) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n60 mins\nChilling Time\n45 mins\nTotal\n95 mins\nServes\n18 sandwich cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookies:\n1\ntablespoon\nbrandy\nor\ncognac\n2\nteaspoons\ninstant coffee\n3/4\nteaspoon\nalmond extract\n1/2\nteaspoon\nvanilla extract\n6\nounces\n(\n12\ntablespoons\n)\nunsalted butter\n, softened\n2/3\ncup\nsugar\n1/2\ncup\nconfectioners' sugar\n1/2\nteaspoon\nfinely grated\norange zest\n2\nlarge\neggs\n, at room temperature\n4\nteaspoons\nhoney\n1\ncup\nall-purpose flour\n, plus additional for shaping dough\n1\ncup\ncake flour\n2\ntablespoons\ncocoa powder\n1\nteaspoon\nbaking powder\n1/4\nteaspoon\nsalt\nFor the Filling:\n2\n(\n13.4-ounce) cans\ndulce de leche\n(see note)\nFor the Coating:\n12\nounces\nsemisweet chocolate\n, finely chopped (see note)\n4\nounces\nbittersweet chocolate (60% cacao)\n, finely chopped (see note)\n2\ntablespoons\nvegetable shortening\nDirections\nFor the Cookies:\nIn a small bowl, combine brandy, coffee, almond extract, and vanilla. Set aside.\nBeat butter, sugar, confectioners’ sugar, and orange zest on medium speed until light and fluffy, about 2 minutes. Add eggs, one at a time, beating well after each addition. Add honey and coffee mixture and beat just until combined, scraping sides and bottom of bowl with rubber spatula as needed.\nSift flour, cake flour, cocoa powder, baking powder, and salt over butter mixture and combine with rubber spatula until dough comes together. Press plastic wrap directly onto dough and refrigerate for 30 minutes.\nAdjust oven rack to middle position and preheat oven to 350°F (180°C). Line 2 rimmed baking sheets with parchment paper.\nOnce chilled, lightly coat fingers with flour and scoop 1-tablespoon portions of dough onto prepared baking sheets and pat down to about 2 1/2 inches in diameter (thickness will be about 1/4 inch).\nBake cookies—one sheet at a time—until cookies are set and appear dry on the surface, 7 to 9 minutes. Transfer sheets to cooling rack and cool cookies until cool enough to handle, about 5 minutes. Transfer cookies directly to cooling rack and cool completely, about 15 minutes.\nFor the Filling:\nOnce cooled, spread half the cookies with 1 heaping tablespoon dulce de leche. Cover with remaining cookies.\nFor the Coating:\nMelt semisweet and bittersweet chocolate and shortening in large metal bowl set over pot of simmering water (bottom of bowl should not make contact with surface of water). Stir with rubber spatula until chocolate is smooth and melted. Alternatively, combine chocolate and shortening in a large bowl and microwave 1 to 2 minutes until mixture is smooth, stopping microwave every 20 seconds to stir.\nLine 2 baking sheets with parchment paper.\nCarefully drop one sandwich cookie into the melted chocolate. With soup spoons, gently turn cookie to coat. Transfer cookie to prepared baking sheet and repeat with remaining cookies.\nTransfer cookies to refrigerator and chill until set, 15 to 30 minutes.\nSpecial Equipment\n2 rimmed baking sheets, parchment paper, electric mixer, rubber spatula, sifter, plastic wrap, cooling rack, large saucepan, large metal bowl or large microwave-safe bowl, 2 soup spoons\nNotes\nYou may have some leftover dulce de leche—refrigerate it in an airtight container or zipper-lock back and reserve it for another use. Even though the cookies are refrigerated to set the chocolate, they should be served at room temperature.\nRead More\nCajeta Casera (Homemade Goat's Milk \"Caramel\" Recipe)\nEasy Dulce de Leche\nCookies\nSouth American\nBaking\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/alfajores-de-chocolate-argentine-chocolate-dulce-de-leche-sandwich-cookies-recipe.webp?"
}