{
  "url": "https://www.seriouseats.com/dulces-bunuelos-de-rodilla-mexican-christmas-fritters-recipe",
  "image_url": "https://www.seriouseats.com/thmb/iyGwALWsk1gzf7K8L3oWj1mItXw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230915-SEA-BunuelosdeRodilla-GregDupree-00-b84a515f6ab849eba8eea8084085e523.jpg",
  "tags": [
    "Desserts",
    "Christmas Desserts",
    "Mexican",
    "Frying"
  ],
  "title": "Buñuelos de Rodilla (Mexican Christmas Fritters) Recipe",
  "full_text": "Buñuelos de Rodilla (Mexican Christmas Fritters) Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n40 mins\nActive\n90 mins\nRising and Resting Time\n2 hrs 30 mins\nTotal\n3 hrs 45 mins\nServes\n18 buñuelos\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Buñuelos:\n3/4\ncup\nwater\n(\n6\nounces\n;\n180\nml\n)\n1 1/2\ntablespoons\n(\n22\ng\n)\ngranulated sugar\n2 1/4\nteaspoons\n(\n11\nml\n)\naniseed liqueur\n(optional)\n3\ncups\nall-purpose flour\n(\n13.5\nounces\n;\n390\ng\n), sifted twice\n1\ntablespoon\n(\n15\ng\n)\nbaking powder\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\ncup\nlard\nor unsalted butter (\n4\nounces\n;\n113\ng\n), cut into 1/2-inch pieces and chilled\n2\nlarge\nroom temperature\neggs\n, beaten\nCooking spray\n8\ncups\n(\n1.9\nL\n)\nvegetable\nor other neutral\noil\nFor the Syrup:\n4\n(1-ounce; 113 g) cones\npiloncillo\n(see notes)\n1/2\ncup\n(\n120\nml\n)\nwater\n1\n(3-inch)\ncinnamon\nstick\n1\ntablespoon\n(\n10\ng\n)\nanise seeds\nor\n3\nstar anise\npods\nDirections\nFor the Buñuelos:\nIn a small saucepan, bring water, sugar, and liqueur (if using) to a simmer over medium heat, stirring occasionally to dissolve. Remove from heat and cover to keep warm.\nSerious Eats / Greg Dupree\nIn the bowl of a stand mixer, whisk together sifted flour, baking powder, and salt. Using fingertips, rub lard or butter into the flour mixture until mixture is crumbly. Work eggs in with fingertips until fully incorporated. Gradually stir in the warm sugar water with a silicone spatula until a cohesive dough comes together. Knead dough with stand mixer fitted with hook attachment until smooth, 10 to 15 minutes (dough will be slightly sticky). Coat a large bowl with cooking spray. Place dough in greased bowl, cover with plastic wrap, and let rest at room temperature until slightly puffed, about 1 hour.\nSerious Eats / Greg Dupree\nCover a clean, dry work surface with several clean kitchen towels. On a separate clean, dry work surface, shape dough into a 6-inch square, about 1-inch thick. Divide dough into 1-inch pieces (36 total). Roll each one into a ball. Using a rolling pin (dough should be smooth but not sticky—flouring the work surface is not necessary), roll each ball into a 6- to 7-inch diameter circle (each buñuelo should be thin enough to be translucent). Arrange dough circles in an even layer on the towel-lined surface and let rest, uncovered, until dry and papery to touch, about 45 minutes. Flip circles over and allow to dry an additional 45 minutes.\nSerious Eats / Greg Dupree\nLine 2 rimmed baking sheets with 2 layers of paper towels. Heat oil in a Dutch oven or large skillet with high sides over medium-high heat until temperature registers 350°F (177°C); oil should be 1 to 1 1/2 inches deep.\nSerious Eats / Greg Dupree\nWorking 2 or 3 at a time, fry buñuelos until golden on one side, 30 to 60 seconds. Turn over with tongs, and fry until opposite side is golden, 30 to 45 seconds. Transfer to prepared baking sheets and repeat with remaining dough, adjusting heat as necessary to maintain temperature.\nSerious Eats / Greg Dupree\nFor the Syrup:\nBring piloncillo (or brown sugar or granulated sugar), water, cinnamon stick, and anise seeds or star anise to a boil over medium-high heat in a medium-heavy heavy-bottomed saucepan, stirring often until sugar is dissolved, about 3 minutes. Reduce heat to medium and simmer, stirring occasionally, until mixture is thick and syrupy, about 7 minutes. Strain syrup through a fine mesh sieve set over a heat-safe measuring cup, discard solids, and drizzle over buñuelos or serve alongside.\nSerious Eats / Greg Dupree\nSpecial Equipment\nRolling pin\n, several kitchen towels,\nDutch oven\nor\nlarge skillet\nwith high sides,\ntongs\n, 2\nbaking sheets\n, paper towels, large heavy-bottomed\nsaucepan\n,\ndeep-fry thermometer\n,\nstrainer\nNotes\nIf you can’t find piloncillo, you can substitute with 1 cup dark brown sugar (6.5 ounces; 186g) or 1 cup granulated sugar (7 ounces; 200g).\nRead More\nBuñuelos de Yuca y Queso (Yuca and Cheese Fritters)\nOrange Atole (Hot Mexican Corn Drink With Orange Zest)\nChampurrado (Mexican Hot Chocolate and Corn Drink)\nDesserts\nChristmas Desserts\nMexican\nFrying",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/buuelos-de-rodilla-mexican-christmas-fritters-recipe.webp?"
}