{
  "url": "https://www.seriouseats.com/dulce-de-leche-recipe",
  "image_url": "https://www.seriouseats.com/thmb/6Xleld8EnL4lKNwS_HHH-HsfR4A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10.easy-dulce-de-leche-reheating-hero-shot-1-1c045ba515654184a08d5cb59c3c0e8f.jpg",
  "tags": [
    "Dessert Sauces",
    "Gluten-free Desserts",
    "Stovetop",
    "Candy"
  ],
  "title": "Easy Dulce de Leche",
  "full_text": "Easy Dulce de Leche\nClose\nJump to recipe\nCook\n3 hrs\nActive\n15 mins\nTotal\n3 hrs\nServes\n6 servings\nMakes\n14 ounces\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n14\n-\nounce\n)\ncan\nsweetened condensed milk\n, label removed\nDirections\nPlace the can on its side in a large pot. Fill pot with room-temperature water, making sure water level is at least 2 inches above can. Remember, it's vital the can remain fully submerged during the entirety of simmering to prevent it from warping and splitting, which can result in injuries.\nSerious Eats / Mateja Zvirotic Andrijanic\nSet pot over high heat and bring to a simmer. Reduce heat and simmer for 2 hours for light, golden caramel, and up to 3 hours for dark, robust caramel; check pot every 30 minutes to ensure water level stays above can, adding boiling water as necessary to keep can under 2 inches of water.\nSerious Eats / Mateja Zvirotic Andrijanic\nUsing a pair of tongs, remove can from water and set on wire rack to cool to room temperature. Do not attempt to open can while still hot; this can cause pressurized hot caramel to spray dangerously.\nSerious Eats / Mateja Zvirotic Andrijanic\nUnopened cans of dulce de leche can be stored at room temperature for up to 3 months. To use dulce de leche, open can when completely cool and scoop out; reheat in a double boiler to soften dulce de leche to spreadable or drizzle-able consistency. Dulce de leche can be transferred to an airtight container and refrigerated for up to 3 weeks.\nSerious Eats / Mateja Zvirotic Andrijanic\nSpecial Equipment\nDutch oven\n,\ntongs\n, double boiler\nNotes\nMake sure the can remains\nfully\nsubmerged by at least 2 inches of water. If the can is not fully submerged, it can overheat, tear, and even explode. Also,\nnever\ntry to open a hot can of dulce de leche. Wait until the can has cooled to room temperature before opening it; this can take about 4 hours.\nDessert Sauces\nGluten-free Desserts\nStovetop\nCandy"
}