{
  "url": "https://www.seriouseats.com/dulces-pio-v-nicaraguan-christmas-cake-rum-custard-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ml6681Aw2hEjrcZ23IJLDoXQMoc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111209-127677-Dulces-Pio-V-PRIMARY-21a3d3dd7d1b4941aac80489a2db0a38.jpg",
  "tags": [
    "Cakes",
    "Central American",
    "Baking",
    "Christmas"
  ],
  "title": "Pío V (Nicaraguan Christmas Cake) Recipe",
  "full_text": "Pío V (Nicaraguan Christmas Cake) Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n50 mins\nActive\n90 mins\nCooling Time\n5 hrs\nTotal\n6 hrs 15 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marquesote Cake:\n1\ntablespoon\nunsalted butter\n, softened\n1\ncup\nfine\nwhite cornmeal\n1\ncup\nall-purpose flour\n, sifted\n4\nteaspoons\nbaking powder\n2\nteaspoons\nunsweetened cocoa powder\n1/2\nteaspoon\nground cinnamon\n6\nlarge\neggs\n, separated and at room temperature\n3/4\nteaspoon\nsalt\n1 1/2\ncups\nsugar\n1/2\ncup\nmilk\n2\nteaspoons\npure\nvanilla extract\nFor the Sopa Borracha Syrup:\n6\ncups\nwater\n3 1/2\ncups\nsugar\n4\ncinnamon sticks\n1\nteaspoon\nwhole cloves\nPeel\nof\n1\nlemon\n3/4\ncup\ngold rum\n1/2\ncup\nraisins\n12\nprunes\nFor the Manjar Custard:\n4\ncups\nmilk\n2\ncinnamon sticks\n1\ncup\nsugar\n2\ntablespoons\ncornstarch\n4\nlarge\negg yolks\n1/8\nteaspoon\nsalt\n2\ntablespoons\nbutter\n, cut into 4 pieces and chilled\n2\nteaspoons\npure\nvanilla extract\nDirections\nFor the Marquesote Cake:\nAdjust oven rack to middle position and preheat oven to 350°F. Grease a 13- by 9-inch baking dish with butter.\nIn medium skillet over medium-low heat, cook cornmeal, stirring frequently, until light golden and fragrant, about 5 minutes.\nWhisk together cornmeal, flour, baking powder, and cocoa powder in medium bowl; set aside.\nIn large bowl, beat egg whites and salt with whisk attachment on medium-low speed until whites begin to froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes. Slowly add sugar, then continue beating until stiff, glossy peaks form, 2 to 3 minutes.\nAdd egg yolks to egg whites and beat just until combined. Decrease speed to low and add flour mixture in three additions, alternating with milk, scraping sides and bottom of bowl as necessary. Add vanilla and beat just until combined.\nScrape batter into prepared baking dish. Bake until tester inserted in center of cake comes out clean, 30 to 35 minutes. Transfer cake to cooling rack and cool in pan completely, 1 to 2 hours.\nFor the Sopa Borracha Syrup:\nBring water, sugar, cinnamon sticks, cloves, and lemon peel to boil in large, heavy-bottomed saucepan over medium-high heat. Reduce heat to medium and simmer until reduced to 4 1/2 cups, about 30 minutes. Strain and discard solids.\nStir in rum, raisins, and prunes and cool to room temperature, about 30 minutes. Once cooled, strain once again, reserving prunes and raisins.\nFor the Manjar Custard:\nBring milk and cinnamon sticks to boil over medium heat in small saucepan or in (glass) liquid measuring cup in microwave. Remove and reserve cinnamon sticks.\nIn a large, heavy-bottomed saucepan whisk together sugar, cornstarch, egg yolks, and salt. While vigorously whisking, add 1/4 cup of hot milk, then, add remaining milk in a slow steady stream, all the while whisking.\nAdd reserved cinnamon sticks and bring the mixture to boil over medium heat, whisking constantly. Once mixture thickens to the consistency of yogurt, continue to boil for 1 to 2 minutes. Remove from heat and stir in butter and vanilla.\nPress a piece of plastic wrap directly onto the custard’s surface and refrigerate until cold, 2 to 3 hours. Otherwise, place the custard bowl over in an ice bath and stir until completely cooled, 10 to 15 minutes.\nTo Assemble:\nPoke cake all over with skewer or fork. Pour sopa borracha over cake. Once absorbed, pour custard over cake, smoothing out surface with rubber spatula. Top with raisins and prunes.\nChill cake at least 1 hour prior to serving.\nSpecial Equipment\nMedium skillet, sifter/strainer, mixing bowls, whisk, electric mixer, rubber spatula, 13- by 9-inch baking dish, cooling rack, large, heavy-bottomed saucepan, plastic wrap\nCakes\nCentral American\nBaking\nChristmas",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/po-v-nicaraguan-christmas-cake-recipe.webp?"
}