{
  "url": "https://www.seriouseats.com/dulces-turron-de-alicante-nougat-with-marcona-almonds-recipe",
  "image_url": "https://www.seriouseats.com/thmb/mFpIlRoBylT0xWlHqvAi0AgSx3o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230803-SEA-TurronDeAlicante-RobbyLozano-000-c00021b1ce2748568a644f86479bc560.jpg",
  "tags": [
    "Candy",
    "Stovetop",
    "Almonds"
  ],
  "title": "Turrón de Alicante (Nougat With Marcona Almonds)",
  "full_text": "Turrón de Alicante (Nougat With Marcona Almonds)\nClose\nJump to recipe\nPrep\n30 mins\nActive\n20 mins\nCooling Time\n60 mins\nTotal\n90 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nNonstick cooking spray\n1 1/4\ncups\ngranulated sugar\n(\n9\nounces\n;\n250\ng\n)\n1/3\ncup\n(\n80\nml\n)\nhoney\n2\ntablespoons\n(\n30\nml\n)\nwater\n1\nlarge\negg white\n, room temperature (\n1 1/4\nounces\n;\n35\ng\n)\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n1/2\nteaspoon\nfinely grated\nlemon zest\n(from\n1\nwhole\nlemon\n)\n2\ncups\nMarcona almonds\n(\n8 1/2\nounces\n;\n241\ng\n), toasted and still warm\n2\nsheets\nof\nwafer paper\n, trimmed to 8- by 8-inches (see notes)\nDirections\nLine an 8- by 8-inch baking pan with one sheet of heavy-duty foil lengthwise, then crosswise with a second sheet to create a sling. Lightly coat sides with spray.\nSerious Eats / Robby Lozano\nIn a large, heavy-bottomed saucepan, combine sugar, honey, and water. Stir with wooden spoon over medium heat until sugar dissolves completely, 2 to 3 minutes. Increase heat to medium-high and boil syrup until thermometer registers 250°F (121°C), 2 to 3 minutes.\nSerious Eats / Lorena Masso\nMeanwhile, using an electric mixer fitted with the whisk attachment, whip egg white and salt on medium speed until it holds soft peaks, about 2 minutes.\nSerious Eats / Robby Lozano\nWith mixer running on medium-high, add hot syrup to egg white in a slow, steady stream. Beat until mixture is thick and glossy, about 2 minutes.\nSerious Eats / Robby Lozano\nPlace the whipped egg white mixture into the same saucepan. Cook over medium-low, stirring constantly, until mixture thickens considerably, becomes a golden brown color, and reaches 300°F (150ºC), 20 to 30 minutes.  Stir in lemon zest and still-warm almonds. Lightly coat silicone spatula with cooking spray; set aside.\nSerious Eats / Robby Lozano\nPlace one trimmed sheet of wafer paper in prepared pan (see note). Scrape turrón mixture into pan, spreading in an even layer with the oiled spatula. Top with second sheet of wafer paper, and press down lightly with a flat-bottomed 1/2-cup measure to compress and flatten.\nSerious Eats / Robby Lozano\nLet stand at room temperature until set, 1 to 2 hours. Transfer turrón to cutting board with sling. Remove and discard sling, then using a mallet, break into about 8 pieces and serve.\nSerious Eats / Robby Lozano\nSpecial Equipment\n8- by 8-inch baking pan, heavy-duty foil, large heavy-bottomed saucepan, electric mixer, candy thermometer, silicone spatula, wooden spoon, edible wafer paper\nNotes\nTo trim the wafer paper 8- by 8-inches, arrange one sheet on a cutting board. Set the baking pan on paper. With a sharp knife, slice the excess paper off. Repeat with second sheet.\nEdible wafer paper is available at most specialty cake shops and online.\nCandy\nStovetop\nAlmonds",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/turrn-de-alicante-nougat-with-marcona-almonds.webp?"
}