{
  "url": "https://www.seriouseats.com/earl-grey-and-vanilla-poached-pears-recipe-8764673",
  "image_url": "https://www.seriouseats.com/thmb/MJfH03y6SEY1mL8ahSx0QFKnOwI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241219-SEA-EarlGreyandVanillaPoachedPears-AmandaSuarez-18-428c4d9cb991470db8fe461ee8586039.jpg",
  "tags": [
    "The Latest",
    "Gluten-free Desserts",
    "Desserts",
    "Gluten-free",
    "Fall Desserts"
  ],
  "title": "Earl Grey and Vanilla Poached Pears",
  "full_text": "Earl Grey and Vanilla Poached Pears\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nTotal\n35 mins\nServes\n4\nto 6\nMakes\n6 pears\nCook Mode\n(Keep screen awake)\nIngredients\n5\ncup\ns (1.2L)\nwater\n3 bags\nEarl Grey tea\n1\ncup\ngranulated sugar\n(7 ounces; 200g)\n1\nvanilla bean\n, split and scraped (see notes)\n6\nfirm but ripe\nmedium\npears\n(about 2 1/4 pounds; 1kg), peeled\nDirections\nIn a 5-quart pot or Dutch oven, bring 5 cups water to a boil. Remove from heat, add tea bags, and let steep until fragrant and dark brown, 3 to 5 minutes. Using a slotted spoon, lift tea bags and, carefully using a small spoon, press down on tea bags to extract excess liquid. Discard.\nSerious Eats / Amanda Suarez\nAdd sugar and vanilla bean to tea, stir to dissolve sugar, and bring to a simmer over medium heat. Working one at a time, carefully lower pears into the tea mixture. Gently simmer pears, using tongs to carefully rotate to ensure they cook evenly, until tender and a knife pierces the flesh easily, about 30 minutes. Serve pears warm with several spoonfuls of poaching liquid.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n5-quart pot or Dutch oven, slotted spoon, tongs\nNotes\n1 1/2 teaspoons vanilla bean paste or 2 teaspoons vanilla extract can be substituted for the vanilla bean.\nMake-Ahead and Storage\nPears can be poached and refrigerated in their poaching liquid up to 3 days in advance. Once pears are tender, use a slotted spoon to remove fruit and carefully arrange them into a single layer in an airtight container. Allow poaching liquid to cool completely, then pour over pears. When ready to serve, remove pears from poaching liquid, then bring poaching liquid to a simmer over medium heat. Gently lower pears into poaching liquid and simmer until just warmed through, about 5 minutes.\nThe Latest\nGluten-free Desserts\nDesserts\nGluten-free\nFall Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/earl-grey-and-vanilla-poached-pears.webp?"
}