{
  "url": "https://www.seriouseats.com/easy-coffee-cake-recipe",
  "image_url": null,
  "tags": [
    "Cakes",
    "Pastries",
    "Crumbles",
    "Breakfast & Brunch"
  ],
  "title": "Easy One-Bowl Coffee Cake",
  "full_text": "Easy One-Bowl Coffee Cake\nJump to recipe\nPrep\n30 mins\nCook\n40 mins\nActive\n25 mins\nCooling Time\n30 mins\nTotal\n100 mins\nServes\n12 pieces\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Topping:\n4 ounces\nlight brown sugar\n(about 1/2 cup, packed;\n115\ng\n)\n2 1/2 ounces\nwhole wheat flour\n(about 1/2 cup, spooned;\n70\ng\n)\n1 tablespoon (\n5\ng\n)\nground cinnamon\n1/4\nteaspoon\n(1g) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\nShy\n1/4\nteaspoon\nground cardamom\n2 ounces\nunsalted butter\n(about 4 tablespoons;\n55\ng\n), soft, about 70°F (21°C)\nFor the Coffee Cake:\n14 ounces plain or\nquick-toasted\nsugar\n(2 cups;\n395\ng\n)\n6 ounces\nunsalted butter\n(about 12 tablespoons;\n170\ng\n), about 65°F (18°C)\n4\nteaspoons\nbaking powder\n1 teaspoon (\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\n1/2 ounce\nvanilla extract\n(\n1\ntablespoon\n; 15g)\n3\nlarge\neggs\n, brought to about 65°F or 18°C (about 5 1/4 ounces; 150g), see note\n12 ounces\nall-purpose flour\n, such as Gold Medal (about 2 2/3 cups, spooned;\n340\ng\n)\n14 ounces\nplain Greek yogurt\n(about 1 3/4 cups;\n395\ng\n), any percentage will do, brought to about 65°F or 18°C (see notes)\nDirections\nFor the Topping:\nIn the bowl of a stand mixer fitted with a paddle attachment, combine brown sugar, whole wheat flour, cinnamon, salt, cardamom, and butter. Mix on low speed until sandy and well combined. Scrape onto a large plate or sheet of parchment.\nSerious Eats / Vicky Wasik\nAlternatively, the crumb topping can be transferred to an airtight container and refrigerated for up to 1 week, or frozen for 6 months. Wipe bowl and paddle with a paper towel and proceed to the next step—no need to wash!\nFor the Coffee Cake:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). In the bowl of a stand mixer fitted with a paddle attachment, combine sugar, butter, baking powder, salt, and vanilla. Mix on low to moisten, then increase speed to medium and cream until soft and light, about 10 minutes. Pause to scrape bowl and beater with a flexible spatula, then resume mixing on medium speed. Add eggs one at a time, allowing each to fully incorporate before adding the next.\nSerious Eats / Vicky Wasik\nScrape bowl and beater with a flexible spatula, then resume mixing on low. Sprinkle in about 1/3 of flour, then add 1/3 of Greek yogurt. Repeat with remaining flour and yogurt, working in thirds as before. Fold batter once or twice with a flexible spatula, then scrape into a parchment-lined 9- by 13- by 2-inch anodized-aluminum baking pan. Spread in an even layer, then cover with prepared topping, a handful at a time, squeezing each addition in your palm to help form streusel nuggets.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nBake until coffee cake is puffed and firm, about 40 minutes (a toothpick inserted into the center should emerge with a few moist crumbs). Cool cake directly in pan about 30 minutes before serving, as it will be soft and gummy until its crumb has had a chance to set.\nSerious Eats / Vicky Wasik\nCut into squares with a butter knife and lift parchment to help fit an angled spatula under the first slice. To keep coffee cake as fresh as possible, cut only as much as you plan to serve at one time. With plastic wrap or wax paper pressed against cut surface, and top of pan covered with a sheet of aluminum foil, leftovers will keep up to 3 days at\nroom temperature\n.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer with paddle attachment\n,\n9- by 13-inch anodized aluminum baking pan\nNotes\nThis recipe works best with strained Greek yogurt, like Fage or Chobani, that contains nothing more than milk and active cultures. Avoid imitations thickened with gum, gelatin, or pectin.\nTo quickly bring refrigerator-cold eggs to the desired temperature, simply submerge them in a vessel of hot tap water for about two minutes.\nMake-Ahead and Storage\nThe prepared crumb topping can be transferred to an airtight container and refrigerated for up to one week, or frozen for six months.\nWrapped tightly in plastic, leftover slices of coffee cake will keep up to three days at room temperature.\nRead More\nGata (Armenian Coffee Cake)\nPumpkin Skillet Coffee Cake With Streusel Topping\nCoffee Coffee Cake\nBlackberry Crumb Cake\nBlueberry Marble Coffee Cake\nBanana Pecan Coffee Cake\nCakes\nPastries\nCrumbles\nBreakfast & Brunch"
}