{
  "url": "https://www.seriouseats.com/easy-skillet-braised-chicken-with-peppers-and-paprika-recipe",
  "image_url": "https://www.seriouseats.com/thmb/1s7_Fe7HTsin9JYloHLmGrIqmLI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__10__20111016-braised-chicken-with-paprika1-b15887f9c4d24528985084215c99ec64.jpg",
  "tags": [
    "Chicken Mains",
    "Dairy-free Mains",
    "Braised & Stewed Chicken",
    "Chicken Legs",
    "Bell Peppers"
  ],
  "title": "Easy Skillet Braised Chicken with Peppers and Paprika Recipe",
  "full_text": "Easy Skillet Braised Chicken with Peppers and Paprika Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n20 mins\nTotal\n65 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4 to 6\nchicken leg quarters\nKosher salt\nand freshly\nground black pepper\n1\ntablespoon\nvegetable oil\n1\nlarge\nonion\n, finely sliced (about\n1 1/2\ncups\n)\n1\ngreen bell pepper\n, finely sliced (about\n1\ncup\n)\n1\nred bell pepper\n, finely sliced (about\n1\ncup\n)\n2\ncloves\ngarlic\n, finely sliced\n1\ntablespoon\nmild Spanish smoked paprika\n(or\nregular paprika\n)\n1\nteaspoon\ndried marjoram\n(\nsavory\nor\noregano\nwill work just fine)\n1\ntablespoon\nflour\n1\ncup\ndry white wine\n3\ncups\nlow-sodium chicken broth\n1\nlarge\ntomato\n, peeled, seeded, and cut into 1/2-inch pieces (about\n1\ncup\n, see note)\nDirections\nAdjust oven rack to lower middle position and preheat oven to 350°F (175°C; see note). Lightly season chicken legs with salt and pepper. Heat oil in a 12-inch skillet or sauté pan over high heat until lightly smoking. Using tongs, carefully add chicken pieces skin-side-down. Cover with splatter screen or partially cover with lid to avoid splattering. Cook without moving until chicken is deep golden brown and skin is crisp, about 4 minutes. Flip chicken pieces and continue to cook until second side is golden brown, about 3 minutes longer. Transfer chicken to a large plate and set aside.\nAdd onions and peppers to skillet and cook, using a wooden spoon to scrape up browned bits from bottom of skillet. Stir frequently until completely softened and just starting to brown, about 4 minutes. Add garlic and cook, stirring constantly until fragrant, about 30 seconds. Add paprika, marjoram, and flour, and cook, stirring constantly, until fragrant, about 1 minute longer. Add white wine. Using wooden spoon, scrape browned bitts off of bottom of skillet. Add chicken broth and tomatoes and bring to a boil.\nNestle chicken pieces into broth and vegetables so that only crisp skin is showing. Cover pot and transfer to oven (see note). Cook for 20 minutes. Remove lid and continue to cook until chicken is falling off the bone tender, skin is crisp, and sauce is rich, about 20 minutes longer. Season sauce to taste with salt and pepper. Serve with egg noodles, spätzle, rice, or boiled potatoes.\nMake-Ahead and Storage\nStew will improve the second or third day after refrigeration, though the skin will no longer be crisp.\nNotes\nThe tomato can easily be peeled by cutting a shallow \"X\" into the end opposite the stem. Stick a fork directly into the stem end, then hold the tomato directly over the open burner of a gas oven or under the broiler until it is blistered all over. The skin should peel off easily.\nYou can finish this dish 100% on the stovetop by lowering the heat to the lowest possible setting in step 3, covering the pot, and cooking until tender (about 45 minutes).\nThis Recipe Appears In\nEasy Skillet Braised Chicken With Peppers and Paprika\nChicken Mains\nDairy-free Mains\nBraised & Stewed Chicken\nChicken Legs\nBell Peppers"
}