{
  "url": "https://www.seriouseats.com/easy-roast-chicken-with-asparagus-and-leeks-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Axp3CnnssbZN4wxSdCYoXAzpl7I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110613-roast-chicken-with-leeks-and-asparagus1-573929cbcb804103bb783be1ad037b8f.jpg",
  "tags": [
    "Chicken Mains",
    "Roasted Chicken",
    "Asparagus",
    "Leeks",
    "Spring"
  ],
  "title": "Easy Roast Chicken With Asparagus and Leeks Recipe",
  "full_text": "Easy Roast Chicken With Asparagus and Leeks Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n20 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nbutterflied\nchicken\n(about\n4\npounds\n, see note), neck and backbone reserved\nKosher salt\nand freshly\nground black pepper\n4\nlarge\nleeks\n, whites and greens reserved separately, whites trimmed, washed, and split in half lengthwise\n2\nbay leaves\n1 1/2\npounds\nasparagus stalks\n, trimmed and peeled if necessary\n2\ntablespoons\nolive oil\n2 to 3\ntablespoons\nbutter\nDirections\nAdjust oven rack to center position and preheat oven to 500°F (260°C). Pat chicken dry with paper towels and season on all sides generously with salt and pepper. Line heavy-duty rimmed baking sheet with foil. Place chicken on foil, skin-side up. Transfer to oven and roast until thickest part of breast registers 150°F (66°C) on an instant-read thermometer, about 45 minutes (see note). Remove from oven, transfer chicken to a cutting board, and allow to rest for 15 minutes.\nWhile chicken roasts, make jus. Chop neck and backbone into 1-inch chunks with a cleaver, heavy chef's knife, or poultry shears. Place in a medium saucepan and cook over high heat, stirring occasionally with a wooden spoon until browned on all sides, about 5 minutes. Add leek greens and bay leaves and cover with water. Simmer for 30 minutes, then strain, discarding solids. You should have about 2 cups of jus.\nPlace leek whites in a large saucepan and pour chicken jus on top. After chicken comes out of oven, bring leeks to simmer, reduce heat to low, cover, and allow to cook until leeks are tender and chicken is ready to serve, about 15 minutes. Season leeks and jus to taste with salt and pepper.\nWhile chicken rests, place asparagus in the now-empty pan that the chicken was roasted in. Drizzle with olive oil and season with salt and pepper. Transfer to oven and roast until tender and browned, about 10 minutes.\nCarve chicken into serving pieces. Transfer leeks to serving platter with a slotted spoon, leaving jus in pan. Stir butter into jus until emulsified. Transfer asparagus and chicken to serving platter and pour jus all around. Serve immediately.\nSpecial Equipment\nRimmed baking sheet\n, aluminum foil,\ninstant-read thermometer\nNotes\nFor crispest skin and best results use an air-dried chicken. To butterfly a chicken, use poultry shears, a cleaver, or a heavy chef's knife to remove the chicken's backbone. Lay chicken out flat with breast facing up. Pull legs out to sides so that entire chicken is skin-side up. Press down firmly on breast with hands to flatten.\nI cook my chickens to 140°F, though you may want to cook them hotter if you are squeamish about food safety (150°F is very safe, 165°F is what the USDA recommends. Your chicken will be hopelessly dry by this point).\nRead More\nRoast Chicken With Asparagus Panzanella\nSheet-Pan Chicken Thighs With Potatoes, Fennel, and Mustard-Beer Sauce\nThomas Keller's One-Pot Roast Chicken\nPan-Roasted Chicken With Vegetables and Dijon Jus\nGarlic-Roasted Chicken with Carrots and Parsnips\nChicken Mains\nRoasted Chicken\nAsparagus\nLeeks\nSpring"
}