{
  "url": "https://www.seriouseats.com/easy-vegetable-cheese-sausage-breakfast-casserole-recipe-8724955",
  "image_url": "https://www.seriouseats.com/thmb/EdxJktSz-IATfAbHx0hOAFPdcgQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241001-SEA-BreakfastCasserole-FredHardy-Hero2-11-ea3e2fbd48c44a9ebb2700d9c34f8aa5.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Sausages",
    "Eggs"
  ],
  "title": "Cheesy Sausage Breakfast Casserole",
  "full_text": "Cheesy Sausage Breakfast Casserole\nClose\nJump to recipe\nPrep\n15 mins\nCook\n80 mins\nTotal\n95 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nextra-virgin olive oil\n, plus more as needed\n12 ounces (\n340\ng)\nbulk sweet or\nhot Italian sausage\n(optional)\n5\nounces\n(140g) thinly sliced\nfresh mushrooms,\nsuch as shiitake, cremini, or oyster (2 cups sliced)\n1 small red onion (6 ounces; 170g), thinly sliced (about\n1\ncup\nsliced)\n1 1/2\nteaspoon\nDiamond Crystal\nkosher salt,\ndivided; for table salt use half as much by volume\n1/2 cup drained and chopped\nsundried tomatoes\nin oil (3 ounces;\n85\ng\n)\n3\nmedium\ngarlic cloves\n, minced\n5\nounces\n(140g) fresh\nbaby spinach\n(5 cups)\n6 ounces\n(170\ng)\nshredded Gouda\nor cheddar cheese, (1 1/2 cups)\n10\nlarge\neggs\n1/3 cup\n(80\nml)\nsour cream\nor plain, whole-milk strained (Greek-style) yogurt\n1 1/2 cups\n(360\nml)\nhalf-and-half\nor whole milk\n1 tablespoon\n(15\nml\n)\nDijon mustard\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175℃). Lightly grease a 9- x 13-inch baking dish with oil; set aside. If using sausage, in a 12-inch skillet, heat 1 tablespoon oil over medium-high until shimmering. Add sausage and using a wooden spoon, break it into large clumps. Continue to cook without moving until browned on bottom, about 4 minutes. Use wooden spoon to break up meat into smaller pieces and continue to cook, stirring occasionally, until sausage is just cooked through, about 3 minutes. Using a slotted spoon, transfer sausage to a paper towel–lined plate. Reserve 2 tablespoons rendered fat in skillet to cook mushrooms.\nSerious Eats / Fred Hardy\nHeat rendered fat in skillet (or if omitting sausage, heat 2 tablespoons oil in 12-inch skillet) over medium-high heat until shimmering. Add mushrooms, stir to coat in oil, and spread in an even layer. Cook without moving until bottoms of mushrooms are browned, about 4 minutes. Reduce heat to medium. Add onion, 1/2 teaspoon salt, and 1 tablespoon oil. Cook, stirring occasionally, until onions soften and mushrooms are browned all over, about 8 minutes.\nSerious Eats / Fred Hardy\nAdd sundried tomatoes and garlic; cook, stirring often, until fragrant, about 1 minute. Add spinach in 2 additions, stirring often and letting spinach completely wilt before adding more. Transfer vegetable mixture, and sausage (if using), to prepared baking dish. Stir in cheese until combined, and spread mixture in an even layer.\nSerious Eats / Fred Hardy\nIn a large bowl, whisk eggs until no streaks remain. Whisk in sour cream in 3 additions until no lumps remain. Whisk in half-and-half, mustard, and remaining 1 teaspoon salt until combined. Pour egg mixture over mushroom mixture in baking dish; gently stir until egg mixture is evenly distributed.\nSerious Eats / Fred Hardy\nBake, uncovered, until cooked through, puffed and set, about 35 minutes. Let cool 10 minutes. Slice and serve.\nSerious Eats / Fred Hardy\nSpecial Equipment\n9- x- 13-inch baking dish, 12-inch skillet\nMake-Ahead and Storage\nTo prepare the recipe ahead, cook as directed through Step 3. Cover with plastic wrap and refrigerate for up to 24 hours. Let the casserole sit at room temperature while the oven preheats; remove plastic wrap, stir to thoroughly recombine, and proceed with Step 4 as directed.\nThe casserole can be baked ahead, cooled to room temperature and refrigerated, covered, for up to 2 days. It can also be frozen for up to 2 months. To reheat, bring to room temperature before heating, covered with aluminum foil, in a 350°F (175℃) oven until warmed through.\nBreakfast & Brunch\nThe Latest\nSausages\nEggs"
}