{
  "url": "https://www.seriouseats.com/easy-ramen-noodles",
  "image_url": "https://www.seriouseats.com/thmb/jlq6cRTevhSte3rRuLxHWqkWZfo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__04__20200420-easy-ramen-noodles-sho-spaeth-3-691ebeca20e44bb89a3dca4aca3d0887.jpg",
  "tags": [
    "Ramen",
    "Japanese",
    "Noodle Mains"
  ],
  "title": "Easy Homemade Ramen Noodles Recipe",
  "full_text": "Easy Homemade Ramen Noodles Recipe\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n3 mins\nActive\n30 mins\nTotal\n2 hrs 3 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ng\nbaked baking soda\n4\ng\nDiamond Crystal\nkosher salt\n; for table salt or other kinds of salt, use the same weight\n176\nml\nwater\n(see note)\n400\ng\nall-purpose flour\n(see note)\nPotato starch\nor corn starch, for dusting\nDirections\nTo Make Noodles\n: In a small bowl, combine baked baking soda and water and, using a spoon, stir to dissolve completely, about 30 seconds. Add salt and stir until dissolved completely. Set alkalized water aside.\nAdd all-purpose flour to the bowl of a food processor fitted with a metal blade, or in the bowl of a stand mixer fitted with a paddle attachment.\nAlternatively, if mixing dough by hand, place all-purpose flour in a large mixing bowl.\nIf using a food processor:\nWith the processor running, add 1/3 of alkalized water at a time, allowing time between additions (about 1 minute) for the liquid to be fully absorbed and incorporated into flour. After the final addition, allow machine to run until mixture looks pebbly and easily forms a ball when compressed in your hand, 2 to 3 minutes.\nIf using a stand mixer:\nSet mixer to lowest speed and, with machine running, add 1/3 of alkalized water at a time, allowing time between additions (about 2 minutes) for the liquid to be fully absorbed and incorporated into flour. After the final addition, allow machine to run until mixture looks pebbly and easily forms a ball when compressed in your hand, 2 to 3 minutes.\nIf mixing by hand:\nAdd 1/3 of alkalized water to bowl with flour and, using your fingers, mix by lifting and tossing flour and water mixture to distribute water evenly, until mixture looks pebbly, about 5 minutes. Add the second 1/3 of alkalized water and continue mixing, lifting and tossing flour and breaking up any large clumps with your fingers, until mixture becomes pebbly again, about 5 minutes. Add final 1/3 of alkalized water and continue mixing in the same way, until mixture is pebbly and only small clumps of dough have formed and the dough can be compressed easily in your hand, about 5 more minutes.\nLay a 3- to 4-foot-long (90- to 120cm) sheet of plastic wrap on a work surface. Spread pebbly dough mixture out onto plastic wrap to form a rough 6-inch by 2–foot (15cm by 61cm) rectangle. Using your hands or fists, and using the plastic wrap to help you corral any loose bits of dough, compress dough into a single plank with a height of no more than 1/4 inch (5mm). Wrap tightly in plastic wrap, using more wrap if necessary, and let rest for at least 1 hour and up to 8 hours at room temperature.\nSet up a stand mixer fitted with the pasta-rolling attachment, or a manual pasta-rolling machine.\nUnwrap sheet of dough and, using a bench scraper or knife, divide into 4 even portions, then cover dough once more with plastic to prevent from drying out. If using, stand mixer speed to medium-low. For either roller, check that the attachment is on its widest setting. You'll want to be extra careful that the setting is right; using a setting that's too thin for the dough can result in the rollers getting knocked out of alignment or breaking altogether.\nWorking with one portion at a time, feed dough through rollers, applying pressure to ensure it passes evenly through. If it passes through in one piece, run the resulting piece through the second-widest roller setting, then the third-widest setting, then cover with plastic to prevent drying and set aside.\nIf the dough breaks up into many flattened pieces, place the flattened pieces on your work surface and press them into something that resembles a sheet, then pass it through the rollers again. Run the resulting piece through the second-widest roller setting, then the third-widest setting, then cover with plastic to prevent drying and set aside.\nRepeat rolling process with another portion of the dough.\nStack the 2 rolled sheets of dough on top of each other, then run them together through the widest setting of the pasta roller, followed by the second-widest setting, followed by the third-widest setting. Fold the dough sheet in half, making it half of its original length. Press down on the seam to flatten it, then run the sheet seam side first through the second-widest setting, followed by the third-widest setting. The dough should now feel cohesive and strong, not pebbly or grainy.\nFold dough sheet in half again, making it half its original length. Press down on the seam to flatten it and cut off both corners of the seam diagonally, so that the dough sheet fits easily into the rollers. Run the sheet seam-side first through the widest setting of the pasta rollers, then through the next-widest setting, then through the next-widest setting, and finally again through the next-widest setting. Fold in half lengthwise, press down on the seam, cut off the corners, and repeat the process. If this is done correctly, longitudinal lines will form on the sheet of dough. If you do not see these longitudinal lines, repeat the process until they appear—they are an indication that the gluten has been properly developed.\nWrap dough sheet in plastic wrap or place it, folded, in a zipper-lock bag, then repeat the process with the remaining 2 portions of dough. Let dough sheets rest for at least 30 minutes before proceeding.\nWorking with 1 dough sheet at a time, fold sheet in half, press down on the seam, cut off the corners of the seam, then run the sheet seam-side first through the widest setting of the rollers, then through progressively narrow settings on your pasta machine, until it reaches the thickness you desire (we prefer a thickness between 1 and 1.5 mm).\nIf Cutting by Hand:\nDust each noodle sheet with a sprinkling of potato starch or corn starch, then fold in half lengthwise, then fold it in half lengthwise again. Using a sharp chef’s knife, cut the stacked sheets at 1⁄8-inch intervals to form wide noodles. Once cut, lift and toss the cut noodles to prevent sticking. Once noodles are separated, using your hands, compress the noodles, much as if you were making a snowball, then shake the noodles out to separate them again (this will give the noodles an irregular texture), and fold into loose nests. Place noodles in a zip-top bag and refrigerate overnight. (Noodles can be used immediately, but they improve significantly in texture and flavor if allowed to age slightly.)\nIf Cutting Using Pasta-Roller\nRun each noodle sheet through the wider pasta cutting attachment (as for tagliatelle) and dust and toss the cut noodles with corn starch or potato starch to prevent sticking. Using your hands, compress the noodles, much as if you were making a snowball, then shake the noodles out to separate them again (this will give the noodles an irregular texture), and fold into loose nests. Place noodles in a zip-top bag and refrigerate overnight. (Noodles can be used immediately, but they improve significantly in texture and flavor if allowed to age slightly.)\nTo Cook the Noodles:\nBring a large pot of unsalted water to a rolling boil over high heat. If using noodle baskets, add noodles to baskets and plunge into water, rapidly stirring noodles with tongs or chopsticks to prevent sticking. If not using noodle baskets, add noodles directly to boiling water and stir vigorously with tongs or chopsticks to prevent sticking. Cook, stirring occasionally, for about 2 minutes and 10 seconds. (The exact cooking time will depend on your preferences for doneness and on the thickness of the noodles; see note.) Drain thoroughly, shaking off as much excess water as possible, and toss with sauce for mazemen or add to hot ramen broth for serving.\nSpecial equipment\nDigital scale\n, manual pasta machine or\npasta roller attachment for a stand mixer\n,\nstand mixer\nor\nfood processor\n, rolling pin (optional),\nbench scraper\n(optional), noodle basket (optional)\nNotes\nIn order to determine the exact amount of time the noodles need to boil, you will have to test them. Cut a single noodle into 5 or 6 pieces, place them in boiling water, and remove them at 10 second intervals, starting at 1 minute and 30 seconds. Repeat the process as many times as necessary to confirm the correct boiling time, according to your preferences.\nHomemade alkaline noodles improve significantly if allowed to rest in the refrigerator before use, but these noodles can be used immediately, if required.\nI tested this recipe with both Gold Medal Blue Label all-purpose flour as well as King Arthur all-purpose flour, which has a higher protein content than Gold Medal, and both work quite well. That being said, these noodles will turn out better if you use bread flour of some kind, since the higher protein content in bread flour encourages better gluten development, which gives the noodles a firmer texture and a more pronounced bite.\nMake-Ahead and Storage\nNoodles are best made 24 hours in advance to use. They can be made up to a week in advance and kept in the refrigerator. Noodles that have rested in the refrigerator overnight can be frozen and kept for up to three months.\nThis Recipe Appears In\nThe Ultimate Guide to Making Ramen Noodles at Home\nRamen\nJapanese\nNoodle Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-homemade-ramen-noodles-recipe.webp?"
}