{
  "url": "https://www.seriouseats.com/easy-tart-crust-recipe-8635447",
  "image_url": "https://www.seriouseats.com/thmb/kRPtre7-NrPb7iHHGukqhX6I0BY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240418-SEA-Pat-in-pan-Tart-Crust-AmandaSuarez-hero-63624d4548984cef893e701294fe678d.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Pie Dough"
  ],
  "title": "Easy Pat-in-the-Pan Tart Crust",
  "full_text": "Easy Pat-in-the-Pan Tart Crust\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nTotal\n35 mins\nServes\n6\nto 8\nMakes\n1 crust\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2 cups (6 2/3 ounces;\n190\ng\n)\nall-purpose flour\n1/4 cup (1 3/4 ounce;\n50\ng\n)\ngranulated sugar\n1/4\nteaspoon\nKosher salt\n8 tablespoons (\n113\ng\n)\nunsalted butter\n, melted and cooled slightly\n2 tablespoons (\n30\nml\n) room temperature\ntap water\nDirections\nAdjust oven rack to middle position and heat oven to 350℉ (175℃). In a large bowl, whisk flour, sugar, and salt together. Pour butter and water into the flour mixture and, using a flexible spatula, stir until well combined and a uniform dough is formed.\nSerious Eats / Amanda Suarez\nUsing your hands, pinch off and distribute three-quarters of the dough over the bottom of a 9-inch tart pan with a removable bottom. Press dough to an even thickness in the bottom of the pan. Pinch the remaining dough into smaller pieces and scatter evenly around the edge of the pan, then press dough into fluted sides of the pan. Press dough to even thickness until sides are completely covered.\nSerious Eats / Amanda Suarez\nPlace the lined tart pan on a wire rack set in a rimmed baking sheet and bake until the crust is jsut beginning to turn light golden brown at edges and firm to touch, 20 to 30 minutes, rotating pan halfway through baking. Set aside until ready to fill.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9-inch tart pan with a removable bottom, wire rack, rimmed baking sheet\nTart Crust Flavor Variations\nFor a brown butter tart dough:\nIn the first step, first melt the butter in small saucepan over medium-high heat, swirling saucepan occasionally, until foaming subsides. Cook, stirring and scraping bottom of saucepan with a spatula, until milk solids are dark golden brown and butter has nutty aroma, 1 to 3 minutes. Remove the saucepan from heat and add an additional tablespoon of water. (This compensates for the moisture lost while browning the butter.) When bubbling subsides, transfer the browned butter to a bowl and let cool slightly before pouring it into the flour mixture and proceeding with the recipe.\nFor a chocolate tart dough:\nReduce the flour amount to 1 1/4 cups all-purpose flour and add 1/4 cup Dutch processed cocoa powder to the flour mixture. When baking, it will be harder to notice the visual cues of doneness since the tart will already be dark brown before baking. Instead, rely on the time, smell, and touch to tell when the chocolate tart shell is properly baked. The shell should feel firm and crisp to the touch.\nFor a citrus-scented tart dough:\nMince 3 teaspoons grated lemon, orange, or lime zest as fine as possible before whisking into the flour mixture in the first step of the recipe.\nMake-Ahead and Storage\nCooled crust can be wrapped loosely in plastic wrap and stored at room temperature for up to 24 hours.\nDesserts\nThe Latest\nPie Dough",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-pat-in-the-pan-tart-crust.webp?"
}