{
  "url": "https://www.seriouseats.com/easy-fava-bean-carrot-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/jr-bEqWI4T8MppFXlgpWM72l7EQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160503-fava-carrot-ricotta-salad-recipe-1-12182f6c9a2a456d8716b52faecb62a4.jpg",
  "tags": [
    "Fava Beans",
    "Spring Salads",
    "Vegetarian Salads",
    "Stovetop",
    "Ricotta"
  ],
  "title": "Easy Fava Bean and Carrot Salad With Ricotta Recipe",
  "full_text": "Easy Fava Bean and Carrot Salad With Ricotta Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nActive\n15 mins\nTotal\n25 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n700\ng\n)\nfresh fava bean pods\nKosher salt\n2\nsmall\ncarrots\n(about\n4\nounces\n;\n115\ng\n), with a small handful of their tenderest greens if available\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n1\ntablespoon\n(\n15\nml\n)\nfresh juice\nfrom\n1\nlemon\n, plus a large pinch of grated zest\n1\nsmall\nshallot\n(about\n1\nounce\n;\n30\ng\n), thinly sliced\nFreshly ground black pepper\n6\nounces\n(\n170\ng\n)\nhigh-quality ricotta cheese\n(see note)\n4\nslices\nhearty toast\nDirections\nOpen up fava bean pods and remove individual beans. Discard pods. Bring a medium pot of salted water to a boil and prepare an ice bath. Add fava beans to pot and cook until crisp-tender, about 1 minute. Transfer fava beans to ice bath and allow to chill for 1 minute. Carefully peel off and discard the outer skin from each bean.\nScrub carrots under cold running water. Rinse greens (if using). Using a sharp knife, a vegetable peeler, or a mandoline, very thinly slice carrots on a strong bias. Transfer carrot slices to ice bath and set aside.\nIn a large bowl, whisk together olive oil, lemon juice, and lemon zest. Add fava beans and shallot. Carefully dry carrots and greens (if using) and add to bowl. Toss to combine and season to taste with salt and pepper.\nSpread ricotta over the bottom of a serving plate and top with dressed vegetables. Serve with toast. Drizzle with more olive oil just before serving, if desired.\nNotes\nUse a high-quality store-bought ricotta that contains no gums or thickeners. The ingredients should list only milk or whey, salt, and a starter culture or acid. Our favorite nationally available brand is Calabro. Alternatively, it's easy to\nmake your own ricotta\n.\nThis Recipe Appears In\nEasiest Spring Ever: Fava Bean and Carrot Salad With Fresh Ricotta\nFava Beans\nSpring Salads\nVegetarian Salads\nStovetop\nRicotta"
}