{
  "url": "https://www.seriouseats.com/easy-pork-rillettes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/g2Q9qcwrXWUQ2xmOuWF0jsCIooY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__02__20170215-pork-rillettes-12-9c40e815348146b5b8637fb423996212.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Christmas Appetizers",
    "French",
    "Pork Shoulder",
    "New Years"
  ],
  "title": "Easy Pork Rillettes (Slow-Cooked Pork Spread)",
  "full_text": "Easy Pork Rillettes (Slow-Cooked Pork Spread)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n3 hrs\nActive\n30 mins\nChilling Time\n2 hrs\nTotal\n5 hrs 30 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nboneless, skinless pork shoulder\n, cut into 1 1/2-inch chunks (about 1kg)\nKosher salt\n1/2\ncup\nvegetable oil, lard, or\nduck fat\n(120ml)\n4\nbay leaves\n6\nfresh thyme\nsprigs\n2\nlarge\nshallots\n, very roughly chopped\n4\nmedium\ncloves garlic\n, split in half\nFreshly ground nutmeg\n, to taste\nDirections\nAdjust oven rack to lower position and preheat oven to 275°F (140°C). Season pork lightly with salt and pack into a Dutch oven, roasting pan, or casserole dish. It should fit in a layer about 2 inches deep. Pour oil over the pork (if using lard or duck fat, heat until just melted before pouring over pork). Nestle bay leaves, thyme sprigs, shallots, and garlic in with the pork. Cover pan tightly with aluminum foil, transfer to oven, and cook until pork is completely tender and shows very little resistance when pierced with a knife, about 3 hours.\nSerious Eats / J. Kenji López-Alt\nRemove from oven and using tongs, discard bay leaves, thyme, shallots, and garlic. Set a large strainer over a heatproof bowl and carefully pour pork mixture into it. Reserve drained fat and juices.\nSerious Eats / J. Kenji López-Alt\nTransfer pork chunks to the bowl of a stand mixer fitted with a paddle attachment\n(see note). Turn mixer on to low speed and gradually increase speed to medium, allowing pork to break down and shred. Slowly drizzle in the fat and juices a few tablespoons at a time, tasting in between each addition until the mixture is as loose and creamy as you like it. Season to taste aggressively with salt (the mixture will get blander as it chills, so add salt until it almost tastes too salty).\nSerious Eats / J. Kenji López-Alt\nCarefully pack mixture into jars, spooning it in a little bit at a time and making sure to remove all air bubbles. Smooth tops of mixture with the back of a spoon, wipe rims of jars with a clean cloth, then pour a quarter inch of fat on top of each one. Close lids and refrigerate for at least 2 hours and up to a week before serving. Serve lightly chilled with bread or crackers and cornichons, whole grain mustard, and fruit preserves. Rillettes can also be frozen directly in their jars and held for several months. Defrost in the refrigerator overnight before serving.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nStand mixer\n, half-pint canning jars\nNotes\nYou can also make the rillettes with a potato masher in a large bowl if you do not have a stand mixer.\nRead More\nSalmon Rillettes With Chives and Shallots Recipe\nChicken Liver Pâté With Bourbon and Cranberry Gelée Recipe\nTraditional Duck Confit Recipe\nCharcuterie 101: Essential French Cured Meats and More\nHors D'Oeuvres\nChristmas Appetizers\nFrench\nPork Shoulder\nNew Years"
}