{
  "url": "https://www.seriouseats.com/easy-air-fryer-broccoli-recipe-8643935",
  "image_url": "https://www.seriouseats.com/thmb/aAuAx1oI-Wy_sFF56Km3oIo9JUk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240506SeriousEats_AirFryerBroccoli_Glaze_Beauty_3x4_033-57744911a3b54a23918e6712f1dacd75.jpg",
  "tags": [
    "Broccoli",
    "The Latest",
    "Quick Sides",
    "Vegetarian",
    "Air Fryer Recipes"
  ],
  "title": "Crispy Air-Fryer Broccoli",
  "full_text": "Crispy Air-Fryer Broccoli\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nTotal\n15 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nbroccoli florets\n, cut into 1 1/2 to 2-inch pieces (\n6\ncups\n;\n453\ng\n)\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n3/4\nteaspoon\nDiamond Crystal\nkosher salt;\nfor\ntable salt\n, use half as much by volume\nFreshly ground black pepper\nDirections\nPreheat a 6-quart air fryer to 400°F (205ºC) for 5 minutes. Meanwhile, in a large bowl, toss broccoli with oil, salt, and pepper and toss to evenly coat. Pour broccoli into air fryer basket and cook until broccoli is still bright green but starting to char around edges, about 5 minutes. Remove basket from air fryer and shake to toss broccoli florets. Return to air fryer and decrease temperature to 340°F (170ºC). Cook until broccoli is crisp-tender, about 3 more minutes. Remove and transfer broccoli to a serving platter or plates.\nSerious Eats / Morgan Hunt Glaze\nVariations\nChili Crisp\n:\nSpoon 2 tablespoons chili crisp over air-fried broccoli, tossing to evenly coat, and serve.\n“Caesared” Bread Crumbs:\nIn a small nonstick skillet, melt 1 tablespoon (14g) salted butter over medium-low heat. Add 1/4 cup plain dried bread crumbs and, using a flexible spatula, toss to coat. Add 1 teaspoon anchovy paste and 1/2 teaspoon grated garlic (about 1 small clove) to hot bread crumbs and stir constantly until bread crumbs are golden brown, about 3 minutes. Sprinkle over broccoli and top with 1 teaspoon fresh lemon zest and 1 tablespoon Parmigiano-Reggiano, finely shredded on a microplane.\nSesame-Ginger:\nIn a large bowl, toss broccoli florets with 2 tablespoons (30ml) canola oil, 1 tablespoon (15ml) tamari, and 1 tablespoon finely chopped ginger. Air fry as directed. Garnish with 1 teaspoon toasted sesame seeds before serving.\nSmoked Almonds and Cheddar:\nTop air-fried broccoli with 2 tablespoons chopped smoked almonds and 1/2 ounce (14g) extra-sharp cheddar cheese, shredded on the large holes of a box grater.\nMiso-Butter:\nIn a large bowl,\nwhisk together 1 tablespoon (14g) melted unsalted butter, 1 tablespoon white miso paste, 2 teaspoons unseasoned rice vinegar, 1 1/2 teaspoons maple syrup, and 1 tablespoon (15ml) water until well-combined. Add hot air-fried broccoli and toss to coat.\nSpecial Equipment\n6-quart air fryer\nMake-Ahead and Storage\nBroccoli crowns can be chopped into florets and refrigerated in a zip-top bag or airtight container up to 3 days before cooking.\nAir-fried broccoli can be made up to 4 days in advance and refrigerated in an airtight container. Reheat in a microwave or air fryer preheated to 340ºF (170ºC) until warm.\nBroccoli\nThe Latest\nQuick Sides\nVegetarian\nAir Fryer Recipes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crispy-air-fryer-broccoli.webp?"
}