{
  "url": "https://www.seriouseats.com/easy-funnel-cake-fried-dough-recipe",
  "image_url": "https://www.seriouseats.com/thmb/S2iGMAi981vmcsS2Vr0CIehGR1M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240513-FunnelCake-MorganHuntGlaze-hero-55fac67a29d243fabfe0bdbdbd38e673.jpg",
  "tags": [
    "Desserts",
    "American",
    "Pastries",
    "Frying",
    "Cakes"
  ],
  "title": "Easy Funnel Cake",
  "full_text": "Easy Funnel Cake\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n25 mins\nServes\n2 servings\nMakes\n1 8-inch funnel cake\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\nquarts\n(1.4L)\nneutral oil\nsuch as vegetable or peanut oil for frying\n2 cups dry store-bought “complete” buttermilk\npancake mix\n(9 ounces;\n255\ng\n)  or dry\nThick and Fluffy pancake mix\n(see notes)\n2\ntablespoons\nsugar\n(3/4 ounces; 21g)\n1\ncup\n(237ml)\nwater\n, plus more if needed\n1\ntablespoon\n(15ml)\nvanilla extract\nPowdered sugar\nto garnish\nDirections\nIn a 4-quart saucepan of Dutch oven that measures roughly 9-inches in diameter, heat oil to 375°F (190°C) and adjust as needed to maintain temperature. (see notes)\nSerious Eats / Morgan Hunt Glaze\nWhile oil is heating, in a large bowl, whisk pancake mix and sugar to combine. Whisk in water and vanilla until smooth. Batter should resemble the thickness of cake batter; It should form thick ribbons as it falls when lifted out of the bowl with whisk. If needed, add 1 tablespoon of additional water at a time to reach proper consistency.\nSerious Eats / Morgan Hunt Glaze\nIf Using a Squeeze Bottle:\ncut opening of a large squeeze bottle so it measures 1/2-inch in diameter. Add batter and close lid.\nSerious Eats / Morgan Hunt Glaze\nIf Using a Funnel:\nUse a large funnel with an opening that measures about 1/2-inch in diameter. Cover the bottom opening of the funnel with your finger and center over the saucepan. Pour batter into the funnel and move finger as needed to control the flow of the batter. Alternatively, transfer batter to a 4-cup liquid measuring cup for pouring slowly directly into the hot oil.\nSerious Eats / Morgan Hunt Glaze\nCarefully squeeze batter from the prepared squeeze bottle or slowly pour and drizzle batter into hot oil, working quickly and swirling in a circular pattern around the circumference of the saucepan, then swirl and crisscross the batter over itself to fill in the funnel cake to form a round shape. use caution as the oil may bubble up slightly when initially pouring.\nSerious Eats / Morgan Hunt Glaze\nFry cake until golden brown on the first side, 1 to 2 minutes. Use cooking chopsticks or a spider skimmer or slotted spoon and a heat-safe spatula to carefully flip the funnel cake and fry until the second side is golden brown, about 1 minute. Transfer to a paper towel-lined plate.\nSerious Eats / Morgan Hunt Glaze\nUse a fine-mesh strainer to lightly dust the funnel cake with powdered sugar. Serve immediately.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\n4-quart saucepan\nthat measures about 9-inches in diameter, 3-cup\nsqueeze bottle\nor funnel or\n4-cup liquid measuring cup\n,\ncooking chopsticks\nor\nspider skimmer\nor\nslotted spoon\nNotes\nThis recipe can be scaled up to make multiple funnel cakes that are mixed and fried separately.\nIf using a store-bought pancake mix, look for one that says “complete” on packaging and that only requires adding water.\nDesserts\nAmerican\nPastries\nFrying\nCakes"
}