{
  "url": "https://www.seriouseats.com/easy-kids-dumplings",
  "image_url": "https://www.seriouseats.com/thmb/V77LYJnZCFoKRNjUPEknFY9fM1U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__08__Pipo-Dumplings-cropped-b40ca41ebecd4ab8942af042a45e58a5.jpg",
  "tags": [
    "Japanese",
    "Pork",
    "Shrimp",
    "Snacks & Appetizers",
    "Game Day"
  ],
  "title": "Kid-Friendly Dumpling Recipe | The Food Lab Junior",
  "full_text": "Kid-Friendly Dumpling Recipe | The Food Lab Junior\nClose\nJump to recipe\nPrep\n50 mins\nCook\n10 mins\nTotal\n60 mins\nServes\n25\nto 30 dumplings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork and Shrimp Dumpling Filling:\n1/2\npound\n(225g) finely minced\nNapa\nor green\ncabbage\n(about 1/2 a small head)\n1 1/2\nteaspoons\n(6g) Diamond Crystal\nkosher salt\n, divided (for table salt, use half as much by volume or use the same weight)\n1/2 pound (\n225\ng\n)\nground pork\n4 ounces (\n113\ng\n)\npeeled frozen shrimp\n, thawed and roughly chopped\n2\nteaspoons\n(8g)\nsugar\nUp to\n1\ntablespoon\nminced fresh garlic\nfrom about 3 medium cloves (optional)\nUp to\n1\nteaspoon\nminced peeled fresh ginger\n(optional)\nUp to\n1/4\ncup minced\nscallions\n(optional)\nUp to\n1\nteaspoon\n(5ml)\ntoasted sesame oil\n(optional)\nUp to\n2\ntablespoons\nminced\nfresh herbs such as\ncilantro\n, basil, mint, or dill (optional)\nUp to\n1\nteaspoon\n(5ml)\nsoy sauce\n(optional)\nUp to\n1/2\nteaspoon\nwhite pepper powder\n(optional)\nFor the Dumplings:\n1\npackage\ndumpling wrappers\n(40 to 50 wrappers)\nVegetable or\ncanola oil\n, for cooking\nFor the Dumpling Sauce:\n2\nteaspoons\n(8g)\nsugar\n2\ntablespoons\n(30ml) hot\nwater\n2\ntablespoons\n(30ml)\nsoy sauce\n1\ntablespoon\n(15ml)\nChinkiang\n, rice, or balsamic\nvinegar\nAromatics such as\ngarlic\n, ginger, sesame oil, and minced scallions, as desired\nDirections\nFor the Dumpling Filling:\nLine a fine-mesh strainer with a clean dish towel. In a large mixing bowl, combine cabbage and 1 teaspoon salt and toss to combine. Transfer cabbage to towel-lined strainer, set it over bowl, and let stand at room temperature until cabbage has started giving up its moisture and is wilting, about 15 minutes.\nLet kids massage cabbage if they’d like (it’ll help speed the process along). Now is also a good time to start picking which aromatics you’ll want to use in the meat mixture, and to chop up the garlic, ginger, scallions, and herbs (if using). My daughter, Alicia, likes to peel ginger using the edge of a teaspoon, and smashing garlic and ginger in a mortar and pestle is a very kid-friendly task.\nGather up the edges of the dish towel and twist them to squeeze the cabbage. Kids can help wring out as much excess moisture as possible. I like to measure how much liquid came out to show Alicia how much water is inside a cabbage. Discard the liquid, then return the cabbage to the bowl.\nAdd pork, shrimp, sugar, remaining 1/2 teaspoon salt, and any aromatics you choose to bowl and, using clean hands, knead and mix until filling is homogenous and starting to feel tacky/sticky. Transfer a teaspoon-sized amount to a microwave-safe plate and microwave on high power until cooked through, about 10 seconds. Taste and adjust seasoning as desired. This is a good time to let kids taste the mixture and offer input. (\"Do you think this needs more salt? Maybe more ginger?,\" etc.) Make sure kids wash their hands after handling the raw pork and shrimp mixture and before eating.\nSet up a work station with a small bowl of water, a clean dish towel for wiping fingers, a bowl with the dumpling filling, a couple spoons for putting filling into wrappers, a parchment-lined rimmed baking sheet for the finished dumplings, and a stack of dumpling wrappers covered in plastic wrap.\nFor the Dumplings:\nTo form dumplings, hold one wrapper on top of a flat hand, or lay it flat on a cutting board (make sure the remaining stack of wrappers stays under plastic—they dry out quickly). Using a spoon, smear a 2 teaspoon- to 1 tablespoon-sized amount of filling in center of wrapper. Use the tip of a finger to very gently moisten the edge of the wrapper with water (try not to use too much water, though with toddlers it’s almost inevitable—if work surface is visibly wet, transfer wrapper you’re working on to a separate small board or plate to finish, then have a sponge handy to dry off the main board before starting on the next). Wipe your fingertips dry on a kitchen towel.\nWorking from one side, carefully seal the filling inside wrapper by folding it into a crescent shape while pushing out as much air as possible. As you get better, you can start to add pleats to shape to form small purses (see\nhere for detailed folding illustrations\n). Transfer finished dumplings to parchment-lined baking sheet. Your kids’ dumplings (or yours) may end up misshapen, or filling might be squeezing out one end, or there may be a hole in the wrapper. This is all okay; I promise they will still taste great.\nAt this point dumplings may be frozen by placing baking sheet in freezer. Freeze dumplings for at least 30 minutes then transfer to a zipper-lock freezer bag for long-term storage. Dumplings can be frozen for up to 2 months and cooked directly from freezer.\nTo cook, bring a large pot of water to a boil, add dumplings, and boil until they are cooked through, about 2 minutes if fresh and 3 minutes if frozen. Remove them from water with a slotted spoon or metal spider.\nAlternatively, dumplings can be steamed in a bamboo steamer lined with cabbage leaves or parchment, set on top of a wok with an inch of simmering water. Steam for 4 minutes if fresh and 6 minutes is frozen. If you like your dumplings crispy, transfer to a non-stick skillet preheated with a little vegetable oil over medium heat, spread into a single layer, and cook, swirling pan occasionally, until golden brown and crisp. Serve dumplings with dipping sauce.\nFor the Dipping Sauce:\nCombine sugar, hot water, soy sauce, vinegar, and any aromatics. Stir well to combine.\nSpecial Equipment\nCotton kitchen towels,\nfine-mesh strainer\n,\nrimmed baking sheet\nNotes\nThe dumpling filling is very versatile and easily adaptable to suit your own taste. For instance, you can omit the shrimp, or replace the pork with beef, or use spinach instead of cabbage. As long as your vegetables are salted and squeezed (a fun task for any kid!), you have enough ground meat to bind everything together, the dumplings will work.\nJapanese\nPork\nShrimp\nSnacks & Appetizers\nGame Day"
}