{
  "url": "https://www.seriouseats.com/easy-vegetable-fried-rice-recipe",
  "image_url": null,
  "tags": [
    "White Rice",
    "Chinese",
    "Chinese-American",
    "Stir-Fry"
  ],
  "title": "Easy Fried Rice",
  "full_text": "Easy Fried Rice\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n10 mins\nTotal\n25 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\ncooked white rice\n(12 ounces; 350g; see notes)\n2\ntablespoons\n(30ml) vegetable or\ncanola oil\n, divided\n1 small\nonion\n, finely chopped (4 ounces;\n115\ng\n)\n1 medium\ncarrot\n, peeled and cut into small dice (3 ounces;\n85\ng\n)\n2\nscallions\n, thinly sliced (1 ounce;\n30\ng\n)\n2 medium cloves\ngarlic\n, minced (about 2 teaspoons;\n5\ng\n)\n1\nteaspoon\n(5ml)\nsoy sauce\n1\nteaspoon\n(5ml)\ntoasted sesame oil\nKosher salt\nand ground white pepper\n1\nlarge\negg\n4 ounces (\n115\ng\n)\nfrozen peas\nDirections\nIf using day-old rice (see notes), transfer to a medium bowl and break rice up with your hands into individual grains before proceeding. Heat 1/2 tablespoon (7ml) vegetable oil in a wok over high heat until smoking. Add half of rice and cook, stirring and tossing, until rice is pale brown and toasted and has a lightly chewy texture, about 3 minutes. Transfer to a medium bowl. Repeat with another 1/2 tablespoon oil and remaining rice.\nSerious Eats / Eric Kleinberg\nReturn rice to wok and press it up the sides, leaving a space in the middle. Add 1/2 tablespoon (7ml) oil to the space. Add onion, carrot, scallions, and garlic and cook, stirring gently, until lightly softened and fragrant, about 1 minute. Toss with rice to combine. Add soy sauce and sesame oil and toss to coat. Season to taste with salt and white pepper.\nSerious Eats / Eric Kleinberg\nPush rice to side of wok and add remaining 1/2 tablespoon (7ml) oil. Break egg into oil and season with a little salt. Use a spatula to scramble egg, breaking it up into small bits. Toss egg and rice together.\nSerious Eats / Eric Kleinberg\nAdd frozen peas and continue to toss and stir until peas are thawed and every grain of rice is separate. Serve immediately.\nSerious Eats / Eric Kleinberg\nSpecial Equipment\nA\nflat-bottomed wok\nNotes\nFor the best results, use Chinese-style medium-grain rice, jasmine rice, or sushi rice. Rice should either be cooked fresh, spread on a tray, and allowed to cool for five minutes, or, alternatively, transferred to a loosely covered container and refrigerated for at least 12 hours and up to 3 days.\nRead More\nChinese-American Orange Chicken\nEgg Drop Soup\nBasic White Rice\nHow to Make Tahdig (Persian Crunchy Rice)\nWhite Rice\nChinese\nChinese-American\nStir-Fry"
}