{
  "url": "https://www.seriouseats.com/easy-ricotta-gelato-recipe",
  "image_url": "https://www.seriouseats.com/thmb/cFx7GnOKN2aVHnds9PCkGVpG-8Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__11__20131112-ricotta-gelato-952e832ab89a4262aa13b8e6a8874704.jpg",
  "tags": [
    "Ice Cream",
    "Ricotta"
  ],
  "title": "Ricotta Gelato Recipe",
  "full_text": "Ricotta Gelato Recipe\nClose\nJump to recipe\nPrep\n5 mins\nActive\n45 mins\nChurning/Freezing Time\n4 hrs 45 mins\nTotal\n4 hrs 50 mins\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\nricotta cheese\n1 1/2\ncups\nwhole milk\n3/4\ncup\ncorn syrup\n1/2\ncup\nsugar\n1\nteaspoon\nkosher salt\nOptional\nmix-ins\n(see note)\nDirections\nIn a blender combine ricotta, milk, corn syrup, and sugar. Blend until very well combined, about 30 seconds. Add salt to taste, 1/4 teaspoon at a time. If adding citrus zest, do so now. If adding larger mix-ins wait until ice cream has almost finished churning.\nIf ice cream base is sufficiently cold (below 40°F or 4°C), churn right away. If not, chill blender carafe in refrigerator until base cools.\nChurn base in ice cream maker according to manufacturer's instructions. If adding chunky mix-ins, do so in the last minute of churning. Transfer ice cream to airtight container and chill in freezer for at least 4 to 5 hours before serving.\nNotes\nLook for fresh, finely grained ricotta that doesn't skimp on fat. See our taste test on the best storebought ricotta\nhere\n; this ice cream was made with Sorrento.\nCorn syrup gives the ice cream a smooth, easy-to-scoop, glossy texture despite its relatively low fat content. Other liquid sugars like agave nectar or honey can't be substituted without altering the recipe.\nA teaspoon or two of lemon, orange, or grapefruit zest would be a nice addition, as would dark chocolate or cocoa nibs, candied orange peel and chopped pistachio, or a drizzle of honey.\nSpecial Equipment\nBlender\nor\nfood processor\n,\nice cream maker\nRead More\nWhat's the Difference Between Gelato and Ice Cream?\nFior di Latte Gelato\nLemon Mascarpone Gelato\nStracciatella Gelato (Sweet Cream Chocolate Chip)\nIce Cream\nRicotta",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ricotta-gelato-recipe.webp?"
}