{
  "url": "https://www.seriouseats.com/easy-pie-dough-recipe",
  "image_url": "https://www.seriouseats.com/thmb/na2m8OUx5-wJ_hRTwF0YiClN3Bs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__11__20151017-easy-pie-dough-vicky-wasik-19-8a12f61a9f764284a644b99b48963ba9.jpg",
  "tags": [
    "Pie Dough",
    "Pies",
    "Thanksgiving Desserts"
  ],
  "title": "Easy Pie Dough (Crust)",
  "full_text": "Easy Pie Dough (Crust)\nClose\nJump to recipe\nPrep\n20 mins\nActive\n10 mins\nChilling Time\n2 hrs\nTotal\n2 hrs 20 mins\nServes\n16 servings\nMakes\n2 crusts\nCook Mode\n(Keep screen awake)\nIngredients\n2 3/4 cups (12.5 ounces;\n350\ng\n)\nall-purpose flour\n, divided\n2 tablespoons (\n25\ng\n)\nsugar\n1 1/2\nteaspoons\n(5g) Diamond Crystal\nkosher salt\n; for table salt, use same weight or half as much by volume\n2 1/2 sticks (10 ounces;\n280\ng\n)\nunsalted butter\n, cut into 1/4-inch-thick slices (see note)\n6 tablespoons (3 ounces;\n85\nml\n) cold\nwater\nDirections\nCombine two thirds of flour with sugar and salt in the bowl of a food processor. Pulse twice to incorporate. Spread butter slices evenly over surface. Pulse until no dry flour remains and dough just begins to collect in clumps, about 25 short pulses. Use a rubber spatula to spread the dough evenly around the bowl of the food processor. Sprinkle with remaining flour and pulse until dough is just barely broken up, about 5 short pulses. Transfer dough to a large bowl.\nSerious Eats / Vicky Wasik\nSprinkle with water. Then, using a rubber spatula, fold and press dough until it comes together into a ball. Divide ball in half. Form each half into a 4-inch disk. Wrap tightly in plastic and refrigerate for at least 2 hours before rolling and baking.\nSerious Eats / Vicky Wasik\nWhen ready to shape the dough, pull out one ball, set it on a well-floured work surface, and sprinkle with more flour. Use a tapered rolling pin to start rolling the dough out into a circle, lifting the dough and rotating it while rolling to achieve an even shape. Continue rolling, changing the angle of your rolling pin as you go to get an even shape and thickness. The finished dough should overhang your pie plate by an inch or two.\nSerious Eats / Vicky Wasik\nPick up the dough by carefully rolling it around your rolling pin, using your bench scraper to help lift it off the work surface. Unroll it over a pie plate. Gently lift and fit the dough into the pie plate, getting down into the corners.\nSerious Eats / Vicky Wasik\nFor a single-crusted pie, use a pair of scissors to trim the dough so that it overhangs the edge by 1/2 inch all around. For a double-crusted pie, at this stage, fill it and drape your second round of pie dough over the top. Trim it to a 1/2-inch overhang along with the lower crust. Either way, tuck the overhanging edge(s) under itself all the way around the pie.\nSerious Eats / Vicky Wasik\nFlute the edges of the pie crust using the forefinger of one hand and the thumb and forefinger of the other. The single-crust pie shell is\nready to be blind-baked\nor filled. For a double-crusted pie, brush with an egg white, sprinkle with sugar, and cut vent holes in the top with a sharp knife before baking.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n,\ntapered French rolling pin\n,\npie plate(s)\nNotes\nFor a slightly more tender crust, replace up to 6 tablespoons of butter with vegetable shortening. Pie dough can be frozen for up to 3 months. Thaw in refrigerator before rolling and baking.\nRead More\nButtery, Flaky Pie Crust Recipe\nCook's Illustrated's Foolproof Pie Dough Recipe\nWhole Wheat Pie Crust Recipe\nA Crash Course in Mastering Pie Dough\nThe Science of Pie: 7 Pie Crust Myths That Need to Go Away\nPie Dough\nPies\nThanksgiving Desserts"
}