{
  "url": "https://www.seriouseats.com/easy-indonesian-peanut-sauce-recipe-8643120",
  "image_url": "https://www.seriouseats.com/thmb/9Z5k7rPYOq7iQlYtnyq_8ralk-k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240503-SEA-PeanutSauce-MelatiCitrawireja-10-1a884405c52f48208ea199e9fd2ed98d.jpg",
  "tags": [
    "Southeast Asian",
    "The Latest",
    "Condiments & Sauces",
    "Asian"
  ],
  "title": "Peanut Sauce",
  "full_text": "Peanut Sauce\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nServes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1 heaping cup\nroasted peanuts\n(about 5 ounces;\n140\ng\n), see notes\n2 small Asian\nshallots\n(2 ounces;\n57\ng\n), roughly chopped\n1 medium\nclove garlic\n(\n5\ng\n), crushed\n2 medium-hot, finger-length red\nchiles\nlike Fresno, cayenne, or serrano (2 ounces;\n57\ng\n), stemmed, seeded, and chopped (see notes)\n5 bird’s eye chiles or Thai\nchiles\n(1 ounce;\n28\ng\n), stemmed\n3 tablespoons (\n36\ng\n) shaved\npalm sugar\n(preferably gula merah); see notes\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nterasi\n(shrimp paste)\n, optional (see note)\n2\nfresh\nmakrut lime leaves\n1 tablespoon (\n20\ng\n)\n“wet”\ntamarind pulp\n,\nor 1 tablespoon fresh lime juice, preferably key lime (see notes)\nDirections\nIf using roasted peanuts, process in a high-speed blender or food processor until a paste the texture of wet sand forms, 3 to 4 minutes. (It will be coarser than peanut butter; you will get about 1 cup. If using a mortar and pestle, grind roasted) Transfer peanut paste to a small bowl and set aside.\nSerious Eats / Melati Citrawireja\nAdd shallots, garlic, red chiles, bird’s eye chiles, palm sugar, salt, and shrimp paste (if using) to the now empty food processor or blender and pulse, stopping to scrape down the sides of the bowl as needed with a flexible spatula, until the mixture resembles cooked oatmeal, 30 seconds to 1 minute. If paste is too thick and not turning in the food processor, add water, 1 teaspoon at a time, until it loosens to your desired consistency.\nSerious Eats / Melati Citrawireja\nIn a small saucepan, bring lime leaves, tamarind, and 1 cup (240 ml) water to a gentle boil over medium heat. Simmer, using a spoon or spatula to break up the tamarind pulp as much as possible and infuse the flavors, about 5 minutes. Remove the lime leaves and remaining tamarind solids.\nSerious Eats / Melati Citrawireja\nStir in ground peanuts and chile paste, and cook over medium heat. When the mixture starts bubbling, reduce heat to medium-low and simmer until thick and creamy, stirring often to prevent sauce from sticking to bottom of the pot, 4 to 6 minutes  If you prefer a looser sauce, add water 1 tablespoon at a time until you reach your desired consistency. Adjust seasoning to taste. Serve.\nSerious Eats / Melati Citrawireja\nSpecial Equipment\nFood processor, blender, or mortar and pestle\nNotes\nThe texture and flavor of peanut butter cannot compare to that of whole peanuts, but if you’d prefer the convenience of peanut butter, use 2/3 cup natural unsalted crunchy peanut butter (6 ounces; 170g). Try to look for the freshly ground peanut butter in grocery stores, as it’s the closest in taste and texture to freshly ground peanuts. Use creamy if that’s what you prefer.\nAlmonds or cashews can be substituted for peanuts.\n1 tablespoon (1/2 ounce; 15g) sambal oelek can be substituted for 2 red chiles.\nIndonesian palm sugar, known as gula merah, gula Jawa or gula aren, is less processed than the more ubiquitous pale yellow version used in Thai cooking. Gula Malacca from Malaysia is similar. Gula merah can be found at Asian grocery stores, especially those specializing in Southeast Asian ingredients. Coconut sugar or dark brown sugar can be substituted for palm sugar.\nShrimp paste, makrut lime leaves and kecap manis are often available at Asian grocery stores, especially those specializing in Southeast Asian ingredients.\nTamarind concentrate sold in jars and tubs is not my first choice because they vary in quality. You will likely have to use two to three times the amount listed in my recipe. Just taste as you go.\nThe recipe can easily be doubled if desired.\nTo make peanut sauce with a mortar and pestle: Grind roasted, unsalted peanuts until they have the texture of coarse sand. Transfer peanut paste to a small bowl and set aside. Using the now empty mortar and pestle, pound shallots, garlic, red chiles, bird’s eye chiles, palm sugar, salt, and shrimp paste (if using) until the mixture is thick like oatmeal. Proceed with step 3.\nMake-Ahead and Storage\nStore peanut sauce in an airtight container in the refrigerator for up to 5 days. To reheat, warm peanut sauce in a saucepan set on medium-low heat. Add water, one tablespoon at a time, to loosen to desired consistency.\nSoutheast Asian\nThe Latest\nCondiments & Sauces\nAsian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/peanut-sauce.webp?"
}