{
  "url": "https://www.seriouseats.com/easy-no-knead-focaccia",
  "image_url": "https://www.seriouseats.com/thmb/08g3zRAr3BZWcoBaB1GvHZs8XeI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-HomemadeFocaccia_SECastIron_09-GregDuPree_1-12b3b737e134430787af6c2061defcca.jpg",
  "tags": [
    "Italian",
    "Vegan Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Yeast Breads",
    "Snacks & Appetizers"
  ],
  "title": "Homemade Focaccia",
  "full_text": "Homemade Focaccia\nClose\nJump to recipe\nPrep\n35 mins\nCook\n45 mins\nActive\n30 mins\nRising Time\n21 hrs 25 mins\nTotal\n22 hrs 45 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n500\ngrams\nbread or all-purpose flour\n(\n17.5\nounces\n; about\n3 1/4\ncups)\n, see note\n10\ngrams\nDiamond Crystal kosher salt\n(\n0.4\nounce\n;\n2 1/2\nteaspoons\n); for table salt, use about half as much by volume or the same weight\n4\ngrams\ninstant dry yeast\n, such as SAF (\n0.1\nounce\n;\n1/2\npacket\nor\n1\nrounded teaspoon\n)\n400\ngrams\nroom temperature water\n(\n14.1\nounces\n;\n1 1/2\ncups\nplus\n3\ntablespoons\n)\n68\ngrams\nextra-virgin olive oil\n(\n2.4\nounces\n;\n5\ntablespoons\n), divided\nCoarse sea salt\n, such as\nMaldon\nor\nfleur de sel\nDirections\nFor the Dough:\nCombine flour, salt, and yeast in a large bowl and whisk together until homogenous. Add water and stir with a wooden spoon until no dry flour remains, about 2 minutes. Add 20 grams (0.7 ounces; 1 1/2 tablespoons) olive oil and stir to incorporate, using hands if necessary to work oil into dough. Cover with plastic wrap, then let rest at room temperature for 1 hour.\nRemove plastic wrap (but don't discard), and, using a lightly greased bowl scraper, fold dough over itself by lifting and folding edge of dough toward middle. Turn bowl 45 degrees and fold dough again; repeat turning and folding motion 4 more times (total of 6 folds). Cover tightly with reserved plastic wrap and let rest for 15 minutes.\nRepeat this entire folding process once more. Cover bowl tightly with plastic wrap, and refrigerate for at least 18 hours or up to 3 days.\nBaking the Focaccia:\nRemove dough from refrigerator and let sit at room temperature for 10 minutes. Sprinkle the top of the dough lightly with flour, then transfer it to a lightly-floured work surface. Shape it by holding it with well-floured hands and tucking the dough underneath itself, rotating it until it forms a tight ball.\nPour 28 grams (1 ounce; 2 tablespoons) olive oil into 10- or 12-inch cast iron skillet and spread over entire inner surface (including rim) with your hands. Transfer dough to pan, turn to coat in oil, position seam-side-down, and spread gently with your hands to mostly fill the pan (don't worry if dough doesn't fully stretch to edges). Cover tightly with plastic wrap and let rise at room temperature until dough is very soft and puffy and nearly doubled in volume, 1 1/2 to 2 hours.\nOne hour before baking, adjust oven rack to lower-middle position. Place baking stone or Baking Steel on it, and preheat oven to 500°F (260°C). Using your fingertips, gently press and stretch dough to evenly fill all corners of the pan. Lift up one edge of the dough to let air bubbles underneath escape and repeat, moving around the dough until there are no large air bubbles left underneath and the dough is evenly spread around the pan. Using fingertips, gently press on surface of dough to create small dimples. Drizzle remaining 20 grams (0.7 ounces; 1 1/2 tablespoons) olive oil over top of dough, then sprinkle with coarse sea salt.\nTransfer skillet to oven, positioning it on top of baking stone, and bake, rotating pan halfway through baking, until top is golden brown and bottom is golden brown and crisp when you lift it with a thin spatula, 25 to 30 minutes. Let focaccia cool in skillet for 5 minutes, then use a thin spatula to transfer focaccia to wire rack set inside a rimmed baking sheet. Spoon or brush any olive oil left in the skillet over the focaccia, and let cool for at least 10 minutes before slicing. Serve warm or at room temperature.\nSpecial Equipment\nDigital scale\n,\nbowl scraper\n,\nbaking steel or stone\n, 10-inch or 12-inch\ncast iron skillet\n,\nwire rack\nNotes\nFocaccia made with high-protein bread flour produces the best results, but all-purpose flour will work as well.\nMake-Ahead and Storage\nFocaccia is best enjoyed immediately, but leftover focaccia can be stored in a paper bag at room temperature for up to 2 days. Reheat in a 300°F (150°C) oven for about 10 minutes before serving.\nRead More\nEasy No-Knead Olive-Rosemary Focaccia With Pistachios Recipe\nEasy Roasted-Garlic Focaccia Recipe\nNo Knead Pizza Bianca Recipe\nItalian\nVegan Snacks & Appetizers\nVegetarian Snacks & Appetizers\nYeast Breads\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-focaccia.webp?"
}