{
  "url": "https://www.seriouseats.com/easy-hot-chocolate-recipe-8603082",
  "image_url": "https://www.seriouseats.com/thmb/kt4loSoZmKZMP7xtyCXTYtEF1uA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240301-SEA-EasyhotChocolate-hero-2f748ed0712e47be872efbcd3cb33024.jpg",
  "tags": [
    "Chocolate",
    "The Latest",
    "Drinks"
  ],
  "title": "Easy Hot Chocolate",
  "full_text": "Easy Hot Chocolate\nClose\nJump to recipe\nCook\n5 mins\nTotal\n5 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n2 cups (\n480\nml\n)\nwhole milk\n1/4 cup (\n36\ng\n)\nmalted milk powder\n, such as Horlicks (see notes)\nPinch\nkosher salt\n1 to 2\nounces\nfinely chopped\ndark chocolate\n(3 to 6 tablespoons; 30g to 60g), see notes\nGranulated sugar\n, to taste\nMini marshmallows\nor whipped cream (optional)\nDirections\nIn a small saucepan, bring milk to a simmer over medium heat. Whisk in malted milk powder until well combined. Stir in dark chocolate, whisking constantly, until chocolate is melted, and season with a pinch of salt. Taste and season with sugar if desired. Pour hot chocolate into mugs and top with mini marshmallows or whipped cream, if using. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nSmall saucepan\n,\nwhisk\nNotes\nFeel free to substitute with dairy-free milk of your choice or a combination of milks. I recommend oat milk, as its creaminess makes it the best alternative to whole cow’s milk. Keep in mind that even if you use a dairy-free alternative, this drink will still contain dairy as  Horlicks and similar malted milk products contain milk powder. If you’d like the hot chocolate a little richer, replace 1/4 cup of the whole milk with heavy cream.\nFor the best-tasting hot chocolate, I recommend using good quality dark chocolate between 64 and 70%, as that is the dominant flavor of the drink. My personal favorite is Valrhona Guanaja 70% dark chocolate, but Guittard is also a great option and more readily available at supermarkets. To help the chocolate melt evenly and quickly, break or chop it into smaller pieces.\nMake-Ahead and Storage\nHot chocolate is best enjoyed immediately.\nChocolate\nThe Latest\nDrinks"
}