{
  "url": "https://www.seriouseats.com/easy-chocolate-layer-cake-with-chocolate-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zhCR5mjBsFLHLhPRYOCmBaVNFG0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230803-SEA-ChocolateLayerBirthdayCake-RobbyLozano-020-0e4a8f7aaea3463fbff14d975b3c1363.jpg",
  "tags": [
    "Layer Cake",
    "Chocolate",
    "Cakes"
  ],
  "title": "Chocolate Birthday Layer Cake",
  "full_text": "Chocolate Birthday Layer Cake\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n45 mins\nCooling Time\n75 mins\nTotal\n2 hrs\nServes\n12\nto 14 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n1 1/2\ncups\nall-purpose flour\n(\n7\nounces\n;\n195\ng\n)\n1/2\ncup\ncocoa powder\n(\n1 1/2\nounces\n;\n42\ng\n), see notes\n1\nteaspoon\nbaking soda\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1 1/4\ncups\ngranulated sugar\n(\n8 3/4\nounces\n;\n250\ng\n)\n1 1/4\ncups\nsour cream\n(\n10\nounces\n;\n287\ng\n)\n2/3\ncup\n(\n160\nml\n)\nvegetable oil\n2\nlarge\neggs\n1\nteaspoon\nvanilla extract\n1\nteaspoon\ninstant espresso powder\nFor the Frosting:\n20\ntablespoons\nunsalted butter\n, softened (\n10\nounces\n;\n280\ng\n), see notes\n1\ncup\nconfectioners' sugar\n(\n4 1/4\nounces\n;\n120\ng\n)\n3/4\ncup\nplus\n1\ntablespoon\ncocoa powder\n(\n2 1/2\nounces\n;\n74\ng\n)\nPinch\nkosher\nsalt\n; for table salt, use half as much by volume\n2/3\ncup\n(\n160\nml\n)\nlight corn syrup\n1\nteaspoon\nvanilla extract\n10\nounces\n(\n280\ng\n)\nbittersweet chocolate\n, melted and cooled\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Line bottoms of two 9-inch cake pans with parchment paper and lightly coat the inside with nonstick cooking spray.\nSerious Eats / Robby Lozano\nIn a large bowl, sift flour, cocoa, baking soda, and salt, and whisk to combine; set aside. In a medium bowl, whisk sugar, sour cream, oil, eggs, vanilla, and espresso powder until smooth.\nSerious Eats / Robby Lozano\nWhisk wet ingredients into dry ingredients until smooth. Divide batter evenly between prepared pans and smooth cake tops with rubber spatula. Bake until cake is just firm and a toothpick inserted into center comes out with just a few moist crumbs attached, 22 to 25 minutes.\nSerious Eats / Robby Lozano\nLet cakes cool in pans for 15 minutes. Remove cakes from pans, discard parchment, and let cool completely on wire rack, about 1 hour.\nSerious Eats / Robby Lozano\nFor the Frosting:\nMeanwhile, in a food processor, process butter, confectioners' sugar, cocoa, and salt until combined and smooth, about 30 seconds, scraping down sides of bowl as necessary. Add corn syrup and vanilla and process until smooth, about 30 seconds, scraping down sides of bowl as necessary. Add chocolate and process until smooth and creamy, about 30 seconds. (See notes.)\nSerious Eats / Robby Lozano\nTo Assemble the Cake:\nPlace one cake, top side up, on a serving platter or cake pedestal. Using offset spatula, spread about 1 cup frosting over top of cake layer. Center second cake, bottom side up, on top, and press lightly to adhere. Spread remaining frosting evenly over top and sides of assembled cake. To decorate, use the back of a soup spoon to make decorative swirls on the cake or decorate as desired. Serve.\nSerious Eats / Robby Lozano\nSpecial Equipment\nTwo 9-inch\ncake pans\n, parchment paper,\nfood processor\nNotes\nBe sure to use natural cocoa; do not use Dutch-processed cocoa powder as it may affect the leavening of the cake.\n8-inch cake pans can be substituted for 9-inch cake pans. If using 8-inch cake pans, increase baking time to 25 to 30 minutes in Step 3. In Step 6, frost top of bottom cake layer with 3/4 cup frosting.\nDo not over-soften butter or the frosting will be too loose. The butter should yield lightly to the touch (about 60ºF or 16ºC).\nIf the chocolate is too warm, the frosting may be too loose. If the finished frosting is too soft, briefly refrigerate until it firms up to a spreadable consistency.\nMake-Ahead and Storage\nThe baked, cooled cakes can be wrapped in plastic wrap and frozen for up to 1 month. Thaw at room temperature before frosting and stacking.\nThe frosting comes together quickly, so we recommend making it right before assembling the cake.\nThe assembled cake can be covered and stored at room temperature for up to 2 days or refrigerated for up to 4 days. Bring to room temperature before serving.\nRead More\nChocolate Cherry Layer Cake Recipe\nHow to Crumb-Coat a Layer Cake\nThe Best Milk, Dark, and Extra-Dark Chocolate Bars for Baking\nLayer Cake\nChocolate\nCakes"
}