{
  "url": "https://www.seriouseats.com/easy-homemade-plum-jam-recipe",
  "image_url": "https://www.seriouseats.com/thmb/3y-u37GlUx725wdy3iGQLlSfyNQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__07__20150623-plum-jam-recipe-primary-02-60251910efcd43c08c23567461150e9d.jpg",
  "tags": [
    "Condiments & Sauces",
    "Gluten-free",
    "Jams & Jellies",
    "Stovetop Fruit",
    "Plum"
  ],
  "title": "Homemade Plum Jam",
  "full_text": "Homemade Plum Jam\nClose\nJump to recipe\nPrep\n15 mins\nCook\n80 mins\nActive\n90 mins\nMacerating Time\n8 hrs\nTotal\n9 hrs 35 mins\nServes\n96 servings\nMakes\n6 pints\nCook Mode\n(Keep screen awake)\nIngredients\n4\npounds\n(\n1.8\nkg\n)\npitted black\nor\nelephant heart\nplums\n, unpeeled, cut into quarters\n1 1/2\npounds\n(\n675\ng\n)\ngranulated sugar\n1\ntablespoon\nPomona's Universal\nPectin\n(optional; see note)\n4\nteaspoons\n(\n20\nml\n)\ncalcium water\n(optional; see Pomona's pectin package for instructions)\n2 1/2\nounces\nbottled lemon juice\n(\n5\ntablespoons\n;\n75\nml\n; see note)\n1\nteaspoon\n(\n5\ng\n)\nunsalted butter\nDirections\nCombine plums, sugar, and pectin (if using) in a large bowl and toss. Cover and refrigerate for at least 8 and up to 24 hours.\nSerious Eats / J. Kenji López-Alt\nPlace a few metal spoons in the freezer. Thoroughly wash 6 pint-sized canning jars and their lids. If you plan to process the jam for shelf-stable storage, prepare a water bath and sterilize the jars as described in our\ncanning guide\n. Transfer plum mixture to a large, wide pot and stir in calcium water. Cook over medium heat, stirring occasionally to prevent scorching. Simmer until plums are mostly softened, about 15 minutes. For a smoother jam, place a food mill over a bowl and ladle a few cups of the mixture into it. Mill the mixture into the bowl. Repeat until roughly half the plums have been milled, then stir the milled plums back into the pot.\nSerious Eats / J. Kenji López-Alt\nContinue to cook until mixture starts to foam. Scrape off and discard foam using a metal spoon. Stir in butter and bottled lemon juice (see notes). Continue to cook, stirring occasionally to prevent scorching, until foaming has subsided, about 15 minutes longer. Continue to cook, stirring more frequently, until jam is glossy, about 10 minutes longer.\nSerious Eats / J. Kenji López-Alt\nTo test for doneness, spoon a small amount of jam onto one of the frozen spoons and return to freezer for 5 minutes. Remove from freezer and check consistency. The jam is ready when it's spreadable, but not runny. Cook until this texture has been reached.\nSerious Eats / J. Kenji López-Alt\nTransfer jam into prepared canning jars and wipe any jam from the rims. To store in refrigerator, simply place lids on jars, screw on rings, and let cool completely at room temperature before refrigerating. To process jam for shelf-stable storage, bring water bath to a rolling boil. Place lids on jars and screw on rings until they are snug but not overly tight. Carefully lower jars into the boiling water bath and process for 10 minutes. Remove jars and let cool completely at room temperature. Unprocessed jam can be refrigerated for a couple of months; Processed jam can be stored in a cool, dark place for up to 1 year.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nLarge, wide pot\nor\nDutch oven\n;\nfood mill\n(optional); pint-sized\ncanning jars\n, lids, and rings; deep\nstockpot\nfor canning (optional); jar lifter (optional); canning funnel (optional)\nNotes\nUse Pomona's Universal Pectin if you want a stronger-setting jam. It's preferable to standard pectin in this case, as it works well even with relatively low-sugar jams, like this one.\nIf you do not plan on processing this jam for shelf-stable storage, omit the lemon juice for the best flavor.\nRead More\nA Beginner’s Guide to Canning\nFrom Jam to Jerky: Water Activity and the Science of Preservation\nCondiments & Sauces\nGluten-free\nJams & Jellies\nStovetop Fruit\nPlum",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-plum-jam.webp?"
}