{
  "url": "https://www.seriouseats.com/easy-oven-pulled-pork-recipe",
  "image_url": null,
  "tags": [
    "Braised & Stewed Pork",
    "Game Day"
  ],
  "title": "Easy Oven-Cooked Pulled Pork",
  "full_text": "Easy Oven-Cooked Pulled Pork\nJump to recipe\nPrep\n15 mins\nCook\n5 hrs 15 mins\nActive\n30 mins\nTotal\n5 hrs 30 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5 tablespoons\ndark brown sugar\n(2 1/4 ounces;\n65\ng\n)\n1 tablespoon (about\n9\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n1\ntablespoon\npaprika\n1\nteaspoon\nground cumin\n1\nteaspoon\nfreshly ground black pepper\n1\nteaspoon\nground coriander\n1/2\nteaspoon ground\nfennel seed\nLarge\npinch\ncayenne pepper\n1 whole bone-in or boneless\npork butt\n(\n5 to 7\npounds\n; 2.25 to 3kg)\n1 cup\nketchup\n(8 ounces; about\n225\ng\n)\n1/2 cup\ndark molasses\n(4 ounces; about\n115\ng\n)\n1/2\ncup\n(120ml)\ncider vinegar\n, divided\n2\ntablespoons\n(30ml)\nWorcestershire sauce\n1\ntablespoon\n(15ml) high-quality\nliquid smoke\n, such as Wright's (see Note)\n1\ntablespoon\n(15ml)\nbrown mustard\n2\nteaspoons\n(10ml)\nhot sauce\n1\ntablespoon\n(15ml)\nvegetable oil\n1 large\nonion\n, finely minced (about 6 ounces;\n170\ng\n)\n1\ncup\n(240ml)\nbourbon\n1/2\ncup\n(120ml)\nhomemade\nor store-bought\nlow-sodium chicken stock\nor water\nDirections\nAdjust oven rack to lower position and preheat oven to 300°F (150°C). Combine sugar, salt, paprika, cumin, black pepper, coriander, ground fennel seed, and cayenne pepper in a small bowl and mix. Season pork with 2 to 3 tablespoons spice mixture, making sure to rub it on all sides. Reserve remaining spice mixture.\nWhisk together ketchup, molasses, half of cider vinegar, Worcestershire sauce, liquid smoke, mustard, and hot sauce in a medium bowl. Whisk in remaining spice mixture. Set aside.\nHeat oil in a Dutch oven over medium-high heat until shimmering. Add pork and cook, turning occasionally, until well browned on all sides, about 5 minutes total. (Pork will brown fast because of the sugar. Do not let it burn.) Add onion and cook, stirring and scraping up browned bits from the bottom of the pan, until softened, about 2 minutes.\nSerious Eats / J. Kenji López-Alt\nTurn off burner and add bourbon. Relight burner. Carefully ignite the bourbon with a long match or lighter. (Stand back and make sure there is nothing flammable above it; it will produce tall flames.) Let cook until flames die out, about 2 minutes.\nSerious Eats / J. Kenji López-Alt\nMake sure pork is oriented fat side up. Add half of sauce and chicken stock or water. Cover Dutch oven, transfer to oven, and cook until pork is just starting to turn tender, about 4 hours. Remove lid and continue cooking until a knife or fork shows very little resistance when twisted inside the meat and a dark bark has formed, about 1 hour longer.\nSerious Eats / J. Kenji López-Alt\nTransfer pork to a large bowl, reserving liquid in pot. Using a ladle, skim off excess fat and discard. Add reserved sauce and remaining vinegar to pot and whisk to combine. When pork is cool enough to handle, shred with two forks.\nSerious Eats / J. Kenji López-Alt\nTransfer shredded pork to pot and toss with sauce. (If making ahead to serve over the course of several meals, store pork and sauce separately, adding sauce only to the portion you are serving immediately.) Season to taste with more salt, sugar, liquid smoke, or cider vinegar. Serve.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nDutch oven\nNotes\nUse a high-quality liquid smoke, with no ingredients other than water and smoke. Avoid brands with molasses or vinegar, as these can affect flavor. For a stronger smoke flavor, combine 2 tablespoons (30ml) liquid smoke and 3/4 cup kosher salt (7 1/2 ounces; 210g) with 1 gallon (3.75L) cold water. Submerge uncooked pork and let rest in refrigerator for at least 1 hour and up to 8.\nBraised & Stewed Pork\nGame Day"
}