{
  "url": "https://www.seriouseats.com/easy-pan-roasted-chicken-breast-bourbon-mustard-pan-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/qh-5DyB03byGz4Tz65PVuRJJe2M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150413-chicken-mustard-bourbon-pan-sauce-recipe-4-9cf034a8536242bdbd1a97e78fef1226.jpg",
  "tags": [
    "Chicken Mains",
    "Roasted Chicken",
    "Chicken Breast"
  ],
  "title": "Easy Pan-Roasted Chicken Breasts With Bourbon-Mustard Pan Sauce Recipe",
  "full_text": "Easy Pan-Roasted Chicken Breasts With Bourbon-Mustard Pan Sauce Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n20 mins\nTotal\n30 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole\nairline chicken breasts\nor\nboneless skin-on chicken breasts\n(\n6 to 8 ounces each\n)\nKosher salt\nand freshly ground black pepper\n1\ntablespoon\ncanola oil\n3/4\ncup\nhomemade\nor store-bought\nlow sodium chicken stock\n1 1/2\nteaspoons\npowdered gelatin\n1\nsmall\nshallot\n, minced (about 1 tablespoon)\n1/4\ncup\nbourbon\n2\ntablespoons\nwhole grain mustard\n2\ntablespoons\nunsalted butter\n2\nteaspoons\nsoy sauce\n1\nteaspoon\nfresh juice from 1 lemon\n1\ntablespoon minced\nfresh parsley leaves\nDirections\nAdjust oven rack to center position and preheat oven to 450°F. Pat chicken breasts dry and season generously with salt and pepper. Heat oil in an oven-safe medium stainless steel skillet over high heat until just starting to smoke. Carefully lay chicken breasts into hot skillet skin side down. Cook without moving until skin is deep golden brown and very crisp, about 6 minutes. Carefully flip chicken breasts and transfer skillet to the oven.\nWhile chicken roasts, add stock to a liquid measuring cup and sprinkle gelatin over the top. Set aside.\nCook chicken until an instant-read thermometer inserted into the thickest part of the chicken breasts registers 150°F, about 7 to 12 minutes. Remove skillet from oven and transfer chicken to a cutting board. Set aside to rest while you make the pan sauce.\nPour off all but 1 tablespoon of fat from the skillet and place over high heat. Add shallots and cook, stirring, until softened and fragrant, about 30 seconds. Add bourbon and cook,scraping up any browned bits from the bottom of the pan with a wooden spoon, until reduced by half, about 1 minute. Add the mustard and the stock/gelatin mixture and cook on high heat until sauce is reduced by about two-thirds, 5 to 8 minutes. Stir in butter, soy sauce, and lemon juice and cook at a hard boil until emulsified, about 30 seconds. Remove from heat and set aside.\nSlice chicken breasts into three pieces on a sharp bias and transfer to individual serving plates. Stir parsley into the pan sauce. Taste sauce and season with salt and pepper. Spoon sauce over the chicken and serve immediately.\nSpecial equipment\nOven-safe 10-inch skillet\nThis Recipe Appears In\nHow to Make Easy Pan-Roasted Chicken Breasts With Bourbon-Mustard Pan Sauce\nChicken Mains\nRoasted Chicken\nChicken Breast",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-pan-roasted-chicken-breasts-with-bourbon-mustard-pan-sauce-recipe.webp?"
}