{
  "url": "https://www.seriouseats.com/easy-no-knead-olive-rosemary-pistachio-focaccia-kenji-recipe",
  "image_url": "https://www.seriouseats.com/thmb/GhALdpVUviSPY292Q50K-e08BGs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/easy-no-knead-olive-rosemary-pistachio-focaccia-kenji-recipe-hero-01-93a68d62a0684c2994f68ab19bd25b8b.jpg",
  "tags": [
    "Italian",
    "Vegan Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Yeast Breads"
  ],
  "title": "Easy No-Knead Olive-Rosemary Focaccia With Pistachios",
  "full_text": "Easy No-Knead Olive-Rosemary Focaccia With Pistachios\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n15 mins\nProofing Time\n10 hrs\nTotal\n10 hrs 40 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n500\ngrams\n(17 1/2 ounces, about 3 1/4 cups) all-purpose or\nbread flour\n15\ngrams\n(.5 ounces, about 1 tablespoon)\nkosher salt\n4\ngrams\n(.15 ounces, about 1 teaspoon)\ninstant yeast\n325\ngrams\n(11 1/2 ounces, about 1 1/2 cups minus 1 tablespoon)\nwater\n1/4\ncup\nextra-virgin olive oil\n, divided\n4\nounces\npitted green olives\n, sliced\n1/4\ncup\nroasted pistachios\n, roughly chopped or lightly pounded in a mortar and pestle\n2\ntablespoons\nfresh rosemary leaves\n, very roughly chopped\nCoarse sea salt\nDirections\nCombine flour, salt, yeast, and water in a large bowl. Mix with hands or a wooden spoon until no dry flour remains. The bowl should be at least 4 to 6 times the volume of the dough to account for rising.\nSerious Eats / Eric Kleinberg\nCover bowl tightly with plastic wrap, making sure that edges are well-sealed, then let rest on the countertop for at least 8 hours and up to 24 hours. Dough should rise dramatically and fill bowl.\nSerious Eats / Eric Kleinberg\nSprinkle the top of the dough lightly with flour, then transfer it to a lightly-floured work surface. Form into a ball by holding it with well-floured hands and tucking the dough underneath itself, rotating it until it forms a tight ball.\nSerious Eats / Eric Kleinberg\nPour half of oil in the bottom of a 12-inch cast iron skillet or large cake pan. Transfer dough to pan, turn to coat in oil, and position seam-side-down. Using a flat palm, press the dough around the skillet, flattening it slightly and spreading oil around the entire bottom and edges of the pan. Cover tightly with plastic wrap and let the dough stand at room temperature for 2 hours. After the first hour, adjust an oven rack to the middle position and preheat oven to 550°F.\nSerious Eats / Eric Kleinberg\nAt the end of the 2 hours, dough should mostly fill the skillet up to the edge. Use your fingertips to press it around until it fills every corner, popping any large bubbles that appear. Lift up one edge of the dough to let any air bubbles underneath escape and repeat, moving around the dough until there are no air bubbles left underneath and the dough is evenly spread around the skillet. Spread olives and pistachios all over the surface of the dough and press down on them with your fingertips to embed slightly. Drizzle with remaining olive oil. Sprinkle with rosemary and coarse salt.\nSerious Eats / Eric Kleinberg\nTransfer skillet to oven and bake until top is golden brown and bubbly and bottom is golden brown and crisp when you lift it with a thin spatula, 16 to 24 minutes. Using a thin spatula, loosen focaccia and peek underneath. If bottom is not as crisp as desired, place pan on a burner and cook over medium heat, moving the pan around to cook evenly until it is crisp, 1 to 3 minutes. Transfer to a cutting board, allow to cool slightly, slice, and serve. Extra bread should be stored in a brown paper bag at room temperature for up to 2 days. Reheat in a 300°F oven for about 10 minutes before serving.\nSerious Eats / Eric Kleinberg\nSpecial Equipment\n12-inch cast iron skillet\nItalian\nVegan Snacks & Appetizers\nVegetarian Snacks & Appetizers\nYeast Breads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-no-knead-olive-rosemary-focaccia-with-pistachios.webp?"
}