{
  "url": "https://www.seriouseats.com/easy-banana-bread-recipe-8648918",
  "image_url": "https://www.seriouseats.com/thmb/32_heNJkpbJKTSI4dHHBuqmLHT0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240515-BananaBread-AmandaSuarez-hero-1feacf17720b499d96c425adcb010a5e.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Quick Breads",
    "Banana",
    "Muffins"
  ],
  "title": "Easy Banana Bread",
  "full_text": "Easy Banana Bread\nClose\nJump to recipe\nPrep\n5 mins\nCook\n80 mins\nCooling Time\n60 mins\nTotal\n2 hrs 25 mins\nServes\n10\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4 cup (7.875 ounces;\n225\ng\n)\nall-purpose flour\n1\nteaspoon\nDiamond Crystal\nkosher salt;\nif using table salt use half as much by volume\n3/4\nteaspoon\nbaking soda\n1/4\nteaspoon\nbaking powder\n6\nvery\nripe\n(lightly speckled to heavily speckled)\nbananas\n, peeled (2 left whole, 4 halved crosswise and halved lengthwise)\n8\ntablespoons\nunsalted butter, divided\n1 cup packed (7 ounces;\n198\ng)\nlight\nbrown sugar\n2\nlarge\neggs, lightly beaten\n1\nteaspoon\nvanilla extract\n1/2 cup\n(100\ng)\nwalnuts\n, toasted, optional\n1/2 cup (\n60\ng\n) packed\nsweetened shredded coconut\n, toasted (optional, see notes)\n1/2 cup (\n85\ng)\nchocolate chips,\noptional\nDirections\nAdjust oven rack to middle position and heat oven to 350℉(175℃). Spray bottom and sides of a 9-by-5-­inch metal loaf pan with vegetable oil spray.\nIn a medium bowl, whisk the flour, salt, baking soda, and baking powder until combined; set aside. In a large bowl, use a potato masher to mash the 2 whole bananas until fairly smooth; set aside.\nIn a 10-inch nonstick or cast iron skillet, heat 2 tablespoons butter over medium-high heat until melted. Add banana slices flat side down and cook until glossy, golden brown, and softened, flipping slices as needed, 4 to 6 minutes. Transfer to a bowl.\nIn the now-empty skillet, add the remaining butter and cook over medium-high heat, stirring and swirling skillet constantly with rubber spatula, until butter is light golden brown and has a nutty aroma, 2 to 4 minutes. Return the browned bananas to the skillet and continue to cook, stirring and flipping the banana mixture frequently until the bananas are mostly broken down and the mixture turns dark golden brown and has a deep caramelized nutty banana aroma, 6 to 8 minutes. Off heat stir in the brown sugar, return to heat and cook, stirring frequently, until sugar is fully dissolved and the syrupy mixture gently bubbles, about 1 minute. Transfer the banana mixture to a large bowl with the mashed fresh bananas. Let sit until cooled slightly, for 10 minutes.\nUsing a potato masher, mash the banana mixture until mostly smooth. Whisk in egg and vanilla until combined. Using a spatula, stir in flour mixture until just combined. Fold in walnuts, coconut and/or chocolate chips, if using. Use a rubber spatula to scrape the batter into greased loaf pan and smooth top.\nBake until banana bread is golden brown and a toothpick or paring knife inserted in center comes out clean, 50 to 60 minutes. Transfer banana bread to a wire rack and cool in the pan for 15 minutes.\nUse oven mitts to carefully turn the loaf pan on its side and remove banana bread from the pan. Let banana bread continue to cool on the cooling rack for at least 1 hour. Transfer to cutting board, slice, and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9-by-5-­inch metal loaf pan, 10-inch nonstick or cast iron skillet, potato masher or large fork\nNotes\nTo toast the coconut flakes (if using): Spread coconut in an even layer on a parchment paper lined rimmed baking sheet and bake on the middle rack of the oven at 350℉(175℃), stirring every 5 minutes, until the shreds are a mix of golden brown and white, about 15 minutes. Let cool on the baking sheet before transferring to a bowl or airtight container.\nMake-Ahead and Storage\nThe cooled loaf can be covered tightly with plastic wrap or stored in an airtight container at room temperature for up to 4 days or frozen for up to 2 months.\nBreakfast & Brunch\nThe Latest\nQuick Breads\nBanana\nMuffins"
}