{
  "url": "https://www.seriouseats.com/easy-weeknight-meatballs-8734289",
  "image_url": "https://www.seriouseats.com/thmb/SCLoMC6nCu4gRiioW_pnySMhqT4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241025-EasyWeeknight-Meatballs-AmandaSuarez-hero-41a9565968bf41a9a464b8800073e16b.jpg",
  "tags": [
    "Meatballs",
    "The Latest"
  ],
  "title": "Easy Weeknight Meatballs",
  "full_text": "Easy Weeknight Meatballs\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nTotal\n60 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\nounces\n(75g) fresh, crustless\nwhite bread\n, diced (about 2 unpacked cups)\n1/2\ncup\n(120ml)\nwhole milk\n1 small (6-ounce) yellow onion, finely diced, or\n1\nteaspoon\nonion powder\n6 medium cloves garlic, minced, or\n1/2\nteaspoon\ngranulated garlic\n1 1/2\nounces\n(45g) finely grated\nParmigiano-Reggiano\n, plus more for serving\n3\nlarge\negg yolks\n1/3\ncup\nloosely packed flat-leaf\nparsley\nleaves and tender stems (3/4 ounce; 20g), minced\n2\nteaspoons\n(8g) Diamond Crystal kosher\nsalt\n; for table salt, use half as much by volume or the same weight\n1/2\nteaspoon\nfreshly\nground black pepper\n1\nteaspoon\ndried oregano\n3/4\nteaspoon\nground\nfennel seed\n1 1/2\npounds\n(680g)\nground meat\n(either all pork, 1 pound pork and 1/2 pound beef, or 1/2 pound each pork, beef, and veal; see notes)\n1\nrecipe\nQuick and Easy\nItalian-American Tomato Sauce\n(or your preferred sauce), warmed through\nDirections\nPreheat broiler and set oven rack about 4 inches from broiler element; line a rimmed baking sheet with parchment or foil. In a large mixing bowl, combine bread with milk, tossing to coat. Let stand, tossing occasionally, until bread is completely moist, about 10 minutes. Squeeze bread between your fingers or mash with a spoon to make sure there are no dry spots.\nSerious Eats / Amanda Suarez\nAdd onion, garlic, Parmigiano-Reggiano, egg yolks, parsley, salt, pepper, oregano, and fennel to bread mixture and, using a clean hand or spoon, stir until very thoroughly incorporated. Add ground meat and, using your hand, continue mixing vigorously, squishing meat and seasonings between your fingers, until very thoroughly combined and meat has taken on a slightly sticky texture.\nSerious Eats / Amanda Suarez\nUsing your hands, roll meatballs to your desired size and arrange, evenly spaced, on prepared baking sheet.\nSerious Eats / Amanda Suarez\nTransfer to broiler and cook until browned on top, about 10 minutes (broiling time will vary greatly depending on the strength of your broiler, so keep a close eye). Using tongs, rotate meatballs and broil until well browned on second side.\nSerious Eats / Amanda Suarez\nIn a large sauté pan or pot, combine meatballs and any accumulated juices with tomato sauce and bring to a simmer over medium heat. Cook, spooning sauce over meatballs and rotating meatballs occasionally, until meatballs are fully cooked through and register about 145°F (63°C) on an instant-read thermometer, 5 to 10 minutes. Serve, sprinkling additional grated cheese on each plate.\nSerious Eats / Amanda Suarez\nNotes\nTry to get fattier ground meat, if possible; around 25% fat is a good rough percentage. This amount of fat will make for juicier and more flavorful meatballs than lean ground meat will.\nMeatballs\nThe Latest"
}