{
  "url": "https://www.seriouseats.com/easy-italian-amercian-red-sauce-recipe",
  "image_url": null,
  "tags": [
    "Tomato Sauces",
    "Italian-American",
    "Quick Dinners"
  ],
  "title": "Quick and Easy Italian-American Red Sauce in 40 Minutes or Less",
  "full_text": "Quick and Easy Italian-American Red Sauce in 40 Minutes or Less\nJump to recipe\nCook\n40 mins\nActive\n25 mins\nTotal\n40 mins\nServes\n6\nto 8 servings\nMakes\n5 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n4\ncloves\ngarlic\n, crushed\nGenerous\npinch\nred pepper flakes\n1\nteaspoon\n(\n2\ng\n)\ndried oregano\n3\ntablespoons\n(\n50\ng\n)\ntomato paste\n2\n(\n28\n-\nounce\n)\ncans\nwhole peeled tomatoes\n1\nlarge sprig\nbasil\nKosher salt\n2\ntablespoons\n(\n1\nounce\n, or\n28\ng\n)\nunsalted butter\n(optional)\nDirections\nIn a large pot, combine oil and garlic, and heat over moderately low heat until garlic begins to very gently sizzle. Add red pepper flakes and cook, stirring, until garlic just begins to turn a light golden color, about 3 minutes. Add oregano and continue to cook, stirring, for 1 minute.\nSerious Eats / Vicky Wasik\nAdd tomato paste and cook, stirring, until paste has softened and blended with oil, about 3 minutes.\nSerious Eats / Vicky Wasik\nStir in canned tomatoes and their juices, increase heat to medium-high, bring to a gentle simmer, then lower heat to maintain. Using an immersion blender, blend tomatoes until sauce is smooth. (Alternatively, use potato masher to crush tomatoes or crush tomatoes by hand before adding to pot.)\nSerious Eats / Vicky Wasik\nAdd basil and simmer, stirring occasionally, until sauce is reduced slightly and tastes rich, about 30 minutes. Season with salt.\nSerious Eats / Vicky Wasik\nDiscard basil. Stir in butter, if using, until melted. Use sauce right away, or allow to cool to room temperature, transfer to sealed containers and refrigerate for up to 5 days or freeze for up to 6 months.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nImmersion blender\n(see notes)\nNotes\nIf you prefer a more rustic, chunky texture, or if you don't have an immersion blender, you can hand-crush the whole tomatoes with their juices before adding them to the pot, or use a potato masher to smash them in the pot; just keep in mind that will also leave chunks of crushed garlic in the sauce.\nRead More\nThe Right Way to Sauce Pasta\nThe Best Fresh Tomato Sauce\nPressure-Cooker Tomato Sauce\nTomato Sauces\nItalian-American\nQuick Dinners"
}