{
  "url": "https://www.seriouseats.com/easy-weeknight-garlic-bread-recipe-8641247",
  "image_url": "https://www.seriouseats.com/thmb/pSd1iTpfW5w4mo5zufEf4O1qP20=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240430-GarlicBread-AmandaSuarez-hero-a9528a3c797b4b2b9234c4c11400994d.jpg",
  "tags": [
    "Sides",
    "The Latest",
    "Bread",
    "Italian-American",
    "Garlic"
  ],
  "title": "Easy Weeknight Garlic Bread",
  "full_text": "Easy Weeknight Garlic Bread\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nTotal\n15 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\nteaspoon\ngarlic powder\n1\ntablespoon\nwater\n6 tablespoons\nunsalted butter\n(\n85\ng\n), cut into 1/4-inch pieces and softened\n6 medium\ngarlic cloves\n(\n30\ng\n), minced to a paste\n1/2\nteaspoon\nKosher salt\n1/8\nteaspoon\npaprika, optional\n1/8\nteaspoon\nground\ncayenne pepper\n, optional\n2 tablespoons (\n30\nml\n)\nextra-virgin olive oil\nOne\nroughly 1-\npound\nloaf soft Italian or\nFrench bread\nabout 12 inches long, halved horizontally (see notes)\nDirections\nAdjust oven rack to lower-middle position and heat oven to 425℉(220℃). In a medium bowl, combine garlic powder and water; set aside.\nSerious Eats / Amanda Suarez\nPlace half of the butter and all of the minced garlic, salt, paprika, and cayenne, if using, in a small bowl and microwave, covered, until butter is melted, and mixture is bubbling around to edges, 60 to 90 seconds, stopping and stirring every 30 seconds.\nSerious Eats / Amanda Suarez\nTransfer melted butter mixture to the bowl with garlic powder mixture, add the remaining half of the butter, and stir with a small spoon until homogeneous loose paste forms. Whisk in the olive oil. (If the mixture melts completely, set aside and let it solidify slightly before using.)\nSerious Eats / Amanda Suarez\nSpread cut sides of bread evenly with garlic-butter paste. Transfer bread, cut sides up, to a rimmed baking sheet. Bake until the butter mixture has melted and seeped into the bread, and edges are beginning to brown, about 5 minutes. Remove sheet from oven. Flip bread so the cut sides are down, and gently press into the baking sheet. Return to oven, and continue to bake until the cut bottom sides are light golden brown and crisp, 5 to 10 minutes longer. Use a thin spatula to gently flip, then transfer bread to a cutting board. Using a serrated knife, slice and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheet\nNotes\nA roughly 12 by 5-inch loaf of Italian bread, with has a soft, thin crust and fine crumb, works well here.\nSides\nThe Latest\nBread\nItalian-American\nGarlic"
}