{
  "url": "https://www.seriouseats.com/easy-pan-seared-chicken-breast-white-wine-fines-herbes-pan-sauce-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8RjcMtBZk3QC8NqFGD3ShgtnSiU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150406-chicken-white-wine-shallot-pan-sauce-recipe-25-b3127699204e4e9ea84bf5c6b29488b6.jpg",
  "tags": [
    "Chicken Breast",
    "French",
    "Gluten-free Mains",
    "Stovetop Chicken",
    "Chicken Mains"
  ],
  "title": "Easy Pan-Roasted Chicken Breasts With White Wine and Fines Herbes Pan Sauce Recipe",
  "full_text": "Easy Pan-Roasted Chicken Breasts With White Wine and Fines Herbes Pan Sauce Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n20 mins\nTotal\n30 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 whole\nairline chicken breasts\nor\nboneless skin-on chicken breasts\n(\n6 to 8\nounces\neach)\nDiamond Crystal\nkosher salt\n(see notes) and freshly ground black pepper\n1\ntablespoon\ncanola oil\n1/2\ncup\ndry white wine\n1/2\ncup\nhomemade\nor store-bought\nlow-sodium chicken stock\n1 1/2\nteaspoons\npowdered gelatin\n1\nsmall\nshallot\n, minced (about 1 tablespoon)\n1\nmedium\nclove garlic\n, minced (about 1 teaspoon)\n2\ntablespoons\nunsalted butter\n2\nteaspoons\nsoy sauce\n1\ntablespoon minced\nfresh chives\n1\ntablespoon minced\nfresh parsley leaves\n1\ntablespoon\nminced\nfresh tarragon leaves\n1\ntablespoon\nminced fresh\nchervil\n(optional)\nDirections\nAdjust oven rack to center position and preheat oven to 450°F. Pat chicken breasts dry and season generously with salt and pepper. Heat oil in an oven-safe medium stainless steel skillet over high heat until just starting to smoke. Carefully lay chicken breasts into hot skillet skin side down. Cook without moving until skin is deep golden brown and very crisp, about 6 minutes. Carefully flip chicken breasts and transfer skillet to the oven.\nWhile chicken roasts, combine wine and stock in a liquid measuring cup and sprinkle gelatin over the top. Set aside.\nCook chicken until an instant-read thermometer inserted into the thickest part of the chicken breasts registers 150°F, about 7 to 12 minutes. Remove skillet from oven and transfer chicken to a cutting board. Set aside to rest while you make the pan sauce.\nPour off all but 1 tablespoon of fat from the skillet and place over high heat. Add shallots and garlic and cook, stirring, until softened and fragrant, about 30 seconds. Add wine/stock mixture and cook, scraping up any browned bits from the bottom of the pan with a wooden spoon. Continue cooking on high heat until sauce is reduced by about two-thirds, 5 to 8 minutes. Stir in butter and soy sauce and cook at a hard boil until emulsified, about 30 seconds. Remove from heat and set aside.\nSlice chicken breasts into three pieces on a sharp bias and transfer to individual serving plates. Stir herbs into the pan sauce. Taste sauce and season with salt and pepper. Spoon sauce over the chicken and serve immediately.\nSpecial Equipment\nOven-safe 10-inch skillet\nNotes\nIf using a different brand or type of salt, be sure to use the weight measurement, not the volume measurement.\nRead More\nJust Add Water: How to Make a Pan Sauce, and How to Fix a Broken One\nChicken Breast\nFrench\nGluten-free Mains\nStovetop Chicken\nChicken Mains"
}