{
  "url": "https://www.seriouseats.com/easy-kale-quiche",
  "image_url": "https://www.seriouseats.com/thmb/nmGk0PaExO5jK2Xc2mU0U6DOuKA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120312-kale-quiche-pie-846b36c9876e4b8790d7daedbac8e190.jpg",
  "tags": [
    "Savory"
  ],
  "title": "Easy Kale Quiche",
  "full_text": "Easy Kale Quiche\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n20 mins\nTotal\n60 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 large bunch (about\n1 1/2\npounds\n)\nkale\n, thick stalks discarded, leaves roughly chopped\nKosher salt\nand freshly ground black pepper\n1 1/2\ncups\nhalf-and-half\n2\nwhole eggs\n4\nounces\ngrated gruyère or\nComté cheese\n1/8\nteaspoon\nfreshly grated nutmeg\n2\nslices\nhigh-quality sandwich\nbread\nor rustic country bread, crusts removed\n2\ntablespoons\nbutter\nDirections\nAdjust oven rack to center position and preheat oven to 350°F (180°C). Bring a large pot of salted water to a boil over high heat. Add kale and press down with a metal fine-mesh strainer to submerge. Cook until barely tender but still bright green, about 3 minutes. Transfer kale to a colander and run under cold water until chilled. Squeeze out excess moisture then transfer kale to the center of a clean dish towel. Roll up towel to encase the kale, then twist the ends to wring out excess moisture. Transfer dried kale to a cutting board and chop into 1- to 1/2-inch pieces. Season to taste with salt and pepper.\nCombine half-and-half and eggs in a large bowl and whisk until homogenous. Season with 1 teaspoon salt and a pinch of black pepper. Add kale, cheese, and nutmeg and mix with hands to combine.\nPlace bread in the bowl of a food processor and pulse until fine crumbs are achieved. Grease a 9-inch deep-dish pie plate or a cast iron skillet with butter. Add bread crumbs and rotate plate while shaking to coat bottom and sides. Discard extra crumbs. Pour kale filling into prepared pie plate.\nPlace pie plate on a rimmed baking sheet and bake until center is just barely set but still jiggles when touched, about 35 minutes. Remove from oven and allow to cool at least 15 minutes before serving. Quiche can be served warm, at room temperature, or straight out of the fridge.\nSpecial Equipment\nFood processor\n, 9-inch deep-dish\npie plate\nor\ncast iron skillet\n,\nrimmed baking sheet\nNotes\nIf you have the time and inclination, you could make a true pie crust and par bake it in the shell, using this\ngreat, foolproof recipe\n.\nSavory",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-kale-quiche.webp?"
}