{
  "url": "https://www.seriouseats.com/ebichiri-japanese-shrimp-chile-sauce-recipe-5218073",
  "image_url": "https://www.seriouseats.com/thmb/nhZ2FEHslcWG457SFlvATlBbIuY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220511-Ebichiri-Amanda-Suarez-_14-93996e7cc3e54a8682f6212a5c7eb506.JPG",
  "tags": [
    "Condiments & Sauces",
    "Shrimp",
    "The Latest",
    "Japanese"
  ],
  "title": "Ebi no Chiri-Sōsu (Japanese Shrimp in Chile Sauce) Recipe",
  "full_text": "Ebi no Chiri-Sōsu (Japanese Shrimp in Chile Sauce) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 tablespoons (3/4 ounce;\n20\ng\n) plus 1 teaspoon (\n3\ng\n) unmodified\npotato starch\n, divided\n14\nounces\nextra large shrimp\n(about 12 to 15 shrimp; 400g), peeled, deveined\n1/4\nteaspoon\nbaking soda\n1\nlarge\negg white\n(1 ounce; 30g)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n, plus more if needed; for table salt, use half as much by volume\n8 1/2\nounces\n(250ml)\nvegetable oil\n, for frying\nOne 1/3-inch knob\nfresh ginger\n(\n1/4\nounce\n; 8g), peeled and minced\n2\nmedium\ngarlic cloves\n, minced\n1\ntablespoon\n(15g) Sichuan-style chile bean paste, such as Chinese\ndoubanjiang\nor Japanese tobanjan (see note)\n3/4\ncup\n(175ml)\nhomemade\nor\nstore-bought chicken stock\nor water\n1/4\ncup\n(2 ounces; 60g)\nketchup\n2\nteaspoons\nsugar\n, plus more if needed\n2\nteaspoons\nrice vinegar\n, plus more if needed\n1\ntablespoon\n(15ml)\nsake\n1\nnegi\n(Welsh onion) or 1/2 small leek (2 ounces;\n55\ng\n), white part only, rinsed well and minced (see note)\nDirections\nIn a small bowl, whisk together 1 teaspoon potato starch with 1/4 cup (60ml) cold water until well combined; set aside.\nSerious Eats / Vicky Wasik\nRinse the shrimp under cold running water, massaging the shrimp with your hands, for 1 minute. In a medium bowl, combine the rinsed shrimp, baking soda, egg white, and salt. Add remaining 2 tablespoons potato starch and, using a spoon or clean hands, toss to coat shrimp.\nSerious Eats / Vicky Wasik\nPlace a wire rack over a rimmed baking sheet. In a carbon-steel wok or 10-inch carbon steel or stainless-steel skillet, heat oil over high heat to 330°F (165°C). Add shrimp, discarding any excess marinade and dropping from as close to the oil’s surface as possible to minimize splashing, and fry, stirring and turning occasionally, until cooked through, about 2 minutes. (Potato starch will not brown significantly like wheat flour would, so the cooked shrimp will still appear quite pale.) Using a spider or slotted spoon, transfer shrimp to prepared baking sheet. Carefully ladle oil through a fine-mesh strainer set over a medium heatproof bowl.\nSerious Eats / Vicky Wasik\nReturn 2 tablespoons (30ml) oil to now-empty wok and return the wok to high heat (allow remaining oil to fully cool before storing). Add ginger and garlic and cook, stirring constantly, until softened but not browned, about 10 seconds. Add chile-bean paste and cook, stirring, until fragrant, about 30 seconds. Stir in chicken stock, ketchup, sugar, vinegar, sake, and negi (or leek). Bring to a boil, then reduce heat to a simmer and cook, stirring, until negi (leek) is softened and tender, about 2 minutes. Adjust seasoning to taste with sugar, vinegar, or salt as required.\nSerious Eats / Amanda Suarez\nAdd reserved shrimp and toss to coat. Stir in potato starch slurry, a teaspoon or two at a time, until sauce thickens enough to coat the shrimp in a glaze; discard any remaining potato starch-water mixture or reserve for another use. If sauce over-thickens and becomes gloppy, loosen by stirring in water 1 tablespoon at a time.\nSerious Eats / Amanda Suarez\nTransfer to a plate and serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n14-inch wok\nor\n10-inch carbon steel\nor\nstainless-steel skillet\n, spider or slotted spoon\nNotes\nTobanjan, the versions of Sichuanese doubanjiang available in Japan, tends to be sweeter and less spicy than Chinese originals. For this recipe, I prefer to use Sichuan Pixian doubanjiang, but most Japanese, whether at home or in restaurants, will use the local Japanese varieties. Varieties from Pixian are often chunky in texture with the broad beans and erjingtiao chiles left whole, so you may need to chop them into a paste by hand before using. You may need to adjust the amount of sugar used depending on the type of paste used.\nNegi, also known as a Welsh onion, is basically a giant scallion with a higher ratio of white part to green shoot; it can be found at Asian markets.\nThe common technique used when thickening sauces with a starch mixture is to add the starch in 3 additions, using your judgement to adjust the amount added each time. This is to avoid too much starch being added too quickly, which will produce a gloopy sauce.\nCondiments & Sauces\nShrimp\nThe Latest\nJapanese\nThe Wok\nWhy The Wok?\nEssays & Profiles\nWok Recipes\nWok Skills 101\nWok Skills 102\nThe Wok Gear Guide\nThe Importance of the Wok\nQ&A: Grace Young & Her Woks\nFrom China: The Future of the Wok\nSan Francisco's Iconic Wok Shop\nExcerpt: The Science of Woks\nDim Sum–Style Steamed Pork Ribs\nTofu With Peas and Silky Egg\nSichuan Stir-Fried Potatoes\nChinese Scrambled Eggs With Tomato\nTaiwanese Deep-Fried Squid Balls\nThai Chicken and Curry Stir-Fry\nJapanese Shrimp in Chili Sauce\nStir-Frying\nDeep-Frying\nBraising\nSteaming\nSmoking\nPassing-Through\nEssential Knife Skills for Wok Cooking\nSetting Up a Wok Cooking Station\nHow to Season Your Wok\nHacking Wok Hei at Home\nBest Flat-Bottomed Woks\nThe Best Torches for Wok Hei\nThe Full Wok Accessory Guide\nOutdoor Wok Burners Picks"
}