{
  "url": "https://www.seriouseats.com/eclair-cake-recipe-8567796",
  "image_url": "https://www.seriouseats.com/thmb/i8i5JO2hUJI48_a6lIznrzW-gyY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240213-SEA-EclairParisBrest-JenCausey-02-d05fa5d4a3aa4a04a3f8f059a60b40c5.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Chocolate",
    "Cakes",
    "Pastries"
  ],
  "title": "Eclair Cake",
  "full_text": "Eclair Cake\nClose\nJump to recipe\nPrep\n35 mins\nCook\n5 mins\nChilling Time\n3 hrs\nTotal\n3 hrs 40 mins\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Easy Éclair Cake\n24 graham cracker sheets (14 ounces; 379g)1/4 cup powdered sugar (1 ounce; 28g)\n1 teaspoon (15ml) vanilla extract\n2 1/2 cups (600ml) heavy whipping cream, divided\n1 recipe\nPastry Cream\n, at room temperature, about 68°F (20°C)\n1 1/2 cups chopped 56% semi-sweet chocolate (8 ounces; 226g)\n1 tablespoon unsalted butter (1/2 ounce; 14g)\nFor the Éclair Paris-Brest\nFor the Choux Pastry:\n1 recipe\nChoux Pastry\n(made with milk and water and the optional sugar), transferred to a pastry bag fitted with a 3/4-inch star tip\n1 large egg\n1 tablespoon (15ml) water\nFor the Crème Mousseline:\n226g (8 ounces) unsalted butter, softened to about 68°F (20°C)\n1 recipe\nPastry Cream\n, at room temperature, about 68°F (20°C)\nFor the Chocolate Glaze:\n113g chopped semi-sweet chocolate, 56% cacao (4 ounces; 3/4 cup)\n60g unsalted butter (2 ounces; 1/4 cup), cut into 1/2-inch cubes\n1 tablespoon (15g) light corn syrup\n1/8 teaspoon Diamond Crystal kosher salt; for table salt, use half as much by volume\nDirections\nEasy Éclair Cake\nPlace about 7 of the graham cracker sheets in an even layer in a 9- by 13- inch baking dish, breaking up crackers as needed to fill space; set aside.\nSerious Eats / Jen Causey\nIn a large bowl, whisk together sugar, vanilla, and 1 1/2 cups of the heavy cream until stiff peaks form, about 5 minutes. (See notes.) Place pastry cream in a large bowl, and, using a rubber spatula, gently fold whipped cream into pastry cream until just combined. Using an offset spatula, spread half of the pastry cream mixture (about 18 ounces; 510g) in an even layer over graham crackers. Place about 8 of the graham cracker sheets in an even layer over pastry cream mixture, breaking up crackers as needed to fill space. Using the offset spatula, top with remaining half of pastry cream mixture in an even layer. Place remaining 9 graham cracker sheets in an even layer, breaking up crackers as needed to fill space. Cover with plastic wrap and refrigerate until pudding is set, about 1 hour.\nSerious Eats / Jen Causey\nPlace chocolate in a medium heatproof bowl; set aside. In a small saucepan set over medium-high heat, bring butter and remaining 1 cup cream to a gentle simmer, stirring constantly, until it begins to bubble around the edges, about 4 minutes. Pour over chocolate (do not stir); let stand for 10 minutes. Using a rubber spatula, gently stir together until smooth, about 1 minute. Remove cake from refrigerator. Pour chocolate mixture over top of set cake, using an offset spatula to spread ganache into an even layer. Re-cover with plastic wrap, making sure it doesn’t touch the surface of the chocolate, and refrigerate until set and graham crackers are softened, at least 2 hours or up to 12 hours.\nSerious Eats / Jen Causey\nSpecial Equipment\n9- by 13- inch baking dish, rubber spatula, offset spatula, medium heatproof bowl\nNotes\nIf whipping cream with a stand mixer:\nIn the bowl of a stand mixer fitted with the whisk attachment, combine sugar, vanilla, and 1 1/2 cups heavy cream. Whisk on low speed until sugar is fully dissolved, about 30 seconds. Increase speed to medium-high. Continue to whisk until stiff peaks form, about 1 minute 10 seconds.\nÉclair Paris Brest\nPrepare the Choux:\nAdjust oven rack to middle position and preheat oven to 425°F (220ºC). Using a pen or pencil, trace an 8-inch circle in the center of a 12- by 16-inch sheet of parchment paper. Flip parchment over so that drawn ring is on underside and set on a large, rimmed baking sheet. Pipe a small amount of choux dough under each corner of parchment paper lining baking sheet (dough acts as a glue and keeps paper in place as you pipe).\nSerious Eats / Jen Causey\nHolding filled pastry bag at a 90 degree angle, about 1-inch away from parchment paper, apply steady pressure and slowly pipe ring of choux along traced circle. To stop piping, cease applying pressure and swirl pastry tip away from piped ring. Pipe a second ring of choux just inside first ring, making sure that the two rings are touching one another. Pipe a third, final ring of choux on top of, and nestling in the groove between, the two piped rings. To smooth out surface of dough, dip a finger into additional cold water and gently pat down any bumps as needed.\nSerious Eats / Jen Causey\nIn a small bowl, whisk together egg and 1 tablespoon water until smooth. Using a pastry brush, gently brush choux rings with egg wash. Bake in preheated oven until choux is puffed and light golden brown, about 15 minutes. Without opening the oven door, reduce oven temperature to 350°F (175ºC). Bake until deep golden brown, 30 to 35 minutes. Turn off oven, partially open door, and let choux stand in turned-off oven for 30 minutes to allow pastry to dry and fully set. Remove from oven and let cool completely, about 15 minutes.\nSerious Eats / Jen Causey\nWhile choux is cooling in oven, prepare the Crème Mousseline:\nIn the bowl of a stand mixer fitted with a paddle attachment, beat butter on medium speed until fluffy and light, about 5 minutes. Using a rubber spatula, scrape down bowl and beater. With mixer on medium speed, add pastry cream a few tablespoons at a time, pausing to scrape down bowl and paddle as needed, until thoroughly incorporated, about 1 minute. Switch to whisk attachment and whip mixture on medium speed until Crème Mousseline is soft and airy, about 3 minutes. Transfer Crème Mousseline to a pastry bag fitted with a 3/4-inch star tip; refrigerate until ready to use.\nSerious Eats / Jen Causey\nTransfer cooled choux ring to a large cutting board. Using a serrated knife, cut choux ring in half horizontally. Carefully lift top off and place on a wire rack set inside a large, rimmed baking sheet; set aside.\nSerious Eats / Jen Causey\nPrepare the Chocolate Glaze:\nPlace chocolate, butter, corn syrup, and salt in a medium-size, microwave-safe bowl. Microwave on high power in 15 second increments, stirring after each increment, until chocolate is melted and mixture is completely smooth, about 1 minute total. Gently pour over top choux ring in an even layer. Allow glaze to set, at room temperature, about 45 minutes.\nSerious Eats / Jen Causey\nPipe Crème Mousseline in even rosettes about 1 1/2-inch-high onto cut side of bottom half of choux ring, making sure to apply steady pressure while piping. Place glazed top half of choux ring over piped filling. Using a serrated knife, lice into portions, and serve.\nSerious Eats / Jen Causey\nSpecial Equipment\nParchment paper, rimmed baking sheet, pastry bag, 3/4-inch star tip, pastry brush, whisk, wire rack, stand mixer, serrated knife\nMake Ahead and Storage\nThe choux can be made up to 2 hours before using; keep at room temperature in a sealed pastry bag or with plastic pressed against its surface to prevent a skin from forming.\nThe pastry cream can be stored in an airtight container, with plastic wrap or buttered parchment placed directly on the surface, and refrigerated for up to 3 days.\nThe finished pastry should be enjoyed immediately.\nDesserts\nThe Latest\nChocolate\nCakes\nPastries"
}