{
  "url": "https://www.seriouseats.com/eclairs",
  "image_url": "https://www.seriouseats.com/thmb/f3kx43qc--aS4-okr8VNpnSAZZQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201210-choux-eclairs-vicky-wasik-16-acf615b81c2f4217857bbf80d60c28c1.jpg",
  "tags": [
    "Pastries",
    "French",
    "Easter Desserts",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Classic Éclairs",
  "full_text": "Classic Éclairs\nClose\nJump to recipe\nPrep\n60 mins\nCook\n60 mins\nActive\n60 mins\nCooling Time\n30 mins\nTotal\n2 hrs 30 mins\nServes\n24 servings\nMakes\n24 éclairs\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Éclairs:\nOne\nrecipe\nChoux Pastry\n(made with a combination of milk and water, and the optional sugar),\ntransferred to a pastry bag\nfitted with a 1/2-inch French star tip (see notes)\nOne\nrecipe\nvanilla pastry cream\n, transferred to a pastry bag fitted with a 1/4-inch plain round tip\nNonstick cooking spray\n, for coating éclairs\nFor the Glaze:\n4\nounces\ndark chocolate\n, about\n70%\n, chopped (3/4 cup; 115g)\n2 ounces (\n4\ntablespoons\n; 60g)\nunsalted butter\n, cut into 1/2-inch cubes\n1/2 ounce (\n1\ntablespoon\n; 15g)\nlight corn syrup\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nDirections\nTo Make the Éclair Shells:\nAdjust oven rack to middle position and preheat to 350°F (177°C). To prepare a template for your éclairs, take one sheet of parchment paper and, using a ruler as a guide and a permanent marker for easily visible lines, draw twelve 4 1/2-inch long lines that are 2 inches apart. Flip paper upside down and set it on an aluminum half-sheet tray. Repeat with a second piece of parchment paper and sheet tray.\nSerious Eats / Vicky Wasik\nPipe a small amount of choux paste under each corner of parchment paper (the dough acts as a glue and keeps the paper in place as you pipe).\nSerious Eats / Vicky Wasik\nPipe the first tray of éclair shells: Holding the bag at a 45° angle, lightly drag the tip along the surface of the paper and apply steady downward pressure, while slowly piping a 1-inch wide line of choux following a single line on the template. To stop piping, cease applying pressure and move the pastry tip up and over toward the opposite end of the éclair before completely lifting away. Continue to pipe until tray is full. To smooth out the surface of any uneven éclairs, dip a finger into cold water and gently pat down any bumps. Coat éclairs evenly with cooking spray.\nSerious Eats / Vicky Wasik\nBake first tray until éclair shells are puffed, golden brown, and hollow feeling, about 30 minutes. While first tray of éclair shells are baking, repeat Step 3 for the second tray of éclair shells. As soon as first tray are fully baked, remove from oven and set second tray in oven to bake.\nSerious Eats / Vicky Wasik\nWorking quickly while first tray of éclairs are still hot, make two 1/4-inch holes on the underside of each éclair (one near each end) by gently inserting the tip of a paring knife and rotating in a circular motion, then return to tray.\nSerious Eats / Vicky Wasik\nAs soon as second tray of éclairs are baked, repeat Step 5. Return both trays to the turned-off but still warm oven with the door partially open for 30 minutes.\nTo Fill the Éclairs:\nWorking one éclair at a time, insert tip of pastry cream–filled bag into a hole in each éclair shell and begin piping with steady pressure until filled (pastry cream will start to overflow the hole). Repeat with other hole. Wipe away any excess pastry cream. Repeat until all éclairs are filled.\nSerious Eats / Vicky Wasik\nTo Make the Glaze:\nCombine chocolate, butter, corn syrup, and salt in a wide, shallow microwave-safe bowl. Microwave in 15 second increments, stirring after each increment, until chocolate is melted and mixture is completely smooth, about 1 minute in total. If you don't have a microwave, see Notes.\nSerious Eats / Vicky Wasik\nWorking one at a time, hold each éclair upside down and carefully dip the top in the glaze, then return to tray. Repeat with remaining éclairs. Allow glaze to set, about 30 minutes. Serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nPastry bags\nNotes\nFor the choux pastry, combine 1/2 cup (115g) milk and 1/2 cup (115g) water to get 1 cup of liquid. If you don’t have milk, feel free to use 1 cup (235g) water; the éclairs will just bake up more tan in color than golden brown.\nIf you don’t have a microwave, you can make the glaze in a double boiler. Place 2 1/2 cups water in a 3-quart saucier on the stove over medium heat. In a large, heat-proof bowl that will sit comfortably on the pot without toppling over or touching the water below, combine chocolate, butter, corn syrup, and salt. Stir gently until chocolate and butter are melted and the glaze is smooth and shiny.\nMake-Ahead and Storage\nÉclairs are best consumed on the day they’re made.\nTo store unfilled, unglazed éclairs, wrap them tightly in plastic and place in an airtight container; they can be kept frozen for up to 1 month. To refresh éclairs, preheat oven to 350°F (177°C). Transfer frozen éclairs to a sheet tray and reheat until crisp, about 5 minutes. Let cool at room temperature before filling and glazing.\nPastries\nFrench\nEaster Desserts\nMother's Day\nFather's Day"
}