{
  "url": "https://www.seriouseats.com/eetch-armenian-bulgur-tomato-herb-salad-5202151",
  "image_url": "https://www.seriouseats.com/thmb/MRcAzmnHbeTW80saC8KrMGnzmhs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210903-Eetch-Andrew-Janjigian-30-1bf4ea5bbad745d8835081ec8e0b24cc.jpg",
  "tags": [
    "Grain Salads",
    "Farro & Other Wheat",
    "Tomato",
    "Vegan Mains",
    "Vegan Salads"
  ],
  "title": "Eetch (Armenian Bulgur, Tomato, and Herb Salad)",
  "full_text": "Eetch (Armenian Bulgur, Tomato, and Herb Salad)\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nCooling\n60 mins\nTotal\n100 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n175\ng\nbulgur wheat\n135\ng\ntomato paste\n2\nteaspoons\n(8g) Diamond Crystal\nkosher salt\n, divided; for table salt use half as much by volume or an equal amount by weight\n360\nml\nwater\n60\nml\nextra virgin olive oil\n1\nmedium\nonion\n2 1/4\nteaspoons\naleppo pepper\n1/2\nteaspoon\nground cumin\n2\nclove\ngarlic cloves\n225\ng\ntomatoes\n1 3/4 ounces (3/4 cup, packed;\n50\ng\n) coarsely-chopped\nmixed tender herbs\nand stems (about 1-1/2 packed cups picked herbs before chopping), such as parsley, mint, dill, cilantro, and purple basil (see note)\n120\ng\nscallions\n60\nml\npomegranate molasses\n15\nml\nfresh juice from 1 lemon\n1/2\nteaspoon\nground black pepper\n1\nleaves\nred leaf lettuce\n1\npiece\nlavash\nDirections\nIn a large bowl, combine bulgur, tomato paste, and 1/2 teaspoon salt. Add boiling water and whisk until well combined; set aside.\nAndrew Janjigian\nIn a 12-inch skillet, heat oil over medium-high heat until shimmering. Add onions, 2 teaspoons Aleppo pepper, cumin, and 1/2 teaspoon salt and cook, stirring regularly, until onions are softened and just beginning to brown (although they will be naturally darkened by the Aleppo), about 10 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Transfer onion mixture to prepared bulgur and stir until well combined. Allow mixture to cool to room temperature, 30 to 60 minutes, then cover and refrigerate until chilled, at least 30 minutes and up to 24 hours.\nAndrew Janjigian\nRemove bulgur mixture from refrigerator. Set a colander or fine-mesh strainer in a large bowl. Add tomatoes to prepared colander, season with 1/2 teaspoon salt, and toss to combine. Set tomatoes aside and allow to drain for 20 minutes. Place mixed herbs and scallions in a small bowl and toss to combine.\nAndrew Janjigian\nOnce tomatoes have drained for 20 minutes, set aside 2/3 of the tomatoes for garnishing; reserve drained tomato liquid. Add remaining 1/3 of tomatoes to prepared bulgur, along with reserved tomato liquid, pomegranate molasses, lemon juice, 1/4 cup of herb mixture, remaining 1/2 teaspoon salt, and black pepper. Stir gently until well combined. Add water as needed, 1 tablespoon (15ml) at a time, until mixture is moist but still holds its shape when scooped. Season with additional salt, pepper, and lemon juice to taste.\nAndrew Janjigian\nTransfer eetch to a serving platter or bowl, top with remaining tomatoes, sprinkle with 1 teaspoon of herb mixture and remaining 1/4 teaspoon Aleppo pepper. Serve, passing remaining herb mixture, Aleppo pepper, lettuce leaves, and lavash at the table.\nAndrew Janjigian\nNotes\nThe texture of eetch is best when fine bulgur (“#1” grade) is used. If fine bulgur is unavailable, medium (#2) or coarse (#3) will work, although the results will be correspondingly more coarse and grainy. With other grades, be sure to use an equivalent amount by weight (175g), not volume.\nIf you can’t find double-concentrated tomato paste, increase the amount to 6 tablespoons.\nUse the best quality tomatoes you can find here. In the off-season, when nice globe tomatoes are hard to find, use cherry or grape tomatoes cut into eighths instead.\nGenovese basil has a different flavor profile and is not used in Armenian cooking. If purple (also known as opal) basil is unavailable, use Thai basil instead.\nMake-Ahead and Storage\nTo make eetch ahead of time, the prepared bulgur (the mixture at the end of step 2) can be refrigerated in an airtight container for up to 48 hours, before proceeding with the recipe as directed. Waiting to prepare the tomatoes and herbs will ensure the best flavor and texture in the final dish. Leftover eetch can be refrigerated in an airtight container for up to 2 days.\nGrain Salads\nFarro & Other Wheat\nTomato\nVegan Mains\nVegan Salads"
}