{
  "url": "https://www.seriouseats.com/efo-riro-nigerian-stewed-greens-recipe-11689127",
  "image_url": "https://www.seriouseats.com/thmb/xEK8ZVj7fZwPB7CVbuVecjf2mXg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230111-Efo-Riro-Maureen-Celestine-hero-74fc1b414bbe444ab351d62ed0d32b9b.jpg",
  "tags": [
    "Beef",
    "Vegetables",
    "Nigerian"
  ],
  "title": "Efo Riro (Nigerian Beef and Vegetable Stew)",
  "full_text": "Efo Riro (Nigerian Beef and Vegetable Stew)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n105 mins\nTotal\n2 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beef:\n1/2\npound\n(\n226\ng\n) bone-in or\nboneless beef chuck roast\n, cut into 2-inch pieces\n1\nsmall\nred onion\n(about\n3\nounces\n;\n80\ng\n), thinly sliced\n1\ntablespoon\nground crayfish\n(see note)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n1/4\nteaspoon\nNigerian red dry pepper\nFor the Efo Riro:\n2\npounds\n(\n906\ng\n) fresh cockscomb amaranth or\nspinach\n, washed well of any sand or grit (see note)\n2\nmedium\nred onions\n(\n8 1/2\nounces\n;\n250\ng\n), half thinly sliced and half roughly chopped, divided\n2\nlarge\nplum tomatoes\n(\n10 1/2\nounces\n;\n300\ng\ntotal), cored, half a tomato thinly sliced crosswise and the rest roughly chopped, divided\n2\nred bell peppers\n(\n14\nounces\n;\n400\ng\ntotal), stemmed, halved, seeded, and roughly chopped\n1/3\ncup\n(\n80\nml\n)\nunrefined red palm oil\n, such as Obiji\nKosher salt\n1\ntablespoon\nground crayfish\n(see note)\n1 to 2\nteaspoons\niru\n(also sold as fermented locust beans or dawadawa), optional (see note)\n1/4 to 1\nfresh Scotch bonnet or\nhabanero pepper\n, stemmed, seeded (if desired), and finely chopped\nNigerian red dry pepper\n, to taste\nDirections\nFor the Beef:\nIn a medium pot, combine beef, onion, crayfish, salt, dry pepper, and 3 cups (710ml) water and bring to a boil. Lower heat to maintain a simmer, cover, and cook until beef is tender, about 1 hour. Using a slotted spoon, remove beef and transfer to a medium heatproof bowl and set aside. Reserve stock (you should have about 1 cup; see note).\nSerious Eats / Maureen Celestine\nFor the Efo Riro:\nPrepare an ice bath in a large bowl. In a medium or large pot of salted boiling water, cook amaranth or spinach until tender, 1 to 2 minutes. Immediately transfer to prepared ice bath to cool.\nSerious Eats / Maureen Celestine\nSet a fine-mesh strainer over a large bowl. Transfer amaranth to strainer and squeeze to remove excess moisture; discard liquid. Transfer amaranth to a work surface and finely chop; set aside.\nSerious Eats / Maureen Celestine\nIn a blender, pulse roughly chopped onion, roughly chopped tomatoes, bell peppers, and 1/2 cup (120ml) reserved beef stock until a thick coarse purée forms, 3 to 4 1-second pulses. Set aside.\nSerious Eats / Maureen Celestine\nIn a wok or 10-inch skillet or sauté pan, heat palm oil over low heat until smoking and fragrant, about 2 minutes. Add sliced onion, season lightly with salt, and cook, stirring often, until onion is softened but not browned, about 3 minutes. Add sliced tomatoes, ground crayfish, and iru (if using), and cook until tomatoes are softened but still holding their shape, 2 to 3 minutes. Stir in fresh pepper, a 1/4 teaspoon at a time, until desired spice level is reached. Continue to cook, stirring often, until pepper has softened slightly, 2 to 3 minutes.\nSerious Eats / Maureen Celestine\nAdd reserved vegetable purée, increase heat to high, and cook, stirring occasionally, until hot, about 4 minutes. Stir in reserved beef, reduce heat to medium heat, partially cover, and cook, stirring often, until stew is slightly reduced and thickened and oil pools around the sides and on top, about 10 minutes.\nSerious Eats / Maureen Celestine\nStir in chopped amaranth, cover, and cook until greens are heated through, 2 to 3 minutes. Season with salt and dry pepper to taste. (If you prefer a looser stew, stir in reserved beef stock in 1/4 cup increments to reach desired consistency). Remove from heat and let stand to allow flavors to develop, about 10 minutes.\nSerious Eats / Maureen Celestine\nTo serve, divide stew among warmed individual bowls or serve family-style in one large bowl. Serve with\neba\n,\nfufu\n,\nNigerian beef stew\nor\nobe ata\n, rice, and boiled yams, sweet potatoes, or\nplantains\n.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nblender, wok or 10-inch skillet or sauté pan\nNotes\nThe reserved beef stock can be used in other recipes that call for beef stock like\negusi soup\n.\nYou can use other edible varieties of amaranth greens or sweet potato leaves. Do not use baby spinach.\nGround crayfish is made from small prawns that are often sun-dried and smoked. You can find ground crayfish in many West African stores and\nonline\n.\nIru (fermented locust beans) are available\nfresh\n,\ndried\n, and\nground\n; you can use them interchangeably. You’ll find them in many West African stores and online.\nMake-Ahead and Storage\nThe amaranth can be prepared ahead of time by following Steps 2 and 3 then refrigerated in an airtight container for up to 2 days or frozen for up to 1 month. If using frozen greens, add frozen greens in Step 10 and cook until softened and heated through, about 8 minutes.\nEfo riro can be refrigerated in an airtight container for up to 3 days or frozen for up to 6 weeks (thaw overnight in the refrigerator). Reheat gently before serving.\nBeef\nVegetables\nNigerian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/efo-riro-nigerian-beef-and-vegetable-stew.webp?"
}