{
  "url": "https://www.seriouseats.com/egg-and-pate-banh-mi-recipe-8415417",
  "image_url": "https://www.seriouseats.com/thmb/S2DXxYCC9ORBorKn8qBHj5Fo0X8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-EggandPateBanhMi-VyTran-hero-07a9427b17514584a131952b4b5da25f.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Vietnamese",
    "Breakfast Sandwich"
  ],
  "title": "Egg and Pâté Bánh Mì",
  "full_text": "Egg and Pâté Bánh Mì\nClose\nJump to recipe\nPrep\n40 mins\nCook\n60 mins\nSoaking Time\n6 hrs\nTotal\n7 hrs 40 mins\nServes\n4\nMakes\n4 Sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Aioli:\n1\nlarge\negg\n, at room temperature\n2\nmedium\ncloves\n(10g) garlic, roughly chopped\n1 tablespoon (\n15\nml\n)\nfresh lemon juice\n1\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt, use half as much by volume\n1\ncup\n(240ml) neutral oil such as vegetable or\ncanola oil\nFor the Chicken Liver Pâté:\n1\npound\n(454g)\nchicken livers\n, preferably organic (see notes)\n1\ncup\n(240ml)\nbuttermilk\nor milk\n12\ntablespoons\n(170g)\nunsalted butter\n1\ntablespoon\nfresh\nthyme leaves\n(about 5 sprigs)\n1/2\ncup (65g) chopped\nshallots\n5\nmedium\ncloves (25g)\ngarlic\n, minced (2 tablespoons)\n2\ntablespoons\n(30ml) sweet\nsherry\n, such as Pedro Ximénez, or port\n2\ntablespoons (30ml)\nheavy cream\n1\nlarge\negg\n1\nteaspoon\n(4g) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n1/4\nteaspoon freshly\nground black pepper\nFor the Omelette:\n8\nlarge\neggs\n2\nteaspoons (10ml)\nfish sauce\n1\nteaspoon\ngranulated sugar\n1/2\nteaspoon\nfreshly\nground black pepper\n2\ntablespoons (30ml)\nvegetable oil or olive oil, divided\n2\nscallions\n, thinly sliced (about\n2\nounces\n; 50g)\n1 small\nshallot\n(about\n1\nounce\n; 30g), finely chopped\nFor Assembling the Bánh Mì:\nFour\n8-inch\nlong bánh mì\nloaves\n, split lengthwise, but left attached on 1 side to create a hinge\nPickled\ncarrot\nand\ndaikon\n1\nPersian\ncucumber,\nsliced into 2- to 3-inch-long thin matchsticks\n1/4\ncup\ncilantro\nleaves with tender stems\n1\njalapeño,\ntrimmed,\nseeded if desired, and sliced lengthwise into thin matchsticks\nMaggi seasoning sauce\n, for drizzling\nDirections\nFor the Aioli:\nIn a food processor bowl, combine egg, garlic, lemon juice, and salt and process until a cohesive yellow mixture forms, about 10 seconds. With the machine running, slowly drizzle in oil through the feed tube in a slow and steady stream, until fully emulsified, stopping to scrape down the sides as needed. Season with salt and pepper to taste. Refrigerate aioli in an airtight container until ready to use. (Aioli can be refrigerated for up to one week.)\nSerious Eats / Vy Tran\nFor the Chicken Liver\nPâté:\nIn a large bowl, soak chicken livers in buttermilk or milk for at least 6 and up to 12 hours. Drain and rinse thoroughly.\nSerious Eats / Vy Tran\nAdjust oven rack to middle position and heat oven to 300°F (150°C). In a 10-inch nonstick skillet, melt 2 tablespoons butter over medium heat until foaming. Add chicken livers and thyme leaves and sauté until livers are lightly browned outside (they should still be pink in the middle), about 5 minutes. Transfer mixture to a bowl and set aside.\nSerious Eats / Vy Tran\nAdd 2 tablespoons butter to the now-empty skillet and melt over medium heat. Add shallot and cook, stirring, until softened, about 3 minutes. Add garlic and cook until fragrant, about 1 minute. Return livers to the skillet, add sherry, and cook until liquid is reduced to about 1/4 cup, 1 minute. Let mixture cool off heat for 15 minutes.\nSerious Eats / Vy Tran\nCarefully transfer livers and thyme mixture to a food processor. Add heavy cream, egg, salt, and pepper and process until smooth, about 1 minute. Add 4 tablespoons butter and process until smooth, scraping down sides of bowl as needed, about 30 seconds. Repeat with the remaining 4 tablespoons butter.\nSerious Eats / Amanda Suarez\nLine the bottom of a 7x4 inch loaf pan with parchment paper; set aside. (see notes) Using a rubber spatula, pass the pâté through a fine-mesh strainer set over a bowl, gently applying pressure to push through, and scraping off underside of the strainer as needed. Transfer the strained mixture to the prepared loaf pan. Cover loaf pan tightly with aluminum foil.\nSerious Eats / Vy Tran\nPlace loaf pan into a larger baking dish and transfer to the middle oven rack. Carefully pour enough hot water into the baking dish until it measures halfway up the sides of loaf pan. Bake until the pâté is firm and the center registers 150℉ (65℃) with an instant read thermometer, about for 30 minutes Remove from water bath and let pâté cool to room temperature, about 2 hours, then refrigerate in the covered loaf pan at least 6 and up to 12 hours. Bring to room temperature before serving.\nSerious Eats / Vy Tran\nFor the Omelette:\nIn a large bowl, beat eggs, fish sauce, sugar, and pepper together until whites and yolks are fully combined. In a 10-inch nonstick skillet, heat 1 tablespoon oil over medium-high heat until shimmering. Add half of the scallions and half of the shallots and cook, stirring occasionally, until softened, about 3 minutes. Pour half of egg mixture into the skillet, then swirl to distribute. Cook eggs, stirring with rubber spatula to break large curds into smaller ones, then stop stirring while eggs are still loose enough to set into a cohesive round in the skillet and continue to cook uncovered until fully set, 3 to 4 minutes.\nSerious Eats / Vy Tran\nGently ease spatula under eggs and roll egg over itself to form a cigar shape that's tapered at both ends and transfer to a plate. Repeat the omelette cooking process with the remaining 1 tablespoon oil along with the remaining scallions, shallots, and egg mixture. Set cooked omelettes aside until ready to assemble sandwiches.\nSerious Eats / Vy Tran\nFor Assembling the Bánh Mì:\nAdjust the oven rack to middle position and heat the oven to 350°F (175°C). Slice each omelette in half lengthwise so you have 2 roughly 8-inch long omelette halves and set aside. Spread about 1/3 cup of pâté (or more if you like) on one side of each bread loaf, transfer to a rimmed baking sheet, and toast until warmed through and edges of bread are crispy, about 1 minute.\nSerious Eats / Vy Tran\nSpread about 2 tablespoons aioli on the second side of each loaf. Layer each sandwich with omelette, pickled carrot and daikon, cucumber batons, cilantro, and jalapeño slices. Top each sandwich with a few drops of Maggi sauce. Cut bánh mì and serve immediately.\nSerious Eats / Vy Tran\nSpecial Equipment\n10-inch skillet, Food processor, fine-mesh strainer, 7x4 inch loaf pan or pâté terrine pan\nNotes\nA slightly larger loaf pan or a pâté terrine pan may be substituted for the 7x4 inch loaf pan but the cooking time vary.\nSave the unused pâté for other uses, such as for spreading on roasts or crackers.\nMake-Ahead and Storage\nThe aioli can be refrigerated in an airtight container for up to 2 weeks before using.\nThe cooked and cooled pâté can be refrigerated, covered with plastic wrap pressed against the surface or covered with melted butter to seal and prevent oxidation. for up to one week before using.\nSandwiches\nThe Latest\nVietnamese\nBreakfast Sandwich",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/egg-and-pt-bnh-m.webp?"
}