{
  "url": "https://www.seriouseats.com/eggnog-jello-shots-recipe-8765405",
  "image_url": "https://www.seriouseats.com/thmb/C-r-9rwYET2HGlVvtp6GFjne4o0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20151115-EggNogJelloShot-jelloshots2-ElanaLepkowski-cd5c81fbef9f46768dd61c17936b049c.jpg",
  "tags": [
    "Desserts",
    "Cocktails",
    "Christmas Desserts",
    "Winter Desserts"
  ],
  "title": "Give Eggnog a Playful Update By Turning It Into Jello Shots",
  "full_text": "Give Eggnog a Playful Update By Turning It Into Jello Shots\nClose\nJump to recipe\nPrep\n30 mins\nCook\n10 mins\nChilling Time\n8 hrs\nTotal\n8 hrs 40 mins\nMakes\n48 jello shots\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\neggs\n, separated (see note)\n2 1/2 tablespoons (\n38\ng\n)\ngranulated sugar\n, divided\n3/4 cup (\n180\nml\n)\nwhole milk\n1/2 cup (\n120\nml\n)\nheavy cream\n2\npackets unflavored\npowdered gelatin\n(1/2 ounce; 14g)\n1/2\ncup\n(120ml) dark\nrum\n, such as Gosling's, or spiced rum, such as Malahat Spiced Rum\n1/4\nteaspoon\nnutmeg\nDirections\nIn the bowl of a stand mixer fitted with the whisk attachment, beat egg whites on low speed until frothy, about 30 seconds. Increase speed to medium-high and beat until white and foamy, about 90 seconds. Reduce speed to medium. With the mixer running, add half (14g) for sugar gradually, and beat until incorporated, about 30 seconds. Scrape whites into a large bowl; do not wash stand mixer bowl.\nIn the same stand mixer bowl, beat egg yolks and remaining 14g sugar on medium-high speed until thick and pale yellow, stopping to scrape down sides of the bowl as needed, about 2 minutes. Add milk and cream and mix at low speed to combine.\nPour half of the yolk mixture into a small saucepan and sprinkle gelatin over the surface. Let stand 5 minutes. Meanwhile, add rum to remaining yolk mixture in stand mixer bowl and mix at low speed for 30 seconds to combine. Set saucepan over low heat and bring to just below a simmer, whisking constantly, until gelatin is fully dissolved; do not let boil. Remove from heat and let stand until cooled slightly, about 2 minutes.\nWith stand mixer running at low speed, slowly pour gelatin mixture into the yolk-rum mixture. Gently whisk in egg whites until smooth.\nUsing a fine-mesh sieve, strain mixture into a large measuring cup with a spout. Sprinkle in nutmeg and stir gently to combine. Carefully fill your molds with the eggnog and refrigerate until set, about 8 hours. (See notes.)\nTo remove jello shots from semi-spherical molds, carefully run a small spoon around the edge and slowly invert the mold to pop out the shot. If using square or straight-sided molds, run a butter knife around the edge and slowly invert the mold to pop out the shot. For other shapes or non-flexible molds, dip the bottom of the mold in warm water for 15 seconds, invert mold onto a baking sheet, and gently tap the mold to release the jello shot. Eggnog jello shots can be refrigerated for up to 3 days in an airtight container.\nSpecial Equipment\nSmall saucepan\n,\nstand mixer\n,\nlarge measuring cup\nwith spout, molds for jello shots (we recommend semi-spherical silicone molds, see note)\nNotes\nIf you want to use store-bought eggnog or any of our flavored variations—like\nbutterscotch\n,\nmaple bourbon\n,\ndouble nut\n, or\nnutella eggnog\n—start with 12 ounces of your chosen eggnog. Pour half of the eggnog into a heatproof bowl and half into a small saucepan. Whisk 1/2 cup dark or spiced rum into eggnog in the heatproof bowl. Sprinkle 2 packets unflavored powdered gelatin onto the surface of the eggnog in the saucepan and let stand 5 minutes. Set saucepan over low heat and bring to just under a simmer, whisking constantly, until gelatin is fully dissolved; do not let boil. Remove from heat and let stand 2 minutes to cool slightly. Pour eggnog-gelatin mixture into the eggnog-rum mixture and whisk to combine. Proceed with instructions in Step 5.\nWhile just about any container can be used for making the jello shots, silicone molds are your best bet. These provide the right amount of flexibility to help you pop out your jello shots without cracking them.\nMake-Ahead and Storage\nEggnog jello shots can be refrigerated for up to 3 days in an airtight container.\nRead More\nThe Science of Jello Shots\nOld Fashioned Jelly Shots\nEggnog Ice Cream\nBoozy Eggnog Cake\nHoliday Eggnog\nCoquito (Puerto Rican Coconut Eggnog)\nDesserts\nCocktails\nChristmas Desserts\nWinter Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/give-eggnog-a-playful-update-by-turning-it-into-jello-shots.webp?"
}