{
  "url": "https://www.seriouseats.com/eggplant-cheese-honey-nigella-puff-pastry-tart-recipe",
  "image_url": "https://www.seriouseats.com/thmb/V17NKfcPgF1CV4wJx45gWC1-mvE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__07__20180711-eggplant-tart-vicky-wasik-19--27c6b03af68949b7a5e7537d67978eea.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Vegetarian Snacks & Appetizers",
    "Savory",
    "Cheese",
    "Eggplant"
  ],
  "title": "Eggplant Tart With Goat Cheese, Honey, and Nigella Recipe",
  "full_text": "Eggplant Tart With Goat Cheese, Honey, and Nigella Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nActive\n40 mins\nResting Time\n30 mins\nTotal\n75 mins\nServes\n12\nto 24 servings\nMakes\n1 tart\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\neggplant\n(about 3 small eggplants; 900g)\n4\nteaspoons\nkosher salt\n, divided\nAll-purpose flour\n, for dusting\n2\nsheets\nfrozen puff pastry\n(1 full box), thawed\n4 tablespoons\nextra-virgin olive oil\n(2 ounces;\n60\ng\n)\nFreshly ground black pepper\n1/2 cup\nfresh goat cheese\n(4 ounces;\n112\ng\n)\n2 cups shredded\nGouda\n(6 ounces;\n168\ng\n)\n2\nteaspoons\nnigella seeds\n4 tablespoons\nhoney\n(2 ounces;\n60\ng\n), divide\nFresh herbs\n, such as chives or basil, for garnish (optional)\nDirections\nWith a sharp\nchef's knife\nor\nmandoline\n, cut eggplant into 1/4-inch-thick slices. Toss the slices with 1 tablespoon (12g) kosher salt and set aside in a colander placed over a bowl or sink. Let drain for at least 30 minutes.\nMeanwhile, adjust two racks in the oven to the upper- and lower-middle positions. Preheat oven to 400°F (200°C). Line three rimmed half-sheet trays with parchment paper (see note). Cut one extra sheet of parchment and set it aside.\nOn a lightly floured surface, lay the thawed sheets of puff pastry on top of one another. Roll out pastry until it's just big enough to fit a half-sheet tray, about 11 by 15 inches, dusting with enough flour to prevent it from sticking to the counter or rolling pin. Coil the pastry onto the rolling pin to help you transfer it, then uncoil it onto the parchment-lined baking sheet. Top with the extra sheet of parchment.\nSerious Eats / Vicky Wasik\nBy this time, the eggplant will have released a significant amount of liquid. Rinse eggplant under cold water to remove the excess salt and blot dry with a clean kitchen towel or paper towels. Line up eggplant slices on the two remaining lined baking sheets. Season with extra-virgin olive oil, black pepper, and remaining kosher salt.\nSerious Eats / Vicky Wasik\nTop the puff pastry baking sheet with one of the eggplant baking sheets to keep the pastry weighed down as it bakes. Place all three trays in the preheated oven to bake for about 20 minutes, rotating the pans once after 10 minutes. The eggplant will grow tender while the pastry becomes firm to the touch. There shouldn't be any color on the pastry at this time. The eggplant and the puff pastry will complete their first bake at the same time.\nSerious Eats / Vicky Wasik\nAfter the first bake, remove trays from oven. Increase oven temperature to 500°F (260°C). Using an offset spatula, evenly spread goat cheese on the puff pastry. Sprinkle shredded Gouda and nigella seeds over the goat cheese. Shingle the par-cooked eggplant slices to cover the tart. Drizzle 2 tablespoons (30g) honey all over eggplant. Return tart to oven and bake an additional 15 minutes or until the pastry is deeply browned and crisp all the way through.\nFinish tart with remaining honey and garnish with herbs if desired. Cut into desired portion sizes and serve right away.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRolling pin\n, three\nrimmed baking sheets\n,\nchef's knife\nor\nmandoline\n,\nsmall offset spatula\n,\nmixing bowls\nNotes\nThis recipe calls for using three half-size rimmed baking sheets at once. If you don't own three baking sheets, don't fret; you can get away with only two by roasting the eggplant first and transferring it to a plate. Then use one of the empty sheets to weigh down the puff pastry during blind-baking.\nRead More\nZucchini Tart With Cream Cheese, Mozzarella, and Thyme\nThree-Cheese Hearty Greens and Puff Pastry Tart\nPuff Pastry Breakfast Egg Tarts\nSweet Onion and Goat Cheese Tarts with Thyme\nBaked Brie en Croûte With Thyme and Fig Jam\nHors D'Oeuvres\nVegetarian Snacks & Appetizers\nSavory\nCheese\nEggplant"
}