{
  "url": "https://www.seriouseats.com/eggplant-donburi-rice-bowl",
  "image_url": "https://www.seriouseats.com/thmb/MXtzqx2T8EAeaaEElzklkFhppmg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200114-rice-bowls-eggplant-vegetarian-vicky-wasik-13-6481e695873b426dbf397d17ff6cfce4.jpg",
  "tags": [
    "Eggplant",
    "Japanese",
    "Dairy-free Mains",
    "Rice & Grain Mains",
    "Quick Dinners"
  ],
  "title": "Eggplant Rice Bowl (Donburi) Recipe",
  "full_text": "Eggplant Rice Bowl (Donburi) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n15 mins\nBrining Time\n30 mins\nTotal\n70 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pressed Quick Pickles:\n2\nPersian cucumbers\n(\n200\ng\n), sliced into thin rounds\n1\ntablespoon\n(\n15\nml\n)\nrice vinegar\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt, use half as much by volume\n1\nteaspoon\nsugar\n1\nteaspoon\n(\n5\nml\n)\ntoasted sesame oil\nFor the Vegetables:\n8\ndried shiitake\nmushrooms\n1\nlarge\nglobe eggplant\n(\n19 ounces\n;\n550 g\n), peeled and cut into about 1-inch cubes\n3\ntablespoons\nplus\n1\nteaspoon\n(\n50\nml\n)\nsoy sauce\n, divided\n2\ntablespoons\n(\n46\ng\n)\nmiso\n2\nteaspoons\nsugar\n2\nteaspoons\n(\n10\nml\n)\nmirin\n2\ntablespoons\n(\n30\nml\n)\ncanola oil\n, or other neutral-flavored oil, divided\n1\nsmall\nred bell pepper\n(\n8 ounces\n;\n225 g\n), stemmed, seeded, and sliced into thin strips\n1\nThai bird\nchile\n, stemmed and sliced thinly (optional, see note)\n1\nmedium\nclove garlic\n, sliced\n8\nounces\n(\n250\ng\n)\nmung bean sprouts\n1\nteaspoon\n(\n5\nml\n)\nrice vinegar\n1\nteaspoon\n(\n5\nml\n)\ntoasted sesame oil\n1\n(1-inch) piece\nfresh peeled ginger\n(\n10\ng\n), julienned\n1\nmedium\nclove garlic\n(\n3\ng\n), minced\nTo Finish:\nKizami nori\n(optional, see note)\nTakanazuke\n(pickled mustard greens) (optional, see note)\nPickled ginger\n(optional, see note)\nAonori\n(optional, see note)\nSesame seeds\n(optional, see note)\n2\nscallions\n, white and light green parts, thinly sliced\n5\ncups\nhot cooked rice\n, for serving\nDirections\nFor the Pressed Quick Pickles\n: Place cucumbers in a pickle press or in a small, zip-top plastic bag. Add rice vinegar, salt, sugar, and sesame oil and stir briefly to combine. If using a pickle press, attach lid and adjust spring to exert pressure on cucumber rounds. If using zip-top bag, seal bag, making sure to remove as much air as possible. Place bag between two 1/4 sheet pans and place a 1-pound weight on top (such as a can of tomatoes). Leave pressed pickles in brine for at least 30 minutes and up to 8 hours.\nFor the Vegetables\n: In a heat-proof container, combine dried shiitake mushrooms with 1 1/4 cups hot water and let stand until mushrooms are fully hydrated, about 15 minutes. Once hydrated, squeeze excess liquid from mushrooms and slice into thin strips. Reserve 1 cup of mushroom soaking liquid, taking care to include as little sediment as possible. Discard any excess.\nPlace eggplant cubes in a single layer on a microwave-safe plate. Place plate in microwave and cook on high until eggplant is tender enough that you can easily squeeze a cube between two fingers, 7-8 minutes. Meanwhile, combine 2 tablespoons soy sauce with miso, sugar, mirin, and 1 cup of reserved mushroom soaking liquid in small bowl and, using a whisk, stir until mixture is blended and smooth.\nIn a 10-inch cast-iron skillet, heat 1 tablespoon canola oil over medium-high heat until shimmering. Add mushrooms and cook, stirring, until nicely browned and beginning to dry, about 2 minutes. Add red bell pepper and cook, stirring frequently, until just softened, about 1 minute. Add Thai bird chili (if using) and garlic, stir to combine, and cook until fragrant, about 30 seconds. Add bean sprouts and cook, stirring constantly, until they are coated in oil and just softening, about 2 minutes. Add the remaining 1 tablespoon plus 1 teaspoon soy sauce and stir to combine. Transfer stir-fried vegetables to a bowl and reserve. Rinse and wipe out skillet (no need to wash.)\nAdd 1 tablespoon canola oil to skillet and place pan over medium heat until shimmering. Add julienned ginger and minced garlic and cook, stirring frequently, until ginger is very fragrant, 1-2 minutes. Stir mushroom liquid mixture briefly, then add to the pan, followed by eggplant cubes. Bring liquid to a boil, then lower heat to maintain a vigorous simmer. Cook, stirring occasionally, until eggplant is tender and sauce has thickened slightly, about 5 minutes.\nTo Serve\n: Toss stir-fried vegetables with the rice vinegar and sesame oil. Spoon hot rice into each serving bowl. Top with kizami nori, if using. Spoon about a tablespoon of the eggplant sauce over each serving of rice, then divide eggplant cubes among bowls evenly. Divide stir-fried vegetables among bowls evenly. Place a handful of pressed cucumber quick pickles in each bowl along with a small mound of\ntakanazuke\nand pickled ginger strips, if using. Garnish stewed eggplant with aonori and sesame seeds, if using, then top with sliced scallions. Serve immediately.\nSpecial Equipment\n10-inch cast iron skillet\n, pickle press (optional)\nNotes\nYou may substitute red pepper flakes or a singled dried Thai chili snapped in two for the fresh sliced Thai bird chili, if you like; you can also omit using the chili entirely.\nAonori, kizami nori, pickled ginger, and takanazuke can be purchased in a well-stocked Japanese grocery store or online. While they provide complexity of flavor and textural variation to the bowl, they are entirely optional.\nMake-Ahead and Storage\nWhile every element can be made ahead of time, we do not suggest reheating the stir-fried vegetables. They can be stored in an airtight container in the refrigerator for several days, and should be served cold as leftovers. Eggplant kept in an airtight container will keep in the refrigerator for a week, and it can be reheated in a microwave or on the stovetop. Quick pickles should be eaten within 24 hours of preparation.\nThis Recipe Appears In\n7 Rules for a Better Rice Bowl\nEggplant\nJapanese\nDairy-free Mains\nRice & Grain Mains\nQuick Dinners"
}