{
  "url": "https://www.seriouseats.com/eggs-in-purgatory-recipe-8654718",
  "image_url": "https://www.seriouseats.com/thmb/W1a2ot9TnkwUJFqyBPZ5fe1IpA4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240528-SEA-EggsinPurgatory-AmandaSuarez-hero-bfd61fc6c29f487f9e68224fa6c2b0d6.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Italian",
    "Tomato",
    "Baked Eggs"
  ],
  "title": "Eggs in Purgatory",
  "full_text": "Eggs in Purgatory\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n8\n(3/4-inch-thick) slices\nrustic\nItalian bread\n7\ntablespoons\n(\n105\nml\n)\nextra-virgin olive oil,\ndivided, plus extra for drizzling\n1\n(\n28-ounce\n;\n794 g) can\nwhole peeled tomatoes\n1/2\nsmall\nyellow onion\n(\n3\nounces\n), finely chopped\n4\ngarlic cloves\n(\n20\ng)\n, minced\n3\ntablespoons\n(\n45\nml)\ntomato paste\n2\nteaspoons\nminced fresh oregano or\n3/4\nteaspoon\ndried oregano\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt use half as much by volume\n1\nteaspoon\nred pepper flakes\n(see notes)\n1\ncup\nfresh\nbasil leaves\nplus\n2\ntablespoons\ntorn\n8\nlarge\neggs\n1/4\ncup\ngrated\nParmigiano-Reggiano cheese\nDirections\nAdjust oven rack to middle position and heat broiler. Arrange bread slices on baking sheet and drizzle first sides with 2 tablespoons oil; flip slices and drizzle with 2 more tablespoons oil. Broil the bread until deep golden brown, about 3 minutes per side. Set aside.\nSerious Eats/Amanda Suarez\nIn a large bowl, use your finger to crush tomatoes until tomato pieces are no larger than 1/2 inch; set aside.\nSerious Eats/Amanda Suarez\nHeat remaining 3 tablespoons oil in a 12-inch skillet over medium heat until shimmering. Add onion and cook until softened, 3 to 5 minutes. Add garlic and cook until fragrant, about 30 seconds. Add tomato paste, oregano, salt, and pepper flakes, and cook, stirring occasionally, until rust-colored, about 2 minutes. Add basil leaves and cook until wilted, about 30 seconds. Stir in reserved crushed tomatoes and bring to a gentle simmer. Reduce heat to medium-low and continue to simmer, stirring occasionally, until slightly thickened, 5 to 10 minutes. The sauce should be thick enough that a spatula should leaves trail in the sauce that slowly fills in behind it, but the sauce should still move when the skillet is shaken.\nSerious Eats/Amanda Suarez\nRemove skillet from heat and let sit for 2 minutes to cool slightly. In a small bowl, crack 1 egg. Using a rubber spatula or large spoon, clear a 2-inch-diameter well in sauce. Immediately pour in the cracked egg. (The well will hold yolk in place but may not fully contain egg white; this is ok.) Repeat with remaining eggs, evenly spacing the remaining 7 eggs in total around the skillet (7 around perimeter and 1 in the center).\nSerious Eats/Amanda Suarez\nSeason each egg lightly with salt and pepper. Bring to a simmer over medium heat, cover, and cook, reducing heat as needed to maintain gentle simmer, until yolks film over, 4 to 5 minutes. Continue to cook, covered, until whites are just set (if skillet is shaken lightly, each egg should jiggle), 1 to 2 minutes longer for slightly runny yolks or 3 to 4 minutes for soft-cooked yolks.\nSerious Eats/Amanda Suarez\nOff heat sprinkle with Parmesan and chopped basil and drizzle with extra oil. Serve immediately with toasted bread.\nSerious Eats/Amanda Suarez\nSpecial Equipment\n12-inch skillet\nNotes\nAdjust the red pepper flakes amount to your preferred spice level.\nMake-Ahead and Storage\nThe sauce can be cooked through step 3 and refrigerated for up to 3 days or frozen for up to 3 months.\nBreakfast & Brunch\nThe Latest\nItalian\nTomato\nBaked Eggs",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/eggs-in-purgatory.webp?"
}