{
  "url": "https://www.seriouseats.com/egyptian-bissara-recipe-7109529",
  "image_url": "https://www.seriouseats.com/thmb/IEBowKCN8DusZqAuz0MFB8GOyCM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220214-Egyptian-Bissara-DuPree-c91cc60552bc441ca27895a347aab3b9.jpg",
  "tags": [
    "Egyptian",
    "The Latest",
    "Dips",
    "Middle Eastern",
    "Fava Beans"
  ],
  "title": "Egyptian Bissara (Split Fava Bean Dip)",
  "full_text": "Egyptian Bissara (Split Fava Bean Dip)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n100 mins\nSoaking and Cooling Time\n13 hrs\nTotal\n15 hrs 40 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Shallot-Infused Oil and Fried Shallots:\n1\ncup\n(\n237\nml\n)\nneutral frying oil\n, such as canola\n10\nmedium\nshallots\n(\n14\nounces\n;\n397\ng\n), thinly sliced\nKosher salt\nFor the Bissara:\n2\ncups\ndried split fava beans\n(\n12.7\nounces\n;\n360\ng\n), rinsed\n2\ncups\npacked\nfresh cilantro\nleaves and tender stems (\n2\nounces\n;\n57\ng\n), divided\n1\ncup packed\nflat-leaf parsley leaves\n(\n1\nounce\n;\n30\ng\n)\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n227\ng\n), peeled, root end trimmed, and quartered lengthwise\n1/4\ncup\n(\n10\ng\n) packed\nfresh dill\n3\nmedium\ncloves garlic\n(\n12\ng\n), peeled\n1\ngreen chile pepper\n(\n15\ng\n), such as serrano, stemmed, seeded, and chopped (about\n1\ntablespoon\n), or\n1/2\nteaspoon\ncayenne pepper\n, optional\n5\nfresh mint\nleaves\n1\nteaspoon\nground cumin\n1\nteaspoon\nground coriander\n1\nteaspoon\ndry mint\n1/2\nteaspoon\nsweet\npaprika\n1/2\nteaspoon\nblack pepper\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n4\ncups\n(\n946\nml\n)\nvegetable broth\n2\ntablespoons\n(\n30\nml\n)\nshallot-infused oil\n(recipe above)\nTo Serve:\n1\ntablespoon\n(\n15\nml\n)\nshallot-infused oil\n1/4\nteaspoon\npaprika\nFried shallots\nStore-bought\npita chips\nDirections\nFor the Shallot-Infused Oil and Fried Shallots:\nIn an 8-inch skillet, combine oil and shallots over medium-low heat, and cook, stirring often, until shallots are golden brown and crisp, about 20 minutes.\nStrain through a fine-mesh strainer into a heatproof bowl. Transfer shallots to a paper-towel lined plate to drain and season with salt. Set shallot-infused oil aside to cool.\nStore the fried shallots in an airtight container until you are ready to garnish the bissara. Store the shallot-infused oil in a clean jar.\nFor the Bissara:\nAdd the rinsed split fava beans to a large bowl; cover with cold water by at least 2 inches. Cover and set aside to soak overnight (at least 12 hours or up to 24 hours) at room temperature. The second day, transfer the beans to a colander and rinse well under cold water; drain.\nIn a 7-quart Dutch oven or heavy-bottomed pot, combine the fava beans, 1 cup cilantro, parsley, quartered onion, dill, whole garlic cloves, green chili pepper, mint, cumin, coriander, dry mint, paprika, pepper, and salt. Stir in broth and shallot-infused oil (the beans will not be fully submerged in liquid; that’s okay). Bring to a boil over high heat, then reduce the heat to medium-low and let the beans simmer gently, uncovered, stirring occasionally, for 1 hour. (Your beans may finish cooking in less than an hour; continue simmering to reduce the liquid until to a thick porridge-like consistency.) The beans should be soft and easy to crush with a fork. Make sure to stir every now and then so it doesn’t stick to the bottom of the pan and burn.  Remove from the heat and set aside to cool completely to room temperature, 60 to 90 minutes (mixture will thicken as it cools).\nTransfer cooled mixture to a food processor, add the remaining 1 cup fresh cilantro and process until you reach a creamy consistency similar to hummus, about 1 minute, stopping to scrape down the sides as needed. In case the dip is anything less than vibrant green, just add some more fresh parsley or cilantro herbs to punch up the color. Taste the bissara and adjust the seasoning.\nTransfer the bissara back to the pot to reheat gently over low heat until just warm or serve at room temperature.\nTo Serve:\nTransfer the bissara to a serving bowl and drizzle with shallot-infused oil, garnish with a flutter of paprika, and top with the fried shallots. Serve slightly warm or at room temperature with pita chips and/or vegetable sticks.\nSpecial Equipment\n8-inch skillet; 7-quart Dutch oven or heavy-bottomed pot; food processor; colander; strainer or fine-mesh sieve\nNotes\nThe consistency of Bissara should be more or less like hummus, thick enough not to be runny, but still soft and spreadable.\nYou can halve or double this recipe.\nMake-Ahead and Storage\nYou can fry the shallots a day in advance. Refrigerate the shallot-infused oil, and store the fried shallots at room temperature in an airtight container.\nThe bissara can be kept in the fridge in an airtight container for 3 to 5 days. To prevent the dip from oxidizing, press plastic wrap against the surface of the dip.\nEgyptian\nThe Latest\nDips\nMiddle Eastern\nFava Beans",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/egyptian-bissara-split-fava-bean-dip.webp?"
}