{
  "url": "https://www.seriouseats.com/egyptian-fatta-recipe-7109578",
  "image_url": "https://www.seriouseats.com/thmb/yc6Vq9MD_-0wdm8ik9q8lCE6q2E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Serious-Eats_2023MPP_JenCausey_Fatta-210f5de0103646b6b6003090095770fe.jpg",
  "tags": [
    "Egyptian",
    "The Latest",
    "North African",
    "Middle Eastern",
    "Beef"
  ],
  "title": "Egyptian Fatta",
  "full_text": "Egyptian Fatta\nClose\nJump to recipe\nPrep\n20 mins\nCook\n3 hrs 10 mins\nSoaking Time\n30 mins\nTotal\n4 hrs\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Meat and Broth:\n2 1/4\npounds\n(\n1\nkg\n)\nboneless beef chuck\n, trimmed and cut into 1-inch cubes\nKosher salt\n2\ntablespoons\n(\n30\nml)\nghee\n(see note)\n3\nbay leaves\n5\ngreen cardamom\npods\n, lightly crushed\n2\nmastic resins\n, whole (optional; see note)\n10\nwhole\nblack peppercorns\n5\nallspice\nberries\n1\n3-inch\ncinnamon stick\n1\nmedium\nyellow onion\n(\n8\nounces\n,\n225\ng\n), unpeeled, halved lengthwise keeping root intact\n5\nmedium\ncloves garlic\n, unpeeled\n6\ncups\n(\n1.4\nL)\nhot water\n, plus more if needed\n15-20\nparsley\nstalks\n(about\n1.4\nounces\n;\n40\ng\n)\n1/2\nteaspoon\nground cumin\n1/2\nteaspoon\nground coriander\n1/2\nteaspoon\nsweet\npaprika\n1/2\nteaspoon\ncayenne\n(optional)\n1\nbeef bouillon\ncube\n(optional; see note)\nFor the Rice:\n2\ntablespoons\n(\n30\nml\n)\nghee\n(see note)\n2\nbay leaves\n2\ngreen cardamom\npo\nds\n1\nmastic resin\n(optional; see note)\n2\ncups\nuncooked basmati rice\n(\n12.7\nounces\n;\n360\ng\n), soaked for 30 minutes in room-temperature water, then drained and rinsed\n3\ncups\n(\n710\nml\n)\nwarm meat broth\n(recipe above)\nKosher salt\nand\nfreshly ground black pepper\nFor the Toasted Pita:\n4\npita\nbreads\n(roughly\n17\nounces\n;\n480\ng\nin total), cut in 1-inch squares (about\n7\ncups\n)\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\nor\ncanola oil\n, plus more as needed\n1\nteaspoon\ngarlic powder\n1/2\nteaspoon\nsweet\npaprika\n1/2\nteaspoon\nground cumin\n1/2\nteaspoon\nsumac\n(optional)\nKosher salt\nand\nfresh ground black pepper\nFor the Garlic-Vinegar Sauce:\n2\ntablespoons\n(\n30\nml\n)\nghee\n(see note)\n8\nmedium\ncloves garlic\n(\n26\ng\n), minced (about\n2\ntablespoons\n)\n3\ntablespoons\n(\n45\nml\n)\ndistilled white vinegar\n1\ncup\n(\n237\nml\n)\nmeat broth\n(recipe above)\nKosher salt and freshly ground pepper\nto taste\nFor the Tomato Sauce:\n1/2\ncup\n(\n118\nml\n)\ngarlic-vinegar sauce\n(recipe above)\n2\ntablespoons\n(\n30\nml\n)\ntomato paste\nKosher salt\nand\nfreshly ground pepper\nTo Assemble:\n1\ntablespoon\nghee\n(see note)\n1/4\ncup\ntoasted nuts\n, such as\nalmonds\n,\npine nuts\n,\nwalnuts\n, or\ncashews\nDirections\nFor the Meat and Broth:\nSeason beef with salt all over, set aside. In a large heavy bottomed pot or Dutch oven, heat ghee over medium heat until shimmering. Add the bay leaves, cardamom, mastic resin (if using), black peppercorns, allspice, and cinnamon, and cook, stirring constantly, until fragrant, about 30 seconds. Working in batches to avoid crowing the pot, add beef in a single layer (you can leave the whole spices in the pot). Increase heat to medium-high and cook, turning occasionally, until beef is browned all over, about 8 minutes. Transfer to a plate with the whole spices and repeat with remaining beef.\nAdd onion and garlic to the pot and cook over medium-high heat until beginning to blister, about 1 minute.\nReturn beef and whole spices to the pot along with any accumulated juices. Stir in hot water (the water should cover the beef by about 1 inch; if necessary, add additional water) along with parsley stalks, cumin, coriander, paprika, and cayenne. Bring the broth to a boil over medium-high; let boil for 5 minutes.\nReduce heat to medium-low and let the broth simmer gently, uncovered, until the beef is fork-tender and the broth becomes fragrant and laden with flavors, about 2 hours; occasionally skim and discard any fat that rises to the surface. Season with salt and add beef bouillon cube, if desired. Remove from heat and let cool slightly, about 5 minutes.\nStrain the broth through a fine-mesh strainer set over a large heatproof bowl. Transfer the cooked beef cubes to a separate plate, discarding onion, garlic, parsley stalks, and whole spices, then cover broth loosely to keep warm. Transfer the broth to a clean medium saucepan, skimming and discarding any fat on the surface; you should have 4 cups of broth (if necessary, add additional water to reach 4 cups). Cover to keep warm.\nFor the Rice:\nIn a large saucepan, heat ghee over medium heat until shimmering. Add the bay leaves, cardamom, and mastic resin (if using) and cook, stirring constantly, until fragrant and mastic has melted, about 1 minute.\nAdd the rinsed and drained rice and cook, stirring constantly, until the rice is very lightly toasted and evenly coated with the ghee, 2 minutes.\nStir in the meat broth (see note), cover, and bring to a boil over medium-high heat. Cover, reduce heat to low, and cook until rice is tender and water is absorbed, following timing on rice bag instructions.\nRemove from heat, uncover rice, and fluff with a fork, seasoning to taste with salt and pepper; discard cardamom pods and bay leaves. Let stand, uncovered, for 5 minutes (this allows excess steam to escape so the rice remains fluffy). Then cover rice with a clean tea towel to keep it warm until you assemble the fatta.\nFor the Toasted Bread Chips:\nPreheat oven to 400°F (200°C). On a rimmed baking sheet, drizzle pita squares all over with oil. Sprinkle all over with garlic powder, paprika, cumin, and sumac, along with a large pinch of salt and freshly ground black pepper. Toss until evenly coated.\nBake seasoned pita, tossing once halfway through, until crispy and golden, 10 to 15 minutes. Set aside and cover loosely with aluminum foil to keep warm until you assemble the fatta.\nFor the Garlic-Vinegar Sauce:\nIn a small saucepan, heat ghee over medium heat until shimmering. Add minced garlic and cook, stirring constantly, until garlic becomes fragrant and starts to turn golden, 1 to 2 minutes. Immediately whisk in the vinegar, then whisk in the broth and remove from heat.  Season to taste with salt and pepper, then set aside.\nFor the Tomato Sauce:\nIn a small saucepan, heat the 1/2 cup of the garlic-vinegar sauce over medium heat until nearly simmering. Whisk in tomato paste until fully dissolved. Season with salt and pepper and set aside.\nTo Assemble:\nOn a large serving platter, arrange the toasted pita chips in an even layer. Spoon the hot rice on top in an even layer. Drizzle 1/2 cup of hot garlic-vinegar sauce over the rice.\nIn a large skillet, heat ghee over medium-high heat until shimmering. Add cooked beef and cook, stirring occasionally, until heated through, 3 to 5 minutes. Remove from heat and arrange the cooked beef over the rice.\nDrizzle the entire dish with the tomato-garlic sauce. Sprinkle the toasted nuts over the fatta. Serve immediately with the remaining sauces on the side.\nSpecial Equipment\nLarge Dutch oven or heavy-bottomed pot; fine-mesh strainer\nNotes\nGhee is clarified butter and it is the common type of fat used in Egyptian cuisine. If you don't have ghee or clarified butter, you can substitute a neutral oil like canola oil for the searing steps (to avoid scorching of the milk solids in regular butter), though the flavor won't be the same; for steps where searing isn't involved, you can use a 1:1 mix of unsalted butter and neutral oil in place of ghee.\nMastic resin, aka mastica, is a natural extract of the mastic tree, a shrub that grows in Greece. Mastic is used in several savory and sweet Egyptian dishes. Mastic offsets the gamey flavor of poultry and meat in home-cooked dishes and imparts the food with a wonderful and very particular flavor that is difficult to achieve with a substitute.\nThe beef bouillon cube can be a nice addition to easily add a little more depth and umami to the meat, but isn't required.\nThe cooking time of the meat depends on the cut and the quality of the meat itself. The beef stewing cubes I often use in this recipe cook in about 2 hours, while other cuts like beef chuck or lamb shank might need a longer cooking time.\nThe ratio of 3 cups broth to 2 cups rice is generally a good one, but you should defer to the ratio printed on your rice packaging if it differs from this.\nMake-Ahead and Storage\nGiven that fatta has multiple components, I recommend making the broth and beef cubes 1 to 2 days ahead to break up the work. Store them separately in airtight containers in the fridge. In fact, all the fatta’s layers can be cooked ahead and kept in the fridge, and then reheated and assembled right before serving.\nStore leftover fatta in airtight containers for up to 3 days in the fridge and up to 3 weeks in the freezer.\nEgyptian\nThe Latest\nNorth African\nMiddle Eastern\nBeef"
}