{
  "url": "https://www.seriouseats.com/elizabeth-barbones-yeast-raised-pizza-crust",
  "image_url": "https://www.seriouseats.com/thmb/FO61O3VITB-EwgPn-DleP95lXrI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__06__20120606-pizza-crust-c7e9e40f9fd9433c80a0108839ca3689.jpg",
  "tags": [
    "Pizza",
    "Gluten-free"
  ],
  "title": "Gluten-Free Yeast-Raised Pizza Crust",
  "full_text": "Gluten-Free Yeast-Raised Pizza Crust\nClose\nJump to recipe\nPrep\n60 mins\nActive\n15 mins\nTotal\n60 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nDry Ingredients:\n2\ncups\nwhite rice flour\n3/4\ncup\ntapioca starch\n1\ntablespoon\ngranulated sugar\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nsalt\n1\nteaspoon\nxanthan gum\n1 packet (\n2 1/4\nteaspoons\n)\ninstant yeast\nWet Ingredients:\n1/2\ncup\nvery warm\nwater\n(120º to 130ºF)\n2\nlarge\neggs\n2\ntablespoons\nolive oil\n, plus more for brushing\nDirections\nIn a large bowl, whisk together the dry ingredients. In a small bowl, mix together the wet ingredients with a fork or small whisk until combined. Pour the wet ingredients over the dry. Using a wooden spoon, stir to combine until a dough forms. The dough will be on the dry side. This is normal.\nGenerously sprinkle your counter with white rice flour. Turn the dough out onto the counter. Knead the dough until it is smooth. If, after kneading for a minute, the dough is still dry and doesn’t hold together, add a tablespoon more water.\nCenter the dough on a 16 1/2 by 12 1/2-inch piece of parchment paper. Dust the dough generously with white rice flour. Roll out the dough until it covers the parchment paper.\nSet a rimmed baking sheet very close to the rolled-out crust. Grab the corners of one of the long sides of the parchment paper and slide the crust into the pan. Do this quickly.\nLightly brush olive oil over the top of the crust with a pastry brush. Cover the dough completely with plastic wrap. Allow to rise at room temperature for 45 minutes, or until dough is light and slightly puffy.\nTop and bake as directed. If recipe calls for brushing the crust with olive oil, you can skip that step because the crust is already brushed with oil.\nPizza\nGluten-free"
}