{
  "url": "https://www.seriouseats.com/elote-corn-risotto-pancake-riselotes-recipe",
  "image_url": null,
  "tags": [
    "Italian",
    "Mexican",
    "Gluten-free Mains",
    "Vegetarian Mains",
    "Stovetop"
  ],
  "title": "Riselotes al Salto (Elote-Flavored Risotto Pancake) Recipe",
  "full_text": "Riselotes al Salto (Elote-Flavored Risotto Pancake) Recipe\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n1 1/2\nounces\n;\n45\ng\n)\nmayonnaise\n1\ntablespoon\nminced\nchipotle pepper in adobo\n2 1/2\ntablespoons\n(\n35\ng\n)\nunsalted butter\n2\ncups\n(\n475\ng\n) leftover\ncorn risotto\n, fully chilled in the refrigerator\n1/4\ncup\ncrumbled Cotija\nor feta cheese (\n1\nounce\n;\n30\ng\n)\nHandful of\nfresh cilantro leaves\nCayenne pepper\n, to taste\n1\nlime\n, cut into wedges\nDirections\nIn a small bowl, stir together mayonnaise and chipotle. Add mixture to a piping bag, if desired, for fancier presentation.\nLightly grease 2 flat 10- or 11-inch plates. (You can use any oil you have on hand for this, or even some extra butter.) In a well-seasoned 10-inch carbon steel skillet or 10-inch nonstick skillet, melt butter over high heat until foaming. Add risotto and, using a spatula, pat it down to form a round pancake shape.\nContinue cooking over high heat, patting the top and sides to form a compact, pancake-like round and swirling to keep the pancake moving and to avoid hot spots (it should not stick to the pan), until it is very well browned on the first side. (You can tell it's ready when you see that it's browned around the edges.) If the pancake comes apart as you swirl and jiggle it, simply use the spatula to press it back together.\nCarefully slide the pancake out onto one of the prepared plates, then invert the other prepared plate on top of it. In one very quick motion, flip the plates, then lift off the top plate. Very carefully slide the pancake back into the skillet, using the spatula to patch up any spots that were damaged during the flip. Continue cooking, swirling, jiggling, and patting with the spatula, until pancake is well browned on the second side.\nCarefully slide the pancake out onto a warmed serving plate. Top with chipotle mayo, Cotija or feta cheese, cilantro, and cayenne. Finish with a squeeze of fresh lime juice. Serve right away.\nSpecial equipment\n10-inch carbon steel skillet\nor nonstick skillet,\noffset spatula\n, piping bag (optional)\nThis Recipe Appears In\nElotes\nMeet Risotto\nal Salto\nin an All-Star Mashup\nItalian\nMexican\nGluten-free Mains\nVegetarian Mains\nStovetop"
}