{
  "url": "https://www.seriouseats.com/enfrijoladas-corn-tortillas-in-black-bean-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MexfH3lvw5uHQBLWyndTRY40BLY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__09__20120913-127677-LatAmCuisine-Enfrijoladas-PRIMARY-d7e939bec51644fb9f58389b77e6c232.jpg",
  "tags": [
    "Sides",
    "Mexican",
    "Queso Fresco",
    "Quick Sides"
  ],
  "title": "Enfrijoladas (Corn Tortillas in Black Bean Sauce) Recipe",
  "full_text": "Enfrijoladas (Corn Tortillas in Black Bean Sauce) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n20 mins\nSoaking and Cooling Time\n25 mins\nTotal\n55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nlow sodium chicken broth\n3\ndried ancho\nchiles\n3\ngarlic cloves\n, chopped\n8\nounces\nqueso fresco\n(see note)\n1\nsmall\nwhite onion\n, finely chopped\n2\n(16-ounce) cans\nrefried\nblack beans\nSalt\n12\n(6-inch)\ncorn tortillas\n2\ntablespoons\nvegetable oil\n1/2\ncup\ncilantro leaves\nDirections\nAdjust oven racks to upper-middle and lower-middle positions and preheat oven to 450°F.\nBring broth to boil in small saucepan or liquid measuring cup in microwave. Add chiles and soak until softened, about 20 minutes. Transfer chiles (reserving broth) to cutting board, then stem, seed, and coarsely chop.\nIn medium bowl, combine cheese and onion. In blender, purée beans, 1 cup broth, chiles, and garlic until smooth; season to taste with salt. Transfer to large bowl. Stir in enough reserved broth to make bean sauce resemble the texture of hot fudge sauce.\nBrush tortillas on both sides with oil and arrange in single layer on 2 baking sheets. Bake until lightly crisp and golden, about 6 minutes, turning tortillas over with tongs halfway through cooking. Tortillas should still be pliable. Transfer baking sheets to cooling racks.\nSpread 1 cup bean mixture in bottom of 13- by 9-inch baking dish. Using tongs, dip tortillas in bean mixture, 1 at a time, allowing excess to drip back into bowl. Transfer to baking sheet. Repeat procedure with remaining tortillas. Reserve 3/4 cup cheese-onion mixture, then divide the rest evenly among tortillas, sprinkling mixture only on one half of each tortilla. Fold tortillas over and transfer to prepared baking dish, overlapping slightly.\nReserve 3/4 cup cheese-onion mixture, then divide the rest evenly among tortillas, sprinkling mixture only on one half of each tortilla. Fold tortillas over and transfer to prepared baking dish, overlapping slightly.\nWith rubber spatula, scrape any of the bean mixture from the baking sheets into the sauce in the bowl. Pour remaining bean mixture over tortillas. Cover baking dish with foil and bake just to warm through, 5 to 7 minutes. Transfer to cooling rack and allow to set about 3 minutes. Remove foil, sprinkle enfrijoladas with remaining cheese-onion mixture and cilantro. Serve immediately (see note).\nSpecial equipment\nsmall saucepan or liquid measuring and microwave, blender, rubber spatula, pastry brush, 2 rimmed baking sheets, 2 cooling racks, tongs, 13- by 9-inch baking dish, foil\nSides\nMexican\nQueso Fresco\nQuick Sides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/enfrijoladas-corn-tortillas-in-black-bean-sauce-recipe.webp?"
}