{
  "url": "https://www.seriouseats.com/ensalada-de-tomate-con-ventresca-de-atun-spanish-style-tomato-and-ventresca-tuna-salad",
  "image_url": "https://www.seriouseats.com/thmb/DL7pATFHsIaUOAyh3WmR3OgMhds=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__08__20200829-Spanish-Style-Tomato-Tuna-Salad-sasha-marx-d4a5b132978b42289834e134ab3fbf14.jpg",
  "tags": [
    "Seafood Salad",
    "Spanish",
    "Gluten-free Salads",
    "No-Cook",
    "Tuna"
  ],
  "title": "Ensalada de Tomate con Ventresca de Atún (Spanish-Style Tomato and Ventresca Tuna Salad) Recipe",
  "full_text": "Ensalada de Tomate con Ventresca de Atún (Spanish-Style Tomato and Ventresca Tuna Salad) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nActive\n10 mins\nTotal\n10 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n450\ng\n) ripe\nbeefsteak tomatoes\nCoarse sea salt\nsuch as Maldon or fleur de sel\n3\nounces\n(85g)\nolive oil-packed ventresca tuna\n(from one 3.88-ounce (110g) can), drained and gently flaked into 2-inch pieces (see notes)\n1\nounce\n(30g)\nquick-pickled onions or shallots\n, sliced\npickled ramps\n,\nrapid-pickled onions\n, or\nthinly sliced raw onion\n(see notes)\n3\ntablespoons\n(45ml)\nextra-virgin olive oil\n(see notes)\nCrusty bread\n, for serving\nDirections\nUsing a sharp chef's knife or serrated knife, cut tomatoes into wedges or 1/2-inch-thick slices, removing and discarding cores, and spread over a large serving plate in a single layer. Season with sea salt to taste. Arrange flakes of tuna between and on top of tomatoes, followed by pickled or raw onions (or shallots or ramps, if using). Drizzle olive oil over and around salad so that it pools around the tomatoes. Serve immediately with plenty of sliced crusty bread.\nNotes\nBecause this dish is comprised of just a few ingredients, it's at its best when made with high quality products, and the quality of the tuna you use will make a difference here. We recommend oil-packed ventresca tuna, which comes from the richer, fatty belly; it's moister and more flavorful than other canned or jarred tuna. We like the ventresca from both Ortiz and Tonnino, two widely available brands.\nWhether you use pickled or raw onion for this recipe comes down to personal preference and tolerance for the pungent bite of raw allium. Both work well in this dish. If you are using raw onion, seek out spring onions if they are in season. If using pickled onions or ramps, you can drizzle the salad with a little bit of the pickling liquid for extra acidity, along with olive oil.\nUse the best olive oil you have. This is the perfect time to bust out that special bottle you were gifted a while ago and have been hoarding (or forgot about) in your cupboard.\nMake-Ahead and Storage\nThis salad is best enjoyed immediately. Fortunately, it's so quick and easy to make that there's no reason to make it ahead of time.\nSeafood Salad\nSpanish\nGluten-free Salads\nNo-Cook\nTuna",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ensalada-de-tomate-con-ventresca-de-atn-spanish-style-tomato-and-ventresca-tuna-salad-recipe.webp?"
}