{
  "url": "https://www.seriouseats.com/epic-new-york-cheesecake-from-bravetart",
  "image_url": null,
  "tags": [
    "Cheesecakes",
    "Cakes",
    "American",
    "Cherry",
    "Summer Desserts"
  ],
  "title": "BraveTart's Epic New York Cheesecake",
  "full_text": "BraveTart's Epic New York Cheesecake\nJump to recipe\nPrep\n105 mins\nCook\n65 mins\nActive\nAbout 60 mins\nChilling\n12 hrs\nTotal\n14 hrs 50 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Graham Cracker Crust:\n7\nounces\ngraham cracker crumbs\n, store-bought or homemade, see note (about 1 3/4 cups; 200g)\n1\nounce\nunsalted butter\n, melted (about 2 tablespoons; 30g)\nPinch\nof\nsalt\nFor the Cheesecake:\n32\nounces\nfull-fat\ncream cheese\n, such as\nPhiladelphia\n, brought to about 70°F/21°C (about 4 cups; 905g)\n8\nounces\nfresh goat cheese\n(not pre-crumbled), brought to about 70°F/21°C (about 1 cup; 225g)\n1/2 ounce\nlemon juice\n, freshly squeezed (about\n1\ntablespoon\n; 15g)\n1/2\nounce\nvanilla extract\n(about 1 tablespoon; 15g)\n1/4\nteaspoon\n(1g) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\norange flower water\n14 ounces plain or\ntoasted\nsugar\n(about\n2\ncups\n; 395g)\n6\nlarge\neggs\n(about 10 1/2 ounces; 300g)\n6\nounces\nheavy cream\n(about 3/4 cup; 170g)\nTo Serve:\n16\nounces\n(volume will vary; 455g) fresh fruit, such as pitted and halved cherries,\nblueberries\n, sliced peaches, small strawberries, or some assortment thereof, optional\n1 recipe (about\n1/2\ncup\n) complementary\nfruit\nsyrup\nor\njelly\n, for saucing the fruit, optional\nDirections\nGetting Ready:\nThis recipe requires an 8- by 4-inch non-reactive aluminum pan, preferably a non-latching, two-piece style; this style can be difficult to find, but\nthis pan\nwas manufactured especially for this recipe. Otherwise, a traditional cake pan of those dimensions will work, with a touch more effort to unmold. Of course, cheesecake can be baked in any size or style of pan, but the volume of batter, bake temperatures, and times will require individual adjustments which have not been tested here.\nSerious Eats / Vicky Wasik\nIf using a two-piece pan, wrap the bottom piece in foil before assembly, then tear away the excess so the pan sits flat. If using a traditional cake pan, line the bottom with a parchment round (explanation and tutorial\nhere\n). In either case, lightly grease the pan.\nSerious Eats / Vicky Wasik\nFor the Graham Cracker Crust:\nAdd the graham cracker crumbs, melted butter, and salt to the pan, and stir with a fork until well combined. If needed, season to taste with additional salt. With your fingers, compress into an even layer along the bottom of the pan.\nSerious Eats / Vicky Wasik\nFor the Cheesecake:\nAdjust the oven rack to the middle position and preheat to 450°F (230°C). Combine cream cheese, goat cheese, lemon juice, vanilla extract, salt, and orange flower water in the bowl of a stand mixer fitted with a paddle attachment. Do not add the sugar at this time. Mix on low until roughly combined, then increase to medium and cream until no lumps of cheese remain, and the mixture is perfectly smooth; about 5 minutes. Halfway through, pause to scrape the bowl and beater with a flexible spatula.\nSerious Eats / Vicky Wasik\nReduce speed to medium-low, add the sugar all at once, and mix only until well combined. Remove the bowl from the stand mixer and place a single-mesh sieve over the bowl, then crack in the eggs, and whisk until they pass through. Discard any clots of chalazae that remain trapped in the strainer. Resume mixing on low until well combined, then scrape the bowl and beater once more.\nSerious Eats / Vicky Wasik\nIn a 1-quart stainless steel pot, bring the cream to a full boil. While mixing on low, add the hot cream all at once in a steady stream, and mix a few seconds more. This warms the batter, which helps release any air pockets introduced in mixing while reducing the overall bake time. Use immediately, or refrigerate the batter in an airtight container until needed, up to one week. Bring cold batter to room temperature before baking.\nSerious Eats / Vicky Wasik\nPour batter into the prepared pan and place on a baking sheet. Bounce a spoon across the surface to dislodge any air bubbles that may have slipped through. If you don't see any, no need to continue. If you do notice a few rising up, keep bouncing the spoon until they're gone. Bake until the cheesecake is puffed and dry to the touch around the edges, about 20 minutes. In most ovens, the cheesecake will also begin to brown, forming golden patches along the surface, deepening its flavor. If needed, rotate the baking sheet to ensure even browning. Alternatively, for a denser, paler cheesecake, skip to the next step and bake only at 250°F (120°C) until done; this may take an hour or more.\nSerious Eats / Vicky Wasik\nTurn off the oven, open the door, and let it stand ajar 10 minutes. Close the door and set the oven to 250°F (120°C). Continue baking until the outer edge of the cheesecake feels firm, though the innermost ring of cheesecake will wobble quite freely if you shake the pan, about 35 minutes. This wobbly zone should be no more than 3-inches across. The cheesecake will be done when the very center registers 145°F (63°C) on a digital thermometer inserted to a depth of 2-inches. Testing with a thermometer will not cause the cheesecake to crack; cracking is the result of over-baking and nothing more.\nSerious Eats / Vicky Wasik\nLet the cheesecake cool for 15 minutes, then run a thin knife or offset spatula around the sides to loosen (this helps the cake settle evenly as it cools). Continue letting it cool at room temperature for at least 1 hour (or up to 4) before covering it to refrigerate until cold to the core, at least 12 hours.\nSerious Eats / Vicky Wasik\nUnmolding the Cheesecake From a Loose Bottom Cake Pan:\nLoosen the sides of the cheesecake from the pan with a thin knife or offset spatula. Place the pan on a large can of tomatoes or a similarly sized object; something tall enough to lift the cheesecake 4-inches from the counter, and wide enough to form a stable base. With both hands on the sides of the pan, pull downward to drop the outer ring away from the bottom. Place the cake onto a flat work surface, loosen it from the bottom of the pan with an offset spatula, and transfer to a large, flat serving plate. Cover with plastic and refrigerate until needed, up to 10 days.\nSerious Eats / Vicky Wasik\nUnmolding the Cheesecake From a Traditional Cake Pan:\nLoosen the sides of the cheesecake from the pan with a thin knife or offset spatula. Stand the cake in a few inches of scalding hot water until the pan feels warm (a roasting pan works well for this). Drape the cake in plastic wrap to protect its surface, then invert onto a large, flat plate, and lift the pan to pull it away. It should slide free without any resistance; if not, continue standing in hot water a few minutes more. After removing the pan, peel the parchment from the crust, and re-invert the cheesecake onto a serving plate. Cover with plastic and refrigerate until needed, up to 10 days.\nTo Serve:\nCombine the fresh fruit and warmed fruit syrup or jam in a large bowl, and gently fold with a flexible spatula until the fruit is well coated and glistening (optional). Cut the cheesecake with a large chef's knife dipped in hot water; for clean and tidy portions of cheesecake, pause to clean the blade under hot running water between each slice. Top with spoonfuls of the sauced fruit, if using, or other toppings and sauces as desired.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nOne 8- by 4-inch non-reactive loose bottom pan\n,\nstand mixer\n,\nnonreactive fine-mesh strainer\n, flexible spatula\nNotes\nThis recipe was developed with the homemade graham crackers from\nBraveTart: Iconic American Desserts\nin mind, but will work well with your favorite brand from the store. Alternatively, it can be made with homemade or store bought Biscoff cookies as well (if you're feeling ambitious, try making our\nBiscoff-style speculoos cookies\n). Gluten free alternatives to any of these cracker or cookie styles will work equally well.\nPlease bear in mind that the times listed in any recipe are only a guideline (hence the word \"about\") and keep a close eye on the cheesecake as it bakes, checking its temperature as needed to keep it safe.\nMake-Ahead and Storage\nIn an airtight container, the cheesecake batter can be refrigerated up to one week; bring cold batter to room temperature before baking pouring into the pan. Wrapped in plastic, the finished cheesecake will keep well for about 10 days in the fridge.\nRead More\nLemon-Ricotta Cheesecake\nBasque Cheesecake\nSweet Potato Cheesecake With Maple Walnut Caramel Sauce\nCheesecakes\nCakes\nAmerican\nCherry\nSummer Desserts"
}