{
  "url": "https://www.seriouseats.com/erdapfelsalat-austrian-style-potato-salad-recipe",
  "image_url": null,
  "tags": [
    "Western European",
    "Austrian",
    "Yukon Gold Potatoes",
    "Vegetable Sides",
    "Easter Side Dishes"
  ],
  "title": "Erdäpfelsalat (Austrian-Style Potato Salad)",
  "full_text": "Erdäpfelsalat (Austrian-Style Potato Salad)\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n25 mins\nResting Time\n30 mins\nTotal\n65 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(1kg)\nYukon Gold potatoes\n, peeled, quartered, and cut into 1/2-inch-thick slices, peels reserved separately (see note)\nKosher salt\n3\ntablespoons\n(45ml)\nwhite wine vinegar\n, divided, plus more to taste\n1/4\ncup\n(60ml)\nextra-virgin olive oil\n1\ntablespoon\n(15ml)\nDijon mustard\n3/4 cup (\n90\ng\n) minced\nred onion\n, from about 1 small onion\n2\ntablespoons\n(6g) minced fresh\nchives\n1/2\ncup\n(120ml)\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\nteaspoons\n(about 10g)\nsugar\nFreshly ground\nwhite or\nblack pepper\nDirections\nPlace sliced potatoes in a large saucier or Dutch oven and cover with water. Season generously with salt. Place potato skins in a fine-mesh strainer and place on top of pot. Add just enough water to submerge potato skins. Bring to a boil over high heat and simmer until potatoes are tender, about 15 minutes.\nSerious Eats / J. Kenji López-Alt\nDiscard potato skins, drain potatoes, and transfer to a rimmed baking sheet. Immediately sprinkle with 2 tablespoons (30ml) vinegar and set aside to cool. When they are cool enough to handle, transfer potatoes to a large bowl.\nSerious Eats / J. Kenji López-Alt\nAdd remaining vinegar, olive oil, mustard, red onion, chives, chicken stock, and sugar. Using a rubber spatula or wooden spoon, roughly stir and fold mixture so that potatoes release some starch and liquid begins to thicken a little. Season to taste with more salt and white or black pepper. Set aside to rest for at least 30 minutes and up to overnight. (If resting longer than 4 hours, cover bowl and transfer to refrigerator.) Stir again vigorously to thicken dressing; it should have a loose but not soupy consistency. If it's too thick, thin it out with a little extra water or chicken stock and re-season. Serve cold or at room temperature.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nLarge saucier\nor\nDutch oven\n,\nfine-mesh strainer\n,\nhalf-sheet pan\nNotes\nFor the best flavor, store your potatoes in a bag in the refrigerator for 2 to 3 weeks before using them in this recipe, in order to allow natural sugars to build up.\nWestern European\nAustrian\nYukon Gold Potatoes\nVegetable Sides\nEaster Side Dishes"
}