{
  "url": "https://www.seriouseats.com/ewa-riro-nigerian-stewed-beans-recipe-8594156",
  "image_url": "https://www.seriouseats.com/thmb/A1i7yOZZ70_E5hHrwtxb3hiED1w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240223-SEA-Ewa-Riro-MaureenCelestine-hero-c52b1a2b256449f18adab4f27a20c36f.jpg",
  "tags": [
    "Braised & Stewed Beans",
    "The Latest",
    "Nigerian"
  ],
  "title": "Ewa Riro (Nigerian Stewed Beans)",
  "full_text": "Ewa Riro (Nigerian Stewed Beans)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n110 mins\nSoak Time\n4 hrs\nTotal\n6 hrs\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n454\ng\n)\ndried black-eyed peas\n, picked over and rinsed\nKosher\nsalt\n2\nsmall\nr\ned onions\n(about 8 ounces; 226g), 1/2 onion thinly sliced and the remaining 1 1/2 onions roughly chopped\n2\nmedium\nred bell peppers\nor 2 red shepherd peppers (7 ounces; 200g), stemmed, seeded, and roughly chopped (see note)\n2\nplum tomatoes\n(about 10 ounces;\n300\ng\n), cored and roughly chopped\n3/4 cup (\n180\nml\n) unrefined red\npalm oil\n2/3 cup (\n60\ng)\nground crayfish,\ndivided (optional, see notes)\n1\nScotch bonnet or\nhabanero pepper\n,\nleft whole\nand poked all over with a skewer or toothpick for a less spicy result, or stemmed, seeded, and minced for a more spicy result\nNigerian\nred dry\npepper,\nto taste (optional, see notes)\nDirections\nIn a large pot, cover beans with cold water by at least 2 inches. Cover and leave to soak for at least 4 and up to 12 hours.\nSerious Eats / Maureen Celestine\nDrain the beans, then rinse with cold water. Return to pot, top with at least 2 inches of fresh cold water, and stir in 2 tablespoons kosher salt. Bring to a boil over high heat. Reduce heat to low and simmer until beans are soft enough to squish between your fingers but still retain their shape, about 1 hour (note that cooking times can vary depending on age and source of beans); top up with additional boiling water at any point if level gets too low. Drain beans, reserving the cooking liquid, and set aside.\nSerious Eats / Maureen Celestine\nMeanwhile, in a blender or food processor, process the roughly chopped onions, shepherd or bell peppers, tomatoes, and 1/2 cup (120ml) water on high until a smooth puree forms, stopping to scrape down sides as necessary. Set vegetable purée aside.\nSerious Eats / Maureen Celestine\nIn a large heavy-bottomed pan, heat palm oil over medium to high heat until lightly smoking and fragrant. Add thinly sliced onion, season generously with salt, and cook, stirring often, until onion is softened but not browned, about 3 minutes. Stir in 1/3 cup ground crayfish, if using, and continue to cook, stirring, until aromatic and the crayfish fries slightly, 2 to 3 minutes.\nSerious Eat / Maureen Celestine\nAdd Scotch bonnet or habanero pepper (if using whole, add the entire pepper; if using minced, start with 1/4 teaspoon, then add more to taste). Continue to cook, stirring often, until chile pepper has softened slightly, 2 to 3 minutes.\nStir in reserved vegetable purée, then increase heat to high and bring to a boil, stirring occasionally. Reduce heat to medium, partially cover, and continue to cook, stirring occasionally, until thickened slightly and a light web of oil droplets form on the surface, about 10 minutes.\nSerious Eats / Maureen Celestine\nStir in cooked beans and the remaining 1/3 cup ground crayfish, if using; cover, reduce heat to low and simmer for 10 minutes to allow the flavors to meld. Season with salt and red dry pepper, if desired.\nSerious Eats / Maureen Celestine\nAt this point, you can either continue to the next step, or, if a thicker texture is desired, use a wooden spoon to mash some of the beans against the side of the pot or an immersion blender to purée a portion of the beans; how much you mash or purée, if it all, will determine how creamy the final dish is.\nSerious Eats / Maureen Celestine\nContinue to cook, covered, stirring and scraping the bottom every once or twice to prevent scorching, until the stew thickens some more and begins to dry at the bottom, about 20 minutes. (If you prefer the beans looser, either don't cook for as long or stir in some of the reserved bean liquid in 1/4 cup increments until you reach your desired consistency). Remove from heat and let stand to allow flavors to develop, about 10 minutes, then serve.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nFood processor or countertop blender\nNotes\nFor the beans:\nIf you don’t have time to soak the beans overnight, use this quick-soak method: Put the rinsed beans in a large pot, add enough water to cover by a couple inches, and bring to a boil over high heat. Remove from the heat and let stand, covered, for 30 minutes to 1 hour. Drain, rinse, then continue by cooking beans as directed.\nFor a quicker method, drained and rinsed canned black-eyed peas can be used instead of dried. You’ll need three 15-ounce cans to replace the dried beans called for i this recipe.\nFeel free to substitute other cowpeas or other types of beans such as navy beans or cannellini\nRed shepherd peppers are sweet, long, thin-skinned Italian peppers, similar to Nigerian tatashe peppers. They have great flavor and bring a deep red color to\njollof rice\n. If you can't find them, red bell peppers can be used instead.\nGround crayfish is made from krill, shrimps, and small prawns that are often sun-dried and smoked. You can find it whole or ground in many West African stores and online. You can replace ground crayfish with an equal volume of dried prawns or shrimp, which are available in Chinese or Asian markets.\nWhile not traditional, you can substitute the fermented, smoky, seafood essence of crayfish with  ground katsuobushi or bonito flakes or nori flakes—they add a different but enjoyable flavor if you don't have the ground crayfish available. If using one of these other ingredients, start with half the amount of crayfish, and adjust to taste.\nNigerian red dry pepper is made from ground chiles. Cayenne pepper is the closest substitute. You can also use chile flakes, gochugaru, or other ground chiles you like.\nMake-Ahead and Storage\nMake the plain beans up to 3 days ahead, separating the cooked beans from the bean liquid. Refrigerate both for up to 3 days, or freeze for up to 3 months; thaw overnight in the refrigerator if frozen.\nRefrigerate the cooked, stewed beans in airtight containers for up to 3 days, or freeze for up to 3 months.\nBraised & Stewed Beans\nThe Latest\nNigerian"
}