{
  "url": "https://www.seriouseats.com/extra-hot-yucatan-style-salsa-recipe",
  "image_url": "https://www.seriouseats.com/thmb/mmz9oG-na2xpBCU3YwTU3rLVrDM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160507-habanero-salsa-yucatan-09-f47ee8c0a5f7418f8d4e3caf8785444f.jpg",
  "tags": [
    "Salsa",
    "Mexican",
    "Chile Pepper",
    "Cinco de Mayo"
  ],
  "title": "Extra-Hot Yucatán-Style Roasted-Habanero Salsa (Chile Tamulado) Recipe",
  "full_text": "Extra-Hot Yucatán-Style Roasted-Habanero Salsa (Chile Tamulado) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n30 mins\nServes\n6 servings\nMakes\n3/4 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole head\ngarlic\n, split into cloves, cloves left unpeeled\n24 whole\nhabanero chiles\n(about 6 ounces;\n170\ng\n) (see notes)\n2\ntablespoons\njuice from 1 grapefruit\n(1 ounce; 30ml) (see notes)\n2\ntablespoons\njuice from 1 orange\n(1 ounce; 30ml) (see notes)\n2\ntablespoons\njuice from 2 limes\n(1 ounce; 30ml) (see notes)\nSalt\nDirections\nThread garlic cloves on a metal skewer and roast directly over a gas flame until well charred on all surfaces, about 5 minutes. Alternatively, roast in a dry skillet over medium-high heat, tossing, until charred on most surfaces, about 5 minutes. Transfer to a bowl until cool enough to handle, then peel blackened skins and discard.\nRoast habaneros in a dry skillet over medium-high heat, tossing, until charred on most surfaces, about 5 minutes. Transfer to a bowl and allow to cool. When cool enough to handle, pick out stems and discard. (See note; you may want to use gloves for this task.)\nCombine peeled garlic, habaneros, and grapefruit, orange, and lime juice in a blender or molcajete. Blend or pound until a smooth but still pulpy consistency is reached. Be very careful when opening blender or pounding in molcajete to avoid getting liquid or vapors near your eyes and nose. (It will burn your eyes and make you cough/sneeze.)\nTransfer salsa to a bowl, let rest for 15 minutes, then season to taste with salt. Salsa can be stored in a sealed container in the refrigerator for up to 2 weeks.\nSpecial equipment\nBlender or\nmolcajete\nNotes\nHabanero peppers are extremely hot, so use caution when handling. Wear gloves if you have sensitive skin, and scrub your cutting board, knives, and blender or molcajete very thoroughly after working with the habaneros. This salsa is typically made with green habaneros, but ripe orange habaneros will work fine. Scotch bonnets can be used in place of habaneros if you can't find them. Seville oranges are sometimes available in Latin markets. If available, use 6 tablespoons Seville orange juice in place of the grapefruit, lime, and orange juice combination.\nThis Recipe Appears In\n3 Simple Yucatán-Style Condiments to Spice Up Taco Night\nSalsa\nMexican\nChile Pepper\nCinco de Mayo",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/extra-hot-yucatn-style-roasted-habanero-salsa-chile-tamulado-recipe.webp?"
}