{
  "url": "https://www.seriouseats.com/extra-flaky-scallion-pancakes-recipe",
  "image_url": null,
  "tags": [
    "Chinese",
    "Chinese-American",
    "Vegan Snacks & Appetizers",
    "Vegetarian Sides",
    "Vegetarian Snacks & Appetizers"
  ],
  "title": "Extra-Flaky Scallion Pancakes Recipe",
  "full_text": "Extra-Flaky Scallion Pancakes Recipe\nJump to recipe\nPrep\n35 mins\nCook\n20 mins\nActive\n30 mins\nResting Time\n30 mins\nTotal\n85 mins\nServes\n4 pancakes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pancakes:\n2\ncups\nall-purpose flour\n, plus extra for dusting work surface\n1\ncup\nboiling water\nUp to\n1/4\ncup\ntoasted sesame seed oil\n2\ncups\nthinly sliced scallions\nFor the Dipping Sauce:\n2\ntablespoons\nsoy sauce\n2\ntablespoons\nChinkiang\nor\nrice wine vinegar\n1\ntablespoon\nfinely sliced scallion greens\n1/2\nteaspoon\ngrated fresh ginger\n2\nteaspoons\nsugar\nTo Cook:\n1/4\ncup\nvegetable oil\nKosher salt\nDirections\nPlace flour in bowl of food processor. With processor running, slowly drizzle in about 3/4 of the boiling water. Process for 15 seconds. If dough does not come together and ride around the blade, drizzle in more water a tablespoon at a time until it just comes together. (Alternatively, in a large bowl add flour and 3/4 of the boiling water. Stir with a wooden spoon or chopsticks until dough comes together, adding water a tablespoon at a time as needed.) Transfer to a floured work surface and knead a few times to form a smooth ball. Transfer to a bowl, cover with a damp towel or plastic wrap, and allow to rest for 30 minutes at room temperature, or up to overnight in the fridge.\nSerious Eats / Mateja Zvirotic Andrijanic\nDivide dough into four even pieces and shape each into a smooth ball. Working one ball at a time, roll out into a disk roughly 8-inches in diameter on a lightly floured surface. Using a pastry brush, paint a very thin layer of sesame oil over the top of the disk. Roll disk up like a jelly roll, then twist roll into a tight spiral, tucking the end underneath. Flatten gently with your hand, then re-roll into an 8-inch disk.\nSerious Eats / Mateja Zvirotic Andrijanic\nSerious Eats / Mateja Zvirotic Andrijanic\nPaint with another layer of sesame oil, sprinkle with 1/2 cup scallions, and roll up like a jelly roll again. Twist into a spiral, flatten gently, and re-roll into a 7-inch disk. Repeat steps two and three with remaining dough balls.\nSerious Eats / Mateja Zvirotic Andrijanic\nSerious Eats / Mateja Zvirotic Andrijanic\nIn a small bowl, whisk together sauce ingredients and set aside at room temperature.\nSerious Eats / Mateja Zvirotic Andrijanic\nHeat oil in an 8-inch nonstick, carbon steel, or cast-iron pan over medium-high heat until shimmering. Carefully slip pancake into hot oil. Cook, shaking pan gently, until first side is an even golden brown (about 2 minutes). Carefully flip with tongs (be careful not to splash the oil), and continue to cook, shaking pan gently, until second side is an even golden brown (about 2 minutes longer). Transfer to a paper towel-lined plate to drain. Season with salt and cut into 6 wedges. Repeat with remaining 3 pancakes. Serve immediately with dipping sauce.\nSerious Eats / Mateja Zvirotic Andrijanic\nSpecial Equipment\nFood processor\n,\ncast iron pan\nor\nnon-stick pan\nRead More\nSerious Entertaining: A Dim Sum-Inspired Chinese Food Party\nGrilled Scallion Pancakes Recipe\nSourdough Dashi Scallion Pancakes Recipe\nCrispy Kimchi Pancakes With Shrimp Recipe\nCrispy Bulgogi-Filled Scallion Pancakes Recipe\nChinese\nChinese-American\nVegan Snacks & Appetizers\nVegetarian Sides\nVegetarian Snacks & Appetizers"
}