{
  "url": "https://www.seriouseats.com/extra-crispy-bar-style-tortilla-pizza-recipe",
  "image_url": null,
  "tags": [
    "Pizza",
    "Mozzarella",
    "Tomato",
    "Snacks & Appetizers"
  ],
  "title": "Extra-Crispy Bar-Style Tortilla Pizza",
  "full_text": "Extra-Crispy Bar-Style Tortilla Pizza\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n5 mins\nTotal\n15 mins\nServes\n1\nto 2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nteaspoon\nextra-virgin olive oil\n, plus more for drizzling\n1 (\n10\n-\ninch\n)\nflour tortilla\n1/4\ncup\n(60ml) store-bought or\nhomemade\npizza sauce\n1 1/2 ounces (\n45\ng\n) shredded\nwhole milk low-moisture mozzarella cheese\n1 ounce (\n30\ng\n)\nfinely grated Parmesan cheese\n, divided\nKosher salt\n2\nfresh basil\nleaves\n, roughly torn, plus more for garnish\nDirections\nAdjust oven rack to 6 to 8 inches below broiler element and preheat broiler to high. Heat oil in a large cast iron skillet over high heat until shimmering. Reduce heat to medium-low and wipe out excess oil with a paper towel.\nSerious Eats / Liz Clayman\nPlace tortilla in skillet with the rougher textured-side facing down. Spread sauce evenly over tortilla all the way to the edges. Spread mozzarella and half of Parmesan evenly over tortilla all the way to the edges. Season lightly with salt. Scatter with basil and drizzle with olive oil. (Alternatively, save all of the basil for a fresh garnish.)\nSerious Eats / Liz Clayman\nPlace skillet under broiler and broil until cheese is melted and starting to brown in spots, 2 to 4 minutes. Remove from oven and sprinkle with remaining Parmesan. Using a small metal spatula, gently pry edges of pizza loose, releasing the cheese from the skillet. Peek under bottom. If more crispness is desired, place skillet over medium heat and cook, swirling pizza and peeking occasionally, until desired crispness is achieved. Slide pizza out onto a cutting board. Garnish with additional fresh basil leaves, if desired. Cut and serve immediately.\nSerious Eats / Liz Clayman\nSpecial Equipment\n10-inch cast-iron skillet\nMake-Ahead and Storage\nThis pizza is best enjoyed right away.\nRead More\nExtra-Crispy Bar-Style Tortilla Pizza Supreme\nCrispy Bar-Style Pizza\nBar-Style Tarte Flambée (Alsatian Pizza With Fresh Cheese, Onions, and Bacon)\nMatzo Pizza Recipe\nPizza\nMozzarella\nTomato\nSnacks & Appetizers"
}