{
  "url": "https://www.seriouseats.com/extra-crispy-fried-chicken-with-caramelized-honey-and-spice",
  "image_url": null,
  "tags": [
    "Fried Chicken",
    "Chicken",
    "Soul Food & Southern",
    "Whole Chicken",
    "Buttermilk"
  ],
  "title": "Extra-Crispy Fried Chicken With Caramelized Honey and Spice Recipe",
  "full_text": "Extra-Crispy Fried Chicken With Caramelized Honey and Spice Recipe\nJump to recipe\nPrep\n4 mins\nCook\n10 mins\nActive\n2 hrs\nTotal\n14 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Buttermilk Brine:\nOne\n2 1/2– to 3 1/2\n–\npound\n(1.1 to 1.6kg)\nchicken\n2 1/4\ncups\n(540g)\nbuttermilk\n1/2\ncup\n(130g)\nFrank's RedHot hot sauce\n1\nteaspoon\n(4g)\ngarlic powder\n1\nteaspoon\n(4g)\nonion powder\n1/2\nteaspoon\n(2g) freshly\nground black pepper\n2\nteaspoons\n(8g)\nkosher salt\n(see notes)\nFor Frying:\n5\ncups\n(1.1kg) peanut or\nsafflower oil\n2 1/2 cups (\n375\ng\n)\nItalian 00 flour\n(see notes)\n2 teaspoons (\n8\ng\n)\nkosher salt\n, plus more for seasoning\nFor the Honey-Butter Drizzle:\n1/3 cup (\n120\ng\n)\nclover honey\n2\ntablespoons\n(30g)\nwater\n3 1/2 tablespoons (\n50\ng\n)\nbutter\nFor the Spice Dust:\n10\nárbo\nl\nchiles\n(about 6g)\n12\nKashmiri red\nchiles\n(18g)\n2\npieces\n(2g)\nstar anise\n1\nblack cardamom pod\n(\n2\ng\n), inner seeds only\nOne 2-inch piece\ncinnamon\n(\n4\ng\n)\n1 teaspoon (\n2\ng\n)\ncumin seeds\n1 tablespoon (\n5\ng\n)\nSichuan peppercorns\n2 tablespoons (\n6\ng\n)\nporcini mushroom powder\nTo Serve (Optional, but Recommended!):\nButtermilk Vanilla Waffles\nDirections\nTo Prepare and Brine the Chicken:\nUsing a chef's knife,\nbreak the chicken down\ninto 2 drumsticks, 2 thighs, and 2 wings, and divide each breast half in half (making 4 breast pieces in total); leave all pieces bone-in. Split backbone crosswise into 2 pieces and reserve the neck if you choose to fry it as well. (Both the backbone and the neck are optional pieces with very little meat, but fried-chicken-crust lovers will adore them.)\nIn a large lidded container or mixing bowl, whisk together buttermilk, hot sauce, garlic powder, onion powder, black pepper, and salt. Add chicken to buttermilk brine, making sure it is fully coated and submerged; cover with lid or plastic wrap. Alternatively, you can place the brine and chicken in a heavy-duty zipper-lock bag and place the bag in a dish to catch any leaks. Place in refrigerator and marinate overnight for at least 8 hours and no more than 12 hours.\nFor Frying:\nFill a 12-inch cast iron skillet with oil. (If using a skillet of a different size, increase or reduce the amount of oil to fill it halfway up.) Attach a clip-on thermometer and preheat the oil to 325°F (163°C), keeping the burner at medium-high heat. Line one sheet tray with paper towels and set a wire rack in another sheet tray.\nWhisk together the 00 flour and salt. Drizzle 2 tablespoons of buttermilk brine into the flour and gently toss. Working with one piece of chicken at a time, lift chicken from buttermilk and immediately place it in flour with your \"wet\" hand. Using your other, \"dry\" hand, bury the chicken and press flour into all sides, packing tightly to form large clumps of flour coating each piece. Lift chicken out of flour and shake to remove any loose flour before placing into the hot oil. Proceed with remaining pieces, first frying the legs and thighs in one batch, then frying the breast, wings, and backbone (if using) in the second.\nSerious Eats / Vicky Wasik\nOnce the chicken is added to the oil, the temperature will drop to between 250 and 275°F (121 and 135°C). Do not increase the heat to compensate; just allow the oil temperature to gradually return to 325°F (163°C) as the chicken cooks. The temperature should be up to 300°F (148°C) after 10 minutes; if not, increase the heat. Fry, turning, until deeply golden brown all over, with extra-dark bits where the chicken makes contact with the pan, about 8 minutes per side for legs and thighs and about 6 minutes per side for wings, breasts, and backbones.\nSerious Eats / Vicky Wasik\nAs each piece of chicken is ready, remove from oil to the paper towel–lined sheet tray and season immediately with kosher salt. Transfer chicken to wire rack to rest.\nMeanwhile, for the Honey-Butter Drizzle:\nAdd honey to a 1-quart saucepan and caramelize over medium-high heat until deep, nutty brown, with an aroma of burnt sugar. Remove from heat and add water. Return to heat and add butter, stirring until incorporated. Set aside.\nSerious Eats / Vicky Wasik\nFor the Spice Dust:\nRemove stems and seeds from chiles by cutting them open with kitchen shears over a wire rack set over a sheet tray. In a small sauté pan over medium heat, toast chiles until fragrant, warm to the touch, and pliable. Set aside. In the same pan, toast star anise, cardamom, and cinnamon for 30 seconds before adding cumin and Sichuan peppercorns. Toast until fragrant and warm to the touch. In a spice grinder, grind toasted chiles and spices together until fine. Mix in mushroom powder. Set aside.\nSerious Eats / Vicky Wasik\nTo Serve:\nJust before serving, drizzle each piece of chicken with honey butter and generously sprinkle on spice dust. Serve with buttermilk waffles, if desired.\nSpecial Equipment\n12-inch cast iron skillet\n,\nclip-on digital thermometer\n,\nspice grinder\n, sheet trays,\nwire rack\n,\nlarge tweezers\n, disposable gloves,\nwaffle iron\n(optional)\nNotes\nAlthough an overnight brine is ideal, if you need fried chicken on the fly, increase the kosher salt to 5 teaspoons (20g) and marinate for two to four hours. The resulting meat will not be as tender and moist, but it will be well seasoned.\nItalian 00 flour (also called doppio-zero, or \"double-zero\"), is an extra-fine grind with low-absorbency properties, and it produces an unbelievably crispy and crunchy crust.\nRead More\nButtermilk Vanilla Waffles\nFried Chicken\nChicken\nSoul Food & Southern\nWhole Chicken\nButtermilk"
}