{
  "url": "https://www.seriouseats.com/extra-crispy-bar-style-tortilla-pizza-supreme",
  "image_url": null,
  "tags": [
    "Pizza",
    "Quick Dinners",
    "Quick Snacks"
  ],
  "title": "Extra-Crispy Bar-Style Tortilla Pizza Supreme Recipe",
  "full_text": "Extra-Crispy Bar-Style Tortilla Pizza Supreme Recipe\nJump to recipe\nCook\n10 mins\nActive\n5 mins\nTotal\n10 mins\nServes\n1\nto 2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nteaspoon\nextra-virgin olive oil\n1\n(\n10-inch\n)\nflour tortilla\n1/4\ncup\n(60ml) store-bought or\nhomemade\npizza sauce\n1 1/2 ounces (\n45\ng\n) shredded\nwhole milk low-moisture mozzarella cheese\n1 ounce (\n30\ng\n) finely\ngrated Parmesan cheese,\ndivided\nKosher salt\n1/4\ncup\ndiced yellow onion\n1/4\ncup diced\ngreen bell pepper\n2 ounces (\n55\ng\n) thinly sliced\npepperoni\n3 ounces (\n85\ng\n) raw sweet or\nhot Italian sausage\n, formed into 1/2-inch balls\n2\nfresh basil\nleaves\n, roughly torn, plus more for garnish\nDirections\nAdjust oven rack to 6 to 8 inches below broiler element and preheat broiler to high. Heat oil in a large cast iron skillet over high heat until shimmering. Reduce heat to medium and wipe out excess oil with a paper towel.\nPlace tortilla in skillet with the rougher textured-side facing down. Spread sauce evenly over tortilla all the way to the edges. Sprinkle mozzarella and half of Parmesan evenly over tortilla all the way to the edges. Season lightly with salt. Sprinkle with onion and bell pepper. Lay pepperoni and sausage pieces over pizza. Scatter with basil. (Alternatively, save all of the basil for a fresh garnish.)\nPlace skillet under broiler and broil until sausage is cooked through and cheese is melted and starting to brown in spots, 2 to 4 minutes. Remove from oven and sprinkle with remaining Parmesan. Using a small metal spatula, gently pry edges of pizza loose, releasing the cheese from the skillet. Peek under bottom. If more crispness is desired, place skillet over medium heat and cook, swirling pizza and peeking occasionally, until desired crispness is achieved. Slide pizza out onto a cutting board. Garnish with additional basil, if desired. Cut and serve immediately.\nSpecial equipment\nLarge cast-iron skillet\nMake-Ahead and Storage\nThis pizza is best enjoyed right away.\nRead More\nExtra-Crispy Bar-Style Tortilla Pizza Recipe\nPizza\nQuick Dinners\nQuick Snacks"
}