{
  "url": "https://www.seriouseats.com/fan-tuan-recipe-8739042",
  "image_url": "https://www.seriouseats.com/thmb/DkrQhWBPFv6qcPMJVOz_815AwL8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241031-SEA-FanTuan-DeliStudios-Hero1-45-c8511e0d96c74717a9ff74db868e6067.jpg",
  "tags": [
    "White Rice",
    "The Latest",
    "Breakfast & Brunch",
    "Vegetarian Breakfast & Brunch",
    "Vegetarian"
  ],
  "title": "Fan Tuan (Taiwanese Stuffed Rice Roll)",
  "full_text": "Fan Tuan (Taiwanese Stuffed Rice Roll)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nSoaking Time\n4 hrs\nTotal\n5 hrs\nServes\n4\nMakes\n4 fan tuan\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\ncups\nlong-grain glutinous or\nsticky rice\n(10 1/2 ounces; 300g)\n1/2 cup purple or black glutinous or\nsticky rice\n(\n3 1/2\nounces\n; 100g)\n2\nyoutiao\n(deep-fried crullers),\nhomemade\nor store-bought cut to about 6 inches (15 cm) long\n3 ounces (\n80\ng\n) pickled\nmustard greens\n3\nounces\n(80g)\nbean curd\n, diced\n1 1/2\nteaspoons\nneutral\noil\n, such as vegetable, divided\n1/2\nteaspoon\ngranulated sugar\n2\nlarge\neggs\n1/4\nteaspoon\nkosher salt\nDirections\nPlace long-grain glutinous rice and purple rice in a large bowl and cover by 2 inches of cool water. Using your hands, vigorously swish rice until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain rice, discarding the cloudy soaking water. Refill bowl with cool water and repeat rinsing and draining process until water runs clear.\nSerious Eats / Deli Studios\nReturn washed rice to large bowl and cover with room temperature water. Soak rice, uncovered, for at least 4 hours and up to 12 hours in the refrigerator.\nSerious Eats / Deli Studios\nUsing a fine-mesh strainer, drain rice. Line a bamboo steamer with wet cheesecloth. Transfer rice to cheesecloth-lined bamboo steamer and spread in an even layer. Using your finger, poke evenly spaced holes into the rice mound; this will help the rice cook uniformly. Fold the flaps of the cheesecloth over the rice, and cover. (Cheesecloth doesn’t have to fully cover rice; the folding ensures the flaps don’t sit in the water. See notes for instructions on preparing the rice if you don’t have a bamboo steamer.)\nSerious Eats / Deli Studios\nFill a large wok with 2 inches (5 cm) water, and bring to a rolling boil over high heat. Cover bamboo steamer basket and lower it into the wok. Steam until rice is al dente and shiny, about 30 minutes, replenishing the bottom of the wok with boiling water if needed.\nSerious Eats / Deli Studios\nAdjust oven rack to middle position and preheat oven to 350ºF (180ºC).\nRinse the pickled mustard greens under cold running water. Squeeze out excess water, and pat dry with paper towels. Mince and set aside for later.\nSerious Eats / Deli Studios\nCut the crullers in half lengthwise and toast in the oven on a 9- by 13- inch rimmed baking sheet\nuntil dark golden brown, 5 to 8 minutes. (They should be very crispy but not burnt.)\nSerious Eats / Deli Studios\nIn a medium nonstick pan, heat 1 teaspoon vegetable oil over low until just shimmering. Add the minced pickled mustard greens, diced bean curd, and sugar and cook, stirring constantly, until sugar has dissolved and the greens are withered and dried out, 5 to 7 minutes. Transfer to a plate and set aside for later.\nSerious Eats / Deli Studios\nIn a small bowl, whisk eggs, salt, and 1 tablespoon water until smooth. Using a fine-mesh sieve, strain mixture into a clean bowl.\nSerious Eats / Deli Studios\nIn a medium nonstick skillet, add remaining 1/2 teaspoon oil over medium-low heat until just shimmering. When the pan is hot, pour in egg mixture and tilt pan so the egg forms a thin and even film. Immediately cover the pan with a lid and cook until eggs are set, about 1 minute. Turn off heat, and wait until egg completely solidifies, 30 seconds to 1 minute. Remove lid and, when egg is cool enough to handle, use your fingers or chopsticks gently peel it off the frying pan and place it on a cutting board. Roll egg up tightly, and cut it crosswise into 1/4 inch- (6 mm–) thick strips.\nSerious Eats / Deli Studios\nTo Assemble:\nFold a clean kitchen towel so it forms a rectangle roughly 7 inches by 6 inches (18 cm by 15 cm). Arrange towel on kitchen counter with the long sides parallel to the counter edge.  Cover towel completely with plastic wrap.\nDip a spoon in water and use it to spread about  1/4 (about 6 ounces; 170g) of the cooked rice evenly across plastic wrap, leaving a 1/2-inch border on all sides. The long side of the rectangle should still be facing you.\nSerious Eats / Deli Studios\nSprinkle a line of the egg strips down the length of the rice rectangle, add the diced bean curd and mustard greens on top, and then finally a chunk of the fried cruller lined up vertically on top of everything.\nSerious Eats / Amanda Suarez\nLift up towel and plastic wrap to roll rice over the filling, using your hands to gently squeeze and shape the sticky rice into an oblong rice roll.\nSerious Eats / Deli Studios\nRepeat for remaining rice rolls. Take it to go, or unwrap the plastic and enjoy immediately.\nSerious Eats / Deli Studios\nSpecial Equipment\nFine-mesh strainer, bamboo steamer, cheesecloth, wok, pastry brush, 10-inch nonstick pan and lid, chopsticks, kitchen towel, plastic wrap\nNotes\nIf you don’t have a bamboo steamer, you can steam the rice in a large pot:\nLine a colander or fine-mesh sieve with cheesecloth. Transfer rice to cheesecloth-lined colander or fine-mesh sieve and arrange rice as evenly as possible. Using your finger, poke evenly spaced holes into the rice round; this will help the rice cook uniformly. Fold the flaps of the cheesecloth over the rice, and cover.\nFill a large pot with 2 inches (5 cm) water, and bring to a rolling boil over high heat. Lower colander or fine-mesh sieve into the pot and cover. Steam until rice is al dente and shiny, about 30 minutes, replenishing the bottom of the wok with boiling water if needed. Proceed with step 5 of the recipe.\nWhite Rice\nThe Latest\nBreakfast & Brunch\nVegetarian Breakfast & Brunch\nVegetarian"
}