{
  "url": "https://www.seriouseats.com/fassoulia-armenian-braised-green-beans-5498678",
  "image_url": "https://www.seriouseats.com/thmb/tfOGL8nX23w9A97wNBRgvVmRF7w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220627-GANACHLUPIA-ANDREWJANJIGIAN-Hero-dd99dfcc2bdc40dda24d769b1094a000.JPG",
  "tags": [
    "Green Beans",
    "The Latest",
    "Armenian"
  ],
  "title": "Ganach Lupia (Armenian Braised Green Beans)",
  "full_text": "Ganach Lupia (Armenian Braised Green Beans)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n60 mins\nSalting Time\n40 mins\nTotal\n2 hrs 15 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nbone-in lamb shoulder chops\n, 1 to 1 1/2 inches thick (see note)\n2\nteaspoons\n(6g) Diamond Crystal\nkosher salt\n; if using table salt use half as much by volume or same weight\n1/2\nteaspoon\nblack pepper\n1 (\n14.5\n-\nounce\n)\ncan whole peeled plum tomatoes\n2\ntablespoons\n(30ml)\nextra-virgin olive oil\n, divided\n1\nsmall\nyellow onion\n(about 7 ounces; 200g), finely chopped\n1/4\nteaspoon\nbaking soda\n4\ngarlic\ncloves\n(15g), minced\n4\nanchovy\nfillets\n(16g)\n2\ntablespoons\n(30g) mild or hot\nbiber salçasi pepper paste\n(see note)\n1\ntablespoon\n(16g)\ntomato paste\n1\nteaspoon\nground allspice\n1 1/2\ncups\n(360ml)\nwater\n2\npounds\ngreen beans\n, trimmed and halved lengthwise\n2\ntablespoons chopped\nfresh parsley\n1\ncup\n(225g)\nGreek yogurt\nRice pilaf\n, for serving\nDirections\nIf Using a Dutch Oven:\nPreheat oven with rack set in middle position to 325°F (160°C). While oven heats, using a sharp knife, remove bones from chops, leaving meat in large chunks and leaving behind any segments of meat clinging to bones. (Remove and discard any small shards of bone present.) Cut boneless pieces into 1-inch chunks and trim of excess fat. Place meat and bones in a bowl and toss with salt and pepper. Let stand at room temperature for at least 40 minutes and up to 2 hours. Meanwhile, place tomatoes and their juices in a second bowl, crush coarsely with a pastry cutter or chop with a pair of kitchen shears, and set aside.\nSerious Eats / Andrew Janjigian\nHeat 1 tablespoon (15ml) oil in a Dutch oven over medium heat until shimmering. Add boneless lamb pieces and cook, turning occasionally, until lamb is well browned on 2 sides, about 10 minutes. Return lamb to bowl with bones and set aside.\nSerious Eats / Andrew Janjigian\nAdd onion and baking soda to Dutch oven and cook, stirring frequently, until softened but not browned, 5 to 7 minutes. Add garlic and anchovies and cook, stirring and breaking up anchovies occasionally with a wooden spoon or rubber spatula, until anchovies have dissolved, about 4 minutes. Add pepper paste, tomato paste, and allspice, stir to combine with allium-anchovy mixture, and continue to cook until mixture turns dark brick red, 2 to 4 minutes longer.\nSerious Eats / Andrew Janjigian\nAdd lamb, lamb bones, water, and tomatoes to Dutch oven and stir to combine. Cover, and transfer to oven. Bake for 45 minutes, stirring occasionally.\nSerious Eats / Andrew Janjigian\nStir in green beans, cover, and return to oven. Cook until meat is very tender, 1 1/2 to 2 hours.\nSerious Eats / Andrew Janjigian\nStirring gently to avoid crushing beans, add 1 tablespoon parsley and season with additional salt to taste. Transfer to serving bowl, top with remaining parsley, and serve, with yogurt and rice pilaf on side.\nSerious Eats / Andrew Janjigian\nIf Using a Stovetop or Electric Pressure Cooker:\nRemove bones from chops, leaving meat in large chunks and leaving behind any segments of meat clinging to bones. (Remove and discard any small shards of bone present.) Cut boneless pieces into 1-inch chunks and trim of excess fat. Place meat and bones in a bowl and toss with salt and pepper. Let stand at room temperature for at least 40 minutes and up to 2 hours. Meanwhile, place tomatoes and their juices in a second bowl, crush coarsely with a pastry cutter or chop with a pair of kitchen shears, and set aside.\nSerious Eats / Andrew Janjigian\nHeat 1 tablespoon (15ml) oil in a stovetop pressure cooker over medium heat until shimmering; alternatively, heat the oil in an electric pressure using its \"sauté\" setting. Add boneless lamb pieces and cook, turning occasionally, until lamb is well browned on 2 sides, about 10 minutes. If necessary, cook lamb pieces in batches to prevent overcrowding. Return lamb to bowl with bones and set aside.\nSerious Eats / Andrew Janjigian\nAdd onion and baking soda to pressure cooker and cook, stirring frequently, until softened but not browned, 5 to 7 minutes. Add garlic and anchovies and cook, stirring and breaking up anchovies occasionally with a wooden spoon or rubber spatula, until anchovies have dissolved, about 4 minutes. Add pepper paste, tomato paste, and allspice, stir to combine with allium-anchovy mixture, and continue to cook until mixture turns dark brick red, 2 to 4 minutes longer.\nSerious Eats / Andrew Janjigian\nAdd lamb, lamb bones, water, and tomatoes to Dutch oven and stir to combine. Place green beans on top, cover pressure cooker with lid, and bring to high pressure over medium-high heat, if using a stovetop model, or by setting to pressure-cooker mode on an electric pressure cooker, about 15 minutes, and cook for 12 minutes.\nSerious Eats / Andrew Janjigian\nRemove pressure cooker from heat and allow to depressurize naturally; carefully remove lid, allowing steam to escape away from you.\nSerious Eats / Andrew Janjigian\nStirring gently to avoid crushing beans, add 1 tablespoon parsley and season with additional salt to taste. Transfer to serving bowl, top with remaining parsley, and serve, with yogurt and rice pilaf on side.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nLarge Dutch oven, stovetop or electric pressure cooker (optional).\nNotes\nThis dish is also commonly made with beef in place of lamb. If you’d like to substitute, use bone-in beef short ribs, either English or flanken cut.\nBiber salçasi can be found in Middle Eastern grocery stores or online. If unavailable, increase tomato paste to 3 tablespoons and add 1 teaspoon Aleppo pepper or 1/4 teaspoon cayenne and 1 teaspoon sweet paprika.\nThe pressure cooker might seem full when adding the beans, but they will cook down quickly, so don’t sweat it.\nThis dish is commonly served with the bones. If desired, you can remove the meat from the bones after cooking and discard them.\nMake-Ahead and Storage\nThis dish reheats wonderfully, and—as with many braises—its texture even improves after a day in the fridge. Reheat it on the stovetop, stirring gently so as not to break up the beans.\nGreen Beans\nThe Latest\nArmenian"
}