{
  "url": "https://www.seriouseats.com/fast-easy-pasta-blistered-cherry-tomato-sauce-recipe",
  "image_url": null,
  "tags": [
    "Tomato Sauces",
    "Italian",
    "Stovetop Pasta",
    "Tomato",
    "Pasta Mains"
  ],
  "title": "Fast and Easy Pasta With Blistered Cherry Tomato Sauce Recipe",
  "full_text": "Fast and Easy Pasta With Blistered Cherry Tomato Sauce Recipe\nJump to recipe\nCook\n25 mins\nActive\n12 mins\nTotal\n25 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n450\ng\n)\ndry pasta\nKosher salt\n4\nmedium cloves\ngarlic\n, thinly sliced\n6\ntablespoons\n(90ml)\nextra-virgin olive oil\n, divided\n1 1/2\npounds\ncherry tomatoes\n(about 2 pints; 675g)\n1 ounce\nfresh basil leaves\n, roughly chopped (about 1 cup;\n30\ng\n)\nFreshly ground black pepper\nParmesan cheese\n, for serving\nDirections\nPlace pasta in a large skillet or sauté pan and cover with water and a big pinch of salt. Bring to a boil over high heat, stirring occasionally. Boil until just shy of al dente, about 1 minute less than the package instructions recommend.\nMeanwhile, heat garlic and 4 tablespoons (60ml) olive oil in a 12-inch skillet over medium heat, stirring frequently, until garlic is softened but not browned, about 3 minutes. Add tomatoes and cook, stirring, until tomatoes begin to burst, about 10 minutes. You can help them along by pressing on them with the back of a wooden spoon as they soften.\nContinue to cook until sauce is rich and creamy, about 5 minutes longer. Stir in basil and season to taste with salt and pepper.\nWhen pasta is cooked, drain, reserving 1 cup (240ml) pasta water. Add pasta to sauce and increase heat to medium-high. Cook, stirring and tossing constantly and adding reserved pasta water as necessary to adjust consistency to a nice, creamy flow. Remove from heat, stir in remaining 2 tablespoons (30ml) olive oil, and grate in a generous shower of Parmesan cheese. Serve immediately, passing extra Parmesan at the table.\nSpecial Equipment\n12-inch\nskillet\n,\nMicroplane grater\nNotes\nYou can substitute the cherry tomatoes with in-season or supermarket grape tomatoes.\nTomato Sauces\nItalian\nStovetop Pasta\nTomato\nPasta Mains"
}