{
  "url": "https://www.seriouseats.com/fesenjan-persian-pomegranate-and-walnut-meat-braise-recipe-8425670",
  "image_url": "https://www.seriouseats.com/thmb/LbMZU43BBx_G9Su2JrDq5xOIRbI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-Fessenjan-NaderMehravari-hero-4ca9b39dbb724c839dbbed292292766d.jpg",
  "tags": [
    "Braised & Stewed Mains",
    "The Latest",
    "Mains",
    "Middle Eastern"
  ],
  "title": "Fesenjān (Persian Pomegranate and Walnut Meat Braise)",
  "full_text": "Fesenjān (Persian Pomegranate and Walnut Meat Braise)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs\nTotal\n2 hrs 30 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n3\ncups\nwalnut\nhalves (about 10 ounces; 285g)\n3 tablespoons (\n45\nml\n) extra-virgin olive oil or\nvegetable oil\n, divided\n1 pound (\n450\ng\n) boneless\nlamb leg\nor boneless beef chuck, cut in to 1- to 1 1/2-inch chunks\n1/2\nteaspoon\nkosher salt\n, plus more if needed\n1/2\nteaspoon\nfreshly\nground black pepper\n1 small yellow or\nred onion\n(about 4 ounces;\n114\ng\n), diced\n1\nteaspoon\nground turmeric\n1 cup\npomegranate molasses\n(about 11 ounces;\n330\ng\n)\n2 tablespoons\nsugar\n(\n25\ng\n)\nFresh\npomegranate seeds\n, for serving (optional)\nTahdig\nand\nchelow\n, for serving (see notes)\nDirections\nIn a food processor, pulse walnuts until the size of coarse cornmeal, scraping down sides with a rubber spatula as necessary, about 12 one-second pulses. You should have about 2 1/2 cups of ground walnuts.\nSerious Eats / Nader Mehravari\nIn a large Dutch oven, heat 2 tablespoons oil over medium-high heat until shimmering. Season meat with salt and pepper, then add to Dutch oven in a single layer. Cook, turning occasionally until meat is well browned on all sides, about 10 minutes. With a slotted spoon, transfer meat to a rimmed baking sheet or a large plate; set aside.\nSerious Eats / Nader Mehravari\nHeat the remaining lamb fat in the Dutch oven, over medium heat until shimmering. (If Dutch oven is dry with no remaining fat in the Dutch oven, add 1 tablespoon oil). Add onion and cook until just beginning to turn golden brown, 7 to 10 minutes.\nNader Mehravari\nSprinkle turmeric over onion, and cook, stirring constantly until onion is well coated and turmeric is fragrant, about 30 seconds.\nSerious Eats / Nader Mehravari\nAdd 2 cups water to Dutch oven and bring to boil over high heat, scraping up browned bits with a wooden spoon.\nSerious Eats / Nader Mehravari\nStir in browned meat and any accumulated juices, ground walnuts, pomegranate molasses, and sugar and bring to boil. Adjust heat to medium-low and simmer, covered, until the braise is dark brown, meat is fork-tender, and oil from the walnuts has come to the surface, 1 1/2 to 2 hours; stir gently every 15 minutes and adjust heat as needed to maintain gentle simmer throughout. Add water while braising if needed to avoid scorch on the bottom of the pan and to maintain stew consistency. Season with additional salt, if desired (keep in mind that this dish should not have an overt saltiness, but instead should lean into its tart-sweet flavor profile).\nSerious Eats / Nader Mehravari\nTransfer braise to heat-proof serving bowl. Garnish with pomegranate seeds, if using. Serve with tahdig and chelow.\nSerious Eats / Nader Mehravari\nSpecial Equipment\nFood processor, large Dutch oven\nNotes\nAll braising times given are sufficient to result in a well “\nja-oftādeh”\n(integrated) authentic fesenjān. However, with this dish, you won’t go wrong if you let it simmer, covered, over very low heat, for up to one additional hour. A final sprinkling of fresh bright red pomegranate arils (seeds) makes for a beautiful final presentation, but they are purely decorative and may be omitted from the recipe.\nIn traditional Persian fashion, the meal is served family-style, where individuals start by spooning some rice onto their plate and topping it off with spoonfuls of the braise.\nWhen you make Persian rice (chelow), you also get tahdig (the crispy rice from the bottom of the pot). Because there's so much to say about the techniques for making chelow and its accompanying tahdig, we have two recipes on Serious Eats, one in which the recipe headnote focuses on the techniques for perfecting the chelow more generally and the other that takes a closer look at the art of making tahdig.\nMake-Ahead and Storage\nLike many other Persian khoreshes, fesenjān can be made a day or two ahead of time and reheated gently.\nFesenjān is extremely leftover-friendly. The braise can be stored in an airtight container and refrigerated for up to a week or frozen for up to three months. Add a few tablespoons of water as needed when reheating.\nBraised & Stewed Mains\nThe Latest\nMains\nMiddle Eastern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fesenjn-persian-pomegranate-and-walnut-meat-braise.webp?"
}