{
  "url": "https://www.seriouseats.com/festival-jamaican-fried-cornmeal-dumplings-7480801",
  "image_url": "https://www.seriouseats.com/thmb/zUrqpOmBwj8KynL7tkyeBqGG20c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230414-SEA-Festivals-KarinaMatalon-HERO-3a0e1618706246468d6851071209adbc.jpg",
  "tags": [
    "Jamaican",
    "The Latest",
    "Sides",
    "Snacks & Appetizers",
    "Caribbean"
  ],
  "title": "Festival (Jamaican Fried Cornmeal Dumplings)",
  "full_text": "Festival (Jamaican Fried Cornmeal Dumplings)\nClose\nJump to recipe\nPrep\n45 mins\nCook\n30 mins\nTotal\n75 mins\nMakes\n16 large festival (4-ounce pieces)\nCook Mode\n(Keep screen awake)\nIngredients\n7\ncups\nall purpose flour\n1 1/2\ncups\ncornmeal\n6\ntablespoons\nbrown sugar\n3\ntablespoons\nbaking powder\n48\ng\nsalt\n113\ng\nunsalted butter\n15\nml\nvanilla extract\n3 4/5\nl\noil\nDirections\nIn a large mixing bowl, whisk together flour, cornmeal, brown sugar, baking powder, and salt.\nSerious Eats / Karina Matalon\nAdd melted butter and vanilla, if using, along with 2 1/2 cups (590ml) water. Mix with a clean hand until a firm yet elastic dough ball is formed that is neither wet nor sticky; add additional water, 1 tablespoon (15ml) at a time, if needed. Wrap dough ball in plastic wrap and let rest for 10 minutes.\nSerious Eats / Amanda Suarez.\nTransfer dough to a work surface and divide into eighteen 4-ounce pieces for large festival or twenty-four 3-ounce pieces for smaller festival.\nSerious Eats / Karina Matalon\nLightly flour works surface and hands. Working with one dough piece at a time, roll each dough piece into the shape of a long, fat cigar (about 6 to 8 inches long), dusting surfaces and hands with flour as needed.\nSerious Eats / Karina Matalon\nSet an oven to keep warm or its lowest setting. In a large Dutch oven or flat-bottomed wok, heat oil over medium-high heat until it registers 350°F (175°C) on an instant-read thermometer. Working in batches of about 3 at a time to avoid crowding oil, fry dough cigars until golden on first side, about 2 minutes. Turn festival and fry until second side is golden, about 2 minutes longer.\nSerious Eats / Karina Matalon\nTransfer to a paper-towel-lined platter; transfer platter to oven to keep festival warm. Repeat with remaining dough cigars. Serve festival with jerk pork, pan chicken, fried fish, and other savory dishes.\nSerious Eats / Karina Matalon\nSpecial Equipment\nLarge Dutch oven or flat-bottomed wok\nMake-Ahead and Storage\nThe dough can be refrigerated wrapped in plastic wrap after Step 2 for up to 24 hours.\nJamaican\nThe Latest\nSides\nSnacks & Appetizers\nCaribbean"
}