{
  "url": "https://www.seriouseats.com/filipino-style-chicken-adobo-recipe",
  "image_url": null,
  "tags": [
    "Filipino",
    "Braised & Stewed Chicken",
    "Stovetop Chicken",
    "Chicken Legs",
    "Chicken Mains"
  ],
  "title": "Chicken Adobo (Filipino-Style Braised Chicken)",
  "full_text": "Chicken Adobo (Filipino-Style Braised Chicken)\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n10 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(15ml)\ncanola oil\nor other neutral oil\n4 bone-in, skin-on\nchicken legs\n, separated into thighs and drumsticks (about\n2 1/2\npounds\n; 1.15kg)\nKosher salt\n8\ncloves\ngarlic\n, thinly sliced\n2\nwhole\nfresh bay leaves\n(or 3 whole dried bay leaves)\n1 1/2\nteaspoons whole\nblack peppercorns\n1 1/4\ncups\n(300ml)\nwater\n1\ncup\n(240ml)\nsoy sauce\n1\ncup\n(240ml)\nrice vinegar\n(see note)\nSteamed white rice\nor\ngarlic fried rice\n, for serving\nDirections\nIn a heavy-bottomed pot or Dutch oven, heat oil over medium heat until shimmering. Blot chicken dry with paper towels, then season lightly all over with salt.\nWorking in batches if necessary, add chicken pieces to pot in a single layer, skin side down, making sure not to overcrowd the pot. Cook until well browned, 6 to 7 minutes. Using tongs, flip chicken pieces and cook until lightly brown on the second side, about 3 minutes. Transfer chicken to a plate and set aside.\nSerious Eats / Vicky Wasik\nAdd garlic, bay leaves, and peppercorns to now-empty pot and cook, stirring constantly, until mixture is very fragrant and garlic turns a light golden color, about 30 seconds. Add water and stir with a wooden spoon, scraping up any brown bits on the bottom of the pot. Add soy sauce and vinegar, return chicken pieces to pot, increase heat to high, and bring liquid to a boil. Reduce heat to low, cover, and simmer until chicken is cooked through and tender, about 20 minutes, turning the chicken pieces halfway through.\nSerious Eats / Vicky Wasik\nTo Serve\n: The chicken is best served after sitting overnight in the refrigerator (see note), but it can also be served immediately, with steamed white rice or (preferably) garlic fried rice. The chicken pieces can also be briefly broiled before serving.\nTo Broil Chicken Adobo:\nAdjust oven rack to 6 inches below broiler element and preheat broiler to high. Transfer chicken pieces to a paper towel–lined rimmed baking sheet and blot surface with more paper towels to remove as much moisture as possible; discard paper towels. Arrange chicken skin side up on the baking sheet and broil until chicken skin is crispy and lightly charred, about 2 minutes (keep an eye on the chicken to ensure it does not burn). Serve immediately with steamed white rice or (preferably) garlic fried rice, passing adobo sauce at the table.\nSpecial Equipment\nDutch oven\nNotes\nChicken adobo is improved immensely by being refrigerated overnight, due to the way the cooked vinegar mellows over time.\nMake-Ahead and Storage\nBecause of the salinity and acidity of the sauce, chicken adobo will keep very well in the refrigerator. In a sealed airtight container, chicken adobo will keep for at least a week and a half in the fridge.\nRead More\nGarlic Fried Rice\nPork Adobo\nAdobo-Marinated Grilled Pork Chops\nFilipino\nBraised & Stewed Chicken\nStovetop Chicken\nChicken Legs\nChicken Mains"
}