{
  "url": "https://www.seriouseats.com/financiers-french-mini-almond-cakes-recipe-6827013",
  "image_url": "https://www.seriouseats.com/thmb/4nnXrluxD-Nsj5Fz6invJnEZv28=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221109-Financiers-Amanda-Suarez-hero2-66b914afbf79490dabb500213d83b740.JPG",
  "tags": [
    "French",
    "Cakes",
    "Almonds",
    "The Latest"
  ],
  "title": "Financiers (French Mini Almond Cakes)",
  "full_text": "Financiers (French Mini Almond Cakes)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n22 mins\nChilling Time\n3 hrs\nTotal\n3 hrs 37 mins\nServes\n24 servings\nMakes\n24 financiers\nCook Mode\n(Keep screen awake)\nIngredients\n5.3 ounces\nunsalted butter\n(about\n10\ntablespoons\n; 150g)\n3.5 ounces toasted blanched\nsliced almonds\n(about 1 cup;\n100\ng\n)\n2.1 ounces\nall-purpose flour\n(about 1/2 cup;\n60\ng\n)\n6.3 ounces (\n1 1/2\ncups\n; 180g)\npowdered sugar\n, sifted\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n4\nlarge\negg whites\n(120g), lightly beaten\nRaw sliced almonds\n, for decorating\nDirections\nIn a 2-quart stainless steel saucepan or saucier, melt butter over medium-low heat. Increase heat to medium and simmer, stirring with a heat-resistant spatula while butter hisses and pops. Continue cooking and stirring until foaming subsides, scraping up brown bits that form on bottom, and butter is golden yellow and milk solids are chestnut brown in color, about 5 minutes. Transfer to a small heatproof bowl and set aside.\nIn a blender or food processor, combine toasted almonds and flour and pulse until almonds are completely broken down into fine, sandy crumbs, about 30 seconds. Transfer flour-almond mixture to a large bowl, add sugar and salt, and whisk until thoroughly combined, about 30 seconds. Add egg whites and whisk until smooth and no dry flour remains, about 1 minute (the consistency should be similar to pancake batter). Add half of the brown butter and whisk until fully incorporated, about 30 seconds. Repeat with remaining butter. Cover bowl with plastic wrap and refrigerate for at least 3 hours and up to 1 day.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Grease a 24-cup nonstick mini muffin pan. Using a 1-tablespoon cookie scoop or measuring spoon, scoop 1 tablespoon of dough into each cup. Sprinkle raw sliced almonds in an even layer over the top of each. Bake until financiers are puffed and domed on top and light golden brown in the center with deeper golden brown edges, about 12 minutes.\nSerious Eats / Amanda Suarez\nTransfer pan to a wire rack and let cool for 10 minutes. Using a butter knife or small, thin offset spatula, remove financiers from pan. Serve slightly warm or at room temperature.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n2-quart stainless steel saucepan or saucier, blender or food processor, 24-cup nonstick mini muffin pan, 1-tablespoon cookie scoop or measuring spoon\nMake-Ahead and Storage\nThe batter can be prepared ahead of time and refrigerated for up to 1 day.\nFinanciers are best enjoyed on the same day they’re baked.\nFrench\nCakes\nAlmonds\nThe Latest"
}