{
  "url": "https://www.seriouseats.com/fior-di-latte-gelato",
  "image_url": "https://www.seriouseats.com/thmb/BwXk6yw-W3uGmXqEGgAaFOWq8Ik=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__06__20180625-fior-di-latte-vicky-wasik-17-9f4fd0e4262a46afbac6faf538487926.jpg",
  "tags": [
    "Ice Cream",
    "Italian",
    "Mother's Day",
    "Father's Day",
    "Summer Desserts"
  ],
  "title": "Fior di Latte Gelato Recipe",
  "full_text": "Fior di Latte Gelato Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n15 mins\nChurning/Freezing Time\n7 hrs 30 mins\nTotal\n7 hrs 45 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n9 1/4\nounces\nplain or very lightly\ntoasted\nsugar\n(about\n1 1/3\ncups\n;\n265\ng\n)\n1 1/4\nounces\ncornstarch\n(about\n1/4\ncup\n;\n35\ng\n)\n1/2\nteaspoon\nplus\n1/8\nteaspoon\n(\n2.5\ng\n) Diamond Crystal\nkosher salt\n, or more to taste; for table salt, use about half as much by volume or the same weight\n20\nounces\nbest quality\nwhole milk\n, preferably grass-fed, divided (about\n2 1/2\ncups\n;\n565\ng\n)\n8\nounces\nbest quality\nheavy cream\n, preferably grass-fed (about\n1\ncup\n;\n225\ng\n)\nDirections\nWhisk sugar, cornstarch, and salt together in a 3-quart saucier. When no lumps of cornstarch remain, add exactly 14 ounces of the milk (about 1 2/3 cups; 396g) and whisk to combine. Cook over medium heat, whisking constantly but not vigorously, until it begins to simmer. This will take about 6 minutes; if the process seems to be moving slowly, simply turn up the heat. When the mixture comes to a boil, set a timer and continue cooking and whisking for exactly 1 minute. This ensures the cornstarch is fully hydrated.\nImmediately transfer mixture to a large bowl, then whisk in the remaining milk and cream. Bearing in mind that the gelato will taste substantially less sweet once frozen, season with an additional pinch of salt, if desired. Cover and refrigerate the gelato base until cold, thick, and no warmer than 40°F (4°C), about 3 hours (this process can be sped along with an ice bath if time is of the essence; in that case, a stainless steel bowl will help cool the base even faster).\nSerious Eats / Vicky Wasik\nChurn in an ice cream maker according to the manufacturer’s directions. Meanwhile, place a quart-sized container and flexible spatula in the freezer. When gelato looks fluffy and thick, shut off the machine and, using the chilled spatula, scrape gelato into the chilled container. Cover with plastic wrap pressed directly against the surface of the gelato, and freeze until thick enough to scoop, about 4 hours.\nSerious Eats / Vicky Wasik\nGelato is typically served at about 16°F (-9°C), while most American freezers run at 0°F (-18°C); for the most authentic presentation, soften gelato to 16°F in the refrigerator before serving. In a squat container, like a yogurt tub or a square storage container, this will take about 45 minutes. The timing will vary substantially depending on the size, shape, and material of the container (such as a metal loaf pan or glass baking dish), so check on the gelato frequently to ensure it does not melt.\nSpecial Equipment\n3-quart stainless steel saucier\n;\nwhisk\n;\nice cream maker\n;\nnon-reactive, freezer-safe container\nNotes\nAside from seeking out locally produced dairy at a farmers market or co-op, a few national brands will do the trick in a pinch. Look for\nHorizon's \"Grassfed\" whole milk\nat supermarket chains like Kroger, or try grass-fed milk and cream from brands such as\nTrickling Springs\nand\nSnowville Creamery\n, available from retailers like Whole Foods.\nRead More\nWhat's the Difference Between Gelato and Ice Cream?\nRicotta Gelato\nStracciatella Gelato (Sweet Cream Chocolate Chip)\nRaspberry Ripple Goat's-Milk Gelato\nIce Cream\nItalian\nMother's Day\nFather's Day\nSummer Desserts"
}