{
  "url": "https://www.seriouseats.com/firecracker-hot-dogs-recipe-8652279",
  "image_url": "https://www.seriouseats.com/thmb/xdUSLlwmpa_01ZRjqx03Zc87NXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240522-SEA-FirecrackerHotdogs-AmandaSuarez-hero-bea0a90e25ea4a549ab697cbce49e891.jpg",
  "tags": [
    "Sausages",
    "The Latest",
    "American",
    "Memorial Day",
    "4th of July"
  ],
  "title": "Firecracker Hot Dogs",
  "full_text": "Firecracker Hot Dogs\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nChilling and Cooling Time\n20 mins\nTotal\n60 mins\nServes\n6\nto 8\nMakes\n6\nto 8 hot dogs\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\nCooking spray\n2\ncups\nall-purpose flour\n(\n9\nounces\n;\n260\ng\n)\n2\nteaspoons\nbaking powder\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\ncup\n(\n120\nml\n)\nwhole milk\n2\ntablespoons\n(\n30\nml\n)\nhot honey\n(see notes)\n8\ntablespoons\n(\n113\ng\n)\nunsalted butter\n, cut into 1/2-inch cubes and chilled\nFor the Glaze and Hot Dogs:\n2\ntablespoons\n(\n30\nml\n) hot\nhoney\n2\ntablespoons\n(\n30\nml\n)\nyellow mustard\n1 1/2\nteaspoons\nsoy sauce\n1/2-1\nteaspoon\nsriracha sauce\n1/2\nteaspoon\ncornstarch\n6-8\nhot dogs\n(see notes)\nDirections\nFor the dough:\nAdjust oven rack to middle position and preheat oven to 400°F (200°C). Line a rimmed baking sheet with parchment paper. Spray parchment with cooking spray; set aside.\nSerious Eats / Amanda Suarez\nIn a large bowl, whisk together flour, baking powder, and salt. In a small bowl, whisk milk and hot honey until well combined and honey is dissolved.\nSerious Eats / Amanda Suarez\nScatter butter cubes over flour mixture. Using a pastry cutter or hands, cut or rub butter into flour until butter is the size of small peas. Add milk mixture and with a rubber spatula, gently mix until no dry flour remains and crumbly dough forms.\nSerious Eats / Amanda Suarez\nTransfer dough to a floured work surface. Gently gather together into a cohesive mass, then press into a rough 6- by 4-inch rectangle and sprinkle with additional flour. Use a rolling pin to roll until about 1/2-inch thick (10- by 6-inch rectangle). Starting from the short end, fold the dough in thirds, like a letter. Rotate 1/4 turn, roll out to 1/2-inch thickness again (10 by 6-inch rectangle), and fold in thirds again, re-flouring surface and dough as needed. Roll into a 9 1/2- by 13-inch rectangle, about ¼-inch thick.\nSerious Eats / Amanda Suarez\nUse a chef’s knife or bench scraper to trim away ragged edges and form a 9- by 12-inch rectangle. Working from long side, cut six to eight 3/4-inch wide, 9-inch long strips from dough (depending on how many hot dogs you’re using).\nSerious Eats / Amanda Suarez\nUse a 2-inch star cookie cutter to cut 6 to 8 stars from remaining dough; discard scraps. You can also use any 2-inch cookie cutter shape of your choice, or omit the cookie cutter dough cut outs, if desired. Transfer dough strips and stars, if using, to a large plate and refrigerate for at least 10 minutes while preparing glaze and hot dogs.\nSerious Eats / Amanda Suarez\nFor the glaze and hot dogs:\nIn a small microwave-safe bowl, whisk together hot honey, mustard, soy sauce, sriracha, and cornstarch. Microwave until bubbling, 30 to 60 seconds. Whisk to combine and set aside to cool slightly.\nSerious Eats / Amanda Suarez\nPat hot dogs dry with paper towels. Carefully push a 10-inch skewer all the way through each hot dog lengthwise, with about 2 inches of skewer sticking out at top.\nSerious Eats. / Amanda Suarez\nStarting from the top, wrap 1 dough strip around each hot dog 3 times in a spiral, leaving 3/4-inch gaps in the spiral as you wrap and pressing the dough ends to the back of the hot dog to adhere. Place on the greased parchment-lined baking sheet with the star ends pointing in alternating directions and tucking the ends of dough strips underneath hot dogs. Slide star cutout onto end of each skewer.\nSerious Eats / Amanda Suarez\nUse a pastry brush to coat the tops and sides of the hot dogs, dough strips, and dough stars with honey mustard\nglaze, trying to avoid getting excess glaze on the parchment.\nSerious Eats / Amanda Suarez\nBake until biscuit strips are puffed and glaze is beginning to brown, 12 to 14 minutes. Transfer baking sheet to wire rack and let hot dogs cool slightly on sheet, 2 to 3 minutes. Use a thin metal spatula to gently loosen the hot dogs from the parchment and transfer to a serving platter. Serve warm.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheet, pastry blender, rolling pin, ruler, 2-inch star cookie cutter, 10-inch wooden skewers, pastry brush, wire rack.\nNotes\nI developed this recipe with Mike’s Hot Honey; other brands of hot honey may vary in spiciness. If you can’t find hot honey, use regular honey and add ¼ teaspoon ground cayenne to the dough and the sauce in steps 2 and 6. For a mild version of this dish, you can use regular honey instead of hot honey and skip the sriracha in the sauce.\nThe from-scratch dough in this recipe is extra flaky and flavorful, but you can substitute strips of refrigerated canned biscuit or croissant dough instead for a shortcut option (if you must!). Do not use puff pastry dough; it won’t have enough time in the oven to cook through.\nDifferent brands of hot dogs come in packages of varying quantities, but the dough and glaze will make enough for up to 8.\nTo get the best fit on the baking sheet, arrange the skewers with the star ends pointing in alternating directions.\nIf you’re feeding a crowd, you can easily double this recipe. Split the dough into two portions and roll each to the specified dimensions. Bake the assembled hot dogs on two baking sheets on the upper-middle and lower-middle racks in the oven, switching and rotating the trays halfway through baking.\nMake-Ahead and Storage\nThe biscuit dough can be covered and refrigerated for up to 24 hours before using.\nSausages\nThe Latest\nAmerican\nMemorial Day\n4th of July",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/firecracker-hot-dogs.webp?"
}