{
  "url": "https://www.seriouseats.com/fish-piccata-5212223",
  "image_url": "https://www.seriouseats.com/thmb/cU8x361dQjH3w8d30Xm7D2rakP4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-fish-piccata-vicky-wasik-17-205e3c62dd94410f9fae9418417b4459.jpg",
  "tags": [
    "Fish",
    "Italian",
    "The Latest"
  ],
  "title": "Fish Piccata",
  "full_text": "Fish Piccata\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nServes\n4 Servings\nCook Mode\n(Keep screen awake)\nIngredients\nAll-purpose flour\n, for dredging (about\n1/2\ncup\n)\n4\n(\n6\n-\nounce\n;\n170\ng\n)\nthin boneless, skinless white-fleshed fish\nfillets\n, about 1/2- to 3/4-inch thick, such as\nflounder\n,\nscrod\n,\nhaddock\n, or\nbranzino\n1/4\ntsp\nsalt and freshly ground black pepper\n60\nml\nvegetable oil\n80\nml\nwhite wine\n1 1/2\ntablespoons\n(\n1/2\nounce\n;\n15\ng\n)\ndrained capers in vinegar\n4\ntablespoons\n(\n60\ng\n)\nunsalted butter\n, cut into tablespoon-size pieces, plus\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter mashed into a paste\nwith\n1/4\nteaspoon\nall-purpose flour\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice\nfrom\n1\nwhole\nlemon\n1 1/2\ntablespoons\n(\n1/4\nounce\n;\n8\ng\n)\nminced flat-leaf parsley leaves and tender stems\nDirections\nIn a wide, shallow bowl, spread flour in an even layer. Line a rimmed baking sheet with parchment paper. Season fish fillets all over with salt and pepper. Working with one piece of fish at a time, dredge fillets in flour, shaking off excess. Transfer to prepared baking sheet.\nSerious Eats / Vicky Wasik\nIn a large nonstick skillet, heat oil over medium-high heat until shimmering. Working in batches if necessary, add fish, presentation side down, and cook until well browned on on first side, 3 to 4 minutes (it's okay if the fillets are mostly cooked through at this point). Using two spatulas, if necessary, carefully flip each fillet and continue cooking until just cooked through and flesh is opaque throughout, 30 seconds to 1 minute. Carefully transfer fish, well-browned side up, to a serving platter and keep warm.\nSerious Eats / Vicky Wasik\nWipe out skillet, then return to medium-high heat, add wine, and bring to a boil. Cook until alcohol smell has mostly cooked off and wine is reduced by about half, about 2 minutes. Add capers, the 4 tablespoons plain unsalted butter, and butter-flour mixture and cook, whisking constantly, until butter has melted.\nSerious Eats / Vicky Wasik\nLower heat to medium and continue to simmer while whisking until a creamy, emulsified sauce has formed; when ready, it should coat the back of a spoon and a finger dragged through it should leave a trail. If the sauce over-reduces and breaks at any point, whisk in cold water 1 tablespoon at a time to bring it back together. Whisk in lemon juice and parsley. Season with salt, then pour sauce over fish fillets and serve right away.\nSerious Eats / Vicky Wasik\nMake-Ahead and Storage\nThis recipe is, at its heart, an \"à la minute\" one-pan dish, meant to be made rapidly from start-to-finish right before serving. That said, it is possible to make the sauce in advance. Simply follow the sauce instructions using a skillet or 2- or 3-quart saucepan or saucier (no need for it to be nonstick), but avoid adding the parsley. Once formed, you will need to keep the sauce warm, but not so hot that it is at risk of breaking. The easiest way to do this is to set up a hot water bath with an immersion circulator set to about 140°F/60°C (you could also use a slow cooker filled with water and set to its lowest heat, or an Instant Pot's \"sous vide\" function); transfer the sauce to a metal container and set it in the hot water bath, keeping it covered to prevent evaporation that could lead to breaking over time. The sauce can be held like this for an hour or two before serving; stir in the parsley before serving.\nFish\nItalian\nThe Latest"
}