{
  "url": "https://www.seriouseats.com/fish-stock-fumet-recipe",
  "image_url": "https://www.seriouseats.com/thmb/bOBdtl-9YWpRkQ3oQlCEYfDckp4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__10__20150924-fumer-fish-stock-vicky-wasik-8-9a187a2bed834ce1a60cf36ad05c15f9.jpg",
  "tags": [
    "Fish",
    "Stovetop Seafood"
  ],
  "title": "Quick and Easy Fish Stock (Fumet)",
  "full_text": "Quick and Easy Fish Stock (Fumet)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nActive\n45 mins\nResting Time\n60 mins\nTotal\n105 mins\nServes\n4 serving\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nbones and heads of lean, white-fleshed fish\n, such as snapper or bass, gills removed\n2\ntablespoons\nkosher salt\n2\ntablespoons\nvegetable oil\n1\ncup diced\nyellow onion\n(about 1/2 large onion)\n1\ncup\ndiced fennel bulb\n(about 1/2 large bulb)\n1\nmedium\nleek\n, minced\n2/3\ncup\ndiced celery\n(about 2 large ribs)\n2\nmedium\ncloves garlic\n, crushed\n1\ncup\ndry white wine\n4\ncups\nwater\n2\nsprigs\nflat-leaf parsley\n2\nsprigs\ntarragon\n1\nbay leaf\n5\nwhole\nblack\npeppercorns\nDirections\nPlace fish bones and heads in a large bowl and cover with cold water. Stir in kosher salt until dissolved. Let stand 1 hour. Drain, then rinse fish under cold running water, washing away any large areas of blood, such as near spine (see notes).\nSerious Eats / Vicky Wasik\nIn a large saucepan, heat oil over medium-high heat until shimmering. Add onion, fennel, leek, celery, and garlic, and cook, stirring, until vegetables have softened slightly, about 3 minutes. Stir in fish heads and bones. Add wine and cook, stirring, until it begins to steam. Add 4 cups water (liquid should just barely cover heads and bones; if not, add just enough more to barely cover). Add parsley, tarragon, bay leaf, and peppercorns.\nSerious Eats / Vicky Wasik\nBring liquid to a bare simmer, then lower heat so that it stays just below a simmer, with only the occasional bubble. Cook for 20 minutes. Using a spoon, skim off any scum that accumulates on the surface.\nStrain fish stock through a fine-mesh strainer, then chill. Fish stock can be kept refrigerated, covered, for up to 5 days or frozen for up to 3 months.\nSpecial Equipment\nFine-mesh strainer\nNotes\nSoaking and washing the fish bones and heads helps create a more delicate stock, but don't drive yourself crazy. Our tests showed that removing blood has a subtle effect—enough to make it worth doing, but not worth being obsessive about.\nFish\nStovetop Seafood"
}