{
  "url": "https://www.seriouseats.com/fish-fragrant-eggplants-sichuan-braised-eggplant-with-garlic-ginger-and-chilies",
  "image_url": "https://www.seriouseats.com/thmb/EUUKCKZHh8EfMhv_AGlxCZSb37w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__10__20191022-fuchsia-dunlop-sichuan-cooking-shoot-eggplant-vicky-wasik-5-3e22d4ed761d4ae39348006e9e3c599e.jpg",
  "tags": [
    "Mains By Ingredient",
    "Stovetop Vegetables",
    "Eggplant",
    "Vegetable Mains",
    "Vegetables"
  ],
  "title": "Fish-Fragrant Eggplants (Sichuan Braised Eggplant With Garlic, Ginger, and Chiles) Recipe",
  "full_text": "Fish-Fragrant Eggplants (Sichuan Braised Eggplant With Garlic, Ginger, and Chiles) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n30 mins\nSalting Time\n30 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound 5 ounces (\n600\ng\n)\neggplants\n(1–2 large)\nSalt\nCooking oil\n, for deep-frying\n1 1/2\ntablespoons\nSichuan chile bean paste\n(see note)\n1 1/2\ntablespoons\nfinely chopped garlic\n1\ntablespoon\nfinely chopped\nginger\n10 tablespoons (\n150\nml\n) hot stock or\nwater\n4\nteaspoons\nsuperfine\nsugar\n1\nteaspoon\nChinese\nlight soy sauce\n3/4\nteaspoon\npotato starch\n, mixed with 1 tablespoon cold water\n1\ntablespoon\nChinkiang vinegar\n(see note)\n6\ntablespoons\nthinly sliced\nscallion greens\nDirections\nCut the eggplants into batons about 3/4 inch thick and 2 3/4 inches long. Sprinkle with salt, mix well, and set aside for at least 30 minutes.\nRinse the eggplant, drain well, and pat dry with paper towels. Heat the deep-frying oil to around 390°F (200°C) (hot enough to sizzle vigorously around a test piece of eggplant). Add the eggplant, in 2 or 3 batches, and deep-fry for about 3 minutes, until tender and a little golden. Drain well on paper towels and set aside.\nCarefully pour off all but 3 tablespoons oil from the wok and return to medium heat. Add the chile bean paste and stir-fry until the oil is red and fragrant; take care not to burn the paste (move the wok away from the burner if you think it might be overheating). Add the garlic and ginger and stir-fry until they smell delicious.\nTip in the stock or water, sugar, and soy sauce. Bring to a boil, then add the eggplant, nudging the batons gently into the sauce so they do not break apart. Simmer for a minute or so to allow the eggplant to absorb the flavors.\nGive the potato starch mixture a stir and add it gradually, in about 3 stages, adding just enough to thicken the sauce to a luxurious gravy (you probably won’t need it all). Tip in the vinegar and all but 1 tablespoon of the scallion greens, then stir for a few seconds to fuse the flavors.\nTurn out onto a serving dish, scatter over the remaining scallion greens, and serve.\nSpecial Equipment\nWok\nor\nDutch oven\nNotes\nIf you want to scale up this recipe for a party, rinse and dry the salted eggplants, toss in a little cooking oil, then roast for 15–20 minutes in a 425°F (220°C) oven until golden. Make the sauce, but don’t thicken it with starch; instead, pour it over the roasted eggplants and set aside to allow the flavors to mingle. Serve at room temperature.\nYou can find chile bean paste and Chinkiang vinegar online at The Mala Market.\nRead More\nBeyond Málà: Fuchsia Dunlop on Sichuan's Fish-Fragrant Flavor\nMains By Ingredient\nStovetop Vegetables\nEggplant\nVegetable Mains\nVegetables",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fish-fragrant-eggplants-sichuan-braised-eggplant-with-garlic-ginger-and-chiles-recipe.webp?"
}