{
  "url": "https://www.seriouseats.com/fish-head-curry-recipe-8548098",
  "image_url": "https://www.seriouseats.com/thmb/iH-QjaeRqmKhDUbMW-ubjW-WBPg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240123-Fish-Head-Curry-Michelle-Yip-SEA-hero-b530ad5090524f71933bbc6a6e3bc9f6.jpg",
  "tags": [
    "Fish",
    "The Latest",
    "Southeast Asian Cuisines",
    "Curries",
    "Malaysian"
  ],
  "title": "Malaysian Fish Head Curry Recipe",
  "full_text": "Malaysian Fish Head Curry Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nTotal\n90 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Curry Powder:\n1\nteaspoon\ncoriander seeds\n1/2\nteaspoon\ncumin seeds\n1/2\nteaspoon\nfennel seeds\n1/2\nteaspoon\nwhole black\npeppercorns\n1/4\nteaspoon\nwhole white\npeppercorns\n1\nteaspoon\nground turmeric\n1\nteaspoon\nKashmiri\nchile powder\nFor the Curry:\n3\nmedium\ncloves\ngarlic\n(1/2 ounce; 15g)\nOne 1-inch knob peeled\nginger\n(1/2 ounce;\n15\ng\n)\n3\ntablespoons\n(45ml) neutral oil, such as\nvegetable oil\n, divided\n3\nsmall\nJapanese\neggplants\n(10 1/2 ounces; 300g), quartered lengthwise and cut into 3-inch lengths\n1\nteaspoon\nwhole\nmustard seeds\n1\nteaspoon\nwhole\nfenugreek seeds\n1/2\nteaspoon whole\ncumin seeds\n1/2\nteaspoon\nwhole\nfennel seeds\n1\nsmall\nyellow onion\n(4 ounces; 113g), thinly sliced\nKosher salt\n2 large garden\ntomatoes\n(14 ounces;\n400\ng\n), cored and diced\n25\ncurry leaves\n, woody stems removed\n1 tablespoon (\n15\nml)\ntamarind\npaste\n1 pound (\n454\ng\n)\nfish\nheads (from about 2 large fish, preferable a large oily fish like mackerel or salmon), split in half lengthways and gills removed (see notes)\n10 large\nokra\npods (5 ounces;\n140\ng\n), stem ends trimmed and pods sliced in half on a bias crosswise\n3\nsmall\ngreen chiles\n, such as serranos or green bird's eye, stemmed, sliced in half lengthwise, and seeded\n1\nteaspoon\nlight brown sugar\n, turbinado sugar, or granulated sugar\n1/2 cup (\n120\nml\n) full-fat\ncoconut milk\nCooked white rice or warm\nflatbreads\n, for serving\nDirections\nFor the Curry Powder:\nIn a dry skillet, toast coriander seeds, cumin seeds, fennel seeds, black peppercorns, and white peppercorns over medium heat until they darken slightly and become fragrant, about 1 minute. Remove from heat and transfer the toasted spices to a mortar or spice grinder. Allow spices to cool for 1 minute, then grind spices until finely ground. Transfer to a small bowl and stir in the chile powder and turmeric. Set aside.\nSerious Eats / Michelle Yip\nFor the Curry:\nUsing the same mortar (no need to wipe it out), pound the garlic and ginger into a smooth paste.\nSerious Eats / Michelle Yip\nIn a large sauté pan or medium Dutch oven, heat 1 tablespoon vegetable oil over medium-high until shimmering. Add the eggplant in a single layer and cook until first side is lightly browned, about 2 minutes. Flip the eggplant and cook until second side is lightly browned, about 2 minutes (we’re not looking to fully cook the eggplant; we just want to get some color on them). Transfer to a plate and set aside.\nSerious Eats / Michelle Yip\nAdd the remaining 2 tablespoons vegetable oil to the same sauté pan or Dutch oven and reduce heat to medium-low. Add the mustard seeds, fenugreek seeds, cumin seeds, and fennel seeds  and cook, stirring occasionally, until the spices are fragrant and the mustard seeds begin to sputter, 30 seconds.\nSerious Eats / Michelle Yip\nStir in the sliced onions, season with salt, and cook, stirring often, until the onion begins to soften, 6 to 7 minutes. Stir in the garlic and ginger paste along with the diced tomatoes, and cook until the tomatoes begin to break down into a sauce, about 10 minutes.\nSerious Eats / Michelle Yip\nMeanwhile, slowly add 1/2 cup (120ml) water to the curry powder while whisking to form a paste. Stir the curry paste into the broken-down tomatoes and cook until thickened, about 5 minutes.\nSerious Eats / Michelle Yip\nAdd the curry leaves to the skillet and cook until fragrant, about 1 minute. Add tamarind paste and 2 cups (475ml) water, then stir well, making sure to scrape up any bits stuck to the bottom of the skillet.\nSerious Eats / Michelle Yip\nAdd the fish head halves, reserved eggplant, sliced okra, and sliced green chiles, making sure the liquid in the skillet comes at least 2/3 of the way up the sides of the fish heads; add more water if necessary. Add a large pinch of salt and bring to a boil over medium-high heat, then cover with a lid, reduce heat to low, and simmer until the fish heads and okra are fully cooked, about 20 minutes.\nSerious Eats / Michelle Yip\nStir in the sugar and coconut milk and season with salt. Simmer for another 5 minutes, then remove from heat. Serve warm with rice or flatbread.\nSerious Eats / Michelle Yip\nSpecial Equipment\nMortar and pestle\nNotes\nI recommend using the heads of oily fish like mackerel and salmon, but feel free to use the fish heads of your choice. Have your fishmonger remove the gills and split the heads in half lengthwise for you.\nMake-Ahead and Storage\nThe curry can be refrigerated in an airtight container for up to 5 days. Freezing is not recommended.\nFish\nThe Latest\nSoutheast Asian Cuisines\nCurries\nMalaysian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/malaysian-fish-head-curry-recipe.webp?"
}