{
  "url": "https://www.seriouseats.com/five-ingredient-fried-chicken-sandwich-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Xc-Rp0vE_7d01ETPKmXXheaB09Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/five-ingredient-fried-chicken-sandwiches-beauty-shot-01-e3959b68f7d44c57b485ac0b10c5f3a9.jpg",
  "tags": [
    "Fried Chicken",
    "Chicken Thighs",
    "Chicken Mains",
    "Sandwiches"
  ],
  "title": "5-Ingredient Fried Chicken Sandwiches",
  "full_text": "5-Ingredient Fried Chicken Sandwiches\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nMarinating Time\n60 mins\nTotal\n95 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\njar\nsliced pickles\n, such as\nVlasic\n, with brine\n4\nboneless, skinless chicken thighs\nKosher salt\nand freshly ground black pepper\n1\ncup\nbuttermilk\n1 1/2\ncups\nself-rising flour\n1\nquart\npeanut, vegetable, or\ncanola oil\n4\nsoft\nhamburger buns\nor potato rolls, toasted\nDirections\nPour 3/4 cup pickle juice out of pickle jar into a measuring cup. Reserve pickles.\nSeason chicken generously with salt and pepper. Place in a plastic zipper-lock bag. Pour in pickle juice. Seal bag, pressing out as much air as possible. Refrigerate and let chicken soak in pickle juice for at least 1 hour and up to 12 hours.\nSerious Eats / Mateja Zvirotic Andrijanic\nWhen ready to fry, remove chicken from bag and discard pickle juice. Pat chicken dry with paper towels. Pour buttermilk into a medium bowl. Add flour and 1 tablespoon pepper to a second bowl. Transfer 3 tablespoons of buttermilk to bowl with flour and work it into the flour with your fingertips.\nSerious Eats / Mateja Zvirotic Andrijanic\nTransfer chicken to bowl with buttermilk and turn to coat. Working with one piece at a time, remove chicken from buttermilk, allowing excess to drip off. Add chicken to bowl with flour and turn, lifting the flour on top of it and pressing it down firmly until a thick, shaggy layer of flour has stuck to the chicken. Transfer to a plate and repeat with remaining chicken pieces.\nSerious Eats / Mateja Zvirotic Andrijanic\nHeat oil in a wok, deep cast iron skillet, or Dutch oven to 425°F (218°C) using a frying thermometer or an instant-read thermometer. Carefully lower chicken pieces into the hot oil; temperature will drop. Adjust flame to maintain a temperature of between 300 and 350°F (150 and 177°C). Cook without moving until well browned on first side, about 2 minutes. Flip chicken carefully using tongs and a slotted spatula and cook until second side is browned and chicken is fully cooked, 2 to 3 minutes longer. Transfer to a paper towel–lined plate.\nSerious Eats / Mateja Zvirotic Andrijanic\nPlace bottom buns on a work surface and top with a few pickles each. Top with fried chicken, followed by top buns. Serve immediately.\nSerious Eats / Mateja Zvirotic Andrijanic\nSpecial Equipment\nDeep\ncast iron skillet\n,\nwok\n, or\nDutch oven\nfor frying;\nfrying thermometer\nor\ninstant-read thermometer\nNotes\nIf you don't have self-rising flour, you can substitute 1 1/2 cups all-purpose flour, 1 tablespoon baking powder, and 1 teaspoon kosher salt.\nFried Chicken\nChicken Thighs\nChicken Mains\nSandwiches",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/5-ingredient-fried-chicken-sandwiches.webp?"
}