{
  "url": "https://www.seriouseats.com/flaming-holiday-punch-winter-cocktail-recipe",
  "image_url": "https://www.seriouseats.com/thmb/e04T-BWrvRkKe83oLWJtbXwrpPQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231116-SEA-FlamingPunch-VictorProtasio-hero-5d251a208a034b03af84a3db60467e1d.jpg",
  "tags": [
    "Rum",
    "Thanksgiving",
    "Christmas"
  ],
  "title": "Flaming Holiday Punch",
  "full_text": "Flaming Holiday Punch\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nActive\n15 mins\nTotal\n60 mins\nServes\n20 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5\nsmall\noranges\n(about\n1 1/4\npounds\n;\n566\ng\n), divided\n1/4\nteaspoon\nground cinnamon\n1/4\nteaspoon\nground allspice\n1/4\nteaspoon\nground nutmeg\n3\ntablespoons\nwhole cloves\n(about\n1/2\nounce\n;\n15\ng\n)\n1\n(750 ml) bottle\naged rum\n2\nquarts\n(\n1.9\nL\n)\napple cider\n1/4\ncup\ngranulated\nsugar\n,(\n1 3/4\nounces\n;\n50\ng\n) plus extra to taste\n2\ncups\n(\n473\nml\n) boiling\nwater\n(optional, should you wish for further dilution)\nDirections\nAdjust the oven rack to the middle position and heat the oven to 350°F (177℃). Slice 1 orange into thin rounds; set aside and reserve for garnish. In a small bowl, combine cinnamon, allspice, and nutmeg; set aside.\nSerious Eats / Victor Protasio\nStud the remaining 4 oranges with the whole cloves by inserting the pointed end of the clove through the orange peel until only the bud protrudes. Slice the studded oranges in half crosswise. Transfer the orange halves, cut side down, to a parchment paper-lined rimmed baking sheet. Bake studded oranges until soft and cut-side is browned, 30 to 40 minutes.\nSerious Eats / Amanda Suarez\nWarm the rum by placing the bottle in a pot of hot (not boiling) water for 10 minutes or so.\nSerious Eats / Victor Protasio\nWhile the rum warms, heat the cider in a large saucepan over medium until steamy; pour into a pitcher and have ready for use.\nSerious Eats / Victor Protasio\nWhen ready to ignite the punch, pour the warmed rum into a large heatproof Dutch oven (off heat) or heatproof punch bowl and whisk in the sugar until dissolved. Stir in roasted orange halves and transfer the Dutch oven to a well ventilated open area, away from flammable materials (on a clean stovetop with all burner off is fine).\nSerious Eats / Victor Protasio\nDim lights for effect, then, using a heatproof ladle, scoop up a small amount of the rum. Holding the ladle away from the Dutch oven (and your face, and the curtains, and the dog), light the scoop of rum using a kitchen match -- if necessary, add a little high-proof rum to aid in ignition.\nSerious Eats / Victor Protasio\nCarefully drizzle the flaming rum in the ladle into the Dutch oven, igniting the rest of the rum in the Dutch oven. Sprinkle the spice mixture, one pinch at a time, into the flames. (be careful, the flames may pop.)\nSerious Eats / Victor Protasio\nAfter a minute or two of burning, or whenever you're tired of the spectacle, douse the flames by gently pouring the hot cider (and hot water if using), over the flames with the ladle as you go. The flames may not immediately go out, but keep stirring and as the alcohol is diluted, they'll soon flicker and die. If needed, carefully place the lid on the Dutch oven to fully extinguish the flames.\nSerious Eats / Amanda Suarez\nSpecial equipment\nheatproof large Dutch oven or heatproof punch bowl, heatproof ladle, baking pan, pitcher\nRum\nThanksgiving\nChristmas"
}