{
  "url": "https://www.seriouseats.com/flan-patissier-french-custard-tart-recipe-6830370",
  "image_url": "https://www.seriouseats.com/thmb/lqBfBi7esTb0jFfw27aPxrKweWY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221118-Flan-Patissier-AmandaSuarez-10-ac85f2df6e47410a80778191fc13f1f3.JPG",
  "tags": [
    "French",
    "Custards, Mousses & Puddings",
    "The Latest"
  ],
  "title": "Flan Pâtissier (French Custard Tart)",
  "full_text": "Flan Pâtissier (French Custard Tart)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nChilling Time\n5 hrs\nTotal\n5 hrs 55 mins\nServes\n8\nto 10 servings\nMakes\n1 9 1/2-inch tart\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nrecipe\nold-fashioned flaky pie dough\n, chilled (see note)\nOne\nrecipe\nvanilla pastry cream\n, cold or at room temperature (see note)\n2\nlarge\negg yolks\n(30g), lightly beaten\nDirections\nPlace dough on a generously floured work surface. Using a rolling pin and adding flour as needed underneath and on top of the dough to prevent sticking, roll out to a 13-inch circle. Transfer to a 9 1/2–inch tart pan by carefully rolling dough around the rolling pin, then unrolling over the pan. Press dough gently yet firmly into the corners and up the sides of the pan. Dust off flour with a pastry brush, then trim excess dough that extends past the rim of the pan. Transfer tart shell to a rimmed baking sheet and refrigerate for 1 hour.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Scrape pastry cream into prepared tart shell and, using a small offset spatula, spread the filling in an even layer. Using a pastry brush, brush surface of pastry cream all over with egg yolks.\nSerious Eats / Amanda Suarez\nBake flan until puffed and deep golden brown, about 45 minutes.\nSerious Eats / Amanda Suarez\nSet baking sheet with flan on a wire rack and let cool to room temperature, about 1 hour. Transfer flan to the refrigerator and chill until filling is cold and firm, at least 4 hours but preferably 8 hours. Slice and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRolling pin, small offset spatula, 9 1/2–inch tart pan with removable bottom, pastry brush\nNotes\nIf you like, you can replace the pie dough with 1/2 recipe of\npâte sucrée\n.\nYou can use\nlemon\nor\nchocolate\npastry cream in place of vanilla pastry cream. Flan pâtissier filled with lemon pastry cream is my personal favorite.\nMake-Ahead and Storage\nFlan pâtissier can be refrigerated in an airtight container for up to 3 days.\nFrench\nCustards, Mousses & Puddings\nThe Latest"
}