{
  "url": "https://www.seriouseats.com/florentine-omelette-spinach-and-cheese",
  "image_url": "https://www.seriouseats.com/thmb/qyPKrYgK1E57w73Je6JqMgR2v2E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__06__20200602-florentine-spinach-cheese-omelette-daniel-gritzer-5-31c02922a4c94eff9c44c4c83c7e6635.jpg",
  "tags": [
    "American",
    "Stovetop Eggs",
    "Gruyere",
    "Spinach",
    "Breakfast & Brunch"
  ],
  "title": "Florentine Omelette With Spinach and Cheese Recipe",
  "full_text": "Florentine Omelette With Spinach and Cheese Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n10 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5\nlarge\neggs\nKosher salt\nand freshly ground black or white pepper\n3 1/2 ounces (\n100\ng\n)\ngrated Gruyère\nor Swiss cheese\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, divided\n2\nmedium\ncloves garlic\n, minced\n1 pound (\n450\ng\n)\nfresh Savoy spinach\n, thoroughly washed, or 10 ounces (283g) defrosted frozen spinach\n(see note)\nDirections\nIn a medium bowl, season eggs with salt and pepper, then whisk until homogeneous and frothy. Set aside.\nAdd cheese to a separate medium heatproof bowl, and line a large plate with a double layer of paper towels. In a 10-inch nonstick skillet, melt 1 tablespoon (15g) butter over medium-high heat. Add garlic and cook, stirring frequently, until garlic is aromatic and just begins to soften, about 30 seconds.\nIf using fresh spinach:\nAdd spinach to skillet, cover, and cook until just wilted, about 2 minutes (you may have to press down on the spinach with the lid at first to cover, but the spinach will rapidly lose volume as it wilts). Uncover, season with salt and pepper, and stir to combine. Increase heat to medium-high and cook, stirring frequently, until spinach is very soft and most of the liquid it has released has evaporated, about 4 minutes.\nIf using defrosted frozen spinach:\nAdd spinach to skillet, season with salt and pepper, and stir well to combine. Increase heat to medium-high and cook, uncovered, until excess water has evaporated, about 4 minutes.\nTransfer cooked spinach to paper towel-lined plate, roll up in the towels, and squeeze gently to extract any additional excess moisture; discard paper towels and any accumulated liquid. Transfer hot spinach to bowl with cheese.\nWipe out now-empty skillet, and melt remaining 1 tablespoon (15g) butter over medium heat, swirling frequently, until butter is lightly browned. Re-whisk eggs until foamy, then add to skillet and cook, using a silicone spatula to push the edges in toward the center as they set and tilting the pan to spread the uncooked egg underneath. Continue pushing in the edges of the eggs and tilting the skillet, working all around the pan, until omelette is almost set, about 45 seconds.\nSprinkle spinach and cheese mixture over half of omelette, remove from heat, cover, and let omelette sit until mostly or fully cooked through on top (depending on your preferred consistency), about 1 minute.\nUsing silicone spatula, loosen the edges of the omelette from skillet and shake skillet to ensure that it's not stuck. Carefully fold omelette in half to enclose the filling, then slide it onto a serving plate and serve immediately.\nSpecial Equipment\n10-inch\nnonstick skillet\n,\nsilicone spatula\nNotes\nIf using fresh spinach, make sure to wash it in multiple changes of water until no traces of sand can be seen in the bottom of the washing basin. We strongly prefer Savoy (curly) over flat-leaf or baby spinach for cooking.\nThe amount of frozen spinach called for here is 10 ounces, which is the most common size package of frozen spinach; it will yield slightly more spinach than one pound of fresh spinach once cooked. If you want, you can use a little less than what's in the frozen spinach package, though then you will have to figure out what to do with the remainder. We prefer to use it all and just enjoy an overstuffed omelette; no harm in a little extra spinach, right?\nMake-Ahead and Storage\nThis omelette is best enjoyed right away.\nRead More\nSoufflé Omelette With Cheese\nAmerican\nStovetop Eggs\nGruyere\nSpinach\nBreakfast & Brunch",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/florentine-omelette-with-spinach-and-cheese-recipe.webp?"
}