{
  "url": "https://www.seriouseats.com/flourless-coconut-lime-cake-with-white-chocol",
  "image_url": "https://www.seriouseats.com/thmb/gedWjAlyZzqjQ7k2j6nx7Gcxq8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__03__20140320-286962-flourless-bitter-lime-coconut-cake-whitechocolate.2-a6e6b72836d8494291a274edb01c00a3.jpg",
  "tags": [
    "Cakes",
    "Gluten-free Desserts",
    "Coconut",
    "Lime"
  ],
  "title": "Flourless Bitter Lime Coconut Macaroon Cake with White Chocolate Whipped Cream Recipe",
  "full_text": "Flourless Bitter Lime Coconut Macaroon Cake with White Chocolate Whipped Cream Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n65 mins\nActive\n30 mins\nCooling Time\n30 mins\nTotal\n115 mins\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\n3\nounces\nwhite chocolate\n, finely chopped\n1\ncup\nheavy cream\n, divided\n3\nlarge\nseedless\nlimes\n(\n10 to 12\nounces\n)\n6\nlarge\neggs\n1 1/4\ncup\n(\n8 3/4\nounces\n)\ngranulated sugar\n, divided\n1\nteaspoon\nvanilla extract\n1/4\nteaspoon\nplus\n1/8\nteaspoon\nsalt\n1 1/4\ncups\nsweetened, shredded coconut\n1\ncup\nblanched sliced almonds\n3\ntablespoons\n(\n1 1/2\nounces\n)\nunsalted butter\n, melted\nDirections\nHeat white chocolate and 1/4 cup cream in microwave safe bowl on reduced power until melted and smooth. Whisk into remaining cream and chill until completely cold.\nAdjust oven rack to middle position and preheat to 350°F (175°C). Line bottom of 8-inch springform pan (see note) with parchment paper and grease sides. Cover bottom of pan with foil. Zest 1 or 2 limes to get 2 tablespoons lightly packed zest; set zest aside. Using peeler, remove rind and as much of the white pith as possible from all of the limes; discard pith.\nUsing a fork, carefully poke a few holes in limes. Place in microwave safe bowl. Cover and microwave on high until limes are soft and juice is beginning to pool at the bottom of bowl, 5 to 6 minutes. Remove cover and let cool.\nWhisk eggs, 1 cup sugar, reserved lime zest, vanilla, and salt in large bowl until well combined. Place remaining 1/4 cup sugar, coconut, and almonds in food processor and pulse until mixture is fine. Whisk into egg mixture.\nWhen limes are cool enough to handle, process in food processor to a puree (about 2 minutes) and whisk into egg mixture along with any lime juice from the bowl. Whisk in melted butter. Pour into prepared pan and bake until cake is golden and set, about 55 minutes. Transfer pan to wire rack to cool completely.\nWhen ready to serve, whip white chocolate mixture using mixer fitted with whip attachment until medium peaks form. Serve a dollop of cream on top of slices of cake.\nSpecial Equipment\n8-inch springform pan (or 8-inch round cake pan) see note\nNotes\nA springform pan makes it easier to serve or remove the cake, but a regular 8-inch round cake pan will also work. You'll just need to carefully invert the cake out of the pan. I covered the bottom of the springform pan with foil in case of leakage.\nCakes\nGluten-free Desserts\nCoconut\nLime"
}