{
  "url": "https://www.seriouseats.com/flour-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Aa5r0Zlkg-oCUk-hTDW3By7u3Kc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__03__20190225-neopolitan-cake-vicky-wasik-2-2d87c256526c42cca0fb234d3356ce6e.jpg",
  "tags": [
    "Desserts"
  ],
  "title": "Flour Frosting (a.k.a. Ermine Frosting) Recipe",
  "full_text": "Flour Frosting (a.k.a. Ermine Frosting) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n5 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n16 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\nounce\nall-purpose flour\n(about 3 tablespoons plus 2 teaspoons; 28g)\n6\nounces\nmilk\n,\nany percentage will do\n(about 3/4 cup; 170g)\n3 1/4 ounces (\n96\ng\n) plain or\ntoasted\nsugar\n(see note)\nHeaping 1/4 teaspoon (\n1.5\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for table salt, use about half as much by volume or the same weight\n6\nounces\n(160g)\nunsalted butter\n, softened to about 65°F (18°C)\n1/4\nounce\nvanilla extract\n(1 1/2 teaspoons; 7g), plus more to taste\nDirections\nIn a 10-inch skillet or 3-quart saucier, whisk together flour and milk. Place over medium heat, whisking constantly, and cook until thick and pudding-like, about 2 minutes. Off heat, add sugar and salt. Whisk until sugar has dissolved and the \"pudding\" is homogeneous but thin. Scrape mixture into a wide, shallow dish, such as a pie plate, and cool to approximately 70°F (21°C).\nSerious Eats / Vicky Wasik\nPlace butter in the bowl of a stand mixer fitted with a paddle attachment. Mix on low until the butter looks smooth, then increase speed to medium and beat until soft and light, about 5 minutes. Begin adding the cooled pudding, a few tablespoons at a time. Once it's fully incorporated, pause to scrape bowl and beater with a flexible spatula, then resume beating until perfectly smooth.\nSerious Eats / Vicky Wasik\nSwitch to the whisk attachment and add vanilla. Whip on low to combine, then increase speed to medium-high and continue whipping until silky-smooth and soft, with a light, melt-in-your-mouth consistency, about 3 minutes more, or to a working temperature of approximately 75°F (24°C). Season to taste with additional salt and/or vanilla as needed. Use immediately, or consult the troubleshooting guide below to address any textural inconsistencies.\nSerious Eats / Vicky Wasik\nTroubleshooting:\nIf the frosting feels dense, stiff, greasy, or curdled, it is likely too cold; to warm, briefly set over a pan of steaming water, just until you see the edges melting slightly, then re-whip. If the frosting feels soft and loose, it is likely too warm. Pop it in the fridge for 15 minutes to cool, then re-whip.\nSpecial Equipment\n3-quart saucier\nor\n10-inch skillet\n,\nballoon whisk\n,\nstand mixer\n,\nflexible spatula\nNotes\nThis recipe will work with any type of sugar, including brown sugar and semi-refined styles, such as turbinado or Sugar In The Raw.\nMake-Ahead and Storage\nIn a quart-sized, heavy-duty zip-top bag, the frosting can be refrigerated for one week or frozen for several months. Before use, thaw to about 70°F (21°C) and re-whip until smooth, consulting the troubleshooting guide above as needed to address textural concerns.\nRead More\nThe World of Buttercreams: 6 Varieties to Try at Home\nA Guide to Cake Frosting\nFor Your Next Baking Adventure, Mix and Match Your Layers\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/flour-frosting-aka-ermine-frosting-recipe.webp?"
}