{
  "url": "https://www.seriouseats.com/flourless-chocolate-cake-recipe-8775412",
  "image_url": "https://www.seriouseats.com/thmb/pUbc--g_ou0p3RDCNhHlCyp-SbU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2024123-SEA-FlourlessChocolateCake-FredHardy-Hero2-21-49107930e77a4ccc8eef289b2fb0ebce.jpg",
  "tags": [
    "Chocolate",
    "The Latest",
    "Cakes",
    "Desserts"
  ],
  "title": "Flourless Chocolate Cake",
  "full_text": "Flourless Chocolate Cake\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nCooling Time\n2 hrs\nTotal\n3 hrs\nServes\n8\nMakes\n1 9-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nBaking\nspray\nwith flour (see notes)\n113\ng\nbittersweet chocolate\n(\n4\nounces\n; about\n2/3\ncup\n), 60% cacao, finely chopped\n113\ng\nunsalted butter\n(\n4\nounces\n;\n8\ntablespoons), cubed\n1\nteaspoon\nfine instant\nespresso\npowder, such as Delallo\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n46\ng\nunsweetened cocoa powder\n, sifted (about\n1 3/4\nounces\n;\n1/2\ncup\n), plus more for dusting\n2\nteaspoons\nvanilla extract\n3\nlarge eggs\n(about\n5 1/4\nounces\n;\n150\ng\n), at room temperature\n150\ng\ngranulated sugar\n(about\n5 1/4\nounces\n;\n3/4\ncup\n)\nSweetened\nwhipped cream\nor\nvanilla ice cream\n, for serving (optional)\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175ºC). Using baking spray, coat the interior of a 9-inch springform pan; line\nbottom\nof pan with a parchment paper round and the sides with a separate parchment strip; set aside.\nSerious Eats / Fred Hardy\nFill a medium saucepan with water to a depth of 1 inch and bring to a boil over medium-high; reduce heat to a simmer over medium-low. In a medium-size heatproof bowl, combine chocolate, butter, espresso powder, and salt, and place over saucepan of simmering water. Cook, stirring frequently, until chocolate mixture is melted and smooth, 5 to 6 minutes. Remove from heat, being careful not to drip any water into the melted chocolate. Whisk in cocoa powder and vanilla extract until combined and smooth; set aside.\nSerious Eats / Fred Hardy\nIn the bowl of a stand mixer fitted with the whisk attachment, combine eggs and sugar. Whisk on medium-high speed until mixture is pale, falls off the whisk attachment in thick ribbons (they should slowly sink back into the batter) and has increased by about 1/3 in volume, 5 to 7 minutes. (Alternatively, an electric hand mixer fitted with the whisk attachment can be used to whip the eggs and sugar.) Using a flexible spatula, fold chocolate mixture into eggs gradually until just combined and no streaks remain. Gently scrape chocolate batter into prepared pan, using a small offset spatula to evenly spread and smooth the top if necessary.\nSerious Eats / Fred Hardy\nBake until top is dry and a wooden toothpick inserted near center of cake comes out with a few moist crumbs, about 25 minutes. Let cool in pan on a wire rack for 30 minutes. Run a small offset spatula or butter knife around edges of cake to loosen, if necessary; remove pan sides, and discard strips of parchment. Let cake cool completely on pan base on wire rack, about 1 1/2 hours. Using a large offset spatula, gently loosen cake from pan base and carefully transfer cake to a plate, removing and discarding parchment round. Using a fine-mesh sieve, dust cake with additional cocoa powder. Serve with sweetened whipped cream or vanilla ice cream, if desired.\nSerious Eats / Fred Hardy\nSpecial Equipment\n9-inch springform pan, parchment paper, medium saucepan, stand mixer, wire rack, fine-mesh sieve\nNotes\nTo make this cake gluten-free, skip the baking spray with flour. Brush cake pan with softened unsalted butter, then dust with cornstarch or your gluten-free flour blend of choice, shaking out excess.\nThe cake can also be dusted with confectioners’ sugar.\nMake-Ahead and Storage\nOnce cooled, the cake can be stored in an airtight container at room temperature for up to 3 days or refrigerated in an airtight container for up to 1 week.\nThe cake can be tightly wrapped in plastic and frozen for up to 1 month. To thaw, let sit in refrigerator overnight.\nChocolate\nThe Latest\nCakes\nDesserts"
}