{
  "url": "https://www.seriouseats.com/focaccia-di-recco-5214962",
  "image_url": "https://www.seriouseats.com/thmb/xE1BoW202qek2xcNmPZ1PwA0PCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210930-focaccia-di-recco-vicky-wasik-95-4ad909cce23a415281931a9d666e5e60.jpg",
  "tags": [
    "Italian",
    "Bread",
    "Snacks & Appetizers",
    "Cheese",
    "The Latest"
  ],
  "title": "Focaccia di Recco",
  "full_text": "Focaccia di Recco\nClose\nJump to recipe\nPrep\n30 mins\nCook\n20 mins\nDough Resting\n45 mins\nTotal\n95 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n500\ng\n(17.5 ounces; about 3 1/4 cups)\nbread flour\n, plus more for rolling\n15g (0.5 ounce;\n1\ntablespoon\n)\nsugar\n10\ng\n(0.3 ounce; 2 1/2 teaspoons) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or an equal amount by weight\n300g (10.5 ounces; about\n1 1/4\ncups\n)\nwater\n50\ng\n(1.75 ounces; 3 tablespoons plus 1 teaspoon)\nextra-virgin olive oil\n, plus extra for drizzling\n400\ng\n(14 ounces)\nStracchino cheese\n(a.k.a. Crescenza), divided (see note)\nCoarse sea salt\n, such as Maldon or fleur de sel\nDirections\nAdjust oven rack to lower-middle position. Place Baking Steel or stone on it and preheat oven to highest possible temperature, 500° to 550°F (260° to 290°C).\nIn a large bowl, whisk together flour, sugar, and salt until thoroughly combined. Add water and olive oil and stir with a wooden spoon until no dry flour remains and a shaggy dough forms, about 2 minutes. Knead with hands if needed to bring dough together. Let dough rest for 5 minutes.\nSerious Eats / Vicky Wasik\nTurn dough out onto a floured surface and, using floured hands, knead until dough is mostly smooth and no longer sticks to your hands, 2 to 4 minutes. Dust work surface, dough, and hands with more flour as needed throughout the kneading process. Weigh dough, it should weigh approximately 900g (2 pounds). Divide into four total portions: two weighing 250g and two weighing 200g.\nSerious Eats / Vicky Wasik\nWorking with one portion at a time, cup dough between palms of your hands and work it in circular motions to form a smooth ball. Repeat with remaining dough. Cover dough with a clean kitchen towel or by overturning the bowl used to make the dough, or transfer to a lidded proofing container, and allow to rest at room temperature for at least 45 minutes and up to 1 hour. Alternatively, transfer dough balls to an airtight container and refrigerate for up to 24 hours.\nSerious Eats / Vicky Wasik\nLightly oil a 15-inch round pizza tray or rimmed baking sheet and place on top of a large bowl. Flour your work surface. Working with one 250g portion of dough, flour surface of dough and, using a rolling pin, roll into a 12-inch circle if using a round pizza tray or a 12- by 9-inch rectangle if using a rimmed baking sheet. While rolling, occasionally rotate and lift dough, adding more flour as needed, to ensure dough doesn't stick. Gently stretch dough into a 16- to 17-inch circle or 18- by 13-inch rectangle, about 1/16-inch thick, by draping over knuckles and gently stretching. Transfer dough to prepared pizza tray, stretching it so that there is an even 1- to 2-inch overhang of dough, then gently press it so that it is flush with the pan.\nSerious Eats / Vicky Wasik\nUsing clean hands or two spoons, dollop half of the Stracchino (200g; 7 ounces) in 1 tablespoon (15g) pieces over the surface of the dough.\nSerious Eats / Vicky Wasik\nUsing a rolling pin, roll out one 200g portion of dough in the same way as the previous portion. Gently stretch dough into a circle or rectangle (it should be thinner than the previous portion) by draping over knuckles and gently stretching. Place dough directly on top of the Stracchino-topped dough, stretching it so that it covers the entire surface, with a 1-inch overhang on all sides.\nSerious Eats / Vicky Wasik\nUsing your fingers, gently tear small openings in the top portion of dough, around the pieces of Stracchino. Gently press down on the top portion of dough, working around the pieces of Stracchino, so that it touches the bottom portion of dough. Hold the rolling pin at an angle, flush against the edge of the pizza tray, and work it around the entire edge of the tray to cut off the overhanging dough; excess dough can be saved for making more focaccia, or discarded. Drizzle surface of the dough with olive oil and sprinkle lightly with sea salt.\nSerious Eats / Vicky Wasik\nTransfer tray to oven, positioning it on top of Baking Steel or stone. Bake until dough is deep golden brown and cheese is melted, rotating tray 180 degrees halfway through baking, 8 to 10 minutes. Remove from oven and transfer focaccia to a wire rack set inside a rimmed baking sheet. Allow focaccia to cool for at least 30 seconds, then transfer to a cutting board, slice, and serve immediately.\nOnce tray or baking sheet is cool enough to handle, wipe clean with a paper towel. Repeat steps 5 through 9 with remaining portions of dough and Stracchino.\nSpecial Equipment\nBaking Steel\n,\ndigital scale\n,\n15-inch round pizza baking tray\nor\nrimmed baking sheet\n, wire rack.\nNotes\nStracchino, which is also known as Crescenza or Stracchino di Crescenza, can be found at specialty cheese shops and Italian markets such as Eataly, or\nonline\n. If Stracchino is unavailable, you can substitute with Taleggio or a soft, washed rind cheese such as Camembert. These cheeses are more aged, with a funkier and more assertive flavor than Stracchino, so the results won't be quite the same, but they will still make a tasty focaccia col formaggio.\nYou can make this recipe without a Baking Steel or stone; the bottom crust just won't be as crisp.\nThe recipe can be halved to make one focaccia.\nMake-Ahead and Storage\nThe finished focaccia is best enjoyed immediately. Leftover focaccia can be wrapped in foil and refrigerated for up to 2 days. Reheat in a 325°F (165°C) oven. The dough can be made in advance and refrigerated in an airtight container for up 24 hours. Bring to room temperature before rolling out.\nItalian\nBread\nSnacks & Appetizers\nCheese\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/focaccia-di-recco.webp?"
}