{
  "url": "https://www.seriouseats.com/food52s-short-rib-ragu",
  "image_url": "https://www.seriouseats.com/thmb/bG0lvcvqlmNv95nVuQT5wMrcD_4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121221-233989-cook-the-book-short-rib-ragu-0a29d2ced2fa4ae0b4b5e3b6191185a8.jpg",
  "tags": [
    "Short Ribs",
    "Braised & Stewed Beef",
    "Beef Mains"
  ],
  "title": "Food52's Short Rib Ragu",
  "full_text": "Food52's Short Rib Ragu\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nActive\n45 mins\nTotal\n50 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Ragu:\n1\nounce\ndried porcini mushrooms\n5 to 6\npounds\nshort ribs\nKosher salt\nand freshly ground black pepper\n1\ntablespoon\nvegetable oil\n, bacon fat, or lard\n1\nlarge\nonion\n, chopped\n2\nmedium\ncarrots\n, peeled and chopped\n2\ncelery\nstalks\n, chopped\n2\nlarge\ngarlic cloves\n, finely chopped\n2\ntablespoons\ntomato paste\n1\ntablespoon\nanchovy paste\n1/2\n(\n750ml\n)\nbottle\nred wine\n1 (\n14\n-\nounce\n)\ncan fire-roasted tomatoes\n, with their juices\n1\ntablespoon\nDijon mustard\n3 to 4\ndashes\nWorcestershire sauce\n1\nteaspoon\ndried thyme\n1\nteaspoon\ndried oregano\n1\nlarge\nrosemary sprig\n, leaves removed and chopped\n2\nbay leaves\n4 to 5\ncups\nchicken stock\n, low-sodium broth, or water\nFor the Gremolata:\n1\nlarge\ngarlic clove\n, minced\nGrated\nzest\nof\n1\nlarge\nlemon\n1/4\ncup finely chopped\nfresh flat-leaf parsley\n1/2\nteaspoon\nsalt\n1\nteaspoon\nolive oil\nHot polenta\n, for serving\nDirections\nFor the Ragu:\n(Note: This is best prepared one day before serving). Heat oven to 350°F (180°C). Soak dried mushrooms in 2 cups boiling water for at least 10 minutes, until soft.\nMeanwhile, season ribs well with salt and pepper. Heat oil in a large ovenproof heavy pot (such as a 5-quart enameled cast iron Dutch oven) over medium heat until shimmering. Brown ribs in batches for 2 to 3 minutes per side; set aside.\nPour out all but 1 tablespoon of fat from the pot, then sauté onion, carrots, and celery until soft. Add garlic and stir until fragrant. Create a hot spot in the pot by moving vegetables aside, leaving about a 3-inch circle bare. Add tomato paste and anchovy paste to the hot spot and stir vigorously until caramelized, then stir this mixture into vegetables.\nAdd red wine to deglaze the pot and cook until the liquid is reduced by half. Add tomatoes, mustard, and Worcestershire sauce. Lift mushrooms from the soaking liquid and add to the pot, then add the soaking liquid, minus the last 1/4 inch to keep sediment out of your dish, and herbs. Add ribs back to the pot, then add enough chicken stock so ribs are nearly covered.\nBring liquid to a boil, then cover tightly and braise in the oven for at least 3 hours, or until the ribs are fall-apart tender.\nRemove ribs from the braising liquid and set aside until cool enough to handle. Meanwhile, remove bay leaves from braising liquid and discard. Purée braising liquid with an immersion blender (or in batches in a regular blender, then return to the pot). Set the pot over medium-low heat to reduce if sauce seems thin.\nWhen ribs have cooled, remove and discard bones and any large pieces of fat. Shred beef and return it to the pot. Let cool to room temperature, skimming any large pools of fat from the surface, and refrigerate overnight.\nFor the Gremolata:\nThe next day, mix all ingredients in a small bowl and let sit at room temperature for an hour before serving.\nRemove any solidified fat from the surface of ragu and reheat. Serve over polenta, sprinkled with gremolata.\nShort Ribs\nBraised & Stewed Beef\nBeef Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/food52s-short-rib-ragu.webp?"
}