{
  "url": "https://www.seriouseats.com/food-lab-weisswurst-turkey-thanksgiving-sausage-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zKq67u3TJ3B0wknpgyc-y8ymP3U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__11__20131112-turkey-weisswurst-recipe-34-ba385b3d5ab64d1786f45a7b39c20e8e.jpg",
  "tags": [
    "Turkey Breast",
    "German",
    "Gluten-free Mains",
    "Stovetop Sausages",
    "Homemade Sausages"
  ],
  "title": "Turkey Weisswurst (White German-Style Sausage With Lemon, Nutmeg, and Parsley) Recipe",
  "full_text": "Turkey Weisswurst (White German-Style Sausage With Lemon, Nutmeg, and Parsley) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n35 mins\nActive\n90 mins\nChilling and Freezing Time\n11 hrs 20 mins\nTotal\n12 hrs 10 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n600\ng\nlean turkey meat\n(such as tenderloins or breast), trimmed of connective tissue, cut into 1/2-inch cubes\n15\ng\nkosher salt\n320\ng\nsalted pork back fat\n75\ng\nfinely\ndiced yellow onion\n1/2\nteaspoon\ngrated\nlemon zest\nfrom\n1\nwhole\nlemon\n1/2\nteaspoon\ngrated\nfresh ginger\n1/2\nteaspoon ground\nwhite pepper\n1/4\ncup\nfinely chopped\nfresh parsley leaves\n1/4\nteaspoon\ngrated\nnutmeg\nHog casing\n, soaked and rinsed\n30\ng\ncrushed\nice\n2\ntablespoons\nbutter\n(if browning in skillet)\nWhole grain\nor sweet\nGerman mustard\nfor serving\nDirections\nCombine turkey and salt in a large bowl and toss until evenly coated. Transfer to an airtight container and refrigerate at least 1 night and up to 2 days. Meanwhile, bring a medium pot of water to a boil over high heat. Add salt pork and onion and cook until translucent, about 2 minutes. Drain, rinse under cold water, and place in freezer until ready to use.\nSerious Eats / J. Kenji López-Alt\nCombine turkey, lemon zest, ginger, white pepper, parsley, and nutmeg in the bowl of a food processor. Process until a smooth paste is formed, about 30 seconds, stopping to check temperature and scrape down sides every 10 seconds. If mixture rises above 50°F (10°C), place entire work bowl of food processor in freezer for 10 minutes before continuing.\nSerious Eats / J. Kenji López-Alt\nAdd crushed ice to food processor and process until ice chunks are gone, about 30 seconds. With machine running, slowly add frozen fat and onions, stopping every 15 seconds to scrape down sides and check temperature. If mixture rises above 50°F (10°C), place entire work bowl of food processor in freezer for 10 minutes before continuing. Process until mixture is completely smooth. Cook a small amount of mixture in a skillet or in the microwave to taste for seasoning and adjust according to taste.\nSerious Eats / J. Kenji López-Alt\nFill pastry bag fitted with a smooth round tip or a sausage stuffer with mixture, being careful to incorporate as little air as possible. Feed hog casings over tip and tie off the end. Fill casings slowly and steadily, tying or twisting off links as you go if desired. Chill sausages at least 1 hour and up to overnight before cooking.\nSerious Eats / J. Kenji López-Alt\nTo cook, bring 2 quarts of water to a simmer in a medium pot and remove from heat. Add sausages, cover, and let cook for 20 minutes. Serve as-is with mustard, or place in freezer for 10 minutes. Remove sausages from freezer and melt butter in a large skillet over medium heat until foaming subsides. Add sausages and cook, turning occasionally, until golden brown on both sides, about 4 minutes. Serve with mustard.\nSpecial Equipment\nKitchen scale\nwith gram measurement,\nfood processor\n,\ninstant-read thermometer\n,\npastry bag\nor sausage stuffer\nRead More\nRoasted Garlic and Feta Chicken Sausage\nBuffalo Chicken Sausages\nChicken Sausage with Basil and Tomatoes\nRyan Farr's New York-Style Hot Dogs\nHomemade Merguez Sausage\nSerious Entertaining: A Bavarian-Style Alpine Feast\nTurkey Breast\nGerman\nGluten-free Mains\nStovetop Sausages\nHomemade Sausages"
}