{
  "url": "https://www.seriouseats.com/foolproof-bearnaise-sauce-recipe",
  "image_url": null,
  "tags": [
    "Western European",
    "French"
  ],
  "title": "Foolproof Béarnaise Sauce",
  "full_text": "Foolproof Béarnaise Sauce\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n15 mins\nTotal\n30 mins\nServes\n14 servings\nMakes\n1 3/4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\ndry white wine\n1/4\ncup\nwhite wine vinegar\n3\nsprigs\nchervil\n, leaves finely minced, stems reserved separately (optional; if not using add an extra sprig of tarragon)\n3\nsprigs\ntarragon\n, leaves finely minced, stems reserved separately\n1\nsmall\nshallot\n, roughly chopped\n1/2\nteaspoon\nwhole\nblack peppercorns\n2\nlarge\negg yolks\nKosher salt\n1 1/2\nsticks\n(\n12\ntablespoons\n)\nunsalted butter\nDirections\nCombine wine, vinegar, herb stems, shallot, and black peppercorns in a small saucepan. Bring to a simmer over medium-high heat and lower heat to maintain a gentle simmer. Cook until reduced to about 1 1/2 tablespoons of liquid, about 15 minutes. Carefully strain liquid through a fine-mesh strainer into a small bowl, pressing on the solids with the back of a spoon to extract as much liquid as possible.\nSerious Eats / J. Kenji López-Alt\nCombine wine reduction, egg yolks, and a pinch of salt in the bottom of a cup that barely fits the head of an immersion blender. Melt butter in a small saucepan over high heat, swirling constantly, until foaming subsides. Transfer butter to a 1-cup liquid measuring cup.\nSerious Eats / J. Kenji López-Alt\nPlace head of immersion blender into the bottom of the cup with the wine reduction and turn it on. With the blender constantly running, slowly pour hot butter into cup. It should emulsify with the egg yolk and wine reduction. Continue pouring until all butter is added. Sauce should be thick and creamy (see notes). Season to taste with salt. Whisk in chopped tarragon and chervil, if using. Serve immediately, or transfer to a small lidded pot and keep in a warm place for up to 1 hour before serving. Béarnaise cannot be cooled and reheated.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nImmersion blender\n, tall container that fits blender head,\nsmall saucepan\n,\nfine mesh strainer\n, small lidded pot (optional)\nNotes\nIf your béarnaise is thin and runny, transfer to a large bowl set over a pot of barely simmering water. Whisk constantly and vigorously until sauce is thickened.\nRead More\nThe Food Lab's Definitive Guide to Grilling Steak\nReverse-Seared Steak\nCharred Asparagus with Miso Béarnaise Sauce\nWestern European\nFrench"
}