{
  "url": "https://www.seriouseats.com/foolproof-strawberry-rhubarb-pie-recipe-11740992",
  "image_url": "https://www.seriouseats.com/thmb/fKHKUqdOaZeWhFZwfaKHfzRujQI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230501-SEA-StrawberryRhubardPie-Amanda-Suarez-hero-497882d362804eae9ad621a553e228af.jpg",
  "tags": [
    "Recipes",
    "Pies",
    "Fruit",
    "Strawberry",
    "Summer Desserts"
  ],
  "title": "A Foolproof Rhubarb Pie That Won’t Turn to Soup, Thanks to a Genius Trick",
  "full_text": "A Foolproof Rhubarb Pie That Won’t Turn to Soup, Thanks to a Genius Trick\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nMacerating and Cooling Time\n2 hrs 45 mins\nTotal\n4 hrs 15 mins\nMakes\n1 9-inch pie\nCook Mode\n(Keep screen awake)\nIngredients\n6\ncups\nrhubarb\n(\n21\nounces\n;\n600\ng\n), trimmed and cut into 1/2-inch pieces, about ten 24-inch stalks\n2\ncups\nstrawberries\n(\n11\nounces\n;\n310\ng\n), trimmed and cut into 1/2-inch pieces\n1 1/2\ncups\ngranulated sugar\n(10.5\nounces\n;\n300\ng\n)\n3\ntablespoons\ncornstarch\n(\n3/4\nounces\n;\n21\ng\n)\n1\ntablespoon\n(\n10\ng\n)\npectin\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nrecipe\nbuttery, flaky crust\n, prepared for a double-crusted pie\n1\nteaspoon\nvanilla paste\n(see note)\n3\ntablespoons\nstrawberry jam\nor\npreserves\n(\n2.75\nounces\n;\n75\ng\n)\n1\nlarge\negg\n, lightly beaten, for glazing\nDirections\nIn a large bowl, use a silicone spatula to toss rhubarb and strawberries with sugar to evenly coat. Set aside to macerate for 1 hour.\nIn a small bowl, whisk cornstarch, pectin, and salt to combine; set aside.\nMeanwhile, Shape Pie Crust:\nPlace pie dough on a well-floured surface. Using a rolling pin, roll 1 disc of pie dough into a circle roughly 14 inches in diameter. Transfer pie dough to a 9-inch pie plate, lightly cover with plastic wrap, and refrigerate until ready to use.\nSerious Eats / Amanda Suarez\nFor a Solid-Top Pie:\nRoll remaining dough as before; place dough on a rimmed baking sheet lined with parchment paper. Lightly cover with plastic wrap, and refrigerate until ready to use.\nSerious Eats / Amanda Suarez\nFor a Lattice-Top Pie:\nRoll remaining dough into a 9- by 15-inch rectangle. Using a pizza cutter, fluted pastry wheel, or knife, cut dough into a dozen 10-inch strips, each about 1-inch wide. Set dough strips on a rimmed baking sheet lined with parchment paper, lightly cover with plastic wrap, and refrigerate until ready to use.\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nSerious Eats / Vicky Wasik\nSet a colander over a large bowl and drain macerated fruit. Pour macerating liquid into a measuring cup; you should have about 1 3/4 cups liquid. Reserve 6 tablespoons; discard remainder or reserve for another use.\nIn a large pot, combine rhubarb, strawberries, vanilla paste, and strawberry jam. Cook over medium heat, stirring often, until fruit softens slightly and begins to release some liquid, about 2 minutes. Sprinkle with cornstarch mixture; cook, stirring constantly, until fruit is evenly coated and cornstarch begins to stick to bottom of skillet, about 1 minute. Stir in 6 tablespoons of reserved macerating liquid and bring to a simmer. Cook, stirring often, until mixture just thickens, about 2 minutes. Remove from heat. Scrape fruit filling to a large bowl; set bowl over prepared ice bath. Let sit until room temperature, about 30 minutes.\nAdjust oven rack to middle position and preheat oven to 425°F (220°C).\nScrape filling into prepared pie shell and top with pie dough or\nweave strips into a lattice\n. Using a pair of kitchen scissors, trim edges of both pie crusts until they overhang the edge of the pie plate by 1/2 inch all the way around. Using a pair of kitchen scissors, trim edges of both pie crusts until they overhang the edge of the pie plate by 1/2 inch all the way around. Fold edges of both pie crusts down together, tucking them in between the bottom crust and the pie plate and working your way all the way around the pie until everything is tucked. Use the forefinger on your left hand and the thumb and forefinger on your right hand to crimp the edges. If using a solid top crust, cut 5 slits in the top with a sharp paring knife for ventilation.\nSerious Eats / Amanda Suarez\nChill pie in the freezer for 15 minutes. When ready to bake, brush pie with egg wash. Bake for 15 minutes, then lower heat to 375ºF (190ºC) and bake until the juices are bubbling and the crust is golden brown, 45 to 55 minutes. Remove from oven, transfer to a cooling rack, and allow pie to cool completely before serving, about 4 hours.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRolling pin, pizza cutter or pastry wheel, colander, kitchen scissors, paring knife, pastry brush\nNotes\nFeel free to substitute with an equal amount of vanilla extract if you don’t have vanilla paste.\nMake-Ahead and Storage\nThe pie is best eaten within three days; store at cool room temperature and avoid refrigerating as it can result in a soggy crust. Once cooled, the pie can be frozen for up to 1 month and thawed in the fridge overnight.\nRecipes\nPies\nFruit\nStrawberry\nSummer Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/a-foolproof-rhubarb-pie-that-wont-turn-to-soup-thanks-to-a-genius-trick.webp?"
}