{
  "url": "https://www.seriouseats.com/french-in-a-flash-whole-wheat-pissaladiere-recipe",
  "image_url": "https://www.seriouseats.com/thmb/XsIPjoCUm_V1mB7Rlb34mU_qPgU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090604PissaladiereSlice-b0f94b1fe75946fd9986c41f3865a9a0.jpg",
  "tags": [
    "Pizza",
    "Savory",
    "Goat Cheese"
  ],
  "title": "French in a Flash: Whole Wheat Pissaladière Pizza with Tapenade, Pine Nuts, Goat Cheese Recipe",
  "full_text": "French in a Flash: Whole Wheat Pissaladière Pizza with Tapenade, Pine Nuts, Goat Cheese Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nTotal\n75 mins\nCook Mode\n(Keep screen awake)\nIngredients\n3\nonions\n, sliced thinly into half moons\n2\ntablespoons\nolive oil\n, plus\n1\ntablespoon\nSalt and pepper\n1\n12-ounce ball\nof\npizza dough\n, preferably half white, half whole wheat flour (see note)\nCorn meal\nFlour\n2\ntablespoons\ntapenade\n8\nanchovy filets in olive oil\n1\ntablespoon\ntoasted pine nuts\n15\nNiçoise olives\n2\nounces\nchèvre\n, or\nfresh goat cheese\n3\ncaper berries\n3\nstems\nfresh thyme\n, plus more for garnish\nDirections\nIn a large sauté pan, add the onions to 2 tablespoons of olive oil, sitting over medium-low heat. Season with salt and pepper, and sauté slowly for 45 minutes, until the onions are soft and jammy. Be sure to stir them often, and lower the heat if they burn too quickly.\nMeanwhile, dust the bottom of the pizza dough with just a touch of corn meal, to keep it from sticking. Dust the top of the dough and your rolling pin with a bit of flour for the same reason. You could just use flour for both purposes to keep it simple. Roll the dough out into a 15-inch round, and sit it on a nonstick cookie sheet or pizza pan. Brush the dough with the remaining tablespoon of olive oil, and season with salt and pepper.\nPreheat the oven to 450 degrees F.\nWhen the onions have finished cooking, spread them out over the pizza dough as you would if you were using tomato sauce. Spoon 8 little\nquenelles\n(or mounds) of the tapenade around the middle of the pizza in a wide circle. Alternate the tapenade hills with anchovy valleys, laying an anchovy like a sunray between each mound of olive paste. Scatter the pine nuts all over the pissaladière, then olives. Divide the chèvre into little bits and scatter those all over as well. Place the 3 caper berries in the center of the pissaladière, and scatter fresh thyme leaves over the entire pizza.\nBake the pissaladière for 15 minutes. Then garnish with extra sprigs of fresh thyme, and maybe a slight drizzle of fresh extra virgin olive oil. Serve warm, or at room temperature.\nA Note on Some Ingredients:\nAs for the\npizza dough\n, please feel free to use all-white or all-wheat. I think the wheat works especially well, but for French in a Flash, it really is all about what is easy and accessible for you.\nPizza\nSavory\nGoat Cheese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/french-in-a-flash-whole-wheat-pissaladire-pizza-with-tapenade-pine-nuts-goat-cheese-recipe.webp?"
}