{
  "url": "https://www.seriouseats.com/french-onion-soup-recipe",
  "image_url": null,
  "tags": [
    "French",
    "Onions",
    "Soups"
  ],
  "title": "French Onion Soup (Soupe à l'Oignon Gratinée)",
  "full_text": "French Onion Soup (Soupe à l'Oignon Gratinée)\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs\nActive\n90 mins\nTotal\n2 hrs 20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\n(90g)\nunsalted butter\n, plus more for bread\n3\npounds\n(1.4kg)\nyellow\nor mixed\nonions\n, sliced 1/8 inch thick (see note)\nKosher salt\nand freshly ground black pepper to taste, divided\n1/2 cup (\n120\nml\n)\ndry sherry\n(such as Amontillado)\n2\nquarts\n(1.8L)\nhomemade beef stock\nor\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\nsprigs\nthyme\n1\nbay leaf\n1 teaspoon (\n5\nml\n)\nFish sauce\n(optional)\n1 teaspoon (\n5\nml\n)\ncider vinegar\n8\nbowl-size\nslices\nrustic bread\n, toasted until crisp\n1\nmedium\nclove garlic\n1 pound (\n450\ng\n)\nGruyère cheese\n, grated\n2\ntablespoons\nfreshly minced\nchives\n, for garnish\nDirections\nIn a large stainless steel saucepan, or in 2 large stainless steel or cast iron skillets, melt butter over medium-high heat until foaming. Add onions and cook, stirring occasionally, until softened, about 8 minutes. Lower heat to medium-low and cook, stirring frequently, until onions are very sweet and a rich golden-brown color, 1 to 2 hours. If browned onion juices on bottom of pot threaten to burn, add 1 tablespoon (15ml) water, scrape up browned bits, and continue cooking. Season with salt and pepper.\nSerious Eats / Julia Estrada\nAdd sherry and bring to a simmer, scraping up any browned bits. (If using 2 skillets, divide sherry between them, then scrape onions and liquid from both pans into a pot or Dutch oven to continue.) Cook until alcohol smell is mostly gone, about 3 minutes. Add stock, thyme, and bay leaf; raise heat to medium-high; and bring to a simmer. Lower heat and simmer for 20 minutes.\nSerious Eats / Julia Estrada\nAdd fish sauce, if using, and cider vinegar. Season with salt and pepper. Discard thyme sprigs and bay leaf.\nSerious Eats / Julia Estrada\nPreheat broiler and adjust oven rack to top position. Butter toasts and rub with garlic clove until fragrant. Spoon a small amount of broth into the bottoms of 4 ovenproof serving bowls, then top with half the toasts. Sprinkle some grated cheese on top of toasts, then spoon more soup and onions on top, nearly filling bowls. Set remaining 4 toasts in bowls, pushing to nearly submerge them. Top with remaining grated cheese and set bowls on a rimmed baking sheet. Broil until cheese is melted and browned in spots. Garnish with chives and serve.\nSerious Eats / Julia Estrada\nSpecial Equipment\nRimmed baking sheet\n, large\nstainless steel\nor\ncast iron\nsaucepan\nNotes\nYellow onions are your best all-purpose bet for this soup, but a mix of yellow, sweet (e.g., Vidalia), and red onions, as well as shallots, produces an even more complex flavor.\nFrench\nOnions\nSoups"
}