{
  "url": "https://www.seriouseats.com/french-in-a-flash-grilled-lamb-chops-port-syrup-garlic-confit-sauce-vierge-persillade-recipe",
  "image_url": "https://www.seriouseats.com/thmb/srVSE36siWBu37JF5c2q-Ss2qT0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090813PortLamb-9b0fec6186d64cadbce8393ad69c9cee.jpg",
  "tags": [
    "Lamb Mains",
    "French",
    "Grilled Lamb",
    "Lamb Chops",
    "Garlic"
  ],
  "title": "French in a Flash: Grilled Lamb Chops with Port Syrup, Garlic Confit, and Sauce Vierge 'Persillade' Recipe",
  "full_text": "French in a Flash: Grilled Lamb Chops with Port Syrup, Garlic Confit, and Sauce Vierge 'Persillade' Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n95 mins\nMarinate\n2 hrs\nTotal\n3 hrs 40 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nGarlic Confit:\n1\nhead\nof\ngarlic\n, minus the three cloves you will use for the marinade, all skinned but intact\n3/4\ncup\nolive oil\nMarinade:\n1/3\ncup\nolive oil\n1/3\ncup\nport\n3\ncloves\nof\ngarlic\n, smashed\n1\nbunch\nof\nparsley stems\n(reserve the leaves for the sauce vierge)\n1\ntwig\nof\nrosemary\n, snapped\nA good amount of\ncoarsely ground black pepper\nOne\n1-pound\nFrenched rack of lamb\n, well trimmed of any fat or nerves, cut into chops\nSalt\nSauce Vierge \"Persillade\":\n1\nhead\nof\nconfit garlic\n1/2\ncup\ngarlic oil\n2\ntablespoons\nsherry vinegar or\nlime juice\n3/4\ncup\nfresh flat leaf parsley leaves\n, chopped\nLeaves from 1 stem rosemary\n, chopped\nSalt and pepper\nPort Syrup:\n1/2\ncup\nport\n1/4\ncup\nsugar\nPinch\nsalt\nDirections\nMake the\ngarlic confit\nby placing the peeled garlic cloves and the olive oil in a small saucepot. Sit over low heat, and begin counting 1 hour to 1 hour and 15 minutes. The garlic will begin to look translucent in the oil, and will be soft to the point of a knife. At this point, take it off the heat, and leave to infuse and come to room temperature. The only thing to keep in mind is that you are not cooking the oil; just heating it. There should be no sizzling or browning of any sort! At the end, the garlic will be absolutely soft and sweet.\nCombine all the\nmarinade\ningredients in a pie dish. Arrange the lamb chops in it, making sure the lamb touches the liquid and not just the parsley stems. Cover with plastic, and put in the fridge for an hour. After an hour, turn the lamb over in the marinade, and cover and refrigerate for another hour. You could certainly marinate the meat longer, but this is the minimum.\nTo make the\nsauce vierge,\nsimply combine all the ingredients and allow to sit while the meat is grilling.\nFor the\nport syrup,\nsimply set the port and sugar and a pinch of salt in a saucepot over medium heat. The sugar will dissolve, and the port will reduce. You should be left with about 1/3 the volume of liquid from which you started, and it will be thick and sweet like a syrup.\nTo\ngrill the lamb,\nheat a grill pan or a grill to medium-high heat. Blot the lamb on paper towel to remove excess liquid from the marinade, and salt the meat. Drizzle the chops with a touch of olive oil, and sear until golden, about 3 minutes per side for medium rare.\nDrizzle the chops with the port syrup and spoon the confited garlic over the top. Serve the sauce vierge on the side.\nLamb Mains\nFrench\nGrilled Lamb\nLamb Chops\nGarlic"
}