{
  "url": "https://www.seriouseats.com/french-omelette-fresh-herbs-recipe",
  "image_url": null,
  "tags": [
    "French",
    "Gluten-free Breakfast & Brunch",
    "Vegetarian Breakfast & Brunch",
    "Stovetop Eggs",
    "Omelettes"
  ],
  "title": "French Omelette With Fines Herbes Recipe",
  "full_text": "French Omelette With Fines Herbes Recipe\nJump to recipe\nPrep\n5 mins\nActive\n5 mins\nTotal\n5 mins\nServes\n1 serving\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\neggs\nLarge pinch minced delicate fresh herbs (about 1 tablespoon;\n2\ng\n), such as some combination of parsley, tarragon, chives, and\nchervil\nKosher salt\nand freshly ground white or black pepper\n1 tablespoon (\n15\ng\n)\nunsalted butter\nDirections\nIn a medium bowl, beat eggs with a disposable plastic or reusable wooden fork just until last traces of white are mixed in; mix in herbs and season with salt and pepper.\nIn a perfectly unscratched 8-inch nonstick skillet, melt butter, swirling over moderate heat, until fully melted and foamy but not browned. Add eggs and stir rapidly with fork, tines up, while shaking pan to agitate eggs; make sure to move fork all around pan to break up curds and scrape them from bottom of skillet as they form. Stop stirring as soon as eggs are very softly scrambled and creamy (but still loose enough to come together into a single mass), 1 to 2 minutes.\nUsing fork, gently spread egg in an even layer around skillet and scrape down any wispy bits around the edges. The top surface should be loose and creamy, but if it looks too liquid and raw, cook undisturbed for another few seconds. (If it still flows, you can swirl skillet to send loose egg to the edges, where it will set more quickly.)\nRemove from heat, tilt skillet up by its handle, and, using fork, gently roll omelette down over itself until it is nearly folded in half. Using fork, push omelette to edge of skillet so that lower edge of egg begins to just barely overhang; use fork to fold overhanging edge of egg up, closing the omelette.\nHold skillet right over plate and turn omelette out onto it. It should be almond- or cigar-shaped, with the seam on bottom; if it's not, lay a clean kitchen towel over it and use your hands to adjust its shape and position, then remove towel. Serve. (To make another omelette, wipe any eggy bits out of skillet and repeat.)\nSpecial equipment\n8-inch nonstick skillet (see note), disposable plastic or reusable wooden fork\nNotes\nThe single most important thing when making an omelette is to have a skillet with a perfectly nonstick surface. (Which is why we don't recommend investing in expensive nonstick cookware—it needs to be replaced too often, no matter the quality of the build.) Even pans with no visible damage, once used enough, start to lose their nonstick efficacy. Therefore, for flawless results, make sure you're using a pan in mint condition. It doesn't need to be expensive; even a cheap aluminum nonstick skillet will do.\nThis Recipe Appears In\nThe Foolproof Steps to Making a Perfect French Omelette at Home\nFrench\nGluten-free Breakfast & Brunch\nVegetarian Breakfast & Brunch\nStovetop Eggs\nOmelettes"
}