{
  "url": "https://www.seriouseats.com/french-vanilla-buttercream-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/W8zdspZi-8YSgFK71XJ8kreVBLc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__11__20170627-french-buttercream-vicky-wasik-13-3ee307eacded4ed5934ecdee0a3b61a6.jpg",
  "tags": [
    "Cakes"
  ],
  "title": "French Buttercream Frosting Recipe",
  "full_text": "French Buttercream Frosting Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n35 mins\nTotal\n25 mins\nServes\n32 servings\nMakes\n4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n5 1/2 ounces\negg yolk\n(shy 2/3 cup;\n155\ng\n), from about 10 large eggs\n5 1/4 ounces plain or\nlightly toasted\nsugar\n(about 3/4 cup;\n145\ng\n); (see note)\n1\nounce\nbourbon\n, brandy, rum, tea, or coffee (about 2 tablespoons; 30g)\n1/4\nounce\nvanilla extract\n(1 1/2 teaspoons; 7g)\n1/2 teaspoon (\n2\ng\n) Diamond Crystal kosher\nsalt\n; for table salt, use about half as much by volume or the same weight\n16\nounces\nunsalted butter\n(4 sticks; 455g), softened to about 65°F (18°C)\nDirections\nFill a wide pot with at least 1 1/2 inches water, with a thick ring of crumpled aluminum foil placed on the bottom to act as a \"booster seat\" that will prevent the bowl from touching the bottom of the pot. Place over high heat until steaming-hot, then adjust temperature to maintain a gentle simmer. Combine egg yolks, sugar, bourbon or other liquid ingredient, vanilla, and salt in the bowl of a stand mixer.\nSerious Eats / Vicky Wasik\nPlace bowl over steaming water, stirring and scraping constantly with a flexible spatula, until egg yolk syrup reaches 155°F (68°C). This should take only about 5 minutes; if the process seems to be moving slowly, simply turn up the heat. Once it's ready, transfer to a stand mixer fitted with a whisk attachment and whip at high speed until mixture is fluffy, stiff, and beginning to ball up around the whisk, about 8 minutes.\nSerious Eats / Vicky Wasik\nWith mixer still running, add butter 1 or 2 tablespoons at a time, waiting only a second or two between additions. In the end, the buttercream should be thick, creamy, and soft but not runny, around 72°F (22°C).\nSerious Eats / Vicky Wasik\nUse buttercream right away, or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to 72°F and re-whip before using.\nTroubleshooting:\nIf warmer than 74°F (23°C), the buttercream will be soft and loose; pop it in the fridge for 15 minutes and re-whip to help it thicken and cool. If colder than 68°F (20°C), the buttercream will be firm and dense, making it difficult to spread over cakes and slow to melt on the tongue, creating a greasy mouthfeel. To warm, briefly set over a pan of steaming water, just until you see the edges melting slightly, then re-whip to help it soften and warm. French buttercream can be fixed according to the same rules for Swiss buttercream. For more information, see the troubleshooting guide and video\nhere\n.\nSpecial Equipment\nLarge pot, flexible spatula,\ndigital thermometer\n,\nstand mixer\nNotes\nThough technically optional, using\nquick-toasted sugar\nwill dramatically tame the sweetness of this buttercream, while also adding subtle depth of flavor. It's a lovely touch for basic vanilla, but not nearly as vital when stronger flavors, like chocolate or spices, come into play.\nMake-Ahead and Storage\nUse buttercream right away, or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to 72°F (22°C) and re-whip before using.\nRead More\nThe World of Buttercreams: 6 Varieties to Try at Home\nA Guide to Cake Frosting\nThe Best Aromatic Vanilla Extracts\nCakes"
}