{
  "url": "https://www.seriouseats.com/french-onion-soup-tarte-tatin",
  "image_url": null,
  "tags": [
    "Savory",
    "Vegetables",
    "Fall Snacks & Appetizers",
    "French",
    "Onions"
  ],
  "title": "French Onion Soup Tarte Tatin",
  "full_text": "French Onion Soup Tarte Tatin\nJump to recipe\nPrep\n25 mins\nCook\n85 mins\nActive\n90 mins\nChilling Time\n2 hrs 30 mins\nTotal\n4 hrs 20 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nbatch\nold-fashioned flaky pie dough\nor 1 sheet frozen puff pastry, thawed\n3 medium\nyellow onions\n(about 1 1/2 pounds;\n680\ng\n) (see notes)\n4 tablespoons (2 ounces;\n56\ng\n)\nunsalted butter\n, softened, divided\nKosher salt\nand freshly ground black pepper\n1\ntablespoon\n(15ml)\ndry sherry\n(such as Amontillado)\n3/4\ncup\n(180ml) homemade\nchicken\nor\nbeef\nstock, or store-bought,\nlow-sodium chicken stock\n1/4\nteaspoon\nAsian fish sauce\n(optional)\n1/4\nteaspoon\ncider vinegar\n1/2 teaspoon (\n2\ng\n) chopped\nfresh thyme leaves\n1 tablespoon (\n15\ng\n)\nsugar\n2 ounces (\n56\ng\n)\nGruyère cheese\n, grated\n2\ntablespoons\n(30ml)\nDijon mustard\n(optional)\nFreshly sliced chives\n, for garnish\nDirections\nIf using pie dough:\nPrepare\nold-fashioned flaky pie dough\naccording to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 10-inch round. Transfer to a large, flat plate lined with parchment, or another similar arrangement. Working around circumference, fold 1/2 inch of dough over itself and pinch to create 9-inch round with raised rim. Cut three 2-inch slits in center of dough, and refrigerate for at least 2 hours or up to 24. (If refrigerating overnight, cover dough with plastic.)\nIf using puff pastry:\nRoll puff pastry out so that you are able to cut a 10-inch round (you can use an inverted 10-inch skillet as a guide for cutting the round). Transfer to a large, flat plate lined with parchment, or another similar arrangement. Working around circumference, fold 1/2 inch of dough over itself and pinch to create 9-inch round with raised rim. Poke the pastry all over with a fork, and refrigerate until ready to use.\nSerious Eats / Vicky Wasik\nAdjust oven rack to middle position and preheat to 400°F (200°C). Using a sharp knife, trim stem end of onions and halve onions from root end to stem end; peel and discard skin. For two of the onions, trim away the scraggly end of the root, while keeping the light-colored part intact, then cut each half into 4 wedges through the root end to keep wedges intact (giving you 16 wedges total). Set wedges aside. Thinly slice remaining onion.\nSerious Eats / Vicky Wasik\nIn a 3-quart saucier or small skillet, melt 1 tablespoon (15g) butter over medium-high heat until foaming. Add sliced onion, season lightly with salt and pepper, and cook, stirring frequently, until softened, about 5 minutes. Continue to cook, stirring frequently and adding 1 to 2 tablespoons of water at a time when onion begins to stick and threaten to scorch until onion is very sweet and a rich golden-brown color, about 15 minutes.\nSerious Eats / Vicky Wasik\nAdd sherry, and scrape up any brown bits from the bottom and sides of the saucier. Add stock, bring to a simmer, and cook at a steady simmer until onion is jammy, and liquid has thickened and reduced to just coat the onion, 5 to 7 minutes. Stir in fish sauce (if using), vinegar, and thyme. Remove from heat, and set aside to cool.\nSerious Eats / Vicky Wasik\nMeanwhile, smear remaining 3 tablespoons (41g) butter over bottom of 10-inch oven-safe skillet, sprinkle sugar in even layer over butter, and season lightly with salt and pepper. Arrange onion wedges in a tight circular pattern around edge of skillet, with root ends pointed inward toward center of skillet, making sure wedges are in even contact with skillet. Tuck remaining onion wedges into center of skillet.\nSerious Eats / Vicky Wasik\nPlace skillet over high heat, and cook, without stirring, until onions have softened slightly and butter-sugar mixture has turned a dark amber color, 8 to 10 minutes. (Rotate skillet over burner as necessary to encourage even browning.) Reduce heat to medium, spoon caramelized onions into empty spaces between the onion wedges, and continue to cook for 1 minute longer. Turn off heat, and sprinkle Gruyère evenly over onions. Spread mustard (if using) evenly over prepared dough or pastry, and carefully place round over onions mustard-side down, making sure the dough or pastry is centered and not touching the sides of the skillet. Bake until crust is deep golden brown, 30 to 35 minutes. Transfer skillet to wire rack set in rimmed baking sheet and let cool for 5 minutes.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nPlace a large plate over the skillet, carefully invert tart onto plate, then slide tart onto wire rack. Rearrange any onion pieces that may have shifted during unmolding, and let tart cool for 30 minutes. Cut into wedges, sprinkle with chives, and serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n10-inch cast iron\nor\nstainless steel\nskillet\nNotes\nTry to find onions that weigh approximately 8 ounces (225g) each and are around 3 inches (7 1/2 cm) in diameter.\nMake-Ahead and Storage\nThe tart is best enjoyed the same day it is made. The pie dough round can be made in advance, and refrigerated for up to 24 hours. The caramelized onion mixture can be made up to three days in advance, and refrigerated in an airtight container; bring to room temperature before using.\nRead More\nHow to Slice and Dice an Onion\nThe Difference Between Yellow and White Onion Is More Than Skin Deep\nPressure-Cooker Brown Chicken Stock\nSavory\nVegetables\nFall Snacks & Appetizers\nFrench\nOnions"
}