{
  "url": "https://www.seriouseats.com/french-onion-soup-mac-and-cheese-11687512",
  "image_url": "https://www.seriouseats.com/thmb/8J3uI8lpITuynNjavGlEf2UGawc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250206-SEA-FrenchOnionSoupMacandCheese-HannaHufham_Beauty1_14-311e68a87b9e42cab99d06ed5f4eeca9.jpg",
  "tags": [
    "Mac & Cheese",
    "The Latest",
    "Sides"
  ],
  "title": "French Onion Soup Mac and Cheese",
  "full_text": "French Onion Soup Mac and Cheese\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nCooling Time\n15 mins\nTotal\n75 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n456\ng\n) uncooked rotini pasta (about\n5 1/2\ncups\n)\nKosher salt\n11\ntablespoons\nunsalted butter\n, divided (\n5 1/2\nounces\n;\n156\ng)\n1 1/2\npounds\nyellow or mixed onions\n(\n720\ng\n; about\n3\nmedium\n), thinly sliced lengthwise (\n6\ncups\n)\n1 1/2\npounds\n(\n720\ng\n)\nGruyère cheese\n1/4\ncup\n(\n60\nml\n)\ndry sherry\n1 1/2\ntablespoons\nchopped\nfresh thyme\nleaves, divided, plus more for garnish\n1/3\ncup\nall-purpose flour\n(\n1 1/2\nounces\n;\n40\ng\n)\n6\ncups\n(\n1.35\nL\n)\nwhole milk\n1\ntablespoon\n(\n15\nml\n)\nDijon mustard\n1\ntablespoon\n(\n18\ng\n)\nroasted beef bouillon\n(such as Better Than Bouillon)\n1/2\nteaspoon\nfreshly\nground black pepper\n1\ncup\npanko bread crumbs\n(\n2 1/2\nounces\n;\n72\ng\n)\n1/2\ncup\nstore-bought crispy fried onions\n(\n1\nounce\n;\n30\ng\n), coarsely crushed\nDirections\nAdjust oven rack to middle\nposition and preheat oven to 400°F (205°)  In a large pot of salted boiling water, cook pasta until just shy of al dente, about 2 minutes less than cooking time indicated on package. Drain, then transfer pasta to a large mixing bowl; set aside.\nSerious Eats / Hannah Huffman\nWhile pasta is cooking, in a Dutch oven, heat 4 tablespoons (60 g) butter over medium heat until melted. Add onions and cook, covered, stirring occasionally, until onions are soft and translucent, 6 to 8 minutes. Uncover and reduce heat to medium-low.  Continue cooking, uncovered, stirring occasionally, until onions become very soft and brown, 30 to 35 minutes. If browned onion juices on bottom of pot begin to burn, add 1 tablespoon (15ml) water, scrape up browned bits, and continue cooking; add water whenever needed to prevent burning.\nSerious Eats / Hannah Huffman\nWhile onions caramelize, shred 1 pound (456 g) of Gruyère and cube remaining 8 ounces (226 g) into 1/2-inch pieces. Set aside until ready to use.\nSerious Eats / Hannah Huffman\nOnce onions have browned, increase heat to medium and stir in sherry 1 tablespoon thyme; cook, stirring constantly, until fragrant and liquid has evaporated, 1 to 2 minutes. Remove from heat and transfer to a bowl.\nSerious Eats / Hannah Huffman\nReturn now-empty Dutch oven to medium heat and melt 4 tablespoons (60 g) butter; add flour and cook, stirring constantly, until raw flour scent is gone, about 1 minute. Add milk in a thin, steady stream, whisking constantly and thoroughly and getting into all corners of the pan to create a smooth, lump-free texture. Sauce will initially become very thick, then get very thin once all the milk is added. Bring to a simmer over medium heat, whisking often, and cook until sauce coats the back of a spoon, about 15 minutes. Whisk in mustard, bouillon, and pepper.\nSerious Eats / Hannah Huffman\nRemove from heat and, working in increments, whisk in shredded Gruyère until a smooth, emulsified cheese sauce forms; stir in reserved onions.\nSerious Eats / Hannah Huffman\nScrape cheese sauce into pasta and mix until evenly coated. Let cool slightly, about 5 minutes, then add cubed Gruyère and mix well. Scrape pasta into a greased 9- by 13-inch baking dish and smooth surface into an even layer.\nSerious Eats / Hannah Huffman\nIn a small bowl, combine panko, fried onions, and remaining 1/2 tablespoon thyme. Melt remaining 3 tablespoons (45 g) butter, then add to panko mixture and mix until evenly coated. Scatter panko mixture evenly over surface of mac and cheese. Bake until browned and bubbling, 12 to 15 minutes.\nSerious Eats / Hannah Huffman\nLet mac and cheese rest for 15 minutes. Garnish with thyme leaves and serve.\nSerious Eats / Hannah Huffman\nSpecial Equipment\nLarge pasta pot, Dutch oven, 9- by 13-inch baking dish\nMake Ahead and Storage\nThe pasta can be cooked, cooled, and refrigerated in an airtight container for up to 3 days before preparing the casserole.\nCheese can be shredded and cubed up to 1 week ahead and refrigerated in separate airtight containers.\nThe onions can be sliced ahead up to 1 day ahead and stored in an airtight container in the refrigerator or fully caramelized up to 1 week ahead and refrigerated in an airtight container.\nLeftover mac and cheese can be refrigerated for up to 5 days; it reheats surprisingly well in the microwave or oven\nMac & Cheese\nThe Latest\nSides"
}