{
  "url": "https://www.seriouseats.com/french-bistro-salad-recipe-8707601",
  "image_url": "https://www.seriouseats.com/thmb/Nypn8ipBVJX5ccJyBPn6L4jD_k0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240905-SEA-SaladeLyonnaise-TwoBites-Hero1-86-a3bbb0a4a7174c068afc0f10af636860.jpg",
  "tags": [
    "Salads",
    "The Latest",
    "French",
    "Quick Dinners",
    "Green Salads"
  ],
  "title": "Salade Lyonnaise (French Bistro Salad)",
  "full_text": "Salade Lyonnaise (French Bistro Salad)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nTotal\n25 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n6-\nounce\nslab of bacon or\nthick-cut bacon\nslices (about 3 slices)\n1/2\nmedium\nshallot\n, minced (2 tablespoons; 20g)\n1/2\nteaspoon\nDijon mustard\n2 tablespoons (\n30\nml)\nsherry vinegar\n1/8\nteaspoon\nkosher salt\n4\nlarge\neggs\n6\nounces\nfrisée,\nor other available chicory greens, such as curly endive or escarole, roughly torn or cut into bite-size pieces (about 6 cups, loosely packed); see notes\n1\npinch\nfreshly\nground black pepper\nDirections\nCut slab bacon into 1/4-inch thick slices then cut each slice crosswise into 1/2-inch wide pieces. If using thick-cut bacon, stack slices on top of each other and cut into strips about 1/2-inch wide. In a 10-inch stainless-steel or cast iron skillet, add bacon and cook over medium-low heat, stirring frequently and adjusting heat to avoid burning, until fat is rendered from the bacon and it’s evenly browned but still chewy, 6 to 8 minutes. Use a slotted spoon to transfer bacon to a paper towel–lined plate. Reserve 1/4 cup of the rendered bacon fat in the skillet, and discard any extra bacon fat.\nSerious Eats / Two Bites\nTo the reserved 1/4 cup bacon fat in the skillet, add the minced shallot and immediately remove from heat. Cook off heat, stirring frequently, until the edges of the shallots turn opaque and soften, about 30 seconds. Whisk in mustard then slowly drizzle in vinegar while continuing to whisk. Season with salt. Set aside and cover to keep warm while preparing the poached eggs.\nSerious Eats / Two Bites\nFor Poaching the Eggs:\nBring a medium pot of water to a simmer, then reduce heat until it is barely quivering. It should register 180 to 190°F (82 to 88°C) on an instant-read thermometer. Carefully break 1 egg into a small bowl, then tip into a fine-mesh strainer. Carefully swirl egg around strainer, using your finger to rub off any excess loose egg whites that drop through. Gently tip egg into water. Swirl gently with a wooden spoon for 10 seconds, just until egg begins to set. Repeat straining and tipping with remaining eggs. Cook, swirling occasionally, until egg whites are fully set but yolks are still soft, about 4 minutes.\nSerious Eats / Two Bites\nCarefully lift eggs from pot with a slotted spoon. Serve immediately, or transfer to a bowl of cold water and refrigerate for up to 2 days. To serve, transfer to a bowl of hot water and let reheat for 2 minutes before plating.\nSerious Eats / Two Bites\nWhen ready to serve,\nin a large bowl, toss the frisée with the prepared warm vinaigrette until well combined. Divide among 4 plates and garnish with the prepared lardons. Top with 1 poached egg per plate and sprinkle with black pepper.\nSerious Eats / Two Bites\nSpecial Equipment\n10-inch cast iron or stainless-steel skillet\nNotes\nIf you can’t find frisée, a bitter green like curly endive or escarole can be substituted. Or alternatively, use any combination of the 3 listed greens.\nMake-Ahead and Storage\nSalade Lyonnaise is best prepared just before serving, but in a pinch you can prepare the dressing, lardons, and greens up to 2 days ahead and store in separate airtight containers in the refrigerator. Reheat the lardons in a dry skillet, remove, then heat dressing in the same skillet before tossing with the greens.\nTo make the eggs ahead, transfer the poached eggs to a bowl of cold water and refrigerate for up to 2 days. To serve, transfer to a bowl of hot water and let reheat for 2 minutes before plating.\nSalads\nThe Latest\nFrench\nQuick Dinners\nGreen Salads"
}