{
  "url": "https://www.seriouseats.com/french-crullers-recipe-11754926",
  "image_url": "https://www.seriouseats.com/thmb/oksuA0sq8gLRKMmm40Rf3QSycTc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250609-SEA-FrenchCrullers-QiAi-HERO-55986327d12040f7860a2e5a965e50d0.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Recipes",
    "French",
    "Frying"
  ],
  "title": "This Delightfully Crisp French Pastry Is the Lazy Person's Doughnut",
  "full_text": "This Delightfully Crisp French Pastry Is the Lazy Person's Doughnut\nClose\nJump to recipe\nPrep\n45 mins\nCook\n45 mins\nTotal\n90 mins\nMakes\n14 crullers\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cinnamon Sugar:\n100\ng\ngranulated sugar\n(\n3 1/2\nounces\n;\n1/2\ncup\n)\n2\nteaspoons\nground cinnamon\nFor the Vanilla Glaze:\n100\ng\nconfectioners’ sugar\n(\n3 1/2\nounces\n;\n1\ncup\n)\n45\ng\nheavy cream\nor half-and-half (\n1 1/2\nounces\n;\n3\ntablespoons\n)\n1\nteaspoon\nvanilla\npaste or extract\nPinch\nkosher salt\nFor the Crullers:\n1\ncup\n(240 ml)\nwater\n84\ng\nunsalted butter\n(about\n3\nounces\n;\n6\ntablespoons\n), cut into 1/2-inch pieces\n8\ng\n(\n2\nteaspoons\n)\ngranulated sugar\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n128\ng\nall-purpose flour\n(\n4 1/2\nounces\n;\n1\ncup\n), sifted\n4\nlarge eggs\n(about\n7\nounces\n;\n200\ng\n)\nNeutral\noil\n, such as canola, vegetable, or sunflower, for frying\nDirections\nFor the Cinnamon Sugar:\nIn a small bowl, whisk sugar and ground cinnamon to combine; set aside.\nSerious Eats / Qi Ai\nFor the Glaze:\nIn a small bowl, whisk confectioners’ sugar, heavy cream, vanilla extract, and salt until smooth; set aside.\nSerious Eats / Qi Ai\nFor the Crullers:\nCut fourteen 3 1/2– by 3 1/2–inch squares of parchment paper and arrange them on a 13- by 18-inch rimmed baking sheet. Set a wire rack inside another 13- by 18-inch rimmed baking sheet and line rack with a double layer of paper towels.\nSerious Eats / Qi Ai\nIn a 3-quart saucepan, combine water, butter, sugar, and salt. Set over high heat and cook until liquid comes to a rolling boil and butter has fully melted, about 2 minutes.\nSerious Eats / Qi Ai\nRemove from heat and add flour. Using a wooden spoon or stiff spatula, thoroughly mix in flour until no lumps remain.\nSerious Eats / Qi Ai\nReturn saucepan to medium-high heat and cook, stirring constantly, until a thin starchy film forms all over the saucepan, dough pulls together into a cohesive mass, and dough registers 175°F (80°C) on an instant-read thermometer.\nSerious Eats / Qi Ai\nTransfer dough to a stand mixer fitted with the paddle attachment and beat on medium speed until dough registers 145°F (63°C).\nSerious Eats / Qi Ai\nReduce speed to low and add eggs one at a time, letting each fully incorporate before adding the next. Beat on medium speed until batter is cohesive, about 8 minutes. Scrape down bottom and sides of bowl, then mix once more at medium speed to ensure batter is fully mixed, about 5 seconds.\nSerious Eats / Qi Ai\nSerious Eats / Qi Ai\nFit a large piping bag\nwith a 1/2-inch French star tip. Using a flexible spatula, scrape choux batter into piping bag. Snip off end of piping bag and pipe a 3-inch circle of choux pastry onto prepared parchment square; repeat with remaining batter.\nSerious Eats / Qi Ai\nIn a large Dutch oven or pot, heat 2 inches of neutral oil over medium-high heat to 350°F (175°C). Working in batches, carefully place 3 to 4 parchment squares, choux-side down, into the oil. Let cook for 1 minute, then use tongs to carefully peel away parchment. Cook, using a spider or slotted spoon to flip crullers halfway through, until crullers are deep golden brown on all sides, about 10 minutes, then transfer to prepared wire rack and let cool slightly. Repeat with remaining crullers.\nSerious Eats / Qi Ai\nDip both sides in cinnamon sugar to evenly coat or dip top of cruller in vanilla glaze. Serve immediately.\nSerious Eats / Qi Ai\nSpecial Equipment\nParchment paper, scissors,\ninstant-read thermometer\n,\nstand mixer\n, flexible spatula, piping bag, 1/2-inch French star tip,\nDutch oven\nor large pot, tongs\nNotes\nTo bake French crullers: Adjust oven rack to middle position and preheat oven to 400°F (205°C). Line a 13- by 18-inch rimmed baking sheet with parchment paper. Pipe crullers onto prepared baking sheet, spacing them each 1 inch apart. Brush each circle of choux with a light layer of beaten egg then bake until deep golden brown and firm to the touch, about 20 minutes. Let cool slightly. Dip both sides of each cruller in cinnamon sugar or dip the top into vanilla glaze.\nMake-Ahead and Storage\nFor best texture, French crullers should be enjoyed within an hour of frying. For a make-ahead option, freeze the piped circles of choux until solid. Once frozen, peel the choux circles off the parchment and transfer them to a resealable plastic bag. Store in the freezer for up to a month. French crullers can be fried directly from frozen, just be sure to wipe away any visible ice crystals to prevent the oil from splattering. Frozen choux pastry will require an additional minute of cooking per side.\nDesserts\nThe Latest\nRecipes\nFrench\nFrying",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-delightfully-crisp-french-pastry-is-the-lazy-persons-doughnut.webp?"
}