{
  "url": "https://www.seriouseats.com/french-dip-sandwich-recipe-8605324",
  "image_url": "https://www.seriouseats.com/thmb/fSodVy8Hv_k6dsYRm228I7sAp3s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240307-FrenchDip-KevinWhite-hero-72c67d3ff9a34b46a3d05ee8987764d1.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "American",
    "Beef",
    "West Coast"
  ],
  "title": "French Dip Sandwich",
  "full_text": "French Dip Sandwich\nClose\nJump to recipe\nPrep\n5 mins\nCook\n90 mins\nResting and Cooling\n2 hrs\nTotal\n3 hrs 35 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Roast Beef and the Jus:\nOne 3-pound (\n1.4\nkg\n) boneless\nbeef\ntop round roast, tied with kitchen twine at 1-inch intervals (see notes)\n4 teaspoons (\n12\ng\n) Diamond Crystal kosher\nsalt\n; if using table salt, use half as much by volume or the same weight\n1 1/2\nteaspoons freshly\nground black pepper\n1/4 ounce (\n7\ng)\ndried porcini mushrooms\n, rinsed\n1 tablespoon (\n15\nml\n)\nvegetable oil\n, plus more as needed\n1 medium\nyellow onion (\n8 ounces;\n227\ng)\n, halved and thinly sliced\n2 tablespoons (\n28\ng\n)\nunsalted butter\n1\ntablespoon\nall-purpose flour\n1\ntablespoon\ntomato paste\n1\nteaspoon\nfresh thyme\n1\nquart\n(950ml)\nhomemade\nbeef stock\n,\nhomemade chicken stock\n, or store-bought low-sodium chicken broth (see notes)\n1 tablespoon (\n15\nml\n)\nWorcestershire sauce\nFor Assembling the Sandwiches:\n1\nroll (1 oz)\nrolls\n4\nounces\nswiss cheese\nDirections\nFor the Roast Beef and the Jus:\nSet roast on a wire rack set in a rimmed baking sheet or on a platter and sprinkle evenly with the 4 teaspoons salt and refrigerate uncovered for at least 1 hour or up to 24 hours.\nSerious Eats/Kevin White\nAdjust oven rack to middle position and heat oven to 225℉ (105℃). Combine dried mushrooms with 1 cup very hot tap water and let sit until mushrooms are softened, about 5 minutes. Drain mushrooms and squeeze dry, then mince and set aside.\nSerious Eats/ Kevin White\nPat roast dry with paper towels, if needed, and sprinkle with the 1 1/2 teaspoons black pepper. In a 12-inch stainless steel or cast-iron skillet, heat oil over medium-high heat until just smoking. Brown roast on all sides, 8 to 12 minutes; return to wire rack or platter.\nSerious Eats/Kevin White\nPour off all but approximately 2 tablespoons fat from skillet (or, if necessary, add extra oil as needed to equal 2 tablespoons). Add onions and butter and cook until onions are beginning to soften and are lightly browned, 5 to 7 minutes. Stir in the minced porcini mushrooms, flour, tomato paste, and thyme and cook until mixture is well combined and begins to darken, about 2 minutes.\nSerious Eats/Kevin White\nRemove from heat and push the onion mixture to the center of the skillet. Set the roast, fat side up, on top of the onion mixture. Transfer the skillet to the oven and roast until an instant-read thermometer inserted in the center of the roast registers 125℉ (50℃) for medium-rare, 1 to 1 1/2 hours. Remove from the oven and transfer the roast to a carving board; let cool to room temperature, about 1 hour.\nSerious Eats/Kevin White.\nMeanwhile, using a potholder, set the skillet with the onion mixture over medium heat and cook, stirring occasionally, until deep golden brown, 3 to 5 minutes. Slowly whisk in the broth and Worcestershire sauce, scraping up any browned bits from the bottom of the pan, bring to a simmer, and cook, stirring occasionally, until the jus is slightly thickened, about 15 minutes. Stir in any accumulated meat juices from the rested roast. Set the jus aside off heat until ready to assemble the sandwiches. (At this point, the roast beef can be wrapped and the jus transferred to an airtight container and both refrigerated separately for up to 4 days before slicing and assembling the sandwiches.)\nSerious Eats/Kevin White\nFor Assembling the Sandwiches:\nAdjust the oven rack to upper-middle position and heat the oven broiler. Remove the kitchen twine from the roast and slice the roast as thin as possible against the grain; set aside.\nSerious Eats/Kevin White\nReheat the jus over medium-high heat until just simmering, then reduce heat to low to keep warm. Using tongs and your hands, dip the cut side of the roll bottoms (just the bottoms for now) into the jus to saturate. Transfer the dipped roll bottoms, cut side up, to a baking sheet.\nSerious Eats/Kevin White\nStir the sliced beef with any accumulated juices into the warmed jus in the skillet and let sit until heated through, about 1 minute. Using tongs, divide the dipped roast beef evenly among the dipped roll bottoms. Layer 2 slices Swiss cheese over the beef on each roll. Transfer the baking sheet with the open sandwiches to the oven and broil until the cheese is just melted, about 1 minute.\nSerious Eats/Kevin White\nSet baking sheet with the half-assembled sandwiches aside. Using tongs, dip the cut side of the roll tops into the jus to saturate, then close each sandwich. Pour the remaining jus into individual serving cups, about 1/2 cup per serving. Serve sandwiches with the jus.\nSerious Eats/Kevin White\nSpecial Equipment\n12-inch stainless steel or cast-iron skillet\nNotes\nIf your top round roast has a fat cap on it, trim the fat cap to 1/4 inch thick.\nThe cooler the roast is, the easier it will be to slice the beef as thin as possible. If time allows, I recommend making the roast up to a day ahead and refrigerating the roast whole until well chilled, at least 2 hours, before removing the twine and slicing.\nMake-Ahead and Storage\nThe roast can be cooled and refrigerated in an airtight container for up to 4 days.\nThe jus can be refrigerated in an airtight container for up to four days.\nSandwiches\nThe Latest\nAmerican\nBeef\nWest Coast"
}