{
  "url": "https://www.seriouseats.com/french-style-brown-butter-new-potatoes",
  "image_url": null,
  "tags": [
    "Fats & Oils",
    "French",
    "Vegetarian Sides",
    "Stovetop Vegetables",
    "New Potatoes"
  ],
  "title": "French-Style Brown Butter New Potatoes Recipe",
  "full_text": "French-Style Brown Butter New Potatoes Recipe\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n5 mins\nTotal\n50 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nstick\nunsalted butter\n(4 ounces; 113g), cut into 1/2-inch pieces (see notes)\n1 pound (\n450\ng\n)\nsmall new potatoes\n, rinsed (see notes)\nKosher\nor sea\nsalt\nand freshly ground black pepper\n4\nsprigs\nfresh thyme\nor rosemary (optional)\n2\ngarlic\ncloves\n(optional)\nSliced chives\n, for serving\nCrème fraîche\n, for serving\nDirections\nIn a medium (3-quart) saucepan or saucier, melt butter over medium heat. Add potatoes, a healthy pinch of salt, and pepper to taste. Cook, swirling saucepan and stirring frequently with a heat-resistant spatula while butter hisses and pops. Make sure potatoes remain in a single, even layer in the saucepan while cooking. Continue cooking and stirring until butter begins to foam rapidly and turns golden yellow, 5 to 8 minutes.\nReduce heat to medium-low; add herbs and garlic (if using). Continue stirring and turning potatoes occasionally to promote even browning. At this point, the butter should be golden brown. Regulate heat so butter simmers at a very gentle bubble and foams up when you stir it. (Depending on the strength of your burner, you may need to reduce heat from medium-low to low.) Continue cooking until potatoes are completely tender (poke a potato with a sharp paring knife or cake tester to test for doneness) and deep golden brown, about 45 minutes. Remove from heat and let potatoes rest for 5 minutes in the saucepan.\nToss potatoes to coat them in brown butter. Use a slotted spoon to transfer to a serving bowl; reserve brown butter. Drizzle as much brown butter as you like over the potatoes and sprinkle with chives (if you like) and sea salt to taste. Serve immediately with crème fraîche for dipping.\nSpecial Equipment\n3-quart stainless steel saucier\nNotes\nBoth American- and European-style butter will work for this recipe, but we recommend seeking out European-style butter, as its higher fat content produces a more richly flavored dish.\nLook for potatoes that are about 1 to 1 1/2 inches in diameter. If you can only find larger ones, you will need to adjust the cooking time accordingly.\nThis recipe yields enough brown butter to sauce a main-course protein as well as the potatoes themselves.\nMake-Ahead and Storage\nThe potatoes are best enjoyed immediately, but they can be stored in an airtight container with the brown butter and refrigerated for up to three days. Reheat gently before serving.\nFats & Oils\nFrench\nVegetarian Sides\nStovetop Vegetables\nNew Potatoes"
}