{
  "url": "https://www.seriouseats.com/fresh-cherry-pie-filling-recipe",
  "image_url": null,
  "tags": [
    "Pies",
    "Baking",
    "Cherry",
    "Summer Desserts",
    "Juneteenth Recipes"
  ],
  "title": "The Best Easy Cherry Pie",
  "full_text": "The Best Easy Cherry Pie\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nActive\n15 mins\nCooling Time\n3 hrs 30 mins\nTotal\n5 hrs\nServes\n8 servings\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n28\nounces\npitted cherries\n(\n5\nheaping cups\n;\n790\ng\n), from about\n2\npounds\nwhole fruit\n(\n6\nheaping cups\n;\n910\ng\n; see note)\n1\nounce\nfresh lemon juice\n(\n2\ntablespoons\n;\n30\ng\n) from\n1\nsmall\nlemon\n7\nounces\nsugar\n(\n1\ncup\n;\n195\ng\n)\n3/4\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\n1 1/2\nounces\ntapioca starch\n, such as Bob's Red Mill (\n1/3\ncup\nplus\n1\nteaspoon\n;\n40\ng\n; see note)\nOld-fashioned flaky pie dough\n, rolled and chilled as per the directions for a double crust\nFor the Egg Wash (optional):\n1\nlarge\negg\n1\nlarge\negg yolk\n1/2\nounce\nheavy cream\n(1 tablespoon; 15g)\n1/8\nteaspoon\n(\n1/2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\nTo Serve (optional):\nCherry pit whipped cream\nDirections\nFor the Filling:\nCombine pitted cherries, lemon juice, sugar, salt, and tapioca starch in a large bowl, folding with a flexible spatula until well combined. Scrape into prepared pie shell and top with remaining dough, using a solid sheet, cutouts, or a lattice-top design. (Check out my tutorials\nhere\n.) Trim away excess dough and refrigerate pie to ensure top crust is completely chilled, about 30 minutes. Meanwhile, adjust oven rack to lower-middle position and preheat to 400°F (200°C).\nSerious Eats / Vicky Wasik\nFor the Egg Wash (if using):\nWhisk egg, egg yolk, cream, and salt in a small bowl. Brush over chilled top crust in a thin, even layer. This will give the crust a glossy, golden sheen, but it is not necessary in any way.\nPlace chilled pie on a parchment-lined rimmed baking sheet. Bake until crust is golden, about 1 hour, then loosely cover with tented foil. (Alternatively, an empty baking sheet can be placed on the topmost rack of the oven to serve as a shield.) Continue baking until filling is bubbling even in the very center of the pie, about 15 minutes more. If crust completely covers filling, bake until pie reaches an internal temperature of 213°F (100°C) on a digital thermometer. The time can vary considerably depending on the thickness and type of pie plate, the amount of top crust, how long the pie was refrigerated, et cetera.\nTo Serve:\nCool pie until no warmer than 85°F (29°C) on a digital thermometer, about 3 hours depending on the type of pie plate (at higher temperatures, filling will be runny and thin). Slice into wedges with a sharp knife, pressing firmly against bottom and sides of pie plate to ensure the under-crust is completely cut. If you like, serve with cherry pit whipped cream. Wrapped in foil, leftovers will keep up to 3 days at room temperature; warm 10 minutes in a 350°F (180°C) oven to revive crust before serving.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n9-inch pie plate\n(preferably tempered-glass),\npastry brush\n(if using egg wash),\nrimmed half-sheet pan\n,\ndigital thermometer\nNotes\nUpdate: Due to disparate sourcing practices, tapioca starch manufactured in Asia may be derived from plants other than cassava, which have different gelling properties. Look for products that mention cassava by name on the packaging, such as Bob's Red Mill.\nFor the most flavorful pie, reach for a mix of sweet and sour cherries—a blend of fresh and frozen works just fine. Fresh cherries can be pitted (I love my OXO cherry pitter) and refrigerated up to three days in advance. Or, use an equal weight of frozen cherries, thawed until softened. If you like, reserve cherry pits for a batch of cherry pit whipped cream, the ultimate garnish for cherry pie.\nRead More\nHow to Bake a Pie With Frozen Fruit\nHow to Freeze and Thaw a Fresh-Fruit Pie\nOld-Fashioned Flaky Pie Crust\nCherry Pit Whipped Cream\nCherry-Amaretto Tart Recipe\nCherry and Pistachio Frangipane Tart Recipe\nPies\nBaking\nCherry\nSummer Desserts\nJuneteenth Recipes"
}