{
  "url": "https://www.seriouseats.com/fresh-ricotta-ravioli-recipe",
  "image_url": "https://www.seriouseats.com/thmb/u-QJDLlPP93-vazKj7hAtrM7SDI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150218-ravioli-niki-achitoff-gray-edit-5-b6601b157ec642808145488f568f8383.jpg",
  "tags": [
    "Pasta Mains",
    "Italian",
    "Vegetarian Mains",
    "Ricotta"
  ],
  "title": "Homemade Ricotta Ravioli",
  "full_text": "Homemade Ricotta Ravioli\nClose\nJump to recipe\nPrep\n60 mins\nCook\n10 mins\nActive\n30 mins\nTotal\n70 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n20\nounces\nfresh ricotta cheese\n(see notes)\n4\nounces\nfreshly grated Parmesan cheese\n1/4\nteaspoon\nnutmeg\n2\nteaspoons\nlemon juice\nKosher salt\nand freshly ground black pepper\n1\nrecipe\nclassic fresh egg pasta\nExtra-virgin olive oil\n, for serving\nDirections\nLay a clean kitchen towel or a triple layer of lint-free paper towels on a rimmed baking sheet. Spread ricotta evenly over surface of towels. Top with a second clean kitchen towel or triple layer of paper towels. Press with hands or a second rimmed baking sheet and let rest 5 minutes. Transfer ricotta to a medium bowl (it should come right off the towels).\nAdd Parmesan cheese, nutmeg, and lemon juice to ricotta. Season to taste with salt and pepper and stir to combine.\nMeanwhile, divide dough into 4 even sections. Working one section at a time, with remaining sections tightly wrapped in plastic, roll dough through machine until sheet is just under 1/16 of an inch thick (typically second-to-last setting). Cut sheet in half to create 2 pieces of dough roughly 15 inches long and 5 inches across.\nIf using a ravioli mold:\nPlace first sheet of dough over metal base. Gently and evenly press plastic mold down to make depressions in dough. Remove and fill each depression with approximately 1 tablespoon filling. Rap mold once or twice to remove any air bubbles. Place second sheet of dough over surface and pat down. Run rolling pin over dough until ridges beneath become visible. Flip the mold over and gently peel it away. If ravioli remain stuck, rap edge of mold on table. If ravioli do not separate easily, use fluted pasta wheel cutter or kitchen knife to complete perforation. Cover ravioli with towel to prevent drying. Repeat with remaining dough and continue to step 6.\nSerious Eats / Vicky Wasik\nIf working by hand:\nFold first sheet along its midline to make a light crease and re-open. Place 6 heaping tablespoons half-inch apart along length of lower half. Moisten upper half with pastry brush dipped in water and fold over, pressing down to remove air bubbles and create a seal around filling. Using fluted pasta wheel cutter or kitchen knife, cut between filling for 6 even squares. Cover ravioli with towel to prevent drying. Repeat with remaining dough.\nSerious Eats / Vicky Wasik\nAt this point, ravioli can be frozen: place ravioli on a parchment-lined rimmed baking sheet and freeze completely. Transfer to a freezer bag, press out as much air as possible, and store in freezer for up to 2 months. Frozen ravioli can be cooked straight from frozen (add 30 seconds to cooking time).\nSerious Eats / Niki Achitoff-Gray\nTo cook ravioli, bring a large pot of salted water to a boil. Cook ravioli by submerging in boiling water and cooking for 3 minutes (ravioli should float). Drain, reserving 1/2 cup of cooking liquid. Return ravioli and the cooking liquid to the pot. Add 1/4 cup olive oil and cook on high heat, stirring gently until oil and pasta water emulsify into a creamy sauce, about 1 minute. Serve immediately, drizzling with more extra-virgin olive oil at the table.\nSpecial Equipment\nPasta machine\n, ravioli mold (optional), ravioli stamp (optional), fluted pasta wheel cutter (optional)\nNotes\nLook for\na high-quality ricotta\nthat contains no gums or stabilizers, such as Calabro. If stabilizer-free ricotta is not available, you can\nmake your own\n.\nRead More\nHomemade Fresh Pasta\nHomemade Butternut Squash and Blue Cheese Ravioli With Sage Brown Butter Sauce\nUovo in Raviolo (Runny Egg Yolk Ravioli)\nHomemade Mushroom Tortellini\nThe Best Tools For Making, Cooking, and Serving Pasta\nPasta Mains\nItalian\nVegetarian Mains\nRicotta",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-ricotta-ravioli.webp?"
}