{
  "url": "https://www.seriouseats.com/fresh-egg-pasta",
  "image_url": "https://www.seriouseats.com/thmb/hQrDUDh9I8XmZXWFKq9j4Rqh68k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__01__20141222-pasta-making-vicky-wasik-50-25f1e346c83144b3b6ae7c3e148578cc.jpg",
  "tags": [
    "Pastas",
    "Italian",
    "Pasta Mains"
  ],
  "title": "Homemade Fresh Pasta",
  "full_text": "Homemade Fresh Pasta\nClose\nJump to recipe\nPrep\n50 mins\nCook\n5 mins\nActive\n35 mins\nResting Time\n30 mins\nTotal\n85 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n9\nounces\n(255g; about 2 cups)\nall-purpose flour\n, plus more for dusting\n2\nwhole\nlarge\neggs\n(110g; about 4 ounces)\n4\nyolks\nfrom 4\nlarge\neggs (70g; about 2.5 ounces)\n1\nteaspoon\nkosher salt\n, plus more for salting water\nDirections\nTo Make the Dough:\nOn a large, clean work surface, pour flour in a mound. Make a well in the center about 4 inches wide. Pour whole eggs, egg yolks, and salt into well and, using a fork, beat thoroughly. When combined, gradually incorporate flour into the eggs until a wet, sticky dough has formed.\nSerious Eats / Vicky Wasik\nUsing a bench knife, scrape excess dough from fork and fingers. Begin to fold additional flour into the dough with the bench knife, turning the dough roughly 45 degrees each time, until dough feels firm and dry, and can form a craggy-looking ball, 2 to 5 minutes.\nSerious Eats / Vicky Wasik\nPress the heel of your hand into the ball of dough, pushing forward and down. Rotate the ball 45 degrees and repeat. Continue until dough develops a smooth, elastic texture similar to a firm ball of Play-Doh. If dough feels too wet, add flour in 1 teaspoon increments. If dough feels too dry, add water slowly using a spray bottle.\nSerious Eats / Vicky Wasik\nWrap ball of dough tightly in plastic wrap and rest on countertop for 30 minutes.\nTo Roll the Pasta:\nMeanwhile, place a sheet of parchment paper on a tray or cutting board and dust lightly with flour. Unwrap rested dough and cut into quarters. Set one quarter on work surface and re-wrap remaining dough. With a rolling pin, flatten the quarter of dough into an oblong shape about 1/2 inch thick.\nSerious Eats / Vicky Wasik\nSet pasta maker to widest setting and pass dough 3 times through the machine at this setting.\nSerious Eats / Vicky Wasik\nPlace dough on a lightly floured work surface. Fold both ends in so that they meet at the center of the dough, and then fold the dough in half where the end points meet, trying not to incorporate too much air into the folds. Using rolling pin, flatten dough to 1/2-inch thick. Pass through the rollers 3 additional times.\nSerious Eats / Vicky Wasik\nNarrow the setting by 1 notch and repeat Step 7. Repeat once more (the dough should now have passed through the third widest setting). Continue passing the dough through the rollers, reducing the thickness by 1 setting each time until it reaches the desired thickness. It should now be very delicate and elastic to the touch, and slightly translucent.\nSerious Eats / Vicky Wasik\nPlace rolled dough onto a work surface or baking sheet lightly dusted with flour or lined with parchment paper, folding the dough over as necessary so that it fits; sprinkle with flour or line with parchment between folds to prevent sticking.\nSerious Eats / Vicky Wasik\nCover dough with plastic wrap or a kitchen towel to prevent drying, then repeat Steps 5 through 9 with remaining dough quarters. If making noodles, cut dough into 12- to 14-inch segments.\nTo Cut Noodles:\nAdjust pasta machine to noodle setting of your choice. Working one dough segment at a time, feed dough through the pasta-cutter. Alternatively, cut folded dough by hand with a chef's knife to desired noodle width.\nSerious Eats / Vicky Wasik\nDivide the cut noodles into individual portions, dust lightly with flour, and curl into a nest. Place on parchment-lined rimmed baking sheet and gently cover with kitchen towel until ready to cook. Pasta can be frozen directly on the baking sheet, transferred to a zipper-lock freezer bag, and stored in the freezer for up to 3 weeks before cooking. Cook frozen pasta directly from the freezer.\nSerious Eats / Vicky Wasik\nTo Cook:\nBring a large pot of salted water to a rolling boil. Add pasta, stir gently with a wooden spoon, chopsticks, or a cooking fork, and cook, tasting at regular intervals until noodles are just set with a definite bite, about 1 1/2 to 2 minutes. Drain, toss with sauce, and serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nPasta roller\n,\nbench scraper\n,\nrolling pin\n,\nmixing bowl\nNotes\nIf you plan to make your fresh pasta in advance, wrap your dough in plastic and refrigerate. It will gradually acquire a grayish tinge—which won't affect flavor or texture, but does make for a disappointing presentation.\nIf you plan on freezing the dough, place the wrapped ball into a zipper-lock bag, removing as much air as possible, and freeze it for up to three weeks. When you're ready, thaw it in the refrigerator until it's soft and pliant to the touch.\nMake-Ahead and Storage\nPasta nests can be frozen directly on the baking sheet, transferred to a zipper-lock freezer bag, and stored in the freezer for up to 3 weeks before cooking. Cook frozen pasta directly from the freezer.\nRead More\nThe Best Tools for Making, Cooking, and Serving Pasta\nHomemade Mushroom Tortellini\nHomemade Ricotta Ravioli\nHomemade Butternut Squash and Blue Cheese Ravioli With Sage Brown Butter Sauce\nUovo in Raviolo (Runny Egg Yolk Ravioli)\nPastas\nItalian\nPasta Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-fresh-pasta.webp?"
}