{
  "url": "https://www.seriouseats.com/fresh-paneer-5703603",
  "image_url": "https://www.seriouseats.com/thmb/jdFyRQOfbKA1COGPrkN5927FiBs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220628-FreshPaneer-AmandaSuarez-11c5e6f76d064cf88153a93d28384bc8.jpg",
  "tags": [
    "Indian",
    "Stovetop",
    "Vegetarian",
    "The Latest",
    "Paneer"
  ],
  "title": "Fresh Paneer",
  "full_text": "Fresh Paneer\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n10 mins\nTotal\n2 hrs 10 mins\nServes\n4 servings\nMakes\n10 ounces\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ngallon\n(1.9L)\nwhole milk\n1/2\nteaspoon\n(2g)\ncalcium chloride\n(see note)\n2\ntablespoons\n(30ml)\nfresh lemon juice\nDirections\nCombine milk and calcium chloride in a large, heavy-bottomed, nonreactive stainless steel saucepan and stir to combine. Heat milk over medium heat until an instant read thermometer inserted into the milk reads 185°F (85°C). Add lemon juice, stir, and turn off heat. The milk solids will separate and into white curds and a yellowish whey.\nSerious Eats / Amanda Suarez\nLine a large fine-mesh sieve with a layer of cheese cloth and set it over a large bowl. Strain the curdled milk through the sieve to collect the solids; discard whey, or reserve for another use. Rinse the solids in the cheese cloth thoroughly by running cold tap water over curds. Grab the ends of the cheese cloth together, squeeze tightly to drain excess water, and hang the cloth with the milk solids over a sink or a large bowl at room temperature for 1 hour.\nSerious Eats / Amanda Suarez\nPlace drained paneer on a rimmed baking sheet. Place a heavy weight of no less than 7 pounds on top of the paneer (a 5-quart enameled cast iron Dutch oven with several 28-ounce cans of tomatoes on top of its inverted lid should be sufficient). Let paneer compress for at least one hour, and up to two hours. Remove weight and remove paneer from cloth; discard any liquid.\nSerious Eats / Amanda Suarez\nNotes\nThis recipe can be easily doubled or tripled as needed.\nWhole milk or 2% skim milk work best when making paneer.\nUse cheese-grade calcium chloride. Calcium chloride can be purchased at cheese-making supply stores, as well as\nonline\n. Liquid solutions of calcium chloride can be used as well, but be sure to use an equivalent weight of calcium chloride.\nMake-Ahead and Storage\nThe paneer can be stored, tightly wrapped, in the refrigerator for up to 3 days or in the freezer for up to 1 month.\nIndian\nStovetop\nVegetarian\nThe Latest\nPaneer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fresh-paneer.webp?"
}