{
  "url": "https://www.seriouseats.com/fried-pickle-dip-recipe-8702294",
  "image_url": null,
  "tags": [
    "Dips",
    "The Latest",
    "4th of July",
    "Labor Day",
    "Summer Snacks & Appetizers"
  ],
  "title": "Fried Pickle Dip",
  "full_text": "Fried Pickle Dip\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nChill Time\n30 mins\nTotal\n45 mins\nServes\n8\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(227g)\nsour cream\n1/2\ncup\nmayonnaise\n(4 ounces; 110g)\nOne\n1\n-\nounce\nenvelope\nranch dressing mix\n3/4\ncup\ndrained and chopped\ndill pickles\n(3 1/2 ounces; 102g), plus 1/2 cup (120ml) dill pickle juice, divided\n2 tablespoons (4g) finely chopped\nfresh dill\n2\ntablespoons\nunsalted butter\n(1 ounce; 28g)\n2/3\ncup\npanko\n(1 3/4 ounce; 50g)\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use a pinch\nWavy\ndill pickle potato chips\n, for serving\nDirections\nIn a medium bowl, whisk sour cream, mayonnaise, ranch dressing mix, 1/2 cup chopped pickles, 1/4 cup pickle juice, and dill in a medium bowl to combine. Cover and chill dip until thickened slightly, about 30 minutes.\nSerious Eats / Robby Lozano\nMeanwhile, in a medium skillet, heat butter and 2 tablespoons pickle juice over medium heat until simmering, about 1 minute. Add panko; cook, stirring constantly, until lightly toasted, about 2 minutes. Add remaining 2 tablespoons pickle juice and salt; cook, stirring constantly, until deep golden and crispy, 2 to 4 minutes. Remove from heat and let cool in skillet, about 5 minutes.\nSerious Eats / Robby Lozano\nStir 2 tablespoons of the pickled-panko mixture into sour cream mixture; mix until combined. Transfer to a serving bowl and garnish with about 1/3 cup pickled panko or more to taste. (Reserve any remaining panko to refresh dip or as a topper for salads and pasta.) Top dip with remaining 1/4 cup chopped pickles. Garnish with dill. Serve with potato chips.\nSerious Eats / Robby Lozano\nMake-Ahead and Storage\nDip can be prepared through step 1 up to 1 day ahead and stored covered in the refrigerator. Toast the breadcrumbs shortly before serving.\nLeftover dip can be refrigerated in an airtight container for up to 5 days. The breadcrumbs will soften slightly but the dip will be no less delicious.\nLeftover pickled-panko can be stored in an airtight container at room temperature for up to 3 days or frozen for up to a month.\nDips\nThe Latest\n4th of July\nLabor Day\nSummer Snacks & Appetizers"
}