{
  "url": "https://www.seriouseats.com/fried-sweet-cheese-pierogies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8q4Ni1GeTUY3UnpCLMxjlLBA9mI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__03__20140318-287069-sweet-cheese-pierogies-73e206a66d1f4427a6034573b3b01821.jpg",
  "tags": [
    "Frying",
    "Cheese"
  ],
  "title": "Fried Sweet Cheese Pierogi Recipe",
  "full_text": "Fried Sweet Cheese Pierogi Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n55 mins\nActive\n90 mins\nResting Time\n30 mins\nTotal\n110 mins\nServes\n40 pierogies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1\npound\nFarmer's cheese\n2\ntablespoons\nsugar\n, plus more to taste\n1\nlarge\negg, beaten\nFor the Dough:\n3\ncups\n(\n15\nounces\n)\nall-purpose flour\n1\nteaspoon\nkosher salt\n1/4\ncup\n(\n4\ntablespoons\n) cold\nbutter\n, cut into 1/4-inch cubes\n2\nlarge\neggs\n1/2\ncup\nsour cream\n2 to 4\ntablespoons\nwarm\nwater\n1\ntablespoon\nkosher salt\n(for water)\n1\nquart\ncanola, vegetable, or\npeanut oil\nSour cream\nfor serving (optional)\nApplesauce\nfor serving (optional)\nCaramelized onions\nfor serving (optional)\nDirections\nTo make the filling:\nWhisk together cheese and sugar in a medium bowl. Taste and adjust sweetness with more sugar as desired. Whisk in egg until thoroughly combined. Cover bowl and place filling in refrigerator until ready to use.\nTo make the dough:\nPlace flour and salt in the workbowl of a food processor and pulse to combine. Add the butter and pulse until butter is broken into small clumps. Whisk together eggs and sour cream in a small bowl. With motor running, pour egg and sour cream mixture through feed tube. With motor still running, add water, 1 tablespoon at a time, until dough forms into a ball.\nTransfer dough to a lightly floured counter and knead until it becomes smooth, 1 to 2 minutes. Wrap in plastic wrap and let rest for 30 minutes.\nRoll dough out on a lightly floured surface into a large sheet approximately 1/16-inch thick. Cut out rounds using 3-3 1/2-inch biscuit cutter. Remove excess dough, shape into a ball, re-roll, and wrap in plastic.\nPlace 1 heaping teaspoon of filling in center of each round. Brush edges of round with water, fold over, and seal wrapper shut by pressing edges down with tines of a fork. Transfer to a tray lined with parchment paper. Repeat steps 4 and 5 with remaining dough and filling\nBring 2 quarts of salted water to a boil in medium pot. Working in 4 to 5 batches, boil pierogi until dough is just cooked through, 3 to 5 minutes. Using a wire mesh spider or slotted spoon, transfer pierogi to a colander set in the sink to drain.\nAfter all pierogi have been boiled, drain pot and wipe dry. Add oil to pot and heat to 375°F. Adjust flame to maintain heat. Working in batches of 4 to 6 pierogi at a time, fry until golden brown and crisp, 3 to 5 minutes. Using a wire mesh spider, transfer pierogi to a paper towel-lined tray to drain. Season with salt. Serve immediately with sour cream, applesauce, and/or caramelized onions.\nSpecial equipment\nFood processor\nThis Recipe Appears In\nHow to Make Fried Sweet Cheese Pierogi\nFrying\nCheese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fried-sweet-cheese-pierogi-recipe.webp?"
}