{
  "url": "https://www.seriouseats.com/fried-calamari-with-red-sauce",
  "image_url": "https://www.seriouseats.com/thmb/RLHQFr_lp9-HTIWBikzVwu4M17s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20201125-fried-calamari-vicky-wasik-10-9cee3a081e96476b89e29b331d30be61.jpg",
  "tags": [
    "Squid",
    "Seafood",
    "Italian",
    "Fried Seafood",
    "Snacks & Appetizers"
  ],
  "title": "Fried Calamari With Red Sauce Recipe",
  "full_text": "Fried Calamari With Red Sauce Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nActive\n50 mins\nMarinating Time\n30 mins\nTotal\n70 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(120ml)\nmilk\n1\nteaspoon\n(3g)\nDiamond Crystal kosher salt\n; for table salt use half as much by volume or the same weight\n1\npound\n(454g)\ncleaned squid\n, bodies sliced into 3/4-inch thick rings, tentacles left whole\n1 3/4\ncups\n(7 ounces; 200g)\nall-purpose flour\n1/3\ncup\n(1 1/2 ounces; 44g)\ncornstarch\n1/2\nteaspoon\nfreshly ground black pepper\n1/4\nteaspoon\nbaking powder\n2\nquarts\n(1.9L)\nvegetable\nor other neutral\noil\n1\nrecipe\nQuick and Easy Italian-American Red Sauce in 40 Minutes or Less\n(see note)\nLemon wedges\n, for serving\nDirections\nIn a medium bowl, whisk together milk and salt. Add squid and toss to coat. Cover and refrigerate squid for at least 30 minutes and up to 2 hours.\nIn a large bowl, whisk together flour, cornstarch, pepper, and baking powder until thoroughly combined, about 30 seconds. Set aside.\nSet a wire rack in a rimmed baking sheet and place a colander on top of the rack. Set a second wire rack in another rimmed baking sheet and line rack with paper towels. Heat oven to 200°F (95°C).\nUsing clean hands, remove half of squid from milk mixture, allowing excess liquid to drain back into bowl, then transfer to flour mixture. Toss squid to coat evenly. Gently shake off excess flour and transfer squid to colander set over wire rack. Shake colander to sift out any excess flour, then transfer squid in a single layer to wire rack. Repeat with remaining squid. Let dredged squid rest for 15 minutes.\nMeanwhile, heat oil in Dutch oven or wok over high heat to 365°F (185°C). Add half of squid and fry until golden brown, stirring occasionally to prevent pieces from sticking to each other, about 3 minutes (the oil temperature will drop significantly once the squid is added; adjust heat to maintain temperature between 275-300°F/135-150°C).\nUsing a slotted spoon or spider, transfer calamari to prepared paper towel–lined rack, season lightly with salt, then transfer to oven to keep warm.\nSkim any browned bits from oil and discard. Return oil to 365°F (185°C) and repeat with remaining squid.\nTransfer calamari to plate and serve immediately with red sauce and lemon wedges.\nSpecial equipment\nTwo\nrimmed baking sheets\nand two\nwire racks\n;\nDutch oven\nor\nwok\nNotes\nYou may want to reduce the red sauce by gently simmering it on the stovetop until thickened to a consistency better suited to dipping. It's hard to predict how long this may take, since it will depend on the starting consistency of the sauce, its volume, the size and shape of the vessel it's in, and the heat level of the stovetop; it will often be as quick as a 5 or 10 minute simmer, though it could take longer to thicken the sauce up to a calamari-coating consistency.\nMake-Ahead and Storage\nThe calamari can be soaked in milk up to 2 hours before frying, but is best fried immediately before serving.\nSquid\nSeafood\nItalian\nFried Seafood\nSnacks & Appetizers"
}