{
  "url": "https://www.seriouseats.com/fried-chicken-cole-slaw-sandwich-recipe",
  "image_url": "https://www.seriouseats.com/thmb/BogoQuEuaQMmkQojZ1BxKbQAD5c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130713-fried-chicken-cole-slaw-sandwich-8-6a0a2a9c08aa49d4ad5bdfd10b3dc508.jpg",
  "tags": [
    "Sandwiches",
    "Fried Chicken",
    "Chicken Thighs"
  ],
  "title": "Fried Chicken and Coleslaw Sandwiches Recipe",
  "full_text": "Fried Chicken and Coleslaw Sandwiches Recipe\nClose\nJump to recipe\nActive\n30 mins\nTotal\n0 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\nSugar\n8\nboneless skinless chicken thighs\n2\ntablespoons\nfreshly\nground black pepper\n1\ntablespoon\npaprika\n2\nlarge\neggs\n1\ncup\nbuttermilk\n2\ncups\nall-purpose flour\n2\nquarts\npeanut oil\n1\nrecipe\nCreamy Cole Slaw\n8\nsoft\nhamburger buns\n, toasted\nDirections\nCombine 1/4 cup kosher salt and 1/4 cup sugar with 1 quart water and stir to dissolve. Place chicken thighs in a gallon-size zipper-lock bag. Add brine and seal bag, pressing out as much air as possible. Let chicken brine at least 6 hours and up to overnight.\nMeanwhile, combine black pepper, paprika, and 2 tablespoons kosher salt in a small bowl. Set aside.\nWhen ready to fry, whisk together eggs, buttermilk, and half of spice mixture in a large bowl until homogenous.\nWhisk together flour and remaining half of spice mixture in a separate bowl. Drizzle 4 tablespoons of egg mixture into flour and pinch with fingers until combined.\nRemove chicken from brine and pat dry with paper towels. Transfer to buttermilk mixture and turn to coat. Working one piece at a time, allow excess milk mixture to drip off then transfer to flour mixture. Turn to coat, pile extra mixture on top of thigh, and press down firmly to adhere as much mixture as possible to the meat. Lift thigh, shake off excess flour, then transfer to a rack set in a tray and let rest for 10 minutes.\nMeanwhile, preheat oil to 350°F in a large wok, deep fryer, or Dutch oven.\nCarefully lower chicken into hot oil and cook, turning thighs occasionally until golden brown and crisp on all sides, and chicken is cooked through, about 6 minutes total. Transfer to a paper towel-lined plate.\nPlace 1/4 cup of slaw on bottom half of each bun and top with a piece of chicken. Serve immediately.\nSpecial Equipment\nDutch oven or deep wok for frying\nThis Recipe Appears In\nFried Chicken Sandwiches with Coleslaw\nSandwiches\nFried Chicken\nChicken Thighs",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fried-chicken-and-coleslaw-sandwiches-recipe.webp?"
}