{
  "url": "https://www.seriouseats.com/fried-oreos-recipe-8766100",
  "image_url": "https://www.seriouseats.com/thmb/glbxLwS8tw69jVtqYkWP-D3eQAQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241126-SEA-Fried-Oreos-MorganHuntGlaze-Hero1-24-1d63bfb178764a348248eef396b64022.jpg",
  "tags": [
    "Desserts",
    "The Latest"
  ],
  "title": "Fried Oreos",
  "full_text": "Fried Oreos\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nChill Time:\n30 mins\nTotal\n50 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n24\ncream-filled chocolate sandwich cookies\n, such as Oreo Double Stuf\nVegetable oil\n, for frying\n2\nlarge eggs\n3/4\ncup\nplus\n2\ntablespoons\n(\n210\nml\n)\nwhole milk\n2\ntablespoons\ngranulated sugar\n(\n1\nounce\n;\n30\ng\n)\n2\nteaspoons\nvanilla extract\n1 3/4\ncups\nall-purpose flour\n(about\n8\nounces\n;\n224\ng\n)\n3/4\nteaspoon\nbaking powder\n1/2\nteaspoon\nDiamond Crystal kosher salt\n, plus more to taste; for table salt, use half as much by volume\nPowdered sugar\n, for dusting\nDirections\nOn a 13- by 18-inch rimmed baking sheet, arrange cookies in even layer. Freeze, uncovered, until firm, about 30 minutes.\nSerious Eats / Morgan Hunt Glaze\nFill a large Dutch oven with 2 inches oil. Heat over medium-high heat until a deep-fry or instant-read thermometer registers 375°F (190°C). Line another 13- by 18-inch rimmed baking sheet with a double layer of paper towels; set aside.\nSerious Eats / Morgan Hunt Glaze\nMeanwhile: In a large bowl, whisk eggs, milk, sugar, and vanilla to combine. Using a fine-mesh sieve, sift flour, baking powder, and salt over egg mixture; using a flexible spatula, fold flour mixture in until combined and smooth. Set aside until oil is ready.\nSerious Eats / Morgan Hunt Glaze\nWorking 1 at a time, dip frozen cookie in batter, turning and using a spoon, if necessary, to ensure entire cookie is coated in batter. Working quickly, use fingers to lift cookie from batter and carefully lower battered cookie into oil, sliding them in from as close to the oil as possible to minimize splashing. Repeat process with 5 more cookies until 6 total battered cookies are in oil. Cook, turning halfway through, until golden brown, about 2 minutes per batch. Using a spider skimmer or slotted spoon, transfer fried cookies to prepared baking sheet. Season to taste with salt. Repeat with remaining cookies and batter, frying in batches of 6 and adjusting heat as needed to maintain an oil temperature of 375ºF (190ºC). Dust with powdered sugar and serve warm.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nTwo 13- by 18-inch rimmed baking sheets, large Dutch oven, deep-fry or instant-read thermometer, spider skimmer or slotted spoon\nNotes\nOther flavors of Oreo or similar cookies will work here as well, assuming their filling recipe and consistency is relatively the same.\nMake-Ahead and Storage\nOK, fine, you can store that batter in the refrigerator for up to 2-to-3 days. You can also store leftover fried Oreos in an air-tight container in the refrigerator for up to three days and reheat them in an airfryer. But what did I tell you? Just eat them now.\nDesserts\nThe Latest"
}