{
  "url": "https://www.seriouseats.com/fried-eggs-ramps-morels-bacon-easy-spring-recipe",
  "image_url": null,
  "tags": [
    "Eggs",
    "Spring Breakfast & Brunch",
    "Fried Eggs",
    "Bacon",
    "Morel Mushroom"
  ],
  "title": "Fried Eggs With Ramps, Morels, and Bacon",
  "full_text": "Fried Eggs With Ramps, Morels, and Bacon\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n10 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\n(\n100\ng\n)\ndiced bacon\n6\nounces\nmorel mushrooms\n(about\n3\ncups\n;\n160\ng\n),\ncleaned, trimmed, and cut in half lengthwise\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, divided\n6\nounces\nramps\n(about a dozen ramps;\n160\ng\n), root ends trimmed, white bottoms separated from green tops\n1/2\nteaspoon\n(\n2.5\nml\n)\nsoy sauce\n1\nteaspoon\n(\n5\nml\n)\nfresh juice\nfrom\n1\nwhole\nlemon\n1\ntablespoon\n(\n15\nml\n)\ncanola oil\n2\neggs\nKosher salt\nand freshly ground black pepper\n2\nslices\nhearty\nbuttered toast\nSliced fresh chives\n, to garnish\nDirections\nHeat bacon along with 1 tablespoon (15ml) water in a medium cast iron or stainless steel skillet over medium heat, stirring, until water evaporates, bacon fat renders, and bacon is completely crisp, about 5 minutes. Using a slotted spoon, transfer bacon to a bowl and set aside.\nReturn skillet to medium-high heat until lightly smoking. Add morels and cook, stirring and tossing frequently, until barely starting to brown, about 2 minutes. Add 1 tablespoon (15g) butter and cook, stirring, until morels are nicely browned but not burnt, 1 to 2 minutes longer.\nAdd ramps and cook, stirring and tossing frequently, until whites are browned and tender and greens are crisp in spots, about 2 minutes. Add 2 tablespoons (30ml) water, soy sauce, lemon juice, and remaining tablespoon butter. Remove from heat and set aside.\nHeat canola oil in a medium nonstick or well-seasoned cast iron skillet over medium-high heat until shimmering. Add eggs, season with salt and pepper, and cook, occasionally using a spoon to baste hot oil over the whites to help them cook, until whites are set, edges are crisp, and yolk is still runny.\nPlace a slice of toast on each of two plates. Top each with a fried egg. Return morel/ramp mixture to high heat and stir in bacon. Cook over high heat until liquid reduces to a creamy, emulsified sauce. Season to taste with salt and pepper. Spoon morels and ramps over and around fried eggs. Sprinkle with chives and serve.\nSpecial Equipment\n10-inch cast iron skillet\nor\n10-inch stainless steel skillet\nEggs\nSpring Breakfast & Brunch\nFried Eggs\nBacon\nMorel Mushroom"
}