{
  "url": "https://www.seriouseats.com/fried-rice-with-chinese-sausage-cabbage-and-torch-hei",
  "image_url": "https://www.seriouseats.com/thmb/iWBdODth5zxb5VOihoXb5aLYcCU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200117-wok-hei-hack-fried-rice-vicky-wasik-1114-dd76e6412e984bf98c5f1a20c5fc6910.jpg",
  "tags": [
    "Chinese",
    "Stir-Fry",
    "Stovetop",
    "White Rice",
    "Sausages"
  ],
  "title": "Fried Rice With Chinese Sausage, Cabbage, and Torch Hei Recipe",
  "full_text": "Fried Rice With Chinese Sausage, Cabbage, and Torch Hei Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n10 mins\nTotal\n20 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n2\ntablespoons\n(\n30\nml\n)\nchicken broth\n1\ntablespoon\n(\n15\nml\n)\nShaoxing wine\n(see note)\n1\nteaspoon\n(\n5\nml\n)\nsoy sauce\n1\nteaspoon\n(\n5\nml\n)\ntoasted sesame oil\n1\nteaspoon\n(\n5\ng\n)\nsugar\n1\nlarge\ngarlic clove\n(\n5\ng\n), finely grated\n1/4\nteaspoon\nwhite pepper\nFor the Rice:\n3\ntablespoons\n(\n45\nml\n)\nvegetable oil\n, divided\n2\ncups\ncooked white\nor jasmine\nrice\n(\n12\nounces\n;\n350\ng\n)\nKosher salt\n8\nounces\n(\n225\ng\n)\nNapa cabbage\n, cut into 1/2-inch pieces\n4\nounces\n(\n112\ng\n)\nChinese sausage\n, boiled and cut into 1/4-inch pieces (see note)\n3\nounces\n(\n85\ng\n)\nfrozen peas\n2\nmedium\nscallions\n(\n30\ng\n), thinly sliced\nDirections\nFor the sauce:\nIn a small bowl, whisk chicken broth, wine, soy sauce, sesame oil, sugar, garlic, and white pepper together until well-combined. Set aside.\nFor the rice:\nIf using day-old rice (see note), transfer to a medium bowl and break the rice up with your hands into individual grains before proceeding. In a wok, heat 1 1/2 teaspoons (7ml) oil over high heat until smoking. Add half of the rice, season lightly with salt, and cook, stirring and tossing, until rice is pale brown and toasted, and has a slightly chewy texture, about 3 minutes. Transfer rice to a medium bowl. Repeat cooking process with another 1 1/2 teaspoons oil and remaining rice. Set rice aside.\nHeat remaining 2 tablespoons (30ml) oil in now-empty wok over high heat until smoking. Add cabbage, season lightly with salt, and cook, stirring and tossing, until just tender, about 1 minute. Using blowtorch, hold flame 2 to 3 inches above skillet while stirring and tossing constantly, until oil combusts and imparts smoky aroma, about 30 seconds. Season to taste with salt and white pepper.\nStir in sausage and cook, stirring frequently, until sausage is heated through, about 1 minute. Stir in sauce mixture and cook until fragrant, about 15 seconds. Add rice and toss to combine. Add frozen peas and scallions and continue to toss and stir until peas are thawed and every grain of rice is separate. Using blowtorch, hold flame 2 to 3 inches above skillet while stirring and tossing constantly, until oil combusts and imparts smoky aroma, about 30 seconds. Serve.\nSpecial equipment\nCarbon steel wok\nor\ncarbon steel skillet\n,\nhigh-output kitchen torch\nNotes\nDry sherry can be substituted for Shaoxing wine.\nFor best results, use Chinese-style medium-grain rice, jasmine rice, or sushi rice. Rice should either be cooked fresh, spread on a tray, and allowed to cool for five minutes, or, alternatively, cooked in advance and refrigerated in a covered container for at least 12 hours and up to 3 days.\nFor a more pleasant texture, it’s often helpful to boil or steam Chinese sausage before throwing it into a dish. Boil the sausages for 6 to 8 minutes in water to soften and cook them through before cutting.\nMake-Ahead and Storage\nFried rice is best enjoyed immediately, but the cooked rice used in this recipe can be (and is best) made up to 3 days in advance and refrigerated in an airtight container.\nThis Recipe Appears In\nHei Now, You’re a Wok Star: A Fiery Hack for Stir-Frying at Home\nChinese\nStir-Fry\nStovetop\nWhite Rice\nSausages",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fried-rice-with-chinese-sausage-cabbage-and-torch-hei-recipe.webp?"
}