{
  "url": "https://www.seriouseats.com/fried-potato-mochi-5202556",
  "image_url": "https://www.seriouseats.com/thmb/jE7lg4Te35QJnezd0gV41C-um3c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Beauty_-45a1c9aec9a44da3b790694cf3dbf2be.jpg",
  "tags": [
    "Russet Potatoes",
    "Japanese",
    "Snacks & Appetizers",
    "Fried Potatoes",
    "The Latest"
  ],
  "title": "Fried Potato Mochi",
  "full_text": "Fried Potato Mochi\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs\nTotal\n2 hrs 5 mins\nMakes\n12 mochi\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Mochi:\n1 1/4\npounds\n(\n565\ng\n) peeled, 2-inch Russet potato chunks, from about\n1 1/2\npound\n(\n680\ng\n)\nRusset potatoes\n(see note)\n3/4\ncup\n(\n145\ng\n)\nunmodified potato starch\n, such as\nBob’s Red Mill\n(see note)\n1/2\ncup\nplus\n2\ntablespoons\n(\n150\nml\n)\ncold water\n2 1/2\nteaspoons\n(\n8\ng\n)\ninstant dashi\n, such as\nHondashi\n(see note)\nNonstick cooking spray\nFor the Sauce:\n1/2\ncup\n(\n120\nml\n)\nmirin\n1/2\ncup\n(\n120\nml\n)\ncold water\n1/4\ncup\n(\n60\nml\n)\nsoy sauce\n1/4\ncup\n(\n1 3/4\nounces\n;\n50\ng\n)\nsugar\n1\ntablespoon\n(\n12\ng\n)\npotato starch\n2\nmedium\ngarlic cloves\n(\n10\ng\n), peeled and lightly smashed\nTo Fry and Finish:\n1\ncup\n(\n235\nml\n)\nvegetable oil\n2\nfull-sized\nnori sheets\n, cut into 1-inch by 7-inch strips (optional)\nDirections\nFor the Mochi:\nRinse potatoes in a large saucepan under cold water to remove debris; drain, return to pot, and cover with 2 inches of water. Bring to a boil over high heat, reduce heat to low, and simmer until potatoes can be easily pierced by a knife and begin to flake, about 20 minutes. Drain potatoes thoroughly.\nTim Chin\nIn a large mixing bowl, whisk together potato starch, water, and dashi until smooth, then add the drained potatoes. Using potato masher, mash potatoes until a smooth, lump-free dough begins to form, about 2 minutes, then transfer to a clean, unfloured work surface. Alternatively, use a ricer or food mill to purée the drained potatoes directly into the bowl, and mix with a spatula to form a smooth dough, before turning onto a clean work surface.\nTim Chin\nGently knead, using a bench scraper in one hand to help gather dough, until dough no longer sticks to hands and is malleable and cohesive, about 30 seconds. Return dough to bowl, cover loosely with plastic wrap, and let cool until lukewarm and firmed slightly, at least 30 minutes and up to 2 hours.\nTim Chin\nLine a rimmed baking sheet with parchment paper and spray with nonstick cooking spray. Lightly spray work surface as well. Transfer dough to prepared work surface and gently press into an even 9- by 10-inch rectangle, measuring approximately 1/2 inch thick. Use bench scraper to press and square sides to help form the shape.\nUsing a bench knife, cut dough into twelve 3- by 2 1/2-inch portions. If pieces are not perfectly square, trim with a knife, if desired. Using the bench scraper, carefully transfer squares to the prepared baking sheet. Refrigerate uncovered until cooled and firm, at least 30 minutes and up to 2 hours.\nTim Chin\nFor the Sauce:\nMeanwhile, in a medium saucepan, whisk together mirin, water, soy sauce, sugar, and potato starch. Add garlic, place saucepan over medium heat, bring mixture to boil, and cook, stirring occasionally, until bubbling subsides and mixture is thickened, glossy, and coats the back of a spoon, 4 to 6 minutes. Transfer mixture to a heatproof bowl and cool to room temperature (discard garlic). Set glaze aside until needed.\nTim chin\nTo Fry and Finish:\nSet a wire rack in a rimmed baking sheet. Heat oil in a 12-inch cast iron skillet to 325℉ (190℃). Carefully lower 6 potato squares into the oil and cook, adjusting heat to maintain a temperature between 275℉ and 325℉ (135-160℃), until first side is light brown, 2 to 4 minutes. Using a fish spatula, carefully flip potato squares and cook on the second side 2 to 4 minutes more. Continue flipping and cooking every 2 to 4 minutes, until mochi are deep golden brown all over, 8 to 10 minutes total. Transfer mochi to wire rack and let cool slightly. Repeat with remaining portions.\nTim Chin\nLightly dip one side of mochi in sauce to coat, letting excess drip off. If desired, wrap each mochi with nori, and place seam-side down. Serve right away.\nTim Chin\nSpecial Equipment\nPotato Masher, ricer, or food mill; digital thermometer; 12-inch cast iron skillet.\nNotes\nDo not use waxy potatoes like Red Bliss or Yukon Gold varieties; the texture will be gummier and less appealing. This recipe works best with starchy potatoes such as Russets.\nBe sure to use unmodified potato starch such as Bob’s Red Mill Premium Quality Unmodified Potato Starch. Using modified potato starch may produce a gummier, unpleasant texture.\nYou can substitute\nfreshly prepared cold dashi\nfor the instant dashi and cold water in the recipe if desired.\nMake-Ahead and Storage\nUncooked mochi can be stored, covered, in the refrigerator prior to frying for up to 3 days. Uncooked mochi can also be frozen for up to 4 weeks by freezing in a single layer on a baking sheet, then transferring to a zipper-lock freezer bag. To cook frozen mochi, let mochi thaw on rimmed baking sheet until soft but cool before frying (frying time may be a few minutes longer).\nRusset Potatoes\nJapanese\nSnacks & Appetizers\nFried Potatoes\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fried-potato-mochi.webp?"
}