{
  "url": "https://www.seriouseats.com/fried-green-tomatoes-recipe-8700273",
  "image_url": null,
  "tags": [
    "Tomato",
    "The Latest",
    "American",
    "Summer Snacks & Appetizers",
    "Summer Sides"
  ],
  "title": "Fried Green Tomatoes",
  "full_text": "Fried Green Tomatoes\nJump to recipe\nPrep\n20 mins\nCook\n15 hrs 15 mins\nChill Time (Rémoulade)\n20 mins\nTotal\n15 hrs 55 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Rémoulade\n1\ncup\nmayonnaise\n(8 ounces; 220g)\n1 1/2\ntablespoons\nchopped fresh flat-leaf\nparsley\n1 tablespoon (\n11\ng\n) chopped drained\ncapers\n1\ntablespoon\nhot sauce\n, such as Tabasco (1/2 ounce; 15g)\n2\nteaspoons\nCreole\nmustard\n(10g)\n1 1/2\nteaspoons\nCreole seasoning\n1\nteaspoon\nprepared horseradish\n1/2\nteaspoon\ngrated fresh\nlemon zest\nplus 1 1/2 teaspoons fresh juice (from 1 lemon)\n1\nsmall\ngarlic\nclove,\nfinely minced (about 1/4 teaspoon)\nFor the Fried Green Tomatoes\n3\nlarge\neggs\n1/3\ncup\nwhole buttermilk\n(2 2/3 ounces; 79ml)\n1 1/2\ncups\nall purpose flour\n(6 3/4 ounces; 191g)\n1 1/2\ncups\nyellow cornmeal\n(8 1/8 ounces; 234g\n1 1/2\ncups\nbreadcrumbs\n(7 3/4 oz; 224g)\n4\nmedium\ngreen tomatoes\n(2 pounds 2 ounce; 968g), tops and bottoms trimmed and sliced 1/4 inch thick\n1\ntablespoon\nCreole seasoning\nvegetable oil\n, for frying\nKosher salt\n, to taste\nDirections\nFor the Rémoulade:\nIn a small bowl, stir together mayonnaise, parsley, capers, hot sauce, mustard, Creole seasoning, horseradish, lemon zest and juice, and garlic; cover and refrigerate until ready to serve.\nSerious Eats / Robby Lozano\nFor the Fried Green Tomatoes:\nIn a wide and shallow bowl, gently whisk eggs and buttermilk together until well combined. Place flour in another shallow bowl. Thoroughly stir together cornmeal, breadcrumbs, and Creole seasoning to a third shallow bowl.\nSerious Eats / Robby Lozano\nDredge tomato slices in flour, shaking off excess. Dip in egg wash, allowing excess to drip off, and then dredge in breadcrumb mixture, pressing to coat all sides of each tomato slice. Place breaded tomatoes in a single layer on a plate or baking sheet.\nSerious Eats / Robby Lozano\nAdd vegetable oil to a large cast -iron skillet to a depth of 1/2 inch. Heat over medium-high until shimmering or oil reaches 375°F (190°C).\nSerious Eats / Robby Lozano\nWorking in 4 to 5 batches, place tomatoes in hot oil; cook, flipping occasionally, until crisp and golden brown, 2 to 3 minutes. Transfer fried tomatoes to a paper towel-lined plate to drain. Repeat with remaining tomatoes. Sprinkle fried green tomatoes with salt to taste.\nSerious Eats / Robby Lozano\nTransfer tomatoes to a platter and serve with chilled rémoulade.\nSerious Eats / Robby Lozano\nMake-Ahead and Storage\nThe rémoulade can be made up to 3 days ahead and stored in an airtight container in the refrigerator. Leftover fried green tomatoes can be stored in an airtight container in the refrigerator.\nTo reheat fried green tomatoes on the stove:\nPlace tomatoes in a cast iron skillet set over medium heat and reheat until warmed through.\nTo reheat fried green tomatoes in an air fryer:\nPlace on air fryer rack and reheat at 350ºF (175ºC) until warmed through.\nTo reheat fried green tomatoes in the oven:\nAdjust oven rack to middle position and preheat oven to 375ºF (190ºC). Place fried green tomatoes on a wire rack set inside a rimmed baking sheet and reheat until warmed through, 6 to 8 minutes.\nTomato\nThe Latest\nAmerican\nSummer Snacks & Appetizers\nSummer Sides"
}