{
  "url": "https://www.seriouseats.com/fried-radish-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/mfGevknll0K4s14WbvJCSKmwShw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__05__20130507-251170-singapore-carrot-cake-edit-fa4dc14313be45688af79cf0e088c448.jpg",
  "tags": [
    "Eggs",
    "Singaporean",
    "Frying",
    "Radishes"
  ],
  "title": "Fried Radish Cake (Singapore Carrot Cake) Recipe",
  "full_text": "Fried Radish Cake (Singapore Carrot Cake) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs\nActive\n50 mins\nChilling Time\n4 hrs\nTotal\n6 hrs 10 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 large\ndaikon radish\n(about\n28\nounces\n), grated\n1 3/4 cups (about\n7\nounces\n)\nrice flour\nKosher salt\n4\neggs\n2\nteaspoons\nfish sauce\n3\ntablespoons\ncanola oil\n3\ntablespoons\nChinese preserved vegetables\n(see note)\n2\ncloves\ngarlic\n, minced (about 1 teaspoon)\n1/4\nteaspoon\nwhite pepper\n1/2\nbunch\nscallions\n, sliced\n1/4\ncup\ncilantro leaves\n, chopped\nDirections\nPlace grated radish in a large straight sided skillet or saucepan with lid. Add 1/3 cup water and bring to simmer over medium heat. Cover and gently simmer until radish is translucent and tender, about 40 minutes. Remove lid and let cool.\nAdjust oven rack to middle position and preheat oven to 325°F or 165°C (see note). In a small bowl, whisk rice flour with 1 teaspoon salt and 3/4 cup water until smooth. Strain if there are lumps. Stir in cooled radish and any accumulated juice.\nPour mixture into a cake pan and cover with foil. Poke a few holes in the foil. Set pan in a large roasting pan and fill roasting pan halfway with hot water. Bake until just firm, about 50 minutes. Let cool to completely firm up for easy slicing, at least 4 to 6 hours in the refrigerator.\nRemove cake from refrigerator and divide into thirds. Cut one of the pieces into 3/4-inch cubes and set aside. Wrap and freeze remaining pieces for another time.\nIn a medium bowl, whisk eggs with fish sauce. Heat oil in wok or nonstick skillet over medium heat. Add radish cake cubes and fry, stirring, until golden and crisp, about 5 minutes.\nAdd preserved vegetables, garlic, and white pepper, and fry until fragrant, about 30 seconds. Pour eggs and scallions over mixture and cook, folding eggs from the sides over to the middle and pressing to hold the omelette together, until eggs are cooked through (see note). Sprinkle with cilantro and serve.\nSpecial Equipment\n8 or 9-inch\ncake pan\n,\nwok\nor\nnonstick skillet\nNotes\nMei cai, or\nChinese preserved vegetables\n, have been fermented with a salt brine. Preserved turnip is a common choice for this dish, though I used a jar labeled as \"vegetables.\" It can be purchased in packets or in jars in Asian supermarkets. If you can't find it, either omit or use a lesser amount of sauerkraut.\nThough I give directions for baking the cake in a water bath, this recipe traditionally starts with a steamed cake, which you can do if you own a steamer basket large enough to hold an 8- or 9-inch cake pan. Pour the mixture into the pan, set in the steamer basket, and simmer gently until the cake is just firm.\nDon't worry if the eggs and radish cake break apart while cooking—it doesn't have to be a cohesive omelette.\nRead More\nChinese Turnip Cake With Sausage, Bacon, and Mushrooms (Law Bok Gow)\nCrisp and Chewy Thai Fried Chive Cakes (Kanom Gui Chai)\nEggs\nSingaporean\nFrying\nRadishes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fried-radish-cake-singapore-carrot-cake-recipe.webp?"
}