{
  "url": "https://www.seriouseats.com/fried-breaded-chicken-cutlets-recipe",
  "image_url": null,
  "tags": [
    "Fried Chicken",
    "Stovetop Chicken",
    "Chicken Cutlets",
    "Quick Dinners"
  ],
  "title": "Easy Breaded Fried Chicken Cutlets Recipe",
  "full_text": "Easy Breaded Fried Chicken Cutlets Recipe\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n20 mins\nTotal\n40 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nall-purpose flour\n(\n4 1/2\nounces\n;\n130\ng\n)\n3\nlarge\neggs\n, beaten\n1\ncup\npanko bread crumbs\n(\n3\nounces\n;\n85\ng\n), roughly crushed by hand if very large\n1\nounce\ngrated\nParmigiano-Reggiano cheese\n(about\n1\ncup\n;\n30\ng\n)\n2\nboneless, skinless\nchicken breast\nhalves (\n5 to 7\nounces\neach),\ncut into 4 cutlets and pounded to about 1/4-inch thick each\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; plus more to finish after frying; for table salt, use half as much by volume\nFreshly ground black pepper\nClarified butter\nor\nvegetable oil\n, for frying (about\n1 to 1 1/2\ncups\n; see note)\n5-minute radicchio and watercress salad\n(optional)\nLemon wedges\n, for serving (optional)\nDirections\nSet 3 wide, shallow bowls on a work surface. Add flour to the first one, beaten eggs to the second, and panko and Parmesan cheese to the third. Mix panko and Parmesan thoroughly.\nSeason both sides of chicken cutlets with salt and pepper. Working with one at a time, dredge a cutlet in flour with your left hand, shaking off excess. Transfer to egg dish, then turn cutlet with your right hand to coat both sides. Lift and allow excess egg to drain off, then transfer to bread crumb mixture. With your left hand, scoop bread crumbs on top of chicken, then gently press, turning chicken to ensure a good layer of crumbs on both sides. Transfer cutlet to a clean plate and repeat with remaining cutlets.\nSerious Eats / Vicky Wasik\nFill a large cast iron skillet with 1/4-inch clarified butter or frying oil. (To speed things up even more, use 2 skillets simultaneously.) Heat cooking fat over high heat until shimmering and just shy of smoking, about 375°F (190°C) on an instant-read thermometer.\nUsing tongs or your fingers, gently lower cutlets into the hot fat, laying them down away from you to prevent hot fat from splashing toward you. (Work in batches if necessary.) Fry, gently swirling pan and rotating cutlets for even browning, and adjust heat as necessary for a steady, vigorous bubble, until the bottom side of cutlet is browned and crisp,  2 1/2 to 3 minutes. Flip cutlets and fry until other side is browned and crisp, 2 1/2 to 3 minutes longer. Transfer to a paper towel-lined plate or baking dish and season with salt right away. Repeat with remaining cutlets. Serve immediately with\n5-minute radicchio and watercress salad\nand lemon wedges on the side, if desired.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge cast iron skillet\n,\ninstant-read thermometer\nNotes\nClarified butter will give the chicken the best possible flavor, but it requires more work and tends to be more expensive; oil is absolutely fine as a time- and cost-saving ingredient. If you do want to try clarified butter, follow the\ninstructions here\n.\nRead More\nHow to Cut Chicken Breasts Into Cutlets\nClarified Butter Recipe\n5-Minute Radicchio and Watercress Salad Recipe\nFried Chicken\nStovetop Chicken\nChicken Cutlets\nQuick Dinners"
}