{
  "url": "https://www.seriouseats.com/frijoles-charros-mexican-pinto-beans-bacon-recipe",
  "image_url": "https://www.seriouseats.com/thmb/35dSVaZ-fR0sn-0HYYOYWX-mLYM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/frijoles-charros-mexican-pinto-beans-bacon-recipe-step-06_1-8b6e46f4938e447f98b0a64fb9eb7bb6.JPG",
  "tags": [
    "Mexican",
    "Gluten-free Sides",
    "Braised & Stewed Beans",
    "Pinto Beans",
    "Dairy-free Sides"
  ],
  "title": "Frijoles Charros (Mexican Pinto Beans With Bacon and Chiles) Recipe",
  "full_text": "Frijoles Charros (Mexican Pinto Beans With Bacon and Chiles) Recipe\nClose\nJump to recipe\nPrep\n0 mins\nCook\n65 mins\nActive\n20 mins\nSoaking Time\n8 hrs\nTotal\n9 hrs 5 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(450g)\ndried pinto beans\nKosher salt\n6\ncups\n(1.4L)\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\nbay leaves\n2\nsprigs\nepazote\n(optional; see note)\n12\nounces\n(340g) diced\nbacon\n(see note)\n1 medium white or\nyellow onion\n, diced (about 8 ounces;\n225\ng\n)\n2\nserrano\nchiles\nor 1 jalapeño, minced (remove seeds and ribs if you prefer less heat)\n3 medium cloves\ngarlic\n, minced (about 1 tablespoon;\n12\ng\n)\n2\n(\n14-ounce\n; 400g)\ncans\ndiced fire-roasted tomatoes\n(see note)\nLarge handful\nchopped fresh cilantro leaves\nand fine stems\nDirections\nPlace beans in a large bowl and fill with enough cold water to cover by at least four inches. Add 2 tablespoons (18g) kosher salt and stir to dissolve. Let soak 8 to 12 hours. Drain and rinse.\nSerious Eats / Diana Chistruga\nIn a large Dutch oven, add beans, stock, bay leaves, 2 teaspoons (6g) kosher salt, and epazote (if using). Bring to a boil over high heat, reduce to a bare simmer, cover, and cook until beans are just tender, about 45 minutes.\nSerious Eats / Diana Chistruga\nMeanwhile, heat bacon in a 12-inch stainless steel or cast iron skillet over medium-high heat. Cook, stirring constantly, until fat is rendered and bacon is just starting to brown around the edges, about 5 minutes. Add onion and chiles and cook, stirring, until softened and just starting to brown, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add tomatoes (see note) and cook, stirring and scraping up browned bits from the bottom of the pan, until the liquid is thick and the mixture begins to sizzle, about 3 minutes.\nSerious Eats / Diana Chistruga\nRemove lid from Dutch oven, add bacon-tomato mixture, and continue cooking, stirring occasionally, until beans are completely creamy and liquid has thickened into a rich, creamy broth, about 20 minutes. Season to taste with salt. Discard bay leaves, stir in cilantro, and serve. Beans can be stored in the refrigerator for up to 1 week.\nSerious Eats / Diana Chistruga\nNotes\nIn place of the canned fire-roasted tomatoes, you can use 1 1/2 pounds fresh Roma tomatoes. Char the tomatoes directly over a gas flame, on a grill, or with a torch to remove the skins. Split into quarters and cut out and discard the cores. Dice and use as directed in the recipe.\nEpazote is a Mexican herb that can be found in Mexican specialty shops. If fresh epazote is unavailable, use a large pinch of dried in its place, or omit.\nThis recipe is great over a campfire. If cooking over a live fire, you can use salt pork in place of the bacon for a more naturally smoky flavor.\nMexican\nGluten-free Sides\nBraised & Stewed Beans\nPinto Beans\nDairy-free Sides"
}