{
  "url": "https://www.seriouseats.com/fritto-misto-di-mare-fried-mixed-seafood-5212686",
  "image_url": null,
  "tags": [
    "Seafood",
    "Italian",
    "The Latest"
  ],
  "title": "Fritto Misto di Mare (Fried Mixed Seafood)",
  "full_text": "Fritto Misto di Mare (Fried Mixed Seafood)\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nTotal\n45 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n455\ng\n) medium to large head-on\nshrimp\nor 12 ounces (340g) medium shell-on shrimp (see note)\n3 4/5\nl\nvegetable oil\n310\ng\nsemolina flour\n70\ng\ncornstarch\n1/2\nteaspoon\nbaking powder\n1/4\ntsp\nkosher salt\n455\ng\nsquid\n12 ounces (\n340\ng\n)\nsmelt\n, cleaned (see note)\n1\nserving\nlemon\nDirections\nUsing kitchen shears or a sharp paring knife, cut through shrimp shells and devein shrimp without removing the shells. Pat dry with paper towels and set aside.\nVicky Wasik\nAdjust oven rack to middle position and preheat oven to 200°F (95°C). Set a wire rack in a rimmed baking sheet and place a colander on top of the rack. Set a second wire rack in another rimmed baking sheet and line rack with paper towels. In a large Dutch oven, heat oil over medium-high heat to 375°F (190°C).\nMeanwhile, in a large bowl, whisk together flour, cornstarch, and baking powder until thoroughly combined. Pat squid dry with paper towels and transfer to dredge mixture. Toss to evenly coat, then gently shake off excess flour and transfer squid to colander set over wire rack. Shake colander to sift out any excess flour, then transfer squid in a single layer to wire rack. Repeat process with the smelt, followed by the shrimp.\nVicky Wasik\nAdd shrimp to oil and fry until light golden brown, stirring occasionally to prevent shrimp from sticking together, 2 to 3 minutes. Using a spider skimmer or slotted spoon, transfer shrimp to prepared paper towel–lined rack, season lightly with salt, then transfer to oven to keep warm.\nVicky Wasik\nReturn oil to 375°F (190°C) and add half the squid. Fry until golden brown, stirring occasionally to prevent pieces from sticking to each other, about 3 minutes. Transfer squid to rack with shrimp, season lightly with salt, and return to oven to keep warm. Repeat with remaining squid.\nVicky Wasik\nReturn oil to 375°F (190°C) and add the smelt. Fry until smelt are pale golden and just cooked through, about 3 minutes. Transfer to rack with fried seafood and season lightly with salt. Transfer seafood to a serving platter lined with parchment or butcher paper and serve immediately with lemon wedges.\nVicky Wasik\nSpecial Equipment\nTwo\nrimmed baking sheets\nand two\nwire racks\n;\nDutch oven\n; spider skimmer.\nNotes\nMake sure to use shell-on, if not head-on shrimp for this recipe. The shells help prevent the shrimp meat from overcooking and impart flavor to the meat, thanks to glutamates and nucleotides in the shells that are absorbed by the meat during frying. On top of that, the shells crisp up when fried, providing a crunchy and completely edible coating without the need for a heavy dredge. Fried shrimp heads are delicious as well.\nSardines and other small fish commonly used for fritto misto di mare are generally unavailable in the United States, but smelt make a very good substitute. Smelt are generally sold cleaned (heads removed and gutted). Frozen smelt can be purchased online from purveyors such as Wulf's Fish.\nMake-Ahead and Storage\nLike most fried foods, fritto misto is best enjoyed immediately.\nSeafood\nItalian\nThe Latest"
}