{
  "url": "https://www.seriouseats.com/from-a-polish-country-house-kitchens-hunters",
  "image_url": "https://www.seriouseats.com/thmb/56F1vWY_KbVoxXgkWzKsAspCBw0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130214-240227-cook-the-book-polish-country-house-bigos-9dc2cf84f9be45bf8a90c59b159b78a2.jpg",
  "tags": [
    "Braised & Stewed Beef",
    "Polish",
    "Beef Chuck",
    "Other Meat & Poultry"
  ],
  "title": "Bigos (Polish Hunter's Stew)",
  "full_text": "Bigos (Polish Hunter's Stew)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs\nActive\n45 mins\nTotal\n2 hrs 30 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4 pounds (\n800\ng\n)\nsauerkraut\n4\nstrips\nbacon\nor, even better, 4 thin slices Canadian bacon, diced\n1\nsmall head\ngreen cabbage\n, thinly sliced\nSmall\nhandful\nof\ndried wild mushrooms\n(any kind)\n1/2 pound (\n225\ng\n)\nboneless venison\n, leg, or a stewing cut (not the loin), cut into 1-inch (2.5-cm) pieces\n1/2 pound (\n225\ng\n) boneless stew\nbeef\n, such as\nchuck\n, cut into 1-inch (2.5-cm) pieces\n1/2 pound (\n225\ng\n) pork or\nveal shoulder\n, cut into 1-inch (2.5-cm) pieces\n1/4 cup (\n30\ng\n)\nall-purpose flour\n3\ntablespoons\nvegetable oil\nor lard\n1\nmedium\nonion\n, peeled and chopped\n1\ncup\n(240ml)\ndry red wine\n1/2 pound (\n225\ng\n)\nsmoked kielbasa\nor another spicy hard sausage, thickly sliced\n1 cup (\n225\ng\n)\npitted prunes\n, quartered\nSalt\nand freshly ground pepper\nBread\nfor serving, preferably rustic and dark, such as a Russian loaf\nDirections\nDrain the sauerkraut, place it in a medium saucepan, and add 2 cups (480 ml) water and bacon pieces. Cover and boil over medium heat for 20 minutes or longer, until the sauerkraut is very tender and the bacon is cooked.\nMeanwhile, put the fresh cabbage and dried mushrooms in a separate large saucepan, cover with water, and bring to a boil. Continue boiling until the cabbage is tender, 20 to 30 minutes. Drain and set aside.\nRinse all the meat and pat dry. Put the flour in a shallow bowl and toss the meat to coat.\nHeat 1 tbsp of the vegetable oil over medium heat in a stew pot large enough to hold all the meat and vegetables. Cook the onion until softened, remove with a slotted spoon, and set aside. Add the remaining 2 tbsp oil to the pot and lightly brown the meat, in batches, over medium heat, 2 to 3 minutes per side, transferring the meat to a plate when it’s done.\nWhen all the meat has been browned, raise the heat to high, pour in the wine, and boil briefly, scraping up the browned bits on the bottom of the pot with a wooden spoon. Return the meat and all its resting juices back to the pot, and add the onion, kielbasa, prunes, cabbage, and the sauerkraut and bacon mixture, along with its cooking water. Salt generously, add several grinds of pepper, and bring to a boil.\nTurn down the heat, cover the pot with the lid slightly askew, and simmer on very low heat for a good 2 to 3 hours, until the meat falls apart and the broth is rich and brown. Stir the stew occasionally, and ensure that the liquid isn’t evaporating too quickly (add a small amount of water when necessary). Some like a watery bigos, but we find the tastiest outcome is for the sauerkraut, cabbage, and meat all to be practically melted together, with enough sauce to keep everything moist, but not so much that any of the ingredients float, as in a more traditional stew.\nServe in a large casserole with a big spoon and thick slices of dark peasant bread. You’ll of course need utensils, but the fun of it is to shovel the bigos and its juices on to the bread. Bigos lasts forever, and gets better with time. One of Anne’s friends routinely makes this on Wednesday to serve on Saturday night, and swears that it improves every day.\nBraised & Stewed Beef\nPolish\nBeef Chuck\nOther Meat & Poultry",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bigos-polish-hunters-stew.webp?"
}