{
  "url": "https://www.seriouseats.com/frozen-roasted-sweet-potato-5210149",
  "image_url": "https://www.seriouseats.com/thmb/T-CGb2kWGdAOMLwuLlpJ-0_l89E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211001-frozen-sweet-potatoes-vicky-wasik-6-f681675e31d647a39efa23c6d90de8f6.jpg",
  "tags": [
    "Sweet Potatoes",
    "Roasted Vegetables",
    "Fall",
    "The Latest"
  ],
  "title": "The Best Way to Cook Whole Sweet Potatoes",
  "full_text": "The Best Way to Cook Whole Sweet Potatoes\nClose\nJump to recipe\nPrep\n0 mins\nCook\n2 hrs 40 mins\nFreezing Time\n6 hrs\nTotal\n8 hrs 40 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFour\n1-pound (454 g)\nsweet potatoes\n, scrubbed (see note)\nThyme\n,\nrosemary\n,\nsage\n, or other aromatics (optional)\nDirections\nFor the Ultimate Method:\nPlace sweet potatoes in freezer until frozen solid, at least 6 hours and up to 3 months.\nVicky Wasik\nLine a rimmed baking sheet with aluminum foil. Wrap each frozen sweet potato in aluminum foil, adding aromatics if desired, and seal tightly so that there are no loose seams. Place wrapped sweet potatoes on prepared baking sheet and place in oven. Set oven to 300°F (150°C). Roast until a thin skewer inserted into potatoes meets no resistance, about 2 hours.\nRemove baking sheet from oven and carefully unwrap potatoes; discard aromatics, if using. Increase oven temperature to 450°F (232°C) and return unwrapped sweet potatoes to oven. Roast until sweet potatoes are fragrant and sugars begin to caramelize, about 40 minutes. Let roasted sweet potatoes stand until cool enough to handle, then serve as desired.\nVicky Wasik\nFor the Easier Method:\nFreeze the sweet potatoes for as long as you can (if you don't have time, proceed with cooking). Place them onto a foil-lined baking sheet.\nPlace on the center rack of a cold oven and turn the oven on to 425ºF (220ºC) and cook until fork tender, about 1 hour. If you have a little more time, you can start at 300ºF (150ºC) and cook the sweet potatoes for 30 minutes to an hour, before cranking the oven temperature to 425ºF (220ºC) to finish.\nNotes\nThis recipe works equally well with dry or moist sweet potato varieties. Dry sweet potatoes such as Okinawan purple or Hannah varieties will be fluffy and less sweet. Moist sweet potatoes such as Jewel, Garnet, or Beauregard varieties will taste juicier and sweeter.\nMake-Ahead and Storage\nRaw sweet potatoes can be kept frozen, unwrapped, for up to 3 months. Cooked and cooled sweet potatoes can be stored in the refrigerator for up to 1 week. You can also freeze the cooked potatoes, wrapped in plastic and foil, for up to 1 month.\nSweet Potatoes\nRoasted Vegetables\nFall\nThe Latest"
}