{
  "url": "https://www.seriouseats.com/fruit-tart-recipe-8652384",
  "image_url": "https://www.seriouseats.com/thmb/b2w0-0TPIGmDcb9UgsDFaBlp5lE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240522-SEA-FruitTart-AmandaSuarez-hero-34ab0ddc5f2043f9921ff94e09bc6920.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "French",
    "Pies",
    "Fruit",
    "Desserts"
  ],
  "title": "How to Make a Fresh Fruit Tart",
  "full_text": "How to Make a Fresh Fruit Tart\nClose\nJump to recipe\nPrep\n30 mins\nCook\n40 mins\nCooling and Refrigeration\n2 hrs 30 mins\nTotal\n3 hrs 40 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n1 1/2 cups (6 2/3 ounces;\n190\ng)\nall-purpose flour\n1/4 cup (1 3/4 ounce;\n50\ng\n)\ngranulated sugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n(for table salt, use half as much by volume)\n8 tablespoons (\n113\n)\ng\nunsalted butter,\nmelted and cooled slightly\n2 tablespoons (\n30\nml\n)\nwater\nFor the Tart:\n1\nrecipe\nfor\npastry cream\nor\nchocolate pastry cream\nor\nlemon pastry cream\nor\npistachio cream\n, prepared and refrigerated at least 2 hours and up to 3 days before assembly\n1\npound\nassorted\nberries\nsuch as raspberries, blackberries, blueberries, and/or strawberries\n2\nripe\npeaches,\nnectarines, or plums halved, pitted, and cut into ¼-inch wedges or 2 kiwis, peeled and sliced into ¼-inch thick rounds\n1/3\ncup\nred currant or\napple jelly\n1\nteaspoon\nwater\nDirections\nFor the crust:\nAdjust oven rack to middle position and heat oven to 350℉. In a large bowl, whisk flour, sugar, and salt together. Pour butter and water into the flour mixture and, using a flexible spatula, stir until well combined and a uniform dough is formed.\nSerious Eats / Amanda Suarez\nUsing your hands, pinch off and distribute three-quarters of the dough over the bottom of a 9-inch tart pan with a removable bottom. Using your hands and an off-set spatula or the bottom of a large measuring cup, press dough to an even thickness in the bottom of the pan. Pinch the remaining dough into smaller pieces and scatter evenly around the edge of the pan, then use your fingers to press dough into fluted sides of the pan. Press dough to even thickness until sides are completely covered.\nSerious Eats / Amanda Suarez\nPlace the dough-lined pan on a wire rack set in a rimmed baking sheet and bake until the crust is golden brown and firm to touch, 30 to 35 minutes, rotating pan halfway through baking. Set aside until ready to fill. (Cooled crust can be wrapped loosely in plastic wrap and stored at room temperature for up to 24 hours.)\nSerious Eats / Amanda Suarez\nFor the tart:\nWhisk the chilled filling until smooth, then transfer filling to the tart shell. Using an offset-spatula or back of a large spoon, spread it into an even smooth layer. Arrange fruit on top of pastry cream in your preferred design.\nSerious Eats / Amanda Suarez\nIn a small bowl, microwave jelly and 1 teaspoon water until fluid, 20 to 30 seconds. Using a pastry brush, gently dab mixture over fruit, avoiding crust. Refrigerate the tart for at least 30 minutes or up to 24 hours.\nSerious Eats / Amanda Suarez\nRemove the outer metal ring of the tart pan. Slide a thin metal spatula between the tart and the metal pan bottom to loosen the tart, then carefully slide the tart onto a serving platter.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9-inch tart pan with removable bottom, wire rack and rimmed baking sheet, pastry brush\nMake-Ahead and Storage\nPastry cream can be stored in an airtight container, with plastic wrap or buttered parchment paper placed directly on the surface, and refrigerated for up to 3 days before assembling the tart.\nCrust can be made up to 24 hours in advance of assembling the tart. After baking, cool crust completely, then wrap loosely in plastic wrap and store at room temperature until ready to fill.\nThe assembled fruit tart can be refrigerated, uncovered, for up to 24 hours. If refrigerated for more than 1 hour, let it sit at room temperature for 1 hour before serving.\nCustards, Mousses & Puddings\nFrench\nPies\nFruit\nDesserts"
}