{
  "url": "https://www.seriouseats.com/funny-cake-pie-recipe-8696196",
  "image_url": "https://www.seriouseats.com/thmb/hTdZdMnIZ_I7yHLvcjNT1MGpnLE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240815-SEA-FunnyPie-DebbieWee-Hero5-341-cf0e5d809bb94ad289317465825eafb8.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Pies",
    "Chocolate",
    "Desserts"
  ],
  "title": "Funny Cake Pie",
  "full_text": "Funny Cake Pie\nClose\nJump to recipe\nPrep\n30 mins\nCook\n60 mins\nChilling and Cooling Time\n90 mins\nTotal\n3 hrs\nServes\n8\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\n1 store-bought\npie crust\nor 1/2 recipe\neasy pie dough\n,\nsee notes\nFor the Cake:\n144\ng\nall-purpose flour\n(about 5 ounces; 1 1/8 cups all-purpose flour)\n1 1/2\nteaspoons\n(6g)\nbaking powder\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n56\ng\nunsalted butter\n(2 ounces; 4 tablespoons), softened\n150g\ngranulated sugar\n(about 5 1/4 ounces; 3/4 cup)\n1\nlarge\negg\n, at room temperature\n1\nteaspoon\nvanilla extract\n1/2\ncup\n(120ml)\nwhole milk\nFor the Chocolate Sauce:\n100g\ngranulated sugar\n(\n3 1/2\nounces\n; 1/2 cup)\n26g\nunsweetened cocoa powder\n(about\n1\nounce\n; 1/3 cup)\n1/3\ncup\n(80ml) boiling\nwater\n1/2\nteaspoon\nvanilla extract\nDirections\nOn a clean, lightly floured work surface, roll pie crust into a 12-inch circle about 1/8 inches thick. Transfer to 8-inch aluminum pie plate. Using a pastry brush, dust off excess flour; use it to nestle dough into corners of pan. With scissors or kitchen shears, trim dough to edge of the pie plate. Press a fork into the edge of the dough to create small indents around the entire perimeter of the pie crust. Cover with plastic wrap and refrigerate until cold, at least 1 hour, or up to 24 hours.\nSerious Eats / Debbie Wee\nAdjust oven rack to middle position and preheat to 350°F (175°C). Freeze pie crust while you prepare the cake batter, about 10 minutes.\nSerious Eats / Debbie Wee\nFor the Cake:\nIn a medium bowl, whisk flour, baking powder, and salt together. Place butter in a separate medium bowl and, using an electric hand mixer fitted with beaters, whip butter on high speed until creamy, about 30 seconds. Add sugar and mix on medium speed until light and fluffy, about 1 minute more. Add egg and vanilla extract and mix on high speed until fully incorporated, about 30 seconds. Using a flexible spatula, scrape down sides of the bowl. Add half of the dry ingredients to the butter-egg mixture, then start mixer on low speed and gradually increase to medium speed, until no dry flour remains, about 30 seconds. On low speed, add half of the milk and mix until fully incorporated, about 30 seconds. Scrape down the bowl as needed. Repeat with remaining flour and milk, mixing until pale and creamy with no visible pockets of flour, about 1 minute. Do not overmix. Set aside. (See notes for stand mixer instructions.)\nSerious Eats / Debbie Wee\nFor the Chocolate Sauce:\nIn a 2 cup heat-proof spouted measuring cup, whisk sugar and cocoa powder to combine. Add boiling water and vanilla extract and whisk until sugar and cocoa powder dissolve and no dry bits remain in the bottom of the cup, about 20 seconds. Sauce will be very fluid. (See notes.)\nSerious Eats / Debbie Wee\nSpoon batter into prepared pie crust in 3 to 4 large dollops. Do not spread. Using a butter knife, swirl batter. Briefly whisk chocolate syrup to recombine, then pour over batter, beginning around outer edge then onto the knife trails in the middle. Batter should peek through in a few spots.\nSerious Eats / Debbie Wee\nBake until the crust and cake are a deep golden brown, cake is risen with a few cracks, and a cake tester or sharp knife inserted in the center comes out clean, 55 to 60 minutes. Remove cake from oven and cool on wire rack until warm but not hot, 25 to 30 minutes. Slice and serve warm.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n8-inch aluminum pie plate, rolling pin, pastry brush, scissors, electric hand mixer or stand mixer, flexible spatula, 2 cup measuring cup, whisk\nNotes\nYou can also make this recipe using a frozen, unbaked pie shell.\nIn the bowl of a stand mixer fitted with the paddle attachment, whip butter on high speed until creamy, about 30 seconds. Add sugar and mix on medium speed until light and fluffy, about 1 minute more. Add egg and vanilla extract and mix on high speed until fully incorporated, about 30 seconds. Using a flexible spatula, scrape down sides of the bowl. Add half of the dry ingredients to the butter-egg mixture, then start mixer on low speed and gradually increase to medium speed, until no dry flour remains, about 30 seconds. On low speed, add half of the milk and mix until fully incorporated, about 30 seconds. Scrape down the bowl as needed. Repeat with remaining flour and milk, mixing until pale and creamy with no visible pockets of flour, about 1 minute. Do not overmix. Set aside. Proceed with step 2 of recipe.\nMake-Ahead and Storage\nFunny cake pie tastes best on the day it is made. Leftover cake can be wrapped in plastic and stored at room temperature for up to 1 day.\nThe lined pie crust can be tightly wrapped in plastic and refrigerated up to 24 hours in advance.\nI do not recommend freezing the pie or making the pie ahead of time. Though the pie will be perfectly edible, you’ll lose the chocolate syrup so essential to funny cake pie, as the syrup soaks into the cake as it cools.\nCakes\nThe Latest\nPies\nChocolate\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/funny-cake-pie.webp?"
}