{
  "url": "https://www.seriouseats.com/gado-gado-indonesian-salad-with-peanut-sauce-8646793",
  "image_url": "https://www.seriouseats.com/thmb/NpRz1vSPclSAk8s2pgkFVOA8mf8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240507-SEA-GadoGado-Melati-Citrawireja-hero-7b71a8951f1a414da941f57d53dac00d.jpg",
  "tags": [
    "Indonesian",
    "The Latest",
    "Southeast Asian",
    "Salads"
  ],
  "title": "Gado Gado",
  "full_text": "Gado Gado\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nTotal\n45 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Peanut Sauce (Sambal Kacang):\n1 heaping cup roasted, unsalted peanuts (about 5 ounces; 140g), or\n2/3\ncup\nnatural\ncrunchy peanut butter\n(6 ounces; 170g)\n2 small Asian\nshallots\n(1 ounce;\n28\ng\neach), chopped\n1 medium\nclove garlic\n(\n5\ng\n), crushed\n2\nmedium-hot, finger-length red\nchiles\nsuch as Fresno, cayenne, or serrano (2 ounces; 57g), stemmed, seeded, and chopped (see notes)\n5 bird’s eye chiles or Thai\nchiles\n(1 ounce;\n28\ng\n), stemmed\n3 tablespoons (\n36\ng\n) shaved\npalm sugar\n(preferably gula merah), coconut sugar, or dark brown sugar\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\ntoasted\nterasi\n(\nshrimp paste\n), optional\n2\nmakrut lime leaves\n(optional)\n1 tablespoon (\n20\ng\n)\n“wet”\ntamarind pulp\n, or 3 tablespoons store-bought tamarind concentrate\n2\nteaspoons\nlime juice\n, preferably from 1 key lime (optional)\nFor the Gado Gado:\n2\nYukon gold potatoes\n(10 1/2 ounces;\n300\ng\n), peeled and cut into 1/2-inch pieces\n4 cups shredded\ngreen cabbage\n(8 ounces;\n226\ng\n) from 1 medium head cabbage\n8 ounces (\n226\ng\n)\ngreen beans\n, trimmed and cut into 2-inch pieces (about 2 cups)\n4 ounces (\n113\ng\n)\nbean sprouts\n(about 1 1/2 cups)\n1 Persian\ncucumber\n(about 3 ounces;\n90\ng\n), halved lengthwise and then thinly sliced crosswise\n3\nlarge\nhard-boiled eggs\n, cut into quarters\n4 ounces (\n113\ng\n)\nhomemade\nor store-bought\nfried tofu\n, cut into 2-inch squares (see notes)\nShrimp chips\nor vegetable sticks, for serving (optional)\nFried shallots\n, for serving\nDirections\nFor the Peanut Sauce:\nIf using roasted peanuts, process in a high-speed blender or food processor until a paste with the texture of wet sand forms, 3 to 4 minutes. (It will be coarser than peanut butter; you will get about 1 cup). Transfer peanut paste to a small bowl and set aside.\nSerious Eats / Melati Citrawireja\nAdd shallots, garlic, red chiles, bird’s eye chiles, palm sugar, salt, and shrimp paste to the now empty food processor or blender and pulse until the mixture resembles cooked oatmeal, about 30 seconds to 1 minute, using a flexible spatula to scrape down the sides of the bowl as needed. Add 1 or 2 teaspoons of water if mixture is too thick and not turning in the food processor.\nSerious Eats / Melati Citrawireja\nIn a small saucepan, bring lime leaves, tamarind, and 1 cup (240ml) water to a gentle boil over medium heat. Simmer, using a spoon or spatula to break up the tamarind pulp as much as possible, to infuse the flavors, about 5 minutes. Remove the lime leaves and remaining tamarind solids.\nSerious Eats / Melati Citrawireja\nStir in ground peanuts and chile paste and continue to cook until the mixture starts bubbling, then reduce heat to medium-low and simmer, stirring often to prevent sauce from sticking to bottom of the pot, until thick and creamy, 4 to 6 minutes. If you prefer a looser sauce, add water, 1 tablespoon at a time, until you reach your desired consistency. Add lime juice, if using, and season to taste. Set aside.\nSerious Eats / Melati Citrawireja\nFor the Gado Gado:\nBring a medium saucepan of salted water to a rolling boil over high heat. Add potatoes, and cook until fork tender, 8 to 10 minutes. Using a colander, drain potatoes; set aside.\nSerious Eats / Melati Citrawireja\nBring a large saucepan of salted water to a rolling boil over high heat. Prepare an ice bath by filling a large mixing bowl with water and ice. Add Cabbage to boiling water and cook until translucent and just wilted, 1 to 2 minutes. Using tongs or a fine-mesh strainer, transfer to ice bath. When cool, remove cabbage from ice bath and transfer to a rimmed baking sheet lined with paper towels to dry. Set cabbage aside. Repeat with green beans, blanching until bright green and tender, 1 to 2 minutes; transfer to ice bath, then towels. Finally blanch bean sprouts until just wilted, 15 to 30 seconds; transfer to ice bath, then drain on towels.\nSerious Eats / Melati Citrawireja\nTo Assemble:\nArrange potatoes, cabbage, green beans, bean sprouts, cucumber, eggs, and tofu on a large platter, then serve: Diners should select an assortment of ingredients from the platter, transfer them to their individual plate,  drizzle with 2 to 3 tablespoons sauce, and garnish with shrimp chips and fried shallots.\nSerious Eats / Melati Citrawireja\nSpecial Equipment\nFood processor, blender, or mortar and pestle; medium saucepan; colander, tongs, or fine-mesh strainer\nNotes\nThe recipe can easily be scaled up if desired. To make this dish vegetarian, omit the terasi.\nFor peanut allergies, use cashews or almonds instead. Peanut butter is a convenient option, however, I encourage you to at least start with store-bought roasted peanuts. The texture and flavor do not compare.\n1 tablespoon (1/2 ounce; 15g) sambal oelek can be substituted for 2 red chiles.\nShrimp paste, makrut lime leaves, and kecap manis are often available at Asian grocery stores, especially those specializing in Southeast Asian ingredients. While shrimp paste, makrut lime leaves, and lime juice aren’t necessary, they make a sauce that’s more deeply flavored.\nLook for fried tofu in the refrigerated section at Asian markets. They can be labeled as deep-fried tofu, tofu puffs, or soy puffs (I like Nature’s Soy brand). Baked tofu also works well. I always buy my fried tofu from a specialty tofu shop called Thanh Son Tofu in Northern Virginia. Perhaps there’s a similar store near where you live.\nMake-Ahead and Storage\nThe peanut sauce can be refrigerated in an airtight container for up to 3 days. To reheat, warm peanut sauce in a saucepan set on medium-low heat. Add water, 1 tablespoon at a time, to loosen to desired consistency.\nIndonesian\nThe Latest\nSoutheast Asian\nSalads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gado-gado.webp?"
}