{
  "url": "https://www.seriouseats.com/gaeng-om-gai-isan-style-herbal-curry-5192883",
  "image_url": "https://www.seriouseats.com/thmb/gABI7RkXPzDJFQ_jAh9y_mSQ0hE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-isan-style-herbal-chicken-curry-GaengOmGai-vicky-wasik-seriouseats-16-602eee3290eb4eafac5dc6874ccec7f7.jpg",
  "tags": [
    "Thai",
    "Chicken Thighs",
    "Eggplant",
    "Quick Dinners",
    "Mains"
  ],
  "title": "Gaeng Om Gai (Isan-Style Herbal Curry with Chicken and Dill)",
  "full_text": "Gaeng Om Gai (Isan-Style Herbal Curry with Chicken and Dill)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Curry Paste:\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n2\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced (about 30g sliced lemongrass)\n3\nsmall\nshallots\n(60g), quartered\n3\nmedium\ngarlic cloves\n(15g)\n2\nfresh or frozen\nmakrut lime leaves\n, middle rib removed (see note)\n5\nfresh\nred Thai chiles\n(10g), stemmed\nFor the Curry:\n1 pound (\n450\ng\n)\nboneless skinless chicken thighs\n, cut into 1 1/2-inch pieces\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n1\ntablespoon\n(15ml)\nvegetable oil\n3\ncups\n(710ml) homemade chicken stock,\nlow-sodium store-bought chicken broth\n, or water\nOne\n4-inch piece\nfresh galangal\n, sliced crosswise into 1/8-inch-thick pieces (about 2 tablespoons; 30g)\n3\ntablespoons\n(45ml)\npla ra (Thai fermented fish sauce)\n(see note)\n1\ntablespoon\n(15ml)\nfish sauce\n3\nThai apple eggplants\n(about 3 ½ ounces;\n100\ng\ntotal), stemmed, quartered, and placed in a small bowl of water (see note)\n3 1/2\nounces\n(100g)\ngreen cabbage\n, cut into 3-inch pieces (about 2 cups)\n5 1/4\nounces\n(150g)\nyu choy\n, cut into 2-inch pieces (6 to 8 stalks)\n2\ntablespoons\n(15g)\nkhao khua\n(\nThai toasted-rice powder\n)\n10\nsprigs\nfresh dill\n(50g), woody bottom stems removed and discarded, tender stems and fronds cut into 2-inch pieces\n5\nfresh or frozen\nmakrut lime leaves\n, middle rib removed (see note)\n4\nscallions\n(60g), cut crosswise into 1 1/2-inch pieces\nCooked\nsticky\nor\njasmine\nrice\n, for serving\nDirections\nFor the Curry Paste:\nCombine salt and lemongrass in a granite mortar and pestle and pound until a coarse paste forms, about 2 minutes. Pounding thoroughly between each addition to break down and incorporate ingredients into a coarse paste (3 to 4 minutes of pounding per addition), add in the following order: shallots and garlic; Thai chiles and makrut lime leaves. It should take about 10 minutes total to pound ingredients into a coarse paste, with visible pieces of chile and makrut lime leaf.\nVicky Wasik\nFor the Curry:\nSeason chicken with salt; set aside.\nIn a 3-quart saucepan, heat oil over medium heat until shimmering. Add curry paste and, using a rubber spatula, stir vigorously to combine, scraping sides of the saucepan to fully incorporate paste. Cook, stirring constantly, until fragrant, 1 to 2 minutes. Add chicken, stir to coat with paste, and cook, stirring frequently, until chicken is pale white and opaque on all sides, about 2 minutes.\nVicky Wasik\nAdd chicken stock and galangal and bring to a rapid simmer. Cook, stirring occasionally, until chicken is cooked through and tender, about 10 minutes.\nVicky Wasik\nAdd eggplant, pla ra (if using), and fish sauce. Continue to cook, adjusting heat as needed to maintain a rapid simmer, until eggplant is just cooked through but still have some bite to them, about 3 minutes. Add cabbage and yu choy, stir to combine, and cook until vegetables are barely tender, about 3 minutes. Remove from heat, add khao kua, dill, makrut lime leaves, and scallions. Stir until incorporated and herbs are slightly wilted.\nVicky Wasik\nTransfer curry to a large serving bowl or divide between individual bowls. Serve immediately with cooked sticky rice or jasmine rice.\nVicky Wasik\nSpecial Equipment\nGranite mortar and pestle\n, 3-quart saucepan\nNotes\nPla ra is a fermented fish sauce made by fermenting freshwater fish with salt and rice bran or khao kua (toasted-rice powder). It can be found in Southeast Asian markets or online. If you cannot source pla ra, you can substitute with 3 tablespoons (45ml) fish sauce, bringing the total amount of fish sauce used in the recipe to 1/4 cup (60ml).\nThai apple eggplant, often labeled simply as “Thai eggplant,” can be found in Southeast Asian and Chinese markets, as well as online. While they differ greatly in flavor and texture, Japanese or globe eggplant can be used as a substitute in this recipe (use an equal amount by weight); cut eggplant into 2-inch pieces and proceed with the recipe as written. Once cut open, the flesh of Thai apple eggplants will quickly oxidize, so it’s a good idea to place them in water until you’re ready to add them to the curry.\nMakrut lime leaves can be found at Southeast Asian and South Asian markets. If you’re lucky you will find them fresh, but it is more common to find them frozen (note that they are often sold under a different name that we avoid using, as\nit is a derogatory term in some contexts\n).\nMake-Ahead and Storage\nThe curry paste can be made in advance and refrigerated in an airtight container, with plastic wrap pressed directly against the surface of the paste to prevent it from drying out, for up to 1 week. The finished curry is best enjoyed immediately, as the vegetables will lose their crispness over time.\nThai\nChicken Thighs\nEggplant\nQuick Dinners\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gaeng-om-gai-isan-style-herbal-curry-with-chicken-and-dill.webp?"
}