{
  "url": "https://www.seriouseats.com/gaeng-hunglae-northern-thai-pork-curry-recipe-8789186",
  "image_url": "https://www.seriouseats.com/thmb/4NzXC964kpUQ0HbQ8OD02on_s_I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250205-SEA-GaengHunglae-NorthernThaiPorkCurry-QiAi-Beauty1-64-184d3f660ea646c098c16ce4cb6d0268.jpg",
  "tags": [
    "The Latest",
    "Southeast Asian",
    "Thai",
    "Pork",
    "Winter"
  ],
  "title": "Gaeng Hunglae (Northern Thai Pork Curry)",
  "full_text": "Gaeng Hunglae (Northern Thai Pork Curry)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n4 hrs\nTotal\n4 hrs 15 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Curry Paste:\n10\ndried Thai red\nchiles\n, stemmed and seeded see notes)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(\n10\ng\n)\nfresh galangal\n, finely chopped, see notes\n2\nlemongrass\nstalks (about\n1\nounce\n;\n25\ng\n), thinly sliced cross-wise\n13\nmedium\nclove\ns\ngarlic\n(\n2 1/4\nounces\n;\n65\ng\n)\n1\nlarge\nshallot\n(about\n2\nounces\n;\n60\ng\n), thinly sliced cross-wise (\n1/2\ncup\n)\n1\ntablespoon\nkapi\nshrimp paste\n(see notes)\nFor the Curry:\n1\ntablespoon\n(\n15\nml\n) neutral\noil\n, such as vegetable or canola\n1\npound\n(\n454\ng\n) skin-on\npork belly\n, cut into 1-inch cubes\n1\npound\n(\n454\ng\n)\npork shoulder\n, cut into 1-inch cubes\n2\ntablespoons\nhunglae powder or\ngaram masala\n1\ntablespoon\nsweet soy sauce\n, such as kecap manis\n3\ntablespoons\npalm sugar\n1/4\ncup\nThai\ntamarind\npaste\n(\n2 1/2\nounces\n;\n70\ng\n)\n4\ncups\nwater\n(\n946\nml\n), plus more as needed\n1/2\ncup\npickled\ngarlic\ncloves (\n2 1/2\nounces\n;\n70\ng\n), lightly smashed, see notes\n10\nmedium\ncloves\ngarlic\n, peeled and lightly smashed (about\n1/4\ncup\n)\nOne 5-inch piece\nginger\n(about\n3\nounces\n;\n85\ng\n), peeled and julienned, divided, plus more for garnish\nTo Garnish:\n1/4\ncup\npeanuts\n(\n1 1/4\nounces\n;\n35\ng\n), roasted and unsalted, roughly chopped (optional)\nSteamed white rice\n, for serving\nDirections\nFor the Curry Paste:\nIn a small bowl, soak chiles in just enough hot water to cover; let sit until softened, about 5 minutes. Using a fine-mesh sieve, drain chiles.\nSerious Eats /Qi Ai\nIn a mortar and pestle, pound chiles with salt until a thick paste begins to form, 2 to 3 minutes. Add galangal and lemongrass and continue pounding until finely ground, about 5 minutes. Add garlic, shallots, and shrimp paste, and continue pounding until a smooth paste forms, about 5 more minutes.\nSerious Eats /Qi Ai\nFor the Curry:\nIn a 5-quart Dutch oven or heavy-bottomed pot, heat oil over medium heat until shimmering. Add curry paste and fry, stirring frequently, until fragrant and color deepens, 2 to 3 minutes. Add pork belly and pork shoulder, stirring to evenly coat with curry paste. Add hunglae powder, sweet soy sauce, palm sugar, and tamarind, stirring to combine. Add pickled garlic, fresh garlic, and half the ginger.\nSerious Eats /Qi Ai\nAdd enough water to fully submerge pork, about 5 cups. Bring to a boil over high heat, then reduce to a simmer. Simmer on low heat until curry is thick enough to coat a spoon and pork is very tender, using a wooden spoon to stir and scrape occasionally, about 4 hours. The pork should be just submerged throughout the cooking process; if curry gets too dry, add more water to cover. (If sauce remains thin after 4 hours, remove pork, set aside, and reduce sauce until thick enough to coat a spoon, 15 to 20 minutes. Return pork to sauce and cook until warmed through, and proceed with step 5 of recipe.)\nSerious Eats /Qi Ai\nRemove from heat, add remaining ginger, and season with additional salt, tamarind, and/or palm sugar as needed. Garnish with peanuts, if desired. Serve with\njasmine rice\nor\nsticky rice\n.\nSerious Eats /Qi Ai\nSpecial Equipment\nMortar and pestle\n, fine-mesh sieve, 5-quart Dutch oven\nNotes\nThawed frozen galangal can be used. In a pinch, 5 grams of dried galangal can also be substituted: Soak in hot water until softened, about 30 minutes, before using.\nKapi (กะปิ) shrimp paste, a dense condiment made by fermenting ground up shrimp or krill with salt, is a foundational ingredient in the Thai kitchen. It is reddish brown or sometimes purplish in color, and is usually sold in a jar or as a solid brick. It can be purchased online or at Southeast Asian grocery stores.\nTo make the hunglae gluten free, substitute 1 tablespoon tamari for the sweet soy sauce and increase the palm sugar to 3 1/2 tablespoons.\nMost Southeast Asian grocer stores will sell Thai pickled garlic, but any vinegar-pickled garlic can be substituted.\nPickled garlic (กระเทียมดอง - kratiem dong) gives this dish an alluring pop of sour-sweetness. You can find the Thai version—made with white or rice vinegar, sugar, and salt—at markets that stock Asian ingredients or online, but any version made with a sweetish brine can be substituted.\nIt is also quite easy to make at home. For about 3 cups of garlic cloves, I make a brine using 3 cups white vinegar or rice vinegar, 2 cups water, 1 cup sugar, and 2 tablespoons Diamond Crystal kosher salt (for table salt, use half as much by volume). Bring all the brine ingredients to a simmer, and pour, hot, over the garlic. Let sit for at least 48 hours in the refrigerator before using.\nIf pressed for time, you can use a food processor or a high-powered blender like a Vitamix to make the curry paste. The resulting paste, however, may not be as flavorful as one made in a mortar and pestle. The pounding and grinding motion breaks down the cells walls (instead of cutting through them with a blade), and produces a more aromatic and flavorful paste.\nMake-Ahead and Storage\nCurry paste can be made 1-2 days ahead of time and kept refrigerated in an airtight container.\nHunglae is ready to eat as soon as it’s done, but gets even better the next day. Refrigerate in an airtight container. When ready to eat, skim off congealed fat if desired, and reheat in microwave or on stovetop (add a little water if necessary to loosen the mixture). Leftover hunglae will keep in the refrigerator for 5 days.\nThe Latest\nSoutheast Asian\nThai\nPork\nWinter"
}