{
  "url": "https://www.seriouseats.com/gaeng-som-pla-gapohng-daeng-southern-thai-sour-curry-with-red-snapper-and-green-papaya-5194607",
  "image_url": "https://www.seriouseats.com/thmb/9jOe4V1dlKfhNf4bfC2dTyZWIIo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-southern-thai-sour-curry-snapper-GaengSomPlaGrapongDaeng-vicky-wasik-seriouseats-10-c71e98f5ed96469e888bbcb50b34686d.jpg",
  "tags": [
    "Thai",
    "Quick Dinners",
    "Curries",
    "The Latest",
    "Snapper"
  ],
  "title": "Gaeng Som Pla Gapohng Daeng (Southern Thai Red Snapper and Green Papaya Sour Curry)",
  "full_text": "Gaeng Som Pla Gapohng Daeng (Southern Thai Red Snapper and Green Papaya Sour Curry)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Curry Paste (see notes):\n4\ng\nkosher salt\n8\ng\nthai chiles\n15\ng\nthai chiles\n15\ng\nturmeric\n20\ng\ngarlic cloves\n80\ng\nshallots\n30\ng\nshrimp paste\nFor the Curry:\n240\ng\ntamarind\n18\ng\npalm sugar\n135\nml\nfish sauce\n6 1/2 ounces (about\n2\ncups\n; 185g)\ngreen papaya\n, peeled and cut into 2-inch by 1/2- inch-thick pieces, from 1 green papaya (see note)\n340\ng\nred snapper\n1\ntablespoon\n(15ml) fresh\nlime juice\nfrom 1 lime\n1\ncup\njasmine rice\nDirections\nFor the Curry Paste: If Using a Mortar and Pestle:\nCombine salt and dried chiles in a granite mortar and pestle and pound until chiles are broken down into small pieces, about 2 minutes. Pounding thoroughly between each addition to break down and incorporate ingredients into the paste (3 to 4 minutes of pounding per addition), add in the following order: fresh chiles; turmeric; garlic and shallots; shrimp paste. It should take about 15 minutes total to pound ingredients into a very fine paste with just a few visible pieces of fresh chile skin.\nIf Using a Blender:\nCombine salt, dried and fresh chiles, turmeric, garlic, shallots, and shrimp paste in a blender jar with 1 cup (240ml) water. Blend on high speed until smooth, 2 to 3 minutes.\nVicky Wasik\nFor the Curry, If Using Pounded Paste:\nIn a 3-quart saucepan, whisk together curry paste and 1 cup (240ml) water until well combined. Once thoroughly incorporated, add 3 cups (710ml) water, tamarind, palm sugar, and fish sauce, and stir to combine.\nIf Using Blended Paste:\nIn a 3-quart saucepan, combine curry paste, 3 cups (710ml) water, tamarind, palm sugar, and fish sauce and stir to combine.\nVicky Wasik\nBring to a boil over medium-high heat, add papaya and cook, stirring occasionally, until papaya is just beginning to soften but is still crunchy, 5 to 7 minutes. You may notice foam rising to the surface; this is normal, and should not be skimmed.\nVicky Wasik\nAdd snapper and, using a spoon, gently submerge pieces in the curry. Continue to cook, gently stirring occasionally, until fish is opaque and just cooked through, 2 to 3 minutes. Remove from heat, and stir in lime juice.\nVicky Wasik\nTransfer curry to a large serving bowl or divide between individual bowls. Serve immediately with cooked jasmine rice.\nVicky Wasik\nSpecial Equipment\nGranite mortar and pestle\n, 3-quart saucepan\nNotes\nPalm sugar can be found in Thai markets, as well as some nationwide supermarket chains like HMart, and also online.\nGreen papaya is an unripe papaya that has pale white/green flesh. It is crisp and isn't sweet like a ripe orange papaya. Green papaya can be found in Southeast Asian markets.\nStore-bought curry paste can be substituted for this recipe. Use one 4-ounce can of gaeng leung curry paste, which is often labeled as yellow sour curry paste.\nMake-Ahead and Storage\nThe curry paste can be made in advance and refrigerated in an airtight container, with plastic wrap pressed directly against the surface of the paste to prevent it from drying out, for up to 1 week. The finished curry is best enjoyed immediately.\nThai\nQuick Dinners\nCurries\nThe Latest\nSnapper",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gaeng-som-pla-gapohng-daeng-southern-thai-red-snapper-and-green-papaya-sour-curry.webp?"
}