{
  "url": "https://www.seriouseats.com/gaeng-garee-makheua-yao-yellow-curry-with-eggplant-5190990",
  "image_url": "https://www.seriouseats.com/thmb/lloHCyRZ8gWxqqhxAnUJ2Y1SmP8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-thai-yellow-curry-eggplant-shallots-GaengGariMakheuaYao-vicky-wasik-seriouseats-12-4195314938e44d40a621228a01073786.jpg",
  "tags": [
    "Thai",
    "Eggplant",
    "Quick Dinners",
    "Vegetable Mains",
    "Potatoes"
  ],
  "title": "Gaeng Garee Makheua Yao (Thai Yellow Curry with Eggplant)",
  "full_text": "Gaeng Garee Makheua Yao (Thai Yellow Curry with Eggplant)\nJump to recipe\nCook\n40 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(\n325\ng\n)\nYukon Gold potatoes\n(\n2\nmedium\npotatoes\n), cut into 2 1/2-inch pieces\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n1 1/2\ncups\n(\n355\nml\n)\nfull-fat coconut milk\n, such as Aroy-D, divided (see note)\n4\nounces\n(\n1/2\ncup\n;\n115\ng\n)\nhomemade\nor store-bought\nyellow (garee/karee) curry paste\n1\ntablespoon\nplus\n1 1/2\nteaspoons\n(\n40\ng\n)\npalm sugar\n(see note)\n3\ntablespoons\n(\n45\nml\n)\nsoy sauce\n2\nJapanese eggplants\n(about\n9\nounces\n;\n255\ng\ntotal), stemmed and cut crosswise on a bias into 1 1/2-inch pieces\n3 1/2\nounces\n(\n1/2\ncup\n;\n100\ng\n)\ncherry tomatoes\nFried shallots\n, for serving\nCooked jasmine rice\n, for serving\nDirections\nIn a 3-quart saucepan, combine potatoes and salt and cover by 2 inches with water. Bring to a boil over medium-high heat, reduce heat to a simmer, and cook until potatoes are just tender, offering little resistance when poked with a paring knife, about 10 minutes. Drain potatoes and set aside; return saucepan to stovetop.\nWhile potatoes cook, in a small bowl, whisk together 1/2 cup (120ml) coconut milk and 1/2 cup (120ml) water; set thinned coconut milk mixture aside.\nVicky Wasik\nIn now-empty saucepan, bring 1/2 cup (120ml) coconut milk to a boil over medium heat, and cook until slightly thickened, about 2 minutes. Add curry paste and stir vigorously with a rubber spatula to combine, scraping sides of saucepan to fully incorporate paste. Raise heat to medium-high and cook, stirring and scraping constantly until paste mixture begins to spit (which indicates that water content has been cooked off and mixture has begun to fry in coconut oil), about 1 minute. Lower heat back to medium and continue to cook while gradually adding remaining 1/2 cup (120ml) coconut milk in 2-tablespoon (30ml) increments, until paste turns dark red and fat begins to separate from curry paste, 8 to 10 minutes.\nVicky Wasik\nAdd palm sugar, soy sauce, and reserved thinned coconut milk mixture, and stir until palm sugar is fully dissolved. Bring to a simmer, add potatoes, eggplant, and cherry tomatoes, and cook, stirring occasionally, until eggplant is tender, 5 to 7 minutes. Remove from heat.\nVicky Wasik\nTransfer curry to a large serving bowl or divide between individual bowls and top with fried shallots. Serve immediately with cooked jasmine rice.\nVicky Wasik\nSpecial Equipment\n3-quart saucepan\nNotes\nWhen purchasing coconut milk, look for versions like\nthis one from Aroy-D\nthat have \"100% coconut milk\" as the only listed ingredient, rather than those made with coconut extract and water.\nPalm sugar can be found in Thai markets, as well as some nationwide supermarket chains like HMart, and also\nonline\n.\nMake-Ahead and Storage\nThe finished curry can be refrigerated in an airtight container for up to 3 days. Reheat gently on stovetop before serving.\nThai\nEggplant\nQuick Dinners\nVegetable Mains\nPotatoes"
}