{
  "url": "https://www.seriouseats.com/gaeng-khiao-waan-gai-thai-green-curry-with-chicken-recipe-5189726",
  "image_url": "https://www.seriouseats.com/thmb/Nzq9Msk7q4jcy64Ayycw6lXgu58=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-thai-green-curry-chicken-GaengKeowWanGai-vicky-wasik-seriouseats-25-de0c1741b5514e79a73db7d27acf7ffa.jpg",
  "tags": [
    "Thai",
    "Chicken Thighs",
    "Chicken Mains",
    "Quick Dinners",
    "Mains"
  ],
  "title": "Gaeng Khiao Waan Gai (Thai Green Curry with Chicken)",
  "full_text": "Gaeng Khiao Waan Gai (Thai Green Curry with Chicken)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\n(\n355\nml\n)\nfull-fat coconut milk\n, such as Aroy-D, divided (see notes)\n10\nfresh or frozen\nmakrut lime leaves\n, divided\n2\ntablespoons\n(\n30\nml\n)\nvirgin coconut oil\n4 ounces (1/2 cup;\n115\ng\n)\nhomemade\nor store-bought\ngreen curry paste\n1 tablespoon plus 2 teaspoons (\n35\ng\n)\npalm sugar\n3\ntablespoons\n(\n45\nml\n)\nfish sauce\n1 pound (\n450\ng\n)\nboneless skinless chicken thighs\n, cut into 2-inch pieces\nKosher salt\n5\nThai eggplants\n(about 5 1/4 ounces;\n150\ng\ntotal), stemmed, quartered, and placed in a small bowl of water (see notes)\n1 packed cup (about 1 ounce;\n30\ng\n) fresh sweet basil leaves (a.k.a.\nThai basil\n)\nCooked\njasmine rice\n, for serving\nDirections\nIn a small bowl, whisk together 1/2 cup (120ml) coconut milk and 1/2 cup (120ml) water; set thinned coconut milk mixture aside. Remove and discard the mid-rib from the makrut lime leaves; set 8 of the leaves aside. Stack remaining 2 makrut lime leaves, fold in half widthwise, then slice into hair-thin strips; set aside separately.\nVicky Wasik\nIn a 3-quart saucepan, combine coconut oil with 1/2 cup (120ml) coconut milk and bring to a simmer over medium heat. Cook, stirring often with a rubber spatula, until thickened slightly, about 1 minute.\nVicky Wasik\nAdd curry paste, stir vigorously to combine, and use a rubber spatula to scrape sides of the saucepan to fully incorporate paste. Raise heat to medium-high and cook, stirring and scraping constantly until paste mixture begins to spit (which indicates that water content has been cooked off, and mixture has begun to fry in coconut oil), about 1 minute. Lower heat back to medium, and continue to cook while gradually adding remaining 1/2 cup (120ml) coconut milk in 2-tablespoon (30ml) increments, until paste darkens slightly and the fat begins to separate from curry paste, 5 to 6 minutes.\nVicky Wasik\nAdd fish sauce and palm sugar, and stir until palm sugar is fully dissolved, about 30 seconds. Lightly season chicken on all sides with salt, add to saucepan with reserved whole makrut lime leaves, and stir to evenly coat with curry paste mixture. Add reserved thinned coconut milk mixture and bring to a simmer. Cook, stirring occasionally, until chicken is cooked through and tender and liquid has thickened slightly, about 10 minutes.\nVicky Wasik\nAdd eggplants, and continue to cook, adjusting heat as needed to maintain a simmer, until eggplants are just cooked through but still have some bite to them, about 3 minutes. Remove from heat, add sweet basil, and stir until wilted and incorporated.\nVicky Wasik\nTransfer curry to a large serving bowl or divide between individual bowls, and garnish with reserved thinly-sliced makrut lime leaves. Serve with cooked jasmine rice.\nVicky Wasik\nSpecial Equipment\n3-quart saucepan\nNotes\nThai apple eggplants, often labeled simply as “Thai eggplant,” can be found in Southeast Asian and Chinese markets, as well as online. While they differ greatly in flavor and texture, Japanese or globe eggplant can be substituted for this recipe (use an equal amount by weight); cut eggplants into 2-inch pieces and proceed with the recipe as written. Once cut open, the flesh of Thai apple eggplants will quickly oxidize, so once you’ve quartered them, it’s a good idea to place them in water until you’re ready to add them to the curry.\nWhen purchasing coconut milk, look for versions like this one from Aroy-D that have \"100% coconut milk\" as the only listed ingredient, rather than those made with coconut extract and water.\nMakrut lime leaves can be found at Southeast Asian and South Asian markets. If you’re lucky you will find them fresh, but it is more common to find them frozen (note that they are often sold under a different name that we avoid using, as\nit is a derogatory term in some contexts\n).\nPalm sugar can be found in Thai markets, as well as some nationwide supermarket chains like HMart, and also\nonline\n.\nMake-Ahead and Storage\nThe finished curry can be refrigerated in an airtight container for up to 3 days. Reheat gently on stovetop before serving. If you plan on making the curry a day in advance, hold off on adding the sweet basil leaves in Step 5; stir them in at the last minute when reheating the curry before serving.\nThai\nChicken Thighs\nChicken Mains\nQuick Dinners\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gaeng-khiao-waan-gai-thai-green-curry-with-chicken.webp?"
}