{
  "url": "https://www.seriouseats.com/gai-pad-king-thai-chicken-ginger-stir-fry",
  "image_url": "https://www.seriouseats.com/thmb/g-s_85L-4i_nQwa34S9--5FAo2Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__09__20200922-Gai-Pad-Khing-Thai-Chicken-Ginger-Stir-Fry-derek-lucci-7d53972a924b4c4ba4523cfb0e7f06b8.jpg",
  "tags": [
    "Chicken Stir-Fry",
    "Thai",
    "Chicken Thighs",
    "Ginger",
    "Chicken Mains"
  ],
  "title": "Gai Pad King (Thai Chicken and Ginger Stir-Fry) Recipe",
  "full_text": "Gai Pad King (Thai Chicken and Ginger Stir-Fry) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n40 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Prik Nam Pla: (optional, see notes)\n1/4\ncup\n(60ml)\nfish sauce\n1\nteaspoon\n(5ml)\nfresh lime juice from 1 lime\n3 to 5\nfresh Thai chiles\n(3 to 5g total), stemmed and thinly sliced into rounds\n1 small\nshallot\n(\n15\ng\n), thinly sliced\n1\nsmall\ngarlic clove\n(3g), thinly sliced\nFor the Stir-Fry Sauce:\n2\nteaspoons\n(10ml) Golden Mountain seasoning sauce or\nlight soy sauce\n1 1/2\nteaspoons\n(8ml)\noyster sauce\n, preferably Thai\n1\nteaspoon\n(5ml)\nThai black soy sauce\nor Chinese dark soy sauce\n1\nteaspoon\n(5ml)\nThai fermented soybean paste\n1\nteaspoon\n(5ml)\nfish sauce\nPinch\nof\ngranulated sugar\nFor the Stir-Fry:\nOne 3-inch piece (\n35\ng\n)\nfresh ginger\n,\npeeled and cut into julienne\n, divided\n2\ncilantro roots\n(\n8\ng\n), cleaned and sliced (see notes)\n1/4\nteaspoon\nwhite peppercorns\n7 small\ngarlic cloves\n(\n20\ng\n), sliced\n2\ntablespoons\n(30ml)\nvegetable oil\n1/2 pound (\n225\ng\n)\nboneless skinless chicken thighs\n, cut into 1-inch by 1/2-inch pieces\n1/4 cup (1/4 ounce;\n8\ng\n)\ndried wood ear mushrooms\n, rehydrated and torn into 1-inch pieces (see notes)\n2\nfresh long\nchiles\n, such as\ncayenne\n, stemmed, seeded, and quartered lengthwise (see notes)\n2\nscallions, green\nparts only, cut into 1-inch pieces (about\n10\ng\ntotal)\nCooked jasmine rice\n, for serving\nDirections\nFor the Prik Nam Pla (if using):\nIn a small bowl, combine fish sauce, lime juice, Thai chiles, shallot, and garlic (if using). Set aside.\nFor the Stir-Fry Sauce:\nIn a small bowl, stir together Golden Mountain seasoning sauce, oyster sauce, black soy sauce, fermented yellow bean paste, fish sauce, and sugar until well-combined. Set aside.\nFor the Stir-Fry:\nAdd 1 1/2 teaspoons of sliced ginger (1/5 of total amount; 5g), cilantro roots (or stems), and white peppercorns to a granite mortar and pestle and pound into a fine paste, 3 to 5 minutes. Add garlic, and continue to pound until rough paste forms, about 1 minute.\nIn a wok or large skillet, heat oil over high heat until shimmering. Add the ginger-garlic paste and cook, stirring constantly, until fragrant, about 30 seconds. Add the chicken and remaining sliced ginger (30g), and cook, stirring frequently, until chicken is just cooked through, about 1 minute and 30 seconds.\nAdd stir-fry sauce and wood ear mushrooms and continue to cook, stirring frequently, until sauce is reduced to a glaze that evenly coats ingredients, about 1 minute. Add long chiles and 1 teaspoon (5ml) water around sides of wok and use a wok spatula or wooden spoon to scrape up any browned bits stuck to wok.\nFor Serving:\nRemove from heat and stir in scallions to lightly wilt them. Serve immediately with cooked jasmine rice, passing prik nam pla at the table.\nSpecial Equipment\nMortar and pestle\n,\nwok\n, or large carbon steel or stainless steel skillet\nNotes\nPrik nam pla literally translates to \"chiles in fish sauce.\" It is a condiment often present at the table, and it's used for seasoning and adding chile heat to various dishes, especially stir-fries, eggs, and rice. Prik nam pla is not meant to be a “balanced” sauce—it is intentionally very salty and spicy, with just a hint of fresh acidity from lime juice. It is strongly recommended for serving with this dish, but it is optional.\nThe roots of fresh coriander (a.k.a. cilantro) provide a slight herbal note to dishes but are unfortunately hard to find in the US, as they are often cut off from the stems before going to market (though local farmers markets in the summer and fall often have coriander with the roots still attached). Coriander roots can also be found in Southeast Asian markets. If you can't find the herb with the roots still attached, you can either substitute with an equal amount by weight of tender stems or omit it altogether. And, to clarify, although they are called coriander \"roots,\" Thai cooks usually also use some of the tender green stem.\nTo rehydrate wood ear mushrooms, place them in a heatproof bowl, cover with boiling water, and set aside to steep for 15 minutes.\nThe chiles in the stir-fry are meant to have some heat but should be much milder than small Thai chiles. You are looking for a crisp, fresh chile aroma, not sharp spiciness. In Thailand, the red chiles used for this dish are called prik chee faa, and yellow-orange chiles are named prik leung. Fresh cayenne peppers are a comparable substitute and can be found at Southeast Asian markets, some grocery stores, and farmers markets in the late summer and fall.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately. The prik nam pla can be made up to 1 day in advance and refrigerated in an airtight container; bring to room temperature before serving.\nChicken Stir-Fry\nThai\nChicken Thighs\nGinger\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gai-pad-king-thai-chicken-and-ginger-stir-fry-recipe.webp?"
}