{
  "url": "https://www.seriouseats.com/gajarachi-koshimbir-carrot-salad-recipe-8658115",
  "image_url": "https://www.seriouseats.com/thmb/UGRlZFn7_of10OIT0OqHxWmnAj8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240529-SEA-KanikaandJatinSharma-GajarachiKoshimbirCarrotSalad-27-9f0b1af88f3d423ea078e94caeb9aaf9.jpg",
  "tags": [
    "Salads",
    "The Latest",
    "Indian",
    "Carrots",
    "Coleslaw"
  ],
  "title": "Gajarachi Koshimbir (Carrot Salad with Mustard Seeds and Curry Leaves)",
  "full_text": "Gajarachi Koshimbir (Carrot Salad with Mustard Seeds and Curry Leaves)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nMacerating Time\n30 mins\nTotal\n45 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salad:\n10\nounces\nstore-bought shredded carrots\nor\nfreshly grated carrots\n(see note)\n1/2\nmedium\nwhite onion\n(\n4\nounces\n;\n113\ng\n), minced (see note)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt use half as much by volume\n1\ntablespoon\ngranulated sugar\n2\ntablespoons\n(\n30\nml\n)\nlime\nor\nlemon juice\n(or more to taste)\n1\nteaspoon\nground cumin\n1\ntablespoon minced\nfresh cilantro\nFor the Hot Oil Seasoning:\n1 1/2\ntablespoons\nneutral oil\nsuch as\nvegetable oil\n,\ngrapeseed\nor\nsunflower oil\n2\nteaspoons\nblack mustard seeds\n1/2\nteaspoon\nground turmeric\n1/8\nteaspoon\nasafoetida\n, optional (see note)\n1 to 2\ngreen bird’s eye chiles\n, sliced thin\n1\nbranch\nfresh curry leaves\n(\n6-8\ncurry leaves\n) (see notes)\nFor Serving:\n2\ntablespoons minced\nfresh cilantro\n2\ntablespoons\npeanuts\n, coarsely ground or chopped\n2\ntablespoons\ngrated coconut\nDirections\nFor the Salad:\nPlace shredded carrots and onions in a glass, ceramic, or non-reactice metal mixing bowl. Toss with sugar, salt, and lime juice. Macerate at room temperature for at least 30 minutes or up to 1 hour, stirring occasionally to redistribute the lime juice.\nSerious Eats / Kanika and Jatin Sharma\nStir cumin and cilantro into the carrots. Season with salt to taste.\nSerious Eats / Kanika and Jatin Sharma\nFor the Hot Oil Seasoning:\nin a small saucepan or seasoning wok, heat the oil over medium-high heat until just smoking, about 1 minute. Keep a lid/screen handy.\nSerious Eats / Kanika and Jatin Sharma\nReduce heat to low and test the oil with one mustard seed. If it pops right away, the oil is ready; if not, return heat to medium-high for 1 additional minute and retest. When ready, quickly add the remaining mustard seeds to the saucepan and cover with the lid/screen. The mustard seeds will pop, making a sound like popping corn, about 30 seconds. Once the popping stops, uncover the pan and add the turmeric, stir briefly, then add the asafoetida. Turn the heat up to medium-low and add the chiles. Stir well.\nSerious Eats / Kanika and Jatin Sharma\nAdd the curry leaves and cook until sizzling, about 30 seconds. Turn off the heat and stir. Do not let the curry leaves brown.\nSerious Eats / Kanika and Jatin Sharma\nPour the spiced oil over the macerated carrot mixture immediately. Then put some of the carrots into the pan and, using tongs or a spoon, push them around to wipe up any leftover oil and lingering spices and spoon them back into the salad. Season to taste with salt and more lime/lemon juice if needed. Stir well to combine.\nSerious Eats / Kanika and Jatin Sharma\nFor Serving:\nTransfer to a serving platter. Sprinkle with cilantro, coconut, and peanuts. Serve.\nSerious Eats / Kanika and Jatin Sharma\nSpecial Equipment\nA\nsmall saucepan\nor seasoning wok\nNotes\nUse a ceramic, glass, or nonreactive metal bowl to make the salad. Avoid using a plastic bowl that might get discolored from the turmeric in the oil.\nThis recipe can be easily doubled.\nI prefer to use store bought shredded carrots, my favorite brand is Trader Joe’s. You can also buy whole carrots and grate them yourself on a box grater.\nUse white onions when making Indian food as they are the closest approximation to Indian onions that I have found. Red onions are too sharp for this salad and, in my opinion, yellow onions simply do not work with the spices in Indian food.\nAsafoetida can be found at most Indian grocers. It’s also available to purchase online; Burlap and Barrel and Amazon are two sources. I recommend the powder sold in small jars, rather than large plastic containers, because they hold the aroma. You will smell an onion-garlic aroma from the asafoetida when you open the container. Keep it tightly shut between uses, otherwise the smell will pervade your entire kitchen. While it adds a distinct assertive garlic and onion–like flavor to the chutney, you can omit it if unavailable, but the chutney will be less aromatic.\nUse fresh curry leaves, not dried. The dried ones do not have the intense flavor of the fresh. They are usually available at Indian stores.\nMake-Ahead and Storage\nThis salad can be held at room temperature for up to 4 hours or refrigerated in an airtight container for up to 24 hours.\nSalads\nThe Latest\nIndian\nCarrots\nColeslaw",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gajarachi-koshimbir-carrot-salad-with-mustard-seeds-and-curry-leaves.webp?"
}