{
  "url": "https://www.seriouseats.com/galette-des-rois-recipe-8766167",
  "image_url": "https://www.seriouseats.com/thmb/yZ-UmV0xoUNy9sQ9MzJ6GOVR5Gw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241223-SEA-GalettedesRoi-AmandaSuarez-Hero3-40-adaa053e7e6c4a10a231781721647c0a.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "French",
    "Baking",
    "Almonds"
  ],
  "title": "Making a Classic French Galette des Rois Is Easier Than You Think",
  "full_text": "Making a Classic French Galette des Rois Is Easier Than You Think\nClose\nJump to recipe\nPrep\n30 mins\nCook\n55 mins\nChilling, Cooling, and Freezing Time\n3 hrs\nTotal\n4 hrs 25 mins\nServes\n6\nto 8\nMakes\n1 10-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\n113g blanched\nalmond flour\n(4 ounces;\n1\ncup\n), see note\nTwo 14-ounce packages frozen\npuff pastry\n(396g each), thawed\n85\ng\nunsalted butter\n, room temperature (3 ounces; 6 tablespoons)\n100g\ngranulated sugar\n(about\n3 1/2\nounces\n; 1/2 cup)\n1/2\nteaspoon\norange zest\nfrom 1 medium orange, optional\n16g\nall-purpose flour\n(1/2 ounce;\n2\ntablespoons\n)\n1\nlarge\negg\n, room temperature\n1\ntablespoon\n(15ml)\nbrandy\nor rum, optional\n1 1/2\nteaspoons\nalmond extract\n1 1/2\nteaspoons\nvanilla extract\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nlarge\negg yolk\n, for brushing\nDirections\nAdjust oven rack to middle position and preheat to 350ºF (175ºF). Line 2 rimmed baking sheets with parchment. Add almond flour to 1 parchment-lined rimmed baking sheet and spread into a thin, even layer. Toast, stirring every 3 minutes, until almond flour is fragrant and light golden brown, about 10 minutes. Remove from oven and let cool to room temperature, about 20 minutes.\nSerious Eats / Amanda Suarez\nMeanwhile: On a lightly floured work surface, roll 1 sheet of thawed puff pastry to 1/8-inch thickness. Set a 10-inch wide plate or bowl on top of pastry and, using a sharp knife, cut around the edge of the plate or bowl to trim dough into a neat circle; discard scraps or reserve for another use. Place puff pastry round on prepared baking sheet, loosely cover with plastic, and refrigerate while you cut the second sheet. Repeat with remaining sheet of thawed puff pastry. When second sheet of puff pastry has been rolled and cut into a 10-inch circle, set another piece of parchment on top of first puff pastry circle to keep the puff pastry separate. Place second puff pastry circle on top of parchment, loosely cover with plastic, and refrigerate for at least 30 minutes and up to 8 hours.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter, sugar, and orange zest, if using, on low speed to combine. Increase to medium-high speed and beat until smooth and creamy, about 3 minutes, pausing to scrape down bowl and beater with a flexible spatula as needed. Add almond flour, all-purpose flour, egg, brandy, almond extract, vanilla extract, and salt. Mix on medium-high speed until smooth, thick, and creamy, pausing to scrape down bowl and beater halfway through, about 2 minutes. Using a flexible spatula, scrape bowl and beater to ensure that no streaks of unmixed butter remain. (Alternatively, almond cream can be prepared in a large bowl using an electric hand mixer.)\nSerious Eats / Amanda Suarez\nRemove puff pastry from refrigerator, and, lifting parchment with both hands, remove top layer of puff pastry and set aside so there is only 1 dough circle remaining. Using an offset spatula, spread almond filling evenly across the pastry circle on the baking sheet, leaving a 1-inch border around the sides. To surprise your guests, place an almond or hazelnut somewhere in the filling, if desired.\nSerious Eats / Amanda Suarez\nUsing a pastry brush, brush water around the exposed edges of the dough circle with the almond filling. Top with second dough circle and press edges of the pastry with fingertips to seal. If desired, use a paring knife to gently push edges in to create a fluted edge (see notes). Using the tip of the paring knife or tines of a fork, gently scrape a decorative pattern across the top surface of the galette. Freeze until cold and firm to the touch, about 30 minutes and up to 24 hours.\nSerious Eats / Amanda Suarez\nPreheat oven to 425ºF (220ºC). Brush pastry all over with egg yolk. Bake for 10 minutes, then reduce oven temperature to 350ºF (175ºC). Continue baking until pastry is puffed and deep golden brown, about 35 minutes more. Carefully lift parchment and transfer galette to a wire rack to cool completely, about 1 hour. Slice and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheet, parchment, rolling pin, plastic wrap, stand mixer or hand mixer, offset spatula, pastry brush\nNotes\nEither blanched or natural almond flour will work well in this recipe. Blanching removes the almonds’ skins, resulting in a beige nut flour. Natural almond flour is made with skin-on almonds; it is speckled, with a slightly coarser texture. Either can be used here; it ultimately comes down to personal preference.\nSome bakers, including me, like to give their galette des rois a scalloped edge, but it isn’t necessary and you can opt to make a galette with regular edges if desired.\nMake-Ahead and Storage\nThe galette is best enjoyed fresh, but once cooled, it can be stored in an airtight container at room temperature for up to 3 days.\nDesserts\nThe Latest\nFrench\nBaking\nAlmonds"
}