{
  "url": "https://www.seriouseats.com/galinhada-mineira-brazilian-chicken-and-rice-from-minas-gerais-recipe-7229603",
  "image_url": "https://www.seriouseats.com/thmb/9d9wtbwCX833Gx6Vgc9bYIZuoTA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230310-SEA-Galinhada-Mineira-AmandaSuarez-hero-46f95e560435475e8ccdaf5a3001ed46.JPG",
  "tags": [
    "The Latest",
    "White Rice",
    "Chicken",
    "Stovetop Chicken",
    "Rice & Grain Mains"
  ],
  "title": "Galinhada Mineira (Brazilian Chicken and Rice From Minas Gerais)",
  "full_text": "Galinhada Mineira (Brazilian Chicken and Rice From Minas Gerais)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nTotal\n55 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(473ml)\nhomemade chicken stock\nor low-sodium broth or water\n2\nteaspoons\n(6g) Diamond Crystal\nkosher salt\n(for table salt, use half as much by volume or the same weight), plus more as needed\n2 1/2\npounds\n(1.1kg)\nchicken pieces\n, such as drumsticks and/or thighs (see notes)\nFreshly\nground black pepper\n1/4\ncup\n(60ml) canola or other\nneutral oil\n1/2\nteaspoon\nturmeric\n(optional)\n2\nteaspoons\nannatto powder\n1\nteaspoon\nsweet\npaprika\n5\nmedium\ncloves garlic\n, very finely minced or pureed\n1\nlarge\ncarrot\n(about 9 ounces; 255g), diced\n1\nmedium\nyellow onion\n(about 8 ounces; 227g), diced\n2\ncups\nparboiled rice\n(11 ounces; 310g), washed with cold water and drained well\n5\nounces\nfrozen peas\n(half of one 10-ounce/284g bag), optional\n5\nounces\nfrozen corn\n(half of one 10-ounce/284g bag), optional\n1/2\ncup\nthinly sliced scallion greens\n, dark and light green parts only (from about 6 scallions)\nDirections\nIn a large measuring cup, combine stock and the 2 teaspoons salt and stir until salt is dissolved. Set aside.\nSeason chicken all over with salt and pepper. In a 5- or 6-quart Dutch oven, heat oil over medium-high heat until shimmering. Add chicken and cook, turning occasionally, until very well browned, about 10 minutes. Lower heat, stir in turmeric (if using), annatto, and paprika, followed by garlic, carrot, and onion. Season with salt, then cook, stirring and scraping any browned bits from bottom of pot, until softened, about 5 minutes.\nSerious Eats / Amanda Suarez\nStir in rice and cook until thoroughly coated in oil and seasoning and heated through, about 2 minutes. Add stock along with frozen peas and corn (if using), scraping down sides of pot to ensure all rice grains are submerged. Bring to a boil, then cover, reduce heat to low, and cook until liquid is absorbed and rice is just tender, about 25 minutes (or following cooking time on rice package directions).\nSerious Eats / Amanda Suarez\nRemove from heat, stir in scallions, then let stand, covered, 10 minutes. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n5- or 6-quart Dutch oven\nNotes\nTraditionally, this dish would be made with a whole free-range country chicken (a \"galinha caipira\" in Brazilian Portuguese), though dark meat like thighs and drumsticks remains more tender in a dish like this than white meat. We like using thighs and drumsticks, but feel free to use a small whole chicken or other chicken parts like bone-in breast, if that's your preference. If you're able, we recommend splitting the chicken parts in half through the bone to make smaller pieces (you can do this with a cleaver, some high-quality kitchen shears with a bone notch, or by asking the butcher), but the recipe works just fine with the chicken pieces left intact.\nMake-Ahead and Storage\nLeftover galinhada can be refrigerated in an airtight container for up to 5 days. Reheat in the microwave.\nThe Latest\nWhite Rice\nChicken\nStovetop Chicken\nRice & Grain Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/galinhada-mineira-brazilian-chicken-and-rice-from-minas-gerais.webp?"
}