{
  "url": "https://www.seriouseats.com/gallopinto-nicaraguan-rice-and-beans-recipe",
  "image_url": "https://www.seriouseats.com/thmb/gzww9hKFq0-D1oaZRQcb7wj8tec=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-gallopinto-nicaraguan-rice-and-beans-recipe-hero-01_1-cd02f69002f44947ab42f29e6134aa03.JPG",
  "tags": [
    "Central American",
    "Black Beans",
    "Rice & Grain Sides"
  ],
  "title": "Gallopinto (Nicaraguan Rice and Beans)",
  "full_text": "Gallopinto (Nicaraguan Rice and Beans)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n2 hrs 30 mins\nActive\n45 mins\nChilling Time\n24 hrs\nTotal\n27 hrs 5 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Rice:\n1/4\ncup\n(60ml)\nvegetable oil\n, divided\n1\nmedium\nyellow onion\n, finely chopped (about 1 cup; 200g), divided\n1 1/2\ncups\n(10 ounces; 300g)\nlong-grain white rice\n3\ncups\n(710ml) water or\nhomemade\nor store-bought chicken stock\n1 1/2 teaspoons (\n5\ng\n) Diamond Crystal kosher\nsalt\n; for table salt, use half as much by volume or the same weight\n1/2\ngreen bell\npepper\n(3 ounces; 85g), cored and seeded\nFor the Beans:\n1/2\npound\n(225g)\ndried\nsmall red or\nblack beans (see note)\n1 teaspoon (\n3\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n4\nmedium\ngarlic\ncloves\n(20g), peeled\nDirections\nFor the Rice:\nIn a large heavy-bottomed saucepan, heat 2 tablespoons oil over medium heat until shimmering. Add two-thirds of onion and cook, stirring, until softened and translucent, about 5 minutes. Add rice and cook, stirring, until grains are shiny and evenly coated with oil, 2 to 3 minutes. Add water or stock and salt, increase heat to high, and bring to a boil. Place bell pepper on top of rice.\nSerious Eats / Julia Estrada\nBoil rice without stirring until most of the liquid has evaporated and you can see small bubbles bursting on the surface of the rice. Immediately reduce the heat to the lowest setting, cover, and cook for 15 minutes. Remove and discard bell pepper. Fluff rice with chopsticks or fork, then let cool. Transfer to an airtight container and refrigerate for 24 hours.\nSerious Eats / Julia Estrada\nFor the Beans:\nSpread beans out in a rimmed baking sheet. Pick out any debris and broken beans. Transfer beans to colander and rinse under cold running water. Place rinsed beans in a large pot and cover with cold water; water should cover beans about 3 inches. Let soak for 30 minutes.\nSerious Eats / Julia Estrada\nBring beans to a boil over high heat. Reduce heat to maintain a simmer and cook beans for 30 minutes. Turn off heat, cover beans, and let rest 1 hour. Bring beans back up to boil over high heat. Add salt and garlic, reduce heat to maintain a simmer, and cook until beans are tender, 30 to 60 minutes. Drain beans or, if desired, strain over a bowl and retain liquid for another use. You should have about 3 cups of cooked beans; measure out 2 cups of beans and reserve the rest for another use.\nSerious Eats / Julia Estrada\nFor the Gallopinto:\nIn large saucepan, heat remaining 2 tablespoons oil over medium-high heat until shimmering. Add remaining onion and cook, stirring, until softened and translucent, about 5 minutes.\nSerious Eats / Julia Estrada\nAdd rice and beans, and cook, stirring, until rice is evenly coated. Continue to cook, stirring, to allow flavors to meld and gallopinto to become slightly crisp, about 10 minutes. Serve immediately with scrambled or fried eggs, a side of corn tortillas, and queso fresco. If desired, cover and cook over low heat for an additional 10 minutes (see note).\nSerious Eats / Julia Estrada\nNotes\nGoya sells \"Central American Beans,\" which are the small red kidney beans that are standard issue in Nicaragua. If you can't find them, use small black beans.\nGallopinto is served either soft or crisp—cook according to preference.\nCentral American\nBlack Beans\nRice & Grain Sides"
}