{
  "url": "https://www.seriouseats.com/gamja-tang-pork-and-potato-stew-5198498",
  "image_url": "https://www.seriouseats.com/thmb/HEGgzMijFbNJJEzZj_g2Fy_cEtw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210715-gamja-tang-vicky-wasik-seriouseats-20-b1f2e08d701b486d9f029eb82e9e10e6.jpg",
  "tags": [
    "Korean",
    "Pork",
    "Braised & Stewed Pork",
    "Pork Mains",
    "Winter Mains"
  ],
  "title": "Gamja-tang (Korean Pork and Potato Stew)",
  "full_text": "Gamja-tang (Korean Pork and Potato Stew)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n110 mins\nTotal\n115 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Gamja-tang:\n2 pounds (\n900\ng\n)\nSt. Louis-cut pork ribs\n, cut into two 5- to 6-rib pieces\n1 1/2\nteaspoon\ns (5g) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n2\ntablespoons\n(30ml)\nvegetable oil\n1\nsmall\nwhite onion\n(about 5 1/4 ounces; 150g), quartered\n9\nmedium\ngarlic cloves\n(45g), finely chopped\nOne 2-inch piece (about 1 ounce;\n25\ng\n)\nfresh ginger\n, peeled and finely chopped\n3\ntablespoons\n(45g)\ndoenjang\n(Korean fermented soybean paste)\n2\ntablespoons\n(15g) coarse\nground gochugaru\n(Korean chile powder)\n1\nquart\n(950ml)\nhomemade\nchicken stock\nor store-bought low sodium chicken broth\n1\ntablespoon\n(15ml)\nfish sauce\n1 1/2 pounds (\n680\ng\n)\nYukon gold potatoes\n, about 2 to 3 inches in diameter, peeled\n12 ounces (\n340\ng\n)\ndaikon radish\n, peeled and cut into 2-inch pieces\n1/4 head\ngreen cabbage\n(about 10 1/2 ounces;\n300\ng\n), cored (reserve core for garnish), leaves separated\n1/4 cup (\n40\ng\n)\nperilla seeds\nFor Serving:\n5\nscallions\n(about\n60\ng\n), sliced 1/4-inch-thick on a steep bias\n10 to\n12\nperilla leaves\n(about 20g), stemmed and torn into quarters\n1\nhot Korean long\npepper\nor\nserrano chile\n, stemmed and thinly sliced (optional)\nThinly sliced\ngreen cabbage\ncore\nDirections\nFor the Gamja-tang:\nSeason ribs on all sides with salt. In a large Dutch oven, heat oil over medium-high heat until just smoking. Add half of the ribs, meat side down, and cook, turning occasionally, until browned on both sides, 6 to 8 minutes. Transfer browned ribs to a plate and set aside. Repeat browning process with remaining ribs, then let browned ribs rest for 5 minutes. Using a sharp knife, cut between ribs to separate into single-rib pieces. Return ribs to plate and set aside.\nVicky Wasik\nLower heat to medium-low and add onion to pot. Cook, stirring occasionally, until onion is slightly softened, about 5 minutes. Add garlic, ginger, gochugaru, and doenjang and continue to cook until aromatic, about 1 minute. Add chicken stock, fish sauce, and potatoes, and return ribs to pot along with any accumulated juices. Bring to a boil, then lower heat to a simmer, cover, and cook until potatoes are slightly tender on the exterior but still firm at the center, so that they offer resistance when poked with a paring knife, about 30 minutes.\nVicky Wasik\nRemove lid, stir in daikon radish, and arrange cabbage leaves in an even layer over the surface of the stew to form a lid. Continue to cook, adjusting heat as needed to maintain a simmer, until potatoes are fully cooked through, offering little resistance when poked with a paring knife, and daikon is just tender, about 30 minutes.\nVicky Wasik\nMeanwhile, in a mortar and pestle or spice grinder, grind perilla seeds into a coarse powder. Set aside 2 teaspoons of the crushed perilla seeds and, once potatoes are cooked through, add the rest to the stew. Gently stir to incorporate perilla seeds and cabbage leaves into the stew.\nVicky Wasik\nContinue to cook until meat on ribs is fully tender, offering minimal resistance when poked with a paring knife, and potatoes have begun to break down slightly, thickening the stew, about 20 minutes longer. Season with salt to taste.\nVicky Wasik\nFor Serving:\nDivide stew between individual serving bowls, topping each portion with scallions, perilla leaves, chile (if using), and sliced cabbage core. Serve immediately.\nVicky Wasik\nNotes\nPerilla seeds can be found at Korean markets such as HMart or purchased online.\nMake-Ahead and Storage\nThe stew can be made in advance and refrigerated in an airtight container for up to 1 week. Reheat gently on stovetop.\nKorean\nPork\nBraised & Stewed Pork\nPork Mains\nWinter Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gamja-tang-korean-pork-and-potato-stew.webp?"
}