{
  "url": "https://www.seriouseats.com/garlic-and-herb-roasted-pork-loin-with-crackl",
  "image_url": "https://www.seriouseats.com/thmb/rxmQpQYRFIbyWn0fiMkkBJqq5fM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__11__20161102-Roasted-Pork-Loin-07-c66e66a96c754f8da26dd7788d0fa471.jpg",
  "tags": [
    "Pork Mains",
    "British",
    "Roasted Pork",
    "Apple",
    "Pork Loin"
  ],
  "title": "Garlic- and Herb-Roasted Pork Loin With Crackling and Spiced Apple Chutney",
  "full_text": "Garlic- and Herb-Roasted Pork Loin With Crackling and Spiced Apple Chutney\nClose\nJump to recipe\nPrep\n20 mins\nCook\n90 mins\nActive\n60 mins\nResting Time\n12 hrs 30 mins\nTotal\n14 hrs 20 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork Loin:\nOne\n(\n4- to 5-pound\n;\n2- to 2 1/2-kg\n)\npork loin, center cut with rind still intact\n(see note)\nKosher salt\n1/4\ncup\n(\n60\nml\n) neutral\noil\n, like\ncanola\nor\ngrapeseed\n2\nheads\ngarlic\n, cut in half across the bulbs\n8\nsprigs\nfresh thyme\n2\nsprigs\nfresh rosemary\nFor the Spiced Apple Chutney:\n4\ntart\nbaking\napples\n(such as\nGranny Smith\n), peeled, cored, and cut into 1/2-inch dice\n3/4\ncup chopped\nyellow onion\n2\ntablespoons\nfresh ginger, grated\n(\n20\ng\n)\n1/2\ncup\npomegranate juice\n(\n120\nml\n)\n1/2\ncup\nplus\n2\ntablespoons\napple cider vinegar\n(\n150\nml\n)\n3/4\ncup\nlight brown sugar\n, packed (about\n5\nounces\n;\n140\ng\n)\n1\nteaspoon\nmustard seeds\n(about\n2\ng\n)\n1/4\nteaspoon\nred pepper flakes\n1\nstar anise\npod\nDirections\nFor the pork\n: Dry the skin as much as possible with a paper towel. Generously season the meat (not the skin) with kosher salt, including in between the ribs and meat. Place the roast on a wire rack set in a rimmed baking sheet. Transfer to the refrigerator and let rest, uncovered, at least overnight and up to 3 days.\nSerious Eats / Emily and Matt Clifton\nWhen ready to cook, preheat the oven to 475°F (250°C). If the butcher has not done it for you, score the rind with a very sharp knife, using long, parallel slits 1/4-inch to 1/2-inch apart across the width of the loin; be careful not to cut into the flesh.\nFlip the loin over and rub the flesh side with 2 tablespoons of oil. Lift the meat from the bones. Place the garlic, thyme, and rosemary up against the meat. Using butcher's twine, tie the ribs back to the loin, with the aromatics sandwiched in between.\nSerious Eats / Emily and Matt Clifton\nRub the rind with more salt, ensuring that the salt is rubbed well into the slits. Brush the rind with remaining oil.\nSerious Eats / Emily and Matt Clifton\nPlace the loin, skin-side up, on a rack in a roasting pan or baking sheet and roast for 30 minutes. Reduce the heat to 325°F (160°C) and cook until an instant-read thermometer poked into the center of the loin reaches 130°F (54°C) for medium-rare, or 140°F (60°C) for medium, about 1 hour. Skin should be puffy and crisp; if it’s not puffy enough, remove the roast from the oven, preheat the broiler, and place the roast a few inches under the broiler until the skin puffs.\nWhile the pork roasts, make the apple chutney\n: In a large saucepan, combine the apples, onion, ginger, pomegranate juice, vinegar, brown sugar, mustard seeds, pepper flakes, star anise, and salt. Bring the mixture to a boil over medium-high heat, stirring occasionally. Reduce the heat to a simmer and continue cooking, stirring occasionally, until most of the liquid has evaporated, about 45 minutes. Remove the star anise and allow to cool.\nWhen the roast is done, remove it from the oven and let the loin rest on a carving board for 30 minutes.\nRemove the ribs by cutting the remaining flap, discard the garlic and herbs. Carve the loin into slices following the scores so that each slice has a segment of crackling (approximately a 1/4-inch-wide strip). Serve the warm pork loin with apple chutney and your preferred sides. (We like\nYorkshire puddings\nand a bitter green salad).\nSpecial Equipment\nButcher's twine, a\nroasting pan\nand rack, or a\nwire rack and a rimmed baking sheet\nNotes\nAsk your butcher in advance for a center-cut pork loin with the skin and bones intact. Ask for “easy carve” which means the bones are mostly separated from the meat. You can also go completely boneless, but the ribs make a striking presentation. You can also have your butcher score the skin with parallel slits 1/4-inch apart across the width of the loin. If you can’t find a skin-on loin, you can still make the recipe (minus the crackling). Make sure you find a loin with a thick fat cap, or the meat will be dry.\nPork Mains\nBritish\nRoasted Pork\nApple\nPork Loin",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/garlic-and-herb-roasted-pork-loin-with-crackling-and-spiced-apple-chutney.webp?"
}