{
  "url": "https://www.seriouseats.com/garlic-naan-recipe-8784140",
  "image_url": "https://www.seriouseats.com/thmb/SvanEfkwAQJvVMXR0dJxLb0i9zg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250129-SEA-GarlicNaan-KanikaandJatinSharma-Beauty1-53-8450f1826f8c4497a3d943e30a8ce8d6.jpg",
  "tags": [
    "Bread",
    "The Latest",
    "Indian"
  ],
  "title": "Easy Garlic Naan",
  "full_text": "Easy Garlic Naan\nClose\nJump to recipe\nPrep\n90 mins\nCook\n12 mins\nTotal\n102 mins\nServes\n6\nto 8\nMakes\n6 Naan\nCook Mode\n(Keep screen awake)\nIngredients\n3 3/4\ncups\n(475\ng\n)\nall-purpose flour,\nplus more for dusting counter\n1\nteaspoon\nbaking powder\n2\n1/4\nteaspoons\n(1\npacket)\ninstant or\nrapid-rise yeast\n2\nteaspoons\nDiamond Crystal\nKosher salt\n, plus more for seasoning; for table salt use half by volume\n2\nteaspoons\nsugar\n2/3\ncup\n(16\n0ml)\nwarm\nwhole milk (\nabout 110℉; 43℃)\n3/4\ncup\n(\n175\nml\n) whole fat\nplain yogurt,\nlightly beaten\n1\nlarge\negg\n2 tablespoons plus\n2\nteaspoons\n(40\nml)\nneutral oil\nsuch as vegetable oil, divided\n3\nclove\ngarlic, grated or finely minced, divided\n3\ntablespoons\n(\n56\ng\n)\nghee\nor\nbutter\n4\nsprigs\ncilantro,\nleaves and tender stems finely chopped, optional\nDirections\nUsing a fine-mesh strainer set over a large bowl, sift flour and baking powder into bowl. Whisk in yeast, sugar, and salt to combine.\nSerious Eats / Kanika and Jatin Sharma\nIn a 2-cup liquid measuring cup or medium bowl, whisk warm milk, yogurt, and egg to combine. Pour milk mixture into flour and stir until well combined and no dry flour remains, about 1 minute.\nSerious Eats / Kanika and Jatin Sharma\nAdd 2 tablespoons plus 1 teaspoon oil and half of minced garlic to the shaggy dough and knead until evenly distributed, about 1 minute. Using one hand, form the mixture, rolling it against the side of the bowl, into a cohesive ball of dough, about 4 minutes.\nSerious Eats / Kanika and Jatin Sharma\nTransfer dough to a lightly floured work surface and use both hands to knead dough on counter until soft, smooth, silky, and elastic, about 12 minutes. Shape dough into a tight ball. Pour remaining 1 teaspoon oil into now empty bowl; roll dough in oil until coated all over. Cover bowl tightly with a piece of plastic wrap or a lid; set aside to proof at room temperature until dough doubles in size, 40 to 60 minutes. (Alternatively, shaped dough can be refrigerated for 12 to 24 hours to proof.)\nSerious Eats / Kanika and Jatin Sharma\nWhile dough is proofing, adjust the oven rack to lower-middle position and set a baking stone or upside-down rimmed baking sheet on rack. Preheat oven with stone/baking sheet in it to 500℉ (260℃). Once dough is proofed, punch down.\nSerious Eats / Kanika and Jatin Sharma\nDivide dough into 6 equal portions (about 5 ounces; 145g each) and roll each portion into tight balls. Set aside on kitchen counter and cover loosely with a clean kitchen towel or greased plastic wrap and let rest for 15 minutes.\nSerious Eats / Kanika and Jatin Sharma\nWorking with 1 dough round at a time on a clean kitchen counter (keeping remaining balls covered while you work), use a lightly floured rolling pin and roll the ball into a flat oval that is about 10 inches long by 5 inches wide and no more than 1/2-inch thick. Gently press your fingers into top of dough to dock dough, then gently lift and set shaped naan aside and cover with a clean kitchen towel. Repeat rolling and shaping remaining naan; set aside.\nSerious Eats / Kanika and Jatin Sharma\nWorking quickly, slap 2 naan on the hot baking stone or rimmed baking sheet, 2 to 4 inches apart, in the oven. Bake until naan are cooked through, puffed up, and golden with browned spots, about 4 minutes. Do not flip naan during baking and be careful not to overbake or they will be chewy or tough. Using a long metal spatula or tongs, remove from oven and wrap 2 naan together in a clean, dry kitchen towel to keep warm.\nSerious Eats / Kanika and Jatin Sharma\nRepeat steps 7 and 8 with the remaining naan in batches of 2. While third batch of naan is baking, in a small saucepan, heat remaining garlic and butter over medium heat until butter is melted; turn off heat and set aside.\nSerious Eats / Kanika and Jatin Sharma\nOnce all naan are all baked, use a pastry brush to coat top of each warm naan with the prepared garlic butter and transfer to a serving platter or basket. Sprinkle naan with salt to taste and with cilantro. Serve immediately.\nSerious Eats / Kanika and Jatin Sharma\nSpecial Equipment\nRolling pin, baking stone or rimmed baking sheet, 2 clean dry kitchen towels, pastry brush\nMake-Ahead and Storage\nThe prepared and kneaded dough (through step 3) can be refrigerated in an airtight container for up to 24 hours. When ready to make naan, bring the dough to room temperature for 10 minutes before shaping. Then continue from step 4.\nBaked naan can be stored in an airtight container at room temperature for up to 1 day.\nBread\nThe Latest\nIndian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-garlic-naan.webp?"
}