{
  "url": "https://www.seriouseats.com/garlic-mashed-potatoes-recipe-8748487",
  "image_url": "https://www.seriouseats.com/thmb/duowTFhGdgi3uNKhoxZPdNBcxK8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241010-SEA-Garlic-Mashed-Potatoes-Lozano_3x4_091-f8661a9784a94b369fdc9fc842878a7e.jpg",
  "tags": [
    "Sides",
    "The Latest",
    "Thanksgiving",
    "Potatoes",
    "Mashed Potatoes"
  ],
  "title": "Garlic Mashed Potatoes",
  "full_text": "Garlic Mashed Potatoes\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nTotal\n85 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\nhead\ngarlic\n(2 to 2 1/2 ounces; 60g)\n1/4 cup\n(60\ng\n)\nunsalted butter\n, cut into 1/2-inch pieces, divided, plus more for serving\n2 1/4 pounds\n(1k\ng)\nyellow, medium starch potatoes\nsuch as Yukon Gold\n(about eight 5-ounce potatoes), scrubbed\n1/2 cup (120\nml)\nheavy\nwhipping cream,\nplus for as needed\n2 teaspoons (\n6\ng)\nDiamond Crystal\nkosher salt;\nfor table salt use half as much by volume or the same weight\nFreshly\nground\nblack pepper\n, for serving\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (205°C). Remove the outer layer of papery skin from the garlic head, making sure to leave the entire head intact. Slice about 1/4 inch off the tops of the garlic head so the cloves are all exposed. Place garlic head on a piece of aluminum foil large enough to wrap the garlic, and set 1 piece of butter on top of the cut side; enclose it with the foil.\nSerious Eats / Robby Lozano\nUsing a paring knife, score potato skins lengthwise around the middle of each potato. Arrange potatoes on a rimmed baking sheet and cover sheet tightly with aluminum foil. Place wrapped garlic directly on oven rack; Bake potatoes and garlic until potatoes are fork-tender and garlic is deep golden and soft, about 1 hour. Set garlic aside to cool slightly while preparing the potatoes. Let potatoes stand until cool enough to handle, about 15 minutes.\nSerious Eats / Robby Lozano\nWhile potatoes are still hot, carefully remove the skins using a paring knife; discard skins. Set a ricer or food mill over a large bowl and pass potatoes through. Alternatively, transfer potatoes to a large bowl and mash with potato masher, being careful not to overwork. Add remaining butter pieces and squeeze roasted garlic cloves (discarding skins) into potatoes; mash mixture with a large fork or potato masher until well combined.\nSerious Eats / Robby Lozano\nMicrowave heavy cream until steaming, about 30 seconds. Slowly add warm heavy cream and salt, folding into potatoes until creamy and smooth. Adjust consistency with additional warmed heavy cream as needed to desired texture. Season to taste with more salt and pepper, if desired. Serve immediately with pats of butter on top.\nSerious Eats / Robby Lozano\nSpecial Equipment\nRicer\n,\nfood mill\n, or\npotato masher\nMake-Ahead and Storage\nThe prepared mashed potatoes can be refrigerated in an airtight container for up to 3 days. Reheat on the stove top, adding warm milk while stirring as needed to get a smooth texture.\nAlternatively, the prepared mashed potatoes can be kept warm in a slow cooker on the warm setting for up to 4 hours.\nSides\nThe Latest\nThanksgiving\nPotatoes\nMashed Potatoes"
}