{
  "url": "https://www.seriouseats.com/garlic-scape-compound-butter-recipe-11738002",
  "image_url": "https://www.seriouseats.com/thmb/qA3N_Oi3z9UZx-jZoTI6oLOCeZw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220626-garlicscapebutter-amandasuarez-5fbeb512925e4656bae652622256f350.jpg",
  "tags": [
    "Butter",
    "Recipes",
    "Vegetarian",
    "Condiments & Sauces",
    "Summer"
  ],
  "title": "The Herby, Garlicky Butter Chefs Are Slathering on All Their Steak, Fish, and Vegetables",
  "full_text": "The Herby, Garlicky Butter Chefs Are Slathering on All Their Steak, Fish, and Vegetables\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nChilling Time\n30 mins\nTotal\n45 mins\nServes\n16 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\npound\n(113g)\ngarlic scapes\n(about 6 scapes), woody ends trimmed and scapes cut into roughly 4-inch lengths\n1/4\ncup\nloosely packed\nflat-leaf parsley\nleaves and tender stems (1/2 ounce; 14g)\n1\nteaspoon\n(5ml)\nfresh lemon juice\n1/2\npound\nunsalted butter\n(2 sticks; 226g), softened (see note)\nKosher or\nsea salt\nDirections\nIn a large bowl, prepare an ice bath. In a pot of salted boiling water, blanch scapes until just tender, 1 to 2 minutes. Drain, then immediately plunge scapes into ice bath, stirring to chill rapidly. Drain scapes, transfer to a work surface, then mince finely along with the parsley.\nSerious Eats / Amanda Suarez\nIn a medium mixing bowl, combine minced scapes with parsley, lemon juice, butter, and a large pinch of salt. Using a clean or gloved hand and/or a silicone spatula, mash until all ingredients are thoroughly and evenly incorporated into the butter. Season with additional salt, if needed.\nSerious Eats / Amanda Suarez\nLay a sheet of plastic wrap on a work surface. Scrape compound butter onto the middle of the plastic wrap, patting it into a rough log shape, about 2 inches thick, as you roll the plastic around it. Holding the plastic by its ends, spin to twist the ends and tighten the butter into an even log, using your hands to gently give the butter an even cylindrical shape. Transfer to the refrigerator to chill until firm, about 30 minutes, before slicing into rounds and using as desired.\nSerious Eats / Amanda Suarez\nNotes\nWhile we typically call for unsalted butter in recipes to better control how much salt is eventually added, this is one case where a salted butter would work very well; if using salted butter, simply omit the additional salt.\nMake-Ahead and Storage\nWrapped compound butter may be stored in the refrigerator for up to 2 weeks or in the freezer for several months.\nRead More\nRamp Compound Butter Recipe\nFresh Radishes With 3 Compound Butters Recipe\nGarlic Scape Pesto Recipe\nGrilled Garlic Scapes Recipe\nGarlic Scape Hummus Recipe\nButter\nRecipes\nVegetarian\nCondiments & Sauces\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-herby-garlicky-butter-chefs-are-slathering-on-all-their-steak-fish-and-vegetables.webp?"
}