{
  "url": "https://www.seriouseats.com/garlic-confit",
  "image_url": "https://www.seriouseats.com/thmb/R1EKAwi1bGAg0H8EaMFf6Xs3HXE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__09__20180703-garlic-confit-vicky-wasik-2-d4cecee0de3140aba2e6f6a53c1d29ce.jpg",
  "tags": [
    "Garlic",
    "Condiments & Sauces"
  ],
  "title": "Garlic Confit Recipe",
  "full_text": "Garlic Confit Recipe\nClose\nJump to recipe\nCook\n65 mins\nActive\n10 mins\nTotal\n65 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nheads\nof\ngarlic\n, cloves peeled and root ends trimmed (see note)\nExtra-virgin olive oil\n, as needed (see note)\nDirections\nIn a saucepan, cover garlic with enough oil to fully submerge it.\nSerious Eats / Vicky Wasik\nSet over medium heat and bring to a bare simmer. Lower heat to maintain the barest simmer, so that you see some tiny bubbles on the garlic, but it's not actively frying in the oil.\nCook, adjusting heat as necessary to maintain this minimal level of cooking activity, until the garlic is buttery soft and tan in color, 1 to 3 hours (exactly how long it takes will depend on the garlic you're using, including its size and age, and how hot the oil is; raising the heat will move things faster but also shortchange you on the flavor development).\nTransfer garlic confit and the cooking oil to a clean heatproof container, cover with plastic, and refrigerate immediately.\nRefrigerated in its oil, the garlic confit can be kept for up to 2 weeks.\nNotes\nThis recipe can be scaled up or down as desired.\nWe love the flavor of olive oil with the garlic, but you can use any neutral vegetable oil for this, such as grapeseed or canola oil; you can also use a more affordable olive oil such as pure olive oil.\nRead More\nRoasted Garlic\nPickled Garlic\nGarlic\nCondiments & Sauces",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/garlic-confit-recipe.webp?"
}