{
  "url": "https://www.seriouseats.com/garlic-scape-hummus-recipe-11754931",
  "image_url": "https://www.seriouseats.com/thmb/Xv9u6EjxLws_h62nB_LMC5NZVvQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220626-GarlicScapeHummus-AmandaSuarez-05-808199643ad6424b9096f3772fb551bf.JPG",
  "tags": [
    "Hummus",
    "Recipes",
    "Dips",
    "Snacks & Appetizers",
    "Summer"
  ],
  "title": "The 1-Ingredient Upgrade for Silky, Garlicky Hummus",
  "full_text": "The 1-Ingredient Upgrade for Silky, Garlicky Hummus\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs 5 mins\nSoaking Time\n8 hrs\nTotal\n10 hrs 20 mins\nServes\n10\nto 12 servings\nMakes\n5 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\ndried chickpeas\n(\n1\ngenerous\ncup\n;\n225\ng\n)\n2\nteaspoons\n(\n12\ng\n)\nbaking soda\n, divided\n3\ntablespoons\n(\n27\ng\n) Diamond Crystal\nkosher salt\n, divided, plus more to taste; if using table salt, use half as much by volume or the same weight\n1\nsmall\nyellow onion\n(\n6\nounces\n;\n170\ng\n), peeled and halved\n1\nsmall stalk\ncelery\n(\n2\nounces\n;\n55\ng\n)\n1\nsmall\ncarrot\n, peeled (\n2\nounces\n;\n55\ng\n)\n2\nbay leaves\n5\nmedium\ngarlic scrapes\n, woody ends trimmed and scapes cut into roughly 1-inch lengths (about\n70\ng\n)\n1 1/2\ncups\n(\n360\ng\n)\ntahini sauce with garlic and lemon\nExtra-virgin olive oil\n, for serving\nDirections\nIn a large bowl, combine chickpeas, 1 teaspoon baking soda, and 2 tablespoons salt. cover with 6 cups (1.4L) cold water, stir to dissolve salt and baking soda, and let stand at room temperature overnight. Drain and rinse beans thoroughly.\nSerious Eats / Amanda Suarez\nIn a Dutch oven, combine drained chickpeas, onion, celery, carrot, bay leaves, and remaining 1 teaspoon baking soda and 1 tablespoon salt. Add 6 cups (1.4L) water and bring to a boil over high heat. Reduce heat to maintain a simmer, cover partially with lid, and cook until chickpeas are completely tender, to the point of falling apart, about 2 hours. Check on chickpeas occasionally and top up with more water if necessary; they should be completely submerged at all times.\nSerious Eats / Amanda Suarez\nMeanwhile, in a medium bowl, prepare an ice bath. In a medium pot of boiling water, blanch garlic scapes until just tender, about 2 minutes. Using a slotted spoon or mesh strainer, transfer scapes to ice bath to chill. Once chilled, drain scapes and set aside.\nSerious Eats / Amanda Suarez\nUsing tongs, discard onion, celery, and bay leaves. Transfer chickpeas, carrot, and blanched scapes to a high-powered blender (see note) with 1 cup (235ml) cooking liquid. Cover blender, taking out the central insert on the blender lid.\nSerious Eats / Amanda Suarez\nPlace a folded kitchen towel over the hole in the center of the lid to allow steam to escape. Holding the towel down firmly, turn the blender to the lowest possible speed and slowly increase speed to high. If the mixture becomes too thick to blend, add cooking liquid, 1/4 cup (60ml) at a time, until a very smooth, thick, and spreadable purée forms, always starting the blender on low speed before increasing to high. If your blender comes with a push-stick for thick purées, use it. Continue blending until completely smooth, about 2 minutes. Transfer 1 cup cooking liquid to an airtight container and refrigerate.\nSerious Eats / Amanda Suarez\nTransfer hot chickpea mixture to a large bowl. Whisk in tahini sauce and season with salt to taste. Transfer to a sealed container and allow to cool to room temperature. It should thicken up until it can hold its shape when spooned onto a plate. If purée is too thick, add reserved cooking liquid, 1 tablespoon at a time, until hummus reaches desired consistency.\nSerious Eats / Amanda Suarez\nTo serve, spread hummus on a wide, shallow plate and drizzle with olive oil.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nblender\nNotes\nA food processor can be used in place of the blender, though it won't produce hummus that is quite as smooth.\nMake-Ahead and Storage\nHummus can be refrigerated in an airtight container for up to 1 week. Allow to come to room temperature before serving.\nHummus\nRecipes\nDips\nSnacks & Appetizers\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-1-ingredient-upgrade-for-silky-garlicky-hummus.webp?"
}