{
  "url": "https://www.seriouseats.com/gata-5185123",
  "image_url": "https://www.seriouseats.com/thmb/fzZuVrgZQX5tSsdwfViEZy0Df-U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210511-Gatah-Andrew-Janjigian-seriouseats-37-1c1b7e068ab24a8db739ae14d8a81281.jpg",
  "tags": [
    "Cakes",
    "Pastries",
    "Walnuts",
    "The Latest",
    "Armenian"
  ],
  "title": "Gata (Armenian Coffee Cake)",
  "full_text": "Gata (Armenian Coffee Cake)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n35 mins\nRising and Chilling Time\n4 hrs 30 mins\nTotal\n5 hrs 40 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n10\nounces\n(\n2\ncups\nplus\n2\ntablespoons\n;\n285\ng\n)\nall-purpose flour\n1 1/4\nteaspoons\n(\n5\ng\n)\ninstant yeast\n1/8\nteaspoon\nbaking soda\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or same weight\n5\nounces\n(\n10\ntablespoons\n;\n140\ng\n)\nunsalted butter\n, softened\n2\nounces\n(about\n1/4\ncup\n;\n60\ng\n)\nsugar\n5\nounces\n(about\n2/3\ncup\n;\n140\ng\n)\nplain Greek yogurt\n(whole or low-fat)\n1\nlarge\negg\n(\n55\ng\n), lightly beaten\nFor the Filling:\n3\nounces\n(\n85\ng\n)\nwalnuts\n, lightly toasted and coarsely chopped\n2 1/2\nounces\n(about\n1/2\ncup\n;\n70\ng\n)\nall-purpose flour\n2\nounces\n(about\n1/4\ncup\n;\n60\ng\n)\nsugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume or same weight\n2\nounces\n(\n4\ntablespoons\n;\n60\ng\n)\nunsalted butter\n, melted\n2\nteaspoons\n(\n10\nml\n)\nvanilla extract\nTo Finish and Bake:\n1\nlarge\negg\n, lightly beaten with a pinch of salt\nDirections\nFor the Dough:\nIn a medium bowl, whisk together flour, yeast, baking soda, and salt. In a large bowl, using a stiff rubber spatula, vigorously stir butter and sugar together to form a uniform paste. Add flour mixture to butter mixture; wipe out bowl that had flour mixture, lightly grease with cooking spray or butter, and set aside. Using spatula followed by hands, mix flour and butter mixtures together until even, cornmeal-like mixture forms, 1 to 2 minutes.\nSerious Eats / Andrew Jianjigian\nAdd yogurt and egg, and, using spatula followed by hands, stir until stiff, even dough forms, about 2 minutes. Transfer dough to the prepared lightly greased medium bowl and cover tightly. Let sit at room temperature for 30 minutes, then transfer to refrigerator and chill for at least 4 hours, and up to 16 hours.\nSerious Eats / Andrew Jianjigian\nFor the Filling:\nIn a medium bowl, stir together walnuts, flour, sugar, and salt. Add butter and vanilla extract and, using a rubber spatula, stir until clumpy paste forms and no dry flour remains, about 30 seconds. Cover and store at room temperature until ready to assemble.\nSerious Eats / Andrew Jianjigian\nTo Finish and Bake:\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Transfer dough to clean, lightly-floured surface, and dust top of dough lightly with flour. Using hands, gently press dough into even 6-inch circle, adding flour to both sides of dough as needed to prevent sticking, while pinching closed any major cracks in dough that form. Using a rolling pin, roll dough into a 12-inch circle, about 1/4-inch thick.\nAndrew Jianjigian\nPlace filling in center of dough and, using clean hands and rubber spatula, spread into an even 5-inch round disc, leaving a 3 1/2-inch border of dough on all sides. Starting at one edge, using your hands, fold and pleat dough over filling toward center, working your way around disc. Pinch and press pleats together to fully enclose filling. Press top of dough gently to form an even 6-inch round. Invert so seam side is facing down and, using a rolling pin, gently roll into an even 9-inch round. Carefully transfer to a rimmed baking sheet lined with parchment or a silicone baking mat.\nAndrew Jianjigian\nPinch dough around the edge of the gata between the index finger of one hand and thumb and index finger of the other hand to form decorative points, spaced about 1 inch apart. Brush top and sides of gata evenly with egg wash. Using a fork, drag flat underside of fork across top of gata to form grooved lines in a crisscross pattern, spaced about 1 inch apart. Using a toothpick, poke 8 to 10 evenly spaced holes in top of dough, stopping when you reach the filling. Bake until evenly golden brown, 28 to 35 minutes, rotating baking sheet after 20 minutes.\nSerious Eats / Andrew Jianjigian\nTransfer baking sheet to wire rack and let gata cool for at least 20 minutes. Slice into wedges, and serve.\nSerious Eats / Andrew Jianjigian\nNotes\nWalnuts are traditional here, though other nuts such as pecans, pistachios, or almonds would make excellent substitutes.\nThe dough will likely crack along the edges when being rolled and pressed out; just pinch the dough as needed to smooth it out.\nWhen decorating the top of gata, dip the tines of your fork regularly in flour to prevent dragging.\nThe edge pleats and top decorations will soften and smooth out as the gata bakes, so be sure to make them as distinct and sharp as possible.\nMake-Ahead and Storage\nThe gata filling can be refrigerated for up to 3 days, if desired. Allow to come to room temperature before using, about 30 minutes. Gata is best served on the day it's baked, though it can be covered and stored at room temperature for up to 24 hours. Reheat in a 250°F (120°C) oven for 15 minutes before serving.\nCakes\nPastries\nWalnuts\nThe Latest\nArmenian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gata-armenian-coffee-cake.webp?"
}