{
  "url": "https://www.seriouseats.com/gefilte-fish-recipe-8635884",
  "image_url": "https://www.seriouseats.com/thmb/mOxyKVrmTO2gGz2sKCC7PPOrO60=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240419-SEA-Gefilte-Fish-Amanda-Suarez-hero2-3d45c12aee3e487b94f800f9c169bdef.jpg",
  "tags": [
    "Passover",
    "The Latest",
    "Fish",
    "Eastern European"
  ],
  "title": "This Gefilte Fish Is So Good I Want to Eat It for Breakfast",
  "full_text": "This Gefilte Fish Is So Good I Want to Eat It for Breakfast\nClose\nJump to recipe\nPrep\n30 mins\nCook\n90 mins\nChilling Time\n12 hrs\nTotal\n14 hrs\nServes\n12\nto 24 people\nMakes\n25 3.5-ounce balls\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(1.4kg) ground\ncarp\n, pike, and/or whitefish meat, plus reserved bone cages and heads (see notes)\n4\nmedium\nonions\n(2 pounds; 900g total), divided\n1\nlarge\ncelery\nrib\n, thinly sliced crosswise\n1\nfennel\nbulb\n, ends trimmed, then halved and thinly sliced\nA few\nsprigs\neach fresh flat-leaf\nparsley and dill\n, plus more for garnish\n2\ntablespoons\n(30ml) vegetable or other neutral\noil\n3/4\ncup\nmatzo meal\n(3 1/2 ounces; 100g)\n3\nlarge\neggs\n3\ntablespoons\n(27g) Diamond Crystal kosher\nsalt\n, plus more as needed (for table salt, use half as much by volume)\n1\ntablespoon\n(13g)\nsugar\n, plus more as needed\n1\nteaspoon\nfreshly ground white or black\npepper\n4\nmedium\ncarrots\n(3/4 pound; 340g), peeled and sliced on the bias 1/4 inch thick\nPreserved horseradish\n, for serving\nDirections\nInspect fish heads and bone cages, removing and discarding any remaining viscera and gills if necessary. Under cold running water, wash fish heads and bone cages well, using your fingers to work away traces of blood, especially inside the head and along the spine (it doesn't have to be perfect, but try to get what you can).\nSerious Eats / Amanda Suarez\nTransfer fish heads and bone cages to a large stock pot and add cold water until just covered. Set over high heat, bring to a bare simmer, then drain in a colander in the sink. Rinse out pot and fish bones and heads, then return to pot (this step, while optional, coagulates and removes proteins that can cloud up the stock for a more pristine result).\nSerious Eats / Amanda Suarez\nThinly slice 1 onion and add to stock pot along with celery, fennel, and parsley and dill sprigs. Cover with fresh cold water, set over medium-high heat and bring to a bare simmer. Reduce heat to maintain bare simmer and cook for 1 hour.\nSerious Eats / Amanda Suarez\nWhile the stock cooks, finely dice remaining 3 onions. In a small skillet, heat oil over medium heat until shimmering. Add half the diced onion along with a pinch of salt and cook, stirring often, until softened, about 4 minutes. Set aside to cool.\nSerious Eats / Amanda Suarez\nTransfer ground fish to a large mixing bowl. Carefully pick through ground fish, removing and discarding any bones or scales. Add raw onion, sautéed onion, matzo meal, eggs, salt, sugar, and pepper. Add 6 tablespoons (90ml) cold water, then stir until very well combined and fish mixture develops a slightly sticky texture. Let rest, refrigerated, for 30 minutes.\nSerious Eats / Amanda Suarez\nWhen fish stock is ready, strain through a fine-mesh strainer set over a large heatproof vessel. Discard solids and wash out stock pot. Return fish stock to stockpot.\nSerious Eats / Amanda Suarez\nReturn fish stock to medium-high heat and bring to a simmer. Add sliced carrots.\nSerious Eats / Amanda Suarez\nUsing 2 large serving or sauce spoons, scoop up a generous ball of fish mixture and scrape it back and forth between the 2 spoons to form a compact football shape (if you want to make it look like a classic French quenelle, try to use the spoons to give it 3 defined sides). Carefully free the fish ball from the spoons and slide it right into the water. Repeat with remaining fish mixture until all has been formed into balls and added to the pot, shaking the pot from time to time to ensure fish balls do not stick to each other. Simmer until fish balls are cooked through and register 150°F (65°C) on an instant-read thermometer inserted in the center, 10 to 15 minutes. (Note that depending on the size of your pot, you may need to cook the fish mixture in batches. If you do need to do this, transfer the cooked fish balls to a platter, then add the next batch. Once all are cooked, add them back to the pot.)\nSerious Eats / Amanda Suarez\nSeason fish broth with salt and sugar to taste, then let cool until warm. Serve gefilte fish warm with cooked carrots, parsley and/or dill garnish, and horseradish. Alternatively, cover and transfer to the refrigerator and allow to chill overnight, then serve chilled with carrots, herb garnish, horseradish, and, if desired, a small amount of aspic (the chilled, slightly gelled broth).\nSerious Eats / Amanda Suarez\nNotes\nWhile you can fillet, debone, and grind the meat from a whole fish yourself, it's a significant labor. It's much easier is to ask your fishmonger to do this for you; make sure to communicate that you want the bones, heads, and skin from the fish along with the meat. The ingredient list in this recipe calls for the weight of the ground fish instead of a starting weight for the whole fish because my experience is that the yield is too variable from the whole fish: I've seen many recipes that estimate that a 7-pound carp will yield more than three pounds of meat, but when I shopped for the fish to develop this recipe, I barely got four pounds of ground meat from 13 pounds of whole fish. Talk to your fishmonger about your desired yield of ground meat to ensure you get the right amount of whole fish.\nPassover\nThe Latest\nFish\nEastern European",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-gefilte-fish-is-so-good-i-want-to-eat-it-for-breakfast.webp?"
}