{
  "url": "https://www.seriouseats.com/gemelli-with-asparagus-ricotta-arugula-and-lemon-zest-recipe",
  "image_url": "https://www.seriouseats.com/thmb/UCkf3yDG_VNRurHgrTbxHcvYE5s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__20100521-gemelli-asparagus-ricotta-arugula-lemon-zest-primary-f749b7ec88d140759ad391d33afce07a.jpg",
  "tags": [
    "Vegetarian Mains",
    "Ricotta",
    "Lemon",
    "Pastas",
    "Asparagus"
  ],
  "title": "Gemelli with Asparagus, Ricotta, Arugula, and Lemon Zest Recipe",
  "full_text": "Gemelli with Asparagus, Ricotta, Arugula, and Lemon Zest Recipe\nClose\nJump to recipe\nCook\n35 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nextra-virgin olive oil\n1\npound\nasparagus\n, trimmed, peeled, and cut into 1-inch pieces\nKosher salt\nFreshly\nground black pepper\n1\npound\ngemelli, fusilli, rotini or any other medium-thickness\nshort pasta\n1\ncup\nfresh\nricotta cheese\n1\ntablespoon\nzest\nfrom\n1\nwhole\nlemon\n2\ncups\nloosely packed\nbaby arugula leaves\n2\nounces\nfinely grated\nPecorino Romano cheese\n, plus more for serving tableside\nDirections\nHeat oil in large heavy-bottomed sauce pot over high heat until just starting to smoke. Add asparagus pieces and cook, stirring occasionally, until tender-crisp and lightly browned. Season asparagus to taste with salt and pepper, transfer to bowl, and set aside. Do not clean sauce pot.\nIn a medium saucepan, bring 2 quarts of water and 1 teaspoon kosher salt to a boil over high heat. Add pasta and stir immediately. Allow to return to a boil, stir once vigorously, cover pot, and shut off heat. After one minute, stir one last time. Recover pot. Follow timing on box as a general guide for cooking time—start checking pasta 2 minutes before suggested cooking time and continue checking every minute until proper al dente texture is reached. Pasta should be fully softened, but retain a slight bite in the center. Drain pasta, reserving 2 cups of cooking liquid. Immediately transfer pasta to empty sauce pot from cooking asparagus.\nAdd asparagus, ricotta, lemon zest, arugula, grated cheese, and a few big twists of black pepper to the pasta. Add 1 cup pasta water and stir until all ingredients are combined and arugula has wilted. Continue adding pasta water until desired consistency is reached (the ricotta should turn into a creamy sauce that coats the noodles). Season to taste with salt and pepper, and serve immediately, passing more grated cheese at the table.\nNotes\nUse a high quality ricotta cheese for this recipe. Check the ingredients label—it should contain nothing but milk, salt, and an acid or starter enzyme. Avoid any brand that uses gums or stabilizers.\nThis Recipe Appears In\nThe Food Lab: A New Way to Cook Pasta?\nVegetarian Mains\nRicotta\nLemon\nPastas\nAsparagus",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gemelli-with-asparagus-ricotta-arugula-and-lemon-zest-recipe.webp?"
}