{
  "url": "https://www.seriouseats.com/genoise-sponge-cake-recipe-6755258",
  "image_url": "https://www.seriouseats.com/thmb/Y4Rly4jyV7r1uEsVb2ZtwWmbZ8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221205-GenoiseSponge-AmandaSuarez-hero-03-e8b8ddd754964e289a92cfb96139eda8.JPG",
  "tags": [
    "Layer Cake",
    "The Latest",
    "French"
  ],
  "title": "Genoise Sponge",
  "full_text": "Genoise Sponge\nClose\nJump to recipe\nPrep\n25 mins\nCook\n25 mins\nCooling Time\n60 mins\nTotal\n110 mins\nServes\n8 servings\nMakes\n1 8-inch genoise cake (see note)\nCook Mode\n(Keep screen awake)\nIngredients\n2/3\ncup\n(70g)\nall-purpose flour\n1/4\ncup\n(30g)\ncornstarch\n4\nlarge\neggs\n(200g)\n1/2\ncup\n(100g) caster or\nsuperfine sugar\n(see note)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n3 1/2\ntablespoons\n(45g)\nunsalted butter\n, melted, cooled slightly, and transferred to a small bowl\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (177°C). Lightly grease an 8-inch anodized aluminum cake pan and\nline with parchment paper\n.\nSerious Eats / Amanda Suarez\nIn a medium bowl, whisk together flour and cornstarch until thoroughly combined. Set a fine-mesh strainer over a medium bowl and sift flour mixture. Repeat to make sure there are no lumps and set aside.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment, whisk eggs and sugar on high speed until mixture is a pale creamy color and has tripled in volume with lots of visible bubbles, about 3 minutes. Reduce speed to medium and continue whisking until mixture is smoother and more velvety in texture (some of the larger bubbles will have disappeared), about 5 minutes. Reduce speed to low and whisk until an extremely silky, smooth, and pourable stable foam forms, about 10 minutes.\nSerious Eats / Amanda Suarez\nPour egg-sugar foam into a large, extra-wide bowl and, using a fine-mesh strainer, sift one-third of the flour mixture on top and add salt. Using a large flat spatula or spoon, fold in the flour mixture using a capital D motion: slice the spatula down through the middle, then guide the spatula back to the top following the perimeter of the bowl. Use your other hand to rotate the bowl a quarter-turn between folds. Continue folding until only a few bits of flour remain, then repeat with the remaining flour mixture, one-third at a time.\nSerious Eats / Amanda Suarez\nAdd 2 to 3 tablespoons of the egg-flour mixture to the bowl with butter and whisk until mixture is homogeneous and emulsified, about 10 seconds; this is your liaison batter. Add half of the liaison batter to the egg-flour mixture and fold in, using motion described above, until thoroughly combined. Repeat with remaining liaison batter.\nSerious Eats / Amanda Suarez\nScrape batter into prepared pan, then lift pan about 8 inches above work surface and drop to break any large bubbles in the batter.\nSerious Eats / Amanda Suarez\nBake until cake is puffed, golden, and pulling away from the sides slightly and a cake tester inserted in the center comes out clean, 25 to 30 minutes (the cake will also bounce slightly when tapped with a finger). Do not open the oven before 20 minutes, or you risk the cake collapsing. Once removed from the oven, lift pan about 8 inches above work surface and drop pan; this helps prevent the cake from shrinking.\nSerious Eats / Amanda Suarez\nInvert cake onto a wire rack and let cool completely in pan, about 1 hour. Once cool, run a butter knife around the sides of the cake to loosen, remove pan and parchment paper, and place cake right side up. Serve as desired.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nKitchen scale, stand mixer with whisk attachment, fine-mesh strainer, 8-inch cake pan\nNotes\nThis genoise recipe can also yield one 9-inch cake or two 6-inch cakes. Lightly grease a 9-inch anodized aluminum cake pan or two 6-inch anodized aluminum cake pans and line with parchment paper. If baking a 9-inch cake, bake for about 20 minutes. If baking two 6-inch cakes, bake for 25 to 30 minutes.\nThe recipe can easily be halved and baked in a lightly greased 8 1/2- by 4 1/2–inch loaf pan lined with parchment paper. Bake cake for 20 to 25 minutes.\nCaster sugar will dissolve most easily into the egg foam but granulated sugar can be substituted. Powdered sugar should not be used because of its starch content, which will throw off the balance of the genoise.\nIf using the genoise sponge as cake layers, use about 4 tablespoons of your preferred soaking syrup per 8-inch cake layer.\nIf doubling this recipe, do not use a stand mixer; it will not fit. Instead, I recommend making the recipe twice. You do not need to clean the stand mixer bowl in between batches.\nMake-Ahead and Storage\nWrapped tightly in plastic, genoise sponge can be stored for 3 days at room temperature, for 1 week in the refrigerator, and for 1 month in the freezer. If frozen, transfer the genoise to the refrigerator and thaw overnight.\nLayer Cake\nThe Latest\nFrench",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/genoise-sponge.webp?"
}