{
  "url": "https://www.seriouseats.com/german-chocolate-cake-recipe-extra-chocolate",
  "image_url": "https://www.seriouseats.com/thmb/ISFNbtyBBcpcKtZyNyaxdub7PsM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__02__20120214-127677-LTE-German-Chocolate-PRIMARY-6c1a20c7a9754e0eacebc9b427a3784c.jpg",
  "tags": [
    "Layer Cake",
    "Chocolate",
    "Coconut"
  ],
  "title": "German Double-Chocolate Cake Recipe",
  "full_text": "German Double-Chocolate Cake Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n90 mins\nCooling Time\n80 mins\nTotal\n2 hrs 20 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nBaking spray\n4\nounces\nsemisweet chocolate\n, finely chopped\n1/3\ncup\nDutch-process cocoa powder\n1\nteaspoon\ninstant espresso powder\n1/2\ncup\nboiling\nwater\n2\ncups\nall-purpose flour\n1\nteaspoon\nbaking powder\n1\nteaspoon\nbaking soda\n1\nteaspoon\nsalt\n8\nounces\n(\n2\nsticks\n)\nunsalted butter\n, at room temperature\n1\ncup\nsugar\n1/2\ncup packed\ndark brown sugar\n3\nlarge\neggs\n, at room temperature\n2\nteaspoons\npure\nvanilla extract\n1\ncup\nbuttermilk\n, at room temperature\nFor the Icing:\n4\nlarge\negg yolks\n1/4\ncup packed\ndark brown sugar\n1/4\ncup\nDutch-process cocoa powder\n1/4\nteaspoon\nsalt\n1\n(\n14-ounce) can\nsweetened condensed milk\n4\nounces\n(\n1\nstick\n)\nunsalted butter\n, cut into\n8\n(1-tablespoon)\npieces\n4\nounces\nbittersweet chocolate\n, finely chopped\n1\nteaspoon\npure\nvanilla extract\n2\ncups\nshredded sweetened coconut\n, toasted (see notes)\n1\ncup\ntoasted pecans\n, coarsely chopped (see notes)\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F. Spray two 9-inch round cake pans with baking spray and line bottoms with parchment paper rounds. Spray once again with baking spray.\nCombine semisweet chocolate, cocoa powder, and espresso powder in medium bowl. Add boiling water and stir until chocolate chips are melted and mixture is thoroughly combined; set aside.\nWhisk together flour, baking powder, baking soda, and salt in medium bowl; set aside.\nBeat butter, sugar, and brown sugar on medium speed until light and fluffy, about 3 minutes. Add eggs, one at a time, beating well after each addition. Add vanilla and beat just to combine.\nAdd chocolate mixture and beat to combine, about 1 minute, scraping down sides and bottom of bowl with rubber spatula as needed. Beat for 1 more minute to thoroughly combine.\nAdd flour mixture in three batches, alternating with buttermilk.\nDivide batter equally between prepared pans and bake until tester inserted in center of cakes comes out clean, 25 to 30 minutes.\nTransfer cakes to cooling rack and cool in cakes pans for 10 minutes. Invert cakes directly onto cooling racks and cool completely, about 1 hour.\nFor the Icing:\nOnce cakes are cool, whisk the yolks, brown sugar, cocoa powder, and salt in large heavy-bottomed saucepan. Whisk in sweetened condensed milk, and 6 tablespoons butter and cook, whisking constantly over medium-high heat until mixture comes to a boil and thickens, 3 to 5 minutes.\nStir in chocolate and cook until completely melted and incorporated. Off heat, stir in vanilla, and 1 cup coconut. Transfer mixture to bowl and cool slightly, about 10 minutes.\nTo Assemble:\nPlace one cake layer on cake stand or platter. With offset spatula or dinner knife, spread half of icing on cake layer, then, sprinkle with half of pecans. Top with second cake layer. Spread remaining icing on top of cake and sprinkle with remaining pecans and coconut. Serve.\nNotes\nTo toast coconut: arrange coconut on rimmed baking sheet and bake at 350°F on middle rack for 10 to 12 minutes until golden. To toast pecans: arrange pecans on rimmed baking sheet and bake at 350°F on middle rack for about 7 minutes until golden and fragrant.\nSpecial Equipment\nTwo 9-inch round cake pans, parchment paper, baking sheet, electric mixer, rubber spatula, cooling rack, large heavy-bottomed saucepan, whisk, offset spatula or dinner knife, whisk\nThis Recipe Appears In\nLet Them Eat: German Double-Chocolate Cake\nLayer Cake\nChocolate\nCoconut",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/german-double-chocolate-cake-recipe.webp?"
}