{
  "url": "https://www.seriouseats.com/german-buttercream-whipped-vanilla-custard-frosting",
  "image_url": null,
  "tags": [
    "Cakes",
    "Dairy Milk"
  ],
  "title": "German Buttercream (Whipped Vanilla Custard Frosting) Recipe",
  "full_text": "German Buttercream (Whipped Vanilla Custard Frosting) Recipe\nJump to recipe\nPrep\n15 mins\nCook\n70 mins\nActive\n45 mins\nChilling\n24 hrs\nTotal\n25 hrs 25 mins\nServes\n56 servings\nMakes\n7 heaping cups\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\nmilk\n,\nany percentage will do\n(about\n1 1/2\ncups\n;\n340\ng\n)\n1\nvanilla\nbean\n, split lengthwise, or other aromatics such as fresh herbs or whole spices\n8\nounces\nsugar\n(about\n1\ncup\nplus\n2\ntablespoons\n;\n225\ng\n)\n1 1/2\nounces\ncornstarch\n(about\n1/3\ncup\n, spooned;\n45\ng\n)\n3\nlarge\neggs\n, straight from the fridge (about\n5 1/4\nounces\n;\n150\ng\n)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\n20\nounces\nunsalted butter\n(\n5\nsticks\n;\n565\ng\n), softened to about 68°F (20°C)\nDirections\nTo Flavor the Milk:\nIn a 3-quart stainless steel saucier, combine milk and split vanilla bean (or other flavorings) over medium heat. When milk is steaming hot, remove from heat, cover, and steep at least 1 hour. Proceed as directed below, or refrigerate up to 24 hours to extract a deeper flavor before proceeding.\nSerious Eats / Vicky Wasik\nTo Make the Custard:\nWhisk sugar and cornstarch together in a medium bowl, followed by eggs.\nSerious Eats / Vicky Wasik\nReturn milk to a simmer and discard vanilla bean after scraping out the flavorful seeds and pulp inside (or remove other flavoring elements, and scrape them as best you can, if possible). Ladle 1/2 cup hot milk into the eggs and whisk to combine. Repeat with two more 1/2-cup additions, then pour the warmed eggs into the pot. Cook over medium heat, whisking constantly, until custard turns thick and lumpy, about 3 minutes (the timing can vary depending on the specifics of your stove and cooking vessel, so adjust the heat accordingly if it seems to move too slow). As soon as custard begins to bubble, set a timer and continue cooking and whisking for exactly 2 minutes longer. This helps neutralize a starch-dissolving protein found in egg yolks.\nSerious Eats / Vicky Wasik\nOff heat, stir in vanilla extract, then pour custard into a large baking dish to speed the cooling process. Press a sheet of plastic against the surface and refrigerate until thick and cool, about 1 hour, or to roughly 68°F (20°C). Alternatively, refrigerate up to 1 week, then stand at room temperature until warmed to roughly 68°F (20°C).\nFor the Buttercream:\nIn the bowl of a stand mixer fitted with a paddle attachment, beat the softened butter on medium speed until fluffy and light, about 5 minutes. Meanwhile, stir the thick pudding in its dish to create a thick, dough-like mass. Add pudding a few tablespoons at a time, one right after the other, then scrape the bowl and beater with a flexible spatula, and beat a few seconds longer.\nSerious Eats / Vicky Wasik\nSwitch to the whisk attachment and whip on medium speed until the buttercream is airy, soft, and light enough to weigh approximately 6 ounces per cup. A heavier weight per cup indicates the frosting is too cool, and/or under-whipped, and will result in a dense, greasy frosting that may seem too sweet. To adjust the frosting's consistency, warm over a water bath until the edges have just begun to melt, then re-whip. For more detailed instructions, consult our\nbuttercream troubleshooting guide\n.\nSerious Eats / Vicky Wasik\nUse buttercream immediately, or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to approximately 72°F (22°C) and re-whip before using.\nSpecial Equipment\nStand mixer\n, flexible spatula, whisk, 3-quart stainless steel saucier\nMake-Ahead and Storage\nUse buttercream immediately, or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.)\nRead More\nHow to Rescue Swiss Buttercream\nTexas Sheet Cake\nCakes\nDairy Milk"
}