{
  "url": "https://www.seriouseats.com/ghana-west-african-peanut-stew-goat-tripe-groundnut-soup",
  "image_url": "https://www.seriouseats.com/thmb/RlxyVRR_JeCXwqZh7J3-RrntUB0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__06__20170511-groundnut-soup-vicky-wasik-2-2-e832005ef69c473f8f45a0a2a91f7775.jpg",
  "tags": [
    "Goat",
    "West African",
    "Braising & Stewing",
    "Beef Liver & Organ Meats",
    "Peanut Butter"
  ],
  "title": "Ghanaian Goat and Tripe Peanut Stew (Groundnut Soup) Recipe",
  "full_text": "Ghanaian Goat and Tripe Peanut Stew (Groundnut Soup) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 hrs 10 mins\nActive\n20 mins\nTotal\n5 hrs 20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(\n225\ng\n)\nbleached honeycomb tripe\n, cut into 2-by-1-inch pieces (see note)\n2\nmedium\nyellow onions\n(about\n12\nounces\n;\n340\ng\n), halved and ends trimmed, divided\n3\ncups\n(\n720\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken broth\n, plus more as needed, divided\n5\nmedium\ncloves garlic\n, divided\n1\nounce\n(\n28\ng\n)\nfresh ginger\n(about a 1-inch knob), divided\n2\nteaspoons\ntomato paste\n1\npound\n(\n454\ng\n)\ngoat stew meat\n, cut into 2- to 3-inch cubes (see note)\n1\nhot chile\npepper\n, such as bird's eye, habanero, or\nScotch bonnet\n(see note)\n2\nbay leaves\n1\ncup\ncreamy peanut butter\n(\n9\nounces\n;\n255\ng\n)\n1\n(28-ounce; 794 g) can\nplum tomatoes\n1\nwhole\nsmoke-dried fish\n, such as tilapia (see note)\nKosher salt\nand freshly ground black pepper\nHot cooked white rice or\nfufu\n, to serve (see note)\nDirections\nRinse tripe under cold running water, squeezing to expel liquid and remove any bleached flavors. Fill a large saucepan two-thirds full of water, salt generously, and bring to a boil over high heat. Add tripe and boil for 10 minutes. Drain and rinse. If the tripe retains a bleached odor, repeat blanching a second time.\nMeanwhile, in a blender, purée 2 onion halves, 1 cup (240ml) chicken stock, 3 cloves garlic, 1/2 ounce ginger, and tomato paste. In a Dutch oven, combine cubed goat and boiled tripe with the purée over medium-low heat. When purée begins to simmer, cover Dutch oven and reduce heat to low. Simmer meat for 30 minutes, stirring occasionally. Add another 1/2 cup (120ml) chicken stock if mixture begins to stick to the bottom of the pot.\nPreheat oven to 250°F (120°C). Add remaining 2 onion halves to Dutch oven, nestling them into the purée. Add remaining 1/2 ounce ginger and 2 cloves garlic, along with hot pepper and bay leaves. Return cover to Dutch oven, reduce heat to low, and cook until halved onion is soft and translucent, about 20 minutes.\nTransfer halved onion, ginger, garlic cloves, and pepper to a blender. Add peanut butter, canned tomatoes and their juices, and remaining 2 cups (480ml) chicken stock and purée until smooth. Pass blended mix through a fine-mesh strainer into Dutch oven, stirring to incorporate, and bring to a simmer. Cover Dutch oven and transfer to oven.\nCook in oven, stirring occasionally and adding chicken stock if mixture reduces by more than one-third, until goat is tender and oils have surfaced, approximately 4 hours. Remove from oven and transfer to stovetop. Add whole smoked fish, reduce heat to low, and cook an additional 5 minutes. (If omitting the fish, you can skip this 5-minute covered-cooking step.) Remove and discard smoked fish and bay leaves, season with salt and pepper to taste, and serve hot over white rice or fufu.\nSpecial equipment\nBlender\n(or\nimmersion blender\n),\nDutch oven\n, large saucepan or saucier,\nfine-mesh strainer\nNotes\nGoat can be found at most halal butcher shops, as well as many supermarkets. For the most tender meat, ask your butcher to cube a forequarter cut, such as shoulder or chuck, preferably from a young spring goat. If you do not wish to include tripe, simply increase the volume of goat by an additional half pound. For a milder dish, cut the pepper in half and remove its seeds. Alternatively, use just half a pepper, or choose a less spicy pepper, such as a jalapeño. Hot-smoked fish is a traditional ingredient in groundnut soup and adds a savory, fishy, smoked undercurrent of flavor to the dish. It can be found in most West African and Caribbean markets, but can be omitted if you're unable to find it or prefer to leave it out.\nFufu\nis a starchy dish made from pounded and boiled cassava root and green plantains.\nGoat\nWest African\nBraising & Stewing\nBeef Liver & Organ Meats\nPeanut Butter"
}