{
  "url": "https://www.seriouseats.com/ghapama-armenian-stuffed-pumpkin-recipe-8401022",
  "image_url": "https://www.seriouseats.com/thmb/r_EdYsNaz6koCEbDYfiZSF_SEPA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231113-SEA-Ghapama-AmandaSuarez-hero2-104723cce1974242b200268a977683d8.jpg",
  "tags": [
    "The Latest",
    "Roasted Vegetables",
    "Vegetable Sides",
    "Vegetable Mains",
    "Rice & Grain Mains"
  ],
  "title": "Ghapama (Armenian Stuffed Pumpkin)",
  "full_text": "Ghapama (Armenian Stuffed Pumpkin)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 30 mins\nRest Time\n15 mins\nTotal\n2 hrs 55 mins\nServes\n6 8\nCook Mode\n(Keep screen awake)\nIngredients\n8\ncups\n(2LI)\nwater\n1\ncup\nlong-grain or basmati\nwhite rice\n(about 7 ounces; 200g)\n1 large sugar or\npie pumpkin\n( 5 to 7 pounds;\n2.26 to 3.18\nkg\n), see notes\n1/2 cup\nslivered almonds\n(2 ounces;\n57\ng\n)\n1/2\ncup\nwalnut\nhalves or pieces (2 ounces; 57g), larger pieces broken up\n6 tablespoons (\n85\ng\n)\nunsalted butter\n1 medium\nyellow onion\n(8 ounces;\n225\ng\n), finely chopped\n2 1/2\nteaspoons\n(8g) Diamond crystal\nkosher salt\n; if using table salt use half as much by volume\n1/4 cup\ndried apricots\n(2 ounces;\n57\ng\n), halved\n1/4\ncup\ndried\ntart cherries\n(1 1/2 ounces; 45g), preferably unsweetened\n1/4\ncup\ndried\nprunes\n(1 1/2 ounces; 45g), halved\n1/4\ncup\ngolden raisins\n(1 1/2 ounces; 45g)\n1/4 cup (\n60\nml)\nhoney\n2\nteaspoons\nchopped flat-leaf\nparsley\nleaves and tender stems\nDirections\nIn a medium saucepan, bring water to boil over high heat. Add rice and return to full boil, stirring occasionally, until rice is al dente, 5 to 7 minutes (there should still be a firm core of undercooked rice in the center of each grain). Drain through a fine-mesh strainer over the sink, then immediately rinse with cold running water until rice is cool and water runs clear, about 1 minute. Set strainer over now empty pot and set aside to drain.\nSerious Eats / Amanda Suarez\nMeanwhile, adjust oven rack to the lower-middle position and heat oven to 350˚F (176℃). Line a rimmed baking sheet with aluminum foil or parchment paper; set aside. Using a paring knife or pumpkin carving knife, remove the top of the pumpkin in one piece by cutting a 3- to 4-inch wide circle around the pumpkin stem to form a lid (see notes). Remove the lid and set aside.\nSerious Eats / Amanda Suarez\nCarefully run knife or edge of a large spoon along the cavity of the pumpkin to loosen seeds and stringy pulp, then use a spoon to scoop them out and scrape the cavity clean. Using the paring knife, scrape seeds and pulp from the lid as well. Discard seeds and pulp or reserve for another use (try roasting the seeds with one of\nour seasoning combinations\nfor a snack). Set pumpkin with lid aside.\nSerious Eats / Amanda Suarez\nIn a large skillet, toast nuts over medium heat until very lightly browned, about 4 minutes. Transfer to a plate. Wipe out skillet, then add butter and melt over medium heat, swirling skillet regularly, until milk solids separate and just begin to brown, 4 to 6 minutes. Remove from heat and let cool slightly.\nSerious Eats / Amanda Suarez\nPour all but 2 tablespoons butter from skillet into a medium bowl; set aside. Add onion and salt to skillet with remaining butter and cook over medium heat, stirring occasionally, until onion is softened and just beginning to brown, 8 to 10 minutes. Transfer to an empty large bowl and set aside.\nSerious Eats / Amanda Suarez\nAdd drained rice to the bowl with onions along with the almonds, walnuts, apricots, cherries, prunes, and raisins.\nSerious Eats / Amanda Suarez\nAdd honey to the reserved browned butter and whisk to combine. Using a brush, coat the insides of the cleaned pumpkin, including the rim and underside of the lid, with the honey-butter mixture (about 1 tablespoon). Pour remaining honey-butter mixture into rice mixture and stir gently until everything is well combined. Scoop rice mixture into the prepared pumpkin and gently pack into pumpkin, leaving about 1 inch headspace from the pumpkin rim. Cover with the pumpkin lid and transfer to the prepared baking sheet.\nSerious Eats / Amanda Suarez\nBake until a paring knife inserted into the side of the pumpkin yields no resistance and the pumpkin begins to slump very slightly, 1 hour 45 minutes to 2 hours.\nSerious Eats / Amanda Suarez\nRemove baking sheet from oven and transfer to a wire rack. Let cool slightly, about 15 minutes.\nSerious Eats / Amanda Suarez\nUsing one or two large spatulas, carefully transfer pumpkin to the center of a large serving platter (see notes). Remove the lid and set aside. Using a paring knife, cut pumpkin through the flesh from top to bottom into eight equal wedges without cutting into filling; make sure to cut all the way to center of base so that wedges can fully separate. Gently allow pumpkin wedges to fall open onto the platter, coaxing them as needed. Mound rice in center of the pumpkin, scooping off any filling stuck to the pumpkin wedges and mounding it onto the rice pile. Sprinkle with parsley and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheet, parchment paper, fine-mesh strainer, wire rack\nNotes\nLook for a pumpkin that is wider than it is tall, if possible, and at least 5 pounds in weight or up to 7 pounds. (If possible, choose one larger rather than smaller, to ensure adequate room to accommodate all of the filling.) There's a chance you will have a small amount of filling left over; you can save it and bake it seperately, covered, in a small vessel, gratin dish, or ramekin to avoid wasting it.\nTo ensure a round circle when removing the pumpkin lid, use a pen or pencil to trace a 3- to 4-inch wide circle, then cut out the circle to form the lid.\nThis onion version leans more savory than sweet. For a sweeter spiced version, omit the onion (and its cooking step) and stir 1 teaspoon cinnamon and 1/4 teaspoon nutmeg into the butter at the end of step 2. Though not traditional, you can also create a version that is both sweet\nand\nsavory by adding this spice mixture to the onions at the end of step 3.\nMake-Ahead and Storage\nGhapama is best made just before serving.\nThe Latest\nRoasted Vegetables\nVegetable Sides\nVegetable Mains\nRice & Grain Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ghapama-armenian-stuffed-pumpkin.webp?"
}