{
  "url": "https://www.seriouseats.com/gimbap-korean-seaweed-rice-rolls",
  "image_url": null,
  "tags": [
    "Korean",
    "White Rice",
    "Snacks & Appetizers"
  ],
  "title": "Kimbap (Korean Seaweed Rice Rolls)",
  "full_text": "Kimbap (Korean Seaweed Rice Rolls)\nJump to recipe\nPrep\n40 mins\nCook\n15 mins\nActive\n60 mins\nTotal\n55 mins\nServes\n6\nto 8 servings\nMakes\n40 pieces\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\n(\n12\n-\nounce\n;\n340\ng\n)\ncucumber\nSea or\nkosher salt\n3\nlarge\neggs\nVegetable oil\n, for greasing the pan\n6\nlong\nstrips\nham\nfor kimbap (each about 1/4 inch or less thick)\n1\nmedium\n(\n8\n-\nounce\n;\n240\ng\n)\ncarrot\n, julienned\n3\nsheets\nflat odeng fishcake\n, cut lengthwise into 1/4-inch strips\n2\nteaspoons\n(\n10\nml\n)\ngrain syrup\nor oligosaccharide syrup (sold as “oligodang” at the Korean markets)\n1\nteaspoon\n(\n5\nml\n)\nsoy sauce\n3\ncups\ncooked\nshort-grain (\nsushi\n)\nrice\n, hot (see note)\n1 1/2\ntablespoons\n(\n22\nml\n)\nsesame oil\n, plus more for brushing\n1 1/2\ntablespoons\ncrushed roasted\nsesame seeds\n6\nsquare\nsheets\ngim\n(sold as\nnori\nin Japanese) for gimbap or sushi\n1\nwhole\ndanmuji\n(\npickled radish\n) or\n6\npre-cut long\ndanmuji sticks\nfor kimbap\n6\nlong\npieces\nKorean\nbraised burdock root\nfor kimbap\n3\nlong\nstrips\nof\nartificial crab meat\n(\nsurimi\nin Japanese), cut in half lengthwise for a total of 6\nDirections\nTrim cucumber ends and cut cucumber in half lengthwise. Using a spoon, scrape out the seeds from each half. Cut each half lengthwise into 3 long strips to make 6 strips total. Place cucumber strips on a plate, sprinkle all over with salt, and toss well to coat. Set aside.\nIn a small bowl, beat eggs with a pinch of salt. Lightly grease a 10-inch nonstick skillet with vegetable oil and heat over medium heat until warmed but not sizzling hot. Add half the egg, swirling to cover entire bottom of pan and cook until egg has just set on top. Using a rubber spatula, carefully free the egg round and transfer to a work surface to cool. Lightly re-grease pan if needed and repeat with remaining egg. Wipe out skillet.\nSerious Eats / Vicky Wasik\nSlice egg into thin strips. Set aside.\nRinse cucumber under cold running water, then pat dry with towels, squeezing gently to remove excess moisture. Using the same skillet, wipe it lightly with more vegetable oil and set over medium-high heat until shimmering. Add cucumber and cook until just slightly softened, about 1 minute. Set aside to cool.\nSerious Eats / Vicky Wasik\nAdd ham strips and cook, gently stirring and tossing, until heated through, 1 to 2 minutes. Set aside to cool.\nSerious Eats / Vicky Wasik\nAdd the carrot to the skillet with a large pinch of salt and cook, stirring and tossing, until crisp-tender, 1 to 2 minutes; if you need to add a little more oil to the pan, you can do so at any point. Set aside to cool.\nSerious Eats / Vicky Wasik\nLower heat to medium. Add fishcake strips to skillet along with oligosaccharide syrup and soy sauce and cook, tossing and stirring, until fishcake has softened, 1 to 2 minutes. Set aside to cool.\nSerious Eats / Vicky Wasik\nIn a large bowl, mix rice with sesame oil, crushed sesame seeds, and 1 teaspoon salt (see note). Divide rice into 6 even portions.\nSerious Eats / Vicky Wasik\nSet a kimbap/sushi rolling mat on a work surface. Set a sheet of nori on top of it. Wearing plastic gloves, place a portion of rice on the seaweed sheet and use both hands to spread it evenly all over, leaving about one or two inches of the sheet exposed at the top edge. Dot a few rice grains along the top edge (they will help it stick together later).\nSerious Eats / Vicky Wasik\nArrange your fillings across the center of the rice: 1 cucumber stick, some egg strips, 1 ham strip, one-sixth of the carrot, some of the fishcake strips, 1 danmuji strip, 1 burdock strip, and 1 crab stick strip.\nSerious Eats / Vicky Wasik\nRoll the bamboo mat up and away from you, curling the seaweed sheet and rice around the fillings; use the fingers of both your hands to hold the filling in place as you roll with your thumbs. Secure the roll with the exposed flap of seaweed sheet. Once the roll is sealed, gently squeeze, pressing gently on the top and sides, to compress the roll slightly and seal the edge; if it doesn't seal well, you can also wet the seaweed at the seam to help it adhere.\nSerious Eats / Vicky Wasik\nRepeat with remaining seaweed sheets, rice, and fillings.\nSerious Eats / Vicky Wasik\nLightly brush rolls with sesame oil and lightly rub a sharp knife blade with it as well. Set 2 rolls next to each other, then slice them both into 1/2 inch thick pieces (it's easier to cut through 2 rolls at once than it is to do one at a time).\nSerious Eats / Vicky Wasik\nServe.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nBamboo kimbap/sushi rolling mat\n, 10-inch\nnonstick skillet\nNotes\nUse a little less water than you'd use for regular mealtime rice. While my standard ratio is usually 1.2 parts water to 1 part rice by volume, I reduce the water to 1.1 parts per 1 part rice, or even a 1 part water to 1 part rice if the rice is more humid (often true of fresh rice). If you are using a pressure cooker or pressure rice cooker, go with a 1:1 ratio.\nDuring the summer months, kimbap can go bad quickly, so I recommend replacing the rice seasoning above with a vinegar marinade which can be made with 1 part water, 1 part rice vinegar, 1 part of sugar, and 1/2 part of salt.\nMake-Ahead and Storage\nThe kimbap are best eaten shortly after making them.\nRead More\nHow to Stock a Korean Pantry: Jeot, Jang, and More Ingredients to Know\nKorean Food 101: Essential Recipes to Know and Love\nHow to Eat Korean Food (Without Embarrassing Yourself)\nMakizushi (Sushi Rolls)\nBibimbap\nKorean\nWhite Rice\nSnacks & Appetizers"
}