{
  "url": "https://www.seriouseats.com/ginger-spice-brownies-recipe-8752578",
  "image_url": "https://www.seriouseats.com/thmb/_fw8a0l-NCQAHthofHWjDAIyHxo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Ginger-Spice-Brownies-Recipe-Hero-Horz-03-b263ab4ff66d4e15b0168fa728d922f6.jpg",
  "tags": [
    "Chocolate",
    "Baking",
    "Desserts",
    "Fall",
    "Winter"
  ],
  "title": "Ginger Spice Brownies",
  "full_text": "Ginger Spice Brownies\nClose\nJump to recipe\nPrep\n35 mins\nCook\n40 mins\nCooling Time\n30 mins\nTotal\n105 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\n(170g; 12 tablespoons)\nunsalted butter\n3\nounces\nfinely chopped\ndark chocolate\n(85g; about 1/2 cup, about 70%\n7\nounces\ngranulated sugar\n(200g; about 1 cup)\n1\nounce\ndark muscovado sugar\n(30g; 2 tablespoons). see note\n3\nlarge\neggs\n, straight from the fridge\n1 1/2\nteaspoons\nvanilla extract\n2\nteaspoons\ngrated peeled\nfresh ginger\n2\nteaspoons\nground ginger\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/2\nteaspoon\nground coriander\n1/2\nteaspoon\nground allspice\n1/2\nteaspoon\nfreshly grated\nnutmeg\n1/2\nteaspoon\ninstant espresso powder\n, such as Medaglia d’Oro (optional)\n1/4\nteaspoon\nground\ncardamom\n1/8\nteaspoon\nground clove\n2 1/4\nounces\nall-purpose flour\n(65g; 1/2 cup)\n2\nounces\nDutch-process cocoa powder\n(60g; about 3/4 cup)\n1 3/4\nounces\ncrystallized ginger\n(50g; 1/2 cup), thinly sliced\nDirections\nAdjust oven rack to middle position and preheat to 350°F (180°C). Line an 8-inch square anodized aluminum baking pan with foil to cover the bottom and two sides, leaving overhang on the sides. If you like, grease lightly with pan spray.\nLiz Voltz\nIn a small stainless steel saucier, melt butter over medium-low heat, stirring occasionally with a heat-resistant spatula. Bring to a simmer, then remove from heat and stir in chocolate; the mixture will seem quite thin. Set aside.\nLiz Voltz\nIn the bowl of a stand mixer fitted with the whisk attachment, combine granulated sugar, muscovado sugar, eggs, vanilla, grated ginger, ground ginger, salt, coriander, allspice, nutmeg, instant espresso (if using), cardamom, and clove. Whip on medium-high until extremely thick and fluffy, about 8 minutes. (The whipping time can vary significantly depending on bowl size, batter temperature, and mixer wattage, so use the visual cues as your primary guide.)\nLiz Voltz\nMeanwhile, in a medium bowl, sift together flour and cocoa powder. When the egg mixture is fluffy and thick, reduce speed to low and pour in the warm chocolate-butter mixture. Once it is incorporated, add flour-cocoa mixture all at once and continue mixing until roughly combined. Finish with a flexible spatula, scraping and folding to ensure batter is well mixed from the bottom up.\nLiz Voltz\nPour into prepared pan and tap firmly on the counter to even out the batter. Top with an even layer of crystallized ginger. Bake until brownies are glossy and just barely firm, about 35 minutes, or to an internal temperature of 205°F (96°C). (Take care that the probe is inserted at a sharp angle to avoid touching the bottom of the pan.) The timing of this recipe is based on anodized aluminum and will vary significantly with glass, ceramic, or nonstick pans, materials that will also affect the brownies' consistency.\nLiz Voltz\nTransfer pan to a wire rack to cool so that the crumb of the brownies can set, about 30 minutes. Slide a butter knife between the brownies and the sides of the pan that aren’t lined with foil; gently tug on the foil, then lift to remove the brownies from the pan. Cut into sixteen 2-inch squares. Serve or transfer to an airtight container with a sheet of wax paper between layers, and store for up to 1 week at room temperature.\nLiz Voltz\nSpecial Equipment\n8- by 8-inch anodized aluminum pan, stand mixer, wire rack\nMake-Ahead and Storage\nStored in an airtight container, with a sheet of wax paper between the layers, the brownies will keep about 1 week at room temperature.\nNotes\nMuscovado sugar is sold in many grocery stores; we prefer it for its rich molasses flavor and moisture content. If you cannot find muscovado sugar, dark brown sugar is a great substitute.\nChocolate\nBaking\nDesserts\nFall\nWinter",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ginger-spice-brownies.webp?"
}