{
  "url": "https://www.seriouseats.com/gluten-fre-corn-cookies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MZ7Zqo4w7luCaH_GznigXMxkqfc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__08__20140821-GlutenFree-Corn-Cookies-Elizabeth-Barbone-ad43d95b8d9e4fe3b81185dfdf19b52e.jpg",
  "tags": [
    "Cookies",
    "Gluten-free Desserts",
    "Baking",
    "Cornmeal"
  ],
  "title": "Buttery Gluten-Free Corn Cookies Recipe",
  "full_text": "Buttery Gluten-Free Corn Cookies Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\nAbout 30 mins\nChilling and Cooling Time\n2 hrs 15 mins\nTotal\n3 hrs\nServes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\ncups\n(\n5\nounces\n)\nwhite rice flour\n, plus more for dusting\n2/3\ncup\n(\n2.2\nounces\n)\nfreeze-dried corn powder\n(see note)\n1/2\ncup\n(\n2\nounces\n)\ncorn flour\n(see note)\n1 1/2\nteaspoons\nkosher salt\n3/4\nteaspoon\nbaking powder\n1/4\nteaspoon\nbaking soda\n2\nsticks\n(\n8\nounces\n)\nunsalted butter\nat room temperature (see note)\n1 1/2\ncups\n(\n10 1/2\nounces\n)\ngranulated sugar\n1\nlarge\negg\nDirections\nWhisk together white rice flour, corn powder, corn flour, baking powder, baking soda, and salt in a medium bowl. Set aside.\nCombine butter and sugar in the bowl of a stand mixer fitted with the paddle. Beat at medium-high speed for 2 minutes. Turn off mixer and scrape down the bottom and side of the bowl and the paddle with a rubber spatula. Add egg mix at medium-high speed until very light and airy, about 7 minutes. Scrape down the bottom and side of the bowl and the paddle attachment once more.\nAdd the dry ingredients and turn mixer to medium-low speed. Mix until dough comes together, about 1 minute. Scoop the dough using a #40 cookie scoop (about 1 1/2 tablespoons each) onto a parchment-lined rimmed baking sheet. Using the bottom of a drinking glass dusted with white rice flour, press down lightly on each cookie to flatten. Wrap the baking sheet tightly in plastic and refrigerate for at least 2 hours and up to 3 days.\nCenter oven rack in middle position and preheat oven to 350°F. Line two rimmed baking sheets with parchment paper. Place 6 dough balls about 4 inches apart on one of the parchment-lined baking pans.\nBake until cookies are golden brown, about 15 minutes. Allow cookies to cool on for 5 minutes. Using a metal spatula, transfer cookies to wire rack to cool completely. Store cookies in an airtight container for up to 4 days. Repeat with remaining batter, alternating baking sheets between each batch so that you are always baking on a cool sheet. Store cookies in airtight container on the counter for up to four days.\nSpecial Equipment\nRimmed baking sheet, cookie scoop\nThis Recipe Appears In\nHow to Make Buttery-Sweet Gluten-Free Corn Cookies\nCookies\nGluten-free Desserts\nBaking\nCornmeal",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/buttery-gluten-free-corn-cookies-recipe.webp?"
}