{
  "url": "https://www.seriouseats.com/gluten-free-brown-butter-chocolate-chip-cookies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/S0iqjV-Xixu0R_bvYs7ktr17NbQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120313-196516-BrownButterCCCookies_Recipes-138f2e51ca684061b104340e8db73794.jpg",
  "tags": [
    "Cookies",
    "Gluten-free",
    "Baking",
    "Chocolate"
  ],
  "title": "Gluten-Free Brown Butter Chocolate Chip Cookies Recipe",
  "full_text": "Gluten-Free Brown Butter Chocolate Chip Cookies Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n35 mins\nCooling Time\n10 mins\nTotal\n50 mins\nServes\n24 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\n(\n1 1/2\nsticks\n)\nbutter\n5\nounces\n(about\n1 1/4\ncups\n)\nwhite rice flour\n2 3/4\nounces\n(about\n1/2\ncup\n)\nsweet rice flour\n1\nounce\n(about\n1/4\ncup\n)\ncornstarch\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nsalt\n6\nounces\n(about\n3/4\ncup\n) packed\ndark brown sugar\n1/4\ncup\ngolden\nsyrup\n2\nlarge\negg yolks\n2\ncups\ngluten-free\nchocolate chips\nDirections\nAdjust oven rack to center position and preheat oven to 325°F. Line rimmed baking sheet with parchment paper and set aside.\nIn small pot over medium-low heat, melt butter. Stir occasionally. After foam subsides, watch butter until milk solids turn golden brown, about five minutes. Remove pot from heat and allow butter to cool. While butter cools, whisk together white rice flour, sweet rice flour, cornstarch, baking soda, and baking powder in medium bowl.\nIn bowl of stand mixer fitted with paddle attachment, combine brown sugar, golden syrup, and cooled brown butter. Mix on medium speed to combine. Stop mixer. Add dry ingredients. Turn mixer on to medium. Blend until a thick dough forms. Dough will be dry. Add egg yolks. Blend until smooth dough forms. Stop mixer. Add chocolate chips. Turn mixer to low. Mix until chocolate chips are incorporated.\nDrop dough, about one tablespoon each, onto prepared baking sheet. Space dough about two inches apart. Bake until edges are just set and cookies are faintly golden brown, about 13 minutes. (For softer and chewier cookies, bake until cookies are just set.) Remove cookies and allow to cool on baking sheet for two minutes. Transfer cookies to wire rack to cool completely. Repeat with remaining dough.\nCookies\nGluten-free\nBaking\nChocolate"
}