{
  "url": "https://www.seriouseats.com/gluten-free-fried-chicken-japanese-ideas-in-food-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Dw_5HJpBiswVifDIqcCUyml3-yg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__08__20150819-gluten-free-fried-chicken-ideas-in-food-vicky-wasik-2-f6cefb2e0e0d4eb4b0d74e4150297232.jpg",
  "tags": [
    "Recipes By Diet",
    "Japanese",
    "Gluten-free Mains",
    "Fried Chicken",
    "Chicken Thighs"
  ],
  "title": "Japanese-Style Fried Chicken Thighs (Gluten-Free Karaage) Recipe",
  "full_text": "Japanese-Style Fried Chicken Thighs (Gluten-Free Karaage) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n16 mins\nActive\n45 mins\nMarinating Time\n12 hrs\nTotal\n12 hrs 26 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(120g)\nbuttermilk\n2\n-\ninch\npiece\nfresh ginger\n, peeled and thinly sliced\n2\ngarlic\ncloves\n, thinly sliced\n3\nscallions\n, white and green parts, thinly sliced\n2\ntablespoons\n(33g)\ngluten-free soy sauce\n1\ntablespoon\n(14g)\nAsian sesame oil\n1 tablespoon (\n13\ng\n)\nlight brown sugar\n1/4 teaspoon (\n1.5\ng\n)\nfine sea salt\n6\nmedium\nchicken thighs\n(about 2 1/4 pounds or 1kg)\n3\ncups\n(552g)\npotato starch\nRice bran oil\nor peanut oil for deep-frying\nDirections\nPut buttermilk, ginger, garlic, scallions, soy sauce, sesame oil, brown sugar, and salt in a medium bowl and whisk until smooth.\nLay one chicken thigh skin side down on a cutting board, with the bone running vertically, and use a sharp paring knife to cut down the center to the bone, from top to bottom. Gently slide the knife horizontally to the left to butterfly the meat, being careful not to cut all the way through it. Carefully open the flap and lightly score the meat in a crosshatch pattern, being careful not to cut all the way through the meat. Repeat on the right side of the thigh. Add the thigh to the bowl with the marinade and repeat with the remaining 5 thighs.\nSerious Eats / Aki Kamozawa\nMix the thighs and marinade together, coating each piece thoroughly. Transfer the meat and marinade to a large zipper-lock bag, press out as much air as possible, and seal the bag. Put the bag in a shallow bowl in the refrigerator and marinate for 12 to 24 hours, turning the bag occasionally to distribute the marinade evenly.\nPreheat the oven to 200°F (95°C). Line a baking sheet with parchment paper. Set a wire rack on another baking sheet. Put the potato starch in a large bowl.\nRemove one chicken thigh from the marinade, brushing off any pieces of garlic, ginger, or scallion, and add to the potato starch. The marinade clinging to the chicken will help the starch adhere to the meat. Roll the thigh in the potato starch, coating it thoroughly, then put it on the parchment-lined baking sheet. Repeat with the remaining thighs. Then, beginning with the first thigh, dredge each one a second time in the potato starch and return it to the parchment-lined pan.\nSerious Eats / Vicky Wasik\nSet a large cast iron skillet on the stovetop and add 1 1/2 inches of oil. Heat over medium-high heat until the oil reaches 375°F (190°C). Once the oil has come to temperature, add 2 or 3 chicken thighs to the skillet, depending on its size (be careful not to crowd the pan), and fry for about 8 minutes, until the bottom sides are golden brown. Flip the thighs and cook for another 8 minutes, or until they are a deep golden brown on the other side. Transfer to the rack set over the baking sheet and slide into the oven to keep warm. Fry the remaining chicken thighs, transferring them to the oven as they are done. If not serving immediately, turn off the oven and prop the oven door open a crack so that the thighs remain warm and crisp.\nSerious Eats / Vicky Wasik\nPut the fried chicken on a platter and serve family style, with your favorite accompaniments.\nSpecial Equipment\nRimmed baking sheets\n, parchment paper,\nwire rack\n, large\ncast iron skillet\nor chicken fryer,\ninstant-read thermometer\nRead More\nJapanese-Style Karaage (Fried Chicken)\nThe Best Korean Fried Chicken\nGluten-Free Fried Chicken Strips\nExtra-Crispy Fried Chicken With Caramelized Honey and Spice\nThe Best Buttermilk-Brined Southern Fried Chicken\nRecipes By Diet\nJapanese\nGluten-free Mains\nFried Chicken\nChicken Thighs"
}