{
  "url": "https://www.seriouseats.com/gluten-free-graham-crackers-recipe",
  "image_url": "https://www.seriouseats.com/thmb/d5Y5XGv1CWTeU4LYKSbggatYph0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100608GrahamCrackers1A-8e815f49dc8b43878aac2f8eb5ce5cf0.JPG",
  "tags": [
    "Cookies",
    "Baking"
  ],
  "title": "Gluten-Free Tuesday: Graham Crackers Recipe",
  "full_text": "Gluten-Free Tuesday: Graham Crackers Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n15 mins\nTotal\n50 mins\nServes\n12 graham crackers\nCook Mode\n(Keep screen awake)\nIngredients\nDry Ingredients:\n1 1/2\ncups\nbrown rice flour\n1/2\ncup\ncornstarch\n1/3\ncup\ndark brown sugar\n1\nteaspoon\nbaking powder\n1/2\nteaspoon\nsalt\nWet Ingredients:\n5\ntablespoons\nbutter\n, cold\n6\ntablespoons\nmilk\n3\ntablespoons\nhoney\nDirections\nPreheat oven to 350°F. In the bowl of a food processor, combine dry ingredients. Pulse to combine. (If you don't have a food processor, whisk dry ingredients together in a medium mixing bowl.)\nAdd the butter. Pulse until flour mixture is coarse. No large pieces of butter should remain. (Or cut cold butter into flour mixture with a pastry cutter, two knives or by rubbing the butter between your fingers.)\nAdd milk and honey. Pulse until dough forms. (Or stir using a wooden spoon.)\nTurn dough out onto a lightly rice floured piece of 12x16 parchment paper.\nPat dough into a rectangle. Dust the top of the dough lightly with rice flour.\nPlace another piece of 12-by-16-inch parchment paper on top of the dough. Roll dough out until it covers all of the paper. Dough rectangle will be about 1/8 inch thick.\nCarefully remove top piece of parchment paper.\nTransfer dough, with bottom parchment paper, to a 12 x 18 baking pan.\nUsing a pizza wheel, score the dough into rectangles. (The rectangles should be 6 x 2 3/4 inches large for \"standard\" graham crackers and 3 by 2 3/4 for a \"s'more\" size graham cracker.) The graham crackers will break apart after baking. Do not worry if the dough seems to still be touching after scoring with the pizza wheel.\nPrick dough all over with a fork.\nChill dough for 10 minutes.\nBake for 15 minutes or until evenly brown.\nRemove graham crackers from the pan and place on a wire rack to cool. (I slide the parchment, with the crackers, directly onto the cooling rack.)\nAllow crackers to cool completely. Break along scored lines.\nCookies\nBaking",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gluten-free-tuesday-graham-crackers-recipe.webp?"
}