{
  "url": "https://www.seriouseats.com/gluten-free-all-day-lemon-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/vFhq1hBtSFHuAk2_S___8v-GfMM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__20140710-GlutenFree-AllDay-LemonCake-ElizabethBarbone-b16b654618c741f0af3da8fc3c852edc.jpg",
  "tags": [
    "Cakes",
    "Gluten-free Desserts",
    "Sheet Cake",
    "Lemon"
  ],
  "title": "Gluten-Free All-Day Lemon Cake (With a Choice of Two Toppings) Recipe",
  "full_text": "Gluten-Free All-Day Lemon Cake (With a Choice of Two Toppings) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nActive\n10 mins\nTotal\n50 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nNonstick cooking spray\n1 1/4\ncups\n(\n5\nounces\n) brown or\nwhite rice flour\n3/4\ncup\n(\n6\nounces\n)\ngranulated sugar\n1/4\ncup\n(\n1\nounce\n)\ntapioca starch\n2\nteaspoons\nbaking powder\n1/2\nteaspoon\ntable\nsalt\n1\ncup\nbuttermilk\n1\ntablespoon\ngrated lemon zest\nfrom\n2 to 3\nlemons\n1/2\ncup\nvegetable oil\n2\nlarge\neggs\nOption 1: Simple Syrup Glaze\n3/4\ncup\ngranulated sugar\n2\ntablespoons\nzest\nand\n6\ntablespoons\nfresh juice\nfrom about\n4 to 6\nlemons\nOption 2: Powdered Sugar Icing\n1 1/3\ncups\npowdered sugar\n, sifted\n2\ntablespoons\nfresh juice from\n1\nlemon\nDirections\nAdjust oven rack to middle position. Preheat oven to 350°F. Spray an 8-inch square baking pan with nonstick cooking spray.\nIn large mixing bowl, whisk together rice flour, granulated sugar, tapioca starch, baking powder, and salt. In a measuring cup or a small bowl, whisk together buttermilk and lemon zest. Pour buttermilk mixture over dry ingredients. Whisk in vegetable oil and eggs until smooth.\nPour batter into prepared cake pan. Bake until a cake tester inserted into center of cake comes out clean, about 30 minutes.\nOption 1: Simple Syrup Glaze\nMeanwhile, if making the Simple-Syrup Glaze, combine granulated sugar, lemon zest, and lemon juice in a small saucepan. Bring to a boil over medium-high heat, stirring gently until sugar dissolves. Reduce heat to low and cook syrup until it thickens slightly, about 5 minutes. Remove from heat and set aside.\nWhile cake is still warm, poke it all over with a fork. Brush top of cake with syrup and allow to absorb fully, about 5 minutes. Repeat until all syrup is absorbed.\nOption 2: Powdered Sugar Glaze\nIf making Powdered Sugar Glaze, allow cake to cool completely. In small bowl, combine powdered sugar and lemon juice. Stir with a fork until smooth. Icing should be thick but spreadable; if the icing is too thick, add a little more lemon juice. Spread icing on cake and allow to set for 15 minutes before serving.\nStore cake, covered, on the counter for up to 3 days.\nNotes\nSelect one glaze to finish the cake. The simple syrup glaze changes the texture of the cake a little, making it damp, while the powdered sugar icing leaves the coffee cake-like texture intact. If desired, toss together 1 cup washed berries, like blueberries, with 1 tablespoon white rice flour. Stir coated berries into the finished batter and bake as directed.\nSpecial Equipment\n8-inch square baking pan\nThis Recipe Appears In\nGluten-Free All Day Lemon Cake With a Choice of Toppings\nCakes\nGluten-free Desserts\nSheet Cake\nLemon",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gluten-free-all-day-lemon-cake-with-a-choice-of-two-toppings-recipe.webp?"
}