{
  "url": "https://www.seriouseats.com/gluten-free-flour-power-potato-bread-recipe",
  "image_url": "https://www.seriouseats.com/thmb/WIIAZ5pHEYhLmHHtZPIHlc8b-Ng=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__08__20150801-gluten-free-potato-bread-4-a9a08b1be3974fbc81849c70e45f122d.jpg",
  "tags": [
    "Yeast Breads",
    "Recipes By Diet",
    "Gluten-free"
  ],
  "title": "Gluten-Free Potato Bread Recipe",
  "full_text": "Gluten-Free Potato Bread Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 25 mins\nActive\n30 mins\nCooling and Rising Time\n5 hrs 40 mins\nTotal\n8 hrs 15 mins\nServes\n16\nto 18 servings\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\n10 1/2\nounces\n(\n300\ng\n)\nrusset potato\n(\n1\nlarge\nor\n2\nmedium\n), peeled, quartered, and thinly sliced\n1 1/2\ncups\n(\n337.5\ng\n)\nwater\n1 1/4\nteaspoons\n(\n7.5\ng\n)\nfine sea salt\n1\ncup\n(\n260\ng\n)\nwhole milk\n2\nteaspoons\n(\n6\ng\n)\ninstant yeast\n1\ntablespoon\n(\n12.5\ng\n)\nsugar\n6\nlarge\neggs\n4 2/3\ncups\n(\n600\ng\n)\ngluten-free flour blend\nDirections\nPut potatoes, water, and 1/4 teaspoon of salt in a medium saucepan and bring to a simmer over medium heat, then turn heat down and cook potatoes until fork-tender, about 15 minutes. Transfer potatoes and their liquid to a bowl and let cool.\nAdd remaining 1 teaspoon salt, milk, yeast, and sugar to potatoes and stir to combine. Put potato mixture and eggs in a blender. Turn blender on low, gradually increase speed to medium-high, and purée until mixture is smooth, about 30 seconds.\nTransfer potato mixture to bowl of a stand mixer fitted with paddle attachment (or use a hand mixer), add flour, and mix on low until all of potato mixture has been absorbed by flour. Increase speed to medium-high and beat until dough appears smooth and elastic, about 30 seconds. Use a rubber spatula to scrape dough into a clean bowl. Cover with plastic wrap and let it rise for 2 1/2 hours, until not quite doubled.\nGrease a 13- by 4- by 4-inch pain-de-mie or Pullman loaf pan and lid. Use a rubber spatula to stir dough together and then transfer it to prepared loaf pan. Cover loosely with plastic wrap and let rise until it reaches top of pan, about 2 hours. Meanwhile, 1 hour before baking, preheat oven to 400°F (200°C).\nRemove plastic wrap from pan and slide lid into place. Bake bread for 45 minutes. Turn heat down to 350°F (180°C) and bake for 30 minutes more.\nTurn heat down to 300°F (150°C). Remove top of pan and bake bread uncovered for 20 minutes.\nRemove bread from oven and invert it onto a rack set over a baking sheet. Lift off pan and bake bread for 10 more minutes. The internal temperature should be 210° to 212°F (99° to 100°C). Turn off oven, open door, and let bread cool on rack for 30 minutes.\nRemove bread from oven, transfer to a rack, and let cool to room temperature completely before cutting.\nSpecial Equipment\n13- by 4- by 4-inch pain-de-mie or Pullman loaf pan with lid,\nblender\n,\nstand mixer\nMake Ahead and Storage\nWell-wrapped, bread will keep at cool room temperature for up to a week.\nYeast Breads\nRecipes By Diet\nGluten-free",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gluten-free-potato-bread-recipe.webp?"
}