{
  "url": "https://www.seriouseats.com/gluten-free-angel-food-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MWnGMs43rgejy_pPENknqdzDb6s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160426-gluten-free-angel-food-cake-vicky-wasik--3-7d367b2b769243bd895fdcdf9a8b58f0.jpg",
  "tags": [
    "Cakes",
    "Gluten-free Desserts",
    "Baking"
  ],
  "title": "The Ultimate Gluten-Free Angel Food Cake Recipe",
  "full_text": "The Ultimate Gluten-Free Angel Food Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nActive\n15 mins\nCooling Time\n2 hrs\nTotal\n3 hrs\nServes\n12\nto 14 servings\nMakes\n1 tube cake\nCook Mode\n(Keep screen awake)\nIngredients\n2\nounces\ntapioca flour\nor arrowroot starch (about\n1/2\ncup\n;\n56\ng\n)\n1 1/2\nounces\nwhite rice flour\n(about\n1/3\ncup\n;\n42\ng\n)\n1 1/2\nounces\ncornstarch\n(about\n1/3\ncup\n;\n42\ng\n)\n1\nounce\ncoconut flour\n(about\n1/4\ncup\n;\n28\ng\n)\n1\nteaspoon\n(\n4\ng\n)\nbaking powder\n15\nounces\ncold\negg whites\n(about\n2\ncups\n;\n425\ng\n), from\n12\nlarge\neggs\n15\nounces\ngranulated sugar\n(about\n2\ncups\n;\n425\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nvanilla extract\n1\nounce\nfreshly squeezed lemon juice\n(\n2\ntablespoons\n;\n30\nml\n), from\n1\nsmall\nlemon\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\nDirections\nAdjust oven rack to the middle position and preheat to 350°F (180°C). Sift tapioca flour or arrowroot starch, white rice flour, cornstarch, coconut flour, and baking powder into a large bowl. Whisk together until homogeneous, then sift mixture one more time to ensure total uniformity prior to mixing.\nCombine egg whites, sugar, and vanilla extract in the bowl of a stand mixer fitted with the whisk attachment. Mix on low to loosen, about 1 minute, then increase to medium-low (4 on a KitchenAid) and whip 3 minutes; the whites will be dense and dark.\nWith the mixer still running, add lemon juice and salt. Immediately increase to medium (6 on a KitchenAid) and whip 3 minutes more; the meringue will be thin but foamy. Increase to medium-high (8 on a KitchenAid) and continue whipping until the meringue is glossy white and thick enough that you can see the pattern left by the wire whisk. This can take between 2 and 4 minutes, depending on the freshness of the whites and the horsepower of your mixer. When meringue is ready, it should be soft enough to run off the wires when the whisk attachment is removed, but thick enough to mound up on itself like soft-serve in the bowl.\nSprinkle flour blend on top and stir with a flexible spatula to roughly combine. Switch to a folding motion, scraping from the bottom up and folding through the center, until no pockets of flour remain. Scrape batter into a 10-inch aluminum tube pan (do not butter or grease pan); if you notice any small pockets of unincorporated flour, simply pause to mix them in. Bake until the cake is puffed, golden blond, and firm to the touch, about 45 minutes, or to an internal temperature of 206°F.\nInvert pan onto its stilts, over the neck of a wine bottle, or onto a trio of cans (see note) and cool upside down until absolutely no trace of warmth remains, at least 2 hours. Slide an offset spatula around the sides of cake to loosen, remove the insert, and slide spatula under the bottom as well. Flip onto a serving plate, pulling gently on the sides of cake to release it from the center tube. To serve, cut with a chef's knife, using a gentle sawing motion and only the slightest downward pressure. In an airtight container, leftovers will keep up to a week at room temperature.\nNotes\nThe success of this recipe depends on a delicate balance of protein and starch, both strong and weak. Do not expect similar results with a different blend of flours and starches.\nIf your tube pan does not have stilts for inverted resting and cannot rest over the neck of a wine bottle, before you begin to bake, set up a trio of cans of the same height to suspend the tube pan on. The cans should be arranged so that the inverted pan just rests on their edges (the cake will rise above the top of the pan).\nSpecial Equipment\nStand mixer, flexible spatula, 10-inch aluminum tube pan, offset spatula\nThis Recipe Appears In\nHow to Make Angel Food Cake Even Better: Go Gluten-Free\nCakes\nGluten-free Desserts\nBaking"
}