{
  "url": "https://www.seriouseats.com/gluten-free-potato-gnocchi-recipe",
  "image_url": "https://www.seriouseats.com/thmb/d_Socc2GNHSJSmbARRG-hLS5jkU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__06__20120626-211763-GFTues-GnocchiHowTo12-9657b9f3a71c43de82705b89b2c5c1a8.jpg",
  "tags": [
    "Gnocchis",
    "Italian",
    "Russet Potatoes",
    "Pasta Mains"
  ],
  "title": "Gluten-Free Potato Gnocchi Recipe",
  "full_text": "Gluten-Free Potato Gnocchi Recipe\nClose\nJump to recipe\nPrep\n45 mins\nCook\n65 mins\nActive\n60 mins\nTotal\n110 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nrusset potatoes\n, washed\n1\ncup\nwhite rice flour\n1/2\ncup\nsweet rice flour\n2\nlarge\neggs\nKosher salt\nDirections\nAdjust oven rack to center position and preheat oven to 400°F (205°C). Pierce potatoes a few times with a knife and place on a baking sheet. Roast until tender, about 1 hour. Remove potatoes from oven and allow to cool.\nWhisk together white rice flour and sweet rice flour. Using the flour mixture, flour your counter. Peel potatoes and pass through a potato ricer onto the counter. Whisk together eggs and 1 teaspoon salt. Pour over potatoes. Work egg mixture into potatoes with a bench scrapper or fork until potatoes begin to hold together. Mixture will be sticky.\nSerious Eats / Elizabeth Barbone\nWork 1 cup of flour mixture into potato mixture. Start by working flour into potato mixture with a bench scrapper or fork. As soon as a dough begins to form, begin kneading dough by hand until all the flour is incorporated. The dough should be firm and not sticky. If it is, add remaining flour mixture, about 1/4 cup at a time. (You can test the dough by boiling a small pot of water and cooking a small piece. The gnocchi dough should hold together.)\nSerious Eats / Elizabeth Barbone\nDivide dough into quarters. Then, as you work with it, cut each quarter in half. Cover remaining dough with a damp paper towel. Roll out each dough eighth into a log. Cut into bite-size pieces. Shape by either pressing a small indentation into each gnocchi or rolling the gnocchi over a fork or gnocchi board.\nSerious Eats / Elizabeth Barbone\nTransfer shaped gnocchi to a lightly white rice-floured baking sheet. Shaped gnocchi can either be frozen (see Make-Ahead and Storage below) or cooked right away.\nTo Cook:\nBoil a large pot of salted water. Cook half the fresh or frozen gnocchi in boiling water until they float, about 4 minutes. (Taste one gnocchi to ensure it is cooked through). Remove gnocchi from water with a skimmer and transfer to a bowl or pot of sauce. Repeat with remaining gnocchi. If gnocchi must be held for more than a moment, drizzle with oil and toss to prevent sticking.\nSpecial Equipment\nPotato ricer\nMake-Ahead and Storage\nTo freeze gnocchi, place the baking sheet of uncooked gnocchi directly in the freezer. Once the gnocchi are frozen, transfer to a plastic freezer bag. Gnocchi may be frozen for up to two months. Cook as directed below.\nSeveral batches of gnocchi may be prepared at one time and frozen. Doubling the recipe, however, makes it hard to work with the dough. So it's a good idea to make two or more batches of dough individually instead of doubling the recipe.\nRead More\nGnocchi Alla Bava (Potato Gnocchi With Fontina Cheese Sauce)\nGnocchi Alla Sorrentina (Baked Gnocchi With Tomato and Mozzarella)\nLight and Tender Potato Gnocchi With Sage-Butter Sauce\nGnocchis\nItalian\nRusset Potatoes\nPasta Mains"
}