{
  "url": "https://www.seriouseats.com/gluten-free-strawberry-shortcakes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uJyIkaEkQXh1LhLwndyK4RhG7WM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__04__20140429-291057-GFTues-Shortcakes-54795c026493465e86368eea1d21af4c.jpg",
  "tags": [
    "Cakes",
    "Gluten-free Desserts",
    "Strawberry",
    "Summer Desserts"
  ],
  "title": "Gluten-Free Strawberry Shortcakes Recipe",
  "full_text": "Gluten-Free Strawberry Shortcakes Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n30 mins\nResting Time\n70 mins\nTotal\n105 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Shortcakes:\n1 1/3\ncups\nwhite rice flour\n, plus more for dusting\n2/3\ncup\npotato starch\n1/4\ncup\nplus\n1\ntablespoon\ngranulated sugar\n, divided\n1\ntablespoon\nplus\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nxanthan gum\n7\ntablespoons\nunsalted butter\n, 6 tablespoons cut into small cubes and chilled, and 1 tablespoon melted\n2\nlarge\nhard-boiled egg yolks\npushed through a fine mesh strainer, whites reserved for another use\n3/4\ncup\nheavy cream\nor\nhalf-and-half\nFor the Toppings:\n1\nquart\nstrawberries\n, hulled and sliced\n1/4\ncup\nplus\n1\ntablespoon\ngranulated sugar\n2\nteaspoons\nvanilla extract\n, divided\n1\ncup\ncold\nheavy cream\nDirections\nFor the Shortcakes:\nIn large bowl, whisk together white rice flour, potato starch, 1/4 cup of the sugar, baking powder, and xanthan gum. Add cubed butter and, using either your hands or a pastry cutter, cut into flour mixture until pea-sized pieces form. Add egg yolks and continue cutting until flour mixture resembles coarse crumbs. Stir in heavy cream with a wooden spoon until incorporated. Let dough stand for 5 minutes.\nGenerously dust work surface with white rice flour. Turn dough onto work surface and dust with more white rice flour. Gently knead the dough a few times, then pat into a large rectangle, about 1 inch thick. Using a 2-inch round cutter, cut out four dough rounds. Gather up dough scraps, pat into a 1-inch-thick rectangle, and cut out 4 more dough rounds; discard remaining dough scraps. Place dough rounds on a parchment-lined baking sheet and brush the tops with remaining 1 tablespoon melted butter. Sprinkle remaining 1 tablespoon granulated sugar on top. Cover with plastic wrap and refrigerate for 1 hour.\nMeanwhile, for the Toppings:\nStir together strawberries, 1/4 cup granulated sugar, and 1 teaspoon vanilla extract. Using the back of a fork, gently mash a few of the sliced strawberries. Allow strawberries to stand for 1 hour.\nIn medium bowl, whip heavy cream until soft peaks form. Add remaining 1 tablespoon granulated sugar and 1 teaspoon vanilla extract, and beat until stiff peaks form.\nAdjust oven rack to center position and preheat oven to 350°F (175°C). Remove plastic wrap from baking sheet and bake shortcakes until edges just turn golden brown, about 12 minutes. Let shortcakes cool on baking sheet for 5 minutes, then transfer to a wire rack. Serve shortcakes warm or at room temperature, topping with macerated strawberries and whipped cream.\nSpecial equipment\n2-inch round cutter\nCakes\nGluten-free Desserts\nStrawberry\nSummer Desserts"
}