{
  "url": "https://www.seriouseats.com/gluten-free-fig-bars-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rwnvLeDD9_2gEnJim6aWRymrYPA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__20140515-292901-GFTues-Fig20Newtons20610-05fcaf112bc94ab69a66139d749b4ef9.jpg",
  "tags": [
    "Dessert Bars",
    "Gluten-free Desserts",
    "Baking",
    "Fig"
  ],
  "title": "Gluten-Free Fig Bars Recipe",
  "full_text": "Gluten-Free Fig Bars Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nActive\n90 mins\nChilling and Cooling Time\n2 hrs 5 mins\nTotal\n2 hrs 50 mins\nServes\n24 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookie:\n1 1/2\ncups\n(\n6\nounces\n)\nbrown rice flour\n, plus more for dusting\n1/2\ncup\n(\n2\nounces\n)\ncornstarch\n1/4\ncup\n(\n1\nounce\n)\nsweet rice flour\n1\nteaspoon\nbaking soda\n1/2\nteaspoon\nxanthan gum\n1/2\nteaspoon\ntable\nsalt\n1/4\ncup\n(\n2\nounces\n)\nvegetable shortening\n1/4\ncup\n(\n1 3/4\nounces\n)\ngranulated sugar\n1/4\ncup\n(\n2 1/2\nounces\n)\ndark brown sugar\n2\nlarge\neggs\n1/4\nteaspoon\norange oil or\n1/4\nteaspoon\nfinely grated\norange zest\nfrom\n1\nwhole\norange\nFor the Filling:\n14\nounces\ndried mission figs\n(see note)\n1/4\ncup\nwater\n3\ntablespoons\nlight corn syrup\n2\ntablespoons\nfreshly squeezed lemon juice\nfrom\n1\nwhole\nlemon\n1/2\nteaspoon\ntable\nsalt\nDirections\nFor the Cookie:\nIn medium mixing bowl, whisk together brown rice flour, cornstarch, sweet rice flour, baking soda, xanthan gum, and salt. In bowl of stand mixer fitted with paddle attachment, beat together vegetable shortening, granulated sugar, and brown sugar at medium-high speed until well combined, about 30 seconds. Add eggs, one at a time, and mix at medium speed for 30 seconds. Scrape down sides of bowl, then mix for an additional 15 seconds. With mixer off, add dry ingredients and orange oil, then mix at medium-low speed until a dough forms.\nGenerously dust work surface with brown rice flour. Turn dough out onto counter and pat into a round. Wrap with plastic wrap and refrigerate for at least two hours or overnight.\nMeanwhile, For the Filling:\nIn bowl of food processor, combine figs, water, corn syrup, lemon juice, and salt. Pulse until a thick paste forms. Filling should be thick but yield when pressed with the back of a spoon. If filling is too firm, blend in an additional teaspoon or two of water until it is soft enough to pipe. Transfer filling to a large pastry big fitted with a 1/2-inch round tip.\nPreheat oven to 350°F. Remove dough from the refrigerator and cut into six equal pieces. Line a rimmed baking sheet with parchment paper. Set a 12- by 18-inch piece of parchment paper on your work surface. Dust the parchment generously with brown rice flour. Center one of the dough pieces on the parchment and dust generously with brown rice flour. Roll dough into a 10- by 4 1/2-inch strip, using a pizza wheel to trim edges.\nPipe fig filling evenly down the center of the dough strip. Run a thin metal spatula between the dough and parchment to loosen the dough. Fold the dough edges over the filling, pressing down lightly to seal. Lift the dough log off the parchment and transfer, seam side down, to the prepared baking sheet. Repeat with remaining dough and filling.\nBake fig bars in center of the oven until set and just starting to turn golden brown, about 15 minutes. Remove pan from oven and cut cookies, using a sharp knife, into 2-inch pieces. Allow cookies to cool for 5 minutes. Transfer cookies to a container with a lid, separating layers with pieces of parchment paper. Store for 24 hours before serving.\nSpecial Equipment\n1/2-inch round pasty-bag tip, large pastry bag, pizza wheel\nThis Recipe Appears In\nHow to Make Gluten-Free Fig Bars\nDessert Bars\nGluten-free Desserts\nBaking\nFig"
}