{
  "url": "https://www.seriouseats.com/goetta-recipe-11694309",
  "image_url": "https://www.seriouseats.com/thmb/0VnnUAmdGabIy54PBxDqZzZ7d5M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250304-SEA-Goetta-QiAi-Beauty3-32-d8b97adf5afb419195f6faf8938fac35.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Pork",
    "Midwestern",
    "Homemade Sausages"
  ],
  "title": "Goetta (German-American Breakfast Sausage)",
  "full_text": "Goetta (German-American Breakfast Sausage)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n5 hrs\nResting Time:\n10 hrs\nTotal\n15 hrs 15 mins\nServes\n20\nto 25\nMakes\n3 8.5-by-4.5-inch loaf pans\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n3-pound\n; 1.36 Kg)\nbone-in pork\nshoulder\n, fat cap trimmed to 1/2-inch thick (see notes)\n1\nlarge\nonion\n(\n10\nounces\n;\n284\ng\n), roughly chopped\n3\nstalks\ncelery\n, roughly chopped\n2\nbay leaves\n2 1/2\ncups\n(\n400\ng\n) pinhead or steel-cut\noats\n1 1/2\ntablespoons\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\nfreshly\nground black pepper\n1 1/2\nteaspoons\ndried ground\nsage\n1\nteaspoon\nMSG\n(optional)\nNeutral oil,\nsuch as vegetable oil or bacon fat for pan-frying goetta slices\nDirections\nAdjust oven rack to middle position and preheat the oven to 350℉ (175℃). In a large pot or Dutch oven, add pork, onion, celery, and bay leaves and cover with 10 cups (2.37 L) of water. Bring to a boil on the stovetop over high heat, then cover pot, transfer to oven, and cook until pork is falling off the bone, 2 1/2 to 3 hours.\nSerious Eats / Qi Ai\nUsing a spider skimmer or large slotted spoon and tongs, transfer pork, onion, and celery to a large bowl. Discard bay leaves. Let meat cool slightly. Reserve cooking liquid, adding water, if necessary, to total 8 cups. (Discard or reserve any excess.) Using 2 forks, roughly shred meat, discarding any large pieces of fat or gristle. Then, using a food processor or meat grinder, grind pork, onion, and celery into small pieces.\nSerious Eats / Qi Ai\nReturn meat mixture to reserved cooking liquid in pot. Stir in oats, salt, pepper, dried ground sage, and MSG, if using, and bring to a boil over high heat. Transfer to oven and cook, uncovered, stirring to prevent sticking and burning every 30 minutes for the first hour, then every 15 minutes for the second hour, until mixture becomes a thick paste and stirring takes some effort, about 2 hours total.\nSerious Eats / Qi Ai\nLine three 9- by 5-inch or 8 1/2- by 4 1/2 -inch loaf pans with parchment paper, or lightly grease them. Fill each pan with goetta mixture (about 4 cups per pan), pressing it down as firmly as possible to remove any air pockets. Use a spatula to smooth the top.\nSerious Eats / Qi Ai\nLet filled pan cool to room temperature, 1 to 2 hours, then cover with an airtight lid or plastic wrap and refrigerate for at least 10 hours to allow goetta to set completely.\nSerious Eats / Qi Ai\nTo pan-fry and serve, run a knife around edges of pan to loosen the meatloaf, then invert and remove goetta from loaf pan and cut into 1/2-inch thick slices. In a large skillet, add 1 tablespoon oil or another fat (try bacon fat, if you have it) and heat over medium-high heat until shimmering. Add desired number of goetta slices, lower heat to medium, press lightly with a spatula, and cook without moving, until browned and crisped on one side, 7 to 10 minutes. For the crispiest possible goetta, drizzle a little more oil on top, then flip and continue to cook until browned on the second side, 5 to 7 minutes (The goetta slices will be delicate. Handle them carefully!) Serve.\nSerious Eats / Qi Ai\nSpecial Equipment\nLarge pot or Dutch oven, food processor or meat grinder, parchment paper, three 9- by 5-inch or 8 1/2- by 4 1/2 -inch loaf pans (disposable pans are OK), large skillet\nNotes\n2 pounds boneless pork shoulder with 1 ham hock may be substituted for the 3 pounds bone-in pork shoulder.\nMake-Ahead and Storage\nGoetta can be refrigerated in an airtight container for up to 4 days or frozen for up to 6 months. For easier thawing, slice the goetta before freezing, separating the slices with wax paper and wrapping them tightly with plastic wrap. If frozen, thaw completely in the refrigerator before cooking.\nBreakfast & Brunch\nThe Latest\nPork\nMidwestern\nHomemade Sausages"
}