{
  "url": "https://www.seriouseats.com/golfeados-venezuelan-sticky-buns-recipe",
  "image_url": "https://www.seriouseats.com/thmb/bKNO2_fq5pQbWbSwbN9mjSw_OpQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__11__20111118-127677-Dulces-Golfeados-PRIMARY-dc857b42a0f94047b79d8dcb5807db41.jpg",
  "tags": [
    "Breakfast & Brunch",
    "Venezuelan",
    "Yeast Breads"
  ],
  "title": "Golfeados (Venezuelan Sticky Buns) Recipe",
  "full_text": "Golfeados (Venezuelan Sticky Buns) Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nActive\n60 mins\nRising Time\n2 hrs\nTotal\n3 hrs 5 mins\nServes\n12 buns\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n3/4\ncup\nwarm milk\n(110°F to 115°F; 43°C to 46°C)\n2\n(\n1/4-ounce packages\n)\nactive dry yeast\n1/4\ncup\nsugar\n2\ntablespoons packed\ndark brown sugar\n3\ncups\nall-purpose flour\n, plus additional for dusting counter and rolling pin\n1\nteaspoon\nsalt\n2\nlarge\neggs\n, at room temperature, lightly beaten\n1\ntablespoon\nhoney\n1\nteaspoon\npure\nvanilla extract\n4\ntablespoons\n(\n2\nounces\n)\nunsalted butter\n, softened\n1\ntablespoon\naniseed\nVegetable oil\nfor greasing bowl\nFor the Filling:\n8\nounces\nLatin American firm white cheese\n, finely grated (see notes)\n1/2\ncup packed\ndark brown sugar\n1\nteaspoon\nground cinnamon\n1\nteaspoon\naniseed\n4\ntablespoons\n(\n2\nounces\n)\nunsalted butter\n, softened\nFor the Melado (Glaze):\n1 1/2\ncups packed\ndark brown sugar\n1\ncup\nwater\nDirections\nFor the Dough:\nCombine 1/4 cup milk, yeast, and 1/4 teaspoon sugar in small bowl. Let stand until mixture foams, 5 to 10 minutes.\nCombine remaining sugar, dark brown sugar, flour, and salt in large bowl. Add remaining milk, eggs, honey, vanilla, and yeast mixture and mix on low speed with hook attachment until ingredients are combined, about 2 minutes.\nAdd butter and aniseed and mix on medium speed until a smooth, shiny dough forms, 6 to 8 minutes.\nLightly oil a large bowl. Place dough in bowl, cover with clean, damp kitchen towel and let rise in a warm place until doubled in size, about 1 hour.\nFor the Filling:\nMeanwhile, combine all but 2 tablespoons cheese, dark brown sugar, cinnamon, and aniseed in medium bowl. Cover with plastic wrap and refrigerate until needed.\nLightly dust a clean, dry work surface with flour. Coat hands lightly with flour (dough will be sticky) and transfer to work surface. Lightly rub rolling pin with flour. Roll the dough out to into a 16- by 14-inch rectangle.\nBrush the dough with butter, leaving a 1/2-inch border on all sides. Sprinkle the buttered area with cheese mixture.\nBeginning with the long side, roll the dough to form a 16-inch-long log. As you roll, brush off excess flour with a clean, dry pastry brush.\nCut the log crosswise into 12 rolls. Arrange rolls on a parchment lined baking sheet, cut-side up. Press down to gently flatten (the rolls will cinch as you cut them).\nCover with oiled plastic wrap and allow to rise in a warm place until doubled in size, about 1 hour.\nAdjust oven rack to middle position and preheat oven to 350°F. Bake 20 minutes until golden.\nFor the Melado (Glaze):\nWhile the golfeados are baking, combine brown sugar and water in medium saucepan. Bring to boil over medium-high heat, stirring until sugar is completely dissolved. Reduce heat to medium and cook syrup until thickened, syrupy, and reduced to 1 1/2 cups, 5 to 7 minutes. Remove from heat.\nAfter golfeados have been baking for 20 minutes, brush them with half the melado and return to oven for 10 minutes.\nTransfer baking sheet to cooling rack and brush golfeados with remaining melado. Cool about 10 minutes and sprinkle with remaining cheese. Serve warm.\nSpecial equipment\nelectric mixer with dough hook attachment, rolling pin, parchment paper, large baking sheet, cooling rack, medium saucepan, pastry brush, plastic wrap\nThis Recipe Appears In\nDulces: Golfeados (Venezuelan Sticky Buns)\nBreakfast & Brunch\nVenezuelan\nYeast Breads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/golfeados-venezuelan-sticky-buns-recipe.webp?"
}