{
  "url": "https://www.seriouseats.com/gong-bao-ji-ding-sichuan-kung-pow-chicken-recipe",
  "image_url": "https://www.seriouseats.com/thmb/yaDen7ZSdzT5DsqkRSNNk66jGjY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220310-gong-bao-ji-ding-sichuan-kung-pow-chicken-recipe-liz-voltz-hero-horz-2-b60d0e1fcccf47bf8ee5de027f5cd889.JPG",
  "tags": [
    "Chinese",
    "Chicken Breast",
    "Chicken Stir-Fry",
    "Chicken Mains",
    "Quick Dinners"
  ],
  "title": "Gong Bao Ji Ding (Sichuan Kung Pao Chicken) Recipe",
  "full_text": "Gong Bao Ji Ding (Sichuan Kung Pao Chicken) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n15 mins\nTotal\n15 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n2 small\nboneless skinless chicken breasts\n, about 12 ounces (\n340\ng\n) total, cut into 1/2-inch cubes\n2 teaspoons (\n10\nml\n)\nlight soy sauce\n(see note)\n2 teaspoons (about\n5\ng\n)\ncornstarch\n1\nteaspoon\n(5 ml)\nShaoxing wine\n(see note)\n1\nlarge\npinch\nkosher salt\nFor the Sauce:\n2\ntablespoons\n(30ml)\nChinkiang vinegar\n(see note)\n1 tablespoon (\n15\nml\n)\nhoney\n1\ntablespoon\n(15ml)\nShaoxing wine\n2 teaspoons (\n10\nml\n)\nlight soy sauce\n(see note)\n1/2 teaspoon (about\n2\ng\n)\ncornstarch\n1/4\ncup\nwater or\nhomemade\nor store-bought\nlow-sodium chicken stock\n, as needed\nFor the Stir-Fry:\n3 tablespoons (\n45\nml\n)\nvegetable oil\n6\nto 12\nsmall\ndried red chiles\n(such as árbol), stems removed, cut into 1/2-inch pieces with scissors, seeds discarded\n1 teaspoon (about\n2\ng\n) Sichuan\npeppercorns\n, reddish husks only (stems and black seeds discarded)\n4\nmedium\ncloves garlic\n, thinly sliced\n1\n-\ninch\nknob\nginger\n, peeled and cut into fine matchsticks or grated\n6\nmedium\nscallions\n, white and pale green parts only, cut into 1/2-inch pieces\n3/4 cup\nroasted peanuts\n(about 5 ounces;\n150\ng\n)\nDirections\nFor the Chicken:\nCombine chicken, soy sauce, cornstarch, wine, and salt in a small bowl and turn until well mixed and chicken is evenly coated in a thin film of the cornstarch paste. Set aside.\nSerious Eats / Liz Voltz\nFor the Sauce:\nCombine vinegar, honey, wine, soy sauce, and cornstarch in a small bowl. Stir together with a fork until no clumps of cornstarch remain.\nSerious Eats / Liz Voltz\nTo Stir-Fry:\nPour a small amount of oil into the bottom of a large wok or skillet and rub around with a paper towel. Place over high heat and preheat until smoking. Add remaining oil and immediately add chiles and Sichuan peppercorns. Stir-fry until fragrant but not burnt, about 5 seconds. Immediately add chicken and stir-fry until there are no longer pink spots on the exterior (chicken will still be raw in center at this stage), 45 seconds to 1 1/2 minutes.\nSerious Eats / Liz Voltz\nAdd garlic and ginger and stir-fry until fragrant, about 10 seconds. Add scallions and peanuts and stir-fry for 30 seconds.\nSerious Eats / Liz Voltz\nAdd sauce and stir-fry until all the ingredients are coated evenly and the chicken is cooked through, about 1 minute, adding water 1 tablespoon at a time if necessary to keep the sauce from clumping. Serve immediately with steamed white rice.\nSerious Eats / Liz Voltz\nSpecial Equipment\nWok\nNotes\nYou can use dry sherry in place of the Shaoxing wine.\nYou can find Chinkiang vinegar online or use Chinese black vinegar or even balsamic vinegar in its place.\nLight soy sauce is typically thinner and saltier than the dark soy sauce used in some Chinese recipes. You might find bottles of low-sodium soy sauce labeled “light.” That is not what you’re looking for in this recipe. You can use Japanese shoyu or tamari in its place if you can’t find Chinese light soy sauce.\nSichuan peppercorns can be found in most Asian markets or ordered online.\nThis recipe serves 2 as a main course. Trying to double the recipe will lead to poor results as you won’t be able to maintain enough heat to sear the chicken. If you want to double the recipe, cook the chicken and vegetables in two separate batches, following the recipe through the end of Step 5 and transferring the cooked chicken and vegetables to a large bowl on the side. When you’re ready to finish, add all of the cooked chicken and vegetables (both batches) back to the wok over high heat, stir in the double batch of sauce, and toss until coated. You can also cook this recipe in a large Western-style skillet, though the flavor will not be quite the same.\nRead More\nWok Skills 101: Stir-Frying Basics\nKung Pao Popeye (Kung Pao Chicken Made with Popeye's Chicken Nuggets) Recipe\nCrispy Kung Pao Tofu Recipe\nChinese\nChicken Breast\nChicken Stir-Fry\nChicken Mains\nQuick Dinners",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gong-bao-ji-ding-sichuan-kung-pao-chicken-recipe.webp?"
}