{
  "url": "https://www.seriouseats.com/goong-pad-nam-prik-pao-5248460",
  "image_url": "https://www.seriouseats.com/thmb/lc7Y0xDjqajZryhp5I8uD2YAiQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220131-shrimp-stir-fry-vicky-wasik-hero-e706b37354324f8e9d1299239c49b628.jpg",
  "tags": [
    "Thai",
    "Seafood Mains",
    "Shrimp",
    "Stir-Fry",
    "The Latest"
  ],
  "title": "Goong Pad Nam Prik Pao (Thai Stir-Fried Shrimp With Chile Jam)",
  "full_text": "Goong Pad Nam Prik Pao (Thai Stir-Fried Shrimp With Chile Jam)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Stir-Fry Sauce:\n2\ntablespoons\n(\n45\ng\n)\nhomemade\nor store-bought\nnam prik pao\n(Thai chile jam)\n1\ntablespoon\n(\n15\nml\n) Thai\noyster sauce\n1\ntablespoon\nplus\n2\nteaspoons\n(\n25\nml\n) Thai\nlight soy sauce\n1\nteaspoon\n(\n10\ng\n)\ntamarind paste\n2\nteaspoons\n(\n10\ng\n)\nsugar\n2\ntablespoons\n(\n30\nml\n)\nwater\nPinch\nof\nkosher salt\nFor the Stir-Fry:\n12\nlarge\nshrimp\n(about\n8\nounces\n;\n225\ng\n), peeled and deveined\nKosher salt\n6\nsmall\ngarlic cloves\n(\n25\ng\n), thinly sliced\n2 to 3\nfresh Thai chiles\n(\n2 to 3g\ntotal), stemmed (see note)\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n4\nounces\n(\n120\ng\n)\noyster mushrooms\n, firm central stems removed, mushroom caps separated, large caps torn by hand vertically into smaller pieces\n1/4\nsmall\nyellow onion\n(\n40\ng\n), sliced 1/4-inch thick (see note)\n2\nlong beans\n(about\n30\ng\n), ends trimmed, cut crosswise into 1-inch pieces\n2\nscallions\n, green parts only, cut crosswise into 1-inch pieces (about\n10\ng\ntotal)\n1/2\npacked cup\n(about\n1/2\nounce\n;\n15\ng\n) fresh sweet basil leaves (a.k.a.\nThai basil\n)\nCooked jasmine rice\n, for serving\nDirections\nFor the Stir-Fry Sauce:\nIn a small bowl, stir together nam prik pao, oyster sauce, light soy sauce, white sugar, water, and salt until well combined. Set aside.\nSerious Eats / Vicky Wasik\nFor the Stir-Fry:\nIn a small bowl, combine shrimp with a pinch of salt and mix to evenly coat. Set aside.\nSerious Eats / Vicky Wasik\nCombine garlic, chiles, and a pinch of salt in a granite mortar and pestle and pound until a rough paste forms, about 20 seconds. Set aside.\nSerious Eats / Vicky Wasik\nHeat a wok over high heat until lightly smoking. Add oil and swirl to coat. Add shrimp and spread in an even layer. Cook undisturbed until rosy orange in color on one side, about 30 seconds. Using a wok spatula, flip shrimp and continue to cook until rosy orange in color on second side and shrimp are nearly cooked through, about 20 seconds longer.  Transfer shrimp to a medium bowl, leaving residual oil in the wok.\nSerious Eats / Vicky Wasik\nReturn wok to high heat until smoking, add mushrooms, and toss to evenly coat with oil. Use wok spatula to spread mushrooms into an even layer and cook without moving them until mushrooms are lightly browned on bottom side, about 45 seconds. Add the garlic-chile mixture and stir to combine. Cook, stirring constantly, until fragrant, about 30 seconds. Add onion, and continue to cook, stirring frequently, until onion is slightly softened, about 1 minute. Immediately transfer mushroom mixture to the bowl with the shrimp.\nSerious Eats / Vicky Wasik\nAdd stir-fry sauce to wok and cook until sauce is slightly reduced and thickened, about 45 seconds. Add long beans along with the shrimp and mushroom mixture. Cook, stirring constantly, until the sauce has been absorbed, about 30 seconds. Remove from heat, add scallions and sweet basil, and stir until well-combined and basil is slightly wilted. Serve immediately with cooked jasmine rice.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nGranite mortar and pestle\n,\ncarbon steel wok\n,\nwok spatula\n.\nNotes\nYou can adjust the spiciness of this dish to your taste by reducing or increasing the amount of fresh Thai chiles in the recipe.\nSince this stir fry pushes the limit of what I recommend cooking in a wok at once, especially on a home stove top, if you'd like to double it, I suggest cooking the components in multiple batches.\nMake-Ahead and Storage\nStored in an airtight container, the stir-fry sauce will keep for about 2 weeks in the refrigerator.\nThai\nSeafood Mains\nShrimp\nStir-Fry\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/goong-pad-nam-prik-pao-thai-stir-fried-shrimp-with-chile-jam.webp?"
}