{
  "url": "https://www.seriouseats.com/gougeres",
  "image_url": "https://www.seriouseats.com/thmb/ddeAORa18AF80XOtptZhQFKaRwo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201210-choux-gougeres-vicky-wasik-2-4-204873092b4e472cb23ca7abbe8a6972.jpg",
  "tags": [
    "Savory",
    "French",
    "Pastries",
    "Gruyere",
    "Easter Side Dishes"
  ],
  "title": "Gougères (Choux Pastry Cheese Puffs)",
  "full_text": "Gougères (Choux Pastry Cheese Puffs)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n35 mins\nCooling Time\n30 mins\nTotal\n80 mins\nServes\n10 servings\nMakes\n20 gougères\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(235g) water or\nmilk\n(see note)\n6\ntablespoons\n(85g)\nunsalted butter\n, cut into roughly 1/2-inch cubes\n1/2\nteaspoon\n(2g)\nDiamond Crystal kosher salt\n; for table salt use half as much by volume or the same weight\n4 1/2 ounces (\n128\ng\n)\nall-purpose flour\n, sifted\n4\nlarge\neggs\n4 ounces (\n115\ng\n) finely\ngrated Gruyère cheese\n, plus more for sprinkling\nPinch\nfreshly grated nutmeg\nPinch\nfreshly ground black pepper\nEgg wash made from\n1\nlarge\negg\nwhisked with 1 tablespoon (15ml) water; or nonstick cooking spray\nDirections\nIn a 3-quart stainless-steel saucier or saucepan, combine water (or milk), butter, and salt.\nSerious Eats / Vicky Wasik\nSet over high and and cook until liquid comes to a rolling boil and butter has fully melted, about 2 minutes (the small butter cubes should be fully melted just about at the same time the liquid hits a strong boil).\nSerious Eats / Vicky Wasik\nRemove from heat and add flour. Using a wooden spoon or stiff silicone spatula, thoroughly mix in flour until no lumps remain (make sure to hunt down and smash out any stubborn ones).\nSerious Eats / Vicky Wasik\nReturn saucepan to medium-high heat and cook, stirring very frequently, until dough registers 175°F (80°C) on an instant-read thermometer; if you don't have a thermometer, other signs the dough is ready include a thin starchy film forming all over the inside of the saucier and the dough pulling together into a cohesive mass.\nSerious Eats / Vicky Wasik\nTo use a stand mixer:\nTransfer dough to a stand mixer fitted with the paddle attachment and beat at medium speed until dough registers 145°F (63°C) on an instant-read thermometer (you need the dough cool enough that it doesn't cook the eggs when they're added).\nSerious Eats / Vicky Wasik\nAdd eggs one at a time, making sure each is fully beaten into the dough before adding the next; it can help to start the mixer at medium-low speed for the first egg and then increase the speed to medium once the choux batter begins to develop.\nSerious Eats / Vicky Wasik\nScrape down sides of mixer bowl, then add Gruyère, nutmeg, and black pepper. Mix at medium speed just until cheese and seasonings are fully incorporated, about 10 seconds.\nSerious Eats / Vicky Wasik\nTo finish dough by hand:\nLet dough cool in saucepan, stirring frequently, until it registers 145°F (63°C) on an instant-read thermometer. Add eggs 1 at a time, stirring well between additions until each egg is fully incorporated before adding the next, until a smooth, shiny paste forms. Mix in cheese, nutmeg, and black pepper until well combined.\nSerious Eats / Vicky Wasik\nScrape gougères batter into a pastry bag fitted with 1/2-inch pastry tip. At this point, the batter can be held in the sealed pastry bag at room temperature for up to 2 hours.\nSerious Eats / Vicky Wasik\nTo Bake:\nAdjust oven rack to middle position and preheat oven to 400°F (205°C). Line a rimmed baking sheet with parchment paper (see note). If desired, pipe a dab of gougères batter under each of the 4 corners of the parchment to secure it in place.\nSerious Eats / Vicky Wasik\nPipe gougères batter onto parchment paper in 1 1/2-inch mounds. You should have enough batter to pipe 20 gougères.\nSerious Eats / Vicky Wasik\nUsing a moistened finger, gently press down any pointy tips on the mounds to smooth them out.\nSerious Eats / Vicky Wasik\nUsing a pastry brush, gently brush a light layer of egg wash on each mound, being careful not to let excess egg wash drip down onto the parchment. Alternatively, spray mounds lightly with nonstick cooking spray.\nSerious Eats / Vicky Wasik\nSprinkle a pinch of grated Gruyère on top of each mound, pushing down very gently to ensure it adheres to the surface.\nSerious Eats / Vicky Wasik\nBake until gougères are puffed, deeply golden brown, and feel hollow when lifted, 20 to 25 minutes. Turn off oven, crack the door open, and let stand for 30 minutes to dry and fully set the crust.\nSerious Eats / Vicky Wasik\nGougères are best served while still warm; if they cool down too much before serving, briefly reheat in a 350°F (175°C) oven before serving.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart saucier\nor\nsaucepan\n,\nstand mixer\n,\nrimmed baking sheet\n,\nparchment paper\n,\npastry bag and tip\nNotes\nWater or milk work in this recipe. Because of the richness of the cheese in the choux pastry, water is more than sufficient here; milk, meanwhile, will lead to deeper browning during baking.\nIf you want to make sure that each puff is the right size, you can prepare a template ahead of time. Take one sheet of parchment paper and, using a 1 1/2-inch round cutter as a guide, trace circles with a pencil, then flip paper upside down and set it on the baking sheet.\nMake-Ahead and Storage\nThe baked gougères can be refrigerated in an airtight container for up to 3 days or, wrapped tightly in plastic and kept in an airtight container, they can be frozen for up to 1 month. To refresh refrigerated or frozen gougères, transfer to a baking sheet and reheat in a 350°F (175°C) oven until crisp, about 5 minutes.\nRead More\nPommes Dauphine Recipe\nCheesy Papillons Recipe\nEmpanadas de Queso (Argentine Cheese Empanadas) Recipe\nCream Puffs Recipe\nChoux au Craquelin Recipe\nSavory\nFrench\nPastries\nGruyere\nEaster Side Dishes"
}