{
  "url": "https://www.seriouseats.com/graham-cracker-crust",
  "image_url": "https://www.seriouseats.com/thmb/yRqyaF5ACVA-P6wUqogZ0CA5cx8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20170526-no-bake-cheesecake-vicky-wasik-25-a9d56a9f485e41bc8cac513ceabd2074.jpg",
  "tags": [
    "Pies",
    "American",
    "No-Cook Desserts"
  ],
  "title": "Graham Cracker Crust Recipe",
  "full_text": "Graham Cracker Crust Recipe\nClose\nJump to recipe\nPrep\n10 mins\nActive\n10 mins\nTotal\n10 mins\nServes\n12 servings\nMakes\n1 pie or tart crust (see note)\nCook Mode\n(Keep screen awake)\nIngredients\n8 3/4\nounces\n(about\n2\ncups\n;\n250\ng\n)\ngraham cracker crumbs\n, store-bought or homemade (see note)\n2 1/2\nounces\n(about\n5\ntablespoons\n;\n70\ng\n)\nunsalted butter\n, melted and cooled\nKosher salt\n, to taste\nDirections\nIn a medium bowl, combine crumbs, melted butter, and a pinch of salt to taste, folding with a flexible spatula until the crumbs are fully moistened.\nScrape into a 9-inch pie plate or tart pan, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup; this will naturally push the crumbs up the sides of the pan.\nKeep pressing until the crumbs are in a compact, even layer across the bottom and sides of the pan. Use as directed in your recipe of choice.\nSpecial equipment\nflexible spatula, 9-inch pie plate or tart pan\nNotes\nTo make graham cracker crumbs from whole crackers, place graham crackers in food processor bowl and pulse until into fine crumbs, 10 to 12 pulses. Alternatively, you can place the crackers in a zipper-lock bag and crush into fine crumbs with a rolling pin.\nIf using a springform pan, lightly grease the pan first, then wrap the bottom piece in foil before assembly, and tear away the excess so the pan sits flat. If using a traditional cake pan, lightly grease the pan and line the bottom with a\nparchment round\n. For both, compress the moistened crumb mixture into an even layer along the bottom of the pan, then proceed with the recipe of your choice.\nFeel free to swap the graham cracker crumbs with an equal volume of store-bought or\nhomemade\nBiscoff cookies for a deeply spiced caramel flavor.\nMake-Ahead and Storage\nWrapped in plastic, the crust can be refrigerated for up to 2 days.\nPies\nAmerican\nNo-Cook Desserts"
}