{
  "url": "https://www.seriouseats.com/grape-sorbet-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8UFcGnCkP1dQIU42zGeagDhVg8c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__10__20121004-scooped-grape-sorbet-5fec9587d8854b6c8cb6841400d7b99f.jpg",
  "tags": [
    "Sorbets",
    "Grape",
    "Summer Desserts"
  ],
  "title": "Grape Sorbet Recipe",
  "full_text": "Grape Sorbet Recipe\nClose\nJump to recipe\nPrep\n5 mins\nActive\n40 mins\nChurning/Freezing Time\n5 hrs 30 mins\nTotal\n5 hrs 35 mins\nServes\n6 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(about\n5\ncups\n) rinsed\ngrapes,\nsuch as\nConcord\nor Niagara\n2/3\ncup\nsugar\n1/4\nteaspoon\nkosher salt\nLemon juice\nto taste, starting with\n1/8\nteaspoon\nDirections\nPlace whole grapes in blender or food processor and pulse just until they liquify but the skins do not break down, about 10 seconds. Pour through a fine-mesh strainer into a work bowl, pressing down on skins and seeds with a spoon to release juices; you should have about 2 1/2 cups of purée.\nWhisk in sugar and salt until dissolved, then taste. If too sweet, add lemon juice 1/8th teaspoon at a time. Chill base in refrigerator until very cold, 2 to 3 hours.\nChurn in ice cream maker according to manufacturer's instructions. Transfer sorbet to freezer and chill until firm, at least 3 hours.\nNotes\nThe best grapes for this sorbet are small flavorful ones like Concord or Niagara. You can use seeded or seedless varieties in this recipe. Only purée grapes long enough to liquify them, which will keep their skins more intact for easier straining.\nSpecial Equipment\nBlender or food processor, ice cream maker\nThe best grapes for this sorbet are small flavorful ones like Concord or Niagra. You can use seeded or seedless varieties in this recipe. Only purée grapes long enough to liquify them, which will keep their skins more intact for easier straining.\nSorbets\nGrape\nSummer Desserts"
}