{
  "url": "https://www.seriouseats.com/grasshopper-ice-cream-pie",
  "image_url": "https://www.seriouseats.com/thmb/OoVwEKJdqvhlyXczlw_qeWx18Dc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__01__20171220-grasshopper-pie-vicky-wasik-27-4c4caae638d94435af69047cdea1a9fb.jpg",
  "tags": [
    "Pies",
    "Stovetop",
    "Chocolate",
    "Heavy Cream",
    "Thanksgiving Desserts"
  ],
  "title": "Upgraded Grasshopper Ice Cream Pie",
  "full_text": "Upgraded Grasshopper Ice Cream Pie\nClose\nJump to recipe\nPrep\n90 mins\nCook\n40 mins\nActive\n60 mins\nChilling\n6 hrs\nTotal\n8 hrs 10 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n24\nchocolate sandwich cookies\n(\n9.7\nounces\n;\n270\ng\n),\nhomemade\nor store-bought\n2\ntablespoons\nmelted\nunsalted butter\n(\n1\nounce\n;\n30\ng\n)\n2\ntablespoons\nheavy cream\n(\n1\nounce\n;\n30\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume\nFor the Filling:\n4\nlarge\neggs\n3/4\ncup\nsugar\n(\n5 1/4\nounces\n;\n150\ng\n)\n1/4\ncup\nFernet Branca\n(\n2\nounces\n;\n60\ng\n); see note\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume\n1/4 to 1/2\nteaspoon\npeppermint extract\n, to taste (see note)\n1 to 3\ndrops\ngreen food coloring\n(optional)\n1 1/2\ncups\nheavy cream\n(\n12\nounces\n;\n310\ng\n)\n4\nounces\n(\n110\ng\n)\ndark chocolate\n, melted\nFor the Fudge Topping:\n1\ncup\nsugar\n(\n7\nounces\n;\n200\ng\n)\n1/2\ncup\ncocoa nibs\n(\n2\nounces\n;\n60\ng\n)\n2\ntablespoons\nmolasses\n(\n1\nounce\n;\n30\ng\n), not blackstrap\n1/4\ncup\ngrapeseed oil\nor any other neutral oil (\n1 1/2\nounces\n;\n40\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume\n1/2\nteaspoon\nvanilla extract\n1/2\ncup\nheavy cream\n(\n4\nounces\n;\n110\ng\n), cold\nAdditional\nwhipped cream\nand melted chocolate for garnish (optional)\nDirections\nFor the Crust:\nIn a food processor, blitz cookies until they are fully crumbled. Drizzle in melted butter and cream and add salt. Pulse to combine. (Alternatively, place cookies in a large zip-top bag and crush with a rolling pin. Transfer crumbs to a mixing bowl and combine with butter, cream, and salt.) Transfer crumb mixture to a deep-dish 9-inch pie plate. Using your hands or the back of a measuring cup, press crumbs evenly along walls and bottom of pie plate. Set aside.\nSerious Eats / Vicky Wasik\nFor the Filling:\nFill a medium saucepot with at least 1 1/2 inches water and bring to a simmer. In the bowl of a stand mixer, whisk together eggs, sugar, Fernet Branca, and salt. Place bowl over pot of simmering water. Stirring constantly with a flexible rubber spatula, heat egg mixture until it reaches 165°F (74°C), about 10 minutes. Remove bowl from heat and place on stand mixer with whip attachment. Whip egg mixture on high until it becomes thick and pale and doubles in volume, about 10 minutes. Reduce speed to low and add peppermint extract and food coloring (if using). Mix to combine and transfer egg mixture to a wide bowl.\nSerious Eats / Vicky Wasik\nIn stand mixer bowl (no need to wash it), whip cream until it reaches soft peaks. Gently fold whipped cream into egg mixture. Using a fork, drizzle streaks of melted chocolate over the entire surface of the mint mousse. Set bowl of mousse in refrigerator until chocolate hardens, about 5 minutes. Using a flexible rubber spatula, crack chocolate streaks into 1-inch pieces and fold into mousse. Repeat the chocolate-drizzling and folding procedure until no more chocolate remains. Pour mint mousse into prepared cookie crust and freeze for at least 6 hours, and preferably overnight.\nSerious Eats / Vicky Wasik\nFor the Fudge Topping:\nLine a rimmed baking sheet with a Silpat or well-greased piece of aluminum foil. In a 1-quart saucepot, combine sugar with 1/4 cup water. Cover and bring to a simmer over medium heat, about 4 minutes. Remove lid and cook sugar syrup until it becomes a deep golden brown. Remove from heat. Add cocoa nibs and stir to combine. Carefully pour caramel onto lined baking sheet and allow to fully set and cool, about 1 hour. With a rolling pin, crack caramel into 2- to 3-inch pieces. Transfer pieces to a food processor and pulse until caramel is mostly finely ground. Add molasses, oil, salt, and vanilla and process until combined. With food processor running, slowly drizzle in chilled cream, stopping to scrape down bowl's sides if needed. Transfer mixture to a piping bag fitted with a plain #17 tip and chill for at least 1 hour before piping.\nSerious Eats / Vicky Wasik\nTo Finish:\nRemove pie from freezer and garnish the top with fudge in a crisscross pattern. Fill a piping bag fitted with a #32 open star tip with whipped cream and pipe along the border. Drizzle the edges with melted chocolate, if desired. Using a knife dipped in hot water, cut pie into 8 to 12 slices and serve with extra fudge on the side.\nSerious Eats / Vicky Wasik\nSpecial equipment\nFood processor\n, rolling pin, 9-inch glass pie plate, stand mixer,\ninstant-read thermometer\n, rimmed baking sheet, flexible spatula, piping bag and pastry tip\nNotes\nThe addition of Fernet Branca gives this grasshopper pie an herbaceous twist, and the bitterness of the liqueur keeps the pie's sweetness in check while pairing well with both the mint and the chocolate flavors. For a more traditional take, substitute the Fernet Branca with 1 ounce each of crème de cacao and crème de menthe. This pie can also be made alcohol-free by increasing the sugar in the filling to 1 cup and bumping up the mint extract to taste. If you prefer fresh mint over extract, bring the 12 ounces of cream used for the filling to a simmer, then add 1 bunch fresh mint leaves. Steep for 2 hours, then discard the mint and fully chill the infused cream before whipping and folding into the egg base.\nThis Recipe Appears In\nUpgraded Grasshopper Pie: The Mint Chocolate Dessert of Your Dreams\nPies\nStovetop\nChocolate\nHeavy Cream\nThanksgiving Desserts"
}