{
  "url": "https://www.seriouseats.com/green-beans-amandine-french-almondine-recipe",
  "image_url": "https://www.seriouseats.com/thmb/u48W_XwujZvtLb7YIKhk7e3EyIs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/green-beans-amandine-french-almondine-recipe-step-07-b6654514573b43658ad41fbebd58a29f.jpg",
  "tags": [
    "French",
    "Gluten-free Sides",
    "Vegetarian Sides",
    "Stovetop",
    "Almonds"
  ],
  "title": "Haricots Verts Amandine (French-Style Green Beans With Almonds)",
  "full_text": "Haricots Verts Amandine (French-Style Green Beans With Almonds)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1 pound (\n450\ng\n)\ngreen beans\n, trimmed\n3\ntablespoons\n(about 35g)\nunsalted butter\n3 ounces (\n85\ng\n)\nslivered almonds\n2\nmedium\ncloves garlic\n, thinly sliced\n1\nmedium\nshallot\n, thinly sliced\n1 1/2 tablespoons (\n25\nml\n)\njuice from 1 lemon\nFreshly\nground black pepper\nDirections\nBlanch the beans\n. Bring a large pot of salted water to a boil and prepare an ice bath. Add green beans to boiling water and cook until tender-crisp, about 3 minutes. Transfer to ice bath using a wire mesh spider or tongs. Allow to chill completely, then drain and dry thoroughly with kitchen towels or paper towels.\nSerious Eats / Diana Chistruga\nIn a medium skillet, heat butter and almonds over medium-low heat and cook, stirring frequently, until almonds are deeply browned and nutty, about 5 minutes. Add garlic and shallot and cook, stirring, until lightly browned, about 2 minutes longer. Add lemon juice, along with a tablespoon or two of water. Increase heat to high and stir and shake pan rapidly to emulsify, about 30 seconds. The sauce should have a glossy sheen and not appear watery or greasy. If it's still watery, continue to simmer and shake. If it looks greasy, add another tablespoon of water to re-emulsify. When sauce is ready, remove from heat and season to taste with salt and pepper.\nSerious Eats / Diana Chistruga\nAdd beans to pan with sauce and toss to coat and combine. Return to medium heat and cook, tossing, until heated through, about 1 minute. Serve immediately.\nSerious Eats / Diana Chistruga\nSpecial Equipment\nLarge pot\n, Mesh spider or\ntongs\n, Medium\nskillet\nMake Ahead and Storage\nThis recipe can be prepared through the end of step 2 several days in advance. Store the blanched green beans and sauce separately in airtight containers in the refrigerator. To finish, reheat the sauce in a skillet over high heat with a tablespoon of water until the sauce melts back into a liquid, then proceed with step 3.\nFrench\nGluten-free Sides\nVegetarian Sides\nStovetop\nAlmonds"
}