{
  "url": "https://www.seriouseats.com/green-peppercorn-sauce-recipe-8726601",
  "image_url": "https://www.seriouseats.com/thmb/i0ptgldXsVDhaFZMr3kybyghxak=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241007-SEA-GreenPeppercornSauce-AmandaSuarez-Hero1-11-7d9d8f3fa30140a984bf037139a1ee84.jpg",
  "tags": [
    "Condiments & Sauces",
    "The Latest",
    "French"
  ],
  "title": "Green Peppercorn Sauce",
  "full_text": "Green Peppercorn Sauce\nClose\nJump to recipe\nCook\n25 mins\nTotal\n25 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2 tablespoons (\n28\ng)\nunsalted butter\n3\nt\nablespoons\ndrained, rinsed\ngreen peppercorns\npacked in brine\n2 tablespoon\ns (21\ng)\nminced\nshallot\n1 tablespoon (\n8\ng\n)\nall-purpose flour\n1 1/2\ncups\n(260ml)\nhomemade beef\nstock\nor\nhomemade chicken stock\nor store-bought low-sodium chicken broth\n1/4 cup (\n60\nml)\nbrandy\n1\nthyme\nsprig\n3/4 cup\n(180\nml)\nheavy cream\nKosher\nsalt\nto taste\nDirections\n1. Before making the sauce, sear your protein (steak, chicken, or pork) in a 12-inch skillet until well browned and desired internal doneness has been reached; transfer to a warm place to rest. Pour off all but 1 tablespoon remaining fat from the skillet.\nAdd butter and melt over medium-low heat. Add peppercorns and shallot and cook, stirring frequently, until shallot is softened, 3 to 5 minutes.\nSerious Eats / Amanda Suarez\nAdd flour and cook, stirring constantly, until well combined, 2 minutes. Increase heat to medium and whisk in brandy, scraping the bottom of the pan to loosen the fond and cook for 1 minute, then pour in stock and whisk to combine. Add a sprig of thyme and bring to boil, then cook, whisking occasionally, until mixture reduces to 11/2 cups, 12 to 15 minutes.\nSerious Eats / Amanda Suarez\nWhisk in cream and cook, whisking occasionally, until reduced to 2 cups, about 10 minutes. Discard thyme sprig, then season sauce with salt and pepper to taste. Serve with the reserved meat (if needed, you can quickly put the meat under a broiler or in a very hot oven just to warm it back up).\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-inch stainless-steel, carbon steel, or cast iron skillet\nMake-Ahead and Storage\nThis sauce is best enjoyed right away, but it can be refrigerated in an airtight container for up to 2 days. Gently reheat in a saucepan over low heat on the stove top, whisking constantly before serving.\nCondiments & Sauces\nThe Latest\nFrench"
}