{
  "url": "https://www.seriouseats.com/greek-lemon-potatoes-recipe-5220151",
  "image_url": "https://www.seriouseats.com/thmb/cm4vAy7yJiut212WK9_1MgV-mx8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220303-greek-lemon-potatoes-vicky-wasik-15-9eee1457f56b436db16cd912e1e50e5f.jpg",
  "tags": [
    "Potatoes",
    "Greek",
    "The Latest"
  ],
  "title": "Patates Lemonates (Greek Lemon Potatoes)",
  "full_text": "Patates Lemonates (Greek Lemon Potatoes)\nClose\nJump to recipe\nCook\n60 mins\nTotal\n60 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(120ml)\nextra-virgin olive oil\n, divided\n2 1/2\npounds\n(1.2kg)\nYukon gold potatoes\n, peeled and cut into 2-inch pieces\nKosher salt\n2\nmedium\ngarlic cloves\n(10g), lightly crushed\n3/4\ncup\n(180ml)\nhomemade\nchicken stock or\nlow-sodium store-bought chicken broth\n, or water\n1/4\ncup\n(60ml)\nfreshly squeezed lemon juice\nfrom about 3 lemons, divided\n2\nteaspoons\ndried oregano\nDirections\nAdjust oven rack to middle position and preheat oven to 425°F (220°C). In a 12-inch stainless steel straight-sided sauté pan or skillet, or cast iron skillet, heat 2 tablespoons (30ml) olive oil medium-high heat until shimmering. Add potatoes to skillet, with one cut side down, in a single layer and evenly spaced, and season with salt. Cook, without moving, until potatoes begin to brown around edges, 4 to 5 minutes. Continue to cook, rotating and swirling pan gently to promote even browning and prevent sticking, until potatoes are browned on bottom side, 2 to 3 minutes longer, adjusting heat as needed if some of the pieces brown too quickly.\nVicky Wasik\nUsing a thin metal spatula, flip potatoes onto second flat side. Continue to cook until browned on second side, 4 to 5 minutes. Stir in garlic, and cook until aromatic, about 1 minute. Add remaining olive oil, chicken stock (or water), 3 tablespoons (45ml) lemon juice, and oregano. Bring to a boil, swirling pan occasionally, and season with salt to taste.\nVicky Wasik\nTransfer skillet to oven and roast until potatoes are completely tender, offering little to no resistance when poked with a paring knife, and most of the stock has evaporated, 25 to 30 minutes.\nVicky Wasik\nRemove from oven, add remaining 1 tablespoon (15ml) lemon juice, and stir to combine. Season with salt to taste, then serve.\nVicky Wasik\nSpecial Equipment\n12-inch stainless-steel sauté pan or skillet or a cast iron skillet\nMake-Ahead and Storage\nPatates lemonates can be made in advance and held at room temperature for up to 3 hours, or refrigerated in an airtight container for up to 3 days. Reheat gently on the stovetop or in a 275°F (135°C) oven before serving.\nPotatoes\nGreek\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/patates-lemonates-greek-lemon-potatoes.webp?"
}