{
  "url": "https://www.seriouseats.com/green-goddess-potato-salad-recipe-11754479",
  "image_url": "https://www.seriouseats.com/thmb/FK3-qXav803BAMSADlwNzO36AW8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250612-SEA-Green_Goddess_Potato_Salad-StacyAllen-HERO-9a0de58abbff4b9ea6b817aa8c4b9843.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Salads",
    "Summer Salads",
    "Summer"
  ],
  "title": "This Fresh Twist on Classic Potato Salad Will Steal the Show at Your Next Cookout",
  "full_text": "This Fresh Twist on Classic Potato Salad Will Steal the Show at Your Next Cookout\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nCool\n45 mins\nTotal\n110 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n907\ng\n)\nsmall waxy potatoes, such as baby yellow potatoes, halved\n, if larger than 2 inches, quartered\n2\ntablespoons\n, plus\n1/2\nteaspoon\n(\n11\ng\n)\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume\n6\nounces\n(\n170\ng\n)\ngreen beans\n, preferably haricot verts, trimmed and cut into 1 1/2 inch lengths\n2\nlarge\neggs\n6\ntablespoons\n(\n90\nml\n)\nmayonnaise\n6\ntablespoons\n(\n90\nml\n)\nsour cream\n3\ntablespoons\n(about\n7\ng\n)\npacked fresh dill fronds\n, plus more to garnish\n1/4\ncup\n(about\n7\ng\n) packed\nfresh basil leaves\n, plus more to garnish\n2\nteaspoons\n(about\n8\ng\n)\nfresh lemon juice\nfrom\n1\nlemon\n1 1/2\nteaspoons\nDijon mustard\n1\noil-packed anchovy fillet\n1/8\nteaspoon\nblack pepper\n2\ntablespoons\n(about\n10\ng\n)\nminced chives\n, plus more to garnish\n1\ntablespoon\n(about\n5\ng\n)\nminced tarragon leaves\n1/2\nfennel\nbulb\n(about\n8\nounces\n;\n227\ng\n), cored, outer layers removed, and thinly sliced\nDirections\nAdd 1 quart water to a large saucepan. Add potatoes and 1 tablespoon kosher salt. Bring to a boil over high heat. Reduce to a simmer, and cook, stirring occasionally, until potatoes are tender, about 10 minutes. Using a slotted spoon, transfer potatoes to rimmed baking sheet. Spread into even layer and allow to cool to room temperature, about 30 minutes.\nSerious Eats/ Stacy Allen\nAs potatoes cool, fill a large bowl with ice water. Add 2 additional cups water to pot and bring water back to a boil. Add haricot verts to boiling water and cook beans until tender-crisp, about 3 minutes. Transfer to ice bath to chill.\nSerious Eats/ Stacy Allen\nFill a second large bowl with ice water. In the same saucepan, bring 3 quarts (2.8L) water to a boil. Carefully lower eggs in and continue to boil for 30 seconds. Cover tightly, reduce heat to low (water should maintain a bare simmer), and continue cooking for 11 minutes. Immediately place eggs in second bowl of ice water and allow to cool for at least 15 minutes before peeling under cool running water.\nSerious Eats/ Stacy Allen\nMeanwhile, in the bowl of a food processor, place mayonnaise, sour cream, basil, dill, lemon juice, mustard, anchovy fillet, pepper, and remaining 1/2 teaspoon salt and process until smooth, scraping down sides of bowl as needed, about 1 minute. Transfer to a small bowl and stir in chives and tarragon.\nSerious Eats/ Stacy Allen\nTransfer haricot verts to a paper towel-lined plate and pat dry. Cut eggs into quarters and transfer to small plate or bowl and cover and refrigerate until ready to serve salad.\nIn a large bowl, combine fennel, potatoes, haricot verts, and green goddess dressing. Stir with rubber spatula to combine. Fold in potatoes. Season with salt to taste. Cover and rest in fridge for at least 1 hour and up to 3 days before serving. To serve, transfer potato salad to serving bowl and decoratively arrange quartered eggs on top. Garnish with basil, dill, and chives.\nSerious Eats/ Stacy Allen\nEquipment\nLarge saucepan, slotted spoon, rimmed baking sheet, food processor\nNotes\nThis recipe can easily be doubled.\nMake-Ahead and Storage\nThe salad can be refrigerated in an airtight container for up to 3 days. Cooked eggs can be stored separately in an airtight container for up to 5 days.\nThe Latest\nRecipes\nSalads\nSummer Salads\nSummer"
}