{
  "url": "https://www.seriouseats.com/green-shakshuka-recipe-11710818",
  "image_url": "https://www.seriouseats.com/thmb/NE9AlURxpA69hmdLCAb-tVEMOXM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250406-SEA-SpringGreenShakshuka-RobbyLozano-Beauty1-57-946c3a50a8e448308d5771cde8bab2e6.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Recipes",
    "Eggs",
    "Spring Breakfast & Brunch"
  ],
  "title": "Green Shakshuka",
  "full_text": "Green Shakshuka\nClose\nJump to recipe\nPrep\n0 mins\nCook\n30 mins\nTotal\n30 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n6\nquarts\n(\n5.6\nL\n)\nwater\n2\nteaspoons\nbaking soda\n2\ntablespoons\n, plus\n2\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt use half the amount by volume\n1 1/2\ncups\n(\n1 1/4\nounces\n;\n35\ng\n) lightly packed fresh\ncilantro\nleaves and tender stems, plus more for garnish\n1\ncup\n(\n1\nounce\n;\n29\ng\n) lightly packed fresh flat-leaf\nparsley\nleaves and tender stems, plus more for garnish\n1\n(\n3 1/2-inch\n)\nserrano chile\n(about\n1/2\nounce\n;\n16\ng\n), stemmed, seeded (if desired), and chopped\n1/2\ncup\n(\n120\nml\n), plus\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, divided\n3\nmedium\ncloves\ngarlic, finely chopped (about\n3\nteaspoons\n)\n1 1/2\nteaspoons\nground cumin\n, divided\n3/4\nteaspoon\nground coriander\n, divided\n10\nounces\nbaby spinach\n(\n284\ng\n;\n10\npacked\ncups\n), divided\n3/4\ncup\n(\n180\nml\n)\nhomemade vegetable stock\nor or store-bought low-sodium vegetable stock or broth\n1/4\ncup\n(\n60\nml\n)\nheavy cream\n3/4\ncup\nthinly sliced\ncelery\n(\n3 1/4\nounces\n;\n92\ng\n)\n1 1/2\ncups\nthinly sliced\nleek\n(\n4 3/4\nounces\n;\n135\ng\n)\n3/4\ncup\nthinly sliced\ngreen bell pepper\n(\n3 3/4\nounces\n;\n106\ng\n)\n8\nlarge\neggs\n1/2\nteaspoon\ngrated lemon zest\nplus\n1\nteaspoon\nfresh\njuice\n(from\n1\nmedium\nlemon\n)\nSliced avocado\n,\npickled red onions\n, and crumbled creamy feta, for topping\nCrusty bread\nor flatbread, such as naan, for serving\nDirections\nIn an 8-quart or larger pot or Dutch oven, bring water, baking soda, and 2 tablespoons salt to a boil over medium-high heat. Place a large bowl of ice water next to stovetop.\nSerious Eats / Robby Lozano\nAdd cilantro and parsley to a fine-mesh strainer; dip strainer with herbs into water and cook, stirring constantly to ensure herbs are submerged, until herbs are bright green, about 10 seconds. Lift strainer and herbs out and transfer mixture in strainer to prepared ice bath and let sit until herbs are cold, 5 minutes. Drain and pat herbs dry, but do not squeeze (it should yield about 1/2 cup). Leave pot of water on stovetop on low heat.\nSerious Eats / Robby Lozano\nTo blender jar, add herbs, chile, 1/2 cup oil, 2 teaspoons garlic, 1 teaspoon salt, 1 teaspoon cumin, and 1/2 teaspoon coriander. Blend on high, scraping down sides of blender jar as needed, until smooth, about 1 minute. Transfer herb purée to a small bowl; set aside. (Do not clean blender.)\nSerious Eats / Robby Lozano\nReturn blanching water to a boil over medium-high heat. Add 8 cups (8 ounces; 226 g) spinach to boiling water; cook, stirring constantly, until bright green and wilted, about 10 seconds. In now-empty fine-mesh strainer, drain spinach, pressing out excess liquid with a silicone spatula (it should yield about 2/3 cup cooked leaves). Transfer spinach to blender; add broth and cream, and process until smooth, about 30 seconds to 1 minute. Set aside.\nSerious Eats / Robby Lozano\nIn a large skillet, heat remaining 2 tablespoons oil over medium heat until shimmering. Add celery; cover and cook, stirring often, until starting to soften, about 3 minutes. Add leek and bell pepper; cover and cook, stirring often, until vegetables are crisp-tender, 5 to 8 minutes.\nSerious Eats / Robby Lozano\nUncover and stir in remaining fresh spinach and remaining 1 teaspoon garlic. Cook, stirring constantly, until spinach is wilted and garlic is fragrant, 1 to 2 minutes.\nSerious Eats / Robby Lozano\nStir in spinach purée, 4 tablespoons of prepared herb purée, remaining 1 teaspoon salt, remaining 1/2 teaspoon cumin, and remaining 1/4 teaspoon coriander; cook over medium heat, stirring often, until simmering, 2 to 3 minutes.\nSerious Eats / Robby Lozano\nRemove skillet from heat. In a small bowl, crack 1 egg. Using a rubber spatula or large spoon, clear a rough 2-inch diameter well in sauce. Immediately pour in the cracked egg. (The well will hold yolk in place but may not fully contain egg white; this is ok.) Gently spoon a little sauce over edges of egg white to help contain it. Repeat with remaining eggs, evenly spacing them around the skillet. Cover, return to heat, and cook until egg whites are set but yolks are still jiggly, 3 to 6 minutes, or until desired doneness.\nSerious Eats / Robby Lozano\nUncover and top with feta, avocado, and pickled red onion. Sprinkle with cilantro and parsley. Stir lemon zest and juice into reserved cilantro mixture. Serve immediately, drizzling cilantro mixture on each portion. Serve bread on the side.\nSerious Eats / Robby Lozano\nSpecial Equipment\nLarge pot, blender, fine-mesh strainer, large skillet, silicone spatula\nMake-Ahead and Storage\nThe final dish is best served immediately, but the sauce can be cooked through step 6, cooled, and refrigerated for up to 1 day. To serve, gently reheat the sauce over medium heat in a large skillet until simmering, then remove from heat and proceed with steps 7 and 8 of the recipe.\nBreakfast & Brunch\nThe Latest\nRecipes\nEggs\nSpring Breakfast & Brunch"
}