{
  "url": "https://www.seriouseats.com/grilled-plum-pork-sandwich-recipe",
  "image_url": "https://www.seriouseats.com/thmb/o5cPIAM_tzwAVUUTVc9RxhVH28s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__06__20150617-grilled-pork-plum-mustard-sandwich-kenji-18-27cf64cb6b804d2a962682ea00bb3035.jpg",
  "tags": [
    "Sandwiches",
    "Grilled Pork",
    "Plum",
    "Cabbage"
  ],
  "title": "Grilled-Pork Sandwiches With Grilled-Plum Chutney and Cabbage Slaw",
  "full_text": "Grilled-Pork Sandwiches With Grilled-Plum Chutney and Cabbage Slaw\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n40 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork:\n1 1/4\npounds\nboneless pork loin\nor top sirloin, cut into 8 (2 1/2 ounce) portions\nKosher salt\nand freshly ground\nblack pepper\nFor the Miso Slaw:\n3/4\npound\ngreen cabbage\n(about\n1/2\nhead\n), cored and thinly sliced\n1/3\ncup\nrice vinegar\n1\ntablespoon\nplus\n1\nteaspoon\nwhite miso\nFor the Chutney:\n3/4\npound\nfirm but ripe\nplums\n, halved and pitted (about\n5\nsmall\nplums\n)\n2\nscallions\n, ends trimmed\n1\njalapeño\npepper\nVegetable\nor\ncanola oil\n2\nteaspoons\nwhole grain mustard\n3\ntablespoons\nchopped\nfresh mint leaves\n2\ntablespoons\nhoney\nSugar\n, to taste\nTo Assemble:\n4\ncrusty sandwich rolls\n, split\nDirections\nFor the Pork:\nWorking 1 piece at a time, sandwich pork between layers of plastic wrap and pound with a meat pounder or heavy skillet until about 1/4 inch thick. Season generously with salt and pepper and set aside.\nSerious Eats / J. Kenji López-Alt\nFor the Miso Slaw:\nCombine cabbage, vinegar, and white miso in a medium bowl and toss. Season to taste with salt. Set aside.\nFor the Chutney:\nIn a large bowl, drizzle plums, scallions, and jalapeño with oil and toss to coat. Season with salt.\nLight one chimney full of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals evenly over the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate.\nSerious Eats / J. Kenji López-Alt\nPlace plums, scallions, and jalapeños directly on the hot side of the grill and cook, turning, until plums, scallions, and jalapeño are charred and softened, 4 to 7 minutes, removing each to a platter or cutting board as they're done.\nSerious Eats / J. Kenji López-Alt\nAdd grilled plums to a large mixing bowl. Stem and seed jalapeño, then finely dice and add to plums. Chop up scallions and add to plums. Stir in mustard, mint leaves, and honey, using the back of a wooden spoon to mash plum. Season with salt and pepper, then stir in enough sugar to make the chutney fairly sweet (about 2 tablespoons, depending on how sweet the plums were). Set aside.\nSerious Eats / J. Kenji López-Alt\nGrill pork, turning, until just cooked through, 2 to 3 minutes per side. Toast bread on grill.\nSerious Eats / J. Kenji López-Alt\nTo build sandwiches, pile miso slaw on each bottom bun, then top each with 1 piece of grilled pork. Spoon some plum chutney on top, then top with remaining grilled pork. Spread plum chutney on top buns and close sandwiches. Serve.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nGrill\nRead More\n18 Pork Recipes for Your Memorial Day Cookout\nGrilled Jalapeño-Marinated Steak Sandwich with Charred Onions and Cotija Mayo\nGrilled Merguez Sandwiches with Caramelized Onions, Manchego, and Harissa Mayonnaise\nSandwiches\nGrilled Pork\nPlum\nCabbage"
}