{
  "url": "https://www.seriouseats.com/grilled-naan-recipe",
  "image_url": "https://www.seriouseats.com/thmb/EhrryfFspAsLgm3hurH4CHUp1U0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__08__20110803-grilled-naan-primary-b045cce91af242eaa0eaf57d86670351.jpg",
  "tags": [
    "South Asian",
    "Bread",
    "Grilling",
    "Sides"
  ],
  "title": "Grilled Naan Recipe",
  "full_text": "Grilled Naan Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n20 mins\nActive\n60 mins\nProofing Time\n4 hrs\nTotal\n4 hrs 45 mins\nServes\n12 pieces\nCook Mode\n(Keep screen awake)\nIngredients\n22\nounces\n(about\n4\ncups\n)\nbread flour\n0.25\nounce\n(\n1\npacket\n, about\n2\nteaspoons\n)\ninstant\nor\nrapid rise yeast\n0.44\nounces\nkosher salt\n(about\n2 1/2\nteaspoons\n)\n0.8\nounces\n(about\n2\ntablespoons\n)\nsugar\n14\nounces\n(about\n1 3/4\ncups\n)\nfull fat yogurt\nor\nwhole milk\n4\nounces\n(\n1\nstick\n)\nunsalted butter\n, melted\nDirections\nCombine flour, yeast, salt, and sugar in the bowl of a stand mixer and whisk until combined. Add yogurt and knead with dough hook on low speed until dough comes together into a smooth ball. Dough should stick slightly to bottom of bowl as it kneads (add slightly more yogurt or milk as necessary). Continue to knead for 5 minutes. Cover tightly with plastic wrap and allow to rise at room temperature until roughly doubled in volume, about 2 hours.\nTurn dough out onto floured work surface. Using a bench scraper or a knife, cut the dough into 12 even pieces. Roll each piece into a ball, then place on a well-floured surface (leaving a few inches of space between each one) and cover with a floured cloth. Alternatively, place each ball of dough in an individual covered pint-sized deli container. Allow dough to rise at room temperature until doubled in volume, about 2 hours.\nIgnite a large chimney full of coals (about 5 quarts of coals) and spread evenly over half of the grill. Set grill grates in place, cover, and allow to preheat for 5 minutes. Scrape grill grates clean with a brush.\nWorking with two to three balls of dough at a time, stretch with your hands into an oblong roughly 10-inches long and 6-inches across (you can use a rolling pin for this as well). Once you have two or three pieces stretched, lay them out on the grill above the coals. Cook without moving until bottom side is charred in spots and light golden brown. Flip with a large spatula, pizza peel, or with tongs and cook until second side is charred and browned. Remove naan from the grill and immediately brush with melted butter. Transfer the naan to a large plate and cover it with a clean dish towel while you cook the remaining bread.\nNotes\nThe naan can also be cooked in a grill pan over high heat. Milk can be used in place of the yogurt.\nRead More\nSerious Entertaining: An Indian Buffet\nSouth Asian\nBread\nGrilling\nSides"
}