{
  "url": "https://www.seriouseats.com/grilled-whole-cauliflower-with-teriyaki-sauce-recipe-8678549",
  "image_url": "https://www.seriouseats.com/thmb/nwYmHDICPYDbxAql_yInZ06XFwY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240806-SEA-Lorena-Masso-Grilled-Cauliflower-8d1fe0be585649db9a5d54b858a50bfd.jpg",
  "tags": [
    "Vegetable Mains",
    "The Latest",
    "Grilled Vegetables",
    "Cauliflower"
  ],
  "title": "Grilled Whole Cauliflower",
  "full_text": "Grilled Whole Cauliflower\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nBrining Time\n3 hrs\nTotal\n4 hrs 25 mins\nServes\n4\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge heads\ncauliflower\n(about\n2 pounds\neach;\n900 g\neach)\n3\nquarts\n(\n2.84\nL\n)\nwater\n3/4\ncup\nplus\n2\ntablespoons\n(\n126\ng\n)\nkosher salt\n1/2\ncup\n(\n120\nml\n)\nKoikuchi shoyu\n,\ntamari,\nor\nsaishikomi shoyu\n(see notes)\n1/2\ncup\n(\n120\nml\n)\nsake\n1/4\ncup\n(\n60\nml\n)\nmirin\n5\ntablespoons\n(\n60\ng)\ngranulated sugar\n1 ½\nteaspoons\n(8\ng\n) powdered\ndashi\n3\ntablespoons\nrendered chicken fat\nor unsalted butter\n1\ntablespoon\n(14\ng)\ntoasted sesame oil\nShichimi togarashi,\nfor serving\nLemon wedges\n, for serving\nDirections\nRemove leaves from bottom of each cauliflower head. Using a sharp knife, slice stem off of each head so that cauliflower sits evenly on flat surface. Do not cut out the core.\nSerious Eats / Lorena Masso\nIn a large container, such an\n8-quart Cambro\nor large stock pot, whisk water and salt until dissolved (see notes). Place cauliflower in saltwater brine, core side up, making sure that cauliflower is submerged. Cover and let sit at room temperature for at least 3 hours and up to 6 hours.\nSerious Eats / Lorena Masso\nMake the teriyaki sauce:\nA few minutes before you want to cook the cauliflower, in a medium saucepan, whisk shoyu, sake, mirin, sugar, and powdered dashi until combined. Bring mixture to boil, then cook over medium heat, swirling pan occasionally, until temperature reaches 225°F (107℃) and sauce thickens and is reduced to a scant 1 cup, 12 to 16 minutes. Off heat, stir in rendered fat or butter and sesame oil. Set aside.\nSerious Eats / Lorena Masso\nFor a Charcoal Grill: Open bottom vent completely. Light large chimney starter filled with charcoal briquettes (6 quarts). When top coals are partially covered with ash, pour evenly over half of grill. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot, about 5 minutes.\nSerious Eats / Lorena Masso\nFor a Gas Grill: Turn all burners to high, cover, and heat grill until hot, about 15 minutes. Leave primary burner on, and switch other burners off.\nRemove cauliflower from brine, letting excess liquid drain back into container. Place both cauliflower heads, stem side down onto cooler side of grill, approximately 2 inches from edge of hot coals or primary burner. Cover and cook for 20 minutes.\nSerious Eats / Lorena Masso\nUncover grill, and using a heatproof brush, brush one layer of reserved sauce over cauliflower heads. Cover and continue cooking until thermometer registers 175°F at the thickest part of the core, and cauliflower is tan, but not well browned yet, rotating cauliflower occasionally, 20 to 30 minutes longer.\nSerious Eats / Lorena Masso\nUncover grill and brush cauliflower with a second layer of sauce. Using tongs, flip cauliflower and place floret-side down directly over the hottest part of grill (for a charcoal grill, directly over the coals, for a gas grill, over the primary burner). Cover and cook until lightly browned, 3 to 5 minutes. Uncover grill, flip cauliflower heads stem side down, and brush florets all over with a final layer of sauce. Flip cauliflower and place floret side down, cover, and cook until well browned and lightly charred, 3 to 5 minutes longer.\nSerious Eats / Lorena Masso\nTransfer cauliflower to a plate. Sprinkle with togarashi. Serve with lemon wedges and remaining sauce.\nSpecial Equipment\n8-quart plastic container (such as a Cambro) or large stock pot for brining, charcoal or gas grill, chimney starter (if using a charcoal grill), thermometer, heat safe brush, grill tongs\nNotes\nKoikuchi shoyu is a general, all-purpose shoyu with a balance of salinity, umami, and richness. For a richer, slightly darker sauce, use tamari (it’s also gluten free). Saishikomi shoyu is the darkest, richest, most umami option, and produces teriyaki sauce with the greatest depth of flavor.\nMake-Ahead and Storage\nThe cooked cauliflower is best eaten right away, but it can be safely covered and refrigerated for up to 3 days.\nVegetable Mains\nThe Latest\nGrilled Vegetables\nCauliflower"
}