{
  "url": "https://www.seriouseats.com/grilling-pernil-puerto-rican-pork-roasted-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MygEBtuuQHj6U4V1dZ1jnRVU4v8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100520-pernil-large-d368da8e57ec44d383adba1006562a7f.jpg",
  "tags": [
    "Pork Mains",
    "Puerto Rican",
    "Grilled Pork",
    "Pork Shoulder"
  ],
  "title": "Pernil (Puerto Rican Pork Shoulder)",
  "full_text": "Pernil (Puerto Rican Pork Shoulder)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n5 hrs 30 mins\nMarinating Time\n6 hrs\nTotal\n12 hrs 5 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5 to 6\npounds\nfresh pork picnic shoulder, skin on (pernil)\n8\ncloves\ngarlic\n, minced\n1/4\ncup\nolive oil\n2\ntablespoons\nkosher salt\n2\ntablespoons\nwhite wine vinegar\n1\ntablespoon\ndried oregano\n2\nteaspoons\nfreshly\nground black pepper\n1\nteaspoon\ncumin\nDirections\nTo make the marinade, mix together the garlic, oil, salt, vinegar, oregano, pepper, and cumin in a small bowl. Set aside.\nUsing a paring knife, cut slits about 1 inch deep all over the pork. Rub on the marinade, making sure to get some in all of the cut slits. Place pork in a large container, cover, and let marinate in the refrigerator for 6 hours to one day.\nRemove the pork from the fridge and allow to come to room temperature.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate for indirect cooking. Place a disposable aluminum pan filled with water on the empty side of the charcoal grate.\nClean\nand\noil\nthe grilling grate. Cover the grill and when it reaches 450°F, place the pork over the side with the water pan. Cover and let the temperature drop to 350 degrees, keeping it at 350 degrees for the rest of the cooking time, replenishing the coals as needed. Cook until an instant read thermometer registers 180 degrees when inserted into the thickest part of the pork, about 5 hours. Remove from the grill and let rest 20 to 30 minutes. Slice, chop, or pull the pork and serve.\nPork Mains\nPuerto Rican\nGrilled Pork\nPork Shoulder"
}