{
  "url": "https://www.seriouseats.com/grilled-smoked-brownie-recipe-7568650",
  "image_url": "https://www.seriouseats.com/thmb/2p_MfYe01Dxq_UGL_9yForEJim4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230802-SEA-SmokedAnchoChileSkilletBrownies-LorenaMasso-hero1-7bcc4e0f8cae4dd28d7f4151234560ce.jpg",
  "tags": [
    "The Latest",
    "Baking",
    "Chocolate",
    "Desserts",
    "Grilling"
  ],
  "title": "Grill-Baked Smoked Ancho Chile Skillet Brownie",
  "full_text": "Grill-Baked Smoked Ancho Chile Skillet Brownie\nClose\nJump to recipe\nPrep\n20 mins\nCook\n75 mins\nCooling Time\n30 mins\nTotal\n2 hrs 5 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\ncups\nall-purpose flour\n(\n5 2/3\nounces\n;\n160\ng\n)\n1/4\ncup\nDutch-processed\ncocoa powder\n(\n3/4\nounces\n;\n20\ng\n)\n1\nteaspoon\nground ancho\nchile powder\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/8\nteaspoon\nground\ncayenne pepper\n6\ntablespoons\nunsalted butter\n, cut into\n6\npieces\n(\n3\nounces\n;\n85\ng\n)\n6\nounces\nfinely chopped\nbittersweet chocolate\n(about\n1\ncup\n;\n170\ng\n), divided\n1/4\ncup\n(\n60\nml\n)\nwater\n1 1/2\nteaspoons\ninstant espresso powder\n, optional\n1 1/2\ncups\ngranulated sugar\n(\n10 1/2\nounces\n;\n300\ng\n)\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\nor other neutral oil\n2\nlarge\neggs\n1\nteaspoon\nvanilla extract\nDirections\nIn a medium bowl, whisk together flour, cocoa powder, ancho chile powder, baking powder, salt, and cayenne pepper.\nSerious Eats / Lorena Masso\nFor Heating a Charcoal Grill:\nOpen bottom vent completely. Light chimney starter filled with charcoal briquettes (6 quarts). Once top coals are partially covered with ash, pour into a steeply banked pile against 1 side of the grill. Nestle one 3-inch wood chunk into hot coals. Set cooking grate in place, cover, and open lid vent. Heat until grill is hot  (500°F; 260°C) and filled with smoke, about 5 minutes.\nSerious Eats / Lorena Masso\nFor Heating a Gas Grill:\nSoak 1 cup wood chips in water for 15 minutes. Drain well. Use a large piece of heavy-duty aluminum foil to wrap chips into foil packet and cut several vent holes in the top. Place wood chip packet directly on primary burner. Turn all burners to high, cover, and heat grill until hot (500°F; 260°C), about 15 minutes. Leave primary burner on high and turn off other burner(s). (see notes)\nIn a 10-inch cast iron skillet, add butter, half the bittersweet chocolate, water, and espresso powder, if using, and place on cooler side of the grill. Cook, swirling skillet and stirring occasionally, until butter is melted and beginning to bubble (some chocolate may not be fully melted). Using grill gloves, remove the skillet from the grill.\nSerious Eats / Lorena Masso\nUsing a rubber spatula, scrape butter mixture into a large heatproof bowl and set now-empty skillet aside. Add sugar and oil to bowl with butter mixture and whisk until well combined. Whisk in eggs and vanilla until smooth.\nSerious Eats / Lorena Masso\nAdd flour mixture to butter mixture and use rubber spatula to stir until just combined and no dry flour is visible. Add remaining 3 ounces bittersweet chocolate and stir until evenly distributed. Scrape batter into now-empty ­skillet and spread into even layer.\nSerious Eats / Lorena Masso\nTransfer the skillet to the cooler side of the grill, cover grill, and bake, rotating skillet halfway through baking, until toothpick inserted in center comes out with a few moist crumbs attached (be careful not to overbake; brownie will continue to bake as it cools), 50 minutes to 65 minutes.  (For a gas grill, adjust primary burner as needed to maintain grill temperature around 425 degrees; if using 3-or-more-burner grill, adjust primary burner and second burner, leaving other burners off.) Transfer skillet to a wire rack and let cool for at least 30 minutes before cutting and serving.\nSpecial Equipment\nCharcoal or gas grill, large chimney for charcoal grill, grill gloves, 10-inch cast-iron skillet\nNotes\nI highly recommend using Dutch-processed cocoa powder in this recipe. If you use natural cocoa powder, the brownie will be lighter in color and drier in texture.\nI prefer to use a fruit wood such as apple or cherry wood in this recipe.\nWhile I prefer to use one wood chunk with the charcoal grill in this recipe for the ease of just throwing on the lit coals, if using a gas grill, I strongly recommend using the soaked and wrapped wood chips as written in to the recipe to avoid the risk of unwanted flair ups and mess with the gas grill.\nThe primary burner on a gas grill is the burner that is connected closest to the gas source. It is the burner that you ignite first on the grill.\nServe with ice cream or whipped cream, if desired.\nWhile I  recommend baking these brownies on the grill, this skillet brownie can be baked on the middle rack of an indoor oven at 350 degrees for 25 to 35 minutes, follow the same visual cue for doneness as described in step 7.\nMake-Ahead and Storage\nCut brownies can be stored in an airtight container, with a sheet of wax paper between the layers, for up to 1 week at room temperature.\nThe Latest\nBaking\nChocolate\nDesserts\nGrilling",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grill-baked-smoked-ancho-chile-skillet-brownie.webp?"
}