{
  "url": "https://www.seriouseats.com/grilled-pork-paste-rice-paper-rolls-recipe-8415789",
  "image_url": "https://www.seriouseats.com/thmb/jEaaVJpI_UjVZtH8Z6c9I4PCanY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-PorkPasteRicePaperRolls-VyTran-59-d677d06be638468ea11817a6f660e122.jpg",
  "tags": [
    "Grilled Pork",
    "Snacks & Appetizers",
    "Pork",
    "Vietnamese",
    "Vietnamese Cuisine"
  ],
  "title": "Nem Nướng Cuốn (Vietnamese Grilled Pork Paste Rice Paper Rolls)",
  "full_text": "Nem Nướng Cuốn (Vietnamese Grilled Pork Paste Rice Paper Rolls)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n60 mins\nChilling Time\n5 hrs\nTotal\n6 hrs 35 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Annatto Oil:\n1/2\ncup\n(\n120\nml\n)\nvegetable\nor other\nneutral oil\n2\ntablespoons\n(\n20\ng\n)\nannatto seeds\n(see notes)\nFor the Pork Paste:\n1\npound\n(\n453\ng\n)\nground pork\n, 20 to 25% fat (see notes)\n2\ntablespoons\ngranulated sugar\n(about\n1\nounce\n;\n30\ng\n)\n5\ncloves\ngarlic\n(about\n1\nounce\n;\n25\ng\n), finely minced\n1\nmedium\nshallot\n(\n3/4\nounce\n;\n20\ng\n), finely diced\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1\ntablespoon\n(\n8\ng\n)\ncornstarch\n1\nteaspoon\nbaking powder\n, preferably Alsa brand (see notes)\n1\nteaspoon\nfreshly\nground black pepper\n2\ntablespoons\n(\n30\nml\n)\nAnnatto Oil\n(from above)\nVegetable oil\n, for forming sausages\nFor the Scallion Oil:\n1\nloosely packed\ncup\nsliced\nscallion greens\n(from about\n10\nscallions\n)\n1/4\ncup\n(\n60\nml\n)\nvegetable\nor other\nneutral oil\n1/4\nteaspoon\nkosher salt\n; for\ntable salt\nuse half as much by volume\n1/4\nteaspoon\ngranulated sugar\nFor the Pork Peanut Sauce:\n1\ntablespoon\n(\n15\nml\n)\nvegetable\nor other\nneutral oil\n1\nmedium\nshallot\n(\n3/4\nounce\n;\n20\ng\n), chopped\n2\ncloves\ngarlic\n, minced\n2\nounces\n(\n57\ng\n)\nground pork\n, 20 to 25% fat (see notes)\n1 1/2\ncups\n(\n355\nml\n) homemade\nchicken stock\nor store-bought\nlow-sodium chicken broth\n1/4\ncup\nsmooth\npeanut butter\n(about\n2\nounces\n;\n60\ng\n)\n1/4\ncup\n(\n60\nml\n)\nhoisin sauce\n1\ntablespoon\ngranulated sugar\n(about\n1/2\nounce\n;\n15\ng\n)\n2\nteaspoons\n(\n10\nml\n)\nfish sauce\n2\ntablespoons\n(\n30\nml\n)\nAnnatto Oil (\nfrom above)\n1\ntablespoon\n(\n8\ng\n)\ncornstarch\nFor the Egg Roll Wrappers:\n20\negg roll wrappers\n(\n5-inch squares\n), fully thawed (see notes)\n2\ncups\n(\n475\nml\n)\nneutral oil\n(such as\nvegetable oil\n) for frying\nFor the Nem Nướng Cuốn:\n1\nhead\nbutter lettuce\n, leaves seperated\n1\nbunch\nthai basil\n(húng quế), leaves picked (see notes)\n1\nbunch\nVietnamese coriander\n(rau răm), leaves picked\n1\nbunch\nperilla\n(tiá tô), leaves picked\n1\nbunch\npeppermint\n(húng lủi) and/or\nfish mint\n(dấp cá), leaves picked\n1\nbunch\ngarlic chives\n, cut to 6-inch lengths\n1/2\ncup\n(\n75\ng\n)\nroasted peanuts\n, chopped\nTwenty\n8-inch\nround or square\nrice papers\nPickled\ncarrot\n,\ndaikon\n, and\nleeks\n, for serving\nDirections\nFor the Annatto Oil:\nIn a small saucepan, heat oil and annatto seeds over medium-low heat, stirring and swirling pan occasionally, until warmed through and shimmering, about 5 minutes. Remove from heat and let oil cool for 15 minutes. Using a fine-mesh strainer, strain oil into a bowl or jar; discard seeds and set oil aside until ready to use.\nSerious Eats / Vy Tran\nFor the Pork Paste\n: In a food processor, process ground pork until it forms a smooth paste, about 1 minute. Transfer to a plastic wrap–lined plate or baking sheet, cover loosely with plastic wrap and freeze until well chilled and firm, but not fully frozen, 30 to 60 minutes.\nSerious Eats / Vy Tran\nIn a stand mixer fitted with paddle attachment, add the chilled pork paste, garlic, shallot, fish sauce, cornstarch, baking powder, pepper, and 2 tablespoons (30ml) of the prepared annatto oil. Beat mixture on low speed until combined, 1 minute. Increase speed to high and beat for another 2 minutes. Cover bowl with plastic wrap (or transfer mixture to a clean bowl and cover) and refrigerate to let flavor develop, at least 4 and up to 24 hours.\nSerious Eats / Vy Tran\nLine a rimmed baking sheet with parchment paper or aluminum foil. Divide pork mixture into 10 even portions, just shy of 2 ounces (60g) each. Coat gloved or ungloved hands lightly with vegetable oil. Roll each portion of pork into a 5-inch log around the base of each bamboo skewer and place on prepared baking sheet. If mixture is too soft during shaping, divide portions onto a sheet tray and freeze briefly until firm, but not fully frozen, about 20 minutes. Once shaped refrigerate until ready to grill.\nSerious Eats / Vy Tran\nFor the Scallion Oil:\nIn a medium bowl, combine scallions, oil, salt, and sugar. Cover and microwave until heated through and bubbling, 60 seconds. Carefully uncover and mix well; set aside until ready to use.\nSerious Eats / Vy Tran\nFor the Pork Peanut Sauce:\nIn a small saucepan, heat oil over medium-high heat until shimmering. Add shallots and cook, stirring, until slightly softened, about 1 minute. Add garlic and cook until fragrant, about 1 minute. Add ground pork and cook, stirring to break up the meat, until cooked through and lightly browned, about 3 minutes.\nSerious Eats / Amanda Suarez\nReduce heat to medium and add chicken broth, peanut butter, and hoisin sauce. Cook, stirring frequently, until well blended and warmed through, about 5 minutes. Add sugar, fish sauce, and 2 tablespoons (30ml) annatto oil and cook for another 2 minutes. In a small bowl, mix cornstarch with 1 tablespoon (15ml) water. Stir cornstarch mixture into sauce and cook, stirring frequently, until thickened, about 3 minutes. Transfer to a serving bowl.\nSerious Eats / Vy Tran\nFor the Egg Roll Wrappers:\nSet egg roll wrappers on a work surface and cover with a damp towel. Working with 1 egg roll wrapper at a time, roll into tight cigar-shaped logs.\nIn a medium saucepan, heat oil over medium-high heat to 350°F (175°C). Use tongs or spider skimmer to gently transfer 5 to 6 shaped wrappers to the hot oil and fry, turning and gently separating as needed, until golden brown and crispy all over, about 3 minutes. Transfer to a paper-towel lined plate and repeat with the remaining wrappers in batches of 5 or 6 at a time; set aside until ready to serve.\nSerious Eats / Vy Tran\nTo Cook on a Grill:\nFor a Charcoal Grill:\nLight 1\nchimney full of charcoal\n. When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and preheat for 5 minutes. Clean and oil grilling grate.\nSerious Eats / Vy Tran\nFor a Gas Grill:\nTurn all burners to high, cover, and heat grill until hot, about 15 minutes. Leave primary burner on high and turn off other burners. (Adjust primary burner as needed to maintain grill temperature of 375 to 425℉ (190 to 220℃).\nBrush skewers with annatto oil. Set skewers on the cooler side of the grill and cook over indirect heat, turning every 2 minutes, until cooked through, 7 to 8 minutes. Move skewers to the hotter side of the grill, and cook over direct heat, turning every minute, until charred on both sides, 3 to 4 minutes. Transfer to platter and hold until ready to serve.\nSerious Eats / Vy Tran\nTo Cook in an Indoor Oven:\nAdjust oven rack to middle position and heat oven to 375°F (190℃). Brush pork paste skewers with annatto oil on both sides. Bake for 10 minutes. Remove from oven. Brush again with annatto oil and continue to bake until cooked through, about 10 minutes. Transfer to platter and hold until ready to serve.\nSerious Eats / Vy Tran\nTo Serve:\nArrange lettuce, herbs, garlic chives, fried egg roll wrappers, and grilled pork paste skewers on a serving platter. Drizzle scallion oil and scatter half of chopped peanuts over the grilled pork paste skewers. Scatter remaining chopped peanuts over the pork peanut sauce and add ground chile, if desired.\nSerious Eats / Vy Tran\nTo form one roll, dip one sheet of rice paper into a wide shallow bowl of warm water, making sure rice paper is completely wet before shaking off excess water. Lay rice paper on a plate and let sit until pliable, about 30 seconds. Arrange any combination of lettuce and herbs just below the center of the rice paper.\nSerious Eats / Vy Tran\nRemove pork paste from skewers and slice in half lengthwise. Place one slice of the grilled pork paste on top of roll fillings. Top with garlic chives and fried egg roll wrappers. Starting with the edge closest to you, carefully lift the rice paper wrapper over the filling, fold in the left and the right sides, then roll tightly to form the finished rice paper roll. Enjoy with the pork peanut dipping sauce and pickled vegetables, continuing to form rice paper rolls with your guests until fillings are used up.\nSerious Eats / Vy Tran\nSpecial Equipment\nFood processor, stand mixer, bamboo skewers, charcoal grill\nNotes\nMost packaged ground pork sold at large-scale supermarkets will not be labeled with a fat percentage, and will most likely be too lean (closer to 15% fat). You’ll have best luck finding ground pork with 20 to 25% fat at a local Asian market or butcher. If in doubt, just ask the friendly butcher behind the counter what the fat percent is in the ground pork when purchasing.\nAnnatto seeds are used to color foods in Vietnamese cooking. I prefer annatto seeds over pre-ground annatto powder because the color tends to be more vibrant. If you don't want to make annatto oil from scratch, you can buy it pre-made; my go-to brand is\nYesheu\nroasted annatto oil.\nAlsa baking powder is a French cake baking powder that does not need liquid to activate. It allows the pork to rise during cooking and creates a firm yet spongy texture. You can substitute American baking powder, but it does not work as well. Alsa baking powder is available online and at Asian supermarkets.\nThe egg roll wrappers should be wheat-based. I prefer the brand Spring Home TYJ Spring Roll Pastry, which comes in 5-inch squares. You can also use larger egg roll wrappers, but you would need to cut them to about 5 inches to fit the rolls.\nVietnamese rice paper wrappers are sold dried. They come in three styles; rice flour mixed with tapioca starch, all tapioca starch, or wrappers made from vermicelli noodles called chả giò rế. All three styles will work with this recipe, so choose the style you prefer. Rice paper wrappers can be found at most Asian grocery stores and online.\nThe listed fresh herbs are available at most Asian grocery stores or well stocked markets. Any combination of the listed fresh herbs that are available to you will work in this recipe.\nMake-Ahead and Storage\nThe pork paste can be made up to 1 day ahead; shape as instructor, then refrigerate in an airtight container until ready to use. The annatto oil can be refrigerated for up to 1 month.\nGrilled Pork\nSnacks & Appetizers\nPork\nVietnamese\nVietnamese Cuisine",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nem-nng-cun-vietnamese-grilled-pork-paste-rice-paper-rolls.webp?"
}