{
  "url": "https://www.seriouseats.com/grilled-garlic-and-herb-marinated-hanger-steak",
  "image_url": "https://www.seriouseats.com/thmb/WT3PT4hAUQDZwqkolWNu9r2yDyY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120513-inexpensive-steak-for-the-grill-06-995a0221a6e14533972a472d04027b4c.jpeg",
  "tags": [
    "Beef Mains",
    "Grilled Beef",
    "Hanger Steak",
    "Memorial Day",
    "Father's Day"
  ],
  "title": "Grilled Garlic- and Herb-Marinated Hanger Steak Recipe",
  "full_text": "Grilled Garlic- and Herb-Marinated Hanger Steak Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n30 mins\nMarinate\n2 hrs\nTotal\n2 hrs 50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nhanger steak\n, trimmed of excess fat and silverskin (see note)\n2\ntablespoons\nolive oil\n2\ntablespoons\nwhole\npeppercorns\n4\ngarlic\ncloves\n, thinly sliced\n4\nlarge sprigs\nparsley\n(leaves and stems), roughly chopped\n1\nlarge\nshallot\n, thinly sliced (about 1/2 cup)\nKosher salt\nDirections\nPlace hanger steaks in a shallow baking dish or plate and rub with olive oil. Add peppercorns, garlic cloves, parsley, and shallot, and 1 tablespoon salt and rub until seasonings are evenly coating surface of steak. Transfer to a plastic zipper-lock bag and seal, squeezing out as much air as possible. Refrigerate for at least 2 hours and up to overnight.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate.\nRemove steaks from bags, remove all seasonings, and discard. Season steaks with more salt, then place directly over hot side of grill. Cook, turning frequently until well-charred and an instant read thermometer inserted into the thickest part of each steak registers 125°F for medium rare or 130°F for medium, about 8 minutes total. Transfer to a cutting board, tent with foil, and allow to rest for 5 minutes. Slice\nagainst the grain\nand serve.\nAlternatively, to finish indoors:\nHeat 2 tablespoons vegetable or canola oil in a large stainless steel or cast iron skillet over high heat until shimmering. Remove steaks from bags, remove all seasonings, and discard. Season steaks with more salt. Add steak to pan and cook, turning frequently, until an instant-read thermometer registers 120 to 125°F for medium-rare, or 130°F for medium, reducing heat as necessary if steak smokes excessively or starts to burn. Transfer to a wire rack set in a rimmed baking sheet and allow to rest 5 to 10 minutes. Slice\nagainst the grain\nand serve.\nSpecial equipment\ngrill\nThis Recipe Appears In\nThe Best Inexpensive Steak for the Grill, Part 1: Hanger Steak\nBeef Mains\nGrilled Beef\nHanger Steak\nMemorial Day\nFather's Day"
}