{
  "url": "https://www.seriouseats.com/grilled-beef-galbi-korean-style-marinated-short-ribs",
  "image_url": "https://www.seriouseats.com/thmb/xBpjlTGEywUgh43aMVSFcq014lg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190619-korean-bbq-kalbi-beef-short-ribs-vicky-wasik-21-6d69144cd74a478a81b0286b19cd79ba.jpg",
  "tags": [
    "Korean",
    "4th of July",
    "Grilled Beef",
    "Short Ribs",
    "Beef Mains"
  ],
  "title": "Grilled Beef Galbi (Korean-Style Marinated Short Ribs) Recipe",
  "full_text": "Grilled Beef Galbi (Korean-Style Marinated Short Ribs) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n20 mins\nMarinating Time\n60 mins\nTotal\n100 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Galbi:\n1\nmedium\nonion\n(about 7 ounces; 200g), cut into 1-inch pieces\n1\nAsian pear\n(about 6 ounces;\n170\ng\n), peeled and cut into 1-inch pieces (see note)\n5\ngarlic\ncloves\n(25g)\n1-inch piece (1/2 ounce;\n14\ng\n)\nfresh ginger\n, peeled and cut into 1/4-inch pieces\n1\ncup\n(240ml)\nsoy sauce\n1/2\ncup\n(120ml)\nwater\n1/4\ncup\n(50g)\npacked\nbrown sugar\n2\ntablespoons\n(30ml)\nmirin\n1\ntablespoon\n(6g) freshly\nground black pepper\n4\nscallions\n(80g), thinly sliced\n2\ntablespoons\n(30ml)\ntoasted sesame oil\n2\ntablespoons\n(12g)\ntoasted sesame seeds\n, lightly crushed\n3\npounds\n(1.4kg)\nflanken-style beef short ribs\n, about 1/2-inch-thick (see note)\nFor serving:\nSsamjang\nLettuce and perilla leaves,\nsteamed rice\n, thinly sliced garlic, chiles, and scallions, and assorted\nbanchan\nDirections\nFor the Galbi:\nCombine onion, Asian pear, garlic, and ginger in the bowl of a food processor and process to a coarse purée, scraping down sides of food processor bowl as needed, about 30 seconds. Stop processor and add soy sauce, water, brown sugar, mirin, and black pepper to food processor bowl. Continue processing until liquids and sugar are well-combined with vegetables, 15 to 30 seconds longer. Transfer mixture to a medium bowl, and stir in scallions, sesame oil, and sesame seeds.\nPlace beef in a gallon zipper-lock bag or large baking dish, and pour marinade over the short ribs. Toss to evenly distribute the marinade, then seal bag, removing as much air as possible (if using baking dish, wrap tightly with plastic wrap). Transfer short ribs to refrigerator, and marinate for at least 1 hour and up to 24 hours.\nSerious Eats / Vicky Wasik\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil grilling grate.\nRemove short ribs from marinade and wipe off excess. Place directly over the hot side of the grill. If using a charcoal grill, leave uncovered; if using a gas grill, cover. Cook, turning occasionally, until beef is cooked through and lightly charred on both sides, about 5 minutes total (2 to 3 minutes per side). Transfer to a serving platter and allow to rest for at least 2 minutes before serving.\nSerious Eats / Vicky Wasik\nFor Serving:\nServe short ribs immediately with a pair of kitchen shears on-hand for cutting the meat off the bone and into bite-size pieces. Pass ssamjang, lettuces, garnishes, and banchan at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n,\ngrill\n,\nchimney starter\n,\nwire cooling rack\nNotes\nBosc pear or apple can be substituted for Asian pear.\nFlanken-style beef short ribs are thin, long pieces of short rib that have been cut crosswise through the rib bones. They can be found at Korean markets, where they are usually labeled \"LA-Style Galbi,\" or can be cut to order at good butcher shops.\nMake-Ahead and Storage\nThe grilled short ribs are best enjoyed immediately. The marinade can be made ahead and refrigerated for up to two days. The short ribs can be marinated for up to 24 hours.\nRead More\nAn Introduction to Korean Barbecue\nDwaeji Bulgogi (Korean-Style Spicy Grilled Pork)\nKorean\n4th of July\nGrilled Beef\nShort Ribs\nBeef Mains"
}