{
  "url": "https://www.seriouseats.com/grilled-merguez-sandwich-recipe",
  "image_url": "https://www.seriouseats.com/thmb/nYd5Ac4VLlZ_0od56qusFiqqE2M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130729-261058-merguez-sandwich-224ecfdb5d404ffa90971a1cd061d3d3.jpg",
  "tags": [
    "Sausages",
    "Cheese",
    "Lamb",
    "Onions",
    "Quick Dinners"
  ],
  "title": "Grilled Merguez Sandwiches With Caramelized Onions, Manchego, and Harissa Mayonnaise Recipe",
  "full_text": "Grilled Merguez Sandwiches With Caramelized Onions, Manchego, and Harissa Mayonnaise Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n25 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/3\ncup\nmayonnaise\n1\ntablespoon\nharissa\n8\nlinks\nmerguez\n1\nFrench baguette\n1/3\ncup\nextra-virgin olive oil\n1/2\ncup\ncaramelized onions\n1/3\npound\nManchego cheese\n, grated\n1\nbunch\nfresh cilantro\nDirections\nMix mayonnaise and harissa together in a small bowl. Set aside.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate. Grill merguez over hot side of grill until browned all over and cooked through, 4 to 6 minutes total. Transfer to plate.\nSlice baguette into four 6-inch portions and halve each portion lengthwise. Brush cut side of each baguette with oil. Grill baguette over hot side of grill, cut side down, until lightly browned, about 1 minute. Remove to plate.\nTop bottom half of baguette with 2 merguez links, about 2 tablespoons of caramelized onions, manchego cheese, and a few sprigs of cilantro. Spread harissa mayo on top half of baguettes and place on top of each sandwich.\nPlace sandwiches on cool side of grill, cover, and cook until cheese has melted, about 5 minutes. Transfer to a plate or tray and serve immediately.\nSpecial equipment\nGrill\nThis Recipe Appears In\nGrilling: Merguez Sandwiches with Caramelized Onions, Manchego, and Harissa Mayonnaise\nSausages\nCheese\nLamb\nOnions\nQuick Dinners"
}