{
  "url": "https://www.seriouseats.com/grilled-scallion-pancake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MmNwlBpL5AUnG8ZIc9zujPbIT9s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__06__20150611-grilled-scallion-pancakes-28-c4c947b890fd4877bac1546cb7fe94bd.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Chinese",
    "Vegetarian Snacks & Appetizers",
    "Grilling",
    "Scallions"
  ],
  "title": "Grilled Scallion Pancakes Recipe",
  "full_text": "Grilled Scallion Pancakes Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n5 mins\nActive\n30 mins\nResting Time\n90 mins\nTotal\n2 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pancakes:\n2\ncups\n(about\n10\nounces\n)\nall-purpose flour\n, plus extra for dusting work surface\n1\ncup\n(\n8\nounces\n)\nboiling water\nUp to\n1/4\ncup\ntoasted sesame seed oil\n2\ncups\nthinly sliced scallion greens\nKosher salt\nFor the Dipping Sauce:\n2\ntablespoons\nsoy sauce\n2\ntablespoons\nChinkiang\nor\nrice wine vinegar\n1\ntablespoon\nfinely sliced scallion greens\n1/2\nteaspoon\ngrated or slivered fresh ginger\n2\nteaspoons\nsugar\nDirections\nFor the Pancakes\nPlace flour in bowl of food processor. With processor running, slowly drizzle in about 3/4 of boiling water. Process for 15 seconds. If dough does not come together and ride around the blade, drizzle in more water a tablespoon at a time until it just comes together. Transfer to a floured work surface and knead a few times to form a smooth ball. Transfer to a bowl, cover with a damp towel or plastic wrap, and allow to rest for 30 minutes at room temperature, or up to overnight in the fridge.\nDivide dough into four even pieces and roll each into a smooth ball. Working one ball at a time, roll out into a disk roughly 8-inches in diameter on a lightly floured surface. Using a pastry brush, paint a very thin layer of sesame oil over the top of the disk. Season with salt.\nRoll disk up like a jelly roll.\nTwist roll into a tight spiral, tucking the end underneath. Flatten gently with your hand, then re-roll into an 8-inch disk.\nPaint with another layer or sesame oil, sprinkle with 1/2 cup scallions, and roll up like a jelly roll again.\nTwist into a spiral and flatten gently.\nRe-roll into a 7-inch disk, brush with oil, and transfer to a plate lined in foil or parchment paper. Repeat steps two and three with remaining pancakes and stack them.\nFor the Sauce:\nCombine all the sauce ingredients and set aside at room temperature.\nGrill the Pancakes\n:\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate.\nWorking one pancake at a time, carefully drape pancake directly on grill grates. Cook, turning occasionally, until cooked through and well browned and blistered. Transfer to a cutting board and cover with a towel to keep warm while you cook the remaining pancakes. Cut into wedges and serve with dipping sauce.\nSpecial equipment\nrolling pin, grill\nThis Recipe Appears In\nGrill Your Scallion Pancakes\nSnacks & Appetizers\nChinese\nVegetarian Snacks & Appetizers\nGrilling\nScallions",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-scallion-pancakes-recipe.webp?"
}