{
  "url": "https://www.seriouseats.com/grilled-bratwurst-with-beer-mustard-and-sauerkraut-recipe",
  "image_url": null,
  "tags": [
    "Grilled Sausages",
    "German",
    "Grilled Pork",
    "Memorial Day",
    "4th of July"
  ],
  "title": "Grilled Bratwurst With Beer, Mustard, and Sauerkraut Recipe",
  "full_text": "Grilled Bratwurst With Beer, Mustard, and Sauerkraut Recipe\nJump to recipe\nCook\n60 mins\nActive\n15 mins\nTotal\n60 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(350ml)\nbeer\n(almost any beer will do)\n3\ntablespoons\n(45ml)\nwhole grain mustard\n1 (\n1\n-\npound\n; 450g) package\nsauerkraut\n, with juices\n6\nthyme\nsprigs\nor 3 bay leaves (optional)\n2 pounds (\n900\ng\n)\nbratwurst sausages\nBuns\nand mustard, for serving\nDirections\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\ngrilling grate.\nCombine beer, mustard, and sauerkraut in a 10-inch square-disposable aluminum pan. (Alternatively, construct a tray out of a double layer of heavy-duty aluminum foil, 10 inches square, with sides about 2 inches high.) Stir until mustard is broken up and mixture is homogeneous. Add thyme sprigs or bay leaves (if using). Nestle sausages into sauerkraut.\nPlace tray on hot side of grill and cook until simmering, about 4 minutes. Slide to cooler side of grill. Cover grill, with vents over bratwurst. Cook with all vents open until bratwurst register 140 to 145°F (60 to 63°C) on an instant-read thermometer, about 20 minutes, turning once in the middle.\nRemove lid. Using tongs, remove bratwurst from sauerkraut and place directly on cooking grate over hot side of grill. Cook, turning occasionally, until well browned and crisp, about 3 minutes total. Return to sauerkraut. Toast buns over hot side of grill, if desired. Serve bratwurst with buns, mustard, and sauerkraut from pan.\nSpecial equipment\nGrill\n, 10-inch square disposable aluminum pan,\ninstant-read thermometer\nThis Recipe Appears In\nThe Food Lab: The Best Way to Grill Sausages\nSerious Entertaining: A Beer-Infused Dinner Menu\nGrilled Sausages\nGerman\nGrilled Pork\nMemorial Day\n4th of July"
}