{
  "url": "https://www.seriouseats.com/grillled-corn-tomato-feta-herb-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Ljsck3ZcVxyHLgj4-6I9lnv0Kvw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140902-grilled-corn-tomato-salad-recipe-3-12848867fafa4e8481260fbed0f87de4.jpg",
  "tags": [
    "Vegetarian Salads",
    "Grilling",
    "Feta Cheese",
    "Corn",
    "Herbs"
  ],
  "title": "Grilled Corn, Tomato, Feta, and Herb Salad",
  "full_text": "Grilled Corn, Tomato, Feta, and Herb Salad\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n20 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nbest quality\nextra-virgin olive oil\n1\ntablespoon\njuice\nfrom\n1\nwhole\nlemon\n4\nears\nsweet corn\n, husks removed\n2\npounds\nripe\ntomatoes\n(see note), cut into bite-size chunks\n1/4\ncup\nroughly chopped\nfresh flat-leaf parsley leaves\n1/4\ncup\nroughly chopped\nfresh basil leaves\n1/4\ncup roughly chopped\nfresh\nmint leaves\n8\nounces\nfeta cheese\n, cut into 1/2-inch chunks\nKosher salt\nand freshly\nground black pepper\nDirections\nCombine olive oil and lemon juice in a small bowl and whisk to combine. Set aside.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate. To char corn without a grill, see notes.\nPlace corn directly over hot side of grill and cook, turning occasionally, until charred on all sides and fully tender, about 10 minutes total. Remove corn from grill and allow to rest until cool enough to handle, about 5 minutes.\nWorking one ear at a time, hold corn vertically inside a large bowl and use a sharp knife to remove the kernels. Discard cob. Add tomatoes, parsley, basil, mint, and feta cheese to the bowl. Whisk the dressing and add it to the bowl. Season with salt and pepper and gently fold with clean hands until all the ingredients are incorporated and coated in the dressing. Serve immediately.\nSpecial Equipment\nGrill\n,\nchimney starter\n(optional)\nNotes\nFor the tomatoes, I like to go for nice, heavy, heirloom varieties like Purple Cherokee or orange Amana tomatoes, along with a few smaller cherry or grape tomatoes. But really, the only key is that the tomatoes must be ripe, and that they must be as local as you can find.\nTo char corn without a grill, remove raw corn kernels from husk. Heat 1 tablespoon vegetable oil in a large nonstick or cast iron skillet or wok over high heat until shimmering. Add corn, shake once to distribute, and cook without moving until darkly charred on first side, about 3 minutes. Toss and flip corn and repeat until corn is covered in dark spots, about 8 minutes total. Allow to cool for 10 minutes, then proceed with the second half of step 4.\nRead More\nThe Serious Eats Guide to Corn\nTam Khao Pod Kai Kem (Thai Corn Salad With Salted Duck Egg) Recipe\nMexican Street Corn Salad (Esquites) Recipe\nHoriatiki (Greek Salad) Recipe\nSālād-é-Shirāzi (Persian Cucumber and Tomato Salad) Recipe\nVegetarian Salads\nGrilling\nFeta Cheese\nCorn\nHerbs",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-corn-tomato-feta-and-herb-salad.webp?"
}