{
  "url": "https://www.seriouseats.com/grilling-chicken-involtini-with-prosciutto-and-basil-recipe",
  "image_url": "https://www.seriouseats.com/thmb/eJ4-Ypb0ajXs9496zuTI4uf5h-s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110301-140307-chicken-involtini-5579a7ace0bf45be9465739d97f0ed34.jpg",
  "tags": [
    "Chicken Mains",
    "Italian",
    "Grilled Chicken",
    "Chicken Breast",
    "Memorial Day"
  ],
  "title": "Grilled Chicken Involtini With Prosciutto and Basil Recipe",
  "full_text": "Grilled Chicken Involtini With Prosciutto and Basil Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n45 mins\nBrining Time\n30 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Brine:\n2\nquarts\nwater\n1/3\ncup\nkosher salt\n1/8\ncup\nwhite sugar\nFor the Chicken:\n4\nboneless, skinless chicken breast halves\n, about\n8 ounces each\n, tenders removed\n1\nteaspoon\nkosher salt\n1\nteaspoon\ngranulated garlic\n1/2\nteaspoon\nfreshly ground black pepper\n4\nvery thin slices\nprosciutto\n4\nthin slices\nprovolone cheese\n, halved\n8\nlarge\nbasil leaves\n, plus more for garnish\n2\ncups\ngood-quality\ntomato sauce\nDirections\nIn a large bowl, whisk together 1⁄3 cup salt and white sugar in cold water until completely dissolved to make the brine. Place in chicken breasts in brine. Place in the refrigerator and let brine 30 to 60 minutes.\nRemove the chicken from the brine and pat dry with paper towels. Place 1 chicken breast in a large Ziploc bag and seal. Using a the flat side of a tenderizer or rolling pin, pound chicken to 1/4 inch thick. Remove chicken from bag and repeat with remaining chicken breasts.\nSeason chicken all over with 1 teaspoon salt, granulated garlic, and black pepper. Lay chicken smooth side down and lay 1 piece of prosciutto, 2 half slices of provolone, and 2 basil leaves on top of each breast. Roll chicken into a tight roll and tie together each piece with 2 pieces of butcher twine.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand oil the grilling grate. Grill the chicken over medium heat, keeping the lid closed as much as possible, until browned on all sides, about 12 minutes, turning a quarter turn every 3 minutes. Remove from the grill and let rest for 5 minutes.\nWhile the chicken rests, heat tomato sauce in a small pot over medium-high heat until warmed through. Remove the twine from the chicken pieces, cut into slices, and serve warm on a pool of sauce. Garnish with torn pieces of basil.\nSpecial Equipment\nGrill\nChicken Mains\nItalian\nGrilled Chicken\nChicken Breast\nMemorial Day"
}