{
  "url": "https://www.seriouseats.com/grilled-skillet-cornbread-recipe-7568863",
  "image_url": "https://www.seriouseats.com/thmb/5Yqzuj0TUx8ms8onxiLUwfkZvhk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230802-SEA-Grill-BakedSkilletCornbread-LorenaMasso-22-896da296175f4248999ad8e13b990410.jpg",
  "tags": [
    "Corn",
    "The Latest",
    "Grilling",
    "Cornbread"
  ],
  "title": "Grill-Baked Skillet Cornbread",
  "full_text": "Grill-Baked Skillet Cornbread\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nCooling Time\n5 mins\nTotal\n80 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\n2\nears\nof\ncorn\n, husks and silk removed\n2\npoblano chile peppers\n2\ncups\nmedium- or fine-grind\ncornmeal\n(\n10\nounces\n;\n285\ng\n)\n1\ntablespoon\nsugar\n1\nteaspoon\nbaking powder\n1\nteaspoon\nbaking soda\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half by volume\n1\ncup\nsour cream\n(about\n9 1/2\nounces\n;\n270\ng\n)\n3/4\ncup\n(\n180\nml\n)\nwhole milk\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n5\ntablespoons\nmelted\nunsalted butter\n(about\n2 1/2\nounces\n;\n70\ng\n), divided\n2\nlarge eggs\nDirections\nFor Heating a Charcoal Grill:\nOpen bottom vent completely. Light chimney starter mounded with charcoal briquettes (7 quarts). Once top coals are partially covered with ash, pour into a steeply banked pile against 1 side of the grill. Set cooking grate in place, cover, and open lid vent. Heat until grill is hot  (500°F; 260°C), about 5 minutes.\nSerious Eats / Lorena Masso\nFor Heating a Gas Grill:\nTurn all burners to high, cover, and heat grill until hot (500°F; 260°C), about 15 minutes. Leave primary burner on high and turn off other burner(s). (see notes)\nClean and oil cooking grate. Set corn and poblanos over hotter side of grill (close grill lid if using gas) and cook, turning as needed, until poblanos are blistered and charred in spots, and corn is charred all over, 7 to 10 minutes. Transfer poblanos and corn to cutting board; let cool slightly. (If using a charcoal grill, use tongs to carefully remove cooking grate and add 1 quart of unlit coals to the lit coals in a steeply banked pile, then return cooking grate.)\nSerious Eats / Lorena Masso\nStem, seed, and chop poblanos. Cut kernels from corn; you should have about 1 1/2 cups kernels.\nSerious Eats / Lorena Masso\nPlace a 10-inch cast-iron skillet on the hotter side of the grill. Add cornmeal and toast, stirring frequently, until fragrant, about 5 minutes. Using grill gloves, remove skillet from grill and transfer toasted cornmeal to a large bowl. Whisk sugar, baking powder, baking soda, and salt into cornmeal. Whisk in sour cream, milk, oil, 1/4 cup melted butter, and eggs until combined. Stir in chopped poblanos and corn kernels.\nSerious Eats / Lorena Masso\nBrush empty skillet with remaining 1 tablespoon melted butter. Scrape batter into skillet and smooth top. Place skillet on the cooler side of the grill, cover grill, and bake, rotating skillet halfway through baking, until top is golden brown and toothpick inserted into center comes out clean, 20 to 35 minutes. (For a gas grill, adjust primary burner as needed to maintain grill temperature between 400 to 450°F (200 to 230°C); if using 3-or-more-burner grill, adjust primary burner and second burner, leaving other burners off.Transfer skillet to wire rack and let cornbread cool for at least 30 minutes. Slice and serve.\nSerious Eats / Lorena Masso\nSpecial Equipment\nCharcoal or gas grill, large chimney for charcoal grill, grill gloves, 10-inch cast-iron skillet\nNotes\nThe primary burner on a gas grill is the burner that is connected closest to the gas source. It is the burner that you ignite first on the grill.\nWhile I recommend baking this cornbread on the grill, you can make this recipe in the oven. Adjust the oven rack to the middle position and char the corn and poblano peppers under the broiler, turning occasionally until well charred all over, 3 to 5 minutes. Toast cornmeal in skillet over medium-high heat. Adjust oven temperature to 400F (204C) and bake cornbread until golden brown and cooked through, 20 to 30 minutes.\nMake-Ahead and Storage\nCornbread can be stored in an airtight container, with a sheet of wax paper between the stacked cut layers, for up to 3 days at room temperature.\nCorn\nThe Latest\nGrilling\nCornbread"
}