{
  "url": "https://www.seriouseats.com/grilled-shrimp-rolls-recipe-8673737",
  "image_url": "https://www.seriouseats.com/thmb/OMQU_RxuTI5SBAR7Wg5-Umqczoo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210727-GRILLEDSHRIMPROLLS-JANJIGIAN-seriouseats-primary-993ababe1c25463fa0e2cee604500a0b.jpg",
  "tags": [
    "Grilled Shrimp",
    "The Latest",
    "Grilling"
  ],
  "title": "Easy Grilled Shrimp Rolls With Herb Mayo",
  "full_text": "Easy Grilled Shrimp Rolls With Herb Mayo\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nChilling Time\n60 mins\nTotal\n85 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Herby Mayonnaise:\n1/4\ncup\n(\n60\ng\n)\nmayonnaise\n2\ntablespoons\n(\n10\ng\n) minced\nfresh parsley\nleaves\n2\ntablespoons\n(\n10\ng\n) thinly sliced\nchives\n, plus more for garnishing\n1\ntablespoon\n(\n15\nml\n)\nlemon juice\n1\nteaspoon\n(\n5\ng\n)\nDijon mustard\n1/2\nteaspoon\nsugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Grilled Shrimp and Buns:\n1\nteaspoon\nchile powder\n(see note)\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nsweet paprika\n1/2\nteaspoon\ngarlic powder\n1/2\nteaspoon\nonion powder\n1/8\nteaspoon\nfreshly\nground black pepper\n1 1/2\npounds\n(\n630\ng\n) large\nshrimp\n, peeled, deveined, and patted dry with paper towels\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nNeutral oil, such as canola or\nvegetable oil\n, for greasing grill grates\n6\ntop-split\nhot dog buns\n, preferably Pepperidge Farm\n1 1/2\nounces\n(\n3\ntablespoons\n;\n45\ng\n)\nunsalted butter\n, melted\nBoston or\nbutter lettuce\nleaves, for serving\nDirections\nFor the Herby Mayonnaise:\nIn a medium bowl, whisk together mayonnaise, parsley, chives, lemon juice, mustard, sugar, and salt. Cover and refrigerate.\nAndrew Janjigian\nFor the Grilled Shrimp and Buns:\nIn a small bowl, combine chile powder, salt, paprika, garlic powder, onion powder, and pepper, and stir until well combined. Set aside.\nAndrew Janjigian\nThread shrimp onto sets of 2 skewers, alternating heads to tails and pushing shrimp so that they are nestled snugly together; you should have 12 shrimp on each set of skewers. Lay skewers on top of a baking dish so that shrimp are suspended above bottom of dish. Refrigerate, uncovered, for 1 hour. When shrimp are ready to grill, brush both sides with olive oil and sprinkle evenly with prepared spice blend.\nLight 1/2 chimney of charcoal\n. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nPlace shrimp directly over hot side of grill and cook until shrimp are lightly charred in spots on bottom side, about 2 minutes. Flip shrimp and continue to cook until just cooked through and lightly charred on second side, about 2 minutes longer. Transfer shrimp to a cutting board; set aside. Remove herby mayonnaise from refrigerator to temper slightly, and set aside.\nBrush exterior of each hot dog bun with melted butter. Place buns over hot side of grill. Cook, flipping once halfway through, until buns are soft and lightly charred, about 30 seconds. Transfer buns to a plate or rimmed baking sheet; set aside.\nAndrew Janjigian\nCarefully remove skewers from shrimp and, using a sharp knife, cut shrimp into bite-size pieces. Transfer to bowl with herby mayonnaise and gently stir to evenly coat shrimp.\nAndrew Janjigian\nLine inside of each toasted bun with lettuce leaves, divide shrimp evenly among buns, sprinkle with chives, and serve immediately.\nAndrew Janjigian\nSpecial equipment\nGas\nor\ncharcoal\ngrill, 12-inch skewers\nNotes\nWhile developing this recipe, I used \"chili powder seasoning\" produced by McCormick's, which is a blend of ground spices that includes cayenne, cumin, and paprika. Similar seasoning mixes can be found from a number of brands, some simply labeled \"chili powder.\" However, this recipe was also tested with different powdered chile peppers; most any fruity dried chile, like gochugaru, will work. If you cannot find a chili powder like the one I describe above and would like to approximate its flavor profile, I recommend substituting with 3/4 teaspoon ground cumin and 1/4 teaspoon ground cayenne pepper.\nMake-ahead and Storage\nThe herby mayonnaise can be prepared in advance and refrigerated in an airtight container for up to 3 days.\nGrilled Shrimp\nThe Latest\nGrilling",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-grilled-shrimp-rolls-with-herb-mayo.webp?"
}