{
  "url": "https://www.seriouseats.com/grilled-chicken-caesar-salad-recipe-8656144",
  "image_url": "https://www.seriouseats.com/thmb/ii-t82tRXCK6wWrnuoHYf4x6f8E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Grilled-Chicken-Caesar-Salad-hero-03-e5e0ed44068d4f3188c9732bd801f2b5.jpg",
  "tags": [
    "Chicken",
    "The Latest",
    "Salads",
    "Grilling",
    "Grilled Chicken"
  ],
  "title": "Grilled Chicken Caesar Salad",
  "full_text": "Grilled Chicken Caesar Salad\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nMarinating\n30 mins\nTotal\n65 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n3 tablespoons (\n45\nml\n)\nfish sauce\n2 tablespoons (\n30\nml\n)\nwater\n2 tablespoons (\n30\nml\n)\nsoy sauce\n1 tablespoon (\n15\nml\n)\nhoney\n1/2\nteaspoon\nkosher salt\n1/2\nteaspoon freshly\nground black pepper\n6\nboneless, skinless\nchicken breast\nhalves\n(6 to 8 ounces;170 to 225g each), tendon removed\nFor the Salad:\n1\nrecipe\nfor\nCaesar Salad Dressing\nor\nstore-bought Caesar salad dressing\n1/4\ncup\n(60ml)\nextra-virgin olive oil\n, divided\nOne\n12-inch\nbaguette\n, cut on bias into 1/2-inch-thick slices\n1\ngarlic\nclove\n, peeled\n3\nromaine lettuce hearts\n(about 6\nounces;\n170g each), halved lengthwise through cores\n1/4 cup\nParmigiano-Reggiano\ncheese (\n1/2\nounce\n; 14g), grated\n2\nlemons\n, halved\nDirections\nFor the Chicken:\nPlace 1 chicken breast in a resealable plastic bag or between two pieces of plastic wrap. Using a meat pounder, rolling pin, or small skillet, pound chicken breast into an even thickness, about 3/4 inch thick. Repeat with the remaining 5 breasts.\nSerious Eats / Kevin White\nIn a large bowl, whisk fish sauce, water, soy sauce, honey, salt, and pepper together. Add chicken breasts and turn to coat evenly. Refrigerate for 30 minutes or up to 12 hours.\nSerious Eats / Kevin White\nFor a Charcoal Grill:\nOpen bottom vent completely. Light large chimney starter filled with charcoal briquettes (6 quarts). When top coals are partially covered with ash, pour evenly over half of grill. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot, about 5 minutes.\nSerious Eats / Kevin White\nFor a Gas Grill:\nTurn all burners to high, cover, and heat grill until hot, about 15 minutes. Leave all burners on high.\nRemove chicken from brine, letting excess drip off (do not pat dry), then brush with oil as needed until evenly coated. Clean and oil the cooking grate. Place chicken, skin side down, on grill and cook (over coals if using charcoal or covered if using gas) until chicken develops dark grill marks, 3 to 5 minutes. Flip, and continue to cook until chicken registers 155℉ (68℃, 3 to 5 minutes longer. Transfer the chicken to a cutting board and tent with aluminum foil while preparing the salad.\nSerious Eats / Kevin White\nFor the Salad:\nTransfer 2 tablespoons of the prepared Caesar dressing to a small bowl and whisk with 2 tablespoons (30ml) oil.\nBrush bread with remaining 2 tablespoons (30ml) oil and grill (over coals if using charcoal), uncovered, until browned on both sides, about 1 minute per side. Transfer to a serving platter or individual plates and rub all over with the garlic clove and sprinkle lightly with salt and pepper.\nSerious Eats / Kevin White\nBrush the cut sides of romaine halves with reserved oil and dressing mixture; place half of romaine, cut side down, on grill (over coals if using charcoal). Grill, uncovered, until lightly charred, 1 to 2 minutes. Transfer to the platter or plates with the bread. Repeat with the remaining romaine heart halves. Grill the lemons cut side down until lightly charred, about 1 minute and transfer to the platter or plates.\nSerious Eats / Kevin White\nSlice the chicken thin and arrange with the grilled romaine. Drizzle the romaine and chicken with the remaining dressing. Sprinkle with Parmesan. Serve with the grilled lemon halves for squeezing over the salad.\nSerious Eats / Kevin White\nSpecial Equipment\nCharcoal or gas grill\nMake-Ahead and Storage\nChicken\nThe Latest\nSalads\nGrilling\nGrilled Chicken",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-chicken-caesar-salad.webp?"
}