{
  "url": "https://www.seriouseats.com/grilling-blackened-chicken-sandwich-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0KmRo2MhZY8ZD4th3jqp2RjgcCM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100923-blackened-chicken-sandwich-ad97e3ae83e340c7bef82bccdaabd508.jpg",
  "tags": [
    "Sandwiches",
    "Grilled Chicken",
    "Chicken Breast",
    "Memorial Day"
  ],
  "title": "Blackened Chicken Sandwich Recipe",
  "full_text": "Blackened Chicken Sandwich Recipe\nClose\nJump to recipe\nPrep\n50 mins\nCook\n25 mins\nBrine\n30 mins\nTotal\n105 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nskinless, boneless chicken breasts\n, about\n8 ounces\neach\nFor the Brine:\n1\nquart\nice cold\nwater\n1/8\ncup\nkosher salt\n1/8\ncup\nsugar\nFor the Rub:\n1\nteaspoon\npaprika\n1/2\nteaspoon\ngarlic powder\n1/2\nteaspoon\nonion powder\n1/2\nteaspoon\ndried thyme\n1/4\nteaspoon\ndried oregano\n1/4\nteaspoon\ncumin\n1/4\nteaspoon\nkosher salt\n1/4\nteaspoon\nfreshly\nground black pepper\n1/8\nteaspoon\ncayenne pepper\n1/8\ncup\nolive oil\n1\nlarge\nred bell pepper\n1\nmedium\nred onion\n, cut into 1/2-inch disks and skewered horizontally\n4\nslices\npepper Jack cheese\nGreen leaf lettuce\nSriracha mayonnaise\n4\nclub rolls\nDirections\nFor the Brine:\nin a small, shallow bowl whisk together the the water, salt, and sugar until the solids are dissolved. Slice each chicken breast in half horizontally. Place the chicken breast slices in the brine and refrigerator for 30 minutes.\nMeanwhile, make the rub. In small bowl, mix together paprika, garlic powder, onion powder, thyme, oregano, cumin, salt, black pepper, and cayenne pepper. Remove chicken from brine and pat dry. Brush the chicken slices lightly with olive oil, then sprinkle evenly with the spice mixture. Flip the chicken over and repeat. Set aside in the refrigerator until ready to grill.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grate. Brush onion slices lightly with olive oil on both sides. Season with salt and pepper. Grill onions and pepper, turning occasionally, until peppers are completely charred all over and onions until charred on both side and slightly softened, 5-8 minutes total. Remove from grill and place pepper in a paper or Ziploc bag and seal. When the pepper is cool enough to handle, about 5 minutes, remove skin and slice into 1/8-inch strips. Remove skewer from onion and separate into individual rings.\nPlace chicken slices on grill and cook over high heat until first side is blackened, 3 to 5 minutes. Flip and place slice of cheese over chicken and grill until second side is blackened and chicken is cooked through, 3 to 5 minutes longer. Remove from grill and allow to rest for 3 minutes. While the chicken is resting, place rolls on the grill, cut side down, and grill until lightly browned. Remove from grill, spread top side of bread with Sriracha mayonnaise and assemble sandwich with the chicken, onion rings, pepper slices, and lettuce. Serve immediately.\nSandwiches\nGrilled Chicken\nChicken Breast\nMemorial Day"
}