{
  "url": "https://www.seriouseats.com/grilled-stuffed-flank-steak-pesto-mozzarella-prosciutto-recipe",
  "image_url": "https://www.seriouseats.com/thmb/YrM7cbw9XFtmgRp8s1Wb7EsU8Us=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__20140503-stuffed-rolled-flank-steak-pesto-chile-pepper-jack-recipe-food-lab-1-cb8689cc871645e290eb16b53ea1e680.jpg",
  "tags": [
    "Beef Mains",
    "Grilled Beef",
    "Flank Steaks",
    "Pine Nuts",
    "Quick Dinners"
  ],
  "title": "Grilled Stuffed Flank Steak With Pesto, Mozzarella, and Prosciutto Recipe",
  "full_text": "Grilled Stuffed Flank Steak With Pesto, Mozzarella, and Prosciutto Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n35 mins\nActive\n45 mins\nResting Time\n5 mins\nTotal\n55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nflank steak\n,\n2 to 2 1/2\npounds\n, trimmed of excess fat\nKosher salt\nand freshly\nground black pepper\n1\nrecipe\nclassic Ligurian pesto\n3/4\ncup\ntoasted\npine nuts\n3\nounces\nthinly sliced\nprosciutto\n4\nounces\nthinly sliced\nlow-moisture mozzarella cheese\nExtra-virgin olive oil\nDirections\nLay steak on a cutting board with grain running parallel to the edge of the counter. Trim left and right edges to form a clean rectangle and reserve scraps for another use. Hold steak flat with your non-knife hand and, with a sharp boning knife, carefully butterfly the steak, leaving the back edge attached by 1/2- to 1/4-inch of meat. Open up steak and flatten the seam gently with your hand to form a large perfect rectangle.\nSeason steak on exposed side with salt and pepper. Spread half of pesto evenly over steak, leaving a 1-inch border at the top and the bottom. Sprinkle with pine nuts. Layer prosciutto and mozzarella over steak, leaving the border at the top and bottom.\nCarefully roll the steak away from you (the grain should run width-wise), tightening as you go until it is rolled into a cylinder. Let it rest with its seam-side down.\nTie the beef tightly with twine, spacing the ties evenly every 1 1/2 inches. Insert a skewer through each piece of twine. Using a sharp knife, carefully cut between the ties to make the pinwheels. Season with salt and pepper.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. Place the pinwheels on the hot side of the grill and cook without moving until well charred on first side, about 3 minutes. Flip steaks and char second side, about 3 minutes longer. Transfer to cooler side of grill, cover, and cook until an instant read thermometer inserted into the center registers 120°F (49°C) for medium-rare or 130°F (54°C) for medium. Transfer to a platter, let rest for 5 minutes, and serve with remaining pesto and a drizzle of olive oil.\nAlternatively, to finish indoors:\nHeat 2 tablespoons vegetable or canola oil in a large stainless steel or cast iron skillet over high heat until shimmering. Add pinwheels and cook without moving until well browned on first side, about 3 minutes. Flip pinwheels and continue cooking until second side is browned and an instant read thermometer registers 120°F (49°C) for medium-rare or 130°F (54°C) for medium, reducing heat as necessary if steak smokes excessively or starts to burn. Transfer to a wire rack set in a rimmed baking sheet and allow to rest 5 to 10 minutes. Serve.\nSpecial Equipment\nButcher's twine,\nwooden skewers\n,\ngrill\nThis Recipe Appears In\nThe Food Lab: How to Make Grilled Stuffed Flank Steak Pinwheels\nGrilled Stuffed Flank Steak With Pesto, Mozzarella, and Prosciutto\nBeef Mains\nGrilled Beef\nFlank Steaks\nPine Nuts\nQuick Dinners"
}