{
  "url": "https://www.seriouseats.com/grilled-loaded-nachos-recipe-11726634",
  "image_url": "https://www.seriouseats.com/thmb/ps9BzTDAJ6tXywJw_eSZxvV_xhE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250430-SEA-UltimateSmokedNachos-LorenaMasso-Beauty1-35-a0d81f942b394edf9137f9b2f09269a4.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Recipes",
    "Nachos"
  ],
  "title": "The Ultimate Loaded Nachos, but Fresh off the Grill",
  "full_text": "The Ultimate Loaded Nachos, but Fresh off the Grill\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nTotal\n60 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n453\ng\n)\nlarge ripe tomatoes\n, cored and halved along equator\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, divided\n3/4\nteaspoon\nDiamond Crystal kosher salt\n, divided; for table salt use half as much by volume\nFreshly ground black pepper\n1 1/2\ncups\nwood chips\n, soaked in water for 10 minutes then drained (see notes)\n1\nmedium\nred onion\n(\n8\nounces\n;\n226\ng\n), cut crosswise into 1/2-inch thick rounds\n2\npoblano chiles\n, stemmed, halved, and seeded\n2\nj\nalapeño chiles\n, stemmed, halved, and seeded\n1\n(15-ounce) can\nblack beans\n, drained and rinsed\n1\ntablespoon\n(\n15\nml\n)\nlime juice\n, plus lime wedges for serving\n1\ntablespoon\nchopped\nfresh cilantro\n, plus more for garnish\n8\nounces\n(\n226\ng\n)\nMonterey Jack cheese\n, shredded (\n2\ncups\nshredded)\n8\nounces\n(\n226\ng\n) sharp\ncheddar cheese\n, shredded (\n2\ncups\nshredded)\n12\nounces\ntortilla chips\n(about\n1\nlarge\nbag\n; see notes)\n2\nwhole\nscallions\n, thinly sliced\nSour cream\n,\nguacamole\n, and/or\nsalsa\nfor serving, optional\nDirections\nToss tomatoes with 1 tablespoon oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper in large bowl. Let stand for at least 15 minutes or up to 1 hour.\nSerious Eats / Lorena Masso\nMeanwhile, using large piece of heavy-duty aluminum foil, wrap wood chips in 8- by 4 1/2–inch foil packet. (Make sure chips do not poke holes in sides or bottom of packet. If using a gas grill, make sure there are no more than 2 layers of foil on bottom of packet.) Cut 2 evenly spaced 2-inch slits in top of packet.\nSerious Eats / Lorena Masso\nFor a Charcoal Grill:\nOpen bottom vent halfway. Light large chimney starter mounded with charcoal briquettes (7 quarts charcoal). When top coals are partially covered with ash, pour two-thirds evenly over half of grill, then pour remaining coals over other half of grill. Place wood chip packet along 1 side of grill near center between hotter and cooler coals. Set cooking grate in place, cover, and open lid vent halfway. Heat grill until hot and wood chips are smoking, about 5 minutes.\nSerious Eats / Lorena Masso\nFor a Gas Grill:\nRemove cooking grate and place wood chip packet directly on primary burner. Set cooking grate in place, turn on all burners. Cover and heat grill until hot and wood chips are smoking, about 15 minutes. Lower primary burner to medium and keep other burner(s) on high (see note).\nClean and oil cooking grate. Brush onion slices on both sides with 1 tablespoon oil. Grill tomato halves, onion slices, poblanos, and jalapeños on hotter side of grill (covered if using gas) until poblanos and jalapeños are well blistered all over, 5 to 10 minutes, and onion rounds and tomatoes are deep brown on both sides and just tender, 10 to 15 minutes, checking onions every 5 minutes and flipping and rotating as needed to ensure even cooking. (You may need to cook in batches.) As poblanos and jalapeños finish cooking, transfer to now-empty bowl, cover tightly with aluminum foil, and let sit until skins soften, about 5 minutes. Transfer onion rounds and tomato halves to cutting board as they finish cooking. If using a gas grill, turn all burners to medium.\nSerious Eats / Lorena Masso\nRoughly chop onion rounds into 1/4-inch pieces. Chop tomato into 1/2-inch pieces (these will be soft and mushy, which is OK). Transfer both to a large bowl, including all tomato juices.\nSerious Eats / Lorena Masso\nUsing paper towels, peel away skin from peppers. Slice poblanos into 1/4-inch-thick strips, discarding seeds as you slice. Thinly slice jalapeños crosswise into rounds and add both peppers to bowl with onions and tomatoes. Add black beans, 1 tablespoon oil, 1 tablespoon lime juice,1 tablespoon minced cilantro, and 1/4 teaspoon salt and stir to combine. Season with additional salt to taste (but be prudent as lots of salty cheese will be added.) In a separate bowl combine Monterey Jack, and cheddar cheeses.\nSerious Eats / Lorena Masso\nTo Assemble and Cook the Nachos:\nSpread 1/3 of tortilla chips evenly in a 12-inch cast iron skillet or into bottom of a 9- by 13-inch disposable aluminum foil pan. Sprinkle with 1/3 of vegetable mixture followed by 1/3 cheese mixture. Repeat layering of chips and vegetable mixture and cheese mixture 2 more times, for a total of 3 layers with the cheese layer on top. Place skillet on cooler side of grill, cover, and cook until cheese is melted, 10 to 30 minutes. Sprinkle with scallions and cilantro and serve with lime wedges. Optionally, serve with dollops of sour cream and guacamole and salsa on the side.\nSerious Eats / Lorena Masso\nSpecial Equipment\nCharcoal grill or gas grill, 7 quarts charcoal briquettes if using charcoal grill, grilling tongs and grill-grate brush, 12-inch cast iron skillet or 9- by 13-inch disposable aluminum foil pan\nNotes\nI prefer to use fruit wood chips such as apple or cherry wood in this recipe for their milder smokey flavor.\nTo avoid the risk of flare-ups and mess, do not substitute larger wood chunks for the soaked and wrapped wood chips called for in the recipe, especially with a gas grill.\nThe primary burner on a gas grill is the burner that is connected closest to the gas source. It is the burner that you ignite first on the grill.\nI recommend thicker cut, sturdy chips such as Siete Maíz Corn Tortilla Chips With Sea Salt or On the Border brand)\nMake-Ahead and Storage\nThese nachos are best eaten immediately.\nSnacks & Appetizers\nThe Latest\nRecipes\nNachos"
}