{
  "url": "https://www.seriouseats.com/grilling-mustard-and-herb-crusted-rack-of-lamb-recipe",
  "image_url": "https://www.seriouseats.com/thmb/mtvx-SUuo3p1K6JUlbDXY36_tno=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20101019-rack-of-lamb-afa441303d7446bdb864126a43f3a2a3.jpg",
  "tags": [
    "Lamb Mains",
    "Grilled Lamb",
    "Rack of Lamb"
  ],
  "title": "Mustard and Herb Crusted Rack of Lamb Recipe",
  "full_text": "Mustard and Herb Crusted Rack of Lamb Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n30 mins\nTotal\n65 mins\nServes\n4\nto 5 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nfresh\nbread crumbs\n2\ntablespoons\nfinely chopped fresh flat-leaf parsley\n2\nteaspoons\nfinely chopped\nfresh mint\n1\nteaspoons\nminced\nfresh rosemary\n1\nteaspoon\nsalt\n, divided\n1\nteaspoon\nblack pepper\n, divided\n1\ntablespoons\nolive oil\n2\nfrenched\n7-10 rib racks\nof\nlamb\n, trimmed of all but a thin layer of fat, about\n1 1/2-2 pounds\neach\n2\ntablespoons\nDijon mustard\nDirections\nMix the bread crumbs, parsley, mint, rosemary, 1/2 teaspoon salt, and 1/2 teaspoon pepper together in a small bowl. Drizzle with olive oil and stir to combine. Set aside.\nLet the lamb come to room temperature while preparing the grill.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate. Season the racks liberally with salt and pepper. Place the lamb fat side down close to, but not directly over the coals. Cover and grill until well browned, about 8 minutes, rotating 180 degrees half way through. Remove racks from the grill and place fat side up on a platter or cutting board.\nSpread the mustard over the fat side of the lamb. Carefully press the breadcrumb mixture into the mustard into each rack.\nPlace the racks back on the grill, fat side up, close to, but not directly over the coals. Continue to cook until an instant read thermometer registers 130 degrees when inserted into the side of the rack, another 8 to 10 minutes. Remove from the grill and let rest uncovered for 10 minutes. Cut between each rib into chops and serve.\nLamb Mains\nGrilled Lamb\nRack of Lamb",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mustard-and-herb-crusted-rack-of-lamb-recipe.webp?"
}