{
  "url": "https://www.seriouseats.com/grilled-vegetable-board-recipe-11744803",
  "image_url": "https://www.seriouseats.com/thmb/x9CFD7J5Eu8KYpMlChbHa55A4Xs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250603-SEA-grillveggieboard-GregDuPree-HERO-0f23788951c9421093720b83af3f3b38.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Snacks & Appetizers",
    "Vegetable Sides",
    "Grilling"
  ],
  "title": "A Grilled Vegetable Board That’s Bold, Beautiful, and Built to Share",
  "full_text": "A Grilled Vegetable Board That’s Bold, Beautiful, and Built to Share\nClose\nJump to recipe\nPrep\n30 mins\nCook\n40 mins\nTotal\n70 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Lemon Vinaigrette:\n1/2\nteaspoon\nlemon zest\nplus\n2\ntablespoons\nfresh\nlemon juice\nfrom\n1\nlemon\n1\ntablespoon\n(\n15\nml\n)\nDijon mustard\n1\nclove\ngarlic\n, finely grated or minced\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n1\ntablespoon\nminced fresh\nchives\n1\ntablespoon\nminced fresh\nbasil leaves\nKosher salt\nto taste\nFreshly\nground pepper\nto taste\nFor the Grilled Vegetables and Bread:\n2\npounds\n(\n907\ng\n) large, ripe but firm\ntomatoes\n, halved lengthwise\n1 3/4\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume\n3/4\nteaspoon\nfreshly\nground black pepper\n, divided\n3\nmedium\nred, yellow, or orange\nbell peppers\n(about\n6\nounces\n;\n170\ng each\n)\n2\nmedium\nred onions\n(about\n8\nounces\n;\n226\ng\neach), cut into 1/2-inch thick rounds\n10 to 15\nwooden\ntoothpicks\n, soaked in water for at least 10 minutes, then drained\n1 1/2\npounds\n(\n680\ng\n)\nzucchini\n(about\n3\nlarge\n), ends trimmed and cut lengthwise into 1/2-inch thick planks\n2\npounds\neggplant\n(about\n2\nItalian\neggplant\n), ends trimmed, sliced crosswise into 1/2-inch thick rounds\n6\ntablespoons (90 ml)\nextra-virgin olive oil\n, divided\n1\n(1-pound)\nloaf\ncrusty Italian or French\nbread\n, sliced into 1-inch-thick pieces on the bias\n2\nlemons\n, halved, optional\nFor the Board:\n1\npound\n(\n453\ng\n)\nburrata\nor fresh mozzarella cheese\nMarinated olives\nFresh\nbasil\nand/or mint leaves or herbs of your choice\nDirections\nFor the Vinaigrette:\nIn a small bowl, whisk together lemon zest and juice, mustard, and garlic. Whisking constantly, slowly drizzle in oil until emulsified. Whisk in chives and basil and season to taste with salt and pepper. (Vinaigrette can be refrigerated in a tightly sealed container for up to 2 days. Bring to room temperature before using and whisk or shake in a tightly sealed jar to recombine.)\nSerious Eats/ Greg Dupree\nFor the Grilled Vegetables and Bread:\nIn a large bowl, toss tomatoes with 1/2 teaspoon kosher salt and 1/4 teaspoon pepper. Let stand for at least 15 minutes or up to 1 hour.\nMeanwhile, slice tops and bottoms off  bell peppers and remove cores. Make a slit down 1 side of each bell pepper, then press flat into 1 long strip. If necessary, remove ribs and remaining seeds with knife, then cut in half crosswise.\nPush 1 toothpick through length of each onion round to keep onion intact while grilling. On 2 rimmed baking sheets, lay flat in a single layer the prepared pepper pieces, onions, zucchini, tomato, and eggplant. Brush both sides of all vegetables all over with 3 tablespoons oil. Brush eggplant last since it will absorb more oil. Sprinkle vegetables with 1 teaspoon kosher salt and 1/2 teaspoon pepper.\nSerious Eats/ Greg Dupree\nBrush bread slices evenly on both sides with remaining 3 tablespoons oil. Sprinkle evenly on both sides with remaining 1/4 teaspoon salt.\nFor a Charcoal Grill:\nOpen bottom grill vent completely. Fill a large chimney starter with charcoal briquettes (6 quarts charcoal) and light briquettes. When top coals are partially covered with grey ash, pour in an even layer over entire bottom of grill grate. Set cooking grate in place, cover with lid, and open lid vent completely. With lid covered and vent open, heat grill until hot, about 5 minutes.\nFor a Gas Grill:\nTurn all burners to high, cover grill and heat until hot, about 15 minutes.\nClean and oil cooking grate. Grill bell peppers, eggplant, and onions until well browned and tender, 10 to 15 minutes, flipping and moving vegetables as needed to ensure even cooking and transferring vegetables back to rimmed baking sheet as they finish cooking.\nSerious Eats/ Greg Dupree\nPlace all cooked bell peppers in a large bowl while still hot, cover bowl tightly with plastic wrap or lid, and steam covered to loosen skins, at least 5 minutes. Meanwhile, remove toothpicks from onions and separate into rings. While vegetables are still warm, brush just top side of cooked onion and eggplant with prepared lemon vinaigrette.\nOn now-empty grill, grill tomatoes and zucchini slices until well browned and tender, 6 to 10 minutes, flipping about halfway through. Return vegetables to rimmed baking sheet as they finish cooking and brush just top side of hot vegetables lightly with prepared lemon vinaigrette. Transfer remaining lemon vinaigrette to a serving bowl.\nSerious Eats/ Greg Dupree\nOn now-empty grill, place prepared bread slices and lemon halves (if using) and cook until lightly charred on both sides, about 2 minutes per side.\nSerious Eats/ Greg Dupree\nOnce peppers are cool enough to handle, use paper towels to help peel off skins and discard skins. Slice into thin strips and return to rimmed baking sheet.\nTo Serve:\nArrange grilled vegetables and bread attractively on a large serving board or platter, with remaining lemon vinaigrette in serving bowl. Garnish platter with other herbs of your choice and serve with fresh burrata or mozzarella cheese, grilled lemon halves, and/or marinated olives, or really whatever serving accompaniments you choose.\nSpecial Equipment\nGas or charcoal grill, charcoal briquettes and chimney starter if using charcoal grill, grill tongs and grill spatula, wooden toothpicks\nMake-Ahead and Storage\nThe vinaigrette can be made ahead and refrigerated in an airtight container for up to 5 days. Whisk or shake in a tightly sealed jar to recombine.\nThe grilled vegetables can be held for up to 6 hours at room temperature or refrigerated in an airtight container for up to 2 days. If refrigerating the vegetables, rewarm gently on a hot grill before serving for about 1 minute.\nThe Latest\nRecipes\nSnacks & Appetizers\nVegetable Sides\nGrilling",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/a-grilled-vegetable-board-thats-bold-beautiful-and-built-to-share.webp?"
}