{
  "url": "https://www.seriouseats.com/grilled-stuffed-flank-steak-roasted-chilies-pepper-jack-cheese-recipe",
  "image_url": "https://www.seriouseats.com/thmb/VIqihM_ZWc9MHAFzGwsE6jl-fuo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__20140503-stuffed-rolled-flank-steak-pesto-chile-pepper-jack-recipe-food-lab-5-6a4f1278cac24bbd8253637c3f2e81fc.jpg",
  "tags": [
    "Beef Mains",
    "Grilled Beef",
    "Flank Steaks",
    "Cheese",
    "Chile Pepper"
  ],
  "title": "Grilled Stuffed Flank Steak With Roasted Chilies and Pepper Jack Cheese Recipe",
  "full_text": "Grilled Stuffed Flank Steak With Roasted Chilies and Pepper Jack Cheese Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n45 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nwhole\npoblano\nor\nHatch chiles\n1\ntablespoon\nancho chile powder\n1/2\nteaspoon\nground cumin\n3\ncloves\ngarlic\n, minced (about\n1\ntablespoon\n)\nKosher salt\nand freshly\nground black pepper\n1\nwhole\nflank steak\n,\n2 to 2 1/2\npounds\n, trimmed of excess fat\n4\nounces\nthinly sliced\npepper Jack cheese\nDirections\nPlace chiles directly over the flame of a gas burner or on a foil-lined rimmed baking sheet under a broiler preheated to high heat. Cook, turning occasionally, until charred and blackened over every surface. Wrap in aluminum foil and let rest for 10 minutes. Remove from foil and carefully peel chiles and discard skin. Open chiles flat and remove seeds and stems. Lay flattened chiles between two layers of paper towels and press gently to remove excess moisture. Set aside.\nCombine chile powder, cumin, garlic, 2 teaspoons salt, and 1/2 teaspoon black pepper in a small bowl and mix with fingers to form a paste. Set aside.\nLay steak on a cutting board with grain running parallel to the edge of the counter. Trim left and right edges to form a clean rectangle and reserve scraps for another use. Hold steak flat with your non-knife hand and, with a sharp boning knife, carefully butterfly the steak, leaving the back edge attached by 1/2- to 1/4-inch of meat. Open up steak and flatten the seam gently with your hand to form a large perfect rectangle.\nRub chile paste into exposed surface of steak. Layer with flattened chiles and pepper jack cheese, leaving a 1-inch border at the top and the bottom.\nCarefully roll the steak away from you (the grain should run width-wise), tightening as you go until it is rolled into a cylinder. Let it rest with its seam-side down.\nTie the beef tightly with twine, spacing the ties evenly every 1 1/2 inches. Insert a skewer through each piece of twine. Using a sharp knife, carefully cut between the ties to make the pinwheels. Season with salt and pepper.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. Place the pinwheels on the hot side of the grill and cook without moving until well charred on first side, about 3 minutes. Flip steaks and char second side, about 3 minutes longer. Transfer to cooler side of grill, cover, and cook until an instant read thermometer inserted into the center registers 120°F for medium-rare or 130°F for medium. Transfer to a platter, let rest for five minutes, and serve.\nAlternatively, to finish indoors:\nHeat 2 tablespoons vegetable or canola oil in a large stainless steel or cast iron skillet over high heat until shimmering. Add pinwheels and cook without moving until well browned on first side, about 3 minutes. Flip pinwheels and continue cooking until second side is browned and an instant read thermometer registers 120°F for medium-rare or 130°F for medium, reducing heat as necessary if steak smokes excessively or starts to burn. Transfer to a wire rack set in a rimmed baking sheet and allow to rest 5 to 10 minutes. Serve.\nNotes\nThis steak can also be prepared indoors. See Step 8 for pan-frying instructions.\nSpecial Equipment\nButcher's twine, wooden skewers, grill\nThis Recipe Appears In\nThe Food Lab: How to Make Grilled Stuffed Flank Steak Pinwheels\nGrilled Stuffed Flank Steak With Roasted Chilies and Pepper Jack Cheese\nBeef Mains\nGrilled Beef\nFlank Steaks\nCheese\nChile Pepper"
}