{
  "url": "https://www.seriouseats.com/grilling-spanish-spice-rubbed-chicken-breasts-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LucEilP2JIfJRiZUhRPzxLVG7WU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100317-spanish-spice-rubbed-chicken-large-bee4c4506ca249aa9c8a3f4c3ce49281.jpg",
  "tags": [
    "Grilled Chicken",
    "Spanish",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Chicken Breast"
  ],
  "title": "Spanish Spice-Rubbed Chicken Breasts Recipe | Grilling",
  "full_text": "Spanish Spice-Rubbed Chicken Breasts Recipe | Grilling\nClose\nJump to recipe\nPrep\n50 mins\nCook\n30 mins\nChilling Time\n3 hrs\nTotal\n4 hrs 20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nbone-in split chicken breasts\nFor the Brine:\n2\nquarts\ncold\nwater\n1/2\ncup\nsugar\n1/2\ncup\nsalt\nFor the Rub:\n2\ntablespoons\nSpanish paprika\n1 1/2\nteaspoons\nground cumin\n1 1/2\nteaspoons\ndry mustard\n1 1/2\nteaspoons\nground\nfennel seed\n1\nteaspoon\ncoarsely\nground black pepper\n2\nteaspoons\nkosher salt\nFor the Parsley-Mint Sauce:\n2\nserrano chiles\n1 1/2\ncups\ntightly packed\nfresh flat-leaf parsley\n2/3\ncup\ntightly packed fresh\nmint leaves\n3\ncloves\ngarlic\n, roughly chopped\n2\ntablespoons\nhoney\n2\ntablespoons\nDijon mustard\n3/4\ncup\nolive oil\nKosher salt\nand freshly\nground black pepper\nDirections\nWhisk together the ingredients for the brine until the salt and sugar are dissolved. Place the chicken breasts in the brine, using a plate to keep them submerged, and brine in the refrigerator for 30 to 60 minutes.\nWhile the chicken is brining, combine all of ingredients for the rub in a small bowl. Remove the chicken from the brine and pat dry with paper towels. Rub the breasts on all over with the rub and place in a Ziploc bag and let sit in the refrigerator for 2 hours to overnight.\nLight one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over the charcoal grate. Grill the serrano chiles until charred on all sides and remove to a small bowl, cover, and let sit for 5 to 10 minutes. Peel and roughly chop the chiles and add them along with the parsley, mint, and garlic to a food processor and pulse until coarsely chopped. Add the honey and mustard and process until combined. With the motor running, slowly add the olive oil and blend until emulsified. Season to taste with salt and pepper, then transfer to a small bowl and set aside.\nBrush the chicken lightly with olive oil and grill, skin side down until golden brown and crisp, about 4 to 5 minutes. Turn the breasts over, cover, and continue to cook until an instant read thermometer reads 165°F when inserted into the thickest part of the breast, about 5 to 10 minutes more.\nTransfer chicken to a platter and immediately drizzle with some of the parsley-mint sauce. Let rest for 5 minutes, then serve with additional sauce on the side.\nGrilled Chicken\nSpanish\nDairy-free Mains\nGluten-free Mains\nChicken Breast"
}