{
  "url": "https://www.seriouseats.com/grilled-bok-choy-with-sweet-soy-glaze",
  "image_url": "https://www.seriouseats.com/thmb/Lkf_BHQoOChTiKEyIhTC3u3O9c8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120514-grilled-bok-choy-soy-glaze-3-4125612e831e4e6badb8da6b2abc0491.jpg",
  "tags": [
    "Bok Choy"
  ],
  "title": "Grilled Bok Choy with Sweet Soy Glaze",
  "full_text": "Grilled Bok Choy with Sweet Soy Glaze\nClose\nJump to recipe\nPrep\n35 mins\nCook\n30 mins\nActive\n20 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\nsoy sauce\n1\ncup\nsake\n1\ncup\nsugar\n1-inch\nknob\nginger\n, roughly sliced\n2\ngarlic\ncloves\n, roughly sliced\n2\nscallions\n, roughly chopped\n2\npounds\nbaby bok choy\n, rinsed, dried, and split in half lengthwise\n2\ntablespoons\nolive oil\nKosher salt\nand freshly ground black pepper\nDirections\nCombine the soy sauce, sake, sugar, ginger, garlic, and scallions in a small saucepan. Bring to a simmer over high heat stirring until the sugar dissolves. Reduce to a bare simmer and cook until sauce is syrupy and reduced to about 1/2 cup, about 20 minutes. Strain and discard solids. Reserve sauce.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate.\nToss bok choy with olive oil and season with salt and pepper. Place on hot side of grill, cut side down and cook until lightly charred, about 45 seconds. Flip and cook until second side is charred, 45 seconds longer. Transfer to cooler side of grill, cover, and continue cooking until tender all the way through with a light crisp bite, 1 to 3 minutes longer. Transfer to a large plate, drizzle with sauce, and serve.\nSpecial Equipment\nGrill\nRead More\nBraised Baby Bok Choy With Garlic, Ginger, and Soy\nFor Better Grilled Vegetables, Use Your Chimney Starter\nBok Choy"
}