{
  "url": "https://www.seriouseats.com/grilled-mushrooms-sesame-dressing-recipe",
  "image_url": "https://www.seriouseats.com/thmb/J00VnuteCPs0T8JXwJq1WtwX7_M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__06__06182015-grilled-mushrooms-sesame-dressing-shaozhong-17-fe42b2f7471347d3a91352318d5e9bb5.jpg",
  "tags": [
    "Mushrooms",
    "Grilled Vegetables",
    "Sesame & Tahini",
    "Vegetable Sides"
  ],
  "title": "Grilled Mixed Mushrooms With Sesame Dressing Recipe",
  "full_text": "Grilled Mixed Mushrooms With Sesame Dressing Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n10 mins\nActive\n30 mins\nResting Time\n5 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\nmixed mushrooms, such as\nportobello\n, button mushroom, cremini, enoki, shiitake, and king trumpet\nExtra-virgin olive oil\n, for drizzling\nKosher salt\n3\ntablespoons\nunsalted butter\n, melted\n4\nteaspoons\nsoy sauce\n, divided\n1\ntablespoon\ntoasted sesame seeds\n, roughly chopped\n2\nteaspoons\nmirin\nDirections\nIf using wooden skewers, soak in water for 30 minutes just prior to grilling. Clean and prepare mushrooms: Remove woody stems of portobello, shiitake, cremini, and button mushrooms. Keep portobello and shiitake caps whole. Slice large button or cremini mushrooms 1/2 inch thick, then skewer with bamboo skewers. Leave smaller cremini and button mushrooms whole and skewer through the caps with bamboo skewers. Separate enoki mushrooms into large bunches and tie each with butcher's twine. Slice large mushrooms with edible thick stems lengthwise 1/2 inch thick, then skewer with bamboo skewers.\nSerious Eats / Shao Z.\nPlace mushrooms in a large bowl, drizzle evenly with olive oil, and toss to coat. Season with salt.\nSerious Eats / Shao Z.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nMeanwhile, stir together melted butter and 2 teaspoons soy sauce. Set aside.\nArrange mushrooms near, but not over, coals. Cook, turning and basting frequently with soy sauce glaze, until mushrooms are cooked through and browned outside, 4 to 8 minutes depending on mushroom type and size.\nSerious Eats / Shao Z.\nTransfer cooked mushrooms to a plate as they are ready and let rest 5 minutes.\nSerious Eats / Shao Z.\nIn a small bowl, stir together sesame seeds, mirin, and remaining 2 teaspoons soy sauce.\nSerious Eats / Shao Z.\nSlice mushrooms into bite-size pieces and discard skewers and twine. Toss with sesame dressing and serve at room temperature.\nSpecial Equipment\nGrill\n, bamboo skewers\nRead More\nHow to Clean Shiitake, Portobello, and Oyster Mushrooms\nGrilled King Oyster Mushrooms With Bacon and Teriyaki Glaze\nEasy Roasted Mushrooms\nMushrooms\nGrilled Vegetables\nSesame & Tahini\nVegetable Sides"
}