{
  "url": "https://www.seriouseats.com/grilled-radicchio-with-cherry-gastrique-recipe-11744361",
  "image_url": "https://www.seriouseats.com/thmb/Ugjh8Qf4mk7lQBWTcmmz8jKHifU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250528-SEA-GrilledRadicchio-VyTran-03-84ab32ecc5ef4a4c9c08d005ffe306c6.jpg",
  "tags": [
    "Grilled Vegetables",
    "Recipes",
    "Grilling",
    "Vegetables"
  ],
  "title": "Grilling Steak? This Bold Summer Side Dish Is the Perfect Match",
  "full_text": "Grilling Steak? This Bold Summer Side Dish Is the Perfect Match\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nCooling Time\n5 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nsweet red cherries\n, halved and pitted\n1/4\ncup\nsugar\n(\n1 3/4\nounces\n;\n50\ng\n)\n1/4\ncup\nplus\n2\ntablespoons\n(\n90\nml\n)\nsherry vinegar\n, plus more if needed, divided (see note)\nKosher salt\nand freshly ground black pepper\n2\n(12-ounce; 340 g)\nheads\nradicchio\n, quartered, cores left intact\nExtra-virgin olive oil\n, for drizzling\nFresh mint leaves\n, for garnish\nDirections\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate.\nSerious Eats/ Vy Tran\nMeanwhile, in medium saucepan, combine cherries with sugar and 1/4 cup (60 ml) vinegar. Cook over medium-high heat, stirring frequently, until sugar is dissolved and cherries have cooked down to a saucy, jammy consistency. Season with salt and pepper to taste. Add remaining 2 tablespoons (30 ml) vinegar in stages, tasting along the way and adding more if needed, until the flavor is brightly acidic with a strong sweet-sour balance, like tart lemonade. Simmer sauce further, if necessary, to reduce to a lightly syrupy consistency. Set aside to cool.\nSerious Eats/ Vy Tran\nArrange radicchio directly over the hot coals or high heat on a gas grill. Cook on both cut sides until lightly wilted and charred in spots, about 2 minutes per side.\nSerious Eats/ Vy Tran\nTransfer radicchio to a serving platter, drizzle with olive oil, and season with salt and pepper to taste. Drizzle cherry sauce all over radicchio and scatter with mint leaves. Serve.\nSerious Eats/ Vy Tran\nSpecial Equipment\nCharcoal or gas grill, grill tongs, medium saucepan\nNotes\nOther vinegars will work here as well, such as white wine, red wine, Champagne, and cider. Exactly how much you need will depend on the vinegar you use and the sweetness of your cherries.\nRead More\nGrilled Radicchio Gets a Sweet-Sour Lift From Cherry Gastrique\nThe Food Lab's Definitive Guide to Grilled Steak\nSimple Grilled Asparagus\nGrilled Vegetables\nRecipes\nGrilling\nVegetables"
}