{
  "url": "https://www.seriouseats.com/grilling-negimaki-japanese-beef-rolls-recipe",
  "image_url": "https://www.seriouseats.com/thmb/VCXOFDvIBtyA6SIvdjIEOKZe508=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110215-138071-negimaki-75fe9fc2351f42718b24f495bedae4e7.jpg",
  "tags": [
    "Flank Steaks",
    "Japanese",
    "Grilled Steaks",
    "Beef Mains"
  ],
  "title": "Negimaki Recipe | Grilling",
  "full_text": "Negimaki Recipe | Grilling\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nActive\n45 mins\nMarinating Time\n15 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\nwater\n1\ntablespoon\nkosher salt\n, divided\n12\nsmall\nscallions\n, trimmed to 6-inches in length\n1\npound\nflank steak\n, roughly 6 to 7 inches square\n1/4\ncup\nsake\n1/4\ncup\nmirin\n3\ntablespoons\nsoy sauce\n1\ntablespoon\nsugar\n1\ntablespoon\nvegetable oil\nDirections\nBring 2 quarts of water to a boil in a medium pot over medium-high heat. Add 1/2 tablespoon of salt, then blanch scallions until just softened, about 45 seconds. Remove scallions to a bowl of ice water. Transfer scallions to paper towels to drain and pat dry.\nCut flank steak with the grain, holding a large knife at a 30-degree angle to cutting board, into 12 1/8-inch-thick slices that are 1 1/2 to 2 inches wide. Arrange slices 1 inch apart on plastic wrap, then cover with another piece of plastic wrap and pound slices until about 1/16 inch thick.\nArrange 3 beef slices side by side, overlapping slices slightly to form a 6-inch square. Sprinkle square lightly with salt, then lay 3 scallions across the meat in the direction of the grain. Tightly roll up meat around scallions and tie shut with kitchen twine at ends and where meat slices overlap. Repeat with remaining meat and scallions.\nStir together sake, mirin, soy sauce, and sugar in a small bowl until sugar is dissolved. Put rolls in a small dish and pour marinade over them, turning to coat. Marinate, turning occasionally, while preparing the grill, 15 to 30 minutes.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate. Grill rolls, reserving marinade, until well seared on all sides, 2 to 3 minutes per side. Transfer to a cutting board and let rest for 5 minutes.\nWhile the meat is resting, pour reserved marinade into a small pot. Bring to a boil over medium heat and cook until slightly thickened, 3 to 5 minutes. Cut off and discard twine from negimaki rolls. Cut eat roll into 6 1-inch slices. Arrange rolls on a plate and drizzle with sauce.\nSpecial Equipment\nGrill\nFlank Steaks\nJapanese\nGrilled Steaks\nBeef Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/negimaki-recipe-grilling.webp?"
}