{
  "url": "https://www.seriouseats.com/grilled-turkish-wings-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KhpkXCH6RmaviegAZm3iiRleWvI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190618-grilled-turkish-chicken-wings-vicky-wasik-13-6f722c8e117f4d6ab1b99ec8340de765.jpg",
  "tags": [],
  "title": "Grilled Turkish-Style Chicken Wings",
  "full_text": "Grilled Turkish-Style Chicken Wings\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n30 mins\nMarinating Time\n60 mins\nTotal\n90 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n260\ng\n)\nTurkish hot pepper paste\n(see note)\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n1/2\ncup\n(\n35\ng\n) chopped\nfresh parsley\nleaves\n4\nmedium\ncloves garlic\n(\n20\ng\n), minced\n1\ntablespoon\n(\n15\nml\n)\npomegranate molasses\n1\ntablespoon\n(\n12\ng\n)\nkosher salt\n2\nteaspoons\n(\n4\ng\n)\nisot pepper\n(optional; see note)\n1\nteaspoon\n(\n2\ng\n)\nground cumin\n1\nteaspoon\n(\n2\ng\n)\npaprika\n3\npounds\n(\n1.4\nkg\n)\nchicken wings\n, cut at joints, wingtips discarded\nDirections\nIn a medium bowl, stir together pepper paste, olive oil, parsley, garlic, and pomegranate molasses with a rubber spatula until well combined. Stir in salt, isot pepper (if using), cumin, and paprika. Transfer 1/2 cup (120ml) pepper paste mixture to a small bowl and set aside. (If you're marinating the chicken wings overnight, cover and refrigerate this pepper paste mixture until you're ready to grill the wings.)\nCombine chicken wings and remaining pepper paste mixture in a 1-gallon zipper-lock bag. Seal bag, pressing out as much air as possible. Massage bag until wings are evenly coated in marinade. Lay bag flat on a rimmed baking sheet and refrigerate, turning bag occasionally, for at least 1 hour and up to 24 hours.\nWhen ready to cook, thread chicken wings onto sets of 2 metal skewers, spacing the skewers 1 to 1 1/2 inches apart. Try to keep the chicken wings in a relatively even and flat layer on the skewers. If you're working with both flats and drumettes, thread them on separate sets of skewers. For flats, thread each flat through the gap between the two bones; for drumettes, alternate their end-to-end alignment on the skewers as if they are sleeping head to toe next to each other. Make sure the wings are bunched tightly together, leaving no parts of the skewers exposed except for a 2-inch handle at the bottom of each pair and the pointy tips at the top.\nSerious Eats / Vicky Wasik\nSet up grill for skewers\n(see note), making sure to adjust distance between bricks to match the length of your skewers.\nLight 2/3 chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals over half the channel between the bricks, creating a modified\ntwo-zone direct fire\n.\nPlace half the skewers directly over the hot coals and the other half on the cooler side of the grill, balancing the skewers on top of the bricks, with the handles overhanging the bricks closest to you and the tips balancing on the farther wall of bricks. Cook, turning frequently, until wings on the hot side of the grill are lightly charred on both sides, 4 to 6 minutes; if flare-ups occur, move the skewers to cooler side of grill as needed to get them away from the flames.\nSerious Eats / Vicky Wasik\nSwitch the sets of skewers so that the ones cooked on the cooler side of the grill are now positioned over the hot coals, moving the charred wings to the cooler side. Cook, continuing to turn the skewers frequently, until all the wings are evenly charred, 4 to 6 minutes longer. Continue cooking, moving skewers around over the coals, until chicken is cooked through, 2 to 4 minutes longer. Transfer skewers to a serving platter and let rest for 3 to 5 minutes before removing skewers. Serve immediately with reserved marinade for dipping.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRimmed baking sheet\n,\nskewers\n,\ngrill\n,\nchimney starter\nNotes\nTurkish pepper paste (biber salçasi) is made by roasting, puréeing, and dehydrating (traditionally via sun-drying) sweet or hot Turkish peppers. You can find both sweet and hot pepper pastes at Turkish markets or online. This recipe calls for hot pepper paste.\nIsot pepper is often labeled urfa biber or Urfa pepper in the United States and is also available at Turkish markets or online. If it's not available, simply omit.\nThis recipe was specifically developed and tested using a high-heat skewer-grilling setup. Converting this recipe to a standard charcoal or gas grill is possible, but will change recipe times and instructions in ways it hasn't been tested. If you do want to use a standard grill, set it to direct charcoal grilling/all burners on high heat, and cook until wings are lightly charred and cooked through. Gas grills tend to be less powerful and more uneven than charcoal, so we highly recommend a device like\nthe GrillGrate\nto improve heat intensity and evenness of heating.\nMake-Ahead and Storage\nThe grilled wings are best enjoyed immediately. The marinade can be made in advance and refrigerated for up to three days. The wings can be marinated for up to 24 hours.\nRead More\nHow to Get Started Grilling\nHow to Set Up Your Grill for Better Skewers, Kebabs, and Yakitori\nThe GrillGrate: An Upgrade Almost Every Gas Grill Needs"
}