{
  "url": "https://www.seriouseats.com/grilled-peach-and-burrata-salad-recipe-11741094",
  "image_url": "https://www.seriouseats.com/thmb/MXefm-ESML4-KPfs_d4Z-rn_0jU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250522-SEA-GilledPeachSalad-LorenaMasso-Beauty2-39-9d94a24b2568414b831aebc8c13cc98c.jpg",
  "tags": [
    "Grilled Fruit",
    "The Latest",
    "Recipes",
    "Salads",
    "Peach"
  ],
  "title": "Step Aside Steak, This Grilled Peach and Burrata Salad Is Dominating My Summer Cookouts",
  "full_text": "Step Aside Steak, This Grilled Peach and Burrata Salad Is Dominating My Summer Cookouts\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nTotal\n35 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor Grilling the Peaches:\n2 1/2\npounds\npeaches\n(about\n7\neach), pitted and quartered, or nectarines, plums, or pluots\n3\ntablespoons\n(\n42\ng\n)\nunsalted butter\n, melted\nFor the Salad:\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n1\ntablespoon\n(\n15\nml\n)\nrice vinegar\nor white wine vinegar\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1\ntablespoon\nfinely minced fresh\nchives\n8\nounce\n(\n226\ng\n)\nburrata cheese\n, room temperature\n1/2\ncup\nchopped or roughly torn fresh\nbasil leaves\n2\nounces\n(\n60\ng\n) thinly sliced\nprosciutto\n, torn into bite-size pieces\nFreshly ground black pepper\n, to taste\nDirections\nFor a Charcoal Grill:\nOpen bottom vent completely. Fill large chimney starter 3/4 way full with charcoal briquettes (about 4 quarts coal) and light briquettes. When top coals are partially covered with grey ash, pour in an even layer over half of the grill grate. Set cooking grate in place, cover, and open lid vent fully. Heat covered until grill is hot, 5 minutes.\nFor a Gas Grill:\nTurn all burners to high, cover grill and heat until hot, about 15 minutes. Leave primary burner on high heat, and turn off other burner(s).\nSerious Eats / Lorena Masso\nFor Grilling the Peaches:\nBrush cut sides of peach quarters with melted butter.\nSerious Eats / Lorena Masso\nClean and oil cooking grate. Arrange peaches, cut side down on hotter side of grill and cook (covered if using a gas grill) until grill marks have formed, 5 to 7 minutes. Using a thin metal spatula, carefully flip peaches to other cut side onto the cooler side of the grill. Continue to cook on the cooler side of the grill until light grill marks form on bottom of peaches and peaches are tender, 3 to 7 minutes. As peach quarters finish cooking, transfer to a large plate. Let peaches cool slightly while assembling salad.\nSerious Eats / Lorena Masso\nFor the Salad:\nIn a small bowl, whisk oil, vinegar, fish sauce, and chives until well combined. Place burrata in center of a large serving platter and, using a butter knife or large spoon, roughly cut into 8 to 10 pieces. Distribute burrata evenly spaced out on platter.\nSerious Eats / Lorena Masso\nArrange peach quarters among burrata pieces. Distribute prosciutto and basil attractively among peaches and burrata. Drizzle prepared vinaigrette evenly over salad. Finish with freshly ground black pepper, if desired. Serve.\nSerious Eats / Lorena Masso\nSpecial Equipment\nCharcoal or gas grill, charcoal and chimney starter if using charcoal grill, grilling spatula and tongs\nMake-Ahead and Storage\nThis salad is best enjoyed right away, but the vinaigrette can be made ahead and refrigerated for up to 5 days before assembling the salad.\nGrilled Fruit\nThe Latest\nRecipes\nSalads\nPeach"
}