{
  "url": "https://www.seriouseats.com/grilled-corn-spicy-korean-miso-sauce-recipe",
  "image_url": null,
  "tags": [
    "Corn",
    "Korean",
    "Vegetarian Sides",
    "Grilled Vegetables",
    "Quick Sides"
  ],
  "title": "Grilled Corn With Spicy Korean Miso Sauce Recipe",
  "full_text": "Grilled Corn With Spicy Korean Miso Sauce Recipe\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n30 mins\nTotal\n15 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\ng\n)\nwhite miso paste\n2\ntablespoons\n(\n30\ng\n)\ngochujang\n(see note)\n2\ntablespoons\n(\n30\nml\n)\nmayonnaise\n1\ntablespoon\n(\n15\nml\n)\njuice\nfrom\n1\nwhole\nlemon\n1/4\ncup\n(\n7\ng\n) roughly chopped fresh\ncilantro leaves\n, divided\n1/4\ncup\nfinely sliced\nscallions\n, divided\n8\nears\ncorn\n, shucked\nDirections\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\ngrilling grate.\nWhile grill preheats, combine miso, gochujang, mayonnaise, lemon juice, half of cilantro, and half of scallions. Whisk until homogeneous. Set aside.\nPlace corn directly over hot side of fire. If using a coal grill, keep uncovered. If using gas, cover grill when not turning corn. Cook corn, turning every minute or so, until it is well charred on all sides, about 10 minutes total.\nTransfer corn to a large bowl. Coat with sauce using a spoon or brush. Transfer to a serving platter. Sprinkle with remaining cilantro and scallions. Serve immediately.\nNotes\nGochujang is a Korean chile paste that can be found in many Asian markets or ordered online through Amazon.\nSpecial Equipment\nGrill\n,\nchimney starter\nThis Recipe Appears In\nThe Food Lab: Three Ways to Grill Corn\nCorn\nKorean\nVegetarian Sides\nGrilled Vegetables\nQuick Sides"
}