{
  "url": "https://www.seriouseats.com/grilled-lobster-lemon-shallot-butter-recipe",
  "image_url": "https://www.seriouseats.com/thmb/XR1IFBOPtLEB2g0mcvYheotAV4w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130704-258272-grilled-lobster-0f9ec04fca4c499780d5980e94f2981d.jpg",
  "tags": [
    "Grilled Seafood",
    "Seafood Mains"
  ],
  "title": "Grilled Lobster With Lemon-Shallot Butter Recipe",
  "full_text": "Grilled Lobster With Lemon-Shallot Butter Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n45 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Lemon Shallot Butter:\n1/2\ncup\nclarified butter\n, divided\n2\ntablespoons\nfinely diced shallots\n(about\n1\nsmall\n)\n1/2\nteaspoon\nzest\nand\n1\ntablespoon\njuice\nfrom\n1\nwhole\nlemon\n1\ntablespoon\nfinely chopped\nchives\nFor the Grill:\n4\nlive lobsters\n, about\n1 1/2 pounds each\n1\ntablespoon\nkosher salt\n, plus more to taste\nFreshly ground black pepper\n, to taste\nDirections\nTo make the lemon-shallot butter:\nHeat 2 tablespoons of butter in a small saucepan over medium heat until foaming subsides. Stir in shallots and cook until softened but not browned, about 4 minutes. Stir in remaining butter, lemon juice, and lemon zest and cook until butter is melted and warm throughout, about 3 minutes. Remove from heat and stir chives. Season with salt and pepper to taste.\nFill a large bowl with ice water, set aside. Fill large stockpot with 2 inches of cold water and bring to a boil over high heat. Add 1 tablespoon of salt to boiling water and place steamer insert into pot. Place 1 lobster in steamer, cover, and steam for 2 minutes. Transfer lobster to bowl with ice water. Repeat with remaining lobsters.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. Break off claws from lobsters and split lobster bodies in half lengthwise, removing green tomalley if desired. Brush lobster flesh with lemon-shallot butter and place on grill, flesh side down, and grill for 2 to 3 minutes. Flip lobsters flesh side up and continue grilling until meat registers 135°F on an instant read thermometer, about 3 minutes more. Transfer lobsters to a serving tray and brush again with lemon-shallot butter. Place claws on grill, cover, and cook until meat registers 135°F on an instant read thermometer, 5 to 7 minutes. Transfer to tray with lobster bodies and serve immediately with remaining lemon-shallot butter.\nSpecial Equipment\nLarge steaming pot, grill\nThis Recipe Appears In\nGrilling: Lobster with Lemon-Shallot Butter\nGrilled Seafood\nSeafood Mains"
}