{
  "url": "https://www.seriouseats.com/grilled-orange-chipotle-pork-loin-recipe",
  "image_url": "https://www.seriouseats.com/thmb/bUGcEpwLCckp7A-adZmMsajTvY4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__11__20121130-232041-orange-chipotle-pork-loin-0551691253a34229b81d6e94bd5ff24b.jpg",
  "tags": [
    "Pork Loin",
    "Grilled Pork",
    "Orange",
    "Peppers"
  ],
  "title": "Grilled Orange-Chipotle Pork Loin Recipe",
  "full_text": "Grilled Orange-Chipotle Pork Loin Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n85 mins\nActive\n60 mins\nMarinating Time\n6 hrs\nTotal\n7 hrs 35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\norange juice\n, divided\n2\ntablespoons\nolive oil\n2\ntablespoons\ndark brown sugar\n2\nwhole\ncanned chipotle chiles in adobo\nplus\n1\ntablespoon\nsauce\n2\nmedium\ncloves garlic\n1\ntablespoon\nkosher salt\n1\npork loin\ntrimmed of excess fat and silver skin (about\n2 1/2\npounds\ntotal)\nDirections\nPlace 1/4 cup orange juice, olive oil, dark brown sugar, chipotles in adobo, adobo sauce, garlic, and salt in jar of a blender. Puree until chipotles and garlic are completely chopped.\nPlace pork loin in large resealable plastic bag. Pour in orange-chipotle marinade, seal, and toss to thoroughly coat loin with marinade. Place in refrigerator and marinate for 6 hours to overnight, turning occasionally.\nPour marinade from bag into small saucepan. Stir in remaining 1/2 cup of orange juice. Bring to boil over medium-high heat; reduce to heat to medium and cook until sauce has reduced in volume by half, about 15 minutes. Remove from heat and set aside.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate. Sear pork over hot side of grill until browned on all sides, about 4-5 minutes per side. Move pork to cool side of the grill and brush with orange-chipotle sauce. Cover grill and continue to cook until an instant read thermometer reads 140°F when inserted into the thickest part of the pork loin, 15 to 30 minutes longer. Remove from grill, let stand for 15 minutes; slice and serve with reserved orange-chipotle sauce.\nSpecial equipment\nGrill, Blender\nPork Loin\nGrilled Pork\nOrange\nPeppers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-orange-chipotle-pork-loin-recipe.webp?"
}