{
  "url": "https://www.seriouseats.com/griled-cabbage-with-spicy-thai-dressing-recipe",
  "image_url": null,
  "tags": [
    "Vegetable Sides",
    "Thai",
    "Gluten-free Sides",
    "Grilled Vegetables",
    "Cabbage"
  ],
  "title": "Grilled Cabbage With Spicy Thai Dressing Recipe",
  "full_text": "Grilled Cabbage With Spicy Thai Dressing Recipe\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(45ml)\nfresh juice from 4 to 6 limes\n, divided\n3\ntablespoons\n(45ml)\nfish sauce\n3 tablespoons (\n45\ng\n) palm or\nlight brown sugar\n3\nmedium\ncloves garlic\n(15g), finely minced\n2\nteaspoons\ndried Thai-style chile flakes\n, more or less to taste (see notes)\n2\ntablespoons\n(5g)\nchopped\nfresh\nmint leaves\n2\ntablespoons\n(5g)\nchopped fresh cilantro\nleaves and tender stems\n1\nmedium head\ngreen cabbage\n(about 2 1/2 pounds; 1200g), cut into 6 wedges, with core left intact\n2\ntablespoons\n(30ml)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\nDirections\nCombine 2 tablespoons (30ml) lime juice and all of fish sauce, sugar, and garlic in a small microwaveable bowl. Microwave on high heat until steaming-hot, about 20 seconds. Add chile flakes. Stir until sugar is dissolved. Allow to cool in refrigerator, then stir in remaining lime juice and herbs. Set aside.\nSerious Eats / Eric Kleinberg\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nSerious Eats / Eric Kleinberg\nPlace cabbage wedges directly over hot side of grill. Cook, covered, until well charred on first side, about 2 minutes. Flip cabbage, cover, and cook until charred on second side, another 2 minutes. Flip wedges to third side, cover, and cook until well charred, another 2 minutes. Transfer cabbage to cooler side of grill, cover, and continue cooking until mostly tender but still crunchy in center, about 4 minutes longer.\nSerious Eats / Eric Kleinberg\nTransfer cabbage to a large bowl and toss with olive oil, salt, and pepper. Transfer to a serving platter. Drizzle with sauce and serve immediately.\nSerious Eats / Eric Kleinberg\nSpecial Equipment\nGrill\n,\nchimney starter\nNotes\nThai dried chile flakes can be found in Asian groceries. If unavailable, substitute with Chinese dried crushed chile or regular crushed red pepper flakes.\nTo cook the cabbage indoors instead, toss the raw wedges with 2 tablespoons (30ml) olive oil to coat. Place on a foil-lined broiler pan, and broil under high heat, turning occasionally, until well charred on all sides, about 15 minutes.\nRead More\nGrilled Cabbage With Blue Cheese Dressing\nGrilled Cabbage With Yogurt and Mint\nGrilled Cabbage Wedges With Ginger-Miso Dressing Recipe\n16 Cabbage Recipes That Celebrate This Underrated Vegetable\nHow to Get Started Grilling\nVegetable Sides\nThai\nGluten-free Sides\nGrilled Vegetables\nCabbage"
}