{
  "url": "https://www.seriouseats.com/grilled-corn-ribs-recipe-8683668",
  "image_url": "https://www.seriouseats.com/thmb/xEiWTt4lNeNhCy2OFPLmmTFb34o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-SEA-GRILLEDCORNRIBS-MORGANHUNTGLAZE-HERO-1-9d1c4dc8b25240d69053c4c0301b6c5a.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Corn",
    "Grilled Vegetables"
  ],
  "title": "Slathered Grilled Corn Ribs",
  "full_text": "Slathered Grilled Corn Ribs\nClose\nJump to recipe\nPrep\n20 mins\nCook\n10 mins\nTotal\n30 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cotija Crema:\n2\nounces\nCotija\nor feta cheese, finely crumbled (\n1/2\ncup\n), plus more for serving\n1/4\ncup\n(\n60\nml)\nmayonnaise\n1/4\ncup\n(\n60\nml\n)\nMexican crema\nor sour cream\n2\ntablespoons\n(\n30\nml)\nwater\n1 1/2\nteaspoons\nfresh\nlime juice\n1/2\nteaspoon\nchipotle\nchile powder\n1\nmedium\nclove garlic,\ngrated\nFor the Corn Ribs:\n4\nears\ncorn\n, shucked\n4\ntablespoons\n(\n57\ng\n)\nunsalted butter\n, melted\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1/2\nteaspoon\nsmoked paprika\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\ngarlic powder\nLime\nwedges\n, for serving\nChopped\nfresh cilantro\n, for serving\nDirections\nFor the Cotija crema:\nStir together cheese, mayonnaise, crema, water, lime juice, chile powder, and garlic in a large bowl until mostly smooth; set aside.\nMorgan Hunt Glaze\nFor the corn ribs:\nWorking with 1 ear of corn at a time, place the corn on a folded kitchen towel on top of a secured cutting board (this creates a steady work surface). With a very sharp, hefty chef’s knife or a cleaver, cut corn cobs in half crosswise, and trim 1 inch off the pointed end, and discard. Working with 1 corn cob half at a time, turn each half on its broadest cut end, and carefully cut in half lengthwise through the cob. Remove kitchen towel and place halves cut-side down directly on cutting board; cut in half lengthwise again. Repeat with the remaining corn cob halves (you will have 32 corn ribs total). Set aside.\nMorgan Hunt Glaze\nIn a large bowl, whisk together butter, salt, paprika, pepper, and garlic powder. Add corn ribs, and toss until evenly coated.\nMorgan Hunt Glaze\nFor a charcoal grill:\nOpen bottom vent completely. Light large chimney starter filled with charcoal briquettes (6 quarts). When top coals are partially covered with ash, pour evenly over bottom of grill. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot (about 500℉; 260℃), about 5 minutes.\nMorgan Hunt Glaze\nFor a gas grill:\nTurn all burners to high, cover, and preheat grill until hot (about 500℉; 260℃), about 15 minutes.\nClean and oil cooking grates, then carefully remove corn ribs from butter mixture, letting excess drip back into the bowl and place the corn ribs, kernel-side down on the grill. Grill corn ribs, turning as needed for even browning, until lightly charred all over, 5 to 7 minutes.\nMorgan Hunt Glaze\nFor serving:\nTransfer the corn ribs to a platter, squeeze lime wedges over corn, and drizzle with the prepared Cotija crema. Sprinkle with more cheese and cilantro and serve.\nMorgan Hunt Glaze\nSpecial Equipment\nHefty, sharp chef's knife or cleaver, charcoal or gas grill, large chimney starter (if using charcoal grill), grilling tongs\nMake-Ahead and Storage\nThe Cotija crema can be prepared up to 5 days ahead and stored in an airtight container in the refrigerator.\nThe corn can be cut into ribs and refrigerated in an airtight container up to 4 days before grilling.\nSnacks & Appetizers\nThe Latest\nCorn\nGrilled Vegetables",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/slathered-grilled-corn-ribs.webp?"
}