{
  "url": "https://www.seriouseats.com/grilling-pork-loin-apple-cranberry-filling",
  "image_url": "https://www.seriouseats.com/thmb/7r6D5lIcNO_rsZ9ZyNxpVVeFIBg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090211-pork-loin-with-apple-cranberry-filling-677f29694feb4955acc683541a93770b.jpg",
  "tags": [
    "Pork Mains",
    "Grilled Pork",
    "Apple",
    "Cranberry",
    "Pork Loin"
  ],
  "title": "Pork Loin with Apple-Cranberry Filling Recipe | Grilling",
  "full_text": "Pork Loin with Apple-Cranberry Filling Recipe | Grilling\nClose\nJump to recipe\nPrep\n15 mins\nCook\n105 mins\nResting Time\n15 mins\nTotal\n2 hrs 15 mins\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1\ncup\napple cider\n1/2\ncup\ncider vinegar\n3/4\ncup packed\nlight brown sugar\n(\n5 1/4\nounces\n)\n1/4\nlarge\nshallot\n, halved lengthwise and sliced thin crosswise (about\n1/4\ncup\n)\n1 1/2\ncups\ndried apples\n(packed),\n4\nounces\n1/2\ncup\ndried cranberries\n(packed)\n2 1/2\nounces\n1\ntablespoon\ngrated\nfresh ginger\n1\ntablespoon\nyellow mustard seeds\n1/2\nteaspoon\nground allspice\n1/8 to 1/4\nteaspoon\ncayenne pepper\nFor the Pork:\n2 1/2\npounds\nboneless center-cut\npork loin roast\nKosher salt and ground black pepper\n2\nmedium\nwood chunks\nDirections\nBring all ingredients for the filling to simmer in medium saucepan over medium-high heat. Cover, reduce heat to low, and cook until apples are very soft, about 20 minutes. Push mixture through fine-mesh strainer to extract as much liquid as possible. Return liquid to saucepan and simmer over medium-high heat until reduced to 1/3 cup, about 5 minutes; reserve glaze. Meanwhile, pulse apple mixture in food processor until uniformly coarsely chopped, about fifteen 1-second pulses. Transfer filling to bowl and refrigerate while preparing pork.\nButterfly pork loin to even 1/2-inch thickness. Season inside liberally with salt and spread apple filling in even layer, leaving 1/2-inch border. Roll tightly and tie with twine at 1-inch intervals. Season exterior liberally with salt and pepper.\nLight a chimney 3/4 full of charcoal. When charcoal is fully lit and covered in gray ash, pour coals out and arrange them on one side of the charcoal grate, keeping the other side empty. Place wood chunks on top of the coals and allow to start burning and producing smoke.\nPlace roast, fat-side up, on grate over cool side of grill. Cover grill and position vent, halfway open, over roast to draw smoke through grill. Grill-roast until instant-read thermometer inserted into thickest part of roast registers 130 to 135°F, 55 to 70 minutes, flipping once halfway through cooking time. Brush roast with half of reserved glaze; flip and brush with remaining glaze. (You may need to reheat glaze briefly to make spreadable.) Continue to cook until glaze is glossy and sticky, about 5 minutes longer.\nTransfer roast to cutting board, and let rest for 15 minutes. (Internal temperature should rise to about 145°F.) Cut into 1/2-inch-thick slices, removing twine as you cut. Serve immediately.\nRead More\nThis Easy (Reverse-Seared!) Stuffed Pork Loin Is an Instant Holiday Classic\nPork Mains\nGrilled Pork\nApple\nCranberry\nPork Loin"
}