{
  "url": "https://www.seriouseats.com/grilled-italian-style-lamb-skewers-arrosticini-abruzzesi",
  "image_url": "https://www.seriouseats.com/thmb/Gi_v-dm2yKAqNgdyrOxoGWAJJFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190618-grilled-arrosticini-lamb-skewers-vicky-wasik-4-705e87ae5b9444289e5b7312aca484ca.jpg",
  "tags": [
    "Lamb Mains",
    "Italian",
    "Grilled Lamb",
    "Lamb Shoulder",
    "Easter"
  ],
  "title": "Grilled Italian-Style Lamb Skewers (Arrosticini Abruzzesi) Recipe",
  "full_text": "Grilled Italian-Style Lamb Skewers (Arrosticini Abruzzesi) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n25 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 pounds (\n900\ng\n)\nboneless lamb shoulder roast\n, with fat cap\n2\ntablespoons\n(30ml)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\nDirections\nUsing a sharp chef's knife, trim lamb of fat cap, reserving the fat. Cut fat into 3/4-inch-wide, 1/4-inch-thick pieces; set aside. Cut remaining lamb shoulder into 3/4-inch-wide, 1/2-inch-thick pieces; make sure to trim and discard silver skin and tough sinew as you go.\nThread 3 to 4 pieces of lamb onto a skewer, followed by one piece of lamb fat. Continue alternating pieces of meat and lamb fat, ending the skewer with 3 pieces of meat. Make sure meat is bunched tightly together, leaving no parts of the skewer exposed except for a 2-inch handle at the bottom, and the pointy tip at the top.\nSet up grill for skewers, making sure to adjust distance between bricks to the length of your skewers.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly in the channel between the bricks.\nBrush lamb on all sides with olive oil, and season lightly with salt and pepper. Place skewers directly over the hot coals, balancing them on top of the bricks, with the handles overhanging the bricks closest to you, and the tips balancing on the farther wall of bricks. Cook, turning frequently, until lamb is lightly charred, and a piece of lamb looks cooked through when removed and cut in half, 6 to 9 minutes; if flare-ups occur, move the skewers around as needed to get them away from the flames. Transfer to serving platter, season to taste with salt, and let rest for 1 to 2 minutes. Serve immediately.\nSpecial equipment\nGrill\n,\nchimney starter\n, pastry brush\nMake-Ahead and Storage\nThe grilled skewers are best enjoyed immediately. The lamb can be cut, threaded onto skewers, wrapped tightly in plastic wrap, and refrigerated for up to 24 hours in advance.\nThis Recipe Appears In\nGrilled Lamb\nArrosticini\n: A Study in Grilled Skewer Simplicity\nHow to Set Up Your Grill for Better Skewers, Kebabs, and Yakitori\nLamb Mains\nItalian\nGrilled Lamb\nLamb Shoulder\nEaster",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-italian-style-lamb-skewers-arrosticini-abruzzesi-recipe.webp?"
}