{
  "url": "https://www.seriouseats.com/grilled-oysters-recipe",
  "image_url": null,
  "tags": [
    "Grilled Seafood",
    "Grilled Seafood",
    "Snacks & Appetizers"
  ],
  "title": "Grilled Oysters Recipe",
  "full_text": "Grilled Oysters Recipe\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n30 mins\nTotal\n15 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ndozen\noysters\n4 to 5\nounces\ncompound butter\n, such as\ngarlic-parsley butter\n,\nkimchi butter\n, or\nParmesan-basil butter\nSeaweed\nor\nkosher salt\n, for serving\nDirections\nLine a rimmed baking sheet with heavy-duty aluminum foil, crinkling it up to create deep creases.\nShuck oysters\n, discard top shells, and place them on foil-lined baking sheet, using foil to keep them upright so that juices do not spill out.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nPlace oysters directly over hot side of grill. Using 2 spoons, place 2 teaspoons (10ml) of compound butter inside each. Cover and cook until butter is melted and liquid is bubbling, about 2 minutes. Transfer to a serving platter lined with seaweed or moistened kosher salt (to keep oysters level; see note) and serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nRimmed baking sheet\n,\ngrill\n,\noyster knife\nNotes\nMost fishmongers carry seaweed behind the counter. Ask for it when purchasing your oysters. Lining your serving plate with seaweed will allow you to keep the oysters stable. If using kosher salt instead, put a cup of kosher salt in a bowl and moisten with water, 1 tablespoon at a time, until it has the consistency of wet sand. Place small mounds of moistened salt on your serving platter and nestle an oyster into each mound to hold them stable.\nRead More\nHow to Shuck an Oyster\nGarlic-Parsley Butter\nParmesan-Basil Butter\nKimchi Butter\nGrilled Seafood\nGrilled Seafood\nSnacks & Appetizers"
}