{
  "url": "https://www.seriouseats.com/grilled-apple-crisp-recipe-7568631",
  "image_url": "https://www.seriouseats.com/thmb/R5sa55X1D-_6_Cm0jyIeeDq4F28=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230802-SEA-GrillBakeAppleCrisp-LorenaMasso-22-f65723e3227648a3a002519a2c468369.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Grilling",
    "Fall Desserts",
    "Apple"
  ],
  "title": "Grill-Baked Skillet Apple Crisp",
  "full_text": "Grill-Baked Skillet Apple Crisp\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nCooling Time\n20 mins\nTotal\n80 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Topping:\n3/4\ncup\nwhole wheat flour\n(\n3 1/3\nounces\n;\n95\ng\n)\n3/4\ncup\nfinely\nchopped pecans\nor walnuts (\n3\nounces\n;\n85\ng\n)\n3/4\ncup\nold fashioned rolled oats\n(\n2 3/4\nounce\n;\n75\ng\n)\n3/4\ncup packed\nlight brown sugar\n(\n4 3/4\nounces\n;\n135\ng\n)\n1/2\nteaspoon\nground cinnamon\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n8\ntablespoons\nmelted\nbutter\n(\n4\nounces\n;\n115\ng\n)\nFor the Filling:\n3\npounds\nGolden Delicious apples\n(about\n8\napples\n), peeled, cored, and halved (see notes)\n4\ntablespoons\nunsalted butter\n, divided (\n2\nounces\n;\n56\ng\n)\n1/4\ncup\nlight brown sugar\n(about\n1 1/2\nounces\n;\n40\ng\n)\n1\ntablespoon\ncornstarch\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice\n1/4\nteaspoon\nground cinnamon\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\nDirections\nFor the Topping:\nCombine flour, pecans, oats, sugar, cinnamon, and salt in a medium bowl. Stir in melted butter until mixture is thoroughly moistened and crumbly.\nSerious Eats / Lorena Masso\nFor a Charcoal Grill:\nOpen bottom vent completely. Light chimney starter filled with charcoal briquettes (6 quarts). Once top coals are partially covered with ash, pour into a steeply banked pile against 1 side of the grill. Set cooking grate in place, cover, and open lid vent. Heat until grill is hot (500°F; 260°C), about 5 minutes.\nSerious Eats / Lorena Masso\nFor a Gas Grill:\nTurn all burners to high, cover, and heat grill until hot (500°F; 260°C), about 15 minutes. Leave primary burner on high and turn off other burner(s); (see notes)\nFor the Filling:\nClean and oil cooking grate. Brush cut sides of apples with 2 tablespoons melted butter. Arrange apples, buttered side down, on hotter side of grill and cook (covered if using gas) until grill marks develop and apples begin to soften, 3 to 7 minutes; move apples as needed to ensure even cooking. Transfer to cutting board; let cool slightly, about 5 minutes.\nSerious Eats / Lorena Masso\nSlice apple halves into 1/2-inch-thick wedges and transfer to a bowl. Toss apple slices with sugar, cornstarch, lemon juice, cinnamon, salt, and remaining 2 tablespoon melted butter until combined. Transfer apple mixture to a 10-inch cast-iron skillet and spread into an even layer. Sprinkle topping evenly over the filling, breaking up any large clumps with your fingers.\nSerious Eats / Lorena Masso\nTransfer the skillet to the cooler side of grill, cover grill, and bake, rotating skillet halfway through baking, until apple filling is bubbly and tender and topping is golden brown, 20 to 40 minutes. (For a gas grill, adjust the primary burner as needed while baking to maintain grill temperature between 400 to 450°F; if using a 3-or-more–burner grill, adjust primary burner and second burner, leaving other burners off.) Transfer the skillet to a wire rack and let cool for at least 15 minutes before serving.\nSerious Eats / Lorena Masso\nSpecial Equipment\nCharcoal or gas grill, large chimney for charcoal grill, grill gloves, 10-inch cast-iron skillet\nNotes\nAny sweet, crisp apple will work well here, such as Honeycrisps or Braeburns.\nThis fruit crisp works just as well with fresh and firm pears.\nThe primary burner on a gas grill is the burner that is connected closest to the gas source. It is the burner that you ignite first on the grill.\nIf your charcoal grill looses heat and drops below 300 degrees after assembling the apple crisp (before baking), use tongs to carefully remove the cooking grate and add 1 to 2 quarts of unlit coals to the lit coals in a steeply banked pile, then return cooking grate, cover grill and preheat for 5 minutes.\nMake-Ahead and Storage\nTransfer to an airtight container and store at room temperature for up to three days.\nDesserts\nThe Latest\nGrilling\nFall Desserts\nApple"
}