{
  "url": "https://www.seriouseats.com/grilled-hot-dogs-with-sauerkraut-recipe",
  "image_url": null,
  "tags": [
    "Grilled Sausages",
    "American",
    "Sausages"
  ],
  "title": "Grilled Hot Dogs With Sauerkraut Recipe",
  "full_text": "Grilled Hot Dogs With Sauerkraut Recipe\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n15 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 (1-pound;\n450\ng\n) package\nsauerkraut, with juices\n2 pounds (\n900\ng\n)\nnatural-casing all-beef hot dogs\n(such as Boar's Head or Dietz & Watson)\nBuns\nand brown mustard, for serving\nDirections\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nPlace sauerkraut and juices in a 10-inch-square disposable aluminum pan. (Alternatively, construct a tray out of a double layer of heavy-duty aluminum foil, 10 inches square, with sides about 2 inches high.) Nestle hot dogs into sauerkraut.\nPlace tray on hot side of grill and cook until simmering, about 4 minutes. Slide to cooler side of grill. Cover grill, with vents over sausages. Cook with all vents open until hot dogs are heated through, about 10 minutes, turning once halfway through.\nRemove lid. Using tongs, remove hot dogs from sauerkraut and place directly on cooking grate over hot side of grill. Cook, turning occasionally, until well browned and crisp, about 3 minutes total. Return to sauerkraut. Toast buns over hot side of grill, if desired. Serve hot dogs with buns, mustard, and sauerkraut.\nSpecial Equipment\nGrill\n, 10-inch square disposable aluminum pan,\ninstant-read thermometer\nNotes\nIf you're from New York, you could also simmer the dogs in a jar of stewed onions. Sabrett makes a good street-cart-style jar.\nRead More\nThe Food Lab: The Best Way to Grill Sausages\nGrilled Sausages\nAmerican\nSausages"
}