{
  "url": "https://www.seriouseats.com/grilling-beef-pinwheels",
  "image_url": "https://www.seriouseats.com/thmb/gRyzv9urnfl8iDFy77DUVptzVWc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100805-beef-pinewheel-ab250d3598d04fa48439c1c2f2c32394.jpg",
  "tags": [
    "Beef Mains",
    "Grilled Beef",
    "Flank Steaks",
    "Cheese"
  ],
  "title": "Grilled Stuffed Flank Steak With Salami, Fontina, Parmesan, and Bread Crumbs Recipe",
  "full_text": "Grilled Stuffed Flank Steak With Salami, Fontina, Parmesan, and Bread Crumbs Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n45 mins\nResting Time\n5 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncloves\ngarlic\n, minced\n4\nscallions\n, thinly sliced\n1/4\ncup chopped\nfresh\nItalian parsley\n4\nounces\nthinly sliced\nsalami\n, cut into 1/4-inch-wide matchsticks\n8\nounces\nItalian Fontina\n, cut into 1/4-inch cubes\n1/2\ncup\nfreshly\ngrated Parmigiano-Reggiano\n1/2\ncup\ntoasted bread crumbs\n1/4\ncup\nextra-virgin olive oil\n1\nwhole\nflank steak\n,\n2 to 2 1/2\npounds\n, trimmed of excess fat\nKosher salt\nand freshly ground black pepper\nDirections\nIn a medium bowl, combine the garlic, scallions, parsley, salami, Fontina, Parmigiano, and bread crumbs and mix well. Add 1/4 cup of the olive oil and mix well with your hands or a spoon. Set aside.\nLay steak on a cutting board with grain running parallel to the edge of the counter. Trim left and right edges to form a clean rectangle and reserve scraps for another use. Hold steak flat with your non-knife hand and, with a sharp boning knife, carefully butterfly the steak, leaving the back edge attached by 1/2- to 1/4-inch of meat. Open up steak and flatten the seam gently with your hand to form a large perfect rectangle.\nSeason steak on exposed side with salt and pepper. Spread the breadcrumb mixture evenly over the beef, leaving a 1/2-inch border along the side furthest from you; press and gently pack the stuffing mixture onto the beef to keep it in place. Starting from the side nearest to you, roll up the meat like a jelly roll, pressing any stuffing that falls out of the ends back into the roll.\nTie the beef tightly with twine, spacing the ties evenly every 1 1/2 inches. Insert a skewer through each piece of twine. Using a sharp knife, carefully cut between the ties to make the pinwheels. Season with salt and pepper.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. Place the pinwheels on the hot side of the grill and cook without moving until well charred on first side, about 3 minutes. Flip steaks and char second side, about 3 minutes longer. Transfer to cooler side of grill, cover, and cook until an instant read thermometer inserted into the center registers 120°F for medium-rare or 130°F for medium. Transfer to a platter, let rest for five minutes, and serve.\nSpecial Equipment\nButcher's twine, wooden skewers, grill\nThis Recipe Appears In\nThe Food Lab: How to Make Grilled Stuffed Flank Steak Pinwheels\nGrilled Stuffed Flank Steak With Salami, Fontina, Parmesan, and Breadcrumbs\nBeef Mains\nGrilled Beef\nFlank Steaks\nCheese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-stuffed-flank-steak-with-salami-fontina-parmesan-and-bread-crumbs-recipe.webp?"
}