{
  "url": "https://www.seriouseats.com/grilled-butterflied-leg-of-lamb-with-rosemary",
  "image_url": "https://www.seriouseats.com/thmb/STEBhoWGnA2Oa1k1k4icSLWpEOY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240205-SeriousEats_GrilledButterfliedLegofLamb_Causey_hero-b6b3d35e83294972941d85364d849956.jpg",
  "tags": [
    "Leg of Lamb"
  ],
  "title": "Grilled Butterflied Leg of Lamb With Rosemary, Garlic, and Mustard Crust",
  "full_text": "Grilled Butterflied Leg of Lamb With Rosemary, Garlic, and Mustard Crust\nClose\nJump to recipe\nPrep\n35 mins\nCook\n85 mins\nActive\n15 mins\nMarinating Time\n12 hrs\nTotal\n14 hrs\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nmedium\ncloves\ngarlic\n(40g; about 1 1/2 ounce), peeled, divided\nOne\n6- to 8-\npound\nboneless leg of lamb, butterflied\nto even 1-inch thickness and trimmed of excess fat\n1/2\ncup\nwhole-grain Dijon mustard\n(about 5 ounces; 137g)\n1/2\ncup\n(120ml)\nextra-virgin olive oil\n1/4\ncup\n(60ml) dry\nwhite wine\n2 tablespoons (\n8\ng\n) finely chopped\nfresh rosemary\n2\ntablespoons\nfresh juice from 1 lemon\n2\ntablespoons\nDiamond Crystal\nkosher salt\n(about 3/4 ounce; 18g); for table salt, use half as much by volume or the same weight\nDirections\nThinly slice 4 cloves of garlic. Spread lamb open on cutting board. Using tip of a paring knife, make 1/2-inch-deep slits all over lamb. Insert garlic slices into slits in lamb.\nSerious Eats / Jen Causey\nIn the bowl of a food processor, combine remaining 4 cloves of garlic, mustard, olive oil, white wine, rosemary, lemon juice, and salt. Pulse until garlic is coarsely chopped and mixture is combined, about 12 pulses.\nSerious Eats / Jen Causey\nPlace lamb in a large shallow container, such as a 9- by13-inch baking dish, and spread half of mustard mixture over top. Flip lamb and spread with remaining half of mustard mixture. Cover with plastic and refrigerate for 12 hours.\nSerious Eats / Jen Causey\nRemove lamb from refrigerator while preparing charcoal and let sit at room temperature. Open bottom vent of a charcoal grill completely. Light charcoal chimney starter filled with briquettes. When briquettes are covered with gray ash, pour them onto the bottom grate of the grill. Set cooking grate in place, cover grill and allow to preheat to high (450°F to 500°F; 230ºC to 260ºC)] for 5 minutes. Coat top grate with oil; place on grill. If using a gas grill, preheat to high (450°F to 500°F; 230ºC to 260ºC). Place lamb in an even layer on oiled grates. Grill, uncovered, until well seared, 8 to 10 minutes. Flip, and grill, uncovered, until an instant read thermometer inserted in thickest portion registers 130°F (54ºC), 8 to 10 minutes.\nSerious Eats / Jen Causey\nTransfer to a cutting board and let rest for 15 minutes. Slice 1/4-inch thick and serve immediately.\nSerious Eats / Jen Causey\nSpecial Equipment\nFood processor, charcoal chimney, grill\nThis Recipe Appears In\nGrilling: Butterflied Leg of Lamb with Rosemary, Garlic, and Mustard Crust\nLeg of Lamb"
}