{
  "url": "https://www.seriouseats.com/grilled-cheese-eggplosion-recipe",
  "image_url": null,
  "tags": [
    "Sandwiches",
    "Stovetop Eggs",
    "Breakfast Sandwich"
  ],
  "title": "Egg-in-a-Hole Grilled Cheese Sandwich",
  "full_text": "Egg-in-a-Hole Grilled Cheese Sandwich\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n15 mins\nTotal\n15 mins\nServes\n1 sandwich\nCook Mode\n(Keep screen awake)\nIngredients\n2\nslices\nhearty\nsandwich bread\n3 tablespoons (\n45\ng\n) unsalted\nbutter\n, divided\n2\nlarge\neggs\nKosher salt\nand freshly ground black pepper\n2\nslices\nAmerican, cheddar, and/or Jack\ncheese\nDirections\nUsing a small empty can, a biscuit cutter, or the ring from a Mason jar, cut a circle out of the center of each slice of bread.\nSerious Eats / Amanda Suarez\nIn a large nonstick or cast iron skillet, melt 1 tablespoon (15g) butter over medium heat until foaming subsides. Add both bread slices and circular cutouts and cook until very lightly browned on the bottom side. Break an egg into each hole, season with salt and pepper, and cook, swirling occasionally, until bread is lightly golden brown on the bottom side and eggs can easily be lifted without breaking, 1 to 2 minutes. While the egg-filled bread slices cook, flip circular cutouts as soon as they are golden brown on first side, then toast on second side and remove when ready.\nSerious Eats / Amanda Suarez\nAdd remaining 2 tablespoons (30g) butter and carefully flip both slices of bread, making sure the eggs don't break. Add a cheese slice to the top of each bread slice. Cook, swirling pan occasionally, until golden brown on second side.\nSerious Eats / Amanda Suarez\nClose sandwich with cheese inside and continue to cook, flipping occasionally, until eggs are soft-cooked and cheese is melted, about 1 minute longer. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nSmall can, biscuit cutter, or Mason jar ring; large\ncast iron\nor\nnonstick skillet\nSandwiches\nStovetop Eggs\nBreakfast Sandwich"
}