{
  "url": "https://www.seriouseats.com/grilled-italian-sausage-with-sweet-and-sour-peppers-and-onions-recipe",
  "image_url": "https://www.seriouseats.com/thmb/OE7IbQnj0KLe86ImIknLrRp_dvk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120529-food-lab-cooking-sausage-hot-dog-17-f9016fb98ded41a0a52d0fc35ae55baa.jpg",
  "tags": [
    "Grilled Sausages",
    "Italian",
    "Grilled Pork",
    "Sausages",
    "Bell Peppers"
  ],
  "title": "Grilled Italian Sausage With Sweet-and-Sour Peppers and Onions Recipe",
  "full_text": "Grilled Italian Sausage With Sweet-and-Sour Peppers and Onions Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n65 mins\nActive\n30 mins\nTotal\n70 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(15ml)\nvegetable oil\n1\nlarge\nonion\n, sliced into 1/4-inch strips (about 2 cups)\n2\nred bell\npeppers\n, stems and cores removed, sliced into 1/4-inch strips\n2\ngreen bell\npeppers\n, stems and cores removed, sliced into 1/4-inch strips\n3\ntablespoons\n(45ml)\napple cider vinegar\n3\ntablespoons\n(45g)\nsugar\nKosher salt\nand freshly ground black pepper\n2\npounds\n(900g) sweet or\nhot Italian sausage\nBuns\n, for serving\nDirections\nHeat oil in a large skillet over medium-high heat until shimmering. Add onions and peppers and cook, stirring frequently, until softened and browned in spots, about 8 minutes. Add vinegar and sugar. Remove from heat and stir until sugar is dissolved. Season to taste with salt and pepper.\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nTransfer onion and pepper mixture to a 10-inch-square disposable aluminum pan. (Alternatively, construct a tray out of a double layer of heavy-duty aluminum foil, 10 inches square, with sides about 2 inches high.) Nestle sausages into onion and pepper mixture.\nPlace tray on hot side of grill and cook until simmering, about 4 minutes. Slide to cooler side of grill. Cover grill, with vents over sausages. Cook with all vents open until sausages register 140 to 145°F (60 to 63°C) on an instant-read thermometer, about 20 minutes, turning once halfway through.\nRemove lid. Using tongs, remove sausages from peppers and place directly on cooking grate over hot side of grill. Cook, turning occasionally, until well browned and crisp, about 3 minutes total. Return sausages to peppers. Toast buns over hot side of grill, if desired. Serve sausages with buns and sweet-and-sour peppers.\nSpecial Equipment\nGrill\n,\nchimney starter\n(optional), 10-inch square disposable aluminum pan,\ninstant-read thermometer\nRead More\nHow to Get Started Grilling\nGrilled Bratwurst With Beer, Mustard, and Sauerkraut\nGrilled Mexican Chorizo With Spicy Tomato-Caper Sauce\nRoasted Italian Sausage, Pepper, and Mushroom Sandwich\nThe Best Way to Grill Sausages\nGrilled Sausages\nItalian\nGrilled Pork\nSausages\nBell Peppers"
}