{
  "url": "https://www.seriouseats.com/grilled-octopus-with-chili-herb-oil",
  "image_url": "https://www.seriouseats.com/thmb/8JHu8y1m2HJE-7cPv4Ktt2kcpME=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190620-grilled-octopus-vicky-wasik-8-ea55a14037934188b81d1224ba63bca1.jpg",
  "tags": [
    "Octopus",
    "Grilled Seafood",
    "Summer Mains"
  ],
  "title": "Grilled Octopus With Chile-Herb Oil",
  "full_text": "Grilled Octopus With Chile-Herb Oil\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n35 mins\nTotal\n20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n2 1/2-pound\n;\n1 kg\n)\nwhole\ncooked octopus\n, chilled, drained of cooking liquid, cleaned of eyes and beak, and dried thoroughly (see note)\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n2\nteaspoons\n(\n10\nml\n) crushed or minced\nCalabrian chiles in oil\n, or a coarse\nchili paste\nsuch as\nsambal oelek\n1\nteaspoon\nminced\nfresh oregano leaves\nKosher salt\nLemon wedges\n, for serving\nFrisée\nor other\nleafy greens\n, for serving\nDirections\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate.\nIn a medium bowl, stir together olive oil, chiles, and oregano. Season lightly with salt and set aside. The sauce can be held at room temperature for up to 5 hours; refrigerate if storing longer and return to room temperature before using.\nIf you want to grill the octopus whole, leave it as-is. Alternatively, you can break the octopus down into parts, separating the head from the tentacles (you will already have cut out the eyes and beak where they meet); you can then leave the tentacles in sections, or separate them all into individual pieces.\nWhen ready to grill, lightly drizzle olive oil all over the octopus and season lightly with salt. Set on grill directly over the coals and sear until browned and crisped, about 4 minutes (grilling time will vary depending on the heat of your coals and distance between them and the grill grate.) Carefully flip octopus and brown the other side, about 4 minutes longer. Transfer to serving plates or platters if you want to serve the pieces as-is, or transfer them to a work surface if you want to cut them into smaller pieces, then arrange on serving plates.\nSerious Eats / Vicky Wasik\nStir sauce to mix, then spoon over octopus. Serve with lemon wedges and some leafy greens lightly dressed in olive oil and seasoned with salt.\nSpecial Equipment\nCharcoal grill\n,\nchimney starter\nNotes\nYou can use any of our octopus cooking methods here: sous vide; boiled; pressure-cooker. See our\nguide to cooking octopus\nfor more info. Note that we recommend cooling the octopus in its cooking liquid prior to cooking it further.\nTo dry the cooked octopus, pat it gently with paper towels (be careful not to tear the skin as much as possible). If any of the cooking liquid has gelled onto the octopus, remove it with towels as best you can. Alternatively, if you have the time in advance, you can set the cooked, cooled, and drained octopus on a parchment-lined rimmed baking sheet and let it air-dry, uncovered, in the refrigerator for at least three hours and up to overnight.\nMake-Ahead and Storage\nThe octopus can be cooked and refrigerated up to three days in advance; cool, drain, and dry on a parchment-lined rimmed baking sheet before wrapping in plastic.\nRead More\nHow to Get Started Grilling\nClassic Pulpo Gallego (Galician Octopus Tapa)\nOctopus Poke With Kimchi\nGrilled Squid With Olive Oil and Lemon\nOctopus\nGrilled Seafood\nSummer Mains"
}