{
  "url": "https://www.seriouseats.com/grilled-shrimp-chermoula-recipe",
  "image_url": null,
  "tags": [
    "Shrimp",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Grilled Shrimp",
    "Summer Mains"
  ],
  "title": "Grilled Shrimp With Chermoula Recipe",
  "full_text": "Grilled Shrimp With Chermoula Recipe\nJump to recipe\nPrep\n15 mins\nCook\n5 mins\nActive\n30 mins\nResting Time\n60 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\n(\n1\nkg\n)\nlarge shrimp, peeled and deveined\n1/2\nteaspoon\nbaking soda\n1\ntablespoon\n(\n15\ng\n)\nkosher salt\n, plus more to taste\n1\nteaspoon\n(\n5\ng\n)\nsugar\n2\nmedium\ncloves garlic\n, minced\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1\nrecipe\nchermoula\nDirections\nCombine shrimp, baking soda, salt, and sugar in a medium bowl and toss to coat. Thread shrimp onto sets of 2 skewers, alternating heads to tails and pushing shrimp together so that they fit tightly on skewers; you should have about 6 shrimp on each set of 2 skewers. Lay skewers on top of a baking dish so that shrimp are suspended above bottom of dish. Transfer to refrigerator and allow to rest for 1 hour. Meanwhile, combine garlic and olive oil in a small bowl.\nSerious Eats / J. Kenji López-Alt\nWhen shrimp are ready to grill, brush both sides with garlic/oil mixture.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nPlace shrimp directly over hot side of grill and cook, turning occasionally, until shrimp are just cooked through and well charred, 4 to 5 minutes total. Transfer shrimp to a cutting board.\nCarefully remove skewers from shrimp and transfer to a medium bowl. Add 1 tablespoon (15ml) chermoula and toss to coat. Season to taste with more salt if necessary. Transfer to a serving platter, spoon more chermoula on top, and serve immediately.\nSpecial Equipment\nGrill\n,\nchimney starter\n,\nwooden or metal skewers\n(soaked in water for 30 minutes if wooden)\nRead More\nA Comprehensive Guide to Buying Better Shrimp\nEasy Techniques to Improve Any Shrimp Recipe\nHow to Set Up Your Grill for Better Skewers, Kebabs, and Yakitori\nGrilled Lemongrass Shrimp\nGrilled Garlic-Lime Shrimp\nShrimp\nDairy-free Mains\nGluten-free Mains\nGrilled Shrimp\nSummer Mains"
}