{
  "url": "https://www.seriouseats.com/griled-cabbage-with-yogurt-and-mint-recipe",
  "image_url": null,
  "tags": [
    "Cabbage",
    "Gluten-free Sides",
    "Vegetarian Sides",
    "Grilled Vegetables",
    "Greek Yogurt"
  ],
  "title": "Grilled Cabbage With Yogurt and Mint Recipe",
  "full_text": "Grilled Cabbage With Yogurt and Mint Recipe\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n240\nml\n)\nGreek-style yogurt\n2\ntablespoons\n(\n30\nml\n)\njuice\nfrom\n1\nwhole\nlemon\n4\ntablespoons\n(\n60\nml\n)\nextra-virgin olive oil\n, divided, plus more for drizzling\n2\nmedium\ncloves garlic\n, minced\n1/4\ncup\n(\n7\ng\n) roughly chopped fresh\nmint leaves\n1/4\ncup\n(\n7\ng\n) roughly chopped\nfresh parsley leaves\nKosher salt\nand freshly ground black pepper\n1\nmedium head\ngreen cabbage\n, cut into\n6\nwedges\n, with core left intact\nDirections\nCombine yogurt, lemon juice, 2 tablespoons (30ml) olive oil, garlic, mint, and parsley in a medium bowl. Whisk until homogeneous. Season to taste with salt and pepper. Set aside.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate.\nPlace cabbage wedges directly over hot side of grill. Cook, covered, until well charred on first side, about 2 minutes. Flip cabbage, cover, and cook until charred on second side, another 2 minutes. Flip wedges to third side, cover, and cook until well charred, another 2 minutes. Transfer cabbage to cooler side of grill, cover, and continue cooking until mostly tender but still crunchy in center, about 4 minutes longer.\nSerious Eats / J. Kenji López-Alt\nTransfer cabbage to a large bowl and toss with remaining 2 tablespoons (30ml) olive oil, salt, and pepper. Transfer to a serving platter. Drizzle with sauce and serve immediately, drizzling with additional olive oil if desired.\nNotes\nTo cook the cabbage indoors instead, toss the raw wedges with 2 tablespoons (30ml) olive oil to coat. Place on a foil-lined broiler pan, and broil under high heat, turning occasionally, until well charred on all sides, about 15 minutes.\nSpecial Equipment\nGrill\n,\nchimney starter\nRead More\nGrilled Cabbage With Blue Cheese Dressing Recipe\nGrilled Cabbage With Spicy Thai Dressing Recipe\nGrilled Cabbage Wedges With Ginger-Miso Dressing Recipe\nHow to Get Started Grilling\nCabbage\nGluten-free Sides\nVegetarian Sides\nGrilled Vegetables\nGreek Yogurt"
}