{
  "url": "https://www.seriouseats.com/grilled-tuna-steaks",
  "image_url": "https://www.seriouseats.com/thmb/a68d_0mlpAYMbKKYEDmyIEGg_T8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190620-grilled-tuna-steak-vicky-wasik-11-e9e90dcf5f894d45b9d2aa4be1646670.jpg",
  "tags": [
    "Tuna",
    "Grilled Seafood",
    "Seafood Mains",
    "Summer Mains"
  ],
  "title": "Grilled Tuna Steaks",
  "full_text": "Grilled Tuna Steaks\nClose\nJump to recipe\nPrep\n0 mins\nCook\n30 mins\nActive\n30 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ntuna steaks\n, about\n6 to 8\nounces\n(\n170 to 225\ng\n) each and\n1 1/4 to 2 inches thick\nVegetable\n,\ncanola\n, or other\nneutral oil\n, for oiling the steaks\nKosher salt\nFreshly ground black pepper\n(optional; see note)\nDirections\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil grilling grate\n.\nSerious Eats / Vicky Wasik\nDry tuna steaks well with paper towels and lightly brush them all over with oil.\nSerious Eats / Vicky Wasik\nJust before cooking, season tuna steaks all over with salt and, if desired, pepper. Then set over hot side of grill. Cook tuna until first side is well-seared and the fish releases from the grill grate, 1 to 2 minutes. If the fish sticks, try to gently lift it from below using a thin metal spatula or the tines of a carving fork inserted down between the grill grates. Turn fish and repeat on second side.\nSerious Eats / Vicky Wasik\nFor an ideal doneness of rare, cook the fish long enough to sear each side, and no longer. You should be able to watch the heat penetrate the fish from each side because tuna changes color so dramatically, from a deep purple when raw to a beige when cooked. Use the side of the fish to gauge doneness: if you want it very rare in the center, the sides of the steaks should still look purple, with the color of the cooked fish just starting to creep in from above and below. If you want it a little more done, let the cooked color creep up a bit more from both sides. We don't recommend cooking tuna steaks beyond medium-rare.\nSpecial Equipment\nGrill\n,\ncharcoal chimney starter\n,\ngrill brush\n, grilling spatula,\ninstant-read thermometer\nNotes\nBlack pepper is a spice and adds a specific flavor to the food you cook; salt, on the other hand, is an essential seasoning, necessary for food to taste its best. While we always use salt, we use black pepper only when we desire its specific flavor and aroma.\nRead More\nHow to Shop for Sustainable Seafood\nWhat Is \"Sushi-Grade,\" Anyway? A Guide to Eating Raw Fish At Home\nSous Vide Tuna Recipe\nSashimi de Atún (Mexican Tuna Sashimi With Soy-Lime Dressing)\nTuna Poke (Hawaiian Raw-Tuna Salad) Recipe\nTuna\nGrilled Seafood\nSeafood Mains\nSummer Mains"
}