{
  "url": "https://www.seriouseats.com/grilled-green-bean-salad-red-peppers-radishes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ntuK3kcXZE73JyrKFBjvT9h39GA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160603-grilled-green-bean-salad-6-1c4314de811749358611da8016b48db9.JPG",
  "tags": [
    "Quick Salads",
    "Vegetarian Salads",
    "Grilled Vegetables",
    "Green Beans",
    "Radishes"
  ],
  "title": "Grilled Green Bean Salad With Red Peppers and Radishes Recipe",
  "full_text": "Grilled Green Bean Salad With Red Peppers and Radishes Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n15 mins\nTotal\n15 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\nfresh juice\nfrom\n1\nwhole\nlemon\n(\n15\nml\n)\n1\nteaspoon\nDijon mustard\n4\ntablespoons\nextra-virgin olive oil\n, divided (\n60\nml\n)\nKosher salt\nand freshly ground black pepper\n2\nscallions\n, white and light green parts only, thinly sliced\n1\nwhole\nred bell pepper\n, thinly sliced (about\n4\nounces\n;\n110\ng\n)\n6 to 8\nsmall\nradishes\n, thinly sliced (about\n3\nounces\n;\n85\ng\n)\n1\npound\ntrimmed\ngreen beans\n(\n450\ng\n)\nSmall handful minced\nfresh parsley leaves\nDirections\nIn a large bowl, whisk together lemon juice and mustard. Slowly drizzle in three tablespoons olive oil, whisking constantly. Season with salt and pepper. Add scallions, bell peppers, and radishes, and set aside. In a separate bowl, toss the green beans with the remaining tablespoon olive oil and season with salt and pepper.\nTo Cook on the Grill:\n(See note.)\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals over half the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate.\nAdd the green beans to the grill directly over the coals, placing them perpendicular to the grill grates or using a thin-grated vegetable basket if you have one to prevent them from falling into the grates. Cook, turning occasionally, until blistered, charred, and tender-crisp, about 3 minutes. Continue with Step 5.\nTo Cook Indoors:\n(See note.) Adjust rack to as close as possible to broiler and preheat broiler to high. Arrange beans in a single layer on a foil-lined rimmed baking sheet or broiler pan. Broil until beans are blistered and very lightly charred, 2 to 5 minutes depending on strength of broiler. Continue with Step 5.\nTransfer beans to the bowl with the dressing/scallion/radish/pepper mixture. Add parsley and toss to combine. Season the salad with salt and pepper. Serve immediately or at room temperature.\nNotes\nThe recipe gives instructions for cooking on a fresh fire, but it can easily be adapted to cook on the remaining fire from a larger cooking project. The fire should be hot enough to sear, so if you need to add a few more coals before throwing the beans on, do so.\nSpecial Equipment\nGrill\nThe recipe gives instructions for cooking on a fresh fire, but it can easily be adapted to cook on the remaining fire from a larger cooking project. The fire should be hot enough to sear, so if you need to add a few more coals before throwing the beans on, do so.\nThis Recipe Appears In\nThis Simple Grilled Green Bean Salad Is a Blueprint for Summer Success\nQuick Salads\nVegetarian Salads\nGrilled Vegetables\nGreen Beans\nRadishes"
}