{
  "url": "https://www.seriouseats.com/grilling-eggplant-and-goat-cheese-spirals-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8MXqASUD7R3HNA8R8kQwEhmMLxQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20080219-grilled-eggplant-spirals-38d07daa8c5340989db761e77e7a22d1.jpg",
  "tags": [
    "Goat Cheese",
    "Vegetarian Sides",
    "Grilled Vegetables",
    "Vegetable Sides"
  ],
  "title": "Eggplant and Goat Cheese Spirals Recipe | Grilling",
  "full_text": "Eggplant and Goat Cheese Spirals Recipe | Grilling\nClose\nJump to recipe\nPrep\n30 mins\nCook\n10 mins\nCooling Time\n2 hrs\nTotal\n2 hrs 40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\neggplant\nOlive oil\nfor brushing\n1/3\ncup\nchopped\nfresh chives\n3\ncloves\ngarlic\n, minced\nBalsamic vinegar\nfor sprinkling\nLeaves\nfrom\n12\nfresh thyme\nsprigs\n, finely chopped\n1\nlog\nfresh goat cheese\n, at room temperature\nDirections\nCut off and discard a thin slice from the stem and blossom ends of the eggplant. Cut the eggplant lengthwise into slices 1/4 inch thick. Lay the slices on a double thickness of paper towels and sprinkle generously with salt. Let stand until beads of water appear on the surface, about 20 minutes. Rinse with cold running water to remove the salt and bitter juices, then pat dry with additional paper towels.\nLight one chimney full of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and spread coals out evenly. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate. Brush the eggplant slices lightly on one side with olive oil, then place them on the grill in a single layer, oiled sides down. Brush the tops with additional oil and grill until the eggplant begins to soften and the grill marks are clearly visible, then turn and continue grilling until soft but not too deeply browned, about 4 minutes total. As the eggplant slices are done, use tongs to transfer them to a large platter.\nArrange half of the slices in a single layer on another platter and sprinkle with salt and freshly ground pepper to taste. Scatter half each of the chives and garlic evenly over the slices and sprinkle with a little balsamic vinegar. Sprinkle all the thyme evenly over the top. Top with the remaining eggplant slices, again in a single layer, and scatter the remaining chives and garlic over the top. Sprinkle with a little more vinegar. Let stand in a cool place for at least 2 hours, or cover and refrigerate for up to 3 days.\nWhen ready to serve, carefully spread each eggplant slice with an equal amount of the goat cheese and roll up into a tight spiral. Secure with a toothpick, if desired. Serve at room temperature.\nThis Recipe Appears In\nFruit Roll Up: How to Grill Sliced Eggplant and 3 Ways to Stuff It\nGoat Cheese\nVegetarian Sides\nGrilled Vegetables\nVegetable Sides"
}