{
  "url": "https://www.seriouseats.com/grilling-apples-in-caramel-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/4A1eE463YIrfytqnAPJNXMKPXzY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20101116-grilled-apple-dessert-d21be7a739ff4294a35f6dda5818cecd.jpg",
  "tags": [
    "Desserts",
    "Apple",
    "Grilling Guides"
  ],
  "title": "Grilled Apples in Caramel Sauce Recipe",
  "full_text": "Grilled Apples in Caramel Sauce Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nActive\n20 mins\nCooling Time\n10 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsheet\nfrozen\npuff pastry\n, thawed\nFor the Sauce:\n1/2\ncup\nlight brown sugar\n1/4\ncup\nheavy cream\n1/4\ncup\nunsalted butter\n4\nGranny Smith apples\n, peeled, cored, and cut into 1/2-inch thick wedges\n1/4\ncup\nunsalted butter\n, melted\nCoarse\nsea salt\n, optional\n1/2\ncup\nof\nwhipped cream\nor creme fraiche\nDirections\nUsing 4-inch biscuit cutter, cut 4 rounds from the pastry sheet. Using fork, prick each pastry round about 12 times to prevent dough from rising too much in oven. Following package directions, bake pastry rounds on baking sheet until golden brown. Transfer to wire rack to cool.\nIn small saucepan over medium heat, combine brown sugar, heavy cream, and 1/4 cup of butter for sauce, stirring constantly until sugar is dissolved and butter is melted, 4 to 5 minutes. Remove from heat and set aside.\nIn a large bowl, toss apple slices with melted butter to coat well.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread coals evenly over entire surface of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand oil the grilling grate. Place the apple slices on grill and cook over medium heat, with lid closed as much as possible, until well browned and tender, 8 to 10 minutes, flipping once halfway through cooking. Transfer apple slices to bowl. Reheat sauce over low heat, if necessary, and spoon some sauce over apple slices, gently tossing to coat.\nTo assemble, place each pastry round on a dessert plate. Arrange apple slices on top of the pastry rounds. Spoon remaining sauce over apples, allowing it to run down onto plates. Sprinkle with a little coarse salt, if desired. Finish with dollop of whipped cream or creme fraiche.\nDesserts\nApple\nGrilling Guides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-apples-in-caramel-sauce-recipe.webp?"
}