{
  "url": "https://www.seriouseats.com/grilled-king-oyster-mushrooms-bacon-teriyaki-glaze-recipe",
  "image_url": "https://www.seriouseats.com/thmb/giXpJLNQfxEfvJIBemK0x5d-c70=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__06__20160606-yakitori-negima-14-04713045c14e42d9b3628f2cf7792ce3.jpg",
  "tags": [
    "Japanese",
    "Grilled Vegetables",
    "Bacon",
    "Oyster Mushroom",
    "Vegetable Sides"
  ],
  "title": "Grilled King Oyster Mushrooms With Bacon and Teriyaki Glaze Recipe",
  "full_text": "Grilled King Oyster Mushrooms With Bacon and Teriyaki Glaze Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n35 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n500\ng\n)\nking oyster mushrooms\n12\nounces\n(340g)\nbacon\n, cut into 1-inch pieces\nKosher salt\nand freshly ground black pepper\n1/4\ncup\n(60ml)\nteriyaki sauce\n(see note)\nDirections\nCut mushrooms into 1-inch lengths, keeping the pieces next to each other so that you can reconstruct the mushrooms on a skewer.\nThread mushroom pieces onto metal or wooden skewers, alternating mushrooms with 1 to 2 pieces of bacon. When threaded, mushrooms should be reconstructions of themselves, with bacon in between each section.\nLight 2/3 chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium-high heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate.\nPlace mushrooms directly over hot side of grill and cook, turning frequently and sprinkling with salt and pepper 2 to 3 times during grilling, until mushrooms are fully tender and browned on the exterior and bacon is crisp, about 15 minutes total. Brush mushrooms with teriyaki glaze and cook for 30 seconds. Turn and brush second side with teriyaki and cook for 30 seconds longer. Remove from grill and allow to rest for 1 to 2 minutes. Brush with additional glaze and serve immediately.\nSpecial equipment\nGrill,\nskewers\nNotes\nI strongly suggest making your own\nteriyaki sauce\ninstead of using store-bought; it will taste much better. For an even more flavorful sauce, try adding a few smashed garlic cloves, slices of ginger, and roughly chopped scallions to the saucepan as the sauce reduces.\nThis Recipe Appears In\nThe Food Lab: The Secret to Perfectly Imperfect Yakitori (Japanese-Style Grilled Chicken Skewers)\nJapanese\nGrilled Vegetables\nBacon\nOyster Mushroom\nVegetable Sides"
}