{
  "url": "https://www.seriouseats.com/guava-and-cream-cheese-pastelitos-recipe",
  "image_url": "https://www.seriouseats.com/thmb/OLTievFcyHxRkUy3yIX5xmRmKOE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110216-127677-Serious-Sweets-GuavaCheese-PRIMARY-5f6dce7c7bd64076a1406a2398d97100.jpg",
  "tags": [
    "Pastries",
    "South American",
    "Desserts"
  ],
  "title": "Guava and Cream Cheese Pastelitos",
  "full_text": "Guava and Cream Cheese Pastelitos\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n20 mins\nCooling Time\n10 mins\nTotal\n45 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nAll-purpose flour\nfor dusting counter\n2\nsheets\n(\n1\n(\n17.3-ounce) package\n) frozen\npuff pastry\n, thawed according to package instructions (see note)\n8\nounces\ncream cheese\n, cut into small pieces and softened\n6\ntablespoons\nsour cream\n1\ntablespoon\nlemon juice\n1/2\nteaspoon\nsalt\n8\nounces\nguava paste\n, cut into 1/4-inch cubes (see note)\n2\negg yolks\nDirections\nAdjust oven racks to upper third and lower third positions and preheat oven to 400°F (205°C, see note). Line 2 rimmed baking sheets with parchment paper.\nLightly dust the counter and rolling pin with flour. Roll out each puff pastry sheet to a 12-inch square. Cut each into quarters to make four 6-inch squares.\nBeat cream cheese, 4 tablespoons sour cream, lemon juice, and salt until light and fluffy, 1 to 2 minutes.\nPlace 2 tablespoons cream cheese mixture in center of each square. Evenly distribute guava cubes among squares, arranging them on top of the cream cheese mixture.\nSerious Eats / María del Mar Cuadra\nIn a small bowl, beat egg yolks and remaining 2 tablespoons sour cream. Brush edges of each square with egg wash, then, fold the squares diagonally to form triangles. Seal the edges by pressing them with the tines of a fork. Brush triangles with egg wash.\nSerious Eats / María del Mar Cuadra\nPlace the pastelitos on the prepared baking sheets, spacing them about 1 1/2 inches apart. Bake until puffed and golden, 12 to 15 minutes, alternating baking sheets halfway through baking. Transfer baking sheets to cooling racks. Cool pastelitos on sheets 5 to 10 minutes prior to serving. May be eaten at room temperature. Pastelitos are best eaten day they’re made.\nSpecial Equipment\nTwo\nrimmed baking sheets\n; parchment paper;\nstand mixer\nor\nhand mixer\n(optional);\nrolling pin\n;\nruler\n; pastry brush; two\ncooling racks\nNotes\nI used one (17.3-ounce) package of Pepperidge Farm brand frozen puff pastry sheets for this recipe, which contains two puff pastry sheets. Dufour brand frozen puff pastry comes in 14-ounce packages containing only one sheet of puff pastry. If using Dufour you will need two packages, and will get ten pastelitos, rather than eight. Roll the thawed pastry sheets out to 12- by 16-inches. Cut off a 12- by 4-inch strip. Cut remaining 12- by 12-inch piece into four 6-inch squares. Proceed with recipe, but increase guava to 10 ounces and cream cheese to 12 ounces. Fold the square pieces of pastry diagonally into triangles, and fold the two 12- by 4-inch strips in half over the filling to make rectangular pastelitos. Increase baking time to 15 to 20 minutes.\nGuava paste is available in the Latin American aisle of most supermarkets and also in a variety of online stores. In a pinch, quince paste is an acceptable substitute.\nBoth versions of the recipe may be halved. Adjust oven rack to middle position if doing so.\nRead More\nGuava Bars Recipe\nGuava and Cream Cheese Puff-Pastry Waffle Recipe\nA Guide to Tropical Fruit in South America\nTaste Test: The Best Frozen Puff Pastry\nBlitz Puff Pastry Recipe\nPastries\nSouth American\nDesserts"
}