{
  "url": "https://www.seriouseats.com/guinness-chocolate-sheet-cake-recipe-11692522",
  "image_url": "https://www.seriouseats.com/thmb/kl5CFX-sTnFGbZLeV3bbwK0RCjY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250306-SEA-ChocolateGuinnessSheetCake-HannahHufham-Beauty1-60-43e34993bc31449abb553a199540b167.jpg",
  "tags": [
    "Chocolate",
    "The Latest",
    "Cakes",
    "Desserts",
    "St. Patrick's Day"
  ],
  "title": "Guinness-Chocolate Sheet Cake",
  "full_text": "Guinness-Chocolate Sheet Cake\nClose\nJump to recipe\nPrep\n20 mins\nCook\n35 mins\nCooling Time:\n2 hrs\nTotal\n2 hrs 55 mins\nServes\n8\nto 12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nUnsalted butter\n, for greasing the pan\n1\ncup\n(\n240\nml\n)\nGuinness Extra Stout Beer\n(see notes)\n2 1/4\nounces\nunsweetened natural cocoa powder\n(\n65\ng\n;\n3/4\ncup\n), plus more for pan\n7 3/4\nounces\nall-purpose flour\n(\n224\ng\n;\n1 3/4\ncups\n)\n10 1/2\nounces\ngranulated sugar\n(\n300\ng\n;\n1 1/2\ncups\n)\n1 1/2\nteaspoons\nbaking powder\n1 1/2\nteaspoons\nbaking soda\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n2\nlarge\neggs\n1\ncup\n(\n240\nml\n)\nwhole milk\n1/2\ncup\n(\n120\nml\n)\nvegetable oil\n2\nteaspoons\nvanilla extract\nFor the Guinness Syrup:\n1\ncup\n(\n240\nml\n)\nGuinness Extra Stout Beer\n3 1/2\nounces\ngranulated suga\nr (\n100\ng\n;\n1/2\ncup\n)\n1/2\nteaspoon\ninstant\nespresso powder\nFor the Malted Vanilla Frosting:\n4\nounces\n(\n113\ng\n)\ncream cheese\n, softened\n5 1/4\nounces\ngranulated sugar\n(\n150\ng\n;\n3/4\ncup\n)\n3/4\nounces\nmalted milk powder\n(\n22\ng\n;\n2\ntablespoons\n)\n2 1/2\ncups\n(\n591\nml\n)\nheavy cream\n1\nteaspoon\nvanilla extract\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat to 350°F (175°C). Grease a 10- by 15-inch rimmed baking sheet or 9- by 13-inch baking pan with butter and dust with cocoa powder, shaking out excess. (See notes.)\nSerious Eats / Hannah Huffman\nIn a small saucepan, bring beer to a simmer over medium heat; remove from heat and set aside. Meanwhile, in a large bowl, whisk flour, sugar, cocoa powder, baking powder, baking soda, and salt together to combine.\nSerious Eats / Hannah Huffman\nAdd eggs, milk, oil, and vanilla to flour mixture; whisk until well combined and no streaks remain. Gradually pour warmed beer into batter and whisk to combine. (Batter will be thin.) Pour batter into prepared pan.\nSerious Eats / Hannah Huffman\nBake until a toothpick or cake tester inserted into the center comes out clean and cake springs back when gently touched, 25 to 30 minutes. Remove from oven and cool completely in pan on a wire rack, about 1 hour.\nSerious Eats / Hannah Huffman\nWhile the cake cools, prepare the Guinness Syrup\n: In a small saucepan, whisk beer, sugar, and espresso granules to combine. Bring to a simmer over medium heat; cook, stirring often, until sugar is dissolved, about 2 minutes. Remove from heat.\nSerious Eats / Hannah Huffman\nUsing a fork, poke the cooled cake all over. Using a pastry brush, brush cake with syrup until all the liquid is absorbed. (It may look like a lot of liquid, but the cake will soak it all up.)\nSerious Eats / Hannah Huffman\nFor the Malted Vanilla Frosting:\nIn the bowl of a stand mixer fitted with the paddle attachment, beat cream cheese, sugar, malted milk powder, vanilla, and salt on medium speed until smooth, using a flexible spatula to scrape down bowl and beater as needed, about 1 minute. Increase the speed to high, then gradually add heavy cream until mixture is smooth and medium-stiff peaks form, 5 to 6 minutes. (Alternatively, frosting can be prepared in a large bowl with an electric hand mixer.)\nSerious Eats / Hannah Huffman\nUsing a flexible spatula or offset spatula, spread frosting over cooled cake. Refrigerate until chilled and set, about 1 hour.\nSerious Eats / Hannah Huffman\nSpecial Equipment\n10- by 15-inch rimmed baking sheet, small saucepan,\nwhisk\n, toothpick or cake tester, pastry brush,\nstand mixer\nor\nelectric hand mixer\n, flexible spatula or offset spatula\nNotes\nBe sure to use bottled Guinness Extra Stout Beer, which has less water, more concentrated roasted barley flavor, and residual sugar than the Guinness Draft Stout sold in cans. If you can’t find any Guinness Extra Stout, Dragon Stout or Left Hand Brewery Milk Stout both have a similar flavor profile and would be good substitutes.\nIf using a 9- by 13-inch baking pan, you may have to increase baking time by 3 to 5 minutes.\nDark brown sugar can be substituted for granulated sugar in both the cake and syrup, which will give the dessert deeper caramel notes.\nMake-Ahead and Storage\nThe cake can be baked up to 1 day in advance;once cooled, wrap cake in plastic and store at room temperature. The syrup can be made up to 3 days in advance and refrigerated in an airtight container. The frosting can be made up to 3 days in advance and refrigerated in an airtight container; re-whip in the bowl of a stand mixer fitted with a paddle attachment or in a large bowl using an electric mixer before spreading over cake.\nThe frosted cake can be loosely covered with plastic wrap and refrigerated for 2 to 3 days.\nChocolate\nThe Latest\nCakes\nDesserts\nSt. Patrick's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/guinness-chocolate-sheet-cake.webp?"
}