{
  "url": "https://www.seriouseats.com/gulab-jamun",
  "image_url": "https://www.seriouseats.com/thmb/vO-HM7y3sb11_kNpu_AwnUJ82WQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20201109-gulab-jamuns-nik-sharma-9-ad652cf623834c1aaff916678aba47f1.jpg",
  "tags": [
    "Indian",
    "Stovetop",
    "Desserts"
  ],
  "title": "Gulab Jamun Recipe",
  "full_text": "Gulab Jamun Recipe\nClose\nJump to recipe\nPrep\n55 mins\nCook\n25 mins\nActive\n60 mins\nSoaking Time\n4 hrs\nTotal\n5 hrs 20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Syrup:\n2\ncups\n(\n480\nml\n)\nwater\n14\nounces\n(\n2\ncups\n;\n400\ng\n)\nsugar\n1\ntablespoon\n(\n15\nml\n)\nlemon juice\n1\npinch\n(\n15\nstrands\n)\nsaffron\n4\ngreen cardamom pods\n, crushed\n2\nwhole\ncloves\n1\nteaspoon\n(\n5\nml\n)\nrose water\nFor the Jamuns:\n1.4\nounces\n(\n1/4\ncup\n;\n40\ng\n) fine\nsemolina flour\n(see note)\n1/4\ncup\n(\n60\nml\n)\nmilk\n5.3\nounces\n(\n2\ncups\n;\n150\ng\n)\nnon-fat dried milk powder\n(see note)\n1\nteaspoon\nbaking powder\n1/2\nteaspoon ground\ngreen cardamom\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; if using\ntable salt\n, use half as much by volume\n6\ntablespoons\n(\n90\nml\n)\nheavy cream\n, divided plus more as needed\n3\ncups\n(\n720\nml\n)\ngrapeseed oil\n, for frying (see note)\n3\ntablespoons\n(\n25\ng\n) chopped\npistachios\nor\ncashews\n, for garnish (optional)\nDirections\nFor the Syrup:\nCombine water, sugar, lemon juice, saffron, cardamom, and cloves in a medium saucepan. Bring to a boil over medium-high heat, stirring occasionally with a rubber spatula, then reduce heat to a simmer and cook until a drop of the syrup pressed between two teaspoons forms a sticky, thin thread when spoons are pulled apart, about 5 minutes. Remove from heat, stir in rose water, cover, and set aside to keep warm.\nSerious Eats / Nik Sharma\nFor the Jamuns:\nIn a small bowl, stir together semolina and milk, and set aside for 30 minutes to allow semolina to soak. Line a rimmed baking sheet with parchment paper. In a large bowl, whisk together milk powder, baking powder, cardamom, and salt. Sift mixture twice through a fine-mesh strainer onto prepared baking sheet, using clean hands or a bowl scraper to break up any lumps or bits that might be left behind in the strainer basket.\nTransfer sifted mixture back to large bowl, and make a small well in the center; return sheet of parchment to baking sheet, and set aside. Add the semolina-milk mixture along with 1/4 cup (60ml) cream to center of well and, using clean hands, mix ingredients to form stiff but sticky dough. If mixture seems dry, add more cream as needed, 1 tablespoon (15ml) at a time, until dough forms. When mixing, try not to aggressively knead the dough, as the gulab jamuns will become quite dense; instead, press the ingredients gently together with your fingertips to form dough.\nSerious Eats / Nik Sharma\nTo form jamuns, take 1 tablespoon of dough and roll between palms to shape into a smooth, 1-inch (2.5 cm) ball. The dough will appear sticky at first, but the heat from your palms will help soften it and make it more pliable. If any cracks appear on the surface, wet your palm with a drop or two of heavy cream to help shape and smooth out ball. Place formed jamun on the reserved parchment-lined baking sheet, and repeat forming process with remaining dough (you should end up with 18 balls).\nSerious Eats / Nik Sharma\nIn a medium saucepan or Dutch oven, heat ghee or oil over medium-high heat to 325°F (160°C). Line a plate with paper towels. Working in two batches, carefully add half of the dough balls, one at a time, to the hot oil; using a slotted spoon, immediately move each ball as it's added to the oil to prevent them from sticking to bottom of the pot. Cook, occasionally moving balls around with a slotted spoon to ensure even cooking, until jamuns are golden brown all over, about 3 minutes. Using slotted spoon, transfer to paper towel-lined plate, and allow to rest 30 seconds. Transfer fried jamuns to saucepan of scented syrup, and cover. Repeat process with remaining dough balls.\nSerious Eats / Nik Sharma\nLet jamuns soak in the syrup, covered, for at least 4 hours, preferably overnight. (After the initial 4-hour soak, the gulab jamuns can be transferred along with the syrup to the refrigerator.) To serve, gently reheat gulab jamuns in the syrup over low heat until warmed through. Transfer to a platter or individual serving plates, spooning syrup generously over top, and garnish with chopped pistachios or cashews, if using. Serve immediately.\nSerious Eats / Nik Sharma\nNotes\nThis recipe was tested using Bob’s Red Mill semolina, and it was tested with both Nestle and Bob's Red Mill branded dried milk powder.\nGhee or a neutral-flavored oil can be used instead of grapeseed oil. If using ghee, be sure to serve the gulab jamuns warm to ensure the fat doesn't solidify and coat the gulab jamuns in an unpleasant way.\nMake-Ahead and Storage\nOnce soaked in syrup, the gulab jamuns can be kept in an airtight container in the refrigerator for up to three days.\nRead More\nChocolate Chip Gulab Jamun\nKaju Katli\nMilk Creams (Indian Cashew Sweets)\nIndian\nStovetop\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/gulab-jamun-recipe.webp?"
}