{
  "url": "https://www.seriouseats.com/guyanese-pepperpot-recipe-5222656",
  "image_url": "https://www.seriouseats.com/thmb/HZFNPdQv1s1RoRS130HMJkbjf-0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220308-Guyanese-Pepperpot-Liz-Voltz-hero-horz-1-2-232649f358f54e6c8f883aa2582a17c2.JPG",
  "tags": [
    "Oxtail",
    "Beef Chuck",
    "The Latest",
    "Guyanese"
  ],
  "title": "Guyanese Pepperpot",
  "full_text": "Guyanese Pepperpot\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs 15 mins\nTotal\n2 hrs 35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(900g)\ncow foot\n, cut into roughly 1- by 2-inch pieces (see note)\n2\nteaspoons\n(8g)\nkosher salt\n, divided\n2 1/2\nteaspoons\nchicken bouillon\n, divided\n1 1/4\ncups\n(420ml)\ncassareep\n, divided\n21\nsprigs\nfresh thyme\n, divided\n24\nwhole cloves\n, divided\n3\ncinnamon\nsticks\n(about 3 inches each), divided\n1\npound\n(450g)\noxtail with separated joints\n1\npound\n(450g)\nbone-in beef chuck\n, cut into roughly 2-inch pieces (see note)\n6\nmedium cloves\ngarlic\n(about 25g), finely minced\n4\nfresh wiri wiri peppers\n(see note)\n2\ntablespoons\n(24g)\nlight brown sugar\nOne 2 1/2–inch knob\nfresh ginger\n(about\n30\ng\n), peeled and grated\n1/2 of a\nwhole nutmeg\n(\n2\ng\n), grated\nOne\n1-inch strip\norange peel\n, trimmed of excess white pith\nDirections\nSeason cow foot all over with salt and 1/2 teaspoon chicken bouillon. In a stovetop pressure cooker or electric multicooker (such as an Instant Pot), combine cow foot with 1/2 cup cassareep, 7 sprigs thyme, 8 whole cloves, 1 cinnamon stick, and 4 cups water. Bring to high pressure and cook for 60 minutes. Depressurize the cooker using the rapid release valve, then transfer cow foot and cooking juices into a large pot or Dutch oven and set aside.\nSerious Eats / Liz Voltz\nSeason oxtail all over with salt and 1/2 teaspoon chicken bouillon. Using the same pressure cooker, combine oxtails with 1/2 cup cassareep, 7 sprigs thyme, 8 whole cloves, 1 cinnamon stick, and 2 cups water. Bring to high pressure and cook for 30 minutes. Depressurize the cooker using the rapid release valve, then transfer cooked oxtails and their cooking liquid into the pot with the cow foot.\nSerious Eats / Liz Voltz\nSeason beef chuck all over with salt and ½ teaspoon chicken bouillon. Using the same pressure cooker, combine beef chuck with 1/2 cup cassareep, 7 sprigs thyme, 8 whole cloves, 1 cinnamon stick, and 3 cups water. Bring to high pressure and cook for 30 minutes. Depressurize the cooker using the rapid release valve, then transfer cooked beef chuck and its cooking liquid into the pot with the cow foot and oxtails.\nSerious Eats / LIz Voltz\nAdd minced garlic, wiri wiri peppers (puncture one or two peppers with a knife first for extra chile heat), brown sugar, grated ginger, nutmeg, orange peel, and the remaining 1/4 cup cassareep and 1 teaspoon chicken bouillon to the pot and stir well. Bring to a simmer, then reduce heat to medium-low and cook for 15 minutes; the stew's sauce should be brothy but with body. Season with salt, if needed.\nSerious Eats / Liz Voltz\nRemove from heat, then skim any fat from the surface. Serve with bread.\nSerious Eats / Liz Voltz\nNotes\nAsk your butcher to cut the beef foot and bone-in chuck for you; otherwise, substitute an equal weight of boneless beef chuck and leave the beef foot as-is.\nIf you can't find fresh Guyanese wiri wiri peppers, you can use dried ones or substitute Scotch bonnet peppers.\nMake-Ahead and Storage\nThe stew can be refrigerated in an air-tight container for up to 5 days. Reheat gently before serving.\nOxtail\nBeef Chuck\nThe Latest\nGuyanese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/guyanese-pepperpot.webp?"
}