{
  "url": "https://www.seriouseats.com/gyudon-japanese-simmered-beef-and-rice-bowl-recipe",
  "image_url": null,
  "tags": [
    "Japanese",
    "Beef Chuck",
    "Ribeyes",
    "White Rice",
    "Rice & Grain Mains"
  ],
  "title": "Gyudon (Japanese Simmered Beef and Rice Bowls)",
  "full_text": "Gyudon (Japanese Simmered Beef and Rice Bowls)\nJump to recipe\nCook\n20 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmall\nonion\n, slivered (about\n4\nounces\n;\n120\ng\n)\n1/2\ncup\n(\n120\nml\n) homemade\ndashi\n, or the\nequivalent\nin\nHondashi\n(see note)\n1/4\ncup\n(\n60\nml\n) dry\nsake\n2\ntablespoons\n(\n30\nml\n)\nsoy sauce\n1\ntablespoon\n(\n12\ng\n)\nsugar\n, plus more to taste\n1/2\npound\n(\n225\ng\n) thinly shaved\nbeef ribeye\nor\nchuck steak\n(see note)\n1\nteaspoon\n(\n5\nml\n) grated\nfresh ginger\nSalt\n2\ncups\ncooked white rice\n2\nlarge\npoached eggs\n(optional)\nSliced\nscallions\nBeni-shoga\n(see note)\nTogarashi\n(see note)\nDirections\nCombine onion, dashi, sake, soy sauce, and sugar in a medium saucepan or saucier and bring to a simmer over medium heat. Cook, stirring occasionally, until onion is softened, about 5 minutes.\nAdd beef and cook, stirring until beef is cooked through and liquid has reduced down to an intensely flavored broth, about 5 minutes. Stir in ginger and simmer for 1 minute longer. Adjust seasoning with salt and sugar to taste.\nDivide rice between 2 to 3 bowls and top with beef and sauce mixture. Garnish each bowl with a poached egg (if using), sliced scallions, beni-shoga, and togarashi. Serve immediately.\nNotes\nHomemade dashi is nice, but not necessary for this simple dish, which has so many other strong flavors. Look for thinly shaved beef at Japanese markets, ask your butcher to shave it for you, or use frozen shaved steak intended for Philly cheesesteaks. The beef can be cooked directly from the freezer if using frozen; just add a few minutes to the cooking time, and make sure to carefully stir the beef and break it apart as it thaws. Beni-shoga is bright red pickled hot ginger. Togarashi is Japanese chile powder, which comes in both ichimi (chiles only) and\nshichimi\n(chiles blended with other dried aromatics) versions. Either will work on this dish. All of these ingredients can be found in any Japanese market or well-stocked Western supermarket.\nJapanese\nBeef Chuck\nRibeyes\nWhite Rice\nRice & Grain Mains"
}