{
  "url": "https://www.seriouseats.com/habanero-barbecue-wings-recipe-super-bowl",
  "image_url": "https://www.seriouseats.com/thmb/YYGkA6VHDYQ1m4XqR5ehWyDvlpc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110122-134060-hot-barbecue-wings-2a459348a51146dbb640d8bdc2c41eb0.jpg",
  "tags": [
    "Grilled Chicken",
    "Snacks & Appetizers"
  ],
  "title": "Grilled Habanero Barbecue Wings Recipe",
  "full_text": "Grilled Habanero Barbecue Wings Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nActive\n75 mins\nCooling Time\n5 mins\nTotal\n110 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n3\ncloves\ngarlic\n2\nhabanero\nchiles\n1\ntablespoon\nolive oil\n1\nsmall\nonion\n, finely chopped\n2\ntablespoons\nfinely chopped\ngreen bell pepper\n2\ncups\ntomato sauce\n1/4\ncup\napple cider vinegar\n1/4\ncup\nhoney\n1/4\ncup\nmolasses\n3\ntablespoons\nWorcestershire sauce\n3\ntablespoons\ndark brown sugar\n2\ntablespoons\nyellow mustard\nKosher salt\nto taste\nFor the Rub:\n1\ntablespoon\npaprika\n1\nteaspoon\ngranulated garlic\n1\nteaspoon\nkosher salt\n1\nteaspoon\nfreshly\nground black pepper\n1/4\nteaspoon\ncayenne pepper\n3\npounds\nchicken wings\n, cut into drumettes and flats\n1 or 2\nchunks\nlight smoking wood\n, such as apple or cherry\nDirections\nTo make the sauce:\nHeat a cast iron skillet over medium-high heat. Place garlic cloves and habaneros in the skillet and cook, turning occasionally, until they are blackened in spots, about 10 minutes. Remove from skillet and let cool. Peel and roughly chop garlic. Seed and roughly chop habaneros.\nHeat olive oil In a medium saucepan over medium heat until shimmering. Add onions and cook, stirring occasionally, until softened and lightly browned. Add garlic, habaneros, and green bell pepper and cook for 1 minute. Add tomato sauce, vinegar, honey, molasses, Worcestershire sauce, sugar, and mustard and stir to combine. Bring to a boil, reduce heat to medium-low, and simmer until thickened, stirring occasionally, about 20 to 30 minutes. Season with salt to taste. Pour sauce into the jar of a blender and puree until almost smooth. Pour sauce into a jar and store in refrigerator until ready to use, up to two weeks.\nTo make the wings:\nCombine paprika, granulated garlic, salt, black pepper and cayenne in a small bowl to make the rub. Place chicken wings in a large Ziploc bag and sprinkle in the rub. Seal bag and toss wings to evenly coat with the rub. Store in refrigerator up to one day\n(optional)\n.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. Add the wood chunk(s) on top of the grill, and once burning and producing smoke, place wings on the cool side of the grill, cover, and cook over medium-high heat until skin is browned and crisp, about 30 minutes. Brush wings all over with sauce, cover, and let cook until sauce caramelizes, about 5 minutes. Brush with sauce again and move wings to the hot side of the grill. Cook until slightly charred, about 2 to 3 minutes. Remove wings to a platter and serve immediately.\nSpecial Equipment\nGrill\nGrilled Chicken\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/grilled-habanero-barbecue-wings-recipe.webp?"
}