{
  "url": "https://www.seriouseats.com/hacker-free-neapolitan-pizza-for-a-home-kitchen-recipe",
  "image_url": "https://www.seriouseats.com/thmb/L7ykDu8PFJlKWMhFTmHJ7CvJ4LY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100909-pizzology-neapolitan-pizza-primary-efe3deb0f12245049582325adbe6896d.jpg",
  "tags": [
    "Mains By Type",
    "Italian"
  ],
  "title": "Hacker-Free Neapolitan Pizza for a Home Kitchen Recipe",
  "full_text": "Hacker-Free Neapolitan Pizza for a Home Kitchen Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n45 mins\nChilling and Rising Time\n10 hrs 10 mins\nTotal\n11 hrs 25 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n20\nounces\n(\n4\ncups\n) Italian tipo\n\"00\" flour\n(see notes), plus extra for dusting dough\n0.3\nounces\n(about\n2 1/4\nteaspoons\n)\nkosher salt\n, plus extra for assembly\n0.2\nounces\n(about\n1\nteaspoon\n)\ninstant yeast\n, such as SAF Instant Yeast\n0.2\nounces\n(about\n2\nteaspoons\n)\nsugar\n12\nounces\nwater\n1\n(\n14-ounce) can\nwhole peeled Italian tomatoes\n12\nounces\nbuffalo mozzarella\nor fresh cow's milk mozzarella\n6\ntablespoons\nextra-virgin olive oil\n24\nbasil\nleaves\nDirections\nCombine flour, salt, yeast, and sugar in the bowl of a stand mixer fitted with a dough hook attachment. Whisk to combine. Add water and knead on low speed until mixture just comes together and no dry flour remains. Rest for 10 minutes.\nKnead on low speed for an additional 10 minutes. The mixture should come together into a cohesive mass that barely sticks to the bottom of the bowl as it kneads. Depending on the type of flour used, you may need to add up to 1/2 cup additional flour. If dough sticks heavily to bottom of bowl, add flour 1 tablespoon at a time with mixer running until it forms a mass that just barely sticks to the bowl. Cover bowl tightly with plastic or transfer the dough to 2 gallon-sized zipper lock bags, seal, and refrigerate for at least 8 hours and up to 72 hours.\nTransfer dough to a floured work surface and dust top with additional flour. Using a bench scraper, divide dough into 6 even pieces, approximately 6 ounces each. Using floured hands, shape each piece into a neat ball by gathering dough towards the bottom. Coat 6 small containers with nonstick cooking spray or olive oil (large cereal bowls work great for this) and add 1 dough ball to each bowl. Lightly spray top of dough ball with nonstick cooking spray. Cover tightly with plastic wrap, and allow to rise at room temperature for 2 hours (dough should roughly double in volume).\nMeanwhile, drain tomatoes in a fine-mesh strainer and break up with your fingers, squeezing excess juice out from the interior. Transfer tomatoes to a blender with 1/2 teaspoon of kosher salt and blend until smooth. Transfer to a bowl and set aside. Cut mozzarella into 1/2-inch chunks and place on a plate on a triple layer of paper towels or a clean kitchen towel. Place another triple layer of paper towels or clean dish towel on top of the cheese and stack another plate on top. Allow the excess water to drain out for at least 10 minutes.\nTransfer 1 ball of dough to a medium bowl filled with flour and flip to coat. Lift it and gently pat off excess flour. Transfer to a floured surface and gently stretch into a 10-inch circle, leaving the outer 1-inch edge slightly thicker than the center.\nThe best way to do this is to start by gently stretching with your fingertips. Pick up the slightly stretched dough and place it on the opened face of your left hand. Toss it back and forth between your opened hands, rotating it slightly with each toss until it stretches out to around 8-inches in diameter. Return it to the work surface. With your left hand flat in the center of the round, use your right hand to stretch the edge of the dough out, rotating as needed until it is an even 10-inches in diameter.\nHave your tomato sauce, drained cheese, pizza dough, olive oil, kosher salt, and basil leaves ready and close to the stovetop. Preheat broiler to high and arrange rack so you can just barely fit a 12-inch heavy-bottomed oven-proof cast iron or stainless steel skillet on top of it. Dust skillet with flour, tap out excess, then heat skillet over high heat until lightly smoking, about 3 minutes.\nTransfer 1 dough round to the skillet. It should fill up the entire bottom surface. Working quickly, spread 2 tablespoons sauce evenly over dough, leaving the outer 1-inch border un-sauced. Top with 1/6 of the cheese chunks. Season with kosher salt. Drizzle with 1 tablespoon olive oil, and scatter 4 basil leaves over the surface.\nTransfer skillet to broiler and broil until pizza is puffed and charred in spots (this can take anywhere between 1 1/2 to 4 minutes, depending on the strength of your broiler). Return skillet to stovetop and cook until bottom is charred in spots, using a thin metal spatula to peek after about 1 minute (depending on the skillet you use, you may skip this step if pizza is already charred). Transfer the pizza to a cutting board and serve immediately. Repeat steps 4 and 5 to bake remaining pizzas.\nSpecial Equipment\nStand mixer\nwith dough hook,\nfine-mesh strainer\n,\nblender\n, 12-inch\ncast iron\nor\nstainless steel skillet\nNotes\nAntimo Caputo Tipo \"00\" Italian bread flour (in the red and white bag with the name ‘Cuoco’ on the front) helps improve the dough texture, but is not necessary. Regular bread flour, or even all-purpose flour, will work just fine.\nRead More\nThe Pizza Lab: On Flour Types, Foams, and Dough\nMains By Type\nItalian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/hacker-free-neapolitan-pizza-for-a-home-kitchen-recipe.webp?"
}