{
  "url": "https://www.seriouseats.com/hainanese-chicken-rice-set-recipe",
  "image_url": "https://www.seriouseats.com/thmb/OVPH7U5DQfboRHeAJ-8VH4DBGBQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/hainanese-chicken-rice-set-recipe-hero-Fred-Hardy-d04b51b0338144dc8549c89802b721e4.JPG",
  "tags": [
    "Chicken Mains",
    "Chinese",
    "Stovetop Chicken",
    "Whole Chicken",
    "Rice & Grains"
  ],
  "title": "Hainanese Chicken Rice Set",
  "full_text": "Hainanese Chicken Rice Set\nClose\nJump to recipe\nPrep\n35 mins\nCook\n105 mins\nActive\n45 mins\nCooling Time:\n15 mins\nTotal\n2 hrs 35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n1\nsmall\nwhole chicken\n(\n3 to 3 1/2\npounds\n;\n1.3 to 1.6\nkg\n), giblets removed\n2\ntablespoons\n(\n18\ng\n)\nDiamond Crystal kosher salt\n(for\ntable salt\n, use half as much by volume or the same weight), plus more to taste\n1/8\nteaspoon\nfreshly ground\nwhite pepper\n2\ntablespoons\n(\n30\nml\n)\nrice wine,\nsuch as\nShaoxing\n2\ntablespoons\n(\n30\nml\n)\nsoy sauce\nOne\n3-inch knob\nginger\n, peeled and sliced (\n3\ntablespoons\n;\n40\ng\n)\n3\nmedium\nscallions\n(\n2.5\nounces\n;\n71\ng\n), trimmed and halved\n2\npandan\nleaves\n, tied into knots, optional (see notes)\n1\ntablespoon\n(\n15\nml\n) toasted\nsesame oil\nFor the Rice:\n1\ntablespoon\nminced\ngarlic\n(\n20\ng\n; from\n3\ncloves\n)\n1\ntablespoon\nminced fresh peeled\nginger\n(\n15\ng\n; from a\n1\n1/2–inch piece\n)\n2\ncups\nlong grain white rice\n(\n12 1/2\nounces\n;\n355\ng\n), rinsed well\nFor the Bok Choy:\n3\ntablespoons\n(\n45\nml\n)\nvegetable oil\n2\nmedium\nshallots\n(\n2 1/4\nounces\n;\n64\ng\ntotal), peeled and sliced into 1/16-inch-thick rings (about\n1/2\ncup\n)\n8\nounces\n(\n227\ng\n)\nbaby bok choy\n(\n6\nsmall heads\n), washed, trimmed, and halved lengthwise\nFor Serving:\n1\nsmall\ncucumber\n(\n9\nounces\n;\n255\ng\n), sliced (\n2\ncups\n)\n1\nbunch\nfresh\ncilantro\n(\n4\nounces\n;\n113\ng\n), stems and leaves chopped (\n2\ncups\n)\nChile garlic sauce\nKecap manis\n(\nsweet soy sauce\n; see notes)\nDirections\nFor the Chicken:\nPat chicken dry and trim excess fat and skin from neck and tail areas; set fat and skin aside for rice. Sprinkle chicken with salt and vigorously rub and massage salt all over chicken to “exfoliate” skin. (Skin should look smooth and be free of any lumps, bumps, or imperfections. Take time to exfoliate it well; the better scrubbed the skin is, the better the final texture will be.) Sprinkle with white pepper.\nSerious Eats / Fred Hardy\nPlace chicken, breast-side up, in a large stockpot and add rice wine, soy sauce, ginger, scallions, and pandan leaves (if using). Cover chicken with water by about 1 inch, ensuring that chicken is fully submerged.\nSerious Eats / Fred Hardy\nHeat over medium-high heat and bring to a simmer. Cover and reduce heat to low to maintain a bare simmer and poach chicken until breast registers 155°F (68°C) and legs register 165°F (74°C) with an instant-read thermometer (avoiding bone), 25 to 30 minutes (the breast and leg pieces may reach their respective temperatures at different times; make sure to remove each as it is ready). Remove chicken from pot and immediately transfer to a large bowl of ice water. Soak chicken in ice bath until cool, about 10 minutes. Transfer chicken to a plate, gently pat dry, and rub sesame oil all over chicken. Set aside until serving.\nSerious Eats / Fred Hardy\nStrain broth, discarding solids. Return broth to pot and bring to a boil over medium-high heat. Boil until reduced to approximately 9 cups (do not skim fat). Season to taste and let cool 15 minutes to allow fat to rise to surface.\nSerious Eats / Fred Hardy\nFor the Rice:\nIn a small saucepan, cook reserved chicken fat and skin trimmings over medium heat, stirring often, until fat begins to render and surface of saucepan is coated in melted fat. Add garlic and ginger and cook, stirring constantly, until fragrant and lightly golden, 1 to 2 minutes. Stir in rice until coated in fat, then remove from heat. Transfer rice mixture to a rice cooker and cover with 3 cups broth (using as much fat as possible from broth). Cook rice according to manufacturer’s directions.\nSerious Eats / Fred Hardy\nFor the Bok Choy:\nIn a small saucepan, heat oil and shallots over medium heat, stirring, until deep golden brown, about 10 minutes. Using a slotted spoon, transfer shallots to a small bowl lined with a paper towel.\nSerious Eats / Fred Hardy\nIn a large skillet with a lid, bring 3/4 cup broth to a simmer over medium-high heat. Add bok choy and cover. Cook until just tender but still bright green, 2 to 3  minutes. Transfer to a serving dish and sprinkle with fried shallots.\nSerious Eats / Fred Hardy\nTo Serve:\nReheat remaining broth and ladle into bowls. Carve chicken off bones and slice thinly (you can leave the bone in the drumstick, if desired). Arrange chicken on a plate, spooning a small amount of broth over top. Serve with rice, bok choy, sliced cucumber, cilantro, chile sauce, and kecap manis.\nSerious Eats / Fred Hardy\nSpecial Equipment\nRice cooker\n,\ninstant-read thermometer\nNotes\nPandan leaf\nis used in Southeast Asian cooking. It may be found in your local Asian market. Pandan adds subtle flavor but is not integral. Do not substitute pandan flavoring.\nKecap manis\nis a thick, sweet soy sauce.\nDark soy sauce\n, which is not as sweet, can be substituted.\nChicken Mains\nChinese\nStovetop Chicken\nWhole Chicken\nRice & Grains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/hainanese-chicken-rice-set.webp?"
}