{
  "url": "https://www.seriouseats.com/halloween-witch-finger-cookies-recipe-8731480",
  "image_url": "https://www.seriouseats.com/thmb/3B2RaKZJEApowunurKgTcrqdMUU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241023-WitchFingerCookies-AmandaSuarez-hero-8dee8d3a5009413d82377c2d95d4f914.jpg",
  "tags": [
    "Cookies",
    "Desserts",
    "Fall Desserts"
  ],
  "title": "Witch Finger Cookies",
  "full_text": "Witch Finger Cookies\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nChilling and Cooling Time\n2 hrs\nTotal\n2 hrs 40 mins\nMakes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1 recipe\nclassic butter shortbread cookie dough\n, uncooked (through step 1)\n6 tablespoons (90ml) raspberry jam\n24 sliced almonds\nDirections\nDivide dough into 2 equal balls. Working with 1 dough ball at a time, on a piece of parchment paper, use a rolling pin to roll each portion out until 1/4-inch thick, keeping a roughly rectangular shape. Place dough and parchment paper on a rimmed baking sheet and cover with plastic wrap. Repeat rolling second dough ball and transfer to a second rimmed baking sheet. Refrigerate until dough is firm, for at least 1 hour or up to 1 day.\nSerious Eats / Amanda Suarez\nRemove one portion of dough from refrigerator. Slice dough into 1-inch thick strips and lift sides to form a trough along the length of the strip.\nSerious Eats / Amanda Suarez\nWorking quickly, take a heaping teaspoon of jam and spread it along the length of the dough and carefully pinch dough closed over and encasing the jam filling to form a long, thin cylinder roughly 10 - 12 inches long. Repeat for remaining strips. Make sure the tube is completely sealed along the seam. If dough begins to feel soft and mushy, return the baking sheet and refrigerate until firm again, about 20 minutes before resuming.\nSerious Eats / Amanda Suarez\nCarefully slice each prepared tube in half. Pinch one end shut of each finger cookie, dab it with jam, and press on an almond sliver \"nail.\" Squeeze the sides to create a bulged \"knuckle\" area and, using the dull edge of your knife or a spoon, press into both the knuckle and the area below the nail several times to create a wrinkled appearance. Add a spoonful of jam over the base of each finger and return the baking sheet to the refrigerator for at least 20 minutes or up to 1 hour. Repeat steps 2 through 4 with remaining baking sheet of rolled-out dough.\nWhile cookies chill, adjust oven racks to upper and lower-middle positions and preheat oven to 300°F (150°C). Bake both baking sheets until the cookies are lightly golden-brown, rotating top to bottom and back to front halfway through cooking, 15 to 20 minutes total. Let cool for 20 minutes before serving.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheets\nNotes\nIt's important to keep the dough cold throughout the process. When it starts to feel soft, you can pop it back in the fridge and work on the other batch.\nRead More\nVampire Mouth Marshmallow Sandwich Cookies\nCookies\nDesserts\nFall Desserts"
}