{
  "url": "https://www.seriouseats.com/halloween-spider-chocolate-mini-cheesecakes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/WZDuvEb6GwQg6u8RiTKTBUmN8nM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__10__20121023-127677-Chocolate-Mini-Cheesecakes-PRIMARY-e577519e07ae4d3fbaad4521684b86df.jpg",
  "tags": [
    "Desserts",
    "Cheesecakes",
    "Chocolate",
    "Halloween"
  ],
  "title": "Chocolate Mini Cheesecakes Recipe",
  "full_text": "Chocolate Mini Cheesecakes Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n35 mins\nActive\n60 mins\nChilling Time\n85 mins\nTotal\n2 hrs 35 mins\nMakes\n12 mini-cheesecakes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n3/4\ncup\ncrumbled vanilla wafers\n(about\n30\nwafers\n)\n3\ntablespoons\nunsalted butter\n2\ntablespoons\ngranulated sugar\n1/8\nteaspoon\nsalt\nFor the Cheesecake Filling:\n1\n(\n8\n-\nounce\n)\npackage\ncream cheese\n1/4\ncup\n(about\n1 3/4\nounces\n)\ngranulated sugar\n1/4\ncup\nsour cream\n2\nlarge\neggs\n1/2\nteaspoon\npure vanilla extract\n1/4\nteaspoon\nsalt\n3\nounces\nbittersweet chocolate\n, melted and slightly cooled (see note)\nFor the Glazes:\n1/3\ncup\nplus\n1\ntablespoon\nheavy cream\n2\nounces\nbittersweet chocolate\n, finely chopped\n1\ntablespoon\ncorn syrup\n3\nounces\nwhite chocolate\n, finely chopped\nDirections\nFor the Crust:\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Line muffin tin with paper liners. In food processor, pulse wafers until they turn into fine crumbs. Add butter, sugar, and salt and pulse just to combine. Use fingertips or a 1/4-cup measure to press 1 tablespoon cookie mixture into bottom of each cup. Bake just until set, 5 to 7 minutes. Transfer tin to cooling rack. Decrease oven temperature to 300°F (150°C).\nFor the Cheesecake Filling:\nIn a stand mixer fitted with the whisk attachment, beat cream cheese and sugar on medium-high speed until light and fluffy, about 2 minutes. Beat in sour cream, then eggs, 1 at a time, beating well after each addition. Beat in vanilla and salt. Scrape bottom and sides of bowl with rubber spatula as needed. Decrease mixer speed to low and add chocolate. Beat until well combined, about 2 minutes.\nDivide batter equally among muffin cups (see note) and bake until set, about 20 minutes. Transfer to cooling rack and cool to room temperature, about 10 minutes, then refrigerate until chilled, about 1 hour.\nFor the Glazes:\nBring 1/3 cup cream to simmer in small saucepan over medium heat or in bowl in microwave. Place bittersweet chocolate and corn syrup in small bowl. Pour cream over chocolate and stir until smooth. Spoon glaze over cupcakes, smoothing with back of spoon. Refrigerate until set, about 15 minutes.\nCombine remaining 1 tablespoon cream and white chocolate in small bowl and microwave 30 to 60 seconds, pausing microwave every 20 seconds to stir, until smooth and melted. Fill a pastry bag fitted with a small tip with white chocolate and create spiral pattern over chocolate. Drag a toothpick, starting at the middle, to the edges of the cupcake to make a spider web pattern. Serve.\nSpecial equipment\n12-cup standard muffin tin, 12 cupcake liners, food processor, cooling rack, electric mixer, rubber spatula, pastry bag or zipper-lock bag, small pastry tip\nNotes\nTo melt chocolate: Place chocolate in small bowl and microwave until smooth and melted, 1 to 2 minutes, stopping microwave to stir chocolate every 30 seconds.\nUsing a liquid measuring cup makes easy and neat work of filling the cupcake tins.\nThis Recipe Appears In\n23 Halloween Treats: Spooky, Scary, Savory, and Sweet\nDesserts\nCheesecakes\nChocolate\nHalloween"
}