{
  "url": "https://www.seriouseats.com/halloween-ramen-seafood-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/glPAFbPp80hdtrbX7oeoF6OtMbw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__10__20141023-halloween-ramen-vicky-wasik-3-4096c9624052409d967e63f12b7defc5.jpg",
  "tags": [
    "Ramen",
    "Mussels",
    "Japanese",
    "Dairy-free Mains",
    "Noodle Mains"
  ],
  "title": "Seafood Ramen With Squid Ink, Mussels, and Salmon Roe Recipe",
  "full_text": "Seafood Ramen With Squid Ink, Mussels, and Salmon Roe Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\n45 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4 1/2\nquarts\n(\n4.3\nL\n)\nhomemade\nchicken stock\nor store-bought\nlow-sodium\nbroth\n4\npackets\nunflavored gelatin\n(\n1\nounce\n;\n28\ng\n), optional (see note)\n2\nteaspoons\n(\n10\nml\n)\nsquid ink\n(see note)\n6\ntablespoons\n(\n90\nml\n) vegetable,\ncanola\n, or other neutral\noil\n, divided\n1/2\npound\n(\n225\ng\n)\nsquid bodies\n, split open lengthwise and sliced lengthwise into thin strips\nKosher salt\n1\npound\n(\n450\ng\n)\ncremini mushrooms\n, stems removed, caps thinly sliced\n2\npounds\n(\n900\ng\n)\nmussels\n, washed, beards removed\n2\ntablespoons\n(\n30\ng\n)\nmiso\n4\ntablespoons\n(\n72\ng\n)\nbaking soda\n4\nquarts\n(\n3.8\nL\n) boiling\nwater\n1\npound\n(about\n450\ng\n)\ndried squid-ink spaghetti\n2\nounces\n(\n55\ng\n)\nsalmon roe\nMicro greens,\narugula\n, or other tender leafy green\nSheets of nori\n, for serving (see note)\n1\nrecipe\nblack garlic oil\nDirections\nIf using store-bought chicken broth or homemade broth that doesn't gel when chilled, add broth to a large mixing bowl and sprinkle gelatin all over; let stand 10 minutes. Transfer broth to a large pot or Dutch oven and bring to a simmer over high heat, then reduce heat to low. Stir in squid ink until fully dissolved. Cover and keep warm.\nMeanwhile, heat 2 tablespoons (30ml) oil in a large skillet over high heat until lightly smoking. Season squid with salt, add to skillet, and cook, stirring occasionally, until just cooked through and browned in spots, 3 to 4 minutes. Transfer squid to a plate and keep warm. Add remaining 4 tablespoons (60ml) oil to skillet, heat until shimmering over medium-high heat, and add mushrooms. Cook, stirring occasionally, until well browned. Season with salt and transfer to a plate; keep warm.\nReturn broth to a simmer, add mussels, and cook until opened, about 5 minutes. Stir in miso and season broth with salt.\nWhile mussels are cooking, dissolve baking soda in the 4 quarts (3.8L) boiling water and season with salt. Boil spaghetti until just al dente. Drain.\nTransfer spaghetti to bowls. Ladle broth on top. Garnish with mussels, squid, mushrooms, salmon roe (spoon roe into an empty mussel-shell half for best presentation), micro greens, and nori. Drizzle black garlic oil on top and serve.\nSpecial Equipment\nLarge mixing bowl,\nlarge pot\nor\nDutch oven\n,\nlarge skillet\nNotes\nUse the gelatin only if using store-bought stock or if your homemade stock remains watery even when chilled; homemade stock that's naturally high in gelatin, which sets when it's chilled, does not need additional gelatin.\nSquid ink is available from good fishmongers and specialty food stores.\nFor Halloween, feel free to have fun with the nori by cutting it with scissors into a bat shape, or skip the special shapes and just garnish each bowl with a small sheet of nori.\nRamen\nMussels\nJapanese\nDairy-free Mains\nNoodle Mains"
}