{
  "url": "https://www.seriouseats.com/halo-halo-5195652",
  "image_url": null,
  "tags": [
    "Filipino",
    "Desserts",
    "The Latest"
  ],
  "title": "Halo-Halo (Filipino Shaved Ice Dessert)",
  "full_text": "Halo-Halo (Filipino Shaved Ice Dessert)\nJump to recipe\nPrep\n10 mins\nCook\n100 mins\nChilling Time\n4 hrs\nTotal\n5 hrs 50 mins\nServes\n1 serving\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Saba Bananas in Syrup (Minatamis na Saging):\n2\ncups\n(\n475\nml\n)\nwater\n5 1/2\nounces\ngranulated sugar\n(\n3/4\ncup\n;\n155\ng\n)\n2\nSaba bananas\n(\n225\ng\n), peeled, halved lengthwise, and cut into 1/2-inch thick slices on a bias (see note)\nFor the Jackfruit in Syrup (Minatamis na Langka):\n3/4\ncup\n(\n175\nml\n)\nwater\n2 3/4\nounces\ngranulated sugar\n(\n1/4\ncup\nplus\n2\ntablespoons\n;\n80\ng\n)\n4\nounces\n(\n115\ng\n) ripe\njackfruit\n, cut into 1/2-inch thick strips (see note)\nFor the Tapioca Pearls in Syrup (Sago):\n2\nquarts\n(\n1.9\nL\n)\nwater\n1\nounce\n(\n3\ntablespoons\n;\n30\ng\n) large white\ntapioca pearls\n6\nounces\n(\n3/4\ncup\n;\n170\ng\n)\ndark brown sugar\n1\nteaspoon\npandan extract\n(see note)\nFor Assembling the Halo-Halo:\nScant\n1\ncup\n(\n120\ng\n)\nice cubes\n1\nounce\nevaporated milk\n(\n2\ntablespoons\n;\n30\ng\n)\nOther add-ins\n, as desired\n1-inch square\nleche flan\n2-ounce\nscoop\nube ice cream\nDirections\nFor the Saba Bananas in Syrup (Minatamis na Saging):\nIn a 2-quart saucepan, combine water and sugar. Bring to a boil over high heat. Add bananas and lower heat to maintain a steady simmer. Cook until syrup has slightly reduced, about 20 minutes. Remove from heat, transfer to heatproof medium bowl (you should have about 2 1/2 cups; 650g), and let cool to room temperature, about 45 minutes. Cover and refrigerate until cold, about 2 hours. Clean saucepan.\nRezel Kealoha\nFor the Jackfruit in Syrup (Minatamis na Langka):\nIn now-clean saucepan, add water and sugar. Bring to a boil over high heat. Add jackfruit and lower heat to maintain a steady simmer. Cook until syrup has slightly reduced and thickened in consistency, about 8 minutes. Remove from heat and let cool to room temperature, about 30 minutes. Transfer to an airtight container (you should have about 1 cup; 285g) and refrigerate until cold, about 2 hours.\nRezel Kealoha\nFor the Tapioca Pearls in Syrup (Sago):\nIn a 4-quart saucepan, bring water to a boil over high heat. Add tapioca pearls and cook, stirring occasionally and scraping the bottom, until tapioca pearls have started to become translucent, about 30 minutes. Add sugar and continue to cook, stirring occasionally, until tapioca pearls are translucent and chewy, about 20 minutes. Strain mixture through a fine-mesh strainer set over a large heatproof bowl; return strained sugar-water mixture to saucepan. Rinse tapioca pearls under cold running water; set aside.\nRezel Kealoha\nBring sugar-water mixture in saucepan to a boil over high heat. Lower heat to maintain a simmer and cook until reduced by roughly half, about 15 minutes. Stir in pandan extract. Remove from heat and let cool to room temperature, about 45 minutes. Combine tapioca pearls and syrup in an airtight container (you should have about 3 cups; 725g total) and refrigerate until cold, about 2 hours.\nRezel Kealoha\nTo Assemble Halo-Halo:\nIn a blender or ice shaver, blend ice until small and fine in texture. In a tall, 12-ounce glass, add half of the ice, then add 2 tablespoons each of Saba bananas, jackfruit, and tapioca pearls, and other add-ins of your choice, except leche flan and ube ice cream, until glass is 3/4 full. Top with remaining ice, evaporated milk, leche flan, and ube ice cream. Serve immediately with a long handle spoon.\nRezel Kealoha\nSpecial Equipment\n2- and 4-quart saucepan, ice shaver or\nblender\n, 12-ounce tall glass\nNotes\nSaba bananas are endemic to the Philippines and are considered a cooking banana, although they can be eaten raw as well. Fresh or frozen Saba bananas can be found in Filipino and Asian markets. If using frozen Saba bananas, defrost in the refrigerator overnight. Fresh ripe plantains (\"maduros\") that are primarily black with spots of yellow can also be used as a substitute.\nJackfruit can be found fresh in Asian markets. The ripe fruit has internal orange “petals” that surround a large, brown, edible seed. When preparing jackfruit, make sure to oil your hands before handling the fruit, which secretes a sticky white sap when cut that can be tricky to wash off. The other option is to use gloves (I recommend oiling the gloves as well). If fresh jackfruit is unavailable, substitute with canned jackfruit in syrup, which can be found in Asian markets and online (using this would replace making the jackfruit in syrup in Step 2, just be sure to cut the jackfruit into 1/2-inch thick strips before adding to the halo-halo).\nPandan extract has a mild grassy vanilla flavor with hints of coconut. It is sold in many Asian supermarkets and online, as well.\nMake-ahead and Storage\nSaba bananas in syrup, jackfruit in syrup, and tapioca pearls in syrup can be prepared ahead of time and refrigerated in separate airtight containers for up to 3 weeks.\nFilipino\nDesserts\nThe Latest"
}