{
  "url": "https://www.seriouseats.com/halva-5197010",
  "image_url": "https://www.seriouseats.com/thmb/-U3m7i-y76_RLKkGHOMtpFlHXK8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210713-halva-vicky-wasik-seriouseats-18-bb977953987b462eb394741622b0d28c.jpg",
  "tags": [
    "Indian",
    "Custards, Mousses & Puddings",
    "Nuts & Seeds",
    "The Latest"
  ],
  "title": "Halva With Spice Dried Fruit and Nuts",
  "full_text": "Halva With Spice Dried Fruit and Nuts\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Halva:\n20\nstrands\nsaffron\n1/2\nteaspoon\nfreshly\nground black pepper\n1/4\nteaspoon\nground\ngreen cardamom\n1\ncup\n(\n160\ng\n)\nsemolina\n, preferably coarse grade\n2\ntablespoons\n(\n30\ng\n)\nghee\n(see note)\n3\ncups\n(\n710\nml\n) boiling\nwater\n1/2\ncup\n(\n100\ng\n)\ngranulated sugar\n1/2\nteaspoon\nrose water\n(optional)\nFor the Garnish:\n2\ntablespoons\n(\n30\ng\n)\nghee\n(see note)\n6\nwhole\ndried apricots\n(about\n50\ng\ntotal), chopped\n1/4\ncup\n(\n40\ng\n)\nraisins\n1/4\ncup\n(\n45\ng\n) dried sweet and\ntart cherries\n2\ntablespoons\n(\n25\ng\n) raw shelled blanched\nchopped pistachios\n2\ntablespoons\n(\n20\ng\n) raw sliced or\nslivered almonds\n2\ntablespoons\n(\n25\ng\n) raw blanched whole\ncashews\nDirections\nFor the Halva:\nIn a small bowl, stir together saffron, pepper, and cardamom; set aside. Place semolina in a medium saucepan, and toast over medium-low heat, stirring occasionally with a wooden spoon or silicone spatula to prevent burning, until the semolina smells nutty and turns light brown, about 10 minutes.\nSerious Eats / Vicky Wasik\nAdd ghee, and stir to evenly coat semolina. Add half of the spice mixture, and cook until fragrant, about 30 seconds; reserve the remaining spice mixture for the garnish. Remove from heat.\nSerious Eats / Vicky Wasik\nStirring constantly with a rubber spatula, slowly and carefully add the boiling water to semolina mixture (it will sizzle and sputter), until water is fully incorporated and mixture is smooth without any lumps. Add sugar and stir until thoroughly incorporated.\nSerious Eats / Vicky Wasik\nReturn saucepan to medium-low heat and cook, stirring frequently, until liquid has been absorbed and semolina mixture thickens and starts to leave the sides of the saucepan, 30 seconds to 1 minute for fine semolina and 3 to 4 minutes for coarse semolina. Remove from heat, stir in rosewater (if using), cover, and set aside.\nSerious Eats / Vicky Wasik\nFor the Garnish:\nIn a small saucepan, melt ghee over medium-low heat. Add remaining reserved spice mixture along with apricots, raisins, cherries, pistachios, almonds, and cashews. Cook, stirring frequently, until mixture is aromatic and nuts are lightly toasted, about 2 minutes.\nSerious Eats / Vicky Wasik\nAdd half of the hot fruit and nut mixture to the semolina, and using a rubber spatula, gently stir to combine. Transfer to a serving dish, top with remaining fruit and nut mixture, and serve.\nSerious Eats / Vicky Wasik\nNotes\nIf you don't have ghee, you can use\nclarified butter\n.\nMake Ahead and Storage\nHalva tastes best the day it's made, but it can be made 2 to 3 days ahead of time. To rewarm the halva just before serving, add 2 to 3 tablespoons of water to the halva and heat it in a covered saucepan held over medium heat.\nIndian\nCustards, Mousses & Puddings\nNuts & Seeds\nThe Latest"
}