{
  "url": "https://www.seriouseats.com/halva-ye-haveej-persian-carrot-halva-recipe-8619833",
  "image_url": "https://www.seriouseats.com/thmb/dTlmmDGzPVR1qz6NqBZHAg0ggC0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240325-SEA-CarrotHalva-NaderMehravari30-1ba4eba6e438484796c8c7fad88e934c.jpg",
  "tags": [
    "Iranian & Persian",
    "Desserts",
    "Ramadan"
  ],
  "title": "Halva-ye-Haveej (Persian Carrot Halva)",
  "full_text": "Halva-ye-Haveej (Persian Carrot Halva)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nTotal\n65 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\ncarrots,\nwashed, peeled, trimmed, and cut crosswise into 2-inch (5cm) segments\n1\ncup\ngranulated sugar\n(\n7\nounces\n;\n200\ng\n)\n1/2\ncup\n(\n120\nml\n)\nrose water\n1/2\nteaspoon\nground cardamom\nor\ncardamom seeds\n, finely ground (see notes)\n3/4\ncup\n(97.5\ng\n)\nall-purpose flour\n1/2\ncup\n(\n114\ng\n)\nbutter\nor\nvegetable shortening\n1\ngenerous\npinch\nof\nsaffron\n, ground and steeped in\n1\ntablespoon\nhot water\n1\nteaspoon\nof chopped or slivered\nraw pistachios\n, for garnishing (optional)\nDirections\nIn a medium saucepan, cover the carrots with 1/2 inch of cold water (about 3 cups of water). Bring to a boil over medium-high heat, then reduce heat to maintain a rapid simmer, and cook until the carrots are tender, about 10 minutes. Drain the carrots and set aside.\nSerious Eats / Nader Mehravari\nIn a food processor, process cooked carrots, sugar, rose water, and cardamom until smooth, about 1 minute.\nSerious Eats / Nader Mehravari\nScrape the processed mixture back into the saucepan. Cook over medium heat, stirring constantly, until the mixture is hot but not boiling (between 170 and 180°F), about 5 minutes; set aside.\nSerious Eats / Nader Mehravari\nIn a 10- to 12-inch skillet, add the flour, shaking the skillet to make sure the flour is in an even layer. Toast the flour over medium heat, stirring constantly, just until it smells well toasted but it still remains its natural white color, 10 minutes. If the flour does begin to brown, remove the skillet from the heat for 30 seconds while still stirring the flour. (The temperature of the flour should not go above 180°F (see notes).\nSerious Eats / Nader Mehravari\nTransfer the toasted flour from the skillet into a bowl. Using a sifter or a fine mesh strainer, sift the toasted flour back into the same skillet that was used to toast the flour.\nSerious Eats / Nader Mehravari\nAdd butter to toasted flour and cook over medium heat, stirring constantly, until the butter is melted. Once butter is melted, continue cooking the flour and butter mixture while stirring constantly until it forms a uniform paste, about 5 minutes.\nSerious Eats / Nader Mehravari\nAdd the reserved carrot mixture to the skillet and continue to cook over medium heat, stirring constantly for 10 minutes.\nSerious Eats / Nader Mehravari\nAdd the steeped saffron-water mixture and continue to cook, stirring constantly, until the mixture becomes a uniform and cohesive playdough-like consistency that holds together in one piece while stirring over medium heat.\nSerious Eats / Nader Mehravari\nTurn off heat. Using pot holders,\nif the skillet has 2 handles\n, hold both handles and\nif the skillet has 1 handle\n, then hold one hand on the handle and the other hand (with a pot-holder) on the rim of the skillet opposite the handle side. Pick up the saucepan and hold it about 1 inch (2 cm) above the burner. Use a two-handed rocking motion to create an up-and-down/side-to-side motion with the saucepan—the right hand goes up while the left hand goes down, then the left hand goes up while the right hand goes down; repeat for about 10 cycles. The cooked halva should roll back and forth over itself to form a smooth, oily, shiny, elastic log that leaves a thin oily film on the inside of the skillet.\nSerious Eats / Nader Mehravari\nFor family style serving, transfer the cooked halva onto a platter, using an offset spatula or back of a large spoon to spread it out to a circle that is about 1/2 to 3/4 inches (1 to 1 1/2 cm). Use the back or tip of a spoon or the tip of a paring knife to gently press into the halva to indent and create an attractive pattern over the surface. Alternatively you can shape it by hand by pinching the edges of the halva between your thumb and index finger to create your preferred pattern. Sprinkle pistachios in desired pattern on top. Alternatively, divide halva among individual serving dishes to decorate. Serve warm or at room temperature.\nSerious Eats / Nader Mehravari\nSerious Eats / Nader Mehravari\nSpecial Equipment\nMedium saucepan, food processor, fine-mesh strainer, 10- to 12-inch stainless-steel skillet\nMake-Ahead and Storage\nCarrots can be cooked ahead of time and refrigerated in an airtight container for up to 2 days.\nThe cooked carrot halva can be covered with plastic wrap or stored in an airtight container at room temperature for up to 3 days.\nIranian & Persian\nDesserts\nRamadan"
}