{
  "url": "https://www.seriouseats.com/ham-and-bean-soup-recipe-5221025",
  "image_url": "https://www.seriouseats.com/thmb/eTNyBUPC2xNmYLtfOK_Lhh4tN9w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220215-Ham-and-Bean-Soup-Liz-Voltz-Hero-Horz-2-47668a2f054d4efc9041c36ad7e77359.jpg",
  "tags": [
    "Ham",
    "The Latest",
    "Navy Beans"
  ],
  "title": "Ham and Bean Soup",
  "full_text": "Ham and Bean Soup\nClose\nJump to recipe\nPrep\n15 mins\nCook\n3 hrs 45 mins\nSoaking Time\n60 mins\nTotal\n5 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n454\ng\n)\ndried navy beans\n5 1/2\nquarts\n(5.2L)\nwater\n, divided\n2\ntablespoons\n(30ml)\nextra-virgin olive oil\n1 large\nyellow onion\n(\n12\nounces\n; 340g), roughly chopped (3 cups)\n2 medium\ncarrots\n(\n6\nounces\n; 170g), peeled and roughly chopped (1 cup)\n2\ncelery ribs\n(\n5 1/2\nounces\n; 155g), roughly chopped (1 1/4 cups)\n2\nmedium\ngarlic\ncloves\n, roughly chopped\n2\nsprigs\nfresh thyme\n2\nsprigs\nflat-leaf parsley\n, plus finely chopped parsley leaves and tender stems for garnish\n1\nbay leaf\n2 1/2\npounds\n(1.1kg)\nsmoked ham hocks\n(about 2 to 3 large hocks)\n2\ncups\n(473ml) low-sodium\nchicken stock\n(or substitute with water)\nKosher salt\nFreshly ground black pepper\nDirections\nIn a 4-quart saucier, combine beans and 3 quarts (2.8L) salted water. Bring to a boil over high heat. Remove from heat, cover, and let soak for 1 hour. Drain and rinse beans; set aside.\nSerious Eats / Liz Voltz\nMeanwhile, in a large Dutch oven, heat oil over medium heat until shimmering. Add onion, carrots, and celery, and cook, stirring occasionally, until softened, about 10 minutes. Add garlic and cook, stirring frequently, until fragrant, about 60 seconds. Transfer vegetables to a small heatproof bowl; set aside.\nSerious Eats / Liz Voltz\nIn the same Dutch oven, add remaining 2 1/2 quarts (1.9L) water, along with thyme, parsley, bay leaf, and ham hocks. Bring to a boil over high heat, then lower heat to maintain a gentle simmer. Cover and cook until ham hocks are tender, about 1 hour.\nSerious Eats / Liz Voltz\nStir in beans and bring to a simmer over medium high heat.  Reduce to medium-low and cook, covered, until beans are completely tender and meat is falling off the bones, about 2 hours, stirring halfway through. Discard thyme, parsley, and bay leaf. Using tongs, transfer ham hocks to a cutting board and set aside until cool enough to handle, about 20 minutes. Using a slotted spoon, transfer 2 1/2 cups beans to a medium heatproof bowl; set aside.\nSerious Eats / Liz Voltz\nOnce ham hocks are cool, roughly chop meat using a sharp knife; discard skin, bones, and fat. Set aside.\nSerious Eats / Liz Voltz\nUsing an immersion blender, blend soup until smooth (if using a countertop blender, blend in batches, if necessary, and start blending at low speed before increasing to high, then return puréed soup to the pot). Add reserved beans, meat, vegetables back to pot, stirring to combine. Stir in 1 to 2 cups of stock or water to reach desired consistency. Return to a gentle simmer over medium-low heat, then cook, stirring occasionally, until vegetables are tender and ham is heated through, about 20 minutes. Season to taste with salt and pepper.\nSerious Eats / Liz Voltz\nDivide soup among warmed bowls, sprinkle with parsley and pepper, and serve.\nSerious Eats / Liz Voltz\nSpecial Equipment\n4-quart saucier\n,\nlarge Dutch oven\n,\nimmersion blender\nor\ncountertop blender\nMake-Ahead and Storage\nThe soup can be refrigerated in an airtight container for up to 5 days or frozen for up to 3 months.  The soup will thicken after being refrigerated. If reheating, thin as needed with water to achieve desired consistency.\nHam\nThe Latest\nNavy Beans"
}