{
  "url": "https://www.seriouseats.com/ham-balls-recipe-8741383",
  "image_url": "https://www.seriouseats.com/thmb/6rceeSAxSTU7pTOfiy4Qh4fOOQI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240426-Iowa-Ham-Balls-Qi-Ai-hero-plated_1-9ed1f58f056d443b96565aae22fe80a4.jpg",
  "tags": [
    "Ham",
    "Pork",
    "Meatballs"
  ],
  "title": "Iowa Ham Balls",
  "full_text": "Iowa Ham Balls\nClose\nJump to recipe\nPrep\n20 mins\nCook\n55 mins\nTotal\n75 mins\nServes\n4\nto 6\nMakes\n16 ham balls\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Glaze:\nFor the Glaze:\nOne\n10\n-\nounce\ncan\ncondensed tomato soup\n1/2\ncup\nlight brown sugar\n(3.75 ounces; 106g)\n1/4\ncup\n(60ml)\npineapple juice\n1/4\ncup\n(60ml)\napple cider vinegar\n1\ntablespoon (15ml)\nbrown mustard\nFor the Ham Balls:\n1\npound\nham steak\n, or any thick-cut, wet-cured ham, cubed into approximately 3/4 -inch pieces\n1\ncup\nfinely crushed\ncracker\ncrumbs, from about 24 buttery crackers, such as Ritz (100g)\n1/2\nteaspoon\nground dried\nginger\n1/2\nteaspoon\nground\nwhite pepper\n1/4\nteaspoon\nground clove\n1/2\ncup (120ml)\nbuttermilk\n2\nlarge\neggs\n1\ntablespoon less-sodium\nsoy sauce\n1\npound\nground pork, lean if possible\nDirections\nFor the glaze:\nAdjust oven rack to middle position and preheat oven to 350℉ (175℃). In a small saucepan, combine all glaze ingredients and bring to a simmer over medium-high heat. Simmer, whisking frequently until sugar dissolves, then remove from heat and set aside.\nSerious Eats / Qi Ai\nFor the ham balls:\nIn a food processor, pulse the ham until finely ground, about 25 pulses; set aside.\nSerious Eats / Qi Ai\nIn a large bowl, mix cracker crumbs, ginger, white pepper, and clove until well combined. Add buttermilk and stir to combine. Let sit until crumbs are softened and hydrated, about 5 minutes. Stir in ground ham to combine.\nSerious Eats / Qi Ai\nIn a small bowl, beat eggs and soy sauce together, then add to the ham mixture and use your hands to combine. Add pork and mix gently, until fully incorporated. Divide meat mixture into 16 ham balls by rolling each meat portion between your wet hands to form balls, rewetting hands as needed. Nestle prepared ham balls into an oven-proof nonstick or lightly greased 9-by-9-inch baking dish or pan.\nSerious Eats / Qi Ai\nPour the glaze evenly over the balls, being sure to coat each one. Bake until the glaze is reduced and lightly caramelized and ham balls are cooked through, tender, and register at least 160°F (70°C) on an instant-read thermometer, 40 to 50 minutes. Spoon the ham balls onto plates to serve, topping with extra glaze.\nSerious Eats / Qi Ai\nSpecial Equipment\nSmall saucepan, food processor, 9-by-9-inch baking dish or pan\nMake-Ahead and Storage\nThe assembled glaze and the raw shaped ham balls can be refrigerated separately for up to 3 days before continuing with step 5 to finish cooking.\nThe fully cooked ham balls can be refrigerated in an airtight container for up to 4 days.\nHam\nPork\nMeatballs"
}