{
  "url": "https://www.seriouseats.com/hand-pulled-lamian-noodles",
  "image_url": null,
  "tags": [
    "Noodles",
    "Chinese",
    "Noodle Mains",
    "East Asian"
  ],
  "title": "Hand-Pulled Lamian Noodles Recipe",
  "full_text": "Hand-Pulled Lamian Noodles Recipe\nJump to recipe\nPrep\n55 mins\nCook\n5 mins\nActive\n20 mins\nTotal\n60 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n425\ng\n(\n15\nounces\n;\n3\ncups\n)\nbread flour\n, plus more for dusting\n28\ng\n(\n1\nounce\n;\n1/2\ncup\n)\nnutritional yeast\n(see note)\n4\ng\n(\n1\nteaspoon\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use about half as much by volume or the same weight\n285\ng\n(\n10\nounces\n;\n1\ncup\nplus\n3\ntablespoons\n) cool\nwater\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\nDirections\nIn the bowl of a food processor, pulse the flour, nutritional yeast, and salt together to combine. With processor running, add water and oil and process until dough forms and runs around processor blade, about 30 seconds.\nSerious Eats / Vicky Wasik\nTransfer dough to clean counter. Knead dough until smooth. Roll, knead, and stretch dough, doubling back after each stretch, until dough begins to stretch without tearing, 3 to 5 minutes.\nSerious Eats / Vicky Wasik\nStretch dough to arm’s-length, then bring ends together to twirl dough into an even, twisted log (roll dough on counter after twisting to even out thicker areas). Repeat stretching and twirling until dough pulls full arm’s-length with no resistance and no tearing, about 10 minutes longer. Roll dough into an even log shape.\nSerious Eats / Vicky Wasik\nIf you plan to pull and cook the noodles immediately, dust the counter liberally with flour and bring a large pot of salted water to a rolling boil over high heat. If you would like to practice the noodle-pulling technique, do not flour the counter and proceed with the pulling instructions. Flouring the noodles is a point of no return—once floured, they must be cooked. If the dough is not floured, you can practice the pulling technique over and over without harming the dough. Gently roll dough log in flour, then use a bench scraper to divide dough into 3 equal portions.\nWorking with one piece at a time, shape into 15-inch log. Holding log at both ends, stretch to about 30 inches in length. (The following instructions are written for right-handed people; invert them if you are left-handed.) Bring right end of dough to left hand, forming loop. Using free right hand, gently tug and pull dough from midpoint of loop in fluid motion to about 30 inches. Move dough through floured surface to keep from sticking.\nSerious Eats / Vicky Wasik\nBring right end of dough to left hand and gently bunch dough ends together, forming another loop of 4 strands. Using free right hand, gently tug and pull dough from midpoint of loop in fluid motion to about 30 inches. Move dough through floured surface to keep from sticking. Repeat process 2 to 3 more times until noodles are about 1⁄8 inch in diameter.\nSerious Eats / Vicky Wasik\nUse bench scraper or knife to cut and separate noodles from small clump of dough in left hand. Immediately transfer portion of finished noodles to the pot of boiling water, and cook, stirring with tongs or chopsticks to prevent sticking, until noodles are cooked through but still chewy, 30 to 45 seconds. Drain noodles thoroughly using a fine-mesh strainer or noodle basket, shaking off as much excess water as possible, then transfer to a serving bowl with hot broth.\nSerious Eats / Vicky Wasik\nRepeat stretching, pulling, and cooking steps with remaining two portions of dough. A fourth portion of noodles can be pulled from excess dough scraps if desired. Knead, stretch, and twirl excess scraps of dough into even log, roll in flour, and repeat pulling process. Serve cooked noodles immediately.\nSpecial Equipment\nDigital scale\n,\nfood processor\n,\nfine-mesh strainer\nNotes\nFor best results, use a digital scale set in grams to measure ingredients.\nBe sure to use nutritional yeast well within its expiration date. Expired nutritional yeast will not work with this recipe—the dough will not relax as intended.\nThis noodle dough is designed to be kneaded, pulled into noodles, and cooked all in one go. Unlike other noodle recipes, the dough and noodles cannot be made in advance and cooked at a later time.\nMake-Ahead and Storage\nThe noodles are best enjoyed immediately. In fact, the recipe calls for cooking each portion of noodles immediately after pulling, as is customary with lamian noodles.\nRead More\nNutritional Yeast: What It Is, How It’s Made, and How to Use It\nNoodles\nChinese\nNoodle Mains\nEast Asian"
}