{
  "url": "https://www.seriouseats.com/hanukkah-sweet-potato-carrot-squash-latkes-with-ginger-recipe",
  "image_url": "https://www.seriouseats.com/thmb/EG20Unki2iFrAgIPgQPfpZNYBkk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__12__20141210-latke-variations-sweet-potato-vicky-wasik-4-4bb410957478454e8bd6211db5a9ac88.jpg",
  "tags": [
    "Sweet Potatoes",
    "Dairy-free Sides",
    "Fried Potatoes",
    "Carrots",
    "Russet Potatoes"
  ],
  "title": "Spiced Sweet Potato, Carrot, and Acorn Squash Latkes Recipe",
  "full_text": "Spiced Sweet Potato, Carrot, and Acorn Squash Latkes Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n60 mins\nCooling Time\n5 mins\nTotal\n60 mins\nServes\n24 latkes\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\n(\n225\ng\n)\ncarrots\n, shredded on the shredding disk of a\nfood processor\n(\n2\ncups\nshredded)\n3/4\npound\n(\n340\ng\n)\nacorn squash\n, trimmed, peeled, and shredded on the shredding disk of a food processor (\n2\ncups\nshredded)\n3/4\npound\n(\n340\ng\n)\nsweet potato\n, peeled and shredded on the shredding disk of a food processor (\n2\ncups\nshredded)\n1\npound\n(\n450\ng\n)\nrusset potatoes\n, peeled, trimmed, and shredded on the shredding disk of a food processor (\n3\ncups\nshredded)\n6\ncups\nchopped onion\n(about\n6\nmedium\nonions)\n4\nteaspoons\ngrated\nfresh ginger\n1\nteaspoon\nsmoked paprika\n1\nteaspoon\nground coriander\n1/2\nteaspoon\ncumin\n4\nlarge\neggs\n1\ncup\nmatzo meal\n, plus more as needed (see notes)\n4\nteaspoons\n(\n16\ng\n)\nkosher salt\n, plus more if needed\n1\ntablespoon\nfreshly ground black pepper\n, plus more if needed\nCanola or\npeanut oil\n, for frying\nUnsweetened applesauce\nand sour cream, for serving\nDirections\nWorking in roughly 2-cup batches, wrap carrots, squash, sweet potato, russet potato, and onion in cheesecloth that has been folded over twice. Tie corners around the handle of a wooden spoon and twist bundle until liquid flows out and vegetables are dry. Add squeezed vegetables to a large mixing bowl and toss to combine thoroughly.\nStir in ginger, paprika, coriander, and cumin. Mix in eggs and matzo meal. You should be able to form patties that just stick together in your hands; if the mixture is too wet, add more matzo meal, 1 tablespoon at a time, until patties can be properly formed. Stir in salt and pepper.\nHeat 1/2 inch oil in a cast iron skillet over medium-high heat until a shred of potato immediately bubbles when dropped in. Form a small amount of latke mixture into a disk and fry on both sides until golden brown to test for seasoning. Taste and add more salt and pepper if needed.\nForm patties about 3 inches wide and 1 inch thick in the center and slide into pan (no more than 4 at a time). Fry until a golden-brown crust forms on bottom, then flip using a slotted spatula and fork and fry until golden brown on other side and cooked through, approximately 3 minutes per side. If a darker crust is desired, continue cooking on each side to desired doneness.\nTransfer to a baking sheet lined with paper towels and let cool for 2 minutes. Serve with applesauce and sour cream at the table.\nSpecial Equipment\nCast iron skillet\n,\nfood processor\n, cheesecloth,\nrimmed baking sheet\nNotes\nThe exact amount of matzo meal needed will depend on how moist your vegetables are. Start with the suggested amount, then add more if needed, working in 1-tablespoon increments, until you can form patties that stick together in your hands.\nRead More\nOld-Fashioned Latkes\nBeet Latkes With Walnuts and Horseradish Sour Cream\nZucchini Latkes With Parmesan, Pine Nuts, and Basil\nSweet Potato and Sausage Jeon With Yangnyeom Dipping Sauce\nGluten-Free Sweet Potato Latkes\nSweet Potatoes\nDairy-free Sides\nFried Potatoes\nCarrots\nRusset Potatoes"
}