{
  "url": "https://www.seriouseats.com/harcha-moroccan-flatbread-recipe-11695575",
  "image_url": "https://www.seriouseats.com/thmb/rkMjEn56WoDyhb9bFZswpn-xjf0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312-SEA-HarchaMoroccanSemolinaBread-TwoBites-12-618ea1a46be94cf191d861e27ec84553.jpg",
  "tags": [
    "Bread",
    "The Latest",
    "Biscuits",
    "Moroccan"
  ],
  "title": "Harcha (Moroccan Semolina Bread)",
  "full_text": "Harcha (Moroccan Semolina Bread)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nTotal\n45 mins\nServes\n8\nMakes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n270\ng\nsemolina flour\n(\n9.5\nounces\n;\n1 1/2\ncups\n), preferably coarse flour such as King Arthur brand, plus more for sprinkling\n25\ng\n(\n2\ntablespoons\n)\ngranulated sugar\n1\nteaspoon\nbaking powder\n3/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n75\ng\n(\n5\ntablespoons\n)\nunsalted butter\n, melted and cooled slightly\n1/2\ncup\n(\n120\nml\n)\nwhole milk\n(see notes)\nServing spread of choice, such as\nbutter\nor jam\nDirections\nIn a large mixing bowl, whisk to fully combine semolina flour, sugar, baking powder, and salt. Add melted butter and mix with your fingers until mixture has a sandy, crumbly texture.\nSerious Eats / Two Bites\nAdd milk and mix with your hands until dough comes together and forms a ball. It should be soft but not sticky. If dough is too wet, sprinkle 1 tablespoon semolina over top and knead in until absorbed. Repeat if needed until proper texture is achieved. Let it rest for 15 minutes to allow semolina to absorb the liquid.\nSerious Eats / Two Bites\nLightly dust a work surface with semolina and transfer dough to it. Using the palm of your hands, flatten dough into a 1/2-inch-thick circle, about 8 inches in diameter. Sprinkle dough’s surface with more semolina, then use a 3-inch round cookie cutter or glass to cut out discs. Gather dough scraps and reshape into 1/2-inch-thick round and cut out more discs; you should have 8 discs total. (Alternatively, divide the dough into eight equal portions and shape them into individual 1/2-inch-thick discs by hand.)\nSerious Eats / Two Bites\nHeat a 12-inch cast-iron or stainless-steel skillet over medium-low heat for 3 minutes. Place 4 dough rounds in dry skillet and cook, pressing down occasionally with a spatula to prevent doming, until golden brown on first side, 5 to 7 minutes.\nSerious Eats / Two Bites\nFlip flatbreads and continue to cook, adjusting heat as needed to prevent burning, until golden brown on second side, 3 to 5 minutes. Transfer cooked flatbreads to a parchment paper–lined baking sheet. Wipe skillet clean, then repeat with remaining 4 semolina breads. Serve immediately with your choice of spreads.\nSerious Eats / Two Bites\nSpecial Equipment\n12-inch cast-iron or stainless-steel skillet\nMake-Ahead and Storage\nLeftover harcha can be stored in an airtight container at room temperature for up to 3 days. To freeze, individually wrap the cooked harcha in plastic, then transfer to an airtight container or freezer bag and freeze for up to 2 months. Reheat frozen harcha in a dry skillet over medium heat, flipping occasionally until warmed through or heat in a toaster oven.\nBread\nThe Latest\nBiscuits\nMoroccan"
}