{
  "url": "https://www.seriouseats.com/harissa-armenian-wheat-and-chicken-porridge-recipe-5224855",
  "image_url": "https://www.seriouseats.com/thmb/orn7Qvs7QA1H5I70fHniUwRUbI8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220330-harissa-andrew-janjigian-21Beauty0804_1-ebadd715236244d184de8004a4bba46b.JPG",
  "tags": [
    "Breakfast & Brunch",
    "Farro & Other Wheat",
    "Stovetop",
    "Easter",
    "Mains"
  ],
  "title": "Harissa (Armenian Wheat and Chicken Porridge)",
  "full_text": "Harissa (Armenian Wheat and Chicken Porridge)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 15 mins\nTotal\n2 hrs 20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n960\nml\n) homemade or store-bought\nchicken stock\n1\npound\nboneless, skinless chicken thighs\n, cut in half crosswise, or\nboneless lamb stew meat\n, cut into 1-inch cubes (see note)\n1 1/2\ncups\n(\n276\ng\n)\npearled farro\n(see note)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n6\ntablespoons\n(\n85\ng\n)\nbutter\n4\ntablespoons\n(\n60\ng\n)\nolive oil\n2\ntablespoons\n(\n16\ng\n)\nAleppo pepper\n(see note)\nLavash\n, for serving (optional)\nDirections\nFor the Stovetop:\nCombine broth, 2 cups (480 ml) water, chicken (or lamb), farro, and salt in a Dutch oven and bring to boil over high heat. Cover pot and reduce heat to maintain gentle simmer. Cook, stirring occasionally, until mixture is creamy and thick and grains easily compress under a spatula, 1 1/2 to 2 hours. You will need to stir more frequently toward the end of the cooking process. Skip to step 4.\nFor a Pressure Cooker:\nPlace broth, 1 cup (240 ml) water, chicken (or lamb or beef), farro, and salt in a pressure cooker. Seal and bring to high pressure over medium-high heat, if using a stovetop model, or by setting to pressure-cooker mode on an electric multi-cooker. Cook at high pressure for 40 minutes, adjusting heat as needed to maintain high pressure (if using a stovetop pressure cooker; electric ones will automatically regulate the heat and pressure level).\nSerious Eats / Andrew Janjigian\nAllow cooker to depressurize naturally (about 15 minutes), then carefully remove lid, allowing steam to escape away from you.\nSerious Eats / Andrew Janjigian\nUsing a potato masher, vigorously mash mixture until the majority of chicken pieces are reduced to fine shreds and the harissa is very thick and starchy, about 2 minutes. (If you have an immersion blender, you can speed things along by blending the mixture for about 30 seconds and then finishing with potato masher.) Season with additional salt to taste.\nSerious Eats / Andrew Janjigian\nIn a small saucepan, heat butter and oil over medium-high heat until foamy. Continue to cook, swirling pan, until milk solids in butter turn a deep hazelnut brown, 1 to 2 minutes. Remove from heat and add Aleppo pepper (don't be alarmed; butter will foam and fizzle when pepper is added), swirling to coat.\nSerious Eats / Andrew Janjigian\nSpoon harissa into bowls, drizzle with spiced brown butter, and serve (with lavash on side, if including).\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nPotato masher, immersion blender (optional).\nNotes\nDon't trim the fat or sinew from the meat; it contributes to the flavor and richness of the porridge, and breaks down completely by the end of cooking.\nIf you can find korkot, or hulled wheat (available at Middle Eastern markets or online), by all means use that. Pearled farro makes an excellent substitute. If pearled farro is unavailable, pearled barley works nicely here, too.\nBecause of the minimal evaporation that takes place in a pressure cooker, only add 1 cup water (rather than 2 cups called for in the stovetop version).\nWhen cooking on the stovetop, stir the harissa more frequently after the first hour, to prevent sticking and scorching.\nAleppo chile peppers, which have been cultivated in Syria for centuries, are quite mild in terms of heat, with a hint of raisin-y, sun-dried tomato sweetness. Due to the ongoing civil war, true Aleppo pepper from Syria is no longer available for import, but chiles grown in neighboring Turkey are. You can find Aleppo pepper at Middle Eastern markets, or online. Korean gochugaru or paprika (plus 1/8 teaspoon cayenne to add heat to the latter) can be substituted for Aleppo pepper in this recipe.\nMake-Ahead and Storage\nHarissa can be cooled to room temperature and refrigerated for up to three days before reheating on the stovetop; add water, 1 tablespoon at a time, to restore it to its original consistency.\nBreakfast & Brunch\nFarro & Other Wheat\nStovetop\nEaster\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/harissa-armenian-wheat-and-chicken-porridge.webp?"
}