{
  "url": "https://www.seriouseats.com/harissa-and-beer-broiled-shrimp",
  "image_url": null,
  "tags": [
    "Seafood Mains",
    "Roasted Seafood",
    "Shrimp",
    "Quick Dinners",
    "Quick Snacks"
  ],
  "title": "Quick Broiled Shrimp With Harissa and Beer Recipe",
  "full_text": "Quick Broiled Shrimp With Harissa and Beer Recipe\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n16/20 shrimp\n, shell-on, deveined\n1 1/2\nteaspoons\nkosher salt\n1/2\nbottle\n(\n6\nounces\n)\nbeer\n, whatever kind you're drinking\n2\ncloves\ngarlic\n, thinly sliced\n1/2\ncup\n(\n4\nounces\n)\nbutter\n, room temperature, cut into 1-inch pieces\n1/4\ncup\n(\n2\nounces\n)\nfresh chile harissa\n(see note)\n1/4\ncup\n(\n2\nounces\n)\ndried chile harissa\nBread\nand more beer to serve\nDirections\nPlace a sheet tray lined with foil or a large cast iron skillet under the broiler to preheat. Toss the cleaned shrimp with salt. Set aside.\nAdd the beer and garlic to a small, 2-quart saucepan over medium-high heat. Reduce until it is sticky and only about 3 tablespoons in volume, about 5 minutes. The beer will foam up while boiling. Set the pot askew on the burner to prevent it from boiling over.\nAdd the butter to the beer one tablespoon at a time while constantly swirling until incorporated and thick, about 2 minutes. Remove from heat and stir in the harissas.\nPour the butter sauce over the shrimp and toss to combine. Pour the shrimp and all the sauce on the preheated sheet tray or skillet. It will hiss and sputter. Make sure the shrimp is in one even layer and place the tray or the skillet under the broiler until shrimp are opaque and cooked through, about 4 minutes. Serve immediately.\nSpecial Equipment\nRimmed baking sheet\nor\ncast iron skillet\n,\nkitchen shears\nNotes\nStore-bought harissa works just as well. Feel free to add more or less to your taste. Other chili pastes that work well in this dish are canned chipotles, sambal, and curry paste.\nRead More\nEverything You Can Do With Harissa\nA Comprehensive Guide to Buying Better Shrimp\nJamaican Pepper Shrimp Recipe\nEbi no Chiri-Sōsu (Japanese Shrimp in Chile Sauce) Recipe\nSeafood Mains\nRoasted Seafood\nShrimp\nQuick Dinners\nQuick Snacks"
}