{
  "url": "https://www.seriouseats.com/hashweh-recipe-6452602",
  "image_url": "https://www.seriouseats.com/thmb/KA40w72smul7ruSEDT4RA6G4tnA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220810-Hashweh-Mai-Kakish-hero-b4ea6351f3394c1d8a5b1f0bee3e0c36.JPG",
  "tags": [
    "Chicken",
    "Middle Eastern",
    "Beef",
    "Rice & Grains",
    "The Latest"
  ],
  "title": "Hashweh (Palestinian Spiced Rice and Meat)",
  "full_text": "Hashweh (Palestinian Spiced Rice and Meat)\nClose\nJump to recipe\nPrep\n40 mins\nCook\n90 mins\nResting Time\n20 mins\nTotal\n2 hrs 30 mins\nServes\n6\nto 8 servings\nMakes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spiced Chicken Broth:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, plus more as needed\n1\nwhole\n(\n4- to 5-pound\n;\n1.8-2.3kg\n)\nchicken\n,\ncut into 6 pieces\n(2 legs, 2 bone-in breast halves, back, and neck)\n1\nmedium\n(\n8-ounce\n;\n225 g\n)\nyellow onion\n1\nmedium\nclove garlic\n3\nbay leaves\n1\nteaspoon\n(\n4\ng\n)\nground allspice\n1\nteaspoon\n(\n4\ng\n)\nground cinnamon\n1/2\nteaspoon\nfreshly\nground black pepper\n4\ncardamom pods\n, cracked open (or substitute with\n1/4\nteaspoon\nground cardamom\n)\nPinch\nfreshly\ngrated nutmeg\nSalt\nFor the Hashweh:\n1\npound\n2\nounces\n(\n500\ng\n)\nCalrose\nor\njasmine rice\n2 1/2\nteaspoons\n(\n10\ng\n)\nground allspice\n1 1/2\nteaspoons\n(\n6\ng\n)\nground cinnamon\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\nfreshly grated\nnutmeg\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n2\ntablespoons\n(\n30\ng\n)\nbutter\nor\nghee\n1 1/2\npound\n(\n680\ng\n)\nboneless beef rib\n,\nchuck\n,\nskirt steak\n, or other rich cut, cut into 1/3-inch (1cm) cubes or ground in a meat grinder on coarsest setting (see note)\n4\ncups\n(\n950\nml\n)\nSpiced Chicken Broth\n(see note)\nSalt\nFor the Toppings:\n3\ntablespoons\n(\n45\nml\n)\nvegetable\nor\nextra-virgin olive oil\n, divided\n1\ncup\nslivered almonds\n(about\n6\nounces\n;\n170\ng\n)\n1/2\ncup\npine nuts\n(\n2 1/2\nounces\n;\n70\ng\n)\nDirections\nFor the Spiced Chicken Broth:\nIn a stock pot or other heavy-bottomed pot, heat olive oil over medium heat until almost smoking. Working in batches to avoid crowding the pot, add chicken, skin side down, and sear until golden brown all over, about 5 minutes each side, then transfer to a plate or platter; add additional oil as needed to prevent pot from drying out during subsequent batches.\nSerious Eats / Mai Kakish\nReturn all chicken pieces to the pot and stir in the onion and garlic. Add 10 cups (2.5L) water and bring to a boil over high heat. Boil for 5 minutes, skimming off any scum that rises to the surface. Reduce the heat to medium-low, add the bay leaves, allspice, cinnamon, black pepper, cardamom, and nutmeg and simmer until chicken is cooked through but not falling apart, about 1 hour; season lightly with salt midway through cooking.\nSerious Eats / Mai Kakish\nUsing tongs and a slotted spoon, transfer chicken pieces to a heatproof bowl along with 2 cups (475ml) broth. Cover to keep warm and set aside until ready to use. Strain remaining broth through a fine-mesh strainer, discarding solids. Keep the broth hot.\nSerious Eats / Mai Kakish\nFor the Hashweh:\nPlace rice in a medium mixing bowl and rinse with several changes of cold water until water runs clear. Cover rice with fresh cold water, soak for 15 minutes, then drain well.\nSerious Eats / Mai Kakish\nMeanwhile, in a small bowl, mix together allspice, cinnamon, black pepper, and nutmeg.\nSerious Eats / Mai Kakish\nIn a large Dutch oven, heat oil and butter (or ghee) over medium-high heat until the butter starts to sizzle, then add half of the spice mixture and fry just until fragrant, about 5 seconds. Add the beef and cook, stirring often, until any released water evaporates and the meat starts to sizzle, 10 to 15 minutes.\nSerious Eats / Mai Kakish\nAdd 1/2 cup (120ml) of the reserved chicken broth, then lower heat and simmer until the liquid evaporates again.\nSerious Eats / Mai Kakish\nAdd the drained rice to the meat and toss until rice is fully coated in the oil and evenly mixed with the meat. Add 4 cups (950ml) of the reserved chicken broth along with the remaining spices. Season with salt: the broth should be slightly saltier than you would like your finished dish to be, as the rice will absorb some of the salt.\nSerious Eats / Mai Kakish\nBring to a boil over high heat, then lower the heat to maintain a bare simmer. Cover and cook until the liquid has mostly evaporated but the rice is still easy to stir with a spoon and not sticking to the bottom, about 10 minutes. Wrap a clean tea towel or paper towels around the lid and cover tightly again, then remove from the heat and let it sit to steam in the residual heat for 20 minutes.\nSerious Eats / Mai Kakish\nMeanwhile,\nfor the toppings:\nIn a small skillet, combine 2 tablespoons (30ml) oil with almonds. Set over medium heat and cook, stirring, until almonds are a light golden color, about 4 minutes. Remove from the heat and drain on a plate lined with paper towels. Repeat with the remaining 1 tablespoon (15ml) oil and pine nuts.\nSerious Eats / Mai Kakish\nWhile the rice is still resting, shred the chicken from the broth into bite size morsels, discarding all skin and bones; reserve any remaining broth for another use. Add a ladleful of the simmering broth to the chicken to keep it warm, then remove the broth from the heat.\nSerious Eats / Mai Kakish\nTo serve, fluff rice with a large fork and transfer to a serving platter. Top with the shredded chicken followed by the toasted almonds and pine nuts and serve immediately.\nSerious Eats / Mai Kakish\nSpecial Equipment\nMeat grinder\n(optional)\nNotes\nTo make dicing the meat easier, partially freeze it first (how long this takes will depend on the specific cut of beef you use and its dimensions).If you are pressed on time, you can substitute ground beef, lamb, or veal.\nFor a simpler weeknight version, you can use any\nhomemade chicken stock\nyou keep in the freezer, or store-bought low-sodium broth; in this case, omit the shredded meat garnish.\nMake-Ahead and Storage\nThe broth and toasted nuts can be made up to 2 days in advance. The broth and chicken can be refrigerated, then returned to a simmer before proceeding with the recipe (it's easiest to shred the chicken while cold, then heat it up after with some broth). The toasted nuts can be held in an airtight container at room temperature until ready to use. If the chicken cools down too much before serving, you can always dip it back in the simmering broth for a couple of minutes.\nRead More\nMaqlubeh (Palestinian \"Upside Down\" Meat, Vegetables, and Rice)\nChicken\nMiddle Eastern\nBeef\nRice & Grains\nThe Latest"
}