{
  "url": "https://www.seriouseats.com/hazelnut-apricot-macarons",
  "image_url": "https://www.seriouseats.com/thmb/3kqwcayjtcOXUKXMOTZaRQJ8_00=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130805-cookiemonster-hazelnutmacarons2-dd47edc04558469f9b1fba5854f8cd65.JPG",
  "tags": [
    "Cookies",
    "French"
  ],
  "title": "Hazelnut Apricot Macarons Recipe",
  "full_text": "Hazelnut Apricot Macarons Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nCooling Time\n10 mins\nTotal\n50 mins\nServes\n36 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nhazelnut flour\n2\ncups\nconfectioners sugar\n3\negg whites\n1/8\nteaspoon\nsalt\n2\ntablespoons\nsugar\nApricot jam\nDirections\nAdjust oven rack to upper and lower-middle positions and preheat oven to 300°F. Line two baking sheets with parchment paper.\nIn a small bowl, sift together hazelnut flour and confectioners sugar. There shouldn't be any lumps left. Set aside.\nIn a large bowl, beat egg whites on medium speed until frothy, about 1 minute. Add salt and beat one minute more. Turn up speed on mixer to medium-high and slowly incorporate sugar into the mix. Beat until glossy medium peaks form.\nUse a rubber spatula to fold flour mixture into egg whites, going about 1/4 cup at a time. Continue until all flour is mixed in evenly.\nCarefully transfer batter to a piping bag. Pipe batter into 1 inch rounds on baking sheets. After rounds are piped, tap sheet on counter to help expel air bubbles. Bake cookies until they are dry on top and easily lifted from the parchment, 16-19 minutes. Let cool.\nWhen cookies are cool, arrange into similarly sized pairs. Top the bottom of one pair with about 1/4 teaspoon apricot jam, then top with other cookie. Repeat until all sandwiches are made.\nSpecial equipment\nElectric mixer, parchment paper, baking sheets, pastry bag\nCookies\nFrench",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/hazelnut-apricot-macarons-recipe.webp?"
}