{
  "url": "https://www.seriouseats.com/herby-lamb-meatballs-recipe-11695777",
  "image_url": "https://www.seriouseats.com/thmb/LPp1CP6Pyzvnv69Hp0DI-en1Uho=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250213-SEA-SpringyLambMeatballs-JenCausey-Beauty1-34-331f5b6a4f774c4e8d6cae913171b195.jpg",
  "tags": [
    "Meatballs",
    "The Latest",
    "Ground Lamb"
  ],
  "title": "Herby Lamb Meatballs",
  "full_text": "Herby Lamb Meatballs\nClose\nJump to recipe\nPrep\n25 mins\nCook\n18 mins\nChilling TIme:\n30 mins\nTotal\n73 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2\nslices\nwhite bread\n, crust removed and cut into small pieces (about\n1\nloosely\npacked cup\n)\n3\ntablespoons\n(\n45\nml\n)\nwhole milk\n1/2\nmedium\nyellow\nonion\n(\n4\nounces\n;\n113\ng\n), grated (about\n1/2\ncup\n)\n1\nlarge\negg\n1\nteaspoon\nground coriander\n1/2\nteaspoon\nground cumin\n1/2\nteaspoon\ncrushed red pepper flakes\n1/2\nteaspoon\ngranulated garlic\n1/2\ncup\nloosely packed fresh\nmint leaves\n(\n1/2\nounce\n;\n14\ng\n), finely chopped, divided\n3/4\ncup\n, plus\n2\ntablespoons\n(\n210\nml\n)\nwhole-milk strained (Greek-style) yogurt\n, divided (see notes)\n2\ntablespoons\n(\n6\ng\n)\nchopped fresh dill\n, divided, plus fronds for garnish\n2 1/4\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt use half as much by volume\n1 1/2\npounds\n(\n680\ng\n)\nground lamb\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n2\nounces\n(\n57\ng\n)\nfeta cheese\nin brine, drained and crumbled (about\n1/2\ncup\n)\n1\nteaspoon\ngrated lemon zest\n, plus\n1\ntablespoon\nfresh juice\n(from\n1\nmedium\nlemon\n), plus lemon wedges to serve\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (205°C). Line a rimmed baking sheet with parchment paper and set aside. In a large bowl, combine bread with milk and toss to coat. Let stand, stirring occasionally, until bread is completely moist, about 5 minutes. Squeeze bread between your fingers or mash with a spoon to make sure there are no dry spots.\nSerious Eats / Jen Causey\nAdd onion, egg, coriander, cumin, red pepper, garlic, 1/4 cup mint, 2 tablespoons yogurt, 1 tablespoon dill, and 2 teaspoons salt to bread mixture. Using a clean hand or spoon, stir until very well combined. Add ground lamb and, using your hand, continue mixing vigorously, squishing meat and seasonings between your fingers, until just combined and meat has taken on a slightly sticky texture; be careful not to overwork meat.\nUsing wet hands, roll lamb mixture into 2-ounce (60 g) meatballs (about 16 total). Place on prepared baking sheet, evenly spaced apart, and cover lightly with plastic wrap. Refrigerate meatballs until firm and cold, at least 30 minutes or up to 4 hours.\nSerious Eats / Jen Causey\nIn a 12-inch cast iron, carbon-steel, or stainless-steel skillet, heat oil over medium-high heat until shimmering. Add half of meatballs in an single layer and cook, undisturbed, until browned on 1 side, 1 to 2 minutes. Using tongs, carefully turn meatballs and continue to cook, turning as needed, until browned on all sides, 3 to 4 minutes. Transfer meatballs to a large plate. Repeat with remaining meatballs. Once all meatballs are browned, transfer meatballs back to skillet, and bake until an instant-read thermometer inserted into center of meatballs registers 145°F (63°C), 5 to 7 minutes (see notes).\nSerious Eats / Jen Causey\nMeanwhile, in a food processor, process feta cheese, lemon zest and juice, remaining 3/4 cup of yogurt, remaining 1/4 cup mint, remaining 1 tablespoon dill, and remaining 1/4 teaspoon salt until mostly smooth, about 2 minutes.\nSerious Eats / Jen Causey\nSpoon sauce onto a large serving plate or individual plates. Gently set meatballs on top of sauce. Garnish with dill fronds, and serve with lemon wedges.\nSerious Eats / Jen Causey\nSpecial Equipment\n12-inch cast iron, carbon-steel, or stainless-steel skillet, food processor\nNotes\nThe ideal Greek-style yogurt for this recipe is one that is\ncompletely\nstrained; many Greek yogurts in the US market are only partially strained. One good option here is Fage, which comes thoroughly strained from the start. If you have another brand that seems slightly thinner, you can place yogurt in a fine-mesh sieve set over a bowl and let stand for about 2 hours. Once the extra water has drained away, you will have a much thicker yogurt to work with.\nWe think 145°F is an ideal internal temperature for lamb meatballs, but if you have any health concerns such as a compromised immune system among your diners, you can cook them further to 160°F.\nMake-Ahead and Storage\nThe yogurt and feta sauce can be made ahead and refrigerated in an airtight container for up to 4 days.\nMeatballs\nThe Latest\nGround Lamb",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/herby-lamb-meatballs.webp?"
}