{
  "url": "https://www.seriouseats.com/herb-butter-rubbed-crisp-skinned-butterflied-spatchcock-roast-turkey-thanksgiving-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rMGNpgEutPzFt6FxS1qCkaMd7e0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__11__20141106-thanksgiving-turkey-spatchcock-butterfly-herb-rubbed-08-4e2309ff9a374ada8e2cdbaebcf0ceb6.jpg",
  "tags": [
    "Roasted Turkey",
    "Thanksgiving Turkeys",
    "Christmas Dinners",
    "Winter Mains"
  ],
  "title": "Herb-Rubbed Crisp-Skinned Butterflied Roast Turkey",
  "full_text": "Herb-Rubbed Crisp-Skinned Butterflied Roast Turkey\nClose\nJump to recipe\nPrep\n15 mins\nCook\n80 mins\nActive\n35 mins\nResting Time\n20 mins\nTotal\n115 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nmedium\ncloves garlic\n1/4\ncup\nroughly chopped chives\n1/4\ncup\nfresh parsley leaves\n1/4\ncup\nfresh sage leaves\n2\ntablespoons\nfresh thyme leaves\n1\nmedium\nshallot\n, thinly sliced\n1\nstick\nbutter\n, cut into 1/4-inch slices\nKosher salt\nand\nfreshly ground black pepper\n1\nwhole\nturkey\n(\n10 - 15\npounds\ntotal),\nbutterflied\nand\nbrined\n(reserve backbone and neck if making stock for gravy, see note)\nGravy\n, for serving\nDirections\nAdjust oven rack to middle position and preheat oven to 450°F (230°C). Line a rimmed baking sheet or broiler pan with aluminum foil. Place slotted broiler rack or wire rack on top.\nCombine garlic, chives, parsley, sage, thyme, and shallots in the bowl of a food processor. Pulse, scraping down sides as necessary, until finely chopped and no large pieces remain. Scatter butter chunks on top. Pulse until homogeneous paste is formed. Season generously with salt and pepper and pulse to combine. Transfer half of butter mixture to a small saucepan and melt over low heat.\nGently separate the skin of the turkey from the flesh using your hands, going in through the bottom of the breast and working up along both breast halves and the thighs. Using your hands, rub butter directly on the turkey meat underneath the skin all over. Massage the skin from the outside until the butter is distributed in an even layer.\nBrush exterior of the turkey with the melted butter until evenly coated. Season the turkey with salt and pepper and transfer to the wire rack.\nTransfer turkey to oven and roast, rotating occasionally, until an instant-read thermometer inserted into the deepest part of the breast registers 150°F (66°C), and the thighs register at least 165°F (74°C), about 80 minutes. Remove from oven and allow to rest at room temperature for 20 minutes before\ncarving\n. Serve immediately.\nSpecial Equipment\nHalf-sheet pan and wire rack\n,\ninstant-read thermometer\n,\nfood processor\nNotes\nFor best results,\ndry-brine your turkey\n. If dry-brining, omit any additional salt in herb butter. The neck and backbone of the turkey can be used to fortify stock used to make\ngravy\n. Chop them into rough chunks with a cleaver, brown in oil in a medium saucepan along with chopped onions, carrot, celery, and bay leaf, then cover with\nhomemade\nor store-bought low-sodium chicken stock. Simmer for one hour before straining and using to make gravy. We have full\nstep-by-step instructions for how to spatchcock your turkey.\nRoasted Turkey\nThanksgiving Turkeys\nChristmas Dinners\nWinter Mains"
}