{
  "url": "https://www.seriouseats.com/hibiscus-loaf-cake-with-cream-cheese-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/6O5R32K_Z9LPdW3-WLbtJArVyrs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120501-127677-LTE-Hibiscus-Cake-PRIMARY-46a2458ce8ae4293842cb174d60f1a01.jpg",
  "tags": [
    "Cakes",
    "Quick Breads"
  ],
  "title": "Hibiscus Loaf Cake Recipe",
  "full_text": "Hibiscus Loaf Cake Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n30 mins\nSteeping and Cooling Time\n70 mins\nTotal\n2 hrs 10 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nBaking spray\n1\ncup\ndried hibiscus flowers\n(see note)\n1/2\ncup\nboiling water\n3\ntablespoons\nhoney\n1\ntablespoon\nfresh lemon juice\n2 1/2\ncups\n(about\n12 1/2\nounces\n)\nall-purpose flour\n1 1/2\nteaspoons\nbaking powder\n1/2\nteaspoon\nbaking soda\n1\nteaspoon\nsalt\n6\ntablespoons\nunsalted butter\n, at room temperature\n1/4\ncup\nvegetable oil\n1\ncup\n(about\n7\nounces\n)\ngranulated sugar\n3\nlarge\neggs\n, beaten and at room temperature\n3/4\ncup\nwhole milk\n, at room temperature\n2\nteaspoons\npure vanilla extract\nFor the Spread:\n8\nounces\ncream cheese\n, cut into\n8\npieces\nand at room temperature\n1/4\ncup\nsour cream\n1/4\ncup\nhoney\n1/2\nteaspoon\npure vanilla extract\n1/8\nteaspoon\nsalt\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F. Wrap 4 layers of heavy duty foil (See Notes) around exterior of 9- by 5-inch loaf pan, then coat interior with baking spray.\nCombine hibiscus flowers, boiling water, honey, and lemon juice in small bowl, mashing with fork to ensure flowers absorb liquid evenly. Allow flowers to steep until softened and liquid has been almost completely absorbed, about 15 minutes.\nIn medium bowl, whisk together flour, baking powder, baking soda, and salt; set aside.\nIn large bowl, beat butter on medium speed until creamy, about 1 minute. Add oil and sugar and continue to beat until light and fluffy, about 3 minutes. Add eggs in a slow steady stream and continue to beat until completely incorporated, about 1 minute.\nDecrease mixer speed to low and add flour mixture in three batches, alternating with milk. Scrape sides and bottom of bowl with rubber spatula as needed. Increase speed to medium and beat mixture just until combined, 20 to 30 seconds. Add vanilla and soaked hibiscus flowers beat once more, just to combine, about 20 seconds.\nScrape batter into prepared pan. Bake 35 to 40 minutes, rotating cake halfway through baking, until cake tester inserted in center of cake comes out clean. Transfer cake to cooling and cool in pan 10 minutes. Invert cake onto plate or second cooling rack, then revert to original cooling rack so top of cake faces up. Cool completely, at least 1 hour. Serve with spread.\nFor the Spread:\nPrepare spread while cake cools. In large bowl, beat cream cheese on medium speed until smooth, about 2 minutes. Add sour cream, honey, vanilla, and salt and continue beating until completely smooth, about 2 minutes. Serve with cake.\nSpecial equipment\n9- by 5-inch loaf pan, heavy-duty foil, whisk, electric mixer, rubber spatula, cooling rack\nThis Recipe Appears In\nLet Them Eat: Hibiscus Loaf Cake\nCakes\nQuick Breads"
}