{
  "url": "https://www.seriouseats.com/hiyashi-chuka-cold-ramen-easy-summer-noodle-recipe",
  "image_url": "https://www.seriouseats.com/thmb/bLULeUCLpIQqdULWbjmxuG3oWeI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__06__20150529-cold-ramen-hiyashi-chuka-shao-zhong-4-899b239879484c05bff9139b0f1cd88c.jpg",
  "tags": [
    "Ramen",
    "Japanese",
    "Ham",
    "Shrimp",
    "Noodle Mains"
  ],
  "title": "Hiyashi Chuka (Cold Ramen) With Shrimp, Ham, and Vegetables",
  "full_text": "Hiyashi Chuka (Cold Ramen) With Shrimp, Ham, and Vegetables\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n30 mins\nCooling Time\n5 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nservings\nfresh ramen\nnoodles\n(about\n22\nounces\ntotal; see notes)\n1/4\npound\nlarge shrimp\n, shelled and deveined\n1\near\nof cooked\ncorn, kernels\nsliced off and cob discarded\n1\negg\n, beaten\n3\ntablespoons\nsoy sauce\n3\ntablespoons\nrice vinegar\n1\ntablespoon\nsugar\n1\ntablespoon\nwater\n1\nteaspoon\ngrated fresh peeled\nginger\n1\nteaspoon\ntoasted sesame oil\n1/2\nteaspoon\nhot chile oil\n1\nteaspoon\ntoasted sesame seeds\n1/4\npound\nsliced\ncooked ham\n, cut into strips\n4\nsticks\nimitation crab meat\n, shredded into thin strips\n1\nlarge\ntomato\n, halved, then thinly sliced\n2\nscallions\n, white and light green parts only, thinly sliced on the bias\nSpicy Japanese mustard\n, for serving\nDirections\nIn a large pot of salted boiling water, cook ramen noodles until tender and springy. Drain in a colander, rinse under cold running water, and let drip dry. Set aside. (If they being to clump or stick, run under cold water again to loosen.)\nSerious Eats / Shao Z.\nMeanwhile, in a small mixing bowl, stir together soy sauce, rice vinegar, sugar, water, grated ginger, sesame oil, hot oil, and toasted sesame seeds. Set dressing aside in the refrigerator to chill.\nIn a saucepan of simmering salted water, poach shrimp until just cooked through, about 3 minutes. Chill under cold running water, then slice in half lengthwise.\nIn a small nonstick skillet, cook beaten egg over medium heat until set in a thin sheet like an omelette, about 3 minutes; cover during last minute to set the top. Remove from skillet, let cool 1 minute, then roll and thinly slice into strips.\nSerious Eats / Shao Z.\nTo serve, place chilled drained noodles in serving bowls. Top the noodle with shrimp, corn, scallion, ham, tomato, crab stick, and sliced egg. Add a dollop of hot Japanese mustard in the middle. Divide dressing into 4 small bowls and serve. To eat, pour dressing on top of the noodles at the table, toss to combine, and enjoy right away.\nNotes\nRamen noodles are often available at stores with well-stocked Asian sections, usually in the refrigerator or freezer section (they're sometimes sold alone, and sometimes sold with a soup flavor pack included). If you can't find ramen noodles, you can substitute yakisoba or soba noodles; the dish won't be the same, but it'll still be tasty. Alternatively, you can transform\nangel hair pasta into a worthy ramen substitute using Daniel's method\n.\nMake-Ahead and Storage\nThe noodles and toppings can be prepared hours ahead of time. Simply refrigerate and assemble when ready to serve.\nRead More\nClassic Cold Soba Recipe\nBibim Guksu (Korean Cold Mixed Noodles) Recipe\nChinese Cold Noodle Salad with Sesame Dressing Recipe\nItalian Seafood-Salad Pasta Salad With Vietnamese Noodles Recipe\nMul Naengmyun (Cold Korean Noodle Soup) Recipe\nRamen\nJapanese\nHam\nShrimp\nNoodle Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/hiyashi-chuka-cold-ramen-with-shrimp-ham-and-vegetables.webp?"
}