{
  "url": "https://www.seriouseats.com/hk-style-spam-and-egg-sandwich-recipe-11680136",
  "image_url": "https://www.seriouseats.com/thmb/thfD-I6IhPbHmJDKu2uZo_b2Y50=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240304-SEA-HKSpamandEgg-AmandaSuarez-19-33204e43c4c74714888c42bd74df8d7f.jpg",
  "tags": [
    "Pork",
    "Breakfast & Brunch",
    "Chinese",
    "Sandwiches",
    "Eggs"
  ],
  "title": "Hong Kong-Style Spam and Egg Sandwich",
  "full_text": "Hong Kong-Style Spam and Egg Sandwich\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nTotal\n15 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n4\nslices\nwhite sandwich bread\n, crusts removed and lightly toasted\n2 tablespoons (\n28\ng)\nunsalted butter\nFour\n1/4-inch-thick\nslices\nSpam\n2\ntablespoons\n(\n30\nml\n)\nhalf and half\n1/2\nteaspoon\npotato or\ntapioca starch\n(see notes)\n1/8 teaspoon Diamond Crystal\nkosher salt\n; for table salt, use a pinch\n3\nlarge\neggs\n1/2\ntablespoon\nvegetable oil\nDirections\nUsing an offset spatula or butter knife, spread a thin layer of unsalted butter on one side of each piece of lightly toasted bread. Set aside.\nSerious Eats / Amanda Suarez\nIn a medium nonstick or cast iron skillet set over medium-high heat, cook Spam until bottom is golden brown, about 2 minutes. Using chopsticks, tongs, or an offset spatula, flip and cook until second side is crisped and golden brown, about 2 minutes. Remove from heat and divide slices of Spam between 2 slices of bread and set aside. Using a paper towel, wipe skillet clean.\nSerious Eats / Amanda Suarez\nIn a large bowl, whisk together half-and-half, potato starch, and salt until well combined. Add eggs and whisk until no traces of whites are visible and eggs are slightly frothy, about 1 minute. Add vegetable oil to the now-empty skillet and heat over medium-high heat until shimmering. Add egg mixture and, using a rubber spatula, fold and swirl the eggs until just set, 1 to 2 minutes. Remove from heat.\nSerious Eats / Kevin Vaughn\nTop each Spam portion with eggs, close sandwiches with remaining bread slices, and serve immediately.\nSerious Eats / Amanda Suarez\nNotes\nWhile cornstarch will still produce a tender scramble, it activates at a slightly higher temperature, and your eggs won’t be quite as velvety as ones made with potato starch or tapioca starch.\nPork\nBreakfast & Brunch\nChinese\nSandwiches\nEggs"
}