{
  "url": "https://www.seriouseats.com/hoagie-roll-recipe-8621128",
  "image_url": "https://www.seriouseats.com/thmb/www0D_3QWV0npdhcKOxUyqSuHr0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240326-SEA-HoagieRolls-DebbieWee-37-b6f78bfda4214e11bfc5cce75c1dc168.jpg",
  "tags": [
    "Rolls & Buns",
    "The Latest",
    "Bread"
  ],
  "title": "Hoagie Rolls",
  "full_text": "Hoagie Rolls\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nRising Time\n2 hrs\nTotal\n3 hrs\nServes\n8\nMakes\n8 Rolls\nCook Mode\n(Keep screen awake)\nIngredients\n780\ng\n(about\n5 1/2\ncups\n)\nbread flour,\nplus more for flouring work surface\n14\ng\n(\n4\nteaspoons)\ninstant or fast-acting instant yeast\n9\ng\n(\n1\ntablespoon)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n455\ng\n(2\ncups\n)\nroom-temperature water\n45\ng\n(\n3\ntablespoons\n)\nneutral oil\nsuch as\nvegetable\n, plus more for greasing the bowl\n1\nlarge\negg\n, room temperature\n17\ng\n(\n4\nteaspoons\n)\ngranulated sugar\nDirections\nIn the bowl of a stand mixer, whisk together flour, yeast, and salt. In a 4-cup liquid measuring cup or large bowl, whisk water, oil, egg, and sugar until sugar is dissolved.\nSerious Eats / Debbie Wee\nUsing a dough hook on low speed, slowly drizzle water mixture into flour mixture and mix, scraping down bowl as needed, until cohesive dough forms and no dry flour remains, about 2 minutes. Increase mixer speed to medium-low and knead until dough is smooth and elastic and clears sides of bowl but still sticks to the bottom, about 8 minutes.\nSerious Eats / Debbie Wee\nTransfer dough to a lightly floured work surface and knead by hand to form a smooth round ball, about 1 minute. In a lightly greased large bowl, place the dough seam side down, cover the bowl tightly with plastic wrap or a large plate, and let rise at room temperature, 68 to 74℉ (20 to 23 ℃), until the dough is doubled in size, 1 to 1 1/2 hours.\nSerious Eats / Debbie Wee\nLine 2 rimmed baking sheets with parchment paper. Press down on dough to deflate and transfer the dough to a clean work surface. Using a bench scraper or sharp knife, cut dough into quarters, then cut each quarter in half. (You should have 8 pieces of dough that weigh about 155g each.) Cover loosely with greased plastic wrap.\nSerious Eats / Debbie Wee\nWorking with 1 piece of dough at a time (while remaining pieces are still covered), press dough piece into a 4-inch square.\nSerious Eats / Debbie Wee\nFold the upper third of the dough toward the center and press gently to seal. Fold the lower third of the dough to the center, mimicking an envelope fold, and press gently to seal the center seam where the folds meet. You should now have a roughly 5- by 3-inch rectangle.\nSerious Eats / Debbie Wee\nFold the dough in half toward you, using your thumb to create a crease along the center of the dough. Seal with the heel of your other hand as you work your way along the fold, without pressing down on the loaf, use the heel of your hand to reinforce the seal.\nSerious Eats / Debbie Wee\nCup one hand over the center of the log and, without pushing down, gently roll the log back and forth to reinforce the seal.You should have a log that is roughly 5 inches long and 2 inches thick.\nSerious Eats / Debbie Wee\nGently stretch and roll the dough into an 8 -inch long by 1 1/2-inches thick cylinder. Place one hand at each end of the cylinder and move your hands back and forth in opposite directions to gently roll the ends of the cylinder under your palms to form rounded, slightly tapered ends. Transfer to a prepared baking sheet and repeat with remaining dough portions, leaving 3 inches of space between the 4 loaves on each sheet.\nSerious Eats / Debbie Wee\nCover loosely with kitchen towel or greased plastic wrap and proof until nearly doubled in size and the dough springs back minimally when poked gently with your knuckle, 30 to 60 minutes.\nSerious Eats / Debbie Wee\nWhile the shaped rolls proof, adjust one oven rack to the upper-middle position and a second oven rack the lower-middle position and heat oven to 350℉ (175℃). Using a bread lame or sharp paring knife, make one 1/4-inch-deep slash lengthwise along the top of each roll, starting and stopping about 1/2 inch from each end. Using a spray bottle of water, mist the surface of each loaf.\nSerious Eats / Debbie Wee\nWorking quickly, place loaves in the oven, then mist the inside walls of the oven with water. Bake rolls until golden brown, 30 to 35 minutes, switching and rotating sheets halfway through baking. Let rolls sit for 5 minutes, then transfer to wire racks and cool completely. Slice open and load up with your favorite sandwich fillings and serve.\nSerious Eats / Debbie Wee\nSpecial Equipment\nStand mixer with dough hook attachment, 2 rimmed baking sheets\nMake-Ahead and Storage\nBaked rolls can be stored in an airtight container at room temperature for up to 2 days or wrapped individually and frozen for up to 2 months.\nRolls & Buns\nThe Latest\nBread"
}