{
  "url": "https://www.seriouseats.com/homemade-wheat-thins-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KZDo3lf4QhPV-STCjMneCfHbgjc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__03__20170227-homemade-wheat-thins-vicky-wasik-21-7cee1578b2954352973948a81b24a064.jpg",
  "tags": [
    "Dairy-free Snacks & Appetizers",
    "Vegan Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Bread",
    "Savory"
  ],
  "title": "Homemade Wheat Thins Recipe",
  "full_text": "Homemade Wheat Thins Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n45 mins\nCooling Time\n60 mins\nTotal\n105 mins\nServes\n140 small crackers\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Glaze:\n2\nounces\nlight corn syrup\n(about\n3\ntablespoons\n;\n55\ng\n)\n1/4\nounce\nbarley malt syrup\n(about\n1 1/2\nteaspoons\n;\n7\ng\n)\n1/4\nteaspoon\n(\n1\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or use the same weight\n1\nounce\nhot water\n(about\n2\ntablespoons\n;\n30\ng\n)\nFor the Crackers:\n5\nounces\nwhole wheat flour\n, plus more for dusting (about\n1\ncup\n,\nspooned\n;\n140\ng\n)\n2 1/2\nounces\nsugar\n(about\n1/3\ncup\n;\n70\ng\n)\n1 1/2\nounces\nbread flour\n(about\n1/4\ncup\n, spooned;\n40\ng\n)\n3/4\nounce\ntoasted wheat germ\n(about\n3\ntablespoons\n;\n20\ng\n)\n1/2\nteaspoon\nground turmeric\n1/2\nteaspoon\n(\n2\ng\n)\nDiamond Crystal kosher salt\n, plus more for sprinkling; for table salt, use half as much by volume or use the same weight\n1/2\nteaspoon\ncream of tartar\n1/4\nteaspoon\nbaking soda\n1\nounce\nrefined coconut oil\n, solid but creamy (about\n2\ntablespoons\n;\n30\ng\n)\n1/4\nounce\nbarley malt syrup\n(\n1 1/2\nteaspoons\n;\n7\ng\n)\n3\nounces\nwater\n(about\n1/3\ncup\nplus\n1\ntablespoon\n;\n85\ng\n)\nDirections\nFor the Glaze:\nCombine corn syrup, malted barley syrup, and salt in a small bowl, then add hot water and stir with a fork until the salt is dissolved. Set aside to cool.\nFor the Crackers:\nAdjust oven rack to lower-middle position, preheat to 350°F, and cut two parchment sheets to 11- by 16-inches. Combine whole wheat flour, sugar, bread flour, wheat germ, salt, turmeric, cream of tartar, baking soda, and coconut oil in the bowl of a food processor. Pulse until coconut oil disappears into a fine, powdery meal. Mix barley malt and water in a small glass to dissolve the syrup, then add to dry mix and process to form a stiff dough. Knead lightly on an unfloured surface, then divide in half and drape with a damp paper towel.\nTo Roll:\nPlace a prepared parchment sheet on a clean work surface, and dust generously with whole wheat flour. Place one portion of dough in the center, sprinkle with flour, and, using a rolling pin, roll into a roughly 5- by 8-inch rectangle. Dust with flour and carefully flip the dough over, sprinkling more flour on top, wherever you notice a sticky patch. Continue rolling from the center out, until the dough extends just past the edges of the parchment and is no thicker than 1/16 inch; the crackers will puff significantly in the oven, so this thinness is key to keeping them thin and crisp.\nTo Glaze and Cut:\nTrim away the ragged edges with a pizza wheel, and lightly brush the dough with glaze. If you like, use a docking tool to decorate the crackers. Cut into 1 1/2-inch squares with a pizza wheel (they will shrink in the oven), then carefully transfer the parchment and crackers to an aluminum half sheet pan. This can be done by lifting two opposite corners and pulling the paper taut, or by sliding the parchment and crackers on and off a pizza peel.\nTo Bake:\nSprinkle with salt and bake the crackers to a light yellow-brown, about 12 minutes, rotating the sheet pan halfway through to ensure even browning in the ultra-thin dough. The bake-time is\nhighly variable\n, depending on the exact thickness of the dough, the type of baking sheet used, and any variations in dough thickness. Keep a close eye on the crackers as they bake, as they may brown and crisp faster depending on these variables. Cool to room temperature directly on the baking sheet; the crackers will not be crisp while warm. Repeat with the remaining dough (if rolled/cut in advance, the crackers won't shrink away from each other as they should). Store leftovers in an airtight container at room temperature up to one month.\nSpecial equipment\nFood processor, rolling pin, pastry brush, docking tool (optional), pizza wheel\nNotes\nIf you haven't already picked up a jar of barley malt syrup for my\nhomemade bagels\nand\nmalted chocolate chip cookies\n, grab some online—my favorite brand is Eden. You can make great crackers without it, but they won't taste like real Wheat Thins.\nThis Recipe Appears In\nBraveTart: Homemade Wheat Thins Are Freakishly Close to the Real Thing\nDairy-free Snacks & Appetizers\nVegan Snacks & Appetizers\nVegetarian Snacks & Appetizers\nBread\nSavory"
}