{
  "url": "https://www.seriouseats.com/home-style-tamagoyaki-japanese-rolled-omelette",
  "image_url": null,
  "tags": [
    "Omelettes",
    "Japanese",
    "Vegetarian Breakfast & Brunch",
    "Vegetarian Snacks & Appetizers",
    "Stovetop Eggs"
  ],
  "title": "Home-Style Tamagoyaki (Japanese Rolled Omelette)",
  "full_text": "Home-Style Tamagoyaki (Japanese Rolled Omelette)\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n10 mins\nTotal\n15 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\neggs\n1 1/2\ntablespoons\n(\n20\nml\n)\nhomemade\ndashi\nor\nhondashi\n, or more or less as desired (see note)\n1\nteaspoon\n(\n5\nml\n)\nusukuchi (light) soy sauce\n, plus more for drizzling\n1\nteaspoon\n(\n5\nml\n)\nmirin\nAn\noil-soaked paper towel\n, folded up into a small bundle, for greasing the pan\nGrated daikon radish\n, for serving\nDirections\nIn a small bowl and using chopsticks, beat eggs until well combined and no visible traces of whites remain. Beat in the cooled dashi, mirin, and soy sauce.\nPreheat tamagoyaki pan over medium-high heat until you can feel moderate heat radiating off it when your hand is held an inch or two from the surface (you want it just hot enough that the eggs will gently bubble and sizzle when they hit the pan, but not so hot that they rapidly brown). Holding your greased paper towel between a pair of chopsticks, rub the pan all over with a light coating of oil, including in all the corners (it helps to store the oiled towel nearby in a small dish during the cooking process).\nSerious Eats / Vicky Wasik\nAdd 1/4 of the egg mixture to the pan, tilting the pan to spread the egg around in an even layer covering the bottom of the pan. Using your chopsticks, puncture any large bubbles that form.\nWhen the egg has fully set on the bottom but is still slightly wet on top, begin your first roll: Lift the pan off the heat and try to slide one of your chopsticks under the far edge of the egg layer; then, with a quick upward motion of the pan, lift and roll the egg sheet up and over itself so that it rolls partway toward the handle. Repeat, rolling the egg sheet up fully toward the handle. This is the most difficult layer to roll because the egg sheet is so floppy; if you have trouble, don't worry, just use your chopsticks to push the egg sheet, bunching it up by the handle end.\nReturn the pan to the heat. Rub the oiled towel all over the exposed surface of the pan (this should be the middle and far side), then slide the omelette roll away from the handle to the far side of the pan and grease the area near the handle.\nSerious Eats / Vicky Wasik\nAdd the next quarter of the egg mixture (you will make four layers in total), spreading it around the bottom of the pan. Using your chopsticks, lift the rolled portion up and let the raw egg run underneath it. Continue to cook, popping any large bubbles that form, until the new layer is just set and still wet on top.\nSerious Eats / Vicky Wasik\nNow repeat the rolling step as before, sliding a chopstick under the far edge and flopping the cooked egg log over itself as you roll it toward the handle. Repeat the layering and rolling process 2 more times until the egg is finished.\nTurn the rolled tamagoyaki out onto a bamboo sushi mat, if desired, and roll it up tightly but gently (this helps set a uniform rolled shape, but isn't required); let stand 3 minutes. Transfer tamagoyaki to a serving plate, slice crosswise if desired, and serve with a small mound of grated daikon radish; lightly drizzle some extra usukuchi soy sauce on the daikon mound, if desired.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nNonstick rectangular 5-by-7 inch tamagoyaki pan,\nbamboo sushi mat\n(optional)\nNotes\nHondashi, or instant dashi crystals, are a quick and easy way to whip up some dashi at home in no time; use 1/4 teaspoon dashi crystals per 1/4 cup of warm water, stirring until well dissolved. Exactly how much dashi you use is a matter of taste and skill: you can add up to equal parts dashi and egg, but it becomes increasingly harder to cook as the volume of dashi goes up and the eggs grow more watery. This recipe starts you out at a reasonably easy and still flavorful level, but you can add more as your skill increases, or use less if you're struggling with the technique.\nMake-Ahead and Storage\nTamagoyaki can be eaten right away while still hot or allowed to cool to room temperature; it's also good chilled. Wrap tightly in plastic and store for up to 8 hours in the refrigerator if not eating within an hour of cooking it.\nRead More\nClassic French Omelette\nChinese-Style Layered Omelette\nOmurice (Japanese Omelette-Topped Ketchup Fried Rice With Ketchup)\nChawan Mushi\nOmelettes\nJapanese\nVegetarian Breakfast & Brunch\nVegetarian Snacks & Appetizers\nStovetop Eggs"
}