{
  "url": "https://www.seriouseats.com/homemade-yogurt",
  "image_url": "https://www.seriouseats.com/thmb/W7HjvRJOBOMn7ly6F6lIOrE_JfY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190614-yogurt-vicky-wasik-8-1b8381eea1b44c17ac31879c11e6c624.jpg",
  "tags": [
    "Yogurt & Cultured Dairy",
    "Breakfast & Brunch"
  ],
  "title": "How to Make Homemade Yogurt",
  "full_text": "How to Make Homemade Yogurt\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n2 hrs\nSetting and Refrigerating Time\n65 hrs\nTotal\n65 hrs 25 mins\nServes\n8 servings\nMakes\n1/2 gallon\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ngallon\n(\n1.8\nliters\n)\nmilk\n(see note)\n2\ntablespoons\n(\n30\nml\n)\nyogurt with active live cultures\n(see note)\nDirections\nIn a medium saucepan or saucier, heat milk gently over medium heat until it reaches 180°F (82°C) on an instant-read thermometer. Keep the milk between 180 and 190°F (82 to 88°C) for at least 10 minutes and up to 30 minutes (how long you hold the milk at this temperature will change how much water steams off and how concentrated the milk proteins and fats end up, changing the final texture of the yogurt; there's no one right way to do it).\nAllow the milk to cool to about 110°F (43°C). In a small bowl, stir together the yogurt with a few spoonfuls of the warm milk, then scrape the yogurt mixture into the pot of lukewarm milk. Stir well to distribute the yogurt culture.\nTransfer the cultured milk to glass jars, the vessels of a yogurt maker, an Indian clay yogurt pot, or whatever incubating device you may have, such as a slow cooker or Instant Pot.\nCover the jars and keep warm; how you do this depends on what you have at home. You can submerge the jars up to their necks in the temperature-controlled water of an immersion circulator (set to 110°F or the incubation temperature of your choosing); place them in a turned-off oven with the light switched on; wrap them in kitchen towels and hold them in a warm place; submerge them in 110°F water held in a cooler; use a yogurt maker, etc.\nHow long it takes the yogurt to set will depend on the temperature at which it is held. This can be as short as 3 or 4 hours and as long as 18 hours. Once the yogurt has set, allow it to sit out at room temperature for up to an additional 12 hours to ensure a strong culture; if you're working with a culture you know well, you may not need to let it sit out for so long, especially if you don't want it to grow too sour. There's no one good rule here except to give the yogurt the time it needs to sour and thicken properly.\nTransfer the yogurt to the refrigerator and, if you can, let it set for another 2 or 3 days before eating it (all this time is simply to allow the culture to grow strong).\nStrain it to make Greek yogurt\n, if desired. If you plan to use this yogurt to inoculate future batches, make sure to set a few tablespoons aside.\nSpecial Equipment\n3-quart saucier\n, glass jars\nNotes\nYou can use milk of any fat percentage, though whole milk will yield the richest results; you can also use homogenized or creamline milk; pasteurized milk will work, but try to avoid ultra-pasteurized products, which can have trouble setting properly.\nYou can use any store-bought plain yogurt with active live cultures, or spoon some of your homemade yogurt into a future batch. If you use a freeze-dried yogurt culture, follow the manufacturer's instructions.\nMake-Ahead and Storage\nThe yogurt can be refrigerated in sealed containers for up to two weeks (though you should use it to culture a new batch after no more than one week to ensure the culture is still strong).\nRead More\nHomemade Greek Yogurt\nEverything You Can Do With a Tub of Yogurt\nYogurt & Cultured Dairy\nBreakfast & Brunch"
}