{
  "url": "https://www.seriouseats.com/homemade-wonton-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/XF537WbRHQCQBmabBgSRrvQnx18=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/homemade-wonton-soup-recipe-hero-03_1-406f80324c80417ba12c4a3cdd35b3e6.JPG",
  "tags": [
    "Soups",
    "Chinese",
    "Pork",
    "Shrimp"
  ],
  "title": "Homemade Wonton Soup",
  "full_text": "Homemade Wonton Soup\nClose\nJump to recipe\nPrep\n35 mins\nCook\n2 hrs 30 mins\nActive\n60 mins\nBrining Time\n15 mins\nTotal\n3 hrs 20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n2\npounds\n(\n900\ng\n)\nchicken backs\n, wingtips, and/or bones. roughly chopped with a cleaver\n1 1/2\npounds\n(\n680\ng\n)\npig's trotters\n, split or sliced\n3\nounces\n(\n85\ng\n) Chinese ham or\nprosciutto\nShells taken from\n24\nsmall shrimp\n(shrimp flesh used to make the wontons; see ingredients list below)\n1\n(\n3- by 4-inch) square\n(\n8\ng\n)\nkombu\n(see notes)\n1\nounce\n(\n30\ng\n)\ndried shrimp\nor stockfish (optional)\n8\nmedium\nscallions\n(\n150\ng\n), whites and greens reserved separately\n1\n(\n4-inch; 60 g) knob\nfresh ginger\n, sliced, plus\n2\nteaspoons\n(\n7\ng\n) grated fresh ginger\n12\nleaves\n(\n340\ng\n)\nNapa cabbage\n, cut into 2-inch pieces, divided\nFor the Wontons:\n24\nsmall\nshrimp\n(\n225\ng\n), shells removed and reserved for stock\n1/2\nteaspoon\nbaking soda\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n, divided, plus more to taste; for table salt, use half as much by volume or the same weight\n3/4\npound\n(\n340\ng\n)\nground pork\n2\nteaspoons\n(\n10\ng\n)\nsugar\n1\nteaspoon\n(\n5\nml\n)\nsoy sauce\n2\nteaspoons\n(\n10\nml\n)\nsesame oil\n1/2\ncup\n(\n40\ng\n) yellow\nchives\n, thinly sliced, divided (see notes)\n20\nwonton wrappers\n, thin variety preferred\nDirections\nFor the Broth\n: Combine chicken, pork trotters, and ham in a large stockpot and cover with water. Bring to a boil over high heat. Boil for 10 minutes, then dump contents into the sink and let liquid drain. Clean bones and meat under cold running water, rubbing off any scum or blood clots that may appear and return to the stockpot.\nSerious Eats / Qi Ai\nFill stockpot with cold water until water is about 1 inch above the surface of the bones. Add reserved shrimp shells, kombu, dried shrimp or stockfish (optional), scallion whites, sliced ginger, and 4 cabbage leaves. Bring to a boil over high heat, reduce to a bare simmer, and cook, uncovered, until broth is deeply flavorful, about 2 hours.\nSerious Eats / Qi Ai\nUsing tongs, discard bones from broth. Strain through a fine-mesh strainer into a large saucepan and discard solids. Defat broth with a ladle if using the same day. Broth can also be transferred to sealed containers, refrigerated overnight, then skimmed the next day, using a spoon to remove the solid fat from the top.\nSerious Eats / Qi Ai\nFor the Wontons\n: Place shelled shrimp in a small bowl. Add baking soda, 1 teaspoon salt, and 1/4 cup (60ml) water and mix with fingers. Set aside for at least 15 minutes and up to 1 day in the refrigerator. Drain when ready.\nSerious Eats / Qi Ai\nMeanwhile, combine pork, grated fresh ginger, sugar, soy sauce, sesame oil, half of chives, and remaining 1 teaspoon salt in a medium bowl. Mix with fingers until thoroughly combined. To test for seasoning, place a small amount on a microwave-safe plate and microwave on high power until cooked through, about 10 seconds. Taste for seasoning and add more salt as necessary.\nSerious Eats / Qi Ai\nPlace one wonton wrapper in the center of the cutting board, keeping the rest covered in plastic. Place a 1 tablespoon-sized portion of pork filling in center of wrapper, and top with a single shrimp. Using your finger tip, moisten the wrapper with water around the edge.\nSerious Eats / Qi Ai\nLift two opposite corners up to meet at a point, then use your fingertips to seal the rest of the sides, forming a triangle, and squeezing out as much air as possible.\nSerious Eats / Qi Ai\nPull the two opposite corners towards each other to form the triangle into a plump folded crescent shape, using a little water to seal the edges. Transfer to a plate and repeat with remaining wontons.\nSerious Eats / Qi Ai\nFor the Soup\n: Bring broth to a boil. Season with salt to taste. Add wontons and cabbage and cook until wontons are cooked through, about 3 minutes. Stir in remaining chives and remove from heat. Allow to cool for 1 minute. Serve immediately.\nSerious Eats / Qi Ai\nNotes\nKombu is a giant sea kelp. It can be found in most Asian grocers.\nYellow chives can be found in Chinese grocers. If unavailable, green chives or scallions can be used in their place.\nMake-Ahead and Storage\nBoth the broth and the wontons can be made ahead and frozen. To freeze the wontons, place them on a parchment-lined plate, cover them loosely with plastic wrap, then place them in the freezer until completely frozen, about 1 hour. Transfer to a plastic bag. They can be cooked directly from frozen, just add 1 to 2 minutes to the cooking time.\nRead More\nSichuan-Style Wontons in Hot and Sour Vinegar and Chili Oil Sauce (Suanla Chaoshou) Recipe\nEgg Drop Soup\nPan-Fried Vegetable Dumplings\nSoups\nChinese\nPork\nShrimp"
}