{
  "url": "https://www.seriouseats.com/homemade-fudgsicle-recipe",
  "image_url": "https://www.seriouseats.com/thmb/9oi-mO0LkmXVJUiQp8bvxFSIIKo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160824-fudgesicles-vicky-wasik-12-0e5d5a3fc4a24740a32fb2889ea5fab2.jpg",
  "tags": [
    "Popsicles",
    "Gluten-free Desserts",
    "Chocolate"
  ],
  "title": "DIY Fudgsicles Recipe",
  "full_text": "DIY Fudgsicles Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n10 mins\nFreezing Time\n3 hrs 45 mins\nTotal\n4 hrs 5 mins\nServes\n8 popsicles\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Gelatin:\n1/4\nounce\nunflavored gelatin powder\n(\n2 1/4\nteaspoons\n;\n7\ng\n)\n1\nounce\nmilk\n(\n2\ntablespoons\n;\n30\ng\n), preferably skim (though any percentage will do)\n1/2\nounce\nvanilla extract\nor crème de cacao (\n1\ntablespoon\n;\n15\ng\n)\nFor the Fudgsicle Base:\n5\nounces\nlight brown sugar\n(\n2/3\ncup\n;\n140\ng\n)\n1 1/2\nounces\nDutch-processed cocoa powder\n(\n1/2\ncup\n;\n40\ng\n)\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\n18\nounces\nmilk\n(\n2 1/4\ncups\n;\n510\ng\n), preferably skim (though any percentage will do), divided\nDirections\nFor the Gelatin:\nIn a small bowl, combine gelatin, milk, and vanilla extract or crème de cacao, mixing with a fork until smooth. Set aside until needed.\nFor the Fudgsicle Base:\nCombine brown sugar, Dutched cocoa powder, and salt in a 3-quart stainless steel saucier, whisking to break up any lumps. Stir in approximately\nhalf\nthe milk, then warm over medium heat until just beginning to steam, but not yet bubbling, less than 5 minutes. Immediately remove from heat and stir in gelatin mixture. When gelatin is fully melted, incorporate remaining milk.\nLightly grease 8 three-fluid-ounce molds. Transfer Fudgsicle base to a quart-size measuring cup, then divide base between molds. Cover each with foil and freeze until slightly firm, about 45 minutes. Insert popsicle sticks through foil and continue freezing until completely solid, about 3 hours.\nTo unmold, run molds under hot tap water for about 30 seconds, then slide a paring knife between the pop and the mold to let air slip in for an easier release. Enjoy immediately, or wrap individually in plastic and freeze up to 3 weeks.\nSpecial Equipment\n3-quart stainless steel saucier, whisk, quart-size measuring cup,\npopsicle molds\n, popsicle sticks\nNotes\nHomemade Fudgsicles hinge on the dark color, robust flavor, and relatively high pH of Dutched cocoa powder, so it's imperative that you reach for the good stuff. In supermarkets, look for brands like Droste, or save some money by ordering in bulk online, where brands like Cacao Barry can retail for as little as $9 a pound.\nYou can read about\nour favorite popsicle molds right here\n.\nThis Recipe Appears In\nBraveTart: DIY Fudgsicles Are Even More Intense and Refreshing Than the Real Deal\nPopsicles\nGluten-free Desserts\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-fudgsicles-recipe.webp?"
}