{
  "url": "https://www.seriouseats.com/homemade-vanilla-ice-cream-sandwiches-recipe",
  "image_url": "https://www.seriouseats.com/thmb/u1UJ5WYkuB8bLZHIlCTQH6IKn6o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240207-SEA-VanillaIceCreamSandwich-JenCausey-00-226c513403774f3ea59507073dd33192.jpg",
  "tags": [
    "Ice Cream",
    "The Latest",
    "Chocolate",
    "Cookies"
  ],
  "title": "Vanilla Ice Cream Sandwiches",
  "full_text": "Vanilla Ice Cream Sandwiches\nClose\nJump to recipe\nPrep\n55 mins\nCook\n15 mins\nActive\n45 mins\nCooling and Freezing Time\n13 hrs\nTotal\n14 hrs 10 mins\nServes\n12 ice cream sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\n(\n113\ng\n)\nunsalted butter\n, room temperature\n5\nounces\n(\n141\ng\n)\ngranulated sugar\n2\nounces\n(\n57\ng\n)\nbrown sugar\n2\nteaspoons\n(\n9\ng\n)\nvanilla extract\n1 1/2\nteaspoons\n(\n3\ng\n)\ninstant espresso powder\n1 1/2\nteaspoons\n(\n5\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1/2\nteaspoon\nbaking powder\n1/8\nteaspoon\nbaking soda\n4\nlarge\negg yolks\n5 1/4\nounces\nall-purpose flour\n(\n1\ncup\nplus\n1\ntablespoon\n;\n148\ng\n), sifted (use rice flour for gluten free)\n4\nounces\nunsweetened\ncocoa powder\n(\n1\ncup\n;\n112\ng\n), sifted\n6\nounces\nhot\ncoffee\n(\n3/4\ncup\n;\n180\nml\n)\n2\nquarts\n(\n1.9\nL\n)\nvanilla ice cream\n, store bought or\nhomemade\nDirections\nFor the Chocolate Wafers:\nAdjust oven rack to middle position. Preheat the oven to 350°F (175℃) and line 2 rimmed baking sheets with parchment paper; set aside. With a hand mixer or stand mixer fitted with a paddle attachment, cream butter, granulated sugar, brown sugar, vanilla, espresso powder, salt, baking powder, and baking soda on medium speed until light and fluffy, about 2 minutes.\nSerious Eats / Jen Causey\nWith the mixer on medium speed, add the yolks one at a time, beating until just combined after each addition; scrape down sides of bowl, as needed.\nSerious Eats / Jen Causey\nOnce all yolks are incorporated, reduce mixing speed to low and add flour and cocoa and mix until all dry ingredients are incorporated, 1 to 2 minutes. With the mixer on low speed, slowly drizzle in coffee, stopping mixer and scraping down the bowl about halfway through, until fully incorporated and mixture has a smooth cake-batter–like consistency, 1 to 2 minutes. (If any lumps remain, increase the mixer speed to medium and beat until only a few small lumps remain. Any remaining small lumps will disappear during baking.)\nSerious Eats / Jen Causey\nDivide the batter evenly between the two prepared baking sheets (about 15 ounces of batter per sheet). Use an offset spatula or the back of a spoon to spread the batter into a thin even layer; it’s okay if the batter does not reach to the corners of the pans, baked wafers will later be cut into an about  9-inch by 13-inch rectangle. Tap the baking sheets against the counter to help level the batter. Bake one sheet at a time until the wafer is puffed and firm to the touch, 7 to 10 minutes. Let cool to room temperature on a wire rack, about 30 minutes. Refrigerate or freeze, uncovered, until fully cooled and firm, about 30 minutes.\nSerious Eats / Jen Causey\nMeanwhile, If using store bought ice cream, soften the ice cream in the refrigerator until spreadable, about 30 minutes. Line a 9-inch by 13-inch baking pan with parchment paper. The paper should overhang the long sides of the pan by about 4 inches.\nSerious Eats / Jen Causey\nCut the cooled chocolate wafers into 8 3/4-inch by 12 3/4-inch rectangles. Reserve the excess scraps.\nSerious Eats / Jen Causey\nCarefully transfer one cut wafer, shiny side down, into the bottom of the prepared pan. Gently press and fit the wafer into the pan then slowly peel off the parchment paper stuck to the bottom. (If the wafer cracks or breaks, use some of the reserved wafer trimmings to patch together. The wafers should meld together nicely just by pressing firmly.) Store the wafer-lined pan and the remaining chocolate wafer separately in the freezer until ready to use.\nSerious Eats / Jen Causey\nOnce the ice cream is softened, spread over the wafer that is nestled in the prepared pan. Use a spoon or offset spatula to spread the ice cream into an even layer, pushing into the corners of the pan (for best results with homemade ice cream, use it immediately after it's finished churning in your ice cream maker).\nSerious Eats / Jen Causey\nInvert the remaining cut wafer onto a cutting board. Peel off the parchment paper and place the wafer shiny side up on top of the ice cream. Cover the wafer with a piece of parchment or plastic wrap, then use your hands to gently press the top wafer down and seal it against the ice cream. If you notice there are any thin or uneven places, gently push on the chocolate wafer to redistribute the ice cream below. Freeze the uncut ice cream sandwiches in the pan, covered with plastic wrap, until the ice cream is frozen, about 12 hours before proceeding.\nSerious Eats / Jen Causey\nOnce fully frozen and ready to cut, run a knife under hot water to warm slightly then run the warmed knife around the edges of the pan to loosen. Hold the overhanging parchment to gently lift the uncut ice cream sandwich from the pan. It may take a bit of tugging on one side of the parchment, then the other to remove. Transfer to a cutting board.\nSerious Eats / Jen Causey\nUsing a large chef's knife, cut it into twelve 4 1/4-inch by 2 1/2-inch rectangles by first cutting it into quarters, then cut each quarter into three equal sized pieces. For clean slices, wipe the knife clean with a hot, wet towel between each cut. Serve immediately or freeze the sandwiches in an airtight container or wrap each in your own prepared waxed foil (see note).\nSerious Eats / Jen Causey\nSpecial Equipment\n9- by 13-inch aluminum baking pan\n, aluminum foil, parchment paper\nNotes\nAll measurements are in weights, as volume measures can be very imprecise. I strongly recommend using a scale for all pastry projects. Serious Eats' recommended kitchen scales are\nhere\n.\nOf course, you don't have to make wrappers. But it's fun and easy. To make your own waxed foil, simply take a large sheet of tin foil, shiny side up, and use a pastry brush or paper towel to coat it lightly with a neutral oil like safflower oil or coconut oil. Press a similarly sized sheet of parchment paper against the oiled surface of the foil. Use your fingers to smooth the parchment down, pressing out any air bubbles. I recommend using a bench scraping for removing air bubbles. Cut the newly formed waxed foil into 7-inch squares with scissors or an x-acto knife. Repeat until you have 12 squares altogether. Set aside until needed.\nWrap the ice cream sandwiches: Remove half of the ice cream sandwiches from the freezer. Place each on the center of the foil or parchment square. Wrap much like you would a Christmas present: fold the long sides to the middle. Then at each edge, fold the short sides to the middle. Then fold the long sides. The foil will crease and stay in place without tape. Return to the freezer, and repeat with the other half. They will keep quite well for about a month, if they last that long, which I doubt.\nMake-Ahead and Storage\nWrapped ice cream sandwiches will keep frozen for about a month. (If they last that long, which I doubt.)\nRead More\nHomemade Chipwiches Recipe\nHomemade Klondike Bars Recipe\nProfiteroles Recipe\nLemon Basil Chocolate Chip Ice Cream Sandwiches Recipe\nBanana Cookies and Bourbon Ice Cream Sandwiches Recipe\nIce Cream\nThe Latest\nChocolate\nCookies"
}