{
  "url": "https://www.seriouseats.com/homemade-veggie-vegan-burgers-that-dont-suck-recipe",
  "image_url": "https://www.seriouseats.com/thmb/_c-xbP-tch4dpSTxKE1zY16sHo8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-VeganBurger-FredHardy-00-dbf603c78b694bfd99489b85ab44f4c4.jpg",
  "tags": [
    "American",
    "Dairy-free Mains",
    "Vegan Mains",
    "Vegetarian Mains",
    "Grilling"
  ],
  "title": "Homemade Vegan Burgers",
  "full_text": "Homemade Vegan Burgers\nClose\nJump to recipe\nPrep\n25 mins\nCook\n115 mins\nActive\n60 mins\nCooling Time\n20 mins\nTotal\n2 hrs 40 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n598\ng\n)\nbutton mushrooms\n, trimmed (about\n8\ncups\n)\n1/4\ncup\nplus\n1/2\ntablespoons\nneutral oil\nsuch as\ncanola\nor\nvegetable oil, divided\n3 1/2\nteaspoons\nkosher salt\n, plus more to taste; if using table salt use half as much by volume\n1/4\nteaspoon\nground black pepper\n, plus more to taste\n6\nthyme\nsprigs\n1\nwhole small\neggplant\n(about\n8\nounces;\n241\ng\n)\n2\nlarge\nleeks\n(\n5 1/2\nounces\n;\n154\ng\n), trimmed, whites and pale green parts chopped fine (about\n1 1/2\ncups\n)\n1\nlarge\ncelery rib\n(about\n2\nounces\n;\n65\ng\n), chopped fine (about\n1/2\ncup\n)\n1\nmedium\n(\n5\ng\n)\nclove\ngarlic\n, grated on a microplane grater (about\n1\nteaspoon\n)\n3/4\ncup\ndried pearled barley\n(\n5 5/8\nounces\n;\n159\ng\n)\n1\n14-ounce\ncan garbanzo beans\n, drained and patted dry on paper towels (\n7 1/2\nounces\n;\n210\ng\n)\n1/4\ncup\nall-purpose flour\n(\n1 1/8\nounces\n;\n13\ng\n)\n2\nteaspoons\nbaking powder\n1\nteaspoon\nmarmite\n,\nvegemite\n, or\nMaggi\nseasoning\n1\ncup\ntoasted cashews\n,\npinenuts\n, or a\nmix\n(\n4 1/2\nounces\n;\n127\ng\n)\n1\nteaspoon\nsoy sauce\n1 1/2\ncups\npanko-style bread crumbs\n(\n3 3/4\nounces\n;\n105\ng\n) (see note)\n4\nslices (about 1-ounce each)\nplant-based\nor\npreferred dairy cheese\n, optional\n8\nburger\nbuns\n, lightly toasted\nDirections\nAdjust oven rack to middle position and heat oven to 350°F. In a large bowl, toss mushrooms with 2 tablespoons oil, 2 teaspoons salt, and 1/8 teaspoon pepper. Brush eggplant with 1/2 tablespoon oil and sprinkle evenly with 1 teaspoon salt and remaining 1/8 teaspoon pepper. Wrap eggplant with aluminum foil. Transfer mushrooms and eggplant to an aluminum foil-lined rimmed baking sheet. Sprinkle thyme over mushrooms. Bake, turning mushrooms and wrapped eggplant occasionally until mushrooms are dark brown and eggplant is completely tender (test with a cake tester or thin skewer), about 45 minutes to 1 hour. Set aside and let cool until ready to use.\nSerious Eats / Fred Hardy\nWhile mushrooms and eggplant roast, in a large skillet, heat remaining two tablespoons oil over medium-high heat until shimmering. Add leeks, celery, and 1/2 teaspoon of salt and cook, stirring occasionally, until softened, about 4 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Transfer mixture to a medium bowl and set aside to cool.\nSerious Eats / Fred Hardy\nIn a large saucepan, add barley and cover with water by 2-inches and bring to a boil over high heat, then reduce heat as needed to maintain a simmer. Simmer barley, stirring occasionally, until the barley is tender, about 20 minutes. Drain and transfer cooked barley to a clean kitchen towel or a triple layer of heavy-duty paper towels; spread barley into an even layer to let cool, about 20 minutes. Transfer barley to a large bowl; set aside until ready to use.\nSerious Eats / Fred Hardy\nCarefully unwrap eggplant; trim and cut in half lengthwise. Cut one half of the eggplant into 1-inch cubes (reserve remaining half of eggplant for another use.) Add prepared eggplant to the bowl of a food processor. Add half of garbanzo beans, flour, baking powder, soy sauce, and Marmite. Process until a smooth paste forms, scraping down sides as needed, 1 to 2 minutes. Transfer mixture to bowl with cooked barley.\nSerious Eats / Fred Hardy\nAdd remaining chickpeas to the now-empty food processor and pulse until beans are chopped to about the size of a lentil, 6 to 10 pulses, scraping down sides as needed; transfer to bowl with barley mixture. Add cashews or pine nuts to the now-empty bowl of the food processor and pulse in short bursts until coarsely chopped and about the size of a lentil, about 30 pulses. Add to the barley mixture.\nSerious Eats / Fred Hardy\nAdd the cooled mushrooms to the now-empty bowl of the food processor and pulse until finely chopped but still coarse in texture, 8 to 10 short pulses. Add to the barley mix. Transfer leeks and celery to the now-empty food processor and process until finely chopped, 8 to 10 short pulses; add to the barley mixture.\nSerious Eats / Fred Hardy\nUsing bare hands or a spatula, stir together mixture until completely homogenous. Season with salt and pepper to taste. Mixture can be refrigerated and stored for up to 5 days at this point or frozen in an airtight freezer bag for up to 3 months.\nSerious Eats / Fred Hardy\nWhen ready to serve, add breadcrumbs to mixture and work them in with your hands. Shape a sample patty (about 6 ¼ ounces). It should have the texture of ground beef and hold together easily. If needed, add water 1 tablespoon at a time until it comes together. Divide mixture into eight 6 1/4 ounce (177g) patties that measure about 4 to 5-inches across and 1/2 to 3/4-inch thick. Patties must be cooked within 30 minutes of adding breadcrumbs (see note).\nSerious Eats / Fred Hardy\nTo Finish on a Griddle or in a Skillet:\nIn a large skillet for griddle pan, heat 3 tablespoons of oil over medium heat until shimmering. Add four patties and cook without moving until the bottom side is well-browned, 3 to 4 minutes. (I like to press a disk of sliced onion into the top side while it cooks.) Flip burgers and top with cheese, if using, and cook until the second side is browned and cheese is melted, 3 to 4 minutes. Transfer to a toasted bun and serve with condiments as desired. Repeat with remaining burgers.\nSerious Eats / Fred Hardy\nTo Finish on the Grill\n: Preheat a gas or charcoal grill with a medium-high fire. Clean and oil cooking grate. Cook the burgers, (covered if using a gas grill) without moving, until well-browned, about 4 minutes. Flip burgers, top with cheese, if using, and cook until the second side is well browned, about 4 minutes. Transfer to toasted buns. Serve.\nSerious Eats / Fred Hardy\nSpecial Equipment\nfood processor\nNotes\nFor best texture, the veggie burgers must be cooked within thirty minutes of adding bread crumbs or they will become mushy. To prepare in advance, combine all ingredients except for crumbs and mix in the crumbs just before forming the patties and serving.\nRead More\n2 Awesome Homemade Vegetarian Burgers Even a Carnivore Will Crave\nAmerican\nDairy-free Mains\nVegan Mains\nVegetarian Mains\nGrilling",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-vegan-burgers.webp?"
}