{
  "url": "https://www.seriouseats.com/homemade-limoncello-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Ro4H_01-eBiYirDydJxVXwq-qDI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__112911-181461-diyvsbuy-diylimoncello-17dd368dd38c4d3dadfc93abc4f41f9c.jpg",
  "tags": [
    "Cocktails",
    "Lemon"
  ],
  "title": "Easy Limoncello Recipe",
  "full_text": "Easy Limoncello Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nActive\n20 mins\nSteeping and Cooling Time\n373 hrs\nTotal\n373 hrs 25 mins\nServes\n18 servings\nMakes\n750 ml\nCook Mode\n(Keep screen awake)\nIngredients\n10\npesticide-free lemons\n(see note)\n375\nml\nhigh-proof neutral grain spirit\n(such as\nEverclear 151\n; see note)\n1 3/4\ncups\nwater\n1 1/4\ncups\nsugar\nDirections\nZest the lemons using a Microplane zester. Be sure to only grate the zest; Any white pith can turn your liqueur bitter. Reserve zested lemons for another use.\nPlace the zest in a sealable glass container, pour in the spirit, seal and shake. Let mixture steep in a cool, dark place for two weeks (see note).\nOnce your steeping period is over, bring the water and sugar to a boil in a small sauce pan. Remove from heat and let this simple syrup cool.\nPour cooled simple syrup into lemon steeping mixture, and let this new mixture set for 24 hours.\nFilter your limoncello twice: Place a coffee filter inside a funnel, then pour your steeped mixture through it into a bottle or bowl. Repeat (see note).\nOnce you've filtered limoncello into your final bottle, refrigerate it overnight. Store in the refrigerator or freezer and enjoy!\nSpecial Equipment\nMicroplane zester\n, funnel, coffee filters\nNotes\nWhile you can use any type of lemon you like, Meyer lemons will make a slightly darker (though more fragrant) limoncello. Smooth, thick skins are the best for zesting.\nYou can substitute 100- or 80-proof vodka for the high-proof neutral grain spirit. Using a spirit that is more than 151 proof will make for a harsh end result. Vodka will impart a little flavor of its own to the limoncello, so I've read that many people use a water filter pitcher (like Brita or Pur) to \"purify\" the vodka first. (The vodka \"flavor\" doesn't bother me, so I've never tried this myself.)\nTwo weeks is the recommended steeping time, but as little as one week will work. Longer steeping times lead to a more mellow flavor, so feel free to let it steep for up to three months.\nFiltering isn't just for appearance. Small particles can change the limoncello's flavor over time and may cause it to freeze if you choose to store your liqueur in the freezer.\nRead More\n5 Common Mistakes People Make With DIY Infusions\nFresh Lemon Syrup\nMeyer Lemon Ice Cream\nCocktails\nLemon"
}