{
  "url": "https://www.seriouseats.com/homemade-milk-duds-recipe",
  "image_url": "https://www.seriouseats.com/thmb/U5igiQdAmEUYxY9cE6SHfJNM-ow=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__10__20160929-milk-duds-vicky-wasik-1-3-43bb4b9316434bd6baa66e511d787be8.jpg",
  "tags": [
    "Candy",
    "Chocolate",
    "Easter"
  ],
  "title": "Homemade Milk Duds Recipe",
  "full_text": "Homemade Milk Duds Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n60 mins\nCooling and Standing Time\n2 hrs 15 mins\nTotal\n2 hrs 55 mins\nServes\n50 pieces\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Caramel:\n4\nounces\nwater\n(\n1/2\ncup\n;\n115\ng\n)\n8 1/2\nounces\nsugar\n(\n1 1/4\ncups\n;\n240\ng\n)\n3/4\nteaspoon\n(\n3\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or use the same weight\n6\nounces\nheavy cream\n(\n3/4\ncup\n;\n170\ng\n)\nFor the Chocolate Coating:\n8\nounces\nfinely chopped dark\nor\nmilk chocolate\n(\n1 1/3\ncups\n;\n225\ng\n), such as\nCallebaut\nor\nValrhona\n; do not use chips\nDirections\nFor the Caramel:\nNestle a large sheet of parchment paper into an 8-inch cake pan to roughly cover the bottom and sides. In a 2-quart stainless steel saucier, combine water, sugar, and salt over medium heat. Stir with a fork until sugar is fully dissolved and syrup comes to a rolling boil, about 4 minutes. Simmer, without stirring, until syrup is honey-gold, roughly 7 minutes. Immediately add cream and reduce heat to medium-low, adjusting the heat lower if needed to keep caramel from foaming too high. (This is more likely on an electric stove due to residual heat.) Stirring constantly with a heat-resistant spatula, simmer until caramel registers 260°F (127°C) on a digital thermometer, about 7 minutes. Immediately pour into prepared pan, cover tightly with foil, and cool to room temperature, about 2 hours.\nPeel caramel from parchment, transfer to a cutting board, and cut into 50 pieces (approximately 1/4 ounce or 7g each) with a sharp knife; don't worry about being too precise with their shape or size. If you like, use your fingers to mold the pieces into a more oval, Milk Dud–like shape.\nSerious Eats / Vicky Wasik\nFor the Chocolate Coating:\nLine a baking sheet with parchment. Temper chocolate according to one of the methods described\nhere\n. Fold all caramel pieces into tempered chocolate. With a clean hand, scoop up pieces like handfuls of marbles, then slide each one over your index finger with your thumb into your other hand (think of how you'd dole out a handful of M&M's) and arrange on prepared baking sheet. Let stand at room temperature until fully set, about 15 minutes, then transfer to an airtight container.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n8-inch\nanodized aluminum cake pan\n(round or square), 2-quart stainless steel\nsaucier\n,\nheat-resistant spatula\n,\ndigital thermometer with clip-on attachment\nNotes\nFor the most authentic flavor, choose a dark chocolate with 65 to 72% cocoa solids. Brands like Callebaut or Valrhona are easiest to temper, but any high-quality chocolate made with real cocoa butter will do.\nRead More\nHomemade Butterfingers\nChocolate-Coated Caramel Honeycomb With Salted Peanuts\nPastillas de Leche (Filipino Milk Candies)\nSmoked Salt Caramels\nBoozy Caramel Bonbons\nCandy\nChocolate\nEaster"
}