{
  "url": "https://www.seriouseats.com/homemade-fig-newtons-recipe",
  "image_url": "https://www.seriouseats.com/thmb/BBSKZ4lOjnPPnZx8W_KGsgrHc5I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__09__20170729-bravetart-fig-newtons-vicky-wasik-64-579fe777d89047afb4594b983d655600.jpg",
  "tags": [
    "Cookies",
    "Pastries",
    "Fig",
    "Christmas Cookies"
  ],
  "title": "Homemade Fig Newtons Recipe",
  "full_text": "Homemade Fig Newtons Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n20 mins\nActive\n60 mins\nResting Time\n7 hrs\nTotal\n7 hrs 50 mins\nServes\n32\nMakes\n32 pieces\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cakey Cookie Dough:\n10 1/2\nounces\nall-purpose flour\n, such as\nGold Medal\n, plus more for dusting (\n2 1/4\ncups\n, spooned;\n295\ng\n)\n5\nounces\nunsalted butter\n, soft but cool, about 65°F/18°C (\n1 1/4\nsticks\n;\n140\ng\n)\n4\nounces\nlight brown sugar\n, gently packed (\n1/2\ncup\n;\n110\ng\n)\n1/2 plus 1/8\nteaspoon\n(\n3.6\ng\n)\nbaking soda\n1/4\nteaspoon\n(\n1\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\nground cinnamon\n1\nounce\nhoney\n(about\n2\ntablespoons\n, ungreased;\n30\ng\n)\n1\nteaspoon\n(\n2\ng\n)\norange zest\n1/2\nounce\nfreshly squeezed orange juice\n(about\n1\ntablespoon\n;\n15\ng\n)\n3\nlarge\negg yolks\n, straight from the fridge (approximately\n1 1/2\nounces\n;\n40\ng\n)\nFor the No-Cook Fig Preserves:\n12\nounces\nplump, sticky dried Mission figs\n, stems trimmed (about\n2 1/2\ncups\n;\n340\ng\n)\n3 1/2\nounces\nsweetened\nor\nunsweetened applesauce\n(about\n1/3\ncup\n;\n100\ng\n)\n1\nounce\nfreshly squeezed orange juice\n(about\n2\ntablespoons\n;\n30\ng\n)\nDirections\nPrepare the Dough:\nCombine butter, brown sugar, baking soda, salt, cinnamon, honey, and orange zest in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed to moisten, then increase to medium and cream until light and fluffy, about 5 minutes. Add orange juice, then add the egg yolks one at a time and continue beating until smooth. Reduce the speed to low and sprinkle in the flour, mixing until well combined.\nSerious Eats / Vicky Wasik\nKnead the dough against the sides of the bowl to form a smooth ball. Flatten into a disc and wrap in plastic. Refrigerate until cool and firm but not hard, about 1 hour. (The dough can be refrigerated for up to 1 week; soften for 30 minutes at room temperature.)\nSerious Eats / Vicky Wasik\nPrepare the Preserves:\nCut the figs in half. Pulse with applesauce and orange juice in a food processor until roughly chopped, then process to a thick, smooth paste. Scrape the bowl and blade with a flexible spatula, then process a minute more to ensure absolutely no chunks remain. Transfer to a sturdy piping bag fitted with a 1/2-inch plain tip and set aside until needed, up to 24 hours. (The preserves can be refrigerated in an airtight container for up to 3 weeks; bring to room temperature before using.)\nSerious Eats / Vicky Wasik\nTo Assemble the Cookies:\nAdjust oven rack to middle position and preheat to 350°F (180°C). Knead the cool dough on a bare work surface until pliable and smooth, then dust with flour and roll into an 8-inch square. Sprinkle both sides with flour and roll into a 15-inch square. Slide an offset spatula under the dough to loosen it, brush off excess flour, and cut into four 3 1/4-inch strips.\nSerious Eats / Vicky Wasik\nHolding the bag at a 90-degree angle just above the surface of the dough (this will force the preserves to flatten as they leave the bag), pipe a 1-inch-wide strip down the center of each portion. Fold a long flap of dough over each strip, brush away excess flour, and roll each bar over, seam side down. Gently flatten each bar with your fingertips, then transfer to a parchment-lined half sheet pan (all 4 bars will fit on a single sheet).\nSerious Eats / Vicky Wasik\nBake until the bars are puffed and firm, without any significant browning, about 18 minutes. Immediately cut into 1-inch pieces with a bench scraper, then transfer to an airtight container, with a paper towel between each layer and on top. This will steam the cookies and retain moisture for them to reabsorb, creating a uniquely soft and cakey texture. Cover and “mature” for at least 6 hours before serving; prior to that, the cookies will taste dry. Store for up to 1 week at room temperature or up to a month in the fridge.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n, flexible spatula,\nfood processor\n,\nrolling pin\n,\noffset spatula\n,\nhalf-sheet pan\n, large pastry bag, 1/2-inch round tip\nNotes\nThis recipe works best with an all-purpose flour made from a blend of hard red and soft white wheat, such as bleached Gold Medal.\nRead More\nE.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies\nChocolate-Covered Digestive Biscuits (McVities)\nHomemade Oreo Cookies Recipe | BraveTart\nCookies\nPastries\nFig\nChristmas Cookies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-fig-newtons-recipe.webp?"
}