{
  "url": "https://www.seriouseats.com/homemade-italian-beef-sandwich",
  "image_url": "https://www.seriouseats.com/thmb/UGgv2xeTZOMtT4MQ6BwSqgobWz0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/homemade-italian-beef-sandwich-HERO-a2bb2df7804d47d5bc77be3f348c3932.JPG",
  "tags": [
    "Sandwiches",
    "Roasted Beef",
    "Beef"
  ],
  "title": "Homemade Italian Beef",
  "full_text": "Homemade Italian Beef\nClose\nJump to recipe\nCook\n5 hrs\nActive\n90 mins\nTotal\n5 hrs\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.4\nkg\n)\nbeef necks\n, or other inexpensive, meaty beef bones like\nbeef shin\n2\npounds\n(\n900\ng\n)\noxtails\n1\ntablespoon\n(\n15\nml\n)\nvegetable\n,\ncanola\n, or other\nneutral oil\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n225\ng\n), diced (about\n1\ncup\n)\n1\nlarge\ncarrot\n(\n6\nounces\n;\n170\ng\n), chopped (about\n3/4\ncup\n)\n4\nmedium\ncloves garlic\n, peeled and left whole\n2\nbay leaves\n10\nwhole\nblack peppercorns\n4\ncloves\nKosher salt\nand\nfreshly ground black pepper\n2\ngreen bell peppers\n8\nItalian rolls\n2\npounds\n(\n900\ng\n) very thinly\nsliced roast beef\n(see notes)\nGiardiniera\nfor serving, optional\nDirections\nTrim as much of the meat off the beef neck bones and oxtails as you easily can. Slice large pieces of meat into thin, 1/4-inch-wide strips. Add meat and bones to a rimmed baking sheet and roast, stirring every 10 minutes, until well browned, about 45 minutes total.\nSerious Eats / Qi Ai\nMeanwhile, in a large Dutch oven, heat oil over medium-high heat until shimmering. Add onion, carrot, and garlic, and cook, stirring often, until onion starts to brown, about 7 minutes. Set aside.\nSerious Eats / Qi Ai\nTransfer browned beef and bones to Dutch oven. pour off and discard any excess fat from the baking sheet, then set the baking sheet over medium heat, add 1 cup water, and bring to a simmer while scraping up any browned bits, then pour liquid into Dutch oven.\nSerious Eats / Qi Ai\nAdd enough additional water to almost cover the beef and bones (about 8 cups; 2L). Add bay leaves, peppercorns, and cloves. Bring to a simmer over medium-high heat, then reduce heat to maintain a very slow simmer. Cook, skimming off any foam that rises to the surface, until liquid reduces to 4 cups, 4 to 5 hours. If less than 4 cups, add water if needed to measure 4 cups total.\nSerious Eats / Qi Ai\nMeanwhile, adjust oven rack to lower-middle position and preheat to 450°F (230°C). Place green peppers in a cast-iron or oven-safe stainless-steel skillet. Transfer to the 450°F oven and cook, flipping every 10 minutes, until lightly blackened all over, about 40 minutes total. Carefully remove from the oven and set aside. When cool enough to handle, remove skin, stems, and seeds. Slice into 1/4-inch thick strips. Set aside.\nSerious Eats / Qi Ai\nusing a large spoon, skim off any excess fat from the surface of the broth then strain beef broth into a medium-sized saucepan, discarding the meat (or saving for another use), bones, and vegetables. Using an instant-read or probe thermometer, heat over medium-low heat until it reaches 140°F (60°C), then adjust heat as needed to maintain temperature. Season broth with salt and black pepper.\nSerious Eats / Qi Ai\nWrap the rolls in aluminum foil and place in the 450°F oven. Cook until hot, 8 to 10 minutes. Remove rolls from oven, but keep them wrapped.\nSerious Eats / Qi Ai\nDivide roast beef into 1/4-pound (113g) portions. Add one portion of roast beef to the broth one slice at a time, then slowly stir with a fork until all slices are warmed through, about 30 seconds. Unwrap one roll, and carefully slice horizontally most of the way through, making sure top and bottom are still attached. Use tongs or a fork to remove meat from the broth and stuff it in the roll. Top with some giardiniera, if using, and roasted peppers. Repeat with remaining beef and bread.\nSerious Eats / Qi Ai\nIf you want the sandwich dipped, use a pair of tongs to dip the finished sandwich back in the broth. Eat at once, with a lot of napkins close by.\nSerious Eats / Qi Ai\nNotes\nFor best results, use high quality freshly-sliced roast beef from the deli counter, and ask for it to be sliced as thinly as possible.\nSandwiches\nRoasted Beef\nBeef",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-italian-beef.webp?"
}