{
  "url": "https://www.seriouseats.com/homemade-baguettes-recipe-6755245",
  "image_url": "https://www.seriouseats.com/thmb/1zaAyK0pDdUhiIK-pvEDeC44lFc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221109-BAGUETTE-ANDREW-JANJIGIAN-90-hero-01-af123a1fb939461384c94269db629642.JPG",
  "tags": [
    "Yeast Breads",
    "The Latest"
  ],
  "title": "Homemade French Baguettes",
  "full_text": "Homemade French Baguettes\nClose\nJump to recipe\nPrep\n4 hrs\nCook\n20 mins\nProofing Time\n15 hrs\nTotal\n19 hrs 20 mins\nServes\n12\nto 15 servings\nMakes\n4 14- to 15-inch demi-baguettes\nCook Mode\n(Keep screen awake)\nIngredients\n56g (\n1/2\ncup\n) sifted\nwhole-wheat flou\nr (see note)\n465\ng\n(3 1/3 cups)\nhigh-protein all-purpose flour\n, such as King Arthur (see note)\n11\ng\n(4 teaspoons) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n4\ng\n(1 teaspoon)\ninstant yeast\n1\ng\n(heaping 1/4 teaspoon)\ndiastatic malt powder\n, optional (see note)\n375\ng\n(1 1/2 cups plus 1 tablespoon)\nwater\n, 75˚F (24°C)\nDirections\nIn a medium bowl, whisk together sifted whole wheat flour, all-purpose flour, salt, yeast, and diastatic malt (if using) until thoroughly combined, about 15 seconds. In another medium bowl, add water and half of the flour mixture and mix with a dough whisk or your hands until a thick batter forms, about 15 seconds. Add the remaining flour mixture and mix until a uniform dough forms and no dry flour remains, about 15 seconds. Cover bowl with a plate, and let rest at room temperature for 30 minutes.\nSerious Eats / Andrew Janjigian\nUsing lightly-moistened fingertips, fold dough over itself by gently lifting and folding edge of the dough toward center. Rotate bowl slightly and repeat folding until the dough is taut and you can no longer easily stretch the edge of the dough, 6 to 8 times total. Cover bowl with plate and let rest at room temperature until dough is puffy and expanded about 1 1/2 times from its original volume, 1 to 2 hours.\nSerious Eats / Andrew Janjigian\nTransfer dough to a lightly-oiled 13- by 9-inch cake pan, pressing gently until the dough fills as much of the pan as possible. Cover pan tightly with plastic wrap and refrigerate for 15 to 48 hours.\nSerious Eats / Andrew Janjigian\nLightly flour a work surface that’s at least twice as large as the pan, and flour top of dough lightly but evenly, until no longer sticky to the touch. Using a plastic dough scraper or stiff plastic spatula, release dough from sides of pan if necessary, then gently nudge dough onto work surface without stretching it beyond its current dimensions. Flour top of dough once more, lightly but evenly. Using a bench scraper, divide dough into 4 equal rectangles (about 225g or 8 ounces each). Using bench scraper, return two of the rectangles to the pan, separated by at least 1 inch. Cover pan tightly and refrigerate until ready to bake remaining two baguettes.\nSerious Eats / Andrew Janjigian\nUsing bench scraper, and dusting work surface with more flour as needed, separate remaining two rectangles by at least one inch and cover loosely with a clean plastic trash bag (or a clean cake pan). Let rest at room temperature until dough warms up to just cool to the touch (between 50˚ and 55˚F), 30 to 60 minutes.\nSerious Eats / Andrew Janjigian\nMeanwhile, using a spray bottle, lightly mist back side of couche with water. Center couche, misted side down, over a rimmed (or rimless) baking sheet, roll overhanging sections up to meet edges of pan, and, using a fine mesh sieve, dust exposed area of couche liberally and evenly with flour.\nSerious Eats / Andrew Janjigian\nFlour an area of the work surface away from where you are working and slide one piece of dough onto floured surface. Position the remaining piece of dough so that the short side is facing you, then gently fold into thirds like a business letter. Rotate dough 90 degrees and repeat folding into thirds to form a log about 4- by 3-inches. Move log back to floured area and then repeat with other dough. Cover logs loosely with plastic bag (or a cake pan) and let rest for 20 minutes.\nSerious Eats / Andrew Janjigian\nSerious Eats / Andrew Janjigian\nOn a lightly floured surface, position one piece of dough with the long edge facing you. Using a slightly cupped hand, gently compress dough into a 6- by 4-inch rectangle. Fold top third of dough toward center and press gently using fingertips to seal seam. Rotate dough 180 degrees, and repeat folding to form a rectangle with a slight crease along the center where seams overlap. (If at any point dough begins to stick to counter, flour an area adjacent to your work area and briefly place dough on floured area to eliminate stickiness.)\nSerious Eats / Andrew Janjigian\nPlace the thumb of your non-dominant hand at end of the seam to anchor dough in place, then fold the dough in half over your thumb, sealing the dough with the heel of your hand and moving your thumb as you work your way from one end of loaf to the other. (Do not seal ends of loaf.)\nSerious Eats / Andrew Janjigian\nCup one hand over center of loaf, and roll it gently forward and back 3 or 4 times, compressing the center slightly.\nSerious Eats / Andrew Janjigian\nUsing both hands, starting at center of loaf and working outward toward ends, gently roll dough into an even, 13- to 14-inch long cylinder. You may need to repeat rolling from center to ends 2 to 5 times to achieve the desired length. Do not seal ends of loaf until it is fully elongated.\nSerious Eats / Andrew Janjigian\nMoving hands forward and back in opposite directions, roll ends of loaf under palms to form defined points. (The finished loaf should be about 14 inches long.)\nSerious Eats / Andrew Janjigian\nTransfer dough to floured couche, seam side up. Form edges of couche into pleats along either side of loaf, fold remaining flaps of couche over loaf, and then cover couche with loosely with a second clean plastic garbage bag. Repeat steps 8 through 12 with the remaining dough piece.\nSerious Eats / Andrew Janjigian\nFold loose ends of couche over loaves, then cover baking sheet completely with plastic bag. Fold ends of bag loosely under sheet to enclose. Let loaves rest at room temperature until about 1-1/2 times in volume and dough springs back slowly when poked gently with fingertip, 45 minutes to 1 hour 15 minutes.\nSerious Eats / Andrew Janjigian\nMeanwhile, adjust oven rack to the middle position, place baking stone directly on rack, and preheat oven to 500°F (260°C). On a work surface, place a 20- by 18-inch sheet of aluminum foil and center a 16- by 12-inch sheet of parchment on top. Remove plastic bag from couche and unfold couche to separate loaves. Using a transfer peel, gently roll first loaf away from second one, inverting it seam side down. Place transfer peel alongside inner edge of first loaf at a 45-degree angle to couche. With other hand, lift opposite end of couche and use it to invert loaf, seam side up, onto transfer peel. Gently invert loaf onto parchment-lined foil, seam side down, centered lengthwise and about 2 inches from long edge of parchment. Use transfer peel and your other hand to straighten loaf if needed. Repeat with second loaf, leaving 3 inches of space between loaves.\nSerious Eats / Andrew Janjigian\nHolding lame concave side up, with handle oriented at a 30-degree angle to loaf, make a 1/8-inch deep slash along centerline of loaf, using a single, swift motion from one end to the other. Repeat with second loaf.\nSerious Eats / Andrew Janjigian\nInvert a disposable aluminum 17- by 13-inch roasting pan over edges of parchment, then crimp overhanging foil tightly around edges of pan to seal it close. Carefully slide pizza peel (or rimless baking sheet) under foil packet and transfer to baking stone. Bake for 10 minutes.\nSerious Eats / Andrew Janjigian\nUsing pizza peel, transfer packet to a wire rack. Using tongs or hands, carefully peel back one corner of foil and allow excess steam to escape. Uncrimp remaining foil and remove roasting pan.\nSerious Eats / Andrew Janjigian\nUsing pizza peel, return loaves to baking stone (discarding parchment-lined foil), separated by at least 2 inches. Bake loaves, rotating them back to front after 5 minutes, until deep golden brown, 8 to 12 minutes total.\nSerious Eats / Andrew Janjigian\nTransfer loaves to wire rack and let loaves cool for at least 15 minutes before serving. Repeat steps 5 to 19 to proof and bake remaining two baguettes.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nKitchen scale, water mister bottle, linen couche, transfer peel, rimless cookie sheet or rimmed baking sheet, clean plastic garbage bag, parchment paper, wide pizza peel (or second rimless cookie sheet), baking stone, lame, disposable aluminum 17- by 13-inch roasting pan, wire rack, dough whisk\nNotes\nFor best results, weigh the flours and water for this recipe.\nFor sifted whole wheat flour, sift whole wheat flour through a standard fine-mesh strainer to remove most of the larger particles of gluten-degrading bran it contains. You can discard the bran in the strainer or save for another use.\nIf a high-protein all-purpose flour like King Arthur is unavailable, use bread flour instead.\nDiastatic malt powder is an enzyme used to promote browning in cold fermented doughs. It can be sourced from bakery supply stores\nonline\n. Be sure to get diastatic malt powder; sweeteners like malt sugar, malt syrup, and malted milk powder are not appropriate substitutes.\nMake-Ahead and Storage\nBaguettes are best consumed within 4 hours of baking.\nYeast Breads\nThe Latest"
}