{
  "url": "https://www.seriouseats.com/homemade-yakimochi-grilled-mochi-recipe-7229918",
  "image_url": "https://www.seriouseats.com/thmb/hTF2CUVqqoFVsu29X-T2N5alkdo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230308-SEA-Mochi-AmandaSuarez-hero-b53c7cafa06f414e938463f7ba1710fd.JPG",
  "tags": [
    "The Latest",
    "White Rice",
    "Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Rice & Grain Mains"
  ],
  "title": "Homemade Yakimochi (Grilled Mochi With Soy Sauce and Nori)",
  "full_text": "Homemade Yakimochi (Grilled Mochi With Soy Sauce and Nori)\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n90 mins\nDrying Time:\n24 hrs\nTotal\n27 hrs 30 mins\nServes\n6\nto 8 servings\nMakes\n14\nto 16 mochi\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Mochi:\n2 1/4\ncups\nsweet glutinous rice\n, such as\nmochigome\n(\n14 1/3\noz\n;\n405\ng\n)\n2 1/4\ncups\n(\n540\nml\n)\nwater\nPotato starch\n, as needed\nFor the Sauce and to Serve:\n1/2\ncup\n(\n120\nml\n)\nmirin\n1/2\ncup\n(\n120\nml\n)\ncold water\n1/4\ncup\n(\n60\nml\n)\nlight soy sauce\n(Usukuchi shoyu)\n1/4\ncup\ngranulated sugar\n(\n1 3/4\nounces\n;\n50\ng\n)\n1\ntablespoon\n(\n12\ng\n)\npotato starch\n2\nfull-sized\nnori sheets\n, cut into 2-inch by 7-inch strips (optional)\nDirections\nFor the Mochi:\nIn the bowl of a rice cooker, combine rice and water. Cook rice according to rice cooker settings for “white rice,” until grains are cooked through and translucent, about 45 minutes.\nSerious Eats / Amanda Suarez\nIn a large pot, bring 3 quarts of water to a boil. Pour 4 cups of the boiling water into the bowl of a stand mixer, then pour out the water (this warms up the bowl and helps to maintain the heat of the rice as it’s beaten.) Keep the remaining boiling water in the pot with a rigid silicone spatula in it (this keeps the spatula warm and moist for scraping down the sides of the bowl). Immediately transfer rice to the warmed stand mixer bowl and, using a dough hook, mix on medium speed until the rice forms a coarse paste, about 2 minutes. Stop stand mixer and, using the hot spatula, scrape down rice to the center. Continue mixing until paste is smoother, about 1 minute longer.\nSerious Eats / Amanda Suarez\nSwitch to paddle attachment, scraping any excess paste off the dough hook. Mix on medium speed until paste is smooth with minimal visible grains, 3 to 5 minutes, stopping to scrape sides down with the hot spatula, until the dough is pliable. (There will still be some graininess; that is okay.)\nSerious Eats / Amanda Suarez\nUsing a fine-mesh strainer, dust a  9- by 13- inch rimmed baking sheet or baking dish liberally with potato starch. Scrape dough onto prepared pan and dust the top of the dough liberally with additional potato starch. Using clean, dry hands, press dough to edges of the pan, smoothing and leveling the dough until it is about 1/2 inch thick and the surface is flat. Place dough in freezer and chill until edges release easily from the pan and the dough is firm but not frozen, about 1 hour.\nSerious Eats / Amanda Suarez\nTransfer dough to a large cutting board. Using a sharp knife, cut dough into 2- by 3-inch rectangles (you should have 14 to 16 portions); wipe the knife down with a wet paper towel between cuts to keep the edges of the mochi clean. Arrange mochi on a wire rack and let dry at room temperature, flipping mochi once after 12 hours, until the surface is firm and no longer sticky, 24 hours.\nSerious Eats / Amanda Suarez\nFor the Sauce and to Serve:\nIn a medium saucepan, whisk together mirin, water, soy sauce, sugar, and potato starch. Place saucepan over medium heat, bring mixture to boil, and cook, stirring occasionally, until bubbling subsides and the mixture is thickened, glossy, and coats the back of a spoon, 4 to 6 minutes. Transfer mixture to a heatproof bowl and cool to room temperature. Set glaze aside until needed.\nSerious Eats / Amanda Suarez\nLine a rimmed baking sheet with foil. Using a dry pastry brush, brush excess potato starch from the surface of mochi. Place the portioned mochi on the prepared baking sheet. Using a blowtorch, toast the tops and sides of the mochi until it begins to puff up and blister all over. Flip and repeat until all the mochi have been evenly torched. (A lightly charred or blistered appearance is okay.) Alternatively, hold the mochi on a rimmed baking sheet about 4 to 6 inches under a broiler element until puffed and blistered all over, then flip and repeat on other side (it will be more difficult to brown the mochi evenly all over with a broiler, so a blowtorch is preferable).\nSerious Eats / Amanda Suarez\nTransfer cooked mochi to a wire rack, and brush each portion with sauce to coat. If desired, wrap each piece of mochi with nori and place seam-side down. Serve right away.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRice cooker, stand mixer, pastry brush, blowtorch or broiler, wire rack\nNotes\nThe mochi may blow out and burst while it’s being torched. This is normal—continue to evenly torch the mochi.\nDo not use non-glutinous rice, since the resulting dough will not be as cohesive or chewy.\nMake-Ahead and Storage\nDried mochi can be kept in a single layer in a zipperlock bag and frozen for up to 2 weeks.\nThe Latest\nWhite Rice\nSnacks & Appetizers\nVegetarian Snacks & Appetizers\nRice & Grain Mains"
}