{
  "url": "https://www.seriouseats.com/homemade-diy-pudding-pop-ice-cream-popsicle-bravetart-recipe",
  "image_url": "https://www.seriouseats.com/thmb/1fGBzp7uj3iAMxjStu1JOZl1Emo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160714-vanilla-pudding-pops-vicky-wasik-18-f2433aa1471046119153c8ec7b7bc4c4.jpg",
  "tags": [
    "Popsicles",
    "Chocolate",
    "Custards, Mousses & Puddings",
    "Memorial Day"
  ],
  "title": "DIY Pudding Pops",
  "full_text": "DIY Pudding Pops\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n30 mins\nFreezing Time\n4 hrs 35 mins\nTotal\n5 hrs 15 mins\nServes\n10 popsicles\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pudding:\n18\nounces\nmilk\n, any percentage will do (\n2 1/4\ncups\n;\n510\ng\n), divided\n6\nounces\nheavy cream\n(\n3/4\ncup\n;\n170\ng\n)\n1\nvanilla bean\n, split and scraped, pod and seeds reserved separately (see note for instructions on using vanilla extract)\n7\nounces\nsugar\n(\n1\ncup\n;\n195\ng\n)\n1\nounce\ntapioca starch\n(\n1/4\ncup\n;\n28\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\n3\nlarge\neggs\n1/2\nounce\nrum\n, or your favorite liquor (\n1\ntablespoon\n;\n15\ng\n) (omit if using vanilla extract; see note)\nFor the Chocolate Shell (optional):\n8\nounces\ndark or\nmilk chocolate\n(\n1 1/2\ncups\n;\n225\ng\n), finely chopped\n2\nounces\ncoconut oil\n(\n1/4\ncup\n;\n55\ng\n), refined or virgin (see note)\nSprinkles\n, crushed peanuts, cocoa nibs, or other crunchy bits, to taste (optional)\nDirections\nFor the Pudding:\nBring 10 ounces milk (1 1/4 cups; 280g), cream, and vanilla pod to a simmer over medium heat in a 3-quart stainless steel saucepan or saucier. Once the dairy begins to bubble, remove from heat, cover, and steep 30 minutes.\nMeanwhile, blend together vanilla seeds, sugar, tapioca starch, and salt until well combined, then whisk in eggs. Remove vanilla pod from dairy and discard, then pour into egg mixture, whisking all the while.\nReturn to saucepan and cook over medium heat, whisking constantly but not vigorously, until thick and just beginning to bubble. Immediately pour through a fine-mesh strainer into a quart-size measuring cup, then stir in remaining milk and rum (see note). Divide evenly between 10 three-fluid-ounce popsicle molds and freeze until just beginning to firm, about 30 minutes. Insert popsicle sticks and continue freezing until completely solid, about 4 hours. To unmold, place molds in hot tap water for a few seconds and jiggle sticks to release. Wrap individually in plastic and freeze up to 3 weeks, or arrange on a parchment-lined baking sheet and freeze while you prepare the chocolate shell.\nSerious Eats / Vicky Wasik\nFor the Chocolate Shell (optional):\nMicrowave chopped chocolate with a few 15-second bursts, stirring well between each round, until fluid and warm. Stir in coconut oil with a flexible spatula and transfer to the smallest possible measuring cup or drinking glass that can accommodate a popsicle. Dip popsicles one by one, letting the excess run off. If you like, dip in sprinkles or other crunchy coating before chocolate starts to set. Return to baking sheet and freeze to ensure chocolate coating is completely hard, about 5 minutes. Transfer to individual sandwich bags and freeze up to 1 month.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel\nsaucier\n,\nwhisk\n,\nfine-mesh strainer\n, quart-size\nmeasuring cup\n,\npopsicle molds\n, popsicle sticks\nNotes\nIf using vanilla extract in place of a vanilla pod, whisk together the milk and cream in step 1, but skip the steeping process and go directly to step 2 (omit the vanilla seeds in step 2). Substitute 1 tablespoon (15ml) vanilla extract for the rum in step 3. I love the tropical accent that virgin coconut oil lends to the crispy chocolate shell, but if you'd prefer to focus on pure chocolate, use refined coconut oil instead.\nMake-Ahead and Storage\nPlain pudding pops can be wrapped individually in plastic and frozen for up to 3 weeks.\nChocolate-coated pudding pops can be transferred to individual sandwich bags and frozen for up to 1 month.\nRead More\nDIY Fudgsicles Recipe\nVirgin Piña Colada Popsicles Recipe\nHomemade Strawberry Shortcake Ice Cream Bars Recipe\nBlueberry Yogurt Popsicles Recipe\nPopsicles\nChocolate\nCustards, Mousses & Puddings\nMemorial Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-pudding-pops.webp?"
}