{
  "url": "https://www.seriouseats.com/homemade-fermented-sauerkraut-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ivuOMJbAyuDwok2Hgu7McMLfmPo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__12__20161212-sauerkraut-vicky-wasik-15-f1aed1537b38466dad1aba8e2e458401.jpg",
  "tags": [
    "Pickling",
    "Fermentation",
    "Cabbage",
    "Vegetable Sides",
    "Fall Sides"
  ],
  "title": "Homemade Sauerkraut",
  "full_text": "Homemade Sauerkraut\nClose\nJump to recipe\nPrep\n35 mins\nActive\n60 mins\nFermenting Time\n507 hrs 30 mins\nTotal\n508 hrs 5 mins\nServes\n48 servings\nMakes\n1 1/2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmall head\ngreen cabbage\n(about\n3\npounds\n;\n1.4\nkg\n), trimmed, cored, and shredded, outer leaves reserved (see notes)\n28\ng\nsalt\n(\n3\ntablespoons\nif using\nDiamond Crystal kosher salt\n; if using other brands, measure by weight), plus more as needed (see notes)\n1\nteaspoon\n(\n4\ng\n)\ncaraway seeds\nor\njuniper berries\n(optional; see notes)\nDirections\nIf using a large fermentation crock, add shredded cabbage to crock, sprinkling in the measured salt and optional spices as you go. If using a Ball jar, put shredded cabbage in a large mixing bowl and sprinkle with measured salt and optional spices. Mix well, then knead and squeeze cabbage for a few minutes to begin to release its liquid.\nSerious Eats / Vicky Wasik\nCovering cabbage between kneadings with plastic wrap or the crock's lid, continue to squeeze and knead cabbage roughly every 15 minutes, until an ample amount of brine has formed; it should be enough to cover the cabbage when the cabbage is compressed. This can take up to 4 hours. If not enough brine forms, proceed to the next step (you will add more brine later as necessary). If using Ball jar, pack shredded cabbage into jar now, with all its accumulated brine.\nLay reserved cabbage leaves on top of cabbage and press down until brine rises 1/2 to 1 inch above cabbage. Add stone or glass weights and push down to compress even more. If there is not enough brine, top it up with a 2% salt solution. (You can make this by dissolving 2 grams of salt in 100 grams of water; 1 cup of water would require about 1 heaping teaspoon of Diamond Crystal kosher salt.)\nSeal fermentation crock or Ball jar with airlock lid following manufacturer's instructions. Put in a cool, dark place; 65 to 70°F (18 to 21°C) is ideal. After a day or two (or three), the fermentation process should kick off more actively and the cabbage should be bubbling away. If the vessel is quite full, it's best to put a rimmed baking sheet under it to catch any overflowing fluids.\nAfter the first week, feel free to open vessel, push cabbage back down below brine level (it's very important that the cabbage always remain below the liquid level), and taste cabbage to monitor its progress. If brine gets low, top it up with more 2% salt water. Keep in mind that the more often you open the vessel, the greater the chance of mold growing on the surface. If mold does grow on the surface, carefully scrape it off and continue to ferment the kraut.\nThe sauerkraut is ready when it is quite sour, which can take anywhere from 3 to 6 weeks, depending on your preference. Throw out the sauerkraut if it becomes discolored, slimy, or malodorous. (Some sulfurous smell is natural, but anything truly offensive is a bad sign.) Refrigerate in sealed containers for up to 6 months.\nSpecial Equipment\nKitchen scale\n, gram scale (optional but recommended),\n5-liter fermentation crock\nwith stone weights or half-gallon glass Ball jars with Easy Fermenter lids (or other airlock lid system) and glass fermentation weights,\nrimmed baking sheet\nNotes\nThe quantity of cabbage called for here will fit well in a half-gallon Ball jar, but you can easily fit nine pounds of cabbage (or more) in the larger, five-liter crock. You can also make more kraut and pack it into multiple Ball jars.\nMore important than the specific quantities in this recipe is an understanding of the ratio of salt to cabbage by weight, which makes it easy to scale up or down. You're looking for a 2% salt ratio, which means 2 grams of salt for every 100 grams of cabbage. To calculate this, weigh your cabbage in grams, then multiply its weight by 0.02. The result will be the amount of salt you need in grams.\nCaraway will give you a more German-style kraut, while juniper will give you a more Alsatian style. You can also omit the spices.\nRead More\nThe Science of Lactic Acid Fermentation: Pickles, Kraut, Kimchi, and More\nHow to Make Fermented Hot Sauce\nEssential Tools for Fermentation at Home\nChoucroute Garnie à l'Alsacienne (Alsatian Braised Sauerkraut) Recipe\nGrilled Bratwurst With Beer, Mustard, and Sauerkraut Recipe\nPickling\nFermentation\nCabbage\nVegetable Sides\nFall Sides"
}