{
  "url": "https://www.seriouseats.com/homemade-tater-tots",
  "image_url": null,
  "tags": [
    "Sides",
    "Roasted Potatoes",
    "Russet Potatoes"
  ],
  "title": "Homemade Tater Tots",
  "full_text": "Homemade Tater Tots\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nActive\n30 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nrusset potatoes\n, peeled and cut into rough 1-inch chunks\n2\nquarts\npeanut\n,\nvegetable\n, or\ncanola oil\n2\nteaspoons\nkosher salt\n1\ntablespoon\ncornstarch\nor\npotato starch\n1/2\nteaspoon\nsugar\nFreshly ground black pepper\nDirections\nPlace potatoes in a bowl of cold water and agitate for 10 seconds. Transfer to a fine-mesh strainer and allow to drain for 5 minutes. Meanwhile, heat oil in large wok or Dutch oven over high heat to 350°F (177°C). Fry potatoes, stirring them with a wire spider until light golden brown and tender, 6 to 8 minutes, adjusting flame to maintain oil temperature. Transfer to a paper towel-lined bowl and allow to cool for 10 minutes. Reduce heat to low.\nVicky Wasik\nTransfer 1/4 of the potatoes to the bowl of a food processor and pulse until broken down into rough 1/4- to-1/8 inch pieces, about 8 one-second pulses. Transfer to a mixing bowl and repeat with the remaining potatoes, working in 3 more batches.\nVicky Wasik\nAdd salt, starch, sugar, black pepper to taste, and any flavorings if desired. Gently mix with your hands to combine. Shape into cylinders about 3/4-inch wide and 1-inch long.\nVicky Wasik\nReheat oil to 350°F and add Tater Tots. Allow to fry for 1 minute, then gently agitate with a metal spider to separate them. Continue to cook, adjusting flame to maintain heat, until golden brown and crisp, about 4 minutes longer. Transfer to a paper towel-lined plate to drain. Season immediately with salt. Serve hot.\nVicky Wasik\nSpecial Equipment\nFood processor\n,\nwok\nor\nDutch oven\nfor deep-frying\nMake Ahead and Storage\nTo freeze the Tots, follow the recipe through step 3. In step 4, remove them from the fryer after 1 1/2 minutes and drain on a paper towel-lined plate. Transfer to a sheet tray or large plate in a single layer and place in freezer for at least one hour. Transfer the frozen tots to a zipper-lock freezer bag and store for up to three months.\nNotes\nThese are some of our favorite tried and tested flavor variations.\nPepperoni Pizza Tots:\nTo the basic Tater Tots recipe, add a tablespoon of minced fresh oregano, 2 ounces of grated mozzarella cheese, and 2 ounces of finely chopped pepperoni. Fry as directed.\nChorizo Tots:\nAdd 3 ounces of finely diced Spanish-style dry-cured chorizo. Serve dusted with smoked paprika, a lemon wedge, and mayonnaise, preferably\nhomemade\n. These were probably my favorite variation.\nBuffalo Tots:\nAdd 2 to 3 ounces of finely crumbled blue cheese to the potato mixture before frying. Toss the fried Tots with Buffalo sauce and serve with extra blue cheese, if you'd like.\nTwice-Baked Potater Tots:\nAdd 6 slices of cooked, finely crumbled bacon and 2 ounces of grated cheddar cheese to the basic Tot recipe. Serve with sour cream and chives (or scallions).\nSpicy Breakfast Tots:\nAdd a couple ounces of finely chopped cooked breakfast sausage along with 1/4 to 1/2 of a jalapeño pepper, finely chopped (ribs and seeds removed). I like these with a bit of maple syrup drizzled on top.\nSweet Potater Tots:\nFollow directions for regular tots, substituting sweet potatoes for regular potatoes. The Tots will come out slightly darker and not quite as crisp. Unfortunately, that's the nature of the beast with sweet potatoes.\nSides\nRoasted Potatoes\nRusset Potatoes"
}