{
  "url": "https://www.seriouseats.com/homemade-rhubarb-bitters-for-cocktails-recipe",
  "image_url": "https://www.seriouseats.com/thmb/kz62z4_DxaGTUYBB3l_U9XdP7hE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__diyvsbuy-rhubarbbitters-aae8625a11fd4cccb72e6f303f2c2498.jpg",
  "tags": [
    "Vodka",
    "Rhubarb"
  ],
  "title": "DIY Rhubarb Bitters",
  "full_text": "DIY Rhubarb Bitters\nClose\nJump to recipe\nPrep\n15 mins\nCook\n7 mins\nActive\n20 mins\nSteeping and Cooling Time\n384 hrs 30 mins\nTotal\n384 hrs 52 mins\nServes\n480 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nchopped rhubarb\n(red/pink stalks only, about\n1\npound\n)\n1\ntablespoon\nzest\nfrom\n1\nwhole\nlime\n1\ntablespoon\nzest\nfrom\n1\nwhole\nlemon\n1 1/4\ncups\n100-proof vodka\n1/4\nteaspoon\nwhole coriander seeds\n3\njuniper berries\n1\nteaspoon\nfennel seeds\n1/2\nteaspoon\ndried lavender\n1\nteaspoon\ndried chamomile\n1/2\nteaspoon\ncut cinchona bark\n(not powdered, see note)\n1\nteaspoon\ncut angelica root\n(see note)\n1/2\ncup\nlight rum\n1/2\ncup\nwater\nDirections\nAdd rhubarb, lime zest, and lemon zest to a quart-sized jar. Add the vodka, seal, shake, and let sit for four days.\nAfter four days, add coriander, juniper, fennel, lavender, chamomile, cinchona, angelica, and rum in second quart-sized jar. Seal, shake, and set both aside for 10 more days.\nAfter 10 days, strain the solids out of each jar, reserving the solids and liquids separately. Combine the strained solids with the water in a small saucepan and set aside. Combine the strained liquids in a single jar and set aside. Heat the solids and the water over medium heat until simmering, 5 to 7 minutes. Remove from heat and let cool. Transfer to jar with liquids. Seal, shake, and set aside for another two days.\nStrain through sieve, pushing down to extract as much liquid as you can. Then bottle by filtering through a coffee filter or cheesecloth. Store at room temperature for up to a year.\nSpecial Equipment\nTwo sealable glass jars, fine-mesh strainer, zester or peeler, coffee filter or cheesecloth\nNotes\nRhubarb leaves are poisonous and should not be used for any recipes. Only use the pinkish-red stalks. If you cannot find high-proof vodka, substitute 80-proof vodka. You can use 151-proof neutral spirits, if available to you. Cinchona bark and angelica root are often available at herb shops or Latin markets. You can also\nbuy them online\n. Cinchona bark can also be used to make other bitters or\nhomemade tonic\n. You can substitute all one bittering herb, if you only have one available to you.\nVodka\nRhubarb"
}