{
  "url": "https://www.seriouseats.com/homemade-pistachio-baklava-recipe-8742422",
  "image_url": "https://www.seriouseats.com/thmb/_9J8JsDfX5RQu2-J96o7M5sMLWY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230712-SEA-PistachioBaklava-MaiKakish-hero-blue-6d2cb4dbdc53446f8b33ad6a2e3f6f8a.jpg",
  "tags": [
    "Pistachios",
    "Desserts",
    "Turkish"
  ],
  "title": "Pistachio Baklava",
  "full_text": "Pistachio Baklava\nClose\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nTotal\n65 mins\nMakes\n24 pieces\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Simple Syrup:\n2 cups\ngranulated sugar\n(14 ounces;\n400\ng\n)\n1 cup (\n240\nml\n)\nwater\n1 teaspoons (\n5\nml\n)\nfresh lemon juice\n1/2\nteaspoon\norange blossom water\nFor the Baklava:\n2 1/2 cups shelled raw unsalted\npistachios\n(12 1/2 ounces;\n354\ng\n)\n8\nounces\nunsalted butter\n(2 sticks; 226g), melted\n2 tablespoons\ngranulated sugar\n(1 ounce;\n30\ng\n)\n1 pound\nphyllo dough\n(16 ounces;\n454\ng\n), thawed\nDirections\nFor the Simple Syrup:\nIn a small pot, combine 2 cups granulated sugar with 1 cup (240ml) water and bring to a boil over medium-high heat. Reduce heat to medium, add the lemon juice, and simmer, stirring occasionally, until the sugar has dissolved and the syrup starts to thicken, about 6 minutes. Stir in the orange blossom syrup and set aside to cool to room temperature.\nSerious Eats / Mai Kakish\nFor the Pistachio Baklava:\nIn a food processor, pulse pistachios until finely chopped; the pistachios should still have texture to them but not be too coarse. Remove 1/4 cup of the pistachios and set aside for garnishing the baklava.\nSerious Eats / Mai Kakish\nAdjust oven rack to bottom position and preheat oven to 375ºF (190ºC). Using scissors or a pizza cutter, trim the phyllo dough to 9- by 13-inches (see notes). Place the phyllo pastry beneath a damp towel to prevent the dough from drying out while you construct the baklava.\nSerious Eats / Mai Kakish\nTo Assemble:\nUsing a pastry brush, grease the bottom and sides of a 9- by 13-inch baking dish with butter. Lay 2 sheets of phyllo dough into the dish, then brush with melted butter. Repeat this step for every 2 sheets of pastry until you have 8 sheets of phyllo dough. Gently press down to ensure the layers stick to one another. Sprinkle crushed pistachios in an even layer on top of the phyllo, along with 2 tablespoons granulated sugar, leaving a 1/4-inch border around the edges. Continue to layer with the remaining phyllo, brushing every 2 sheets of pastry with butter.\nSerious Eats / Mai Kakish\nOnce you have buttered the last layer of pastry, use a sharp knife to portion the baklava into 24 squares. Pour the remaining butter over the top of the cut pastry (if the butter has solidified, re-melt it before pouring).\nSerious Eats / Mai Kakish\nTransfer baklava to bottom rack of the oven and bake until the top just begins to brown, about 35 minutes (see notes). Remove baklava from the oven and run a sharp knife around the portioned squares to reinforce the previously made cuts. Pour the cooled simple syrup over the baklava. (How much syrup you choose to pour over the baklava will depend on personal preference; for a sweeter baklava, use all of the syrup.)\nSerious Eats / Mai Kakish\nTop each piece of baklava with a sprinkle of the reserved pistachios. Allow the baklava to cool for at least 1 hour before covering or serving, though for the best flavor and texture it should rest for at least 4 hours and up to overnight before serving.\nSerious Eats / Mai Kakish\nSpecial Equipment\nFood processor, 9- by 13-inch baking dish, pastry brush\nNotes\nTo trim the phyllo dough, place it on a cutting board and, using a sharp knife, cut the block of phyllo dough into a 9- by 13-inch rectangle.\nTo add more color to your baklava, broil it for just a few seconds until golden brown.\nTo avoid soggy baklava, make sure the simple syrup has cooled completely before pouring it onto the baklava and that the baklava has cooled completely before covering with foil.\nMake-Ahead and Storage\nThe simple syrup can be refrigerated in an airtight container for up to 2 months.\nBaklava tastes best after it has rested for 4 to 6 hours (or, ideally, overnight), when the pastry has had a chance to absorb the syrup and the flavors are more pronounced.\nCooled baklava can be kept in an airtight container at room temperature for up to 5 days. After that, it can be refrigerated for up to 2 weeks.\nPistachios\nDesserts\nTurkish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pistachio-baklava.webp?"
}