{
  "url": "https://www.seriouseats.com/homebrewing-belgian-tripel-recipe",
  "image_url": "https://www.seriouseats.com/thmb/bx1Ze23Upauqc1jv_RZm-DI6nUw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110409-146480-Homebrewing-Belgian-Tripel-15ee6f20c96f4efab7a9ae6227140f45.jpg",
  "tags": [
    "Beer",
    "Belgian"
  ],
  "title": "Belgian Tripel (For Beginning Homebrewers) Recipe",
  "full_text": "Belgian Tripel (For Beginning Homebrewers) Recipe\nClose\nJump to recipe\nPrep\n50 mins\nCook\n75 mins\nActive\n4 hrs\nFermentation Time:\n672 hrs\nTotal\n674 hrs 5 mins\nCook Mode\n(Keep screen awake)\nIngredients\n9 pounds Pilsner malt extract\n1 pound light Belgian candy sugar\n1 pound Carapils malt, crushed\n2 ounces Hallertau hops - 60 minutes\n6 gallons of tap water, split\n2 Liter starter of liquid Belgian Ale yeast (Whitelabs WLP500 or Wyeast 1214)\nDirections\nIf possible, place 3 gallons in the refrigerator to cool in a sanitized container.\nTie the Carapils malt in a large mesh grain bag or hop bag. Place the bag in 3 gallons of water in a 5-gallon pot and immerse the grain.\nBegin to heat, making sure mesh bag isn’t sitting directly on the bottom of the pot. Remove the grain bag when the temperature reaches 170°F (77°C).\nBring wort to a vigorous boil. As water is heating, slowly add 2 pounds of Pilsner liquid malt extract, stirring constantly until completely dissolved. When the boil begins, add 2 ounces Hallertau hops in a mesh bag.\nAfter 45 minutes of boiling has passed, add remaining 7 pounds of Pilsner liquid malt extract and 1 pound of Belgian candy sugar, stirring constantly until completely dissolved.\nAfter a total of 60 minutes of boil, remove from heat.\nWarning:\nAfter wort cools below 180°F (82°C) everything that touches it should be sanitary, and exposure to open air should be limited as much as possible.\nCool wort by placing pot in ice bath until it is below 85°F (29°C). Transfer to sanitized fermentor (either a carboy or a fermentation bucket). Top off to make 5 gallons using refrigerated water.\nUse a sanitized auto-siphon racking cane to remove enough wort to take a gravity reading with your hydrometer. Make a note of this number, since you will be using it to calculate the actual alcohol content when it's done fermenting. The reading should be around 1.075.\nCarefully pour yeast into cooled wort (it should be below 70°F/21°C), and agitate vigorously. Cover fermentor with a sanitized stopper and airlock. Ferment in dark place, keeping ambient temperature consistent, preferably between 68 and 70°F.\nAfter primary fermentation is complete (take at least two consistent gravity readings), transfer to a secondary carboy for conditioning and store as cool as possible.\nBottle after another four to six weeks using enough priming sugar for a high level of carbonation\naccording to these instructions.\nSpecial Equipment\n5 gallon glass carboy in addition to\nbasic homebrewing equipment setup\nRead More\nA Beginner's Guide to Belgian Beer Styles\nBeer\nBelgian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/belgian-tripel-for-beginning-homebrewers-recipe.webp?"
}