{
  "url": "https://www.seriouseats.com/homemade-peanut-bugger-cup-eggs-recipe",
  "image_url": "https://www.seriouseats.com/thmb/SkEDw2B2cT50opq8m5ipU-m77gY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__03__20140401-288097-GFTues-PBEggsRecipes-8d7a9f1ece844029a329ff4f0fc6cf78.jpg",
  "tags": [
    "Candy",
    "Chocolate",
    "Peanut Butter",
    "Easter"
  ],
  "title": "Homemade Peanut Butter Cup Eggs Recipe",
  "full_text": "Homemade Peanut Butter Cup Eggs Recipe\nClose\nJump to recipe\nPrep\n25 mins\nActive\n2 hrs\nChilling Time\n48 hrs 10 mins\nTotal\n48 hrs 35 mins\nMakes\n12 chocolate eggs\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\ncreamy peanut butter\n(see note)\n1\ncup sifted\nconfectioners sugar\n2\ntablespoons\nbutter\n, melted (use coconut oil if dairy-free)\n1\npound\nchocolate\n,\ntempered\nor candy coating (see note)\nDirections\nIn a small bowl, stir together peanut butter and confectioner's sugar until smooth. Add melted butter. Stir until incorporated. Cover bowl. Chill for two days.\nLine a baking sheet with parchment paper. Place tempered chocolate (or melted confectionery coating, see note) into a pastry bag fitted with a small piping tip, or a disposable plastic bag with the end snipped off. Fill each egg cavity about 2/3 of the way with chocolate.\nSerious Eats / Elizabeth Barbone\nTurn mold over onto prepared baking sheet. Shake and rotate the mold. The melted chocolate should coat each cavity. After shaking out the excess chocolate, inspect each cavity. If there are any bare spots, dot a little melted chocolate onto them with either a small brush or your finger.\nQuickly sweep a metal spatula across the mold. This clears excess chocolate from the edges of the mold. After you do this, the mold might look smeared with chocolate. That’s fine. The thin chocolate breaks easily away from the finished eggs.\nAllow the chocolate to set up. Don’t refrigerate.\nSerious Eats / Elizabeth Barbone\nFill each cavity with peanut butter filling until it's about 1/8th-inch below the edge of the mold. Amount varies depending on the size of your mold.\nSerious Eats / Elizabeth Barbone\nCap each mold with melted chocolate. Use a zig zag or circular pattern to close each cavity. When the cavity is almost closed, stop. Tap the mold gently. The chocolate should flow a little and close the mold. If it doesn't, pipe a little extra chocolate into the mold to close.\nSerious Eats / Elizabeth Barbone\nChill for about 10 minutes. Invert mold. Tap gently. Eggs should come out easily. If they don't, the chocolate might not be set. Return to the refrigerator for a further 15 minutes and try again until they all come out cleanly. Set peanut butter eggs on a wire rack set in a rimmed baking sheet and drizzle with more chocolate if desired. Finished eggs can be stored in a sealed container at room temperature for up to 2 weeks.\nSerious Eats / Elizabeth Barbone\nSpecial Equipment\nEgg-shaped candy mold, pastry bag and small piping tip (optional),\nmetal spatula\nMake-Ahead and Storage\nFinished eggs can be stored in a sealed container at room temperature for up to 2 weeks.\nNotes\nBe sure to select commercial peanut butter for this recipe. Natural peanut butter, which just contains peanuts and sometimes salt and sugar, makes a filling that's too runny.\nSelect either dark, milk, or white chocolate. If you don't want to temper your chocolate, use a high-quality confectionery coating. If you plan to use confectionery coating, here's how to melt it: Place confectionery coating in a microwave-safe bowl (I recommend a glass 2-cup measure.) Heat the coating for 30 seconds. Remove the cup from the microwave and stir. Repeat this process, removing the coatings every 30 seconds from the microwave and stirring, until fully melted.\nRead More\nPeanut Butter Cup Pie\nChocolate Peanut Butter Cup Ice Cream\nCookie Dough-Filled Reese's Cups\nA Love Letter to Ohio's Chocolaty, Peanut Buttery Buckeye Candy\nChocolate Coconut Nests with Jelly Bean Eggs\nCandy\nChocolate\nPeanut Butter\nEaster"
}