{
  "url": "https://www.seriouseats.com/homemade-cherry-bitters-angostura-substitute-recipe",
  "image_url": "https://www.seriouseats.com/thmb/aTArjHBstH_2ruXwXDBS8Szf0Xo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__01__cherry-bitters-b0195c6b2ebe47cb870666d2d0b5a3d8.jpg",
  "tags": [
    "Cocktails",
    "Cherry"
  ],
  "title": "DIY Cherry Bitters Recipe",
  "full_text": "DIY Cherry Bitters Recipe\nClose\nJump to recipe\nPrep\n15 mins\nActive\n10 mins\nInfusing Time\n504 hrs\nTotal\n504 hrs 15 mins\nServes\n360 servings\nMakes\n1 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\ncherries\nor\n3/4\ncup\ndried cherries\n1\ncup\n151-proof neutral grain spirit\n, divided\n1\nwhole\nstar anise\n, crushed\n1\nteaspoon\nfennel seeds\n1\ntablespoon\nlemongrass\n, cut in small pieces\n1\nvanilla bean\n, split and scraped\n2\ncardamom\npods\n, crushed\n1\nteaspoon\ngentian root\n1\nteaspoon\nquassia chips\n1\ncup\nrye whiskey\nDirections\nPut the cherries in a sealable glass jar with 1/2 cup of the neutral grain spirit. Be sure this jar is large enough to later hold an additional 1 1/2 cups of liquid. Shake. This is your cherry flavoring.\nPut the anise, fennel, lemongrass, vanilla, and cardamom in a different sealable glass jar with remaining 1/2 cup of the 151 neutral grain spirit. Shake. This is your spice mix.\nPut the gentian root and quassia chips in a sealable glass jar with the rye. Shake. This is your bittering mix. Set all jars aside in a dark place at room temperature.\nAfter 10 days, strain the spice mix and bittering mix through a fine-mesh sieve to remove the solids. Strain again through coffee filter into the cherry flavoring jar. Do not remove cherries. Shake. You now have one jar that contains the strained spice mix and bittering mix along with steeping cherries and alcohol. Let this steep for an additional 11 days.\nStrain out cherries through a fine-mesh sieve, and then strain the rest through coffee filter into your desired container. Store at room temperature for up to one year.\nSpecial Equipment\n3 mason jars, fine-mesh sieve, coffee filters\nNotes\nGentian root and quassia chips can usually be found at specialty herb stores. You can also order them from\nLhasa Karnak\n.\nI used Everclear 151 for my neutral spirits base. If you cannot find this in your area, you can substitute the highest proof vodka available to you.\nCocktails\nCherry"
}