{
  "url": "https://www.seriouseats.com/homemade-nutella",
  "image_url": "https://www.seriouseats.com/thmb/XzIqFTl4EFCkJDG-_INIXtBIqNw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190523-chocolate-hazelnut-spread-thin-version-vicky-wasik-4-46ddb9ce151e4490af5e84726662c46b.jpg",
  "tags": [
    "Dairy-free Desserts",
    "Gluten-free Desserts",
    "Vegan Desserts",
    "Stovetop",
    "Chocolate"
  ],
  "title": "Homemade Nutella (Creamy Chocolate-Hazelnut Spread) Recipe",
  "full_text": "Homemade Nutella (Creamy Chocolate-Hazelnut Spread) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\nAbout 25 mins\nCooling Time\n60 mins\nTotal\n95 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n3\nounces\nwater\n(about\n6\ntablespoons\n;\n85\ng\n)\n4\nounces\ngolden syrup\nor\ncorn syrup\n(about\n1/3\ncup\n;\n115\ng\n)\n5 1/4\nounces\nsugar\n(about\n3/4\ncup\n;\n150\ng\n)\nShy\n3/4\nteaspoon\n(\n2.5\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n9\nounces\nhazelnuts\n, toasted, skinned, and roughly chopped (about\n2\nshy\ncups\n;\n255\ng\n)\nShy\n1/2\nteaspoon\nbaking soda\n1/2\nounce\ncocoa powder, preferably\nDutch-process\n(about\n2\nheaping\ntablespoons\n;\n15\ng\n)\n4\nounces\ndark chocolate\n, roughly 60% cacao solids\n(about\n2/3\ncup\n, finely chopped;\n115\ng\n), melted\n1/2\nounce\nroasted-hazelnut oil\nor\nneutral oil\n(about\n1\nshy\ntablespoon\n;\n15\ng\n)\n4\nounces\nwater\n(about\n1/2\ncup\n;\n115\ng\n)\nDirections\nTo Make the Brittle:\nLightly grease a half-sheet pan and set aside. Combine water, golden syrup or corn syrup, sugar, salt, and prepared hazelnuts in a 3-quart saucier over medium heat. Scrape and stir with a heat-resistant spatula until sugar has dissolved and the candy begins to bubble around the edges, about 5 minutes. If this takes substantially more or less time, this is simply an indication that the heat level needs adjustment due to equipment variation.\nSerious Eats / Vicky Wasik\nContinue cooking and stirring until the candy darkens to a tawny amber or foxy brown, registering between 320 and 340°F (160 and 171°C) on a clip-on digital thermometer, about 10 to 12 minutes more depending on the desired temperature. (The risk of error is high with handheld thermometer styles, so be sure to use a clip-on.) For more delicate caramel notes and a cleaner hazelnut flavor, stop at the low end of that range; for a bolder, bittersweet flavor, aim for the higher end of the range.\nSerious Eats / Vicky Wasik\nRemove from heat, then immediately stir in baking soda, folding with the heat-resistant spatula until the candy is evenly foamy, then pour onto prepared sheet pan. Cool to room temperature, then proceed immediately to the next step. If the candy is allowed to sit out for extended periods of time after cooling, it will turn tacky and soft. Alternatively, wrap the cooled candy tightly in plastic and store in an airtight container for up to 1 week at cool room temperature or for several months in the fridge or freezer.\nSerious Eats / Vicky Wasik\nTo Make the Chocolate-Hazelnut Spread:\nBreak the brittle into pieces and transfer to the bowl of a food processor. Pulse several times to pulverize the candy, then let food processor run continuously until the brittle transforms into a thick, peanut butter–like paste. This typically takes between 3 and 5 minutes, but that range can vary substantially depending on the size and power of the machine.\nSerious Eats / Vicky Wasik\nAdd cocoa powder and process until well distributed. With the machine still running, pour in melted chocolate, along with roasted-hazelnut oil. Scrape the blade and bowl, particularly around the bottom and in the corners, then continue processing until homogeneous and relatively smooth.\nSerious Eats / Vicky Wasik\nPulse food processor while drizzling in remaining water in a steady stream. Process only as needed to incorporate the water and create a smooth and silky spread, as over-processing can break the emulsion. Transfer to an airtight container and store up to 1 month at cool room temperature or several months in the fridge. As is, the spread can be used over toast,\ncrepes\n, and\nwaffles\n; as a thin layer of cake or cupcake filling; as a filling for a fresh-fruit tart; or as a fudgy\nice cream swirl\n, among other uses.\nSerious Eats / Vicky Wasik\nTroubleshooting:\nWhile adding water in the last step, excess processing may break the emulsion. Should this happen, additional water can be pulsed in as needed to restore the emulsion. This will salvage the spread and prevent waste, but its softer consistency and higher water content may make it unsuitable for some applications.\nSpecial Equipment\n3-quart stainless steel saucier\n,\nheat-resistant spatula\n,\nclip-on digital thermometer\n,\nhalf-sheet pan\n,\nfood processor\nMake-Ahead and Storage\nThe prepared brittle can be wrapped tightly in plastic, then sealed in an airtight container, where it will keep at cool room temperature for about 1 week or for several months in the fridge or freezer.\nRead More\nCrispy Homemade Nutella (Chocolate-Hazelnut Spread) Recipe\nFrom Napoleon to Nutella: The Birth of the Chocolate- Hazelnut Spread\nFlourless Nutella Chocolate Torte Recipe\nOvernight Chocolate-Hazelnut Breakfast Buns Recipe\nBrie and Nutella Grilled Cheese Recipe\nSpeculoos (Biscoff Cookie Butter) Recipe\nDairy-free Desserts\nGluten-free Desserts\nVegan Desserts\nStovetop\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-nutella-creamy-chocolate-hazelnut-spread-recipe.webp?"
}