{
  "url": "https://www.seriouseats.com/homemade-chipwiches",
  "image_url": null,
  "tags": [
    "American",
    "Baking",
    "Chocolate",
    "Cookies",
    "Dessert Bars"
  ],
  "title": "Homemade Chipwiches Recipe",
  "full_text": "Homemade Chipwiches Recipe\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n45 mins\nFreezing Time\n60 mins\nTotal\n100 mins\nServes\n10 ice cream sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookies:\n4\nounces\nunsalted butter\n, softened to about 65°F or 18°C (about\n8\ntablespoons\n;\n115\ng\n)\n4 1/2\nounces\nlight brown sugar\n(about\n1/2\ncup\n, firmly packed;\n125\ng\n)\n1/2\nounce\nmalted milk powder\n, such as\nCarnation\nor\nHoosier Hill Farms\n(about\n2\ntablespoons\n;\n14\ng\n)\n1\nteaspoon\n(\n4\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n3/4\nteaspoon\nbaking soda\nPinch\nnutmeg\n6 1/2\nounces\nall-purpose flour\n, such as\nGold Medal\n(about\n1 1/2\ncups\nminus\n1\ntablespoon\n;\n185\ng\n)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\n4\nounces\nmilk\n, any percentage will do (about\n1/2\ncup\n;\n115\ng\n)\n2\nounces\nbittersweet mini chocolate chips\n, (about\n1/4\ncup\n;\n55\ng\n), plus more for garnishing\nFor the Filling:\n1\nrecipe\nhomemade Klondike bar filling\n, prepared and frozen as directed. Or\n1\nrecipe\nfior di latte gelato\n(eggless). Or about\n1\nquart\nof\ncommercial vanilla ice cream\nAdditional mini chips\n, as needed\nDirections\nMake the Dough:\nAdjust oven rack to middle position and preheat to 350°F (180°C). Combine butter, brown sugar, malted milk powder, salt, baking soda, and nutmeg in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase to medium and beat until light and fluffy, about 5 minutes. Pause to scrape the bowl and beater with a flexible spatula, then resume beating on medium-low.\nAdd the flour all at once, followed by the vanilla, then drizzle in the milk to form a soft dough. Scrape the bowl with a flexible spatula, and continue mixing for a few seconds more. Off the mixer, fold the dough a few times from the bottom up to ensure there are no streaks of unmixed dough, then stir in the mini chips.\nSerious Eats / Vicky Wasik\nPortion the Dough and Bake:\nWith a cookie scoop, divide dough into 2-tablespoon portions, and arrange on a parchment-lined half sheet pan, leaving at least 2 inches between each cookie to account for spread. With moistened fingers, gently press each portion into a flat disc, about 1/2 inch thick, and sprinkle a few extra mini chips on top. Bake until the cookies are puffed and lightly golden all over, but still a little soft, about 18 minutes. Cool to room temperature, then transfer to an airtight container and freeze until needed.\nSerious Eats / Vicky Wasik\nForm the Sandwiches:\nPour reserved mini chips into a small dish. If using the Klondike-style, no-churn filling, cut into rounds with a cookie cutter approximately 1/4 inch smaller than the chocolate chip cookies. If using fior di latte gelato, scoop into approximately 1/4-cup portions. Sandwich the portioned ice cream between two frozen cookies, then roll the exposed edges in mini chips to coat. Freeze in an airtight container at least 1 hour. Serve, or wrap each in plastic and return to the airtight container to freeze up to 1 month.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n,\n2-tablespoon cookie scoop\n,\nhalf-sheet pans\n,\nnested cookie cutters\nor\nice cream scoop\nNotes\nThe yield of this recipe will vary, depending on how well the dough is aerated during the creaming process and the exact size of the cookie scoop, so consider the listed yield an approximation.\nRead More\nVanilla Ice Cream Sandwiches\nOatmeal Cream Sandwiches\nBanana Peanut Butter Ice Cream Sandwiches\nAmerican\nBaking\nChocolate\nCookies\nDessert Bars"
}