{
  "url": "https://www.seriouseats.com/homemade-pistachio-paste",
  "image_url": null,
  "tags": [
    "Pistachios",
    "Dairy-free Desserts",
    "Nuts & Seeds"
  ],
  "title": "Homemade Pistachio Paste Recipe",
  "full_text": "Homemade Pistachio Paste Recipe\nJump to recipe\nPrep\n15 mins\nActive\n5 mins\nTotal\n15 mins\nServes\n16 servings\nMakes\n2 heaping cups\nCook Mode\n(Keep screen awake)\nIngredients\n9\nounces\nwhole, raw pistachios\n, blanched and peeled; see note (about\n2\ncups\n;\n255\ng\n)\n10\nounces\npowdered sugar\n, preferably organic; more information\nhere\n(about\n2 1/2\ncups\n;\n280\ng\n)\n1/2\nteaspoon\n(\n2\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\norange flower water\n, such as Cortas\n2\nounces\nroasted pistachio oil\n, such as La Tourangelle (shy\n1/3\ncup\n;\n55\ng\n)\n2\nounces\nwater\n, optional (\n1/4\ncup\n;\n55\ng\n)\nDirections\nIn the bowl of a food processor, grind the blanched pistachios to form a smooth but slightly oily mass. The timing of this step can vary depending on the type, freshness, and moisture content of the pistachios, along with the size and power of the food processor. Fresher, wetter pistachios may only require 5 minutes of processing, while older, drier, or toasted pistachios may require 10 minutes or more.\nSerious Eats / Vicky Wasik\nOnce a smooth, oily paste has formed, add powdered sugar, salt, and orange flower water and continue processing until smooth and thick. With the machine still running, drizzle in oil and process until silky and pale. At this stage, the pistachio paste can be seasoned with additional salt to taste, if needed.\nSerious Eats / Vicky Wasik\nWhile warm, pistachio paste will be creamy and soft, but it will thicken into a sliceable, dough-like mass when cooled to room temperature. This is the ideal consistency to use as a stand-in for almond paste or marzipan. However, if a more spreadable consistency is desired, along the line of peanut butter, continue running the food processor and drizzle in 2 ounces (1/4 cup; 55g) water.\nSpecial Equipment\nFood processor\nNotes\nThis recipe works well with any style of pistachio, but it is vital that the nuts are blanched and peeled. For more information, see our\nguide to blanching and peeling pistachios\n.\nIf a deeper, toasted flavor is desired, as with our\ntriple pistachio buns\n, the peeled pistachios can be toasted prior to making the paste. To do this, toss the nuts with a splash of pistachio oil, spread onto a parchment-lined half sheet pan, and bake at 200°F (90°C), until the nuts are firm to the touch and rather hard, with a golden hue just beginning to develop here and there, about 3 hours.\nAs toasting will develop a strong yellow color in the nuts, a drop of light blue gel paste, such as Americolor, can be used to neutralize the warm undertones and bring out a cooler, green profile in the paste.\nMake-Ahead and Storage\nIn a non-reactive, airtight container, the pistachio paste can be stored at room temperature for a week, or held in the refrigerator for one month. If using as a stand-in for commercial almond paste, bring to room temperature before use. When freshly made, the pistachio paste will have a relatively light green color, but will naturally darken to a deep olive shade over time.\nRead More\nPistachio Frosting\nPistachio Cake\nFrom-Scratch Real Pistachio Ice Cream\nPistachio Gelato with Strawberry Sauce\nWhite Sesame Pistachio Crunch Ice Cream\nPistachios\nDairy-free Desserts\nNuts & Seeds"
}