{
  "url": "https://www.seriouseats.com/homemade-strawberry-rhubarb-pop-tarts-recipe-11724499",
  "image_url": "https://www.seriouseats.com/thmb/70v1p9WHBzf_E_hZVfJTEGiJADU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250423-SEA-StrawberryRhubarbPopTarts-VictorProtasio-Beauty-38-f01007537205402c96b2f04541f30328.jpg",
  "tags": [
    "Pastries",
    "The Latest",
    "Recipes",
    "Pies",
    "American"
  ],
  "title": "Homemade Strawberry Pop-Tarts Recipe: Your ’90s Breakfast Upgraded",
  "full_text": "Homemade Strawberry Pop-Tarts Recipe: Your ’90s Breakfast Upgraded\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n50 mins\nChilling and Cooling Time:\n5 hrs 45 mins\nTotal\n8 hrs 35 mins\nServes\n9\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n12\nounces\nchopped fresh\nrhubarb\n(\n340\ng\n; about\n2 2/3\ncups\n), from\n4\nlarge\nstalks\n6\nounces\ngranulated\nsugar\n(\n170\ng\n; about\n3/4\ncup\nplus\n1 1/2\ntablespoons\n)\n1\nteaspoon\nvanilla paste\n(see notes)\n1/2\nteaspoon\ngrated\norange zest\nfrom\n1\nmedium\norange\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n3/4\nounces\n(\n21\ng\n)\nfreeze-dried strawberries\n, finely ground (about 1/4 cup), see notes\nFor the Dough:\n9\nounces\nall-purpose flour\n(\n255\ng\n;\n2\ncups\n)\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n7\nounces\ncold unsalted butter\n(\n198\ng\n;\n14\ntablespoons\n), cubed\n5 1/4\nounces\nlight\ncorn syrup\n(\n149\ng\n;\n7\ntablespoons\n)\nFor the Icing:\n1\nlarge\negg white\n(see notes)\n6\nounces\npowdered sugar\n(\n170\ng\n;\n1 1/2\ncups\n), plus more as needed\n2\nteaspoons\n(\n10\ng\n) fresh\nlemon juice\n, from\n1\nsmall\nlemon\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nvanilla extract\n1\ndrop\npink gel food coloring\n(optional)\nFreeze-dried strawberries\n(see notes)\nDirections\nFor the Filling:\nIn a medium saucepan, combine rhubarb and sugar. Cook over medium-low, stirring occasionally, until sugar has dissolved, about 5 minutes. Increase heat to medium, and bring to a boil. Cook, stirring occasionally, until rhubarb thickens to a gel-like consistency, about 15 minutes. Remove from heat, and stir in vanilla paste, orange zest, and salt. Using a fine-mesh strainer, sift freeze-dried strawberry powder into rhubarb mixture, discarding any seeds and solids in the strainer. Stir until combined. Using an immersion blender, blend mixture in saucepan until smooth, 1 to 2 minutes, taking care to break up any clumps of strawberry powder. (The mixture should be a very thick and sticky paste.) Spread filling into a shallow dish; set aside to cool to room temperature, about 30 minutes; chill in the refrigerator until cold, about 30 minutes.\nSerious Eats / Victor Protasio\nFor the Dough:\nWhile filling chills, in a food processor, pulse flour and salt until combined, 2 to 3 pulses. Add butter, and pulse until mixture resembles coarse meal, about 15 pulses. Add corn syrup, and pulse until mixture begins to clump together into a crumbly dough, about 10 pulses.\nSerious Eats / Victor Protasio\nPlace dough onto a clean work surface, and gently press once or twice until dough holds together. Divide dough into 2 even portions (about 10 1/2 ounces; 297 grams each). Shape each portion into a 1-inch-thick square, and wrap tightly in plastic wrap. Refrigerate until firm, at least 1 hour or up to 2 days.\nSerious Eats / Victor Protasio\nTo Assemble:\nLine two 13- by 18-inch rimmed baking sheets with parchment paper; set aside. On a generously floured surface, unwrap and roll 1 dough portion into a roughly 10- x 13-inch rectangle (between 1/8- to 1/4-inch thick), making sure to frequently lift and turn dough to prevent sticking, dusting underneath as needed. Using a sharp knife, trim edges to form a 9- x 12-inch rectangle; discard trim or reserve for another use (see notes). Cut dough into nine 3- by 4-inch rectangles. Place rectangles on prepared baking sheet, and freeze, uncovered, until firm, about 10 minutes.\nSerious Eats / Victor Protasio\nUnwrap 2nd dough portion, and repeat rolling and cutting process to create another nine 3- by 4-inch rectangles. Place rectangles on second parchment-lined baking sheet. Using a cake tester or wooden skewer, prick dough at about 3/4-inch intervals. Chill, uncovered, in the refrigerator while working with first portion of dough.\nSerious Eats / Victor Protasio\nRemove unpricked dough rectangles from freezer. Working directly on the baking sheet, use a small offset spatula to spread about 1 1/2 tablespoons strawberry-rhubarb filling onto each rectangle, leaving a 1/4-inch border around the edges. (You should have about 1 tablespoon filling leftover; cover, chill, and reserve for the icing.) Using a pastry brush, very lightly brush edges of each rectangle with water.\nSerious Eats / Victor Protasio\nRemove pricked dough rectangles from refrigerator. Carefully place 1 pricked rectangle over each filled rectangle, taking care to match up the edges, and gently press out any air bubbles. Using your fingers, press edges to seal. Trim edges, if desired. Repeat process with remaining filled rectangles and pricked rectangles. Loosely cover with plastic wrap, and freeze tarts until firm, about 15 minutes. Adjust oven rack to middle position, and preheat oven to 300°F (150°C).\nSerious Eats / Victor Protasio\nBake tarts until tops are slightly puffed, dry, set to the touch, and edges are very lightly golden, 28 to 30 minutes. Let cool completely on baking sheet, about 45 minutes.\nSerious Eats / Victor Protasio\nFor the Icing\n: In a large bowl, whisk egg white and reserved 1 tablespoon filling until frothy. Gradually whisk in sugar until smooth, followed by the lemon juice, salt, vanilla, and food coloring, if using. If necessary, add more confectioners' sugar, 1 tablespoon at a time, or water, 1 teaspoon at a time, until icing falls off the whisk in thick ribbons and takes 10 seconds to disappear back into the bowl. (See notes if you prefer not to use raw egg whites.)\nSerious Eats / Victor Protasio\nUsing a pastry brush, brush icing over tops of cooled tarts. Garnish with crushed freeze-dried strawberries. Let stand at room temperature, uncovered, until icing is set, at least 4 hours or up to 24 hours. Store tarts in an airtight container at room temperature for up to 1 week.\nSerious Eats / Victor Protasio\nSpecial Equipment\nMedium saucepan, fine-mesh strainer, food processor, 13- by 18-inch rimmed baking sheet, parchment paper, cake tester, whisk, rolling pin, pastry brush\nNotes\nFeel free to substitute with an equal amount of vanilla extract if you don’t have vanilla paste.\nFreeze-dried strawberries can be finely ground in a mortar and pestle, food processor, or spice grinder. Alternatively, freeze-dried strawberries can be placed in a zip-top bag and crushed with a rolling pin or wine bottle until finely ground.\nIf you are concerned about the raw egg whites in the icing, you can use store-bought pasteurized eggs or cook the icing to 150°F (66°C) over a water bath, and hold it there for three minutes.\nOur senior editor Genevieve recommends saving the pastry scraps, cutting them into cookies, then brushing with butter and sprinkling with cinnamon-sugar and baking at 300°F (150°C) until golden brown.\nThe pastries can be served at room temperature or warm. To heat, toast in an oven or toaster oven at 300°F until warmed through, about 10 minutes.\nMake-Ahead and Storage\nDough can be made ahead and stored for 2 days in refrigerator or frozen for up to 3 months. Filling can be stored for up to 2 days in the refrigerator.\nAssembled, unbaked pastries can be frozen for up to 2 months.\nStore fully baked and iced tarts in an airtight container at room temperature for up to 1 week.\nPastries\nThe Latest\nRecipes\nPies\nAmerican",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-strawberry-pop-tarts-recipe-your-90s-breakfast-upgraded.webp?"
}