{
  "url": "https://www.seriouseats.com/homemade-lady-fingers",
  "image_url": "https://www.seriouseats.com/thmb/_9u33FUA2XqPUu_OuTQSZ4KsJU8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__06__20170523-ladyfingers-vicky-wasik-17-e30565f46eaf450db221e7c3cfa0787c.jpg",
  "tags": [
    "Italian",
    "Pastries",
    "Cakes",
    "Christmas Cookies"
  ],
  "title": "One-Bowl Homemade Ladyfingers Recipe",
  "full_text": "One-Bowl Homemade Ladyfingers Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nActive\n30 mins\nTotal\n55 mins\nServes\n30 ladyfingers\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\neggs\n(about\n5 1/2\nounces\n;\n155\ng\n)\n4 3/4\nounces\nsugar\n(about\n2/3\ncup\n;\n135\ng\n)\n1/4\nteaspoon\n(\n1\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nounce\nfreshly grated lemon zest\n(about\n1\ntablespoon\n;\n7\ng\n) from\n1\nlarge\nlemon\n, optional\n4 1/2\nounces\nall-purpose flour\n(about\n1\ncup\n, spooned;\n125\ng\n)\n1/2\nounce\ncornstarch\n(about\n2\ntablespoons\n;\n15\ng\n)\nPowdered sugar\n, for dusting\nDirections\nGetting Ready:\nAdjust oven rack to middle position and preheat to 350°F (175°C). Line two half sheet pans with parchment and fit a large piping bag with a 1/2-inch round tip.\nRoll bag open and stand upright in a tall drinking glass so it can be filled hands-free\n. Have ready a small, fine-mesh sieve of powdered sugar for dusting. Fill a 2- or 3-quart saucier with a few inches of water; bring to a boil, then lower heat and adjust to maintain a steady supply of steam.\nFor the Ladyfingers:\nCombine eggs, sugar, and salt in the bowl of a stand mixer, using a flexible spatula to stir. Place over the steaming pot (if it touches the bottom, crumple a strip of foil into a ring to act as a booster seat) and cook, stirring and scraping constantly, until warmed to 160°F (70°C). This should not take significantly longer than 5 minutes; major delays simply indicate insufficient heat/lack of steam.\nSerious Eats / Vicky Wasik\nTransfer to a stand mixer fitted with a whisk attachment. Whip on high speed until the eggs are foamy, more than quadrupled in size, and thick enough to briefly mound up like soft serve when dropped from the whisk, from 5 to 10 minutes depending on the horsepower of your mixer. This is a crucial stage; if the foam is unable to hold soft peaks, the lady fingers will spread flat in the oven.\nSerious Eats / Vicky Wasik\nWhen eggs are foamy and thick enough to briefly hold their shape when dropped from the whisk, add lemon zest, if using, then sift the flour and cornstarch on top. Fold gently with a flexible spatula to combine in a thick batter. Transfer to prepared piping bag, twist to close, and pipe approximately thirty 3- by 1-inch fingers, leaving an inch between each one. When piping, hold the bag at a 45° angle and apply steady pressure as you pipe, then stop squeezing before you reach the end of each one, and lift the bag straight up to break the \"tail\" of batter.\nSerious Eats / Vicky Wasik\nGenerously dust one tray with powdered sugar, and bake until puffed and firm to the touch, about 12 minutes. Set aside, then dust and bake the second tray as before. Cool ladyfingers to room temperature directly on the sheet pan, then transfer to an airtight container as soon as possible. If allowed to sit out after they have cooled, they will begin softening in the air. Use immediately, or store up to 3 weeks at room temperature.\nSpecial Equipment\n2 half sheet pans\n, large piping bag, 1/2-inch round tip,\nfine-mesh strainer\n,\n3-quart stainless steel saucier\n,\nstand mixer\n,\nflexible spatula\nNotes\nMost ovens don't have perfectly even heat, so it's best to bake the ladyfingers one tray at a time. It may seem faster to try and bake both trays at once, but the benefits aren't worth the risk when it comes to these delicate sponge cakes.\nMake-Ahead and Storage\nUse immediately, or store up to 3 weeks in an airtight container at room temperature.\nRead More\nEasy Chocolate Tiramisu\nMango Icebox Cake\nCranberry Trifle\nMixed Berry Trifle\nItalian\nPastries\nCakes\nChristmas Cookies"
}