{
  "url": "https://www.seriouseats.com/homemade-falernum-for-tiki-drinks-almond-clove-lime-syrup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/F7t9e9o5kHtsyHScsQZTnGm6Nrk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210611_Falernum_LizClayman-seriouseats-14-02e8617187094ef89e86d059bf1cd517.jpg",
  "tags": [
    "Rum"
  ],
  "title": "DIY Falernum Recipe",
  "full_text": "DIY Falernum Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n20 mins\nInfusing Time\n84 hrs\nTotal\n84 hrs 35 mins\nServes\n16 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1/3\ncup\nsliced, raw almonds\n30\nwhole\ncloves\n1/2\ncup\nlight rum\n8\nlimes\n2/3\ncup\nwater\n1/2\ncup\nsugar\nDirections\nPreheat oven to 400°F (200°C) and toast almonds on a rimmed baking sheet until slightly darkened and fragrant, about 5 minutes. Be careful not to let them burn. Let cool before using.\nSerious Eats / Liz Clayman\nPlace almonds and cloves in a sealable glass jar and pour in rum. Shake and let steep 2 days. (For a less intense clove flavor, steep 1 day.)\nSerious Eats / Liz Clayman\nZest limes, make sure no white pith is included. Set aside 4 of the limes for use in this recipe, and reserve the rest for another project. Add lime zest to jar. At this point, you can also add other spices, if desired. Shake and let steep for 1 day.\nSerious Eats / Liz Clayman\nStrain mixture through cheesecloth, pressing to extract as much liquid as possible.\nLiz Clayman\nJuice 4 limes, and strain juice into a sauce pot. Add water and sugar, then bring to a boil on medium heat. Cook until sugar is dissolved, about 5 minutes. Let syrup cool, then combine with the strained almond and clove infusion. Strain mixture through a coffee filter, if desired, then let it rest for an additional 12 hours before use.\nSerious Eats / Liz Clayman\nSpecial Equipment\nRimmed baking sheet\n,\nzester\n,\nfine-mesh strainer\n, coffee filter or cheesecloth\nNotes\nI left the ginger out, because I think it takes over the flavor. However, many consider it a part of the traditional recipe. You can add a tablespoon of grated ginger with the lime zest, if desired.\nFalernum is best used within a month and does not need to be refrigerated.\nRum"
}