{
  "url": "https://www.seriouseats.com/homemade-shin-cup-style-spicy-korean-beef-noo",
  "image_url": "https://www.seriouseats.com/thmb/iD62ByO0qeACNjfCV5eZEqkBxhQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__01__20140120-beef-ramyun-homemade-recipe-15-014423f0ac734abc8c0d826e54857afe.jpg",
  "tags": [
    "Korean",
    "Short Ribs",
    "Ramen",
    "Noodle Mains",
    "Soups"
  ],
  "title": "Homemade Shin Cup-Style Spicy Korean Ramyun Beef Noodle Soup",
  "full_text": "Homemade Shin Cup-Style Spicy Korean Ramyun Beef Noodle Soup\nClose\nJump to recipe\nPrep\n30 mins\nCook\n5 hrs 30 mins\nActive\n60 mins\nTotal\n6 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(6-inch) piece\nkombu\n(sea kelp, see note)\n2\nounces\nniboshi\nor\nshaved katsuobushi\n(see note)\n12\nscallions\n, divided\n2\ntablespoons\ncanola oil\n2\npounds\nbeef short ribs\nor\noxtails\n1\nmedium\nonion\n, split in half\n1\n(3-\ninch\n) knob\nginger\n, cut into\n3\nslices\n8\ncloves\ngarlic\n, divided\n2\ntablespoons\ngochujang\n(see note), plus more to taste\n1\ntablespoon\ndoubanjiang\n(see note)\n1 1/2\nquarts\nhomemade\nor\nstore-bought low-sodium chicken stock\n1\ntablespoon\ngochugaru\n, plus more to taste (see note)\n1\n(8-ounce) jar\ncabbage kimchi\n, with its juices\n1\ntablespoon\nsoy sauce\nKosher salt\nand\nfreshly ground black pepper\n8\nounces\nhon-shimeji\nor\nsliced shiitake mushrooms\n4 to 6\nservings\nramen-style noodles\n4 to 6\nsoft boiled eggs\nDirections\nCover kombu with 1 quart cold water. Bring to a boil over medium-high heat. Immediately reduce heat to low and add niboshi or katsuobushi. Let steep for 15 minutes, then drain broth and discard solids. Set aside. While broth simmers, roughly chop 8 scallions and set aside. Finely slice remaining 4 scallions and refrigerate in a sealed container until ready to use.\nSerious Eats / J. Kenji López-Alt\nHeat 1 tablespoon oil in a heavy Dutch oven or stock pot over high heat until lightly smoking. Add as many short ribs as fit in a single layer and cook, turning occasionally, until browned on all sides, about 10 minutes total. Transfer to a large bowl and repeat until short ribs are all browned.\nSerious Eats / J. Kenji López-Alt\nAdd onion (cut side down) and ginger to pot and cook until well browned, about 5 minutes. Add 6 cloves garlic and roughly chopped scallions and cook, stirring, until lightly browned, about 3 minutes. Return short ribs to pot along with gochujang and doubanjiang. Stir to coat vegetables and beef in spice mixture, then add strained kombu broth and chicken broth, scraping up any browned bits from the bottom of the pot. Bring to a boil, reduce to a bare simmer, cover with the lid slightly cracked, and cook until beef easily separates from the bones, about 4 hours. For best results, allow to cool and transfer to refrigerator overnight.\nWhen ready to proceed, strain soup through a fine-mesh strainer (if refrigerated overnight, you'll have to reheat it slightly until it liquefies). Transfer liquid to a medium pot and skim off any excess fat. Pick out short ribs and transfer to a bowl. Discard remaining solids. When cool enough to handle, pick meat off of short rib bones and transfer to a cutting board. Discard bones. Roughly chop meat and set aside.\nSerious Eats / J. Kenji López-Alt\nAdd gochugaru to broth. Place a fine-mesh strainer over the pot and strain kimchi juice into the broth. Finely mince remaining garlic with a garlic press or a microplane and stir into broth. Add soy sauce. Season broth to taste with salt, pepper, and extra gochugaru and gochujang if a spicier flavor is desired. Bring to a simmer and keep warm.\nHeat remaining tablespoon oil in a medium skillet over medium-high heat until shimmering. Add mushrooms and cook until lightly browned, about 4 minutes. Add chopped short rib and cook, tossing occasionally, until crisped in spots and well browned, about 5 minutes longer. Remove from heat and set aside.\nSerious Eats / J. Kenji López-Alt\nCook ramen noodles according to package instructions. Divide into individual pre-heated serving bowls. Top with broth, followed by crisped beef and mushrooms, sliced scallions, kimchi, and a soft boiled egg split in half. Serve immediately.\nSpecial Equipment\nDutch oven\nor\nstockpot\n,\nfine-mesh strainer\nNotes\nAll Asian ingredients can be found in Asian specialty markets or ordered onilne. Kombu is dried sea kelp. Katsuobushi is dried, smoked bonito. Niboshi are dried anchovies. Gochujang is a Korean chile bean paste. Doubanjiang is a Chinese chile-bean sauce. Gochugaru is Korean red pepper flakes.\nRead More\nRamen Hacks: 30+ Easy Ways to Upgrade Your Instant Noodles\nRamen Hacks: 9 More Ways To Upgrade Your Instant Noodles\nMake Your Own Just-Add-Hot-Water Instant Noodles (and Make Your Coworkers Jealous)\nHomemade Ramen Noodles\nTurn Your Pasta Into Ramen With Baking Soda\nKorean\nShort Ribs\nRamen\nNoodle Mains\nSoups"
}