{
  "url": "https://www.seriouseats.com/homemade-vegan-kimchi-recipe",
  "image_url": "https://www.seriouseats.com/thmb/t8IVX4WuRBdsR7SH0FsJDbNJWm8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__20120117-vegan-kimchi-9-e657785bcd53499bb9f5f5e6cabbb4fe.jpg",
  "tags": [
    "Fermentation",
    "Korean",
    "Vegan Sides",
    "Vegan Snacks & Appetizers",
    "Cabbage"
  ],
  "title": "Homemade Vegan Kimchi Recipe",
  "full_text": "Homemade Vegan Kimchi Recipe\nClose\nJump to recipe\nPrep\n20 mins\nActive\n30 mins\nStanding and Fermenting Time\n193 hrs\nTotal\n193 hrs 20 mins\nServes\n24 servings\nMakes\n1 1/2 quarts kimchi\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\nhead Napa cabbage\n, cored and separated into individual leaves, about\n1\npound\ntotal\n1\nsmall\ndaikon radish\n(about\n4\nounces\n), sliced crosswise into thin rounds\n8\nscallions\n, greens roughly chopped, whites reserved separately\nKosher salt\n8\ncloves\ngarlic\nOne\n2-inch knob\nginger\n, peeled\n1/2\ncup\nKorean chile powder (gochugaru)\n2\ntablespoons\nwhite\nor\nred\nmiso paste\n1\ntablespoon\nsugar\nDirections\nPlace cabbage leaves, daikon, and scallion greens in a large bowl and sprinkle with 2 tablespoons kosher salt. Toss to combine, cover, then let sit at room temperature until cabbage is wilted, at least 1 hour and up to 12. It should release about 1/4 to 1/2 cup liquid.\nMeanwhile, combine scallion whites, garlic, ginger, chile powder, miso paste, and sugar in the bowl of a food processor or blender. Process until a rough paste is formed, about 30 seconds total, scraping down sides as necessary.\nSerious Eats / J. Kenji López-Alt\nOnce cabbage is wilted, add chile mixture and turn to coat. Add 1 cup water to mixture. Taste liquid and add more salt as necessary (it should have the saltiness of sea water). Pack kimchi into mason jars, pressing down firmly to pack tightly and using a chopstick to release any air bubbles trapped in the bottom of the jar. Cover the kimchi with its liquid.\nSerious Eats / J. Kenji López-Alt\nSeal the jars tightly and allow them to sit at cool room temperature for 24 hours, then transfer to refrigerator. Allow to ferment at least 1 week before eating (see notes). Alternatively, place directly in fridge after parking and taste daily starting after the first week until it's as sour as you like it. For a milder flavor, consume within 1 month.\nSpecial Equipment\nFood processor\nor\nblender\nNotes\nThis kimchi will get more and more sour as it ages. It can be eaten immediately, but is optimal at around three weeks. For a more traditional kimchi, replace the miso paste with 1/4 cup fish sauce or 2 tablespoons jarred brined tiny shrimp.\nIt's normal for the kimchi to produce lots of gas as it's fermenting. Your jar's lids may pop open when you twist it off and bubbles may appear in the liquid. Do not be alarmed.\nRead More\nBaechu Kimchi (Napa Cabbage Kimchi)\nKimchi 101: It Ain't Just Cabbage\nWhat to Do With Kimchi\nKimjang, the Communal Act of Kimchi Making, Gains New Meaning This Year\nFermentation\nKorean\nVegan Sides\nVegan Snacks & Appetizers\nCabbage",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-vegan-kimchi-recipe.webp?"
}