{
  "url": "https://www.seriouseats.com/homemade-ginger-lemon-cremes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/WxaptkdzmkTFnNY4pBYZAeHEAFY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__05__20170410-lemon-ginger-cookies-vicky-wasik-18-5541e04cc3ad407680924402315e470c.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Lemon",
    "Ginger",
    "Christmas Cookies"
  ],
  "title": "Crispy Lemon-Ginger Sandwich Cookies",
  "full_text": "Crispy Lemon-Ginger Sandwich Cookies\nClose\nJump to recipe\nPrep\n25 mins\nCook\n10 mins\nActive\n60 mins\nCooling and Chilling Time\n40 mins\nTotal\n75 mins\nServes\n32 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n5 1/4\nounces\nsugar\n(about\n3/4\ncup\n;\n150\ng\n)\n4\nounces\ncold unsalted butter\n(\n1\nstick\n;\n110\ng\n)\n1\nounce\nunsulfured molasses\n(about\n1\nheaping\ntablespoon\n;\n30\ng\n),\nnot blackstrap\n1 1/4\nteaspoons\nground ginger\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nCeylon cinnamon\nor\n1/4\nteaspoon\nground cinnamon\n1/8\nteaspoon\nground\nor\ngrated nutmeg\n1/8\nteaspoon\n(\n0.5\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or use the same weight\n1/8\nounce\nlemon zest\n(\n1\ntablespoon\n;\n4\ng\n)\n6\nounces\nall-purpose flour\n(about\n1 1/3\ncups\n, spooned;\n170\ng\n)\n1\nounce\nheavy cream\n(\n2\ntablespoons\n;\n30\ng\n)\nFor the Filling:\n5\nounces\npowdered sugar\n(about\n1 1/4\ncups\n;\n145\ng\n)\n2 1/2\nounces\nrefined coconut oil\n(about\n1/3\ncup\n;\n70\ng\n); see notes\n1/2\nounce\nfresh juice\nfrom\n1\nwhole\nlemon\n(about\n1\ntablespoon\n;\n15\ng\n)\n1\nteaspoon\npure lemon extract\nor\nlemon oil\n1/4\nteaspoon\n(\n1\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or use the same weight\nDirections\nFor the Dough:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). In the bowl of a stand mixer fitted with a paddle attachment, combine sugar, butter, molasses, ginger, baking soda, cinnamon, nutmeg, salt, and lemon zest. Mix on low until moistened, then increase to medium and cream until soft and light, about 5 minutes. Reduce speed to low and add flour all at once, then drizzle in cream and mix until fully incorporated.\nSerious Eats / Vicky Wasik\nWith a 1 1/2–teaspoon scoop, divide dough into about 40 level portions. Cut each in half, then roll smooth and round between your palms. Alternatively, scale out 3/8-ounce (10g) portions, then roll smooth. (They will look tiny, but they'll spread considerably as they bake!) Arrange on a parchment-lined baking sheet, leaving at least 1 1/4 inches between them to account for spreading. Bake until cookies are golden brown, no longer puffy, and a little firm around the edges, about 10 minutes. If needed, rotate pan about halfway through to ensure even baking. Cool to room temperature directly on the baking sheet; the cookies will not be crisp while warm.\nSerious Eats / Vicky Wasik\nFor the Filling:\nIn the bowl of a stand mixer fitted with a paddle attachment, combine powdered sugar, coconut oil, lemon juice, lemon extract, and salt. Mix on low to combine, then increase to medium and cream until soft and light, about 5 minutes. Transfer to a disposable pastry bag fitted with a 1/2-inch pastry tip and use immediately.\nSerious Eats / Vicky Wasik\nTo Assemble:\nFlip half the cookies upside down and pipe a shy 1/4 ounce filling (about a heaping teaspoon or 6g, but there's no need to measure) into the center of each. Sandwich with remaining cookies. Due to the slightly irregular shape of drop cookies, you'll need to play a bit of mix-and-match to ensure similarly shaped cookies are paired together.\nSerious Eats / Vicky Wasik\nTransfer to an airtight container and refrigerate 15 minutes to harden the coconut oil. If temperatures in your kitchen routinely climb above 75°F (24°C), it will be best to store the cookies in the fridge and bring a few to room temperature as needed to serve. Stored this way, the cookies will last about 1 month. If your kitchen is generally cooler than 75°F, after chilling you may store the cookies at room temperature for up to 1 week.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n,\n1 1/2–teaspoon cookie scoop\n,\nhalf sheet pans\n,\ndisposable pastry bag\n,\n1/2-inch pastry tip\nNotes\nIf you want to make a true copycat, refined coconut oil will produce the most traditional results, with absolutely no coconut flavor at all. But the pronounced flavor and aroma of virgin coconut oil is incredibly tasty with lemon and ginger, giving the cookies an intriguing tropical twist.\nThe consistency of the filling will vary dramatically depending on the temperature of the coconut oil. Below 70°F (21°C), coconut oil will be hard and dry; above 76°F (24°C), it will be liquid. This recipe works best at a \"room temperature\" somewhere between 70 and 74°F (21 and 23°C).\nCookies\nBaking\nLemon\nGinger\nChristmas Cookies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crispy-lemon-ginger-sandwich-cookies.webp?"
}