{
  "url": "https://www.seriouseats.com/homemade-roman-style-pizza-pockets-trapizzini",
  "image_url": null,
  "tags": [
    "Pizza",
    "Italian",
    "Bread",
    "Sandwiches",
    "Game Day"
  ],
  "title": "Trapizzini (Homemade Roman-Style Pizza Pockets)",
  "full_text": "Trapizzini (Homemade Roman-Style Pizza Pockets)\nJump to recipe\nPrep\n70 mins\nCook\n20 mins\nActive\n45 mins\nResting/Proofing\n22 hrs\nTotal\n23 hrs 30 mins\nServes\n16 pizza pockets\nCook Mode\n(Keep screen awake)\nIngredients\n1\nkg\n(\n35.25\nounces\n; about\n6 1/2\ncups\n)\nbread flour\n, plus more for dusting (see note)\n20\ng\n(\n0.7\nounces\n;\n5\nteaspoons\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n7\ng\n(\n0.25\nounce\n;\n1\npacket\nor\n2\nrounded teaspoons\n)\ninstant dry yeast\n, such as\nSAF\n800\ng\n(\n28.25\nounces\n; about\n3 1/3\ncups\n)\nroom temperature water\n80\ng\n(\n2.8\nounces\n;\n6\ntablespoons\n)\nextra-virgin olive oil\n, divided, plus more for bowl and finishing\nCoarse sea salt\n, such as\nMaldon\nor\nfleur de sel\nDirections\nFor the Dough:\nCombine flour, salt, and yeast in a large bowl and whisk together until homogenous. Add water and stir with a wooden spoon until no dry flour remains, about 2 minutes. Add 40g (1.4 ounces; 3 tablespoons) olive oil and stir to incorporate, using hands if necessary to work oil into dough. Transfer dough to a clean large bowl that has been lightly greased with olive oil; cover with plastic wrap, and let rest at room temperature for 1 hour.\nSerious Eats / Vicky Wasik\nTransfer dough to clean surface dusted with flour; dust your hands and dough with flour. Pat dough into large rectangle, with long sides of the rectangle parallel to countertop. Gently pull the upper long edge of the rectangle, stretching dough, and fold it into the middle of the rectangle. Then gently pull the lower edge, and fold it into the middle of the rectangle. Pinch these folded edges together to seal them together, forming a seam. Rotate dough 90 degrees, and repeat folding and sealing process. Rotate dough 90 degrees and repeat once more. Cover dough with a clean kitchen towel and let rest for 15 minutes.\nSerious Eats / Vicky Wasik\nRepeat this entire folding process once more, for a total of 6 folds. Place dough seam side down in lightly greased large bowl. Lightly drizzle dough with olive oil, and use your hands to gently rub it over the surface. Cover tightly with plastic wrap, and refrigerate for at least 18 hours or up to 3 days.\nSerious Eats / Vicky Wasik.\nBaking the Pizza:\nRemove dough from refrigerator and let sit at room temperature for 10 minutes. Lightly spray 13-by-18-inch rimmed baking sheet with vegetable cooking spray; pour remaining 40g (1.4 ounces; 3 tablespoons) olive oil onto baking sheet and spread over entire inner surface (including rim) with your hands. Transfer dough seam side down to prepared baking sheet, and spread gently with your hands to mostly fill the pan (don't worry if dough doesn't fully stretch to edges). Lightly dust surface of dough with flour, cover with clean kitchen towel, and let rise at room temperature until dough is very soft and puffy and nearly doubled in volume, 1 1/2 to 2 hours.\nSerious Eats / Vicky Wasik\nOne hour before baking, adjust oven rack to lower-middle position. Place baking stone or Baking Steel on it and preheat oven to 550°F (290°C). Using floured hands, gently push and stretch dough into corners of the pan by pressing out from the center. Divide dough into 8 equal-sized rectangles by first drizzling olive oil to trace outline of pieces, and then use bench scraper to cut dough along the lines. Drizzle more olive oil over top of the dough, and use hands to gently rub over entire surface. Sprinkle with coarse sea salt. Transfer entire baking sheet with dough to oven, positioning it on top of baking stone.\nBake until dough is cooked through and top surface of pizza is burnished golden brown, about 16 minutes, rotating baking sheet halfway through baking. Let pizza cool in baking sheet on wire rack for 5 minutes; use spatula to separate pieces. When ready to serve, return pizza pieces to oven to bake directly on baking stone until bottom crust is evenly browned and crisp, about 4 minutes. Transfer to cutting board; cut each piece in half diagonally, and then cut slit down middle of the now-exposed interior of each pizza triangle to form a pizza pocket. Stuff pockets with fillings of your choice (see note) and serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nDigital scale\n,\nbaking steel\n,\nrimmed baking sheet\n,\nwire rack\nNotes\nFor best results, use a digital scale set in grams to measure ingredients.\nTrapizzini can be stuffed with any number of fillings. If you want to keep things Italian,\nmeatballs\nand\nsautéed broccoli rabe\nmake for excellent sandwich stuffers. Or get wild, and fill your pockets with something like\nTexas-style chili\n.\nMake-Ahead and Storage\nThe dough can be made and stored in the refrigerator up to 3 days in advance.\nRead More\nHomemade Focaccia Bread\nEasy Roasted-Garlic Focaccia\nSpinach, Provolone, and Pepperoni Calzone\nPizza\nItalian\nBread\nSandwiches\nGame Day"
}