{
  "url": "https://www.seriouseats.com/homemade-little-debbie-christmas-cakes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/d3O4s-ErAfkAeTq6UA_0d1FOo24=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111212lildebbite610-cd8dda3f89f445a594b3dd5777be552f.jpg",
  "tags": [
    "Cakes",
    "North American",
    "Christmas Cookies",
    "Christmas Desserts"
  ],
  "title": "Little Debbie-Style Christmas Tree Cakes Recipe",
  "full_text": "Little Debbie-Style Christmas Tree Cakes Recipe\nClose\nJump to recipe\nPrep\n75 mins\nCook\n25 mins\nActive\n3 hrs\nFreezing and Drying Time\n8 hrs 10 mins\nTotal\n9 hrs 50 mins\nServes\n14 mini-cakes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Yellow Cake:\n6\nounces\nsugar\n1\nounce\nbrown sugar\n1\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nsalt\n1/2\nteaspoon\nalmond extract\n1\ntablespoon\nvanilla extract\n3\nounces\nunsalted butter\n, room temperature\n4 1/2\nounces\negg yolks\n(from about\n6\neggs\n)\n8\nounces\nflour\n6\nounces\nmilk\n2\nounces\nspiced rum,\nlike Captain Morgan's\nFor the Chocolate or Vanilla Filling:\n4\nounces\nmilk\n1\negg\n1 1/4\nounces\nsugar\n1/8\nounce\ncornstarch\n1/8\nounce\ncocoa powder\n(omit for vanilla version)\n1\nounce\nmilk chocolate\n(omit for vanilla version)\nPinch\nsalt\n8\nounces\nunsalted butter\n, room temperature\n1\ntablespoon\nvanilla extract\n(increase to\n2\ntablespoons\nfor vanilla version)\nFor the Hard Glaze:\n18\nounces\npowdered sugar\n(use\n20\nounces\nfor vanilla version)\n6\nounces\nwater\n, divided\n2\nteaspoons\nsalt\n1/2\nounce\nvanilla extract\n1 1/2\nounces\ncocoa powder\n(omit for vanilla version)\nSprinkles\nto garnish\nDirections\nTo Make and Bake the Cake Layers:\nPreheat oven to 350°F (180°C) and line 2 jelly-roll style sheet pans with parchment.\nUsing a hand or stand mixer, cream sugar, baking powder, baking soda, salt, almond extract, vanilla extract, and butter for about 6 minutes on medium speed or until light and fluffy. Stop about halfway through to scrape bowl with a rubber spatula.\nWhile mixture is creaming, sift flour through a sieve and set aside.\nWhile still mixing at medium speed, begin adding yolks to mixture, one at a time. Mix thoroughly after each addition.\nTurn mixer to low speed and, with it still running, add half of the flour. Drizzle in half of the milk. Repeat with remaining flour, milk, and rum. Continue mixing until homogenous.\nShut off mixer and scrape bowl with a spatula and stir, if necessary, to incorporate any lumps of batter around sides of bowl.\nDivide batter evenly between 2 sheet pans and use an offset spatula to spread batter into an even layer. Tap pans against the counter a few times to dislodge any air bubbles.\nBake for 5 minutes. You'll notice at this time some uneven bubbling in the cakes. Remove cakes from oven and shake gently or tap against the counter to deflate the bubbles. Rotate cake pans and continue baking for another 5 minutes or until uniformly pale-golden and spongy to the touch.\nSet aside to cool until needed.\nTo Make the Filling:\nIn a small pot, bring milk to a simmer over medium heat.\nIn a medium bowl, whisk egg, sugar, cornstarch, and cocoa. While whisking, drizzle in hot milk. Return milk/egg mixture to pot and cook over medium-low heat, whisking constantly until mixture begins to bubble. Continue mixing 1 minute more to thoroughly cook out cornstarch.\nUsing a spatula, transfer cooked custard to the bowl of a stand mixer fitted with a paddle attachment. Add chocolate and salt, and beat on low speed for 10 minutes or until mixture and bowl become cool to the touch.\nOnce cool, turn speed up to medium. With mixer still running, add butter one tablespoon at a time, then drizzle in vanilla. Shut off mixer and let stand until needed.\nTo Assemble and Cut the Cakes:\nRun a knife around edges of cake pans to loosen cakes. Place a sheet of parchment over both cakes. Next, invert both cakes, remove parchment paper from bottoms, then re-invert them right-side up.\nMore detailed explanation: invert one of the cakes onto a cutting board, set sheet pan aside and very gently peel away bottom layer of parchment. Invert second cake onto the bottom of the now-empty sheet pan from the first cake (it's easier to handle cake when it's on the bottom of the sheet pan, rather than nestled down into the sheet pan). Likewise, peel away parchment paper. Now re-invert this second cake to the bottom of its original sheet pan. You now have both cakes right side up, one on cutting board, one on upside-down sheet pan.\nUsing a rubber spatula, transfer chocolate buttercream from bowl to the cake resting on cutting board. With an offset spatula, spread buttercream out as evenly as possible, from corner to corner. Hold sheet pan with second cake over buttercreamed cake; gently slide cake off sheet pan and onto buttercream. Press cake down gently with your fingers to ensure the layers are even.\nWrap cutting board in plastic and freeze for one hour. Freezing the cake solidifies buttercream and makes cutting it into tidy shapes much easier.\nTo cut into Christmas trees, remove cake from freezer and cut lengthwise into 2 long strips, 4 inches wide. There will be a 2-inch strip leftover for snacking.\nCut each strip with a chef's knife in a zig-zag pattern to create a series of isosceles triangles, 3 inches wide at the base.\nArrange all triangles with their narrowest endpoints away from you. This is the basic shape of the tree. Trim a small notch on either side of the base of the triangle to leave a 1-inch wide trunk shape.\nCover trees loosely in plastic and freeze or refrigerate until needed.\nTo Prepare the Glaze:\nIn the smallest pot you have that will accommodate the ingredients, combine powdered sugar, half the water, salt and vanilla extract. Whisk to combine. Set the pot over medium-low heat and cook, whisking constantly until powdered sugar has dissolved and mixture just begins to bubble. Remove from heat. Set aside 1/2 cup of vanilla glaze.\nNow add remaining water and cocoa powder (if using) and whisk until combined. Cool to room temperature.\nTo Glaze and Decorate the Cakes:\nLine a sheet pan with parchment.\nRemove cakes from freezer and drop one straight into the center of the glaze. Use a fork to splash some glaze over top of cake. Next, lift cake up and out of the glaze. Let any excess glaze drip back into pot. Lightly drag the bottom of the cake/fork against edge of pot to minimize dripping and excess glaze. Gently place cake onto prepared sheet pan.\nRepeat with remaining cakes. For a thick, dark coating, let cakes dry for about an hour, then make a second batch of glaze (reserving none of the vanilla) and dip cakes again. If given only one glaze, the cake will show through the glaze in patches. Whether you dip a second round is entirely up to your sense of perfectionism; one glaze is all it takes for a delicious cake.\nOnce all of the cakes have been glazed, drizzle remaining vanilla glaze (tint the glaze red, if making the vanilla version). If the glaze has become too firm to drizzle, add a teaspoon of water and stir to thin. Drizzle with a spoon, or with a pastry bag fitted with a small, plain tip. Finally, scatter sprinkles all over.\nPlace tray of cakes in a well-ventilated and safe location where they dry, undisturbed by pets or children. Let cakes stand, uncovered, for about 6 hours or until the glaze has set. Exactly how long this takes will depend on the airflow and humidity in your home.\nOnce glaze has set, cakes are ready for snacking! (Use a spatula to lift cakes from parchment, once free, you can handle them easily.)\nNotes\nAll measurements are in weights, as volume measures can be very imprecise. I strongly recommend using a\nscale\nfor all pastry projects.\nSpecial Equipment\nStand mixer\n, offset spatula,\nsheet pan\nMake-Ahead and Storage\nThe cakes will store, covered, at room temperature for about two days, or up to a week in the fridge.\nCakes\nNorth American\nChristmas Cookies\nChristmas Desserts"
}