{
  "url": "https://www.seriouseats.com/homemade-green-bean-casserole-recipe",
  "image_url": null,
  "tags": [
    "Green Beans",
    "Thanksgiving Side Dishes",
    "Christmas Sides",
    "Thanksgiving",
    "American"
  ],
  "title": "The Ultimate Homemade Green Bean Casserole",
  "full_text": "The Ultimate Homemade Green Bean Casserole\nJump to recipe\nPrep\n10 mins\nCook\n90 mins\nActive\n60 mins\nTotal\n100 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nshallots\n, peeled and sliced 1/8 inch thick on a\nmandoline\n2\ncups\n(\n480\nml\n)\ncanola oil\nKosher salt\n1 1/2\npounds\n(\n675\ng\n)\nwhite button mushrooms\n, rinsed and spun dry in a\nsalad spinner\n2\nteaspoons\n(\n10\nml\n)\nsoy sauce\n2\nteaspoons\n(\n10\nml\n)\nlemon juice\nfrom\n1\nwhole\nlemon\n2\ncups\n(\n480\nml\n)\nlow-sodium store-bought\nor\nhomemade chicken stock\n1 1/2\ncups\n(\n360\nml\n)\nheavy cream\n2\ntablespoons\n(\n30\ng\n)\nbutter\n2\ncloves\ngarlic\n, finely minced or grated on a Microplane grater\n1/4\ncup\n(\n30\ng\n)\nflour\nFreshly ground black pepper\n2\npounds\n(\n900\ng\n)\ngreen beans\n, ends trimmed, cut into 2-inch segments\nDirections\nCombine shallots and oil in a wok or medium nonstick saucepan. Shallots should barely stick out above level of oil. Place over high heat and cook, stirring frequently, until shallots are completely soft, about 12 minutes.\nMeanwhile, line a rimmed baking sheet with 6 layers of paper towels. Continue to cook shallots, stirring constantly, until shallots are light golden brown, about 8 minutes.\nSerious Eats / Robby Lozano\nImmediately strain through a fine-mesh strainer set in a heat-proof bowl or saucepan. Set shallot oil aside. You should have about 2 cups of fried shallots.\nSerious Eats / Robby Lozano\nTransfer fried shallots to paper towels. Lift up one end of top paper towel and roll shallots off onto second. Blot with first towel to absorb excess oil. Repeat 4 more times, transferring shallots from one paper towel to the next, until only one paper towel remains. Season well with salt.\nAllow shallots to cool completely, about 45 minutes. Once they've cooled, transfer to a sealed airtight container. Shallots can be made up to 1 month in advance.\nSmash mushrooms under the bottom of a large skillet until broken into 1/4- to 1/2-inch pieces. Roughly chop into pieces approximately 1/8 to 1/4 inch in size. Set aside.\nSerious Eats / Robby Lozano\nCombine soy sauce, lemon juice, chicken stock, and heavy cream in a 1-quart liquid measuring cup or medium bowl.\nAdd 2 tablespoons (30ml) reserved shallot oil (save remainder in an airtight container for another use) and butter to a 12-inch nonstick skillet. Heat over high heat until butter is melted and foaming subsides. Add mushrooms to skillet and cook, stirring occasionally, until liquid is evaporated and mushrooms begin to sizzle, 6 to 10 minutes.\nSerious Eats / Robby Lozano\nReduce heat to medium-high. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add flour and cook, stirring constantly, until light golden blond, 1 to 2 minutes. Whisking constantly, add stock and cream mixture.\nSerious Eats / Robby Lozano\nBring to a boil, reduce to a simmer, and cook until mixture achieves a texture between pancake batter and heavy cream, about 5 minutes. Season to taste with salt and pepper.\nSerious Eats / Robby Lozano\nAdjust oven rack to lower-middle position and preheat oven to 350°F (180°C). Bring 1 gallon (3.8L) water and 1/4 cup (48g) kosher salt to a boil over high heat. Fill a large bowl with 1 quart ice cubes and 2 quarts (1.9L) water.\nAdd green beans to water and boil until tender but still bright green, about 5 minutes. Drain through a colander set over the sink and immediately transfer to ice water until completely cooled. Drain green beans and set aside.\nSerious Eats / Amanda Suarez\nCombine green beans, mushroom sauce, and 1 cup fried shallots. Transfer to a 9- by 13-inch rectangular baking dish or a 10- by 14-inch oval baking dish. Bake until hot and bubbly, 15 to 20 minutes. Top with remaining cup fried shallots and serve.\nSerious Eats / Robby Lozano\nSpecial Equipment\nWok\nor\nnonstick saucepan\n,\nmandoline\n,\nrimmed baking sheet\n,\nfine-mesh strainer\n,\ncolander\n,\n9- by 13-inch baking dish\nNotes\nYou can use canned fried onions or shallots instead of making your own in steps 1 and 2. For better results, look for fried shallots in a Thai or Vietnamese market—but French's will do just fine if that's what you prefer. Slice the shallots on a\nplastic mandoline\n(like a Benriner) to get even results. The oil used to fry the shallots can be saved in an airtight container, away from the light, for up to three months. Use it for stir-fries or in salad dressings.\nHow to Scale Down This Recipe to Feed a Smaller Crowd\nThis recipe can be scaled down by half. To do it: divide all ingredients by two, substitute a 10-inch skillet for the baking dish listed.\nMake-Ahead and Storage\nFried shallots can be made up to one month in advance and stored in an airtight container. Mushroom sauce can be made up to four days in advance. Assembled casserole can be made and stored up to two days in the refrigerator. To complete, cover with foil and heat in a preheated 350°F (180°C) oven until hot, about 30 minutes. Uncover and cook until bubbly, about 10 minutes longer. Top with a cup additional fried shallots and serve.\nGreen Beans\nThanksgiving Side Dishes\nChristmas Sides\nThanksgiving\nAmerican"
}