{
  "url": "https://www.seriouseats.com/homemade-hot-cocoa-mix-recipe-8746815",
  "image_url": "https://www.seriouseats.com/thmb/yil_83i5zuLsVoBIIlxVJb1PVTo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__11__20111122cococamix-7dc7d1dd4e88461388555c57ecddb1e3.jpg",
  "tags": [
    "Chocolate",
    "Winter Drinks",
    "Drinks"
  ],
  "title": "5-Minute Homemade Swiss Miss Mix",
  "full_text": "5-Minute Homemade Swiss Miss Mix\nClose\nJump to recipe\nPrep\n5 mins\nCook\n5 mins\nTotal\n10 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Hot Cocoa Mix:\n5\nounces\n(141g)\npowdered sugar\n2 3/4\nounces\n(78g)\nwhite chocolate\n, broken into pieces\n1 1/2\nounces\n(43g)\ncocoa powder\n1 1/4\nounces\n(35g)\ndark chocolate\n, broken into pieces\nPinch\nof\nsalt\n1\nvanilla\nbean\n, split and scraped\n1/2\nteaspoon\ninstant coffee\nFor the Hot Cocoa:\n3/4\ncup\nwhole milk\n(6 fluid ounces; 175ml)\n1\nounce\nhot\ncocoa mix\n(28g; about 3 tablespoons), see above\nMarshmallows\n, to serve (optional)\nDirections\nFor the Cocoa Mix:\nIn the bowl of a food processor, combine the powdered sugar, white chocolate, cocoa powder, dark chocolate, salt, vanilla bean seeds and instant coffee. Pulse mixture until finely ground. If the processor starts to get warm, take a break for a minute to let it cool. Continue pulsing until no large bits of chocolate remain. (Don't run the processor continuously, as this will cause the machine to warm and will start to melt the chocolate a bit, creating a weird clumpy mixture.) Transfer the ground cocoa mix to an airtight container. The mixture will keep in an airtight container at room temperature until the expiration date on the chocolates.\nFor the Hot Cocoa:\nIn a saucepan, bring milk to a boil over high heat. Reduce heat to a simmer and whisk cocoa mix into milk until dissolved, about 1 minute. Adjust with more cocoa to taste. Remove from heat. Serve with marshmallows, if desired.\nSpecial Equipment\nFood processor\nNotes\nIf you're serving a crowd and want to prepare all of the cocoa at once, start by bringing a half gallon of milk (along with the reserved vanilla pod, if you like) to a boil in a pot over medium high heat. Turn the heat to medium and whisk in all of the cocoa, a half cup at a time. Whisk continuously until all of the mixture has dissolved. Serve immediately, or transfer to a thermos.\nMake-Ahead and Storage\nThe hot cocoa mix can be stored in an airtight container at room temperature until the expiration date on the chocolates.\nChocolate\nWinter Drinks\nDrinks"
}