{
  "url": "https://www.seriouseats.com/homemade-pistachio-cream",
  "image_url": "https://www.seriouseats.com/thmb/ubxz-_XD3D0dhJJElW_tGJh5_9w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190524-pistachio-oil-cake-vicky-wasik-4-1-64bbaa8f51254e7886140752efe7d842.jpg",
  "tags": [
    "Pistachios",
    "Desserts"
  ],
  "title": "Homemade Pistachio Cream Recipe",
  "full_text": "Homemade Pistachio Cream Recipe\nClose\nJump to recipe\nPrep\n5 mins\nActive\nAbout 2 mins\nTotal\n5 mins\nServes\n16 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n4 1/2\nounces\nhomemade pistachio paste\n(about\n1/2\ncup\n;\n127\ng\n), chilled to about 40°F (4°C)\n12\nounces\nheavy cream\n(about\n1 1/2\ncups\n;\n340\ng\n)\nDirections\nPlace the pistachio paste and cream into a measuring cup, blending container, or jar just large enough to accommodate the head of an immersion blender. If the container is too large, the cream layer will not be deep enough for proper blending. If the container is too small, the blades will not reach the paste at the bottom of the jar. Alternatively, the ingredients can be placed in the bowl of a food processor.\nProcess until the mixture is creamy and thick, like a frosting; the time can vary substantially depending on the equipment itself, so closely monitor the texture and body of the cream to find the ideal timing for your equipment. Use immediately, as a topping for cake, ice cream, or fresh fruit tarts, or transfer to an airtight container and refrigerate for up to 1 week.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nImmersion blender\nor\nfood processor\nNotes\nThe flavor and color of this cream will naturally vary depending on the type and freshness of the pistachios used for the paste, as well as the processing style of the paste (such as raw or toasted nuts), and its age (freshly made paste will be lightest in color). If achieving a specific color is of importance to a dessert, don't hesitate to doctor the cream with a drop of gel paste.\nMake-Ahead and Storage\nIn an airtight container, the cream will keep for up to one week in the fridge.\nRead More\nPistachio Frosting\nFrom-Scratch Real Pistachio Ice Cream\nPistachio Buns\nPistachio Milkshake\nPistachios\nDesserts"
}