{
  "url": "https://www.seriouseats.com/homemade-keebler-soft-batch-cookies-upgrade-fancy-chocolate-chip-cookie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/7uYRix3Sn3-VpSoX9JbFquOe24I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__09__201100927BetterBatch610-513ae09ec3974b48a8d920e6d8146aab.jpg",
  "tags": [
    "Cookies",
    "North American",
    "Baking"
  ],
  "title": "Better Batches (Soft Batch Cookie Upgrade) Recipe",
  "full_text": "Better Batches (Soft Batch Cookie Upgrade) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n10 mins\nActive\n10 mins\nCooling and Resting Time\n24 hrs 10 mins\nTotal\n24 hrs 40 mins\nMakes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\nall purpose flour\n1/2\nounce\ncornstarch\n1\nvanilla bean\n, split and scraped\n3\nounces\nunsalted butter\n1 3/4\nounces\nmilk chocolate\n, chopped\n3\nounces\ndark corn syrup\n1/2\nounce\ncream\n, cold\n1/2\nounce\nbrown sugar\n1/4\ntsp\nbaking soda\n1/4\ntsp\ncinnamon\n1\negg yolk\n1/2\nounce\nFrangelico\n1 3/4\nounce\ndark chocolate\n, chopped into very small pieces (approximately 1/8-inch pieces)\nDirections\nPreheat the oven to 350°F (175°C) and have two parchment-lined cookie sheets at the ready. Sift together the flour and cornstarch. Set aside.\nIn a medium saucepan, melt the butter along with the scraped vanilla bean pod (seeds reserved) over low heat until the butter completely liquifies. Turn the heat up slightly, just until the butter begins to bubble. Continue cooking until the butter stops bubbling and hissing. Immediately shut off the heat, remove the vanilla bean pod, and add the chopped chocolate. Stir with a rubber spatula until homogenized. Next stir in the dark corn syrup and cold cream. Set this mixture aside until cool. If the mixture is too warm, it will melt the chocolate chips. You can stir to speed this along, or just wait.\nOnce the mixture has cooled, stir in the reserved vanilla bean seeds, brown sugar, baking soda, egg yolk, and Frangelico. Stir vigorously to ensure the vanilla seeds are evenly distributed and no longer clumped together. Finally, stir in the dry ingredients all at once. Once the dough is smooth, fold in the chopped chocolate, reserving a few pieces for garnishing.\nUse a #60 ice cream scoop to divide the dough into 24 equal portions. If you don't have a scoop, each portion should be approximately 1 heaping tablespoon—just take care, Soft Batch cookies are really quite small. If you'd like cookies that look especially authentic, roll each portion of dough between your hands and into a perfect sphere. Arrange 12 on each cookie sheet, spaced evenly. Garnish each with a shard of chopped chocolate.\nBake for approximately 6 minutes or until the dough has puffed but not fully set. You may need to experiment to find the perfect time, but the important part is to take them out of the oven when the edges appear fully baked, but the center still seems puffed and damp. Do not overbake.\nCool the cookies directly on the tray for 10 minutes, then transfer to an airtight container while still slightly warm. Place a sheet of parchment or wax paper between each layer, as the cookies will readily fuse together if touching. Close the lid of the container and age the cookies for at least 24 hours. The cookies will stay soft and delicious at room temperature for up to two weeks.\nSpecial Equipment\nDigital scale\n,\nrimmed baking sheets\n, #60 ice cream scoop\nMake-Ahead and Storage\nStore in an airtight container at room temperature for up to 2 weeks.\nRead More\nE.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies Recipe\nHomemade Oreo Cookies Recipe\nThe Food Lab's Chocolate Chip Cookies Recipe\nQuick and Easy Chocolate Chip Cookies Recipe\nDIY Hazelnut Liqueur Recipe\nCookies\nNorth American\nBaking"
}