{
  "url": "https://www.seriouseats.com/homemade-devil-dogs-recipe",
  "image_url": "https://www.seriouseats.com/thmb/nnMVRDgIPBJ1ScR21nX90dF0VQg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__06__20160429-devil-dogs-vicky-wasik-6-abec541e303d4511ad3cde2fa1c20284.jpg",
  "tags": [
    "Baking",
    "Baking",
    "Chocolate",
    "Christmas Desserts"
  ],
  "title": "Homemade Devil Dogs Recipe",
  "full_text": "Homemade Devil Dogs Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n45 mins\nTotal\n30 mins\nServes\n15 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nounces\ncoffee\nor\nblack tea\n(\n1/3\ncup\nplus\n1\ntablespoon\n;\n85\ng\n), hot\n3\nounces\n72% dark chocolate\n(\n2/3\ncup\n;\n85\ng\n), finely chopped\n1\nounce\nDutch process cocoa powder\n(shy\n1/3\ncup\n;\n30\ng\n)\n5\nounces\nunsalted butter\n(\n10\ntablespoons\n;\n140\ng\n), about 70°F\n4\nounces\nlight brown sugar\n(\n1/2\ncup\n;\n115\ng\n)\n1\nteaspoon\n(\n4\ng\n)\nbaking powder\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\n1\nlarge\negg\n, straight from the fridge\n6 1/2\nounces\nall-purpose flour\n(\n1 1/3\ncups\n;\n185\ng\n) (see note)\nTo Finish:\nRoughly\n9\nounces\nhomemade Cool Whip, cherry pit\nwhipped cream\n, or your favorite frosting (\n1 3/4\ncups\n;\n255\ng\n)\nDirections\nPreheat oven to 350°F and line 2 aluminum half sheet pans with parchment, trimming as needed so it lies perfectly flat. Whisk hot coffee or tea with chopped chocolate and cocoa in a medium bowl until smooth. Combine butter, brown sugar, baking powder, vanilla, and salt in the bowl of a stand mixer fitted with a paddle attachment and mix on low speed to moisten. Increase to medium and cream until fluffy and light, about 5 minutes, pausing at the halfway point to scrape bowl and beater with a flexible spatula. While still mixing, add egg and continue beating until smooth. Reduce speed to low and add 1/3 of flour, followed by 1/3 of the chocolate paste. Alternate between the two, forming a chocolaty batter. Fold once or twice from the bottom up to ensure no streaks of flour or butter remain. Transfer half of batter to a pastry bag fitted with a 5/8- or 1/2-inch round tip.\nDab a little batter under each corner of parchment, then press firmly to secure it to sheet pans. Pipe about fifteen 2 3/4-inch by 1-inch \"buns\" onto each sheet pan, refilling the bag when needed. Bake until \"buns\" are puffy and firm, about 8 minutes. Slide parchment onto the counter and cool until no trace of warmth remains. Use immediately or transfer to an airtight container with a sheet of wax paper between each layer; store at room temperature up to 24 hours.\nTo Finish:\nTransfer Homemade Cool Whip, Cherry Pit Whipped Cream, or your favorite whipped frosting to a pastry bag fitted with a 5/8- or 1/2-inch round tip. Flip half the \"buns\" upside down and pipe about 1 tablespoon of filling down the center of each. Top with remaining \"buns\" and press gently to secure. Enjoy immediately, or refrigerate in an airtight container up to 6 hours.\nSpecial equipment\n2 aluminum half sheet pans; stand mixer; 2 disposable pastry bags, fitted with a 5/8- or 1/2-inch round tip\nNotes\nThis recipe was tested with bleached all-purpose flour from both Pillsbury and Gold Medal, which use red and white wheat to create a tender, low-protein blend. Flours that use 100% red wheat will create a stiffer batter and less tender cake.\nThis Recipe Appears In\nDIY Devil Dogs: The Sweetest Sandwich Around\nBaking\nBaking\nChocolate\nChristmas Desserts"
}