{
  "url": "https://www.seriouseats.com/homemade-chickarina-soup-chicken-meatballs",
  "image_url": "https://www.seriouseats.com/thmb/F7D0ZodF6KkD20D3QG6Ph7jwYnA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__09__20130911-266033-chickarina-soup-edit-d12f040dcded468da17c1493ae54e3ec.jpg",
  "tags": [
    "Soups",
    "Stovetop Chicken",
    "Chicken Legs"
  ],
  "title": "Homemade Chickarina Soup Recipe",
  "full_text": "Homemade Chickarina Soup Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n90 mins\nTotal\n75 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4\npounds\nbone-in chicken thighs\nand\ndrumsticks\nKosher salt\nand freshly ground black pepper\n1\nteaspoon whole\nblack\npeppercorns\n1\nbay leaf\n8\nounces\nboneless skinless chicken breast\n, cut into 2-inch pieces (see note)\n1/4\ncup\nhomemade or store-bought\nlow-sodium chicken broth\n(see note)\n2\ntablespoons\nbreadcrumbs\n1\nteaspoon\nbaking powder\n1\nsmall\nclove garlic\n, halved\n3\ntablespoons\nplus\n2\nteaspoons\nolive oil\n, divided\n1/2\nounce\nParmesan cheese\n, grated, plus extra for serving on the side\nPinch\nwhite pepper\n1\nmedium\nonion\n, diced (about\n1\ncup\n)\n1\nlarge\ncarrot\n, diced (about\n1\ncup\n)\n2\nstalks\ncelery\n, diced (about\n1\ncup\n)\n1\ncup\npearl pasta or\nIsraeli couscous\n(see note)\n1/4\ncup\nchopped parsley\nto garnish\nDirections\nPlace chicken thighs and drumsticks in a stock pot, add 1 teaspoon salt, 1 teaspoon black peppercorns, bay leaf, and 10 cups water. Heat on medium-high heat until mixture comes to a boil. Reduce heat to low and gently simmer until meat is tender, about 45 minutes, skimming off fat from the top. Transfer meat to a plate and when cool enough to handle, remove meat from the bones and cut into bite-size pieces. Strain stock and reserve.\nWhile stock is simmering, make meatballs: Place chicken breast pieces, chicken broth, breadcrumbs, baking powder, garlic, 2 teaspoons oil, cheese, 1/4 teaspoon salt, 1/8 teaspoon fresh ground black pepper, and white pepper in a food processor. Pulse until a paste is formed (do not purée). Transfer to bowl, cover and chill (see note).\nWhen the stock is ready, cook the soup: Heat remaining 3 tablespoons oil in a large saucepan or Dutch oven over medium heat until shimmering. Add onion, carrot, celery, and 1 teaspoon salt and cook until just beginning to soften, 3 to 5 minutes (If using Israeli couscous, only cook for 1 minute).\nAdd reserved stock (from simmered leg meat), bring to simmer, then remove from heat. Using a very small scoop or hands (see note), drop meatballs into soup. Return to heat and bring to a simmer. Add pasta and cook until al dente, following package directions for timing. Season to taste with salt and serve with grated Parmesan and chopped parsley over the top.\nSpecial Equipment\nFood processor\nNotes\nIf you can't find a pearl-shaped pasta, use Israeli couscous with the following changes to the instructions to allow for the extra cooking time of the Israeli couscous: in step 3, cook the vegetables for just 1 minute and cook the couscous until tender, about 30 minutes\nbefore\ncooking the meatballs.\nIf you have up to a cup or so of the canned chicken broth used for the meatballs, it can be added to the soup. You can use pre-ground chicken for the meatballs, but the end result won't be as bouncy as per the instructions.\nTo form the meatballs by hand, grab a handful of meatball mix and gently squish a small bit through your hand, through the thumb and forefinger until it's the size of a small meatball. Using a spoon, cut it away from your hand and drop into the soup. For a video guide, see\nThe Waitakere Redneck's Kitchen\n. It may look strange but it works!\nRead More\nSopa de Albóndigas de Pollo (Nicaraguan Chicken Meatball Soup)\nEscarole and Parmesan Soup With Chicken Meatballs\nHomemade Chicken Soup\nChicken-Stuffed Matzo Balls\nSoups\nStovetop Chicken\nChicken Legs"
}