{
  "url": "https://www.seriouseats.com/honey-roasted-peanuts-5324358",
  "image_url": "https://www.seriouseats.com/thmb/Aehf8lIcLc-e0uFdiTpFgNbiq6g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220511_HoneyRoastedPeanuts_AmandaSuarez-_Hero-619825b5b69f4620a2fe1db1984d1b34.JPG",
  "tags": [
    "Snacks & Appetizers",
    "Peanuts",
    "The Latest"
  ],
  "title": "Honey-Roasted Peanuts",
  "full_text": "Honey-Roasted Peanuts\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nCooling Time\n30 mins\nTotal\n80 mins\nServes\n14\nto 16 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nraw blanched peanuts\n(\n3\ncups\n;\n450\ng\n)\n2\ntablespoons\nplus\n1/4\ncup\n(\n75\ng\n)\nsugar\n, divided\n1 1/2\nteaspoons\n(\n5\ng\n) Diamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume or the same weight\n1/4\ncup\n(\n80\ng\n)\nhoney\n2\ntablespoons\n(\n24\ng\n)\npotato starch\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\nDirections\nAdjust oven rack to middle position and preheat to 350°F (177°C). Spread peanuts evenly on rimmed baking sheet and bake until lightly toasted and fragrant, about 12 minutes. Remove from oven and set aside. Decrease oven temperature to 300°F (148°C).\nSerious Eats / Amanda Suarez\nMeanwhile, stir together 2 tablespoons sugar and 1/2 teaspoon salt in a small bowl and set aside. Grease a rimmed baking sheet with cooking spray and set aside.\nSerious Eats / Amanda Suarez\nIn a medium saucepan or saucier, combine honey, potato starch, oil, butter, and vanilla extract, as well as remaining 1/4 cup sugar and 1 teaspoon salt. Cook over medium heat, stirring constantly with a sturdy heat-resistant spatula, until dry ingredients have dissolved and mixture is smooth, about 2 minutes. Off-heat, add peanuts and stir to combine until peanuts are thoroughly coated in honey mixture.\nSerious Eats / Amanda Suarez\nTransfer honey-coated peanuts to prepared baking sheet, spreading them into an even layer. Bake peanuts until golden brown and toasted, about 25 minutes.\nSerious Eats / Amanda Suarez\nImmediately transfer peanuts to a large bowl and let cool completely, stirring and scraping every few minutes with a sturdy spatula or spoon to prevent the nuts from sticking to the bowl and to each other, about 30 minutes (peanuts will be sticky at first but will harden as they cool). Once cool, break up any remaining clumps. Add sugar-salt mixture and toss to coat. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheets, heat-resistant spatula.\nMake-Ahead and Storage\nHoney-roasted peanuts can be stored in an airtight container at room temperature for up to 1 week.\nSnacks & Appetizers\nPeanuts\nThe Latest"
}