{
  "url": "https://www.seriouseats.com/honey-mustard-pork-chops-recipe-11692845",
  "image_url": "https://www.seriouseats.com/thmb/4ziizUDie6620IBoZUZkC3eCtps=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250307-HoneyMustardPorkChop-AmandaSuarez-12-97102cbc54d84604835ae14c9fe1be6e.jpg",
  "tags": [
    "Pork Chop",
    "The Latest",
    "Pork"
  ],
  "title": "One-Pan Honey-Mustard Pork Chops",
  "full_text": "One-Pan Honey-Mustard Pork Chops\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nBrining Time:\n8 hrs\nTotal\n9 hrs\nCook Mode\n(Keep screen awake)\nIngredients\n4\nbone-in\npork\nrib\nchops\n, about 1 to 1 1/2 inches thick (about\n3 1/4\npounds\ntotal)\n1\ntablespoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nbaking soda\nFreshly\nground black pepper\n2\ntablespoons\n(\n30\ng\n)\nvegetable oil\n4\ntablespoons\nunsalted butter\n(\n2\nounces\n;\n56\ng\n), divided\n1\nsmall\nshallot\n, minced\n1\ntablespoon\nminced\nthyme\nleaves, plus more for garnish\n1/2\ncup\n(\n177\nml\n)\nwhite wine\nor low-sodium chicken broth\n2\ntablespoons\n(\n30\nml\n)\nDijon mustard\n1\ntablespoon\n(\n15\nml\n)\nhoney\n1\ntablespoon\n(\n15\nml\n)\nlemon juice\nDirections\nPat pork chops dry with a paper towel. In a small bowl, combine salt and baking soda. Season pork chops generously on all sides with salt mixture. (You may have some seasoning mixture left over; reserve for another use or discard.) Transfer to a wire rack set in a rimmed 13- by 18-inch baking sheet. If dry-brining chops overnight, refrigerate, uncovered, at least 8 hours and up to 24; otherwise proceed immediately to step 2.\nSerious Eats / Amanda Suarez\nPreheat oven to 250°F (121°C). Season chops with pepper. Place baking sheet with pork chops in oven and cook until an instant-read thermometer inserted into the center of the chops registers 100 to 110°F (38 to 43°C) for medium-rare, 20 to 25 minutes, or 110 to 120°F (43 to 49°C) for medium, 35 to 40 minutes. To prevent overcooking, start checking temperature 5 to 10 minutes before suggested time. Remove from oven.\nSerious Eats / Amanda Suarez\nHeat oil in a large carbon steel or cast iron skillet over high heat until smoking. Working in batches if necessary to not overcrowd the skillet, place pork chops in skillet and cook, turning occasionally, until browned and an instant-read thermometer registers 120 to 130° (49 to 54°C) for medium-rare or 130 to 140°F (54 to 60°C) for medium, about 3 to 5 minutes. Stack pork chops with tongs, hold them on their sides, and sear the fat caps on the edges until crisp, about 1 minute. Remove pan from heat, transfer chops to a clean rack set in a rimmed baking sheet, and let rest for 3 to 5 minutes while you prepare the sauce.\nSerious Eats / Amanda Suarez\nPour fat from skillet; do not wipe out pan. Add 1 tablespoon butter and melt over medium-high heat. Add shallots and thyme and cook, stirring, until softened, about 1 minute. Stir in white wine or broth and bring to a simmer. Lower heat to medium and simmer until liquid is slightly reduced, about 4 minutes. Stir in mustard, honey, lemon juice, and remaining 3 tablespoons butter until well combined. Remove from heat, season to taste, and serve chops with sauce spooned on top.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWire rack, 13- by 18-inch rimmed baking sheet, instant-read thermometer, large carbon steel or cast iron skillet, tongs, whisk\nNotes\nThis recipe can be prepared with boneless pork loin chops, but boneless pork chops won’t be as flavorful as bone-in. They will likely take less time to cook; to prevent overcooking, start checking temperature 5 to 10 minutes before suggested time for bone-in pork chops.\nMake-Ahead and Storage\nLeftover pork chops and sauce can be refrigerated separately in airtight containers for up to 3 days. The pork chops can be reheated in the microwave or in a 350°F (175°C) oven or air fryer until warmed through. The sauce can be gently reheated in the microwave on low power.\nPork Chop\nThe Latest\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/one-pan-honey-mustard-pork-chops.webp?"
}