{
  "url": "https://www.seriouseats.com/honey-chile-glazed-carrots-8707470",
  "image_url": "https://www.seriouseats.com/thmb/qlba1FmQunCUnS7JHgGRWlq4mV0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__06__20200605-glazed-carrots-sasha-marx-5-afaa72fabac14b669f02666fb6d967da.jpg",
  "tags": [
    "Carrots",
    "Vegetarian Sides",
    "Vegetable Sides",
    "Vegetarian",
    "Fall Sides"
  ],
  "title": "Glazed Carrots With Burnt Honey",
  "full_text": "Glazed Carrots With Burnt Honey\nClose\nJump to recipe\nCook\n15 mins\nTotal\n15 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(30ml)\nhoney\n12 ounces (\n340\ng\n)\ncarrots\n, peeled and cut into 2 1/2-inch-long by 1/2-inch-thick batons (about 6 small carrots)\nOne 1/2-inch piece\nfresh ginger\n, peeled and minced (\n6\ng\n; about 1 teaspoon)\n1 medium clove\ngarlic\n(\n5\ng\n), minced\n1 tablespoon (\n8\ng\n) coarse ground\ngochugaru\n(Korean chile flakes)\n1\ncup\n(240ml)\nlow-sodium chicken stock\n, homemade or store-bought, plus extra as needed\n2 tablespoons\nunsalted butter\n(about 1 ounce;\n28\ng\n)\n2\nteaspoons\n(10ml)\nsoy sauce\n1\nteaspoon\n(5ml)\nfish sauce\n1\nteaspoon\n(5ml) unseasoned\nrice wine vinegar\n1\nteaspoon\n(5ml)\ntoasted sesame oil\nThinly sliced chives\n, scallions, or garlic chives, for garnish\nDirections\nIn a 3-quart saucier or saucepan, heat honey over medium-high heat, stirring constantly with a rubber spatula, until honey darkens and takes on the color of molasses, 2 to 3 minutes.\nAdd carrots, ginger, garlic, and gochugaru, season lightly with salt, and continue to cook, stirring constantly, until mixture is very aromatic, about 30 seconds. Add stock, butter, soy sauce, and fish sauce, stir to combine, and bring to a boil. Cover saucepan with lid or round of parchment paper, and adjust heat as necessary to maintain rapid boil. Cook, stirring and swirling saucepan occasionally, until carrots are tender and give very little resistance when poked with a cake tester or paring knife, 8 to 10 minutes. If liquid drops to below 1/2-inch during cooking, top up with additional stock or water.\nRemove lid and continue to cook carrots at a rapid simmer, stirring and swirling constantly, until sauce is glossy and slightly thickened, 1 to 2 minutes. If at any point the glaze over-reduces and the emulsion breaks (a visual indicator of this is fat separating and making the liquid look greasy), add water or stock, 1 tablespoon (15ml) at a time, stirring and swirling constantly, until emulsion is stabilized once more. Remove from heat, stir in rice wine vinegar and sesame oil, and season with salt to taste. Transfer to a serving platter, spoon sauce over top as desired, garnish with chives or scallions, and serve.\nSpecial Equipment\n3-quart saucier with lid\nMake-Ahead and Storage\nGlazed carrots are best served right away, but they can be refrigerated in an airtight container for up to 3 days. Reheat in a saucepan over medium-high with 2 tablespoons (30ml) additional water or stock. Bring to at a rapid boil and cook, swirling constantly to re-build the glaze emulsion, until carrots are warmed through.\nCarrots\nVegetarian Sides\nVegetable Sides\nVegetarian\nFall Sides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/glazed-carrots-with-burnt-honey.webp?"
}