{
  "url": "https://www.seriouseats.com/honey-vanilla-almond-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rEkFucvK-GoZ9OzTBH1Ia4eJK6M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140907-almond-cake-whole-finished-jennifer-latham-947f481c2d2344b4959fadc4a3876945.jpg",
  "tags": [
    "Cakes",
    "Passover",
    "Gluten-free Desserts",
    "Sheet Cake",
    "Almonds"
  ],
  "title": "Honey-Vanilla Almond Cake",
  "full_text": "Honey-Vanilla Almond Cake\nClose\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nActive\n20 mins\nCooling Time\n60 mins\nTotal\n2 hrs 5 mins\nServes\n10\nto 12 servings\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\nUnsalted butter\n, for greasing the pan\n1 1/2\ncups\nskin-on\nor\nblanched\nwhole almonds\n, or\n1 3/4\ncups\nalmond flour\n(see note)\n4\nlarge\neggs\nat room temperature, yolks and whites separated\n1/2\ncup\nplus\n2\ntablespoons\nhoney\n, divided\nScraped seeds from\n1/2\nof a split\nvanilla bean\npod\n1/2\nteaspoon\nbaking soda\n1\nteaspoon\nkosher salt\n2\n-\n3\ndrops\njuice\nfrom\n1\nwhole\nlemon\nSliced almonds\n, for decorating (optional)\nDirections\nPreheat oven to 350°F and position rack in center of oven.\nGrease a 9-inch springform pan with butter and line the bottom with parchment paper, then grease parchment with butter.\nIf using whole almonds, process in a food processor until finely ground. Sift ground almonds through a flour sifter; set aside coarse almond pieces that don't pass through sifter for another use. You should have 1 3/4 cups almond flour. Alternatively, if using store-bought almond flour, proceed to Step 4.\nSerious Eats / Jennifer Latham\nIn the bowl of a stand mixer fitted with the paddle, beat egg yolks, 1/2 cup honey, vanilla bean, baking soda, and salt until well combined and lightened in color, about 5 minutes. Add almond flour and beat at low speed until combined, about 1 minute longer.\nUsing a clean stand-mixer bowl and the whisk attachment, whisk the egg whites at low speed until foamy. Add 2-3 drops of lemon juice, increase mixer speed to medium, and mix until soft peaks form, about 10 minutes.\nFold 1/3 of beaten egg whites into almond flour batter, stirring well to thoroughly incorporate. Fold half of remaining egg whites into batter as gently as possible, being careful not to deflate whites. Repeat with remaining egg whites.\nScrape batter into the prepared pan. Bake for 25 minutes (do not open the oven or move the cake during this time, as it can fall). Rotate cake gently and bake until cake feels solid in the middle when tapped and is a uniform dark brown color, about 10 minutes longer. Meanwhile, warm remaining 2 tablespoons honey in a small saucepan or microwave.\nSerious Eats / Jennifer Latham\nBrush cake with warmed honey as soon as it comes out of the oven. Remove the springform pan's outer ring and let cake stand until cool. Decorate cake top with sliced almonds, if desired. Serve once cooled. Cake can be stored overnight at room temperature before serving.\nSerious Eats / Jennifer Latham\nSpecial Equipment\n9-inch springform cake pan, food processor (optional), stand mixer, parchment paper\nNotes\nThis recipe works with whole skin-on almonds, whole blanched almonds, and store-bought almond meal. If you use whole almonds, you will have to grind them into a flour in a food processor, and then sift out the larger pieces (which can be toasted and used as a topping for ice cream or yogurt). 1 1/2 cups whole almonds should yield the 1 3/4 cups of almond flour you will need (the flour has more volume than the whole almonds you start out with). Skin-on almonds will yield a darker-colored cake with a more complex, earthy flavor, while blanched (skinned) almonds will yield a lighter, more delicate cake.\nCakes\nPassover\nGluten-free Desserts\nSheet Cake\nAlmonds",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/honey-vanilla-almond-cake.webp?"
}