{
  "url": "https://www.seriouseats.com/honey-butter-toast-recipe-8678981",
  "image_url": null,
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Snacks & Appetizers",
    "French Toast"
  ],
  "title": "Honey-Butter Toast",
  "full_text": "Honey-Butter Toast\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nCooling time\n10 mins\nTotal\n35 mins\nServes\n1\nto 2 Servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, softened\n2\ntablespoons\n(\n30\ng\n)\nlight brown sugar\n2 1/2\nteaspoons\n(\n15\ng\n)\nhoney\n, divided, plus more for drizzling\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/8\nteaspoon\nground cinnamon\n1/8\nteaspoon\nground cardamom\n(optional)\n1\n2-inch thick slice\nbrioche\n,\nchallah\n,\nmilk bread\n, or\nsoft white bread\n(\n3\nounces\n;\n90\ng\n)\n1/4\ncup\n(\n113\ng\n)\nstrained Greek-style yogurt\n1/4\nteaspoon\nvanilla bean paste\nFresh mixed berries\n, for serving\nDirections\nPreheat oven to 325°F. Line a small rimmed baking sheet with parchment. In a small bowl, stir together butter, brown sugar, 1 1/2 teaspoons of the honey, salt, cinnamon, and cardamom (if using) until smooth.\nSerious Eats / Robby Lozano\nIf desired, trim crusts from bread to yield a perfectly square slice. Spread a thin layer of butter mixture over top, bottom, and sides of each bread slice. Place on prepared baking sheet.\nSerious Eats / Robby Lozano\nBake until very lightly golden-brown, 12 to 16 minutes. Flip slices and continue to bake until evenly golden, 5 to 7 minutes longer.\nSerious Eats / Robby Lozano\nRemove from oven and cool on baking sheet for 5 minutes. Transfer to a wire rack and cool until crispy, about 10 minutes.\nSerious Eats / Robby Lozano\nWhile toast cools, whisk together yogurt and vanilla bean paste until smooth. Stir in remaining 1 teaspoon honey, maintaining a swirl by not completely stirring it in.\nSerious Eats / Robby Lozano\nPlace crisped toast on a plate; dollop with yogurt, then spoon berries on top. Drizzle with more honey, if desired. Serve immediately.\nSerious Eats / Robby Lozano. Food Stylist: Julia Levy, Prop Stylist: Tucker Vines\nSpecial Equipment\nSmall rimmed baking sheet, parchment\nMake Ahead and Storage\nThe butter mixture can be made up to 3 days ahead and stored at room temperature in an airtight container or refrigerated in an airtight container for up to 2 weeks. Let it come to room temperature before use for easier spreadability.\nBread can be slathered with the butter mixture and then refrigerated overnight for easier baking in the morning.\nToast is best the day it is baked.\nBreakfast & Brunch\nThe Latest\nSnacks & Appetizers\nFrench Toast"
}