{
  "url": "https://www.seriouseats.com/honey-italian-buttercream-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-6sQ0S0G7bTCRITo0GoJ69N42HY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__09__20180924-honey-buttercream-vicky-wasik-4-5bca9807d3d8473bab9342ba390bcee8.jpg",
  "tags": [
    "Desserts",
    "Gluten-free Desserts",
    "Stovetop"
  ],
  "title": "Honey Frosting (Italian Buttercream) Recipe",
  "full_text": "Honey Frosting (Italian Buttercream) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n30 mins\nTotal\n20 mins\nServes\n34 servings\nMakes\n4 1/4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\nhoney\n(about\n1\ncup\n;\n340\ng\n)\n6\nounces\negg white\n(from about\n5\nlarge\neggs\n;\n170\ng\n)\n1/4\nteaspoon\n(\n1\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n12\nounces\nunsalted butter\n(\n1 1/2\ncups\n;\n340\ng\n), softened to 65°F (18°C)\n1/4\nounce\nvanilla extract\n(about\n1 1/2\nteaspoons\n;\n7\ng\n)\nDirections\nIn a 3-quart stainless steel saucier, bring honey to a boil over high heat. This should take no more than 4 minutes. If the timing is substantially different, this is simply an indication that the heat needs adjustment due to equipment variation.\nOnce honey begins to boil, reduce heat to medium and continue cooking until honey reaches 230°F (110°C) on a clip-on digital thermometer, about 3 minutes longer (see note). Meanwhile, add egg whites to the bowl of a stand mixer fitted with a whisk attachment and begin whipping on medium-high speed.\nContinue cooking honey until it reaches between 240 and 250°F (116 and 121°C), about 2 minutes longer, adjusting the heat as needed and using a heat-resistant spatula to knock back the foam. When the honey comes to temperature, remove from heat and pour into the bowl of egg whites in a steady stream, with the mixer still running. Take care that the honey drizzles down the side of the bowl, so it does not come in contact with the moving whisk.\nOnce all of the honey has been added, continue whipping the meringue until incredibly thick and glossy and cooled to approximately 85 to 90°F (29 to 32°C), about 4 minutes.\nAdd salt, followed by the butter in roughly 2-tablespoon increments, waiting only a few seconds after each one before adding the next. As the butter is added, the meringue will begin to deflate dramatically; this is normal. When all the butter has been added, reduce speed to medium-low and add vanilla, then shut off the mixer and scrape the bowl and beater with a flexible spatula. Re-whip a few seconds more; if problems arise, consult the troubleshooting guide below. Use immediately or transfer to an airtight container.\nTroubleshooting:\nThe ideal working temperature of Italian buttercream is approximately 70°F (21°C). At this temperature, it should be creamy, smooth, and light, about 6 ounces (170g) per cup. If too cold, it will be much denser, potentially with a greasy, curdled, or wet texture. If too warm, it may be too soft, runny, or soupy for use.\nIf the buttercream is a few degrees too warm, it can be refrigerated for 10 minutes or chilled in an ice bath for a few minutes to cool. If the buttercream is too cold, it can be placed over a steaming water bath or open flame for a few seconds to initiate melt; alternatively, remove 1/2 cup buttercream, melt it completely, then add it back.\nIn either case, after warming or cooling to adjust the temperature, re-whip the buttercream for at least 3 minutes on medium-high speed before reevaluating, as it takes time for the temperature to homogenize from edge to center. The texture and consistency can continue to be adjusted as needed until the buttercream is light, fluffy, and easy to spread, with no hint of soupiness, melt, stiffness, or curdling.\nSpecial Equipment\n3-quart stainless steel saucier\n,\ndigital thermometer\n, flexible spatula,\nstand mixer\nNotes\nHoney is about 18% water, so it cooks to the desired temperature more rapidly than simple syrup. The exact water content can vary by brand, so the exact time needed to cook the buttercream may vary.\nMake-Ahead and Storage\nIn an airtight container, such as a freezer-safe zip-top bag, buttercream can be refrigerated for up to 1 week or frozen for 1 month. Thaw the buttercream to about 70°F (21°C) and re-whip before use, adjusting as needed according to the recipe directions.\nThis Recipe Appears In\nHow to Make Italian Buttercream\nDesserts\nGluten-free Desserts\nStovetop"
}