{
  "url": "https://www.seriouseats.com/honey-smoked-turkey-recipe-8749196",
  "image_url": "https://www.seriouseats.com/thmb/EzgxZ6OtWqPBI67hz6EYrh7NcmA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231107-SEA-HoneyBrinedSmokedTurkey-FredHardy-00-c8361767f2f04309a40c46ae5b1db73b.jpg",
  "tags": [
    "Thanksgiving Turkeys",
    "Grilled Turkey",
    "Smoked Turkey"
  ],
  "title": "Honey-Brined and Smoked Turkey",
  "full_text": "Honey-Brined and Smoked Turkey\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs 45 mins\nBrining Time\n12 hrs\nTotal\n15 hrs 5 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n7\nquarts\n(6.6L) cold\nwater, divided\n1\npound\n(454g)\nhoney\n1 cup plus 1 tablespoon Diamond Crystal\nkosher salt\n(5 1/2 ounces; 1\n53\ng\n)\n2\nquarts\n(64 ounces, about 1.9L) homemade\nvegetable stock\nor store-bought low-sodium vegetable broth\n1\nbunch\nfresh thyme (1/2 ounce; 15g)\n2\ntablespoons\nwhole black peppercorns (5/8 ounce; 20g)\nOne\n12\nto 14\npound\n(5.4 to 6.4 kg)\nturkey,\nneck and giblets discarded\n2\ntablespoons\n(30ml)\nvegetable oil\nDirections\nIn a medium saucepan, heat 1 quart water, honey and salt over medium heat, stirring often, until salt is completely dissolved, about 5 minutes. Remove from heat. Pour mixture into a large brining container and add remaining 6 quarts cold water, vegetable stock, thyme, and peppercorns and stir to combine. Place the turkey in the brine, adding a weight (large heavy plate or saucepan) on top to keep it completely submerged, if needed. Refrigerate and brine for 12 to 18 hours.\nSerious Eats / Fred Hardy\nRemove the turkey from the brine and pat dry with paper towels. Place turkey on a wire rack set in a rimmed baking sheet and refrigerate, uncovered, to let air dry for at least 8 hours or up to 24 hours. (This step is optional, but will result in a crisper skin.)\nSerious Eats / Fred Hardy\nRemove the turkey from the refrigerator, fold the wings under the body and using butcher’s twine, tie the legs together. Brush the turkey all over with vegetable oil and let sit at room temperature while preparing the grill or smoker.\nSerious Eats / Fred Hardy\nFor a Charcoal Grill:\nOpen bottom vent halfway. Light large chimney mounded with charcoal briquettes (about 7 quarts). Once the top coals are partially covered with ash, pour lit coals into a steeply banked pie against one side of the grill. Nestle 4 (3-inch) wood chunks into the coals. Set the cooking grate in place, cover, and open the lid vent halfway. Heat grill until hot and smoking, about 5 minutes. Clean and oil the cooking grate.\nFor a Smoker:\nHeat and maintain smoker temperature between 350 to 400°F (177 to 204℃) following manufacturer’s guidelines and tips. (see notes) Nestle 3 to 4 (3-inch) wood chunks into coals or heat source. Set cooking grate in place and clean and oil the cooking grate.\nSerious Eats / Fred Hardy\nOnce wood is smoking, place the turkey breast side up on the cooler side of the grill with legs closest to the coals if using a charcoal grill, or centered on the cooking grate if using a smoker. Cover and cook until breasts register 160℉ (71℃) and thighs register 175℉ (79℃), 2 to 3 hours. (see notes)\nSerious Eats / Fred Hardy\nTransfer turkey to a carving board and let rest, uncovered, for 30 minutes. Carve turkey and serve.\nSerious Eats / Fred Hardy\nSpecial Equipment\nVery large sturdy container for brining turkey, charcoal grill or smoker, 3-inch wood chunks\nNotes\nIt’s important to note that some electric smokers will not reach the listed cooking temperature range needed for this recipe. You will need a smoker that reaches at least 350 degrees for this recipe. If using a pellet smoker, do not add wood chunks, instead follow manufacturer’s instructions for using pellets.\nIf smoking with a charcoal grill, you will need to adjust the cooking vents as needed to maintain 350 to 400°F (177 to 204℃) cooking temperature range. If temperature begins to drop, nestle 15 unlit charcoal briquettes into lit briquettes with one additional 3-inch wood chunk as needed to maintain cooking temperature.\nThanksgiving Turkeys\nGrilled Turkey\nSmoked Turkey"
}