{
  "url": "https://www.seriouseats.com/hong-kong-style-french-toast-recipe-8605272",
  "image_url": "https://www.seriouseats.com/thmb/_tQD8ukNIW79WKyj0o75cXrTajk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240306-SEA-HKFrenchToast-AmandaSuarezhero-32822e51a37a44a396103e681cec79e6.jpg",
  "tags": [
    "French Toast",
    "The Latest",
    "Breakfast & Brunch",
    "Breakfast Sandwich",
    "Sandwiches"
  ],
  "title": "Hong Kong-Style French Toast",
  "full_text": "Hong Kong-Style French Toast\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nTotal\n40 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n8\n1/2-inch-thick slices\nmilk bread\nor\nbrioche\n, crusts removed (see notes)\n6\nlarge\neggs\n1/4\ncup\ngranulated sugar\n(about\n1 3/4\nounces\n;\n50\ng\n)\nPinch\nkosher salt\n2\ncups\n(\n480\nml\n)\nwhole milk\n1/2\ncup\n(\n120\nml\n)\ncreamy peanut butter spread\nNeutral oil\nsuch as\nvegetable\nor\ncanola oil\n, for frying\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\n, for serving\n1/4\ncup\n(\n60\nml\n)\ncondensed milk\n, for serving\nDirections\nAdjust oven rack to middle position and preheat oven to 200ºF (93ºC). Set a wire rack in a rimmed baking sheet. Arrange bread in a single layer on the rack and cook in oven, turning once, until dried but not toasted, about 10 minutes. Transfer to a plate and line a separate plate with a double layer of paper towels. Set baking sheet aside.\nSerious Eats / Amanda Suarez\nIn a large mixing bowl, whisk together eggs, sugar, and salt until thoroughly combined. Add milk and whisk to blend.\nSerious Eats / Amanda Suarez\nIn a large Dutch oven or wok, add oil until it measures 2 inches deep and heat over high heat to 350ºF (177ºC). Meanwhile, lay 4 slices of bread out on a work surface and spread each slice with 2 tablespoons peanut butter , then top each with a slice of bread.\nSerious Eats / Amanda Suarez\nWhisk egg mixture to recombine, then, working with 1 sandwich at a time, soak sandwich in egg mixture, flipping as needed, until saturated, about 2 minutes. Allow any excess egg mixture to drip into the bowl, then carefully add soaked sandwich to hot oil and fry until golden brown on bottom side, about 2 minutes. Using tongs and/or spider skimmer, gently flip the sandwich and continue to fry until golden brown on the other side, about 2 minutes. Transfer the French toast to the prepared plate, then place on wire rack and keep warm in the oven. Return oil to 350ºF (177ºC)  and repeat with remaining sandwiches.\nSerious Eats / Amanda Suarez\nDivide the French toast among four plates, top with pats of butter and a generous drizzle of condensed milk. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWire rack, rimmed baking sheet, large Dutch oven or wok, instant-read thermometer, tongs and/or spider skimmer\nNotes\nWhite sandwich bread may be substituted for milk bread or brioche, but I recommend using a soft, enriched bread for best results.\nMake-Ahead and Storage\nHong Kong-style French toast should be eaten immediately.\nFrench Toast\nThe Latest\nBreakfast & Brunch\nBreakfast Sandwich\nSandwiches",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/hong-kong-style-french-toast.webp?"
}