{
  "url": "https://www.seriouseats.com/hoppin-john",
  "image_url": "https://www.seriouseats.com/thmb/6mn4BH_miEzvtotopXZeyQVfkEI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201214-hoppin-john-jillian-atkinson-10-90e193c0d36f4864a726ebe579aa43fc.jpg",
  "tags": [
    "Soul Food & Southern",
    "Beans Sides",
    "Rice & Grains",
    "Beans",
    "White Rice"
  ],
  "title": "Hoppin' John",
  "full_text": "Hoppin' John\nClose\nJump to recipe\nCook\n4 hrs 40 mins\nActive\n30 mins\nSoaking Time\n8 hrs\nTotal\n12 hrs 40 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmoked\nham hock\n(about\n1 1/4\npounds\n;\n565\ng\n)\n1\nmedium (8-ounce; 225 g)\nyellow onion\n, peeled, quartered, and root end trimmed\n2\nbay leaves\n1 1/2\ncups\n(\n9 1/2\nounces\n;\n270\ng\n)\ndried field peas (cowpeas)\n, preferably not black-eyed peas, rinsed, picked over for debris, and soaked overnight (see note)\n1\ntablespoon\nDiamond Crystal kosher salt\n(\n12\ng\n); for table salt use half as much by volume or the same weight\n1/2\nteaspoon\nfreshly ground black pepper\n1\nteaspoon\ngarlic powder\n1\nteaspoon\nonion powder\n1 1/2\ncups\n(\n10\nounces\n;\n280\ng\n)\nuncooked parboiled long-grain white rice\n(see note)\nDirections\nIn a 5-quart Dutch oven, combine ham hock, bay leaves, and quartered onion, and top with 3 quarts of water. Set over high heat, bring to a boil, then cook at a boil for 5 minutes. Reduce heat to maintain a gentle boil, cover with the lid slightly ajar, and cook until the ham hock is fork-tender, about 3 hours; top up with boiling water as needed to keep the ham hock covered. Discard bay leaves. Transfer ham hock and onion to a heatproof plate or bowl to cool. Measure 2 quarts (1.9L) broth and return it to the Dutch oven; save any remaining broth for another use.\nSerious Eats / Jillian Atkinson\nPull ham hock meat and skin from the bones. Roughly chop up any larger pieces, then return meat, skin, and bones along with the onion to the pot.\nSerious Eats / Jillian Atkinson\nDrain field peas from soaking water, rinse, and add to the pot.\nSerious Eats / Jillian Atkinson\nAdd salt, pepper, garlic powder, and onion powder. Set over high heat and return to a boil. Lower heat to maintain a gentle boil, cover with the lid slightly ajar, and cook until peas are al dente, about 45 minutes. About 15 minutes before peas are al dente, preheat oven to 350°F (175°C). Add parboiled rice to pot, stir to combine, then return to a full boil over high heat and cook for 1 minute, then turn off heat.\nSerious Eats / Jillian Atkinson\nStir the pot well to incorporate the ingredients, cover fully with lid, and cook in oven for 30 minutes. Remove from the oven and let rest, covered, for 5 minutes.\nSerious Eats / Jillian Atkinson\nFluff with a fork, and serve right away.\nSerious Eats / Jillian Atkinson\nSpecial Equipment\nDutch oven\nNotes\nThere are many sources for field peas, but two good options available online are the ones from\nAnson Mills\nand\nCamellia\n. We recommend\nsoaking beans\nin water salted with 1 tablespoon of kosher salt per quart. Also please note that parboiled long-grain rice is a specific rice product available at grocers and supermarkets everywhere; you can not substitute other kinds of rice for it, nor attempt to parboil your own.\nMake-Ahead and Storage\nHoppin' John can be refrigerated in an airtight container for up to 5 days. Reheat in an oven-safe dish, covered, in a 325°F oven until warmed through.\nSoul Food & Southern\nBeans Sides\nRice & Grains\nBeans\nWhite Rice",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/hoppin-john.webp?"
}