{
  "url": "https://www.seriouseats.com/hostess-sno-ball-coconut-covered-chocolate-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/UzuuxRy5EBw7xLwsqy7K-YVo8s4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120321tray610-34bf29441722443aadfe960bc7583e01.jpg",
  "tags": [
    "Desserts",
    "Baking",
    "Coconut"
  ],
  "title": "Homemade Sno Balls Recipe",
  "full_text": "Homemade Sno Balls Recipe\nClose\nJump to recipe\nPrep\n60 mins\nCook\n25 mins\nActive\n70 mins\nCooling and Standing Time\n3 hrs\nTotal\n4 hrs 25 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n2\nounces\nunsalted butter\n(see note)\n5\nounces\nsugar\n1/4\nteaspoon\nsalt\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1\negg\n3\nounces\nall-purpose flour\n, sifted\n1\nounce\ncocoa powder\n, sifted\n5\nounces\nbuttermilk\n1\nteaspoon\nvanilla extract\nFor the Marshmallow Coating:\n1/2\nounce\ngelatin\n10\nounces\nwater\n, divided\n7\nounces\ncorn syrup\n18\nounces\nsugar\n1/2\nteaspoon\nsalt\n1\nteaspoon\nvanilla extract\nFor the Cream Filling:\n6\nounces\nheavy whipping cream\nFor the Coconut Coating:\n8\nounces\nunsweetened coconut flakes\nOptional:\nfood coloring\nDirections\nTo Make the Chocolate Cake:\nPreheat oven to 350°F (180°C) and have a cupcake pan, lightly greased, set aside (see note). With a hand or stand mixer, cream together butter, sugar, salt, baking powder, and baking soda until light and fluffy, about 3 minutes. Add egg and mix another minute more until fully incorporated. With the mixer set to low, add in flour all at once, followed by the cocoa powder. Finally, drizzle in buttermilk and vanilla. Continue mixing only until homogenous. Divide batter evenly between the cupcake cups and bake for about 12 minutes, or until puffed and set. Set aside and cool for at least 2 hours before filling.\nTo Make the Marshmallow Coating and Filling:\nIn a medium bowl (or the bowl of a stand mixer) combine gelatin with half the water (5 ounces). Mix with a fork to ensure no lumps of gelatin remain. Set aside. In a medium pot, combine remaining water, corn syrup, sugar, and salt over medium heat. Stir gently with spatula to ensure sugar dissolves; avoid splashing. Cook until the mixture registers 240°F (116°C) on a candy thermometer. When it does, immediately shut off the heat and cool to 210°F (99°C). Once cool, add sugar syrup to the gelatin mixture and whip on low speed until gelatin has fully dissolved. Increase speed to medium-high and whip until light, fluffy and tripled in bulk. While still mixing, add in vanilla. Use a spatula to transfer all but 4 ounces of the mixture to a pastry bag. Set the pastry bag aside.\nReturn remaining 4 ounces of fluff to the mixer and set speed to low. Add cream in all at once and continue mixing another minute—the fluff and cream will have a rather broken appearance. Increase speed to medium and continue whipping until they gradually become homogeneous. Once they have, increase speed to medium-high and beat until stiff. Transfer to piping bag fit with a star tip and set in the refrigerator until needed.\nTo Fill the Cupcakes:\nRelease cupcakes from the pans and arrange, upside down, on a parchment-lined sheet pan. Use a paring knife to poke a hole into the bottom of each cupcake. Take piping bag with marshmallow whipped cream and insert the tip 1-inch into the cupcake (see note). Pipe about 3/4 ounce filling into each cupcake, about one good squeeze.\nTo Finish the Sno Balls:\nTake the bag of plain marshmallow whip and hold it directly above a cupcake. Pipe a generous blob on top of the cupcake, enough that it flows down the sides of the cupcake and completely encases it. Repeat until all remaining cupcakes have been covered.\nNext, tint coconut (if making a white Sno Ball, grinding the coconut in a food processor is still preferable, but can be skipped if you don't mind the large coconut bits). To tint the coconut, pulse in a food processor, along with a bit of your food coloring of choice, until the color is evenly distributed and coconut has been ground into small bits (see note). Generously coat each marshmallow-covered cupcake in coconut and let stand for 1 hour. Save any extra coconut.\nAfter an hour, use a large cookie cutter to trim away excess marshmallow from each Sno Ball. Use reserved coconut to coat newly exposed marshmallow edges. Serve immediately. Sno Balls are best consumed right away, but will keep for about a day.\nSerious Eats / Sarah Jane Webb\nSpecial Equipment\nCupcake pan\n,\ndigital scale\n,\nstand mixer\nor\nhand mixer\n, two pastry bags, one large plain tip, one medium star tip, candy thermometer or\nleave-in probe thermometer\n,\nfood processor\nNotes\nAll measurements are in weights, as volume measures can be very imprecise. I strongly recommend using a digital scale for all pastry projects.\nI recommend greasing the cupcake pan, rather than using cupcake papers, because the crinkled impressions the papers leave behind on the cupcakes create a strange exterior texture for the Sno Balls.\nI like using a medium star tip to fill the cupcakes because its shape makes it easier to pierce the cupcake and inject the filling.\nInstead of using a food processor, you can tint the coconut flakes by shaking them up with food coloring in a plastic bag. However, the coconut bits on a Sno Ball are quite small and using a food processor helps grind up the coconut for a more authentic texture.\nRead More\nDIY Donettes (Mini Sugar-Coated Doughnuts)\nHomemade Star Crunch\nLittle Debbie-Style Christmas Tree Cakes\nHomemade Oreo Cookies\nHomemade Fig Newtons\nHomemade 'Nutter Butters'\nHomemade Milanos\nE.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies\nDesserts\nBaking\nCoconut",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/homemade-sno-balls-recipe.webp?"
}