{
  "url": "https://www.seriouseats.com/hot-smoked-salmon-recipe-11718524",
  "image_url": "https://www.seriouseats.com/thmb/BvQnnErXhepmjtaaIgrKbpVOQ7I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240327-SEA-SmokedSalmon-VyTran-hero-9f8934c47ed34ce1a78ae3ef1b8e85d8.jpg",
  "tags": [
    "Salmon",
    "Recipes",
    "Grilling",
    "Grilling Guides",
    "Fish"
  ],
  "title": "How to Make Smoked Salmon That's Way Better Than Store-Bought",
  "full_text": "How to Make Smoked Salmon That's Way Better Than Store-Bought\nClose\nJump to recipe\nPrep\n10 mins\nCook\n80 mins\nBrining and Chilling Time\n10 hrs\nTotal\n11 hrs 30 mins\nServes\n12\nto 16\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\npacked\nlight brown sugar\n(\n3 3/4\nounces\n;\n105\ng\n)\n1/2\ncup\nDiamond Crystal\nkosher salt\n(\n5\nounces\n;\n144\ng\n)\n1\n(\n3 1/2 to 4 1/2-pound\n) skin-on side of farm-raised or\nwild salmon\n, pin bones removed, and belly fat trimmed (see notes)\nDirections\nIn a small bowl, combine sugar and salt. Place salmon on a wire rack set in a rimmed baking sheet. Spread sugar mixture evenly over the entire surface of flesh, pressing gently to adhere. Refrigerate, uncovered, for 5 hours.\nSerious Eats / Vy Tran\nRinse salmon under cold running water, rubbing gently with your hands to remove any remaining sugar-salt mixture. Return to wire rack and pat dry with paper towels. Refrigerate, uncovered, until the surface of the fish is tacky to the touch and matte, at least 5 to 24 hours.\nSerious Eats / Vy Tran\nIf using wood chips\n: Using a double layer of aluminum foil or a single layer of heavy-duty foil, wrap 2 cups wood chips into a roughly 8 by 5-inch foil packet. (Make sure chips do not poke holes in sides or bottom of packet. ) Cut 2-inch slits evenly spaced in the top of the packet.\nSerious Eats / Vy Tran\nFor a smoker:\nHeat and maintain the smoker temperature between 225 to 275°F (105 to 135℃) following manufacturer’s guidelines and tips. Nestle prepared wood chip packet or three (3-inch) wood chunks into coals or heat source (see notes if using a pellet smoker). Set cooking grate in place. Go to step 7.\nFor a charcoal grill:\nOpen bottom vent halfway. Light large chimney starter half filled with charcoal briquettes (3 quarts). Place 1 quart unlit briquettes on 1 side of grill. When top coals are partially covered with ash, pour into a steeply banked pile over unlit briquettes. Place the prepared wood chip packet on coals with slits facing up or nestle three (3-inch) wood chunks into coals. Set cooking grate in place, cover, and open lid vent halfway. Heat grill until hot (about 300°F; 145℃) and filled with smoke, about 5 minutes. Go to step 7.\nSerious Eats / Vy Tran\n6.\nFor a gas grill:\nRemove cooking grate and place wood chip packet (do not use wood chunks for a gas grill) directly on primary burner (The primary burner on a gas grill is the burner that is connected closest to the gas source. It is the burner that you ignite first on the grill). Set grate in place; turn primary burner to high (leave other burners off); cover; and heat grill until hot (about 350℉) and filled with smoke, about 15 minutes. Turn primary burner to medium. (Adjust primary burner as needed to maintain grill temperature between 225 to 275°F (105 to 135℃).\nClean and oil cooking grate. Double layer 2 pieces of heavy-duty foil and cut into an 18 by 6-inch rectangle. Spray lightly with vegetable oil spray. Place the prepared foil on the cooking grate (centered on the grate if using a smoker and on the cooler side of the grill for a charcoal or gas grill). Center the salmon on the prepared foil. Cover grill (positioning lid vent over salmon if using charcoal) and cook, while maintaining grill temperature between 225 to 275°F (105 to 135℃), until center of thickest part of fillet registers 120°F for wild salmon or 125°F for farm-raised salmon, and the flesh is still translucent when cut into with paring knife, 50 to 75 minutes.\nSerious Eats / Vy Tran\nUsing the foil as a sling, carefully transfer the salmon to a platter. Using a spatula if needed, carefully slide foil out from beneath the salmon. Serve immediately or allow to cool to room temperature before refrigerating.\nSerious Eats / Vy Tran\nSpecial Equipment\nWire rack and rimmed baking sheet, smoker or charcoal grill or gas grill, 2 cups wood chips or three 3-inch wood chunks, such as oak or hickory, for smoking, aluminum foil\nNotes\nThe recipe can be halved, using a 2-pound center-cut fillet and half as much sugar and salt in the cure; the cooking time will be about 50 minutes.\nI recommend farmed Atlantic salmon or wild king salmon. Wild sockeye salmon is leaner but also works well.\nIf using a pellet smoker, do not add wood chunks; instead follow manufacturer’s instructions for using pellets.\nMake-Ahead and Storage\nSalmon\nRecipes\nGrilling\nGrilling Guides\nFish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-make-smoked-salmon-thats-way-better-than-store-bought.webp?"
}