{
  "url": "https://www.seriouseats.com/hot-sauce-smashburgers-recipe-8700485",
  "image_url": "https://www.seriouseats.com/thmb/u3wLcEFlGTCxULOxs_aWE_m3S3w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210608-hot-sauce-smash-burgers-vicky-wasik-seriouseats-seriouseats-13-8a5697c75b2b42b59e1a7cb716b2dfa0.jpg",
  "tags": [
    "Burgers",
    "Hot Sauces"
  ],
  "title": "Hot Sauce Smash Burgers",
  "full_text": "Hot Sauce Smash Burgers\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n1/2 cup (\n120\nml\n)\nketchup\n1 1/2 tablespoons (\n22\nml\n)\napple cider vinegar\n1\ntablespoon\n(15ml)\nmayonnaise\n1\ntablespoon\n(15ml)\nShaquanda's Hot Pepper Sauce\n(see note)\n1/2\ntablespoon\n(7ml)\nShaquanda's Oooohmami Hot Pepper Sauce\n(see note)\nFor the Burgers:\n3\ntablespoons\n(45ml)\nShaquanda's Oooohmami Hot Pepper Sauce\n(see note)\n1 tablespoon (\n15\nml\n)\nfish sauce\n1\nteaspoon\nfreshly\nground black pepper\n1 pound (\n450\ng\n)\nground beef, preferably 80-percent lean\n, divided into eight 2-ounce (55g) balls\n4\nsoft hamburger rolls\n, buttered and toasted\nToppings as desired, such as\nshredded lettuce\n, and thinly sliced onion, tomato, and sandwich pickles\n4\nslices\ngood melting\ncheese\n, such as\nAmerican\nDirections\nFor the Sauce:\nIn a small bowl, whisk together ketchup, vinegar, mayonnaise, and the two hot pepper sauces until well combined.\nVicky Wasik\nFor the Burgers:\nIn a small bowl, stir together hot sauce, fish sauce, and black pepper. In a large mixing bowl, combine beef with hot sauce mixture and gently fold until just incorporated, being careful not to over-mix the meat any more than necessary (it's okay if it's not fully mixed in). Divide beef into eight 2-ounce (55g) balls.\nVicky Wasik\nPrepare burger buns by arranging toppings on bottom halves of buns; spread sauce on top halves of buns. Have them nearby and ready for when the patties are cooked.\nVicky Wasik\nPreheat a large stainless steel sauté pan or skillet over high heat for 2 minutes. Place 2 balls of beef in pan and smash down with a stiff metal spatula, using a second spatula to add pressure; smashed patties should be slightly wider than burger bun. Allow to cook until patties are well browned and tops are beginning to turn pale pink/gray in spots, about 45 seconds. Using a bench scraper or the back side of a stiff metal spatula, carefully scrape patties from pan, making sure to get all of the browned bits.\nVicky Wasik\nFlip patties and immediately place 1 slice of cheese over 1 patty, then stack the second patty directly on top. Immediately remove patties from pan and transfer to waiting burger bun. Scrape skillet well with thin metal spatula, wipe it clean, then repeat with remaining balls of beef and slices of cheese. Serve.\nVicky Wasik\nSpecial Equipment\n12-inch\nstainless-steel skillet\n, heavy metal spatula\nNotes\nNeither of the Shaquanda brand hot sauces are easy to replicate, but if you don't have them you can still get great results by using another chile-forward hot sauce like Cholula Original for the Hot Pepper Sauce. In place of the Oooohmami, you can mix together 3 tablespoons of that same chile-forward hot sauce with 2 tablespoons Worcestershire sauce and 1 tablespoon sugar until the sugar is dissolved.\nMake-Ahead and Storage\nThe sauce can be mixed together and refrigerated for up to 3 days before using.\nBurgers\nHot Sauces"
}