{
  "url": "https://www.seriouseats.com/hot-milk-cake-recipe-8695858",
  "image_url": "https://www.seriouseats.com/thmb/2_iIB3VPhEYr1VNIbnbkWHiNDOo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240815-SEA-HotMilkCake-AmandaSuarez-hero-214c05ccd48d4ea6ac8fab63b65160a8.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Baking",
    "Desserts"
  ],
  "title": "Hot Milk Cake",
  "full_text": "Hot Milk Cake\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nCooling Time\n60 mins\nTotal\n90 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\nUnsalted butter\n, for greasing\n4\nlarge\neggs\n(200g)\n300g\ngranulated sugar\n(\n10 1/2\nounces\n; 1 1/2 cups)\n192g\ncake flour\n(\n6 3/4\nounces\n; 1 1/2 cups), plus more for dusting\n1 1/2\nteaspoons\nbaking powder\n1 teaspoon Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3/4\ncup\n(180ml) whole\nmilk\n1/4\ncup\n(60ml)\nvegetable oil\nDirections\nAdjust rack to middle position and preheat oven to 350ºF (175ºC). Line the bottoms of two 9-inch cake pans with parchment paper. Grease Bundt pan with unsalted butter, then dust with cake flour, shaking out excess. (See notes.)\nIn a medium bowl, whisk together cake flour, baking powder, and salt; set aside.\nSerious Eats / Amanda Suarez\nIn a large measuring cup, combine milk with vegetable oil.\nIn the bowl of a stand mixer fitted with the whisk attachment, whip eggs and granulated sugar on medium-high speed until yolks are thick and pale yellow color, and doubled in volume, about 7 minutes.\nSerious Eats / Amanda Suarez\nReduce mixer speed to low, and slowly pour in milk and oil mixture. Continue to whisk until combined, about 15 seconds.\nSerious Eats / Amanda Suarez\nWith the mixer on low speed, gradually add the dry mixture 1/4 cup at a time, until just incorporated, about 2 minutes. Using a flexible spatula, scrape down sides and bottom of the bowl to ensure there are no dry bits. (If any remain, use spatula to gently fold until incorporated.) Pour batter into prepared cake pan and gently tap cake pan on kitchen counter 2 to 3 times to eliminate any large air bubbles.\nSerious Eats / Amanda Suarez\nBake, rotating halfway through, until cake has risen by about 1 inch, is light golden, and springs back when gently touched, about 25 minutes. Transfer pans to a wire rack and allow cakes to cool in pan for 30 minutes.\nCarefully invert cake onto a parchment-lined baking sheet. Let cool completely, at least 30 minutes. (Cooled cake can be wrapped tightly in plastic wrap and stored at room temperature for up to 24 hours.)\nSerious Eats / Amanda Suarez\nSpecial Equipment\nBundt pan, stand mixer, flexible spatula, wire rack, parchment paper\nNotes\nThe cake can also be baked in two 9-inch aluminum cake pans. If using two 9-inch aluminum cake pans, line the bottoms of each pan with parchment paper. Grease paper and sides of the pan with unsalted butter, then dust with cake flour, shaking out excess. When batter is prepared, divide evenly between pans (about 1 pound; 454g each). Bake, rotating halfway through, until cake has risen by about 1 inch, is light golden, and springs back when gently touched, 17 to 20 minutes. Transfer pans to a wire rack and allow cakes to cool in pans for 30 minutes.\nMake-Ahead and Storage\nThe cake can be tightly wrapped in plastic and refrigerated for up to 1 week or frozen for up to 3 months.\nCakes\nThe Latest\nBaking\nDesserts"
}