{
  "url": "https://www.seriouseats.com/how-to-make-your-own-orange-bitters-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5xOAQzORK51FWJnsJjw54Hl0268=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__011112-187247-diyvsbuy-orangebitters-efadb2f5a7814e58984c15bdf0f014ef.jpg",
  "tags": [
    "Cocktails",
    "Orange"
  ],
  "title": "DIY Orange Bitters Recipe",
  "full_text": "DIY Orange Bitters Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n15 mins\nInfusing and Cooling Time\n504 hrs 10 mins\nTotal\n505 hrs 5 mins\nServes\n576 dashes\nMakes\n1 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n4\noranges\n(zest only) (see notes)\n1\ncup\n151-proof neutral grain spirit\n, divided (see notes)\n1/2\nteaspoon\ncaraway seeds\n1/2\nteaspoon\ncloves\n1\nstar anise\npod\n1/2\nteaspoon\nanise seeds\n1\nteaspoon\ngentian root\n(see notes)\n1\nteaspoon\nquassia chips\n(see notes)\n1 1/2\ncups\n101-proof bourbon\n(see notes)\nDirections\nZest oranges using a vegetable peeler and place peel on a cookie sheet. Bake at 100°F (40°C) until dried but not burned, about 40 minutes. Check regularly to ensure peels have not burned.\nOnce zests are cool, place them in a sealable glass jar with 1/2 cup of 151 neutral grain spirit. Be sure this jar is large enough to later hold an additional 1 cup of liquid. Shake. This is your orange flavoring.\nPlace caraway seeds, cloves, star anise, and anise seeds in a different sealable glass jar with 1/2 cup of 151 neutral grain spirit. Shake. This is your spice mix.\nPlace gentian root and quassia chips in a sealable glass jar with bourbon. Shake. This is your bittering mix.\nAfter 10 days, strain the spice mix and bittering mix through a fine-mesh sieve to remove the solids. Strain again through a coffee filter into the orange flavoring jar. Do not remove the orange zest. Shake. You now have one jar that contains the strained spice mix and bittering mix along with the steeping orange zest and alcohol. Let this steep for an additional 11 days.\nStrain out orange zest through a fine-mesh sieve, and then strain the rest through a coffee filter into your desired container.\nSpecial Equipment\nOrange zester or peeler, fine-mesh sieve, baking sheet, coffee filter\nNotes\nMany stores sell dried orange peels, so you have the option of store-bought instead of drying your own. I used navel oranges, but you can try different types of oranges.\nGentian root and quassia chips can usually be found at specialty herb stores. You can also order them from\nLhasa Karnak\nor\nMountain Rose Herbs.\nI used Wild Turkey 101 and Everclear 151 for my spirits base. If you cannot find these, you can substitute another bourbon and use the highest proof vodka available to you.\nCocktails\nOrange",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-orange-bitters-recipe.webp?"
}