{
  "url": "https://www.seriouseats.com/how-to-debone-a-chicken-thigh-7775470",
  "image_url": "https://www.seriouseats.com/thmb/SCGuz7K1sJCCmk5b4kBmkStSa0c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230828-SEA-HowtoDeboneAChickenThigh-AmandaSuarez-08-1dfb8fe8f2f848728f49305d7b6a59a2.jpg",
  "tags": [
    "How-Tos",
    "The Latest",
    "Knife Skills"
  ],
  "title": "How to Debone a Chicken Thigh",
  "full_text": "How to Debone a Chicken Thigh\nClose\nJump to recipe\nPrep\n10 mins\nTotal\n10 mins\nCook Mode\n(Keep screen awake)\nIngredients\nBone-in, skin-on or\nskinless chicken thighs\n(see notes)\nDirections\nIf using skin-on thighs that you want to be skinless, peel the skin off the thighs using your hands (you can also use the side of your knife to hold the thigh down as you go). Otherwise proceed with the skin attached.\nSerious Eats / Amanda Suarez\nOn a work surface, set the thigh rough side up and locate the single bone that runs through it just under the flesh. Your goal is to remove this bone with minimal damage to the meat.\nSerious Eats / Amanda Suarez\nKeeping the fingers of your non-knife hand curled for protection (raw chicken can be slippery!), and using the tip of the knife, score a line through the meat along the length of the bone.\nSerious Eats / Amanda Suarez\nContinue to carefully work the knife along the bone until the bone is fully exposed.\nSerious Eats / Amanda Suarez\nGrasp one end of the bone with your non-knife hand (a little piece of paper towel can help if it's very slippery), then, scrape and cut the meat off of the bone in short, firm flicks; a boning knife should have a curved bolster at the base of the blade designed for this task.\nSerious Eats / Amanda Suarez\nWhen the meat has been mostly scraped off the bone, separate the end of the bone completely from the meat. Trim away any gristle or bits of bone or cartilage that may have remained on the meat.\nSerious Eats / Amanda Suarez\nTrim off any excess fat and/or skin and discard.\nSerious Eats / Amanda Suarez\nNotes\nIf you have whole chicken legs, begin by using a sharp knife to split the drumsticks from the thighs at their natural seam; if the knife meets resistance, reposition it until it slides through easily—you want to go through the joint, not the bone. Reserve drumsticks as needed or for another use.\nHow-Tos\nThe Latest\nKnife Skills",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-debone-a-chicken-thigh.webp?"
}