{
  "url": "https://www.seriouseats.com/how-to-roast-butternut-squash-6944696",
  "image_url": "https://www.seriouseats.com/thmb/5sCqyHBJhjuWrF8Q-Ne0uzJNCWM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221221-ButternutSquash-AmandaSuarez-hero-cde0f867dbc54cb08330d33452229d17.JPG",
  "tags": [
    "The Latest",
    "Roasted Vegetables",
    "Vegetable Guides",
    "Winter",
    "Fall"
  ],
  "title": "How to Roast Butternut Squash",
  "full_text": "How to Roast Butternut Squash\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nTotal\n30 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n453\ng\n)\nbutternut squash\n, peeled, seeded, and cut into 1-inch cubes\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nor other cooking fat (see note)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n, plus more as needed; for table salt, use half as much by volume\n1/4\nteaspoon\nbaking soda\n(optional, see note)\nDirections\nPreheat the oven to 400ºF (200ºC). Toss squash with olive oil, salt, and baking soda (if using), and arrange on a rimmed baking sheet, making sure not to overcrowd the sheet. Roast, using a thin metal spatula to turn pieces 2 or 3 times during cooking, until squash is tender and golden brown, about 25 minutes. Set aside.\nSerious Eats / Amanda Suarez\nEquipment\nRimmed baking sheet\nNotes\nIf using baking soda, watch the squash carefully as it cooks since baking soda acts as an accelerant for browning and the sugars can easily burn. Baking soda also helps to soften and break down pectin, a fiber that contributes to the firm texture of squash, which is helpful when mashing or puréeing the squash after. If you’re looking for squash with more bite, skip the baking soda.\nYou can also use a neutral oil like canola or grapeseed, clarified butter like ghee, coconut oil (unrefined will lend a tropical flavor, while refined will be more neutral), or melted butter. Note that melted butter can burn more easily, so keep a closer eye on the squash if you use it.\nMake Ahead and Storage\nRoasted butternut squash can be refrigerated in an airtight container for up to 2 to 3 days. Reheat before eating.\nThe Latest\nRoasted Vegetables\nVegetable Guides\nWinter\nFall"
}