{
  "url": "https://www.seriouseats.com/how-to-cook-asparagus-7487955",
  "image_url": null,
  "tags": [
    "Vegetable Guides",
    "The Latest",
    "Asparagus",
    "Spring"
  ],
  "title": "How to Cook Asparagus",
  "full_text": "How to Cook Asparagus\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\nasparagus\n, woody bottoms trimmed\nKosher salt\n, freshly ground\nblack pepper\n, vegetable or\nolive oil\n, chicken or\nvegetable stock\n, and\nbutter\n, as needed depending on the preparation\nDirections\nBlanched Asparagus\nIn a large bowl, prepare an ice water bath. In a large pot of salted boiling water, blanch asparagus until crisp-tender, about about 30 seconds to 1 minute for thinner asparagus and 1 to 2 minutes for thicker asparagus. Immediately transfer asparagus to ice bath to chill.\nGrilled Asparagus\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. If using a gas grill, preheat half the grill to high.\nToss asparagus with 2 tablespoons olive oil and season with salt and pepper. Add asparagus to hot side of grill and cook, turning occasionally, until well-charred and tender, 5 to 8 minutes.\nBroiled Asparagus\nPreheat broiler and position rack about 4 to 6 inches from it. On a rimmed baking sheet, drizzle asparagus with oil and toss to coat. Season with salt. Broil asparagus, shaking and rotating pan occasionally to cook them evenly on all sides, until asparagus is blistered, about 6 minutes.\nPan-Roasted Asparagus\nIn a large cast iron, carbon steel, or stainless steel skillet, heat 1 tablespoon (15ml) vegetable oil over high heat until shimmering. Add half of asparagus and cook, tossing, stirring, and rotating the spears frequently, until browned all over, charred lightly in spots, and crisp-tender within, about 10 minutes; lower heat if necessary to prevent burning. Using tongs, transfer each spear as it's done to a plate and keep warm. Repeat with remaining vegetable oil and asparagus. Season with salt and pepper.\nBraised Asparagus\nHeat oil in a 12-inch straight-sided sauté pan over high heat until lightly smoking. Add asparagus in as close to a single layer as possible, season with salt and pepper, and cook without moving until lightly browned, about 1 1/2 minutes. Shake pan and cook until browned again, 1 1/2 minutes longer. Add 1 cup chicken or vegetable stock and 3 tablespoons butter to pan and immediately cover.\nContinue to cook until asparagus is completely tender and stock and butter have emulsified and reduced to a shiny glaze, 7 to 10 minutes. If stock completely evaporates and butter starts to burn before asparagus is cooked through, top up with a few tablespoons of water. Serve immediately.\nVegetable Guides\nThe Latest\nAsparagus\nSpring"
}