{
  "url": "https://www.seriouseats.com/how-to-cut-a-peach-8682723",
  "image_url": "https://www.seriouseats.com/thmb/CbhRslngaUCxgjuTy0ycauYWgXE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230828-SEA-HowtoCutPeaches-AmandaSuarez-21-90b9ddb53fb64d9881b17c04a22449aa.jpg",
  "tags": [
    "Peach",
    "The Latest",
    "How-Tos"
  ],
  "title": "How to Cut a Peach",
  "full_text": "How to Cut a Peach\nClose\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nCook Mode\n(Keep screen awake)\nIngredients\nRipe\npeaches\n, as many as you need\nDirections\nIf Working With Freestone Peaches:\nHalve the Peach:\nAll peaches have a seam that runs from top to bottom, it's what makes them look like cute little butts. This seam is your guide to where to cut: You can either slice along the seam all the way down to the pit, spinning the peach as you go until you've fully circled the pit, or you can rotate the peach 90 degrees so that you're still cutting in the same pole-to-pole direction as the seam but perpendicular to it.\nSerious Eats / Amanda Suarez\nThe disadvantage of cutting along the seam is that once opened, peaches halved along the seam will have the pits lying flat in one of the halves, and they will be slightly harder to grab and pop out, but the resultant halves will have wider, more shallow depressions left by the pit, which are better for stuffing. They will also yield more symmetrical peach halves. If, on the other hand, you slice from pole to pole 90 degrees off from the seam, the pit will be easier to grasp, as its edge will be sticking out, but you'll have two asymmetrical halves, one with the seam on it and one without. You choose which appeals to you more. I like symmetry.\nSerious Eats / Amanda Suarez\nNow twist the two halves you've cut. They should pop apart, with one side still holding the pit and the other not. If you're unlucky, you'll get one of those peaches where the pit itself splits in half, but it's not that big of a deal.\nRemove Pit:\nCarefully pop the pit out of the whichever half it's embedded in. Be careful not to damage the flesh too much as you pry it out.\nSerious Eats / Amanda Suarez\nTrim Out Any Tough Bits:\nThe pit will sometimes leave behind some tough bits, so if you see any, cut them out with a paring knife.\nSerious Eats / Amanda Suarez\nSlice or Dice:\nIf slicing, set each peach half cut side down on a work surface. If you want slices of even thickness, make a series of vertical cuts straight down to the cutting board of whatever width you need. If you want wedges, you can make radial cuts.\nSerious Eats / Amanda Suarez\nIf dicing, slice each peach half into planks of whatever size dice you need, then stack the planks and make perpendicular cuts, first one way, then the other, to create the dice.\nSerious Eats / Amanda Suarez\nIf Working With Clingstone Peaches:\nSince clingstone pits don't come free from the flesh, you can end up crushing ripe peach flesh while attempting to twist apart the peach halves as described above. Instead, you can simply cut off the flesh in lobes around the pit.\nSerious Eats / Amanda Suarez\nIt helps to visualize the shape of the pit inside the a peach for this: The pit is almond-shaped (this is not a coincidence, almonds come from the pits of a very close peach relative), which means it's oblong. To cut around the pit as closely as possible, you want to angle your knife almost as if you're cutting a diamond pattern into it from the top down.\nSerious Eats / Amanda Suarez\nThis will yield two large lobes of flesh from either side, plus two smaller lobes that are left behind.\nTrim away any extra flesh that's still clinging to the pit.\nSerious Eats / Amanda Suarez\nPeach\nThe Latest\nHow-Tos",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-cut-a-peach.webp?"
}