{
  "url": "https://www.seriouseats.com/how-to-make-portuguese-garlic-bread-soup-recipe",
  "image_url": null,
  "tags": [
    "Mediterranean",
    "Southern European",
    "Dairy-free Mains",
    "Stovetop",
    "Sausages"
  ],
  "title": "Açorda à Alentejana (Portuguese Garlic and Cilantro Bread Soup)",
  "full_text": "Açorda à Alentejana (Portuguese Garlic and Cilantro Bread Soup)\nJump to recipe\nCook\n45 mins\nActive\n60 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nextra-virgin olive oil\n, plus more for drizzling\n4\nounces\ndry-cured Spanish style chorizo\n, quartered lengthwise and thinly sliced\n1\nmedium\nyellow onion\n, finely diced\n6\nmedium\ncloves garlic\n, crushed\n1\nsmall\nserrano chile\n, minced\n3/4\ncup\nloosely packed cilantro\nleaves and tender stems, minced and divided, plus leaves for garnish\n2\ncups\nchicken stock or store-bought\nlow-sodium chicken broth\n8\ncups\ncubed or torn stale Portuguese bread or\nbaguette\n, with crust\nWater\nKosher salt\nand freshly ground black pepper\n4\nlarge\nfoolproof poached eggs\nor\nsous-vide poached eggs\n(optional)\nThinly sliced scallions\n, for garnish\nDirections\nIn a Dutch oven, heat olive oil over medium-high heat until shimmering. Add chorizo and cook, stirring occasionally, until crisped, about 4 minutes. Using a slotted spoon, transfer chorizo to a plate and set aside.\nAdd onion, garlic, and serrano chili to same Dutch oven and cook over medium heat, stirring occasionally, until softened, about 3 minutes. Add two-thirds of cilantro and cook, stirring, until onions are lightly golden, about 3 minutes longer.\nAdd stock to pot and bring to a simmer. Stir in bread and cook, adding water as needed 1/2 cup at a time and stirring occasionally, until bread has absorbed all liquid and has almost completely broken down into a porridge-like texture, about 30 minutes. Stir in remaining minced cilantro and season with salt and pepper.\nSpoon bread soup into bowls, top each with a poached egg, if using, along with sliced scallions, cilantro leaves, and crisped chorizo. Drizzle with olive oil and serve immediately.\nSpecial Equipment\nDutch oven\n, slotted spoon\nNotes\nThe exact amount of liquid you will need to add to the bread and the time it will take to break down will vary depending on the type of bread and how stale it is.\nMediterranean\nSouthern European\nDairy-free Mains\nStovetop\nSausages"
}