{
  "url": "https://www.seriouseats.com/how-to-make-kombucha-science-recipe-6824135",
  "image_url": "https://www.seriouseats.com/thmb/Wgc6MymRbKuRgkF2YYsIejW0th8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221205-AmandaSuarez-Kombucha-01-077195247edf49b2a63b0133a12cad6f.JPG",
  "tags": [
    "Teas",
    "The Latest",
    "Chinese",
    "Fermentation"
  ],
  "title": "How to Make Kombucha",
  "full_text": "How to Make Kombucha\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nFermentation Time\n240 hrs\nTotal\n240 hrs 35 mins\nServes\n10 servings\nMakes\n5 pints\nCook Mode\n(Keep screen awake)\nIngredients\n12\ncups\n(\n2880\nml\n) filtered or distilled\nwater\n, divided\n1 1/4\ncups\nsugar\n(\n8 3/4\nounces\n;\n248\ng\n)\n1/4\ncup\n(\n24\ng\n)\nloose leaf jasmine tea\n2\ncups\n(\n473\nml\n) jasmine or\ngreen tea kombucha starter\n(see note)\n1\nSCOBY\n(see note)\nDirections\nFor the First Fermentation:\nIn a large 4-quart or larger pot, combine 4 cups (960ml) water with the sugar and bring to a boil over high heat, stirring occasionally to help fully dissolve sugar. Off heat, stir in tea leaves and let steep until tea registers roughly 150°F (65°C) on an instant-read thermometer, about 15 minutes. Stir in remaining 8 cups (1920ml) water and let cool until tea registers 85 to 90°F (30 to 32°C).\nSerious Eats / Tim Chin\nSet a fine-mesh strainer over a one-gallon glass jar that has been run through a dishwasher cycle or sanitized with a product like Star San. Strain tea through it; discard tea leaves. Stir in kombucha starter until well distributed. Gently place SCOBY on top (you should have at least 2 inches of headspace in the jar after adding the SCOBY). The SCOBY may float or sink to bottom of jar; either is normal.\nSerious Eats / Tim Chin\nCover jar with a double layer of coffee filters and secure with a rubber band. Store in a dark area between 70 and 80°F (21 to 27°C) and let ferment until kombucha tastes sour and small bubbles rise to surface, and a new layer of SCOBY has formed at surface, about 7 days and up to 4 weeks (pH should register roughly 2.9 on a pH meter or pH strips).\nSerious Eats / Tim Chin\nFor the Secondary Fermentation:\nThoroughly wash and dry five 16-ounce (1-pint) twist-cap or flip-top glass bottles. Using clean hands, remove SCOBY and place on plate. Stir kombucha with a wooden spoon, making sure sediment is evenly dispersed. Then, using a funnel, fill each with kombucha; make sure to leave 1 to 1 1/2 inches of headspace in each bottle (you should have about 2 cups of extra kombucha that won't fit in the 5 bottles; this kombucha can be used as starter for your next batch). Seal bottles and store in a dark area between 70 and 80°F (21-27°C) until beverage reaches desired level of carbonation, 3 days to 2 weeks. Check one bottle periodically to monitor carbonation: it is ready when you see small bubbles rising fairly rapidly to the top, even when capped; if using twist caps, the cap will pop up slightly when a good level of carbonation is reaches; if using flip-top bottles, you may need to open one bottle to check the carbonation, resealing if there isn't enough fizz. When kombucha has reached desired level of carbonation, move bottles to refrigerator and store for up to 8 weeks.\nSerious Eats / Tim Chin\nTo Continue Brewing Future Batches of Kombucha:\nRepeat Steps 1 through 4 using the leftover kombucha as starter along with reserved SCOBY.\nSpecial Equipment\nLarge fine-mesh strainer, one-gallon glass jar, funnel, large coffee filters, five 16-ounce (1-pint)\ntwist-cap bottles\nor\nflip-top bottles\n; dishwasher or a sanitizer like Star San (for cleaning vessels); pH meter or pH strips\nNotes\nStarter tea can either be from a prior batch (preferred) or from a bottle of store-bought kombucha. Use an unflavored jasmine or green tea kombucha if possible. For best results, use jasmine or green tea kombucha from a previous batch.  The best source of a SCOBY is a friend or acquaintance who regularly brews kombucha. You can also buy them commercially, but note that SCOBY's that are sold dry or unsubmerged in starter liquid tend to perform weakly in comparison to those sold fresh and packaged in starter tea.\nMake Ahead and Storage\nThe finished bottled kombucha can be refrigerated for up to 8 weeks.\nTeas\nThe Latest\nChinese\nFermentation"
}