{
  "url": "https://www.seriouseats.com/how-to-make-fresh-mozzarella-from-scratch-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0LrG8tB4BkzQarr2fqrpykcaDBg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__10__20151017-pies-vicky-wasik-2-6f491edb6065485a86d6af639a592298.jpg",
  "tags": [
    "Mozzarella",
    "Italian",
    "Summer Snacks & Appetizers"
  ],
  "title": "Fresh Homemade Mozzarella",
  "full_text": "Fresh Homemade Mozzarella\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n30 mins\nResting Time\n30 mins\nTotal\n60 mins\nServes\n6\nto 8 servings\nMakes\n3 medium balls mozzarella\nCook Mode\n(Keep screen awake)\nIngredients\n1\ngallon\n(\n3.8\nL\n)\nnon-homogenized, low-temperature-pasteurized whole milk\n(see note)\n1 1/2\nteaspoons\ncitric acid\n1/4\nteaspoon\nrennet\nor\n1/4\ntablet\nrennet\n, diluted in\n2\ntablespoons\n(\n30\nml\n)\nfiltered or distilled water\n1\ntablespoon\n(\n12\ng\n)\nkosher salt\nDirections\nPour milk into a large stainless steel pot and whisk to disperse butterfat. Sprinkle citric acid into milk and stir well to fully dissolve.\nStirring every few minutes, bring the milk to 88°F (31°C) over medium-low heat. (This should take about 5 minutes.) Add rennet and stir to combine, about 30 seconds. Milk will begin to curdle into small clumps and separate from liquid whey. Reduce heat to low and continue heating until whey registers a temperature of 105°F (41°C) on an\ninstant-read thermometer\n, about 3 to 5 minutes. Remove from heat and let stand 5 to 10 minutes.\nSerious Eats/Vicky Wasik\nUsing a slotted spoon, transfer curds to a strainer set over a bowl, pressing gently to drain. Curds should form a single mass. Allow to drain until whey is no longer dripping, about 10 to 15 minutes. Transfer drained curds to a cutting board. Slice into 1-inch cubes and divide into 3 even portions.\nSerious Eats/Vicky Wasik\nMeanwhile, season whey with 1 tablespoon (12g) kosher salt (or more to taste), stirring well to dissolve. Transfer 1/3 of whey to a heatproof bowl and set aside.\nIf Using the Stovetop Method:\nBring remaining 2/3 of whey to 180°F (82°C) over high heat. Working with one portion of curds at a time, place in a heatproof bowl and add enough hot whey to cover. Wait 15 to 20 seconds, until curd is soft, sticky, and clumping together.\nIf Using a Microwave:\nWorking with one portion of curds at a time, place in a microwave-safe dish and heat on high in 15-second intervals until curd is soft and sticky.\nFor Both Methods:\nPut on clean rubber gloves. Pick up ball of curds and slowly draw hands apart, allowing gravity to stretch curds; avoid forcing, tearing, or kneading curds. Continue folding and stretching curds, reheating in microwave or whey as necessary, until curds are shiny and smooth. (This should take approximately 2 to 6 stretches.)\nSerious Eats/Vicky Wasik\nFold curd into a mass that's roughly the size of your palm and make a C shape with the forefinger and thumb of one hand. Push curd through those fingers, exerting pressure to shape it into a sphere. Press hard enough to prevent large bubbles from forming under the skin. Alternatively, make a closed loop with thumb and forefinger and make several small, egg-shaped bocconcini.\nSerious Eats/Vicky Wasik\nGently lower ball(s) into room-temperature whey and let rest 20 to 30 minutes before eating. Meanwhile, repeat with remaining portions of curd. Cheese should be eaten immediately or within a few hours; to store, wrap tightly in plastic and follow\nthese reheating guidelines\n.\nSpecial Equipment\n12-quart stock pot\n, rubber or latex gloves (see note),\ninstant-read thermometer\n,\nfine-mesh strainer\nNotes\nWe strongly advise that you contact the dairy provider to determine the precise temperature at which your milk has been pasteurized. No mozzarella recipe will be successful with ultra-pasteurized milk, but even milks labeled \"pasteurized\" may not work. Seek out non-homogenized milk that has been pasteurized at 170°F (77°C) or lower. The whey can be uncomfortably hot during the stretching step; we recommend wearing clean, heavy rubber gloves or a double layer of latex gloves to protect your hands.\nMozzarella\nItalian\nSummer Snacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fresh-homemade-mozzarella.webp?"
}