{
  "url": "https://www.seriouseats.com/how-to-cook-couscous-recipe-8771679",
  "image_url": "https://www.seriouseats.com/thmb/5TZQVH17rNAqOMhR0Xm8sx2neu4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250108-SEA-HowtoMakeFluffyPerfectPlain-Couscous-AmandaSuarez-hero2-2a9d64ce54bb4f18878bdec3ca24da9a.jpg",
  "tags": [
    "Rice & Grain Sides",
    "The Latest",
    "Rice & Grains"
  ],
  "title": "Simple Fluffy Couscous",
  "full_text": "Simple Fluffy Couscous\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nTotal\n45 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\n3 cups (\n510\ng\n) dry\ncouscous\n(see notes)\n1 1/2\ncups\n(360g) cold or room temperature\nhomemade chicken\nor\nvegetable stock\nor store bought low-sodium chicken or vegetable broth or water, plus more as needed\n1/2\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt or fine sea salt use half by volume, plus more to taste\n3 tablespoons (\n45\nml\n)\nolive oil\nor melted butter\nDirections\nAdjust oven rack to middle position and preheat oven to 350℉ (175℃).  In a 9- by 13-inch baking dish, add couscous and pour the liquid over top. Use your hands to mix the couscous evenly, making sure all the grains are moistened. Let sit at room temperature until all liquid is absorbed, about 15 minutes.\nSerious Eats / Amanda Suarez\nUse your fingers (or a fork) to separate the grains of couscous until light, fluffy, and well separated. Check their consistency—the grains should be plump but still hold their shape when pressed between two fingers. If your couscous is still hard, add 1/2 cup of stock, broth, or water, let sit for 15 additional minutes, and fluff again.\nSerious Eats / Amanda Suarez\nAdd salt and olive oil or melted butter to grains and use fingers to mix thoroughly.\nSerious Eats / Amanda Suarez\nCover tightly with foil and bake until couscous grains are fully tender and hot, 30 to 35 minutes. Fluff with a fork and season to taste with salt. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9- by 13-inch baking dish\nNotes\nWhen selecting couscous, make sure you purchase couscous made with 100% semolina durum wheat. The brands I recommend are Dari, Tria, and Mazyana, which can be purchased as specialty markets or online.\nMake-Ahead and Storage\nRice & Grain Sides\nThe Latest\nRice & Grains"
}