{
  "url": "https://www.seriouseats.com/how-to-make-red-vermouth-homemade-sweet-vermouth-recipe",
  "image_url": "https://www.seriouseats.com/thmb/lSaCD6CvYtKG2T3fZB5Lc3zwbaE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111216diyvermouth-eb3a4710024143a0b1250dabc1261507.jpg",
  "tags": [
    "Liqueurs & Fortified Wines"
  ],
  "title": "DIY Sweet Vermouth Recipe",
  "full_text": "DIY Sweet Vermouth Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n30 mins\nCooling Time\n15 mins\nTotal\n40 mins\nServes\n25 servings\nMakes\n750 ml\nCook Mode\n(Keep screen awake)\nIngredients\n1\norange\n3 1/4\ncups\nwhite wine\n, divided\n1\ncinnamon\nstick\n1\nteaspoon\ndried chamomile\n8\ncardamom\npods\n1\nstar anise\n1\nteaspoon\ndried lavender\n1/4\nteaspoon\nwormwood leaf\n1/4\ncup\nsugar\n1/4\ncup\nboiling\nwater\n1/2\ncup\nbrandy\n1/2\ncup\nsweet\nor India\nsherry\nDirections\nZest orange and set aside the rest of the orange for another use.\nPour 1 cup of wine into a pot and set the rest aside. Add all orange zest, cinnamon stick, chamomile, cardamom, star anise, lavender, and wormwood, and cook on medium heat until it comes to a boil, about 5 minutes. Reduce heat to low, cover, and cook for an additional 5 minutes. Remove from heat. Strain out solids and return liquid to pot.\nIn a separate pot, pour in sugar and cook on medium heat, stirring frequently, to caramelize it. Once sugar melts into a caramel-colored liquid, in about 5 minutes, turn off heat and let caramelized sugar cool.\nBring water to a boil in a saucepan or tea kettle, then measure 1/4 cup and slowly pour it into caramelized sugar, stirring as you pour. Be careful!\nAdd remaining wine (2 1/4 cups) to the herb-infused wine. Bring it to a boil, then pour it slowly into the pot of caramelized sugar syrup, stirring frequently to integrate them. Add brandy and sherry, then let cool. Pour cooled mixture into a bottle, seal and store in the refrigerator.\nNotes\nWormwood leaf is a bitter herb that can be a bit difficult to find. Contrary to rumor, a little wormwood in your cocktail will not cause hallucinations. Lhasa Karnak sells it online and at their Berkeley stores.\nUse caution when you caramelize sugar, as it becomes scalding hot. If you pour a cool liquid on hot caramelized sugar, it will harden like candy.\nVermouth should be stored in the refrigerator and is best if used within a month. Though it will take longer than that for it to \"go bad,\" like wine it will taste flat and develop off flavors if kept too long.\nSpecial Equipment\nZester or peeler\nLiqueurs & Fortified Wines",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/diy-sweet-vermouth-recipe.webp?"
}