{
  "url": "https://www.seriouseats.com/how-to-poach-chicken-recipe-8641609",
  "image_url": "https://www.seriouseats.com/thmb/wMWBhm-xjN__vswJrG0WDicgJyE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240501-PoachedChicken-AmandaSuarez-hero-8327e0f2e64d450cb81505ef9c582cc5.jpg",
  "tags": [
    "Chicken Breast",
    "The Latest",
    "Mains"
  ],
  "title": "Foolproof Juicy Poached Chicken",
  "full_text": "Foolproof Juicy Poached Chicken\nClose\nJump to recipe\nPrep\n0 mins\nCook\n45 mins\nTotal\n45 mins\nServes\n2 servings\nMakes\n2 chicken breasts\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\n(\n2\nL\n) cold\nwater\n1 1/2\ntablespoons\n(\n15\ng\n)\nkosher salt\n2\nmedium skin-on, bone-in\nchicken breast\nhalves\n(about\n1 1/2\npounds\n;\n680\ng\n)\nAromatic herbs and\nvegetables\nof your choosing, such as yellow or white onion, garlic, carrot, celery, scallion, ginger, and parsley sprigs (see notes)\nDirections\nIn a large saucepan, combine water and salt, stirring to dissolve salt. Add chicken and aromatics and set over medium-high heat until water temperature reaches between 150 and 160°F on an instant-read thermometer; adjust heat to maintain water temperature in the 150–160°F range. (It's okay if the temperature bounces around a little, but try to keep it above 150 and below 170°F.) Cook until thickest part of chicken registers 150°F on an instant-read thermometer, about 30 minutes to 1 hour (timing is difficult to estimate as it is heavily influenced by both the temperature at which you're able to hold the poaching liquid and also the size of the chicken breast used). Remove chicken from broth and let cool. Strain broth through a fine-mesh strainer.\nSerious Eats / Amanda Suarez\nRefrigerate chicken either submerged in cooled broth or the two components separately in airtight containers until ready to use as desired.\nSerious Eats / Amanda Suarez\nNotes\nThere's no need to be precise with the aromatics, though for this quantity of chicken, roughly one medium or large onion, one medium or large carrot, one or two celery ribs, and a few cloves of garlic , and a few parsley sprigs would be an appropriate amount. You can use as many or as few aromatics as you like: only onion and garlic, for example, in which case you might want to use two or three onions and a few more cloves of garlic. Another approach could be to use only scallion and ginger if the chicken is intended for Asian dishes where that flavor profile might be a better match. There are no hard rules, though—just use your judgement and follow your preferences.\nSpecial Equipment\nInstant-read thermometer, fine-mesh strainer\nRead More\nJuicy and Tender Poached Chicken With Watercress Dressing\nPoached Chicken and Asparagus With Green Goddess Sauce\nThe Best Classic Chicken Salad Sandwich\nChicken Breast\nThe Latest\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/foolproof-juicy-poached-chicken.webp?"
}