{
  "url": "https://www.seriouseats.com/how-to-make-sourdough-bread",
  "image_url": "https://www.seriouseats.com/thmb/veK-FsYcICzP38Mm5f56aAkKjH4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__07__20201212-Sourdough-Batard-sasha-marx-1-06120c6c044b4598a5b8613611a4b373.jpg",
  "tags": [
    "Yeast Breads"
  ],
  "title": "How to Make a Sourdough Bread Loaf Recipe",
  "full_text": "How to Make a Sourdough Bread Loaf Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n40 mins\nActive\n4 hrs\nRising and Resting Time\n26 hrs 5 mins\nTotal\n27 hrs 10 mins\nServes\n10\nto 12 slices\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\nFor The Levain:\n28\ng\n(\n1\nounce\n;\n1/4\ncup\n) unbleached\nall-purpose flour\n28\nml\n(\n1\nounce\nor\n2\ntablespoons\n)\nwater\n28\ng\n(\n1\nounce\nor\n2\ntablespoons\n) mature\nsourdough starter\nFor The Dough:\n270\ng\n(\n9 1/2\nounces\n)\nunbleached all-purpose flour\n, plus more for dusting\n56\ng\n(\n2\nounces\nor\n1/2\ncup\n) sifted\nwhole-wheat flour\n240\nml\n(\n1\ncup\n)\nwater\n8\ng\nsalt\nRice flour\n, for dusting\nDirections\nFor The Levain:\nStir flour, water, and starter in a 1-cup container until smooth. Cover and ferment as close to 78-80°F (26-27°C) as possible until roughly tripled in volume, about 5 hours (you can use a rubber band to help mark the starting volume).\nSerious Eats / Tim Chin\nFor The Dough:\nWhen the levain has 1 hour of fermentation time left, whisk all-purpose flour and whole wheat flour in a large bowl until combined, about 30 seconds. Using a wooden spoon or rubber spatula, stir in water until dough forms and no dry spots remain. Cover with plastic wrap and let rest 1 hour at room temperature.\nSerious Eats / Tim Chin\nSet bowl of dough on digital scale and tare scale to zero. Using a clean wet hand or small rubber spatula, scrape 65g (about 2 1/3 ounces) levain onto dough. (Use leftover levain to continue feeding your starter.) Then, using wet fingers of one hand, dimple levain into dough surface, making sure to evenly distribute it and drive it down into the dough. Massage dough using your fingers and thumb to efficiently incorporate levain. With cupped hand, use a scooping motion to mix dough until starter is well incorporated, about 2 minutes. Cover with plastic wrap and rest for 30 minutes as close to 75°F (24°C) as possible.\n0:50\nSTEP 3\nSprinkle salt evenly all over dough. Using clean wet fingers, dimple salt thoroughly into dough. With cupped hand, use a scooping motion to mix dough until salt is well incorporated and dough becomes smooth, 2 to 3 minutes. Transfer dough to an 8-inch square baking dish. Cover with plastic and rest until dough is loose enough to begin the coil foldings, about 45 minutes at 75°F (24°C). If dough is still too taut, give it more time to relax.\n1:45\nSTEP 4\nFirst Folding:\nUsing two clean wet hands, slide hands under left and right sides of dough, then lift dough slowly while bringing it towards you slightly; the dough will stretch over your hands while maintaining contact with the top and bottom sides of the vessel. Continue lifting the dough until the dough releases from the top side of baking dish. (If dough stretches and stretches and doesn't lift from top side of baking dish, gently lay the dough you're holding back down, then repeat this lifting and stretching step once more; the top side of dough should release on the second try.) Once top side of dough detaches from baking dish, lay the dough you're holding down onto the top side of the baking dish; the dangling dough will naturally fold under itself when you do this. Rotate vessel 180°. Repeat folding process once more. Rotate dish 90° and repeat folding process with third edge. Rotate dish 180° and repeat folding once more for fourth edge. At this point your dough should have an even square shape. Cover and proof for 60 minutes at 75°F (24°C).\n0:50\nSTEP 5\nSecond Folding:\nRepeat folding instructions from Step 5. Cover and proof for 90 minutes at 75°F (24°C).\n0:39\nSTEP 6\nThird Folding:\nRepeat folding instructions from Step 5. Cover and proof at 75°F (24°C) until dough has increased in size by roughly 60%, and is slightly domed and puffy, 90 to 180 minutes.\n0:43\nSTEP 7\nShaping:\nDust oval banneton lightly with rice flour (if using banneton without liner, dust heavily). Lightly dust dough and counter with all-purpose flour. Uncover dough and invert onto floured counter. Using floured hands, gently pinch right side of dough, stretch it outward about 4 inches, then gently fold over so that edge meets the middle of the dough. Repeat stretching and folding on left side. Starting from top of dough, use both hands to lightly stretch dough about 2 inches, then roll over toward middle of dough; continue to gently roll dough toward yourself until seam is on underside and dough is an even, roughly 9-inch long oval shape. Using your fingers, pinch ends to seal. Using a bench scraper, gently flip dough so that seam is facing up. Using two floured hands, gently pick up dough so that it is cradled lengthwise in cupped palms, then gently lay it seam side up in prepared banneton. Cover and proof at room temperature for 15 to 20 minutes.\n0:56\nSTEP 8\nPlace proofed dough in refrigerator set no higher than 38°F (3°C). Let rest overnight, at least 12 hours and up to 16 hours.\nScoring and Baking:\nCut 9-inch by 7-inch rectangle of parchment paper; trim corners to produce approximate oval shape. Place top and bottom of combo cooker on a rimmed baking sheet set on rack in middle position in oven, and heat oven to 485°F (250°C) for 45 minutes. Remove dough from refrigerator, uncover, and place prepared parchment rectangle on top of banneton. Place a cutting board over parchment. Using both hands, invert so that bottom of banneton is facing up, leaving shaped dough on the parchment; remove banneton. Remove cooker bottom from oven and place on heatproof surface. Using a spray bottle, mist dough lightly with water. Holding bread lame or sharp knife at 10- to 30-degree angle to loaf, make one long, 1/2-inch deep slash running the length of dough. With one hand, hold cutting board with dough and parchment over the combo cooker, and with your other hand, grab parchment by one end, and carefully slide into pan (both parchment and dough). Cover pan with cooker top and place in oven. Bake bread for 20 minutes.\n0:21\nSTEP 10\nOnce bread has baked for 20 minutes, remove lid, and reduce oven temperature to 450°F (230°C). Continue to bake until bread is dark brown, blistered, and exposed side shows gradient of browning, about 15 to 20 minutes longer. Transfer pan to a heatproof surface, carefully remove bread from pan, and transfer to a wire rack. Allow bread to cool for at least 2 hours before slicing and serving.\nSpecial Equipment\nDigital scale\n,\nsquare baking dish\n,\nthermometer\n,\noval banneton\n,\nbread lame\nor\nsharp knife\nNotes\nThis recipe produces extra levain so that you can continue to maintain your starter. You will have 85 grams of mature levain, of which 65 grams will be mixed into the dough, and 20 grams will be left over to continue feeding your starter.\nMake-Ahead and Storage\nStore loaf at room temperature wrapped in paper or in a paper bag. You can also freeze it wrapped well in a layer of aluminum foil followed by a layer of plastic wrap; defrost while sealed at room temperature or in a very low oven (make sure to remove layer of plastic wrap if defrosting in the oven).\nRead More\nSourdough Starter\nThe Science of Sourdough Starters\nThe Best Flour for Sourdough Starters: An Investigation\nHow to Knead, Fold, and Shape Sourdough Bread\nThe Best Bread-Making Tools\nYeast Breads"
}