{
  "url": "https://www.seriouseats.com/how-to-make-butter-7496926",
  "image_url": "https://www.seriouseats.com/thmb/XhYdygsvtt2mQ4LEH1e_yJszGKM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230519-SEA-HowToMakeButter-Amanda-Suarez-hero-ce0a9772a5ef4ff283ab3dde2c746f19.jpg",
  "tags": [
    "Heavy Cream",
    "The Latest"
  ],
  "title": "How to Make Butter",
  "full_text": "How to Make Butter\nClose\nJump to recipe\nPrep\n25 mins\nTotal\n25 mins\nMakes\n12 ounces\nCook Mode\n(Keep screen awake)\nIngredients\n1\nquart\n(\n946\nml\n) heavy cream or\ncrème fraîche\n(see notes)\nKosher or\nsea salt\n(optional)\nDirections\nIn a stand mixer fitted with the whisk attachment or in a food processor or in a large mixing bowl with a whisk, beat cream until it reaches and then passes the whipped stage, large globules of butterfat coalesce, and liquid begins sloshing all around it. The timing for this can vary depending on the tool used and the type of cream used, but can take up to about 15 minutes in a stand mixer (crème fraîche, in our experience, turns to butter much, much faster).\nSerious Eats / Amanda Suarez\nDrain buttermilk from butterfat, saving buttermilk for another use (such as to drink). Place butter in mixing bowl, fill with cold water, and gently knead, forming butterfat into a single mass as you wash away any remaining buttermilk. Drain and repeat washing in cold water until water is clear.\nSerious Eats / Amanda Suarez\nDrain butter one final time, then gently knead on a clean work surface to express any remaining water, blotting with clean towels to dry as needed. If seasoning butter with salt, sprinkle salt on top and knead it in until evenly distributed.\nSerious Eats / Amanda Suarez\nForm butter into an even, compressed shape, such as a log. Wrap tightly in plastic or waxed paper, and keep refrigerated.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nStand mixer, food processor, or whisk\nNotes\nFor sweet (that is, not tangy) butter, use fresh cream. For tangy cultured butter, use crème fraîche.\nMake Ahead and Storage\nWhile store-bought butter can be left at room temperature on a\nbutter dish\n, this homemade butter should be tightly wrapped and refrigerated. Discard if it grows sour or moldy.\nHeavy Cream\nThe Latest"
}