{
  "url": "https://www.seriouseats.com/how-to-boil-corn-8678609",
  "image_url": "https://www.seriouseats.com/thmb/1Vl9G52_YL5XdiwK78ylIlQyYfY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240717-BoilingCorn-AmandaSuarez-SEA-f80166320b364edbbea05d65e538e270.jpg",
  "tags": [
    "Corn",
    "The Latest",
    "How-Tos",
    "Summer Sides"
  ],
  "title": "How to Boil Corn: Our Tests Reveal It's Not What Anyone Tells You",
  "full_text": "How to Boil Corn: Our Tests Reveal It's Not What Anyone Tells You\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nServes\n1\nto 8 ears of corn\nCook Mode\n(Keep screen awake)\nIngredients\n1 to 8\nears\nof fresh, sweet summer\ncorn\nSalt and\nbutter\n, for serving (if desired)\nDirections\nCold-Start \"Boiled\" Corn on the Cob\nShuck the corn. In a large Dutch oven or pot, cover the ears with cold water. Set over high heat and bring to 180°F (82°C). Immediately cover and turn off the heat. Let stand for at least 10 and up to 25 minutes. Serve salted and buttered (or however you prefer).\nSerious Eats / Daniel Gritzer\nSteamed Corn on the Cob\nSet up a steamer large enough to hold the corn without the corn touching the water; cover and bring to full steam over high heat. Meanwhile, shuck the corn.\nAdd corn to steamer, cover, and cook until corn is plump and tender, 3 to 4 minutes. Remove from heat and serve corn salted and buttered (or however you prefer).\nSerious Eats / Daniel Gritzer\nMicrowaved Corn on the Cob\nDo not shuck the corn; if desired, cut off the bottom of each cob through the husk to expose the cob itself, just above where the stalk end meets the cob (this can make shucking after cooking easier).\nMicrowave the corn on high power until just tender: 2 to 3 minutes for 1 ear; 3 to 4 minutes for 2 or 3 ears; 5 or 6 minutes for 4 ears (exact time will depend on microwave power and corn size). Let cool slightly, then shuck; if you removed the bottom of each cob, you should be able to shake the ear out so that it comes cleanly free of the husk and silks.\nCorn\nThe Latest\nHow-Tos\nSummer Sides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-boil-corn-our-tests-reveal-its-not-what-anyone-tells-you.webp?"
}