{
  "url": "https://www.seriouseats.com/how-to-cook-perfect-grilled-or-roasted-rack-of-lamb-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8u5kt-7WE3cRPi2q8NmLmcyN2Qg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__20100402-perfect-lamb-rack-carousel-afcbffda77d54272ac5939276ea22895.jpg",
  "tags": [
    "Lamb Mains",
    "Sous Vide",
    "Rack of Lamb"
  ],
  "title": "Perfect Slow-Cooked Rack of Lamb for the Grill or the Stovetop Recipe",
  "full_text": "Perfect Slow-Cooked Rack of Lamb for the Grill or the Stovetop Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nActive\n15 mins\nResting Time\n5 mins\nTotal\n60 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlamb\nracks\nwith\n8\nribs\neach (\n3 to 4\npounds\ntotal)\nKosher salt\nand freshly cracked black pepper\n8\nsprigs\nrosemary\nor thyme (optional)\n2\nmedium\nshallots\n, roughly chopped (optional)\n4\nmedium\ncloves garlic\n, roughly chopped (optional)\n1\ntablespoon\nvegetable oil\nDirections\nSeason lamb generously with salt and pepper on all sides. Place inside 2 gallon-sized zipper lock bags along with optional aromatics (for particularly large racks, split into four 4-rib sections and use more bags as necessary). Squeeze out as much air from bags as possible with hands and close zipper lock, leaving 1-inch un-sealed. Slowly submerge lamb in large pot of water, until only sealing edge of bags is exposed. Any remaining air should be forced out of bag as it is submerged. Seal bag completely. Repeat with remaining bags, then set all bags aside.\nHeat at least 2 gallons of water on the stovetops to 130°F for medium rare or 145°F for medium, using instant-read thermometer to ensure temperature accuracy (in some homes, the hot tap may be hot enough without having to use the stovetop). Pour water into picnic-size chest cooler. Add water until cooler is filled with water at desired temperature, sealing cooler in between additions in order to retain heat. Add lamb to cooler, seal, and set its warm spot for at least 45 minutes, and up to 3 hours, checking temperature of water after 15 minutes to ensure that it isn't losing heat too rapidly (water should lose at most 1 degree of temperature after 15 minutes—if it has lost more, top up with boiling water, and drape cooler with several bath towels to help insulate.\nSerious Eats / J. Kenji Lopez-Alt\nFor Stovetop:\nRemove lamb racks from bags, discard aromatics (if using), and pat dry with paper towels. Heat oil in a heavy-bottomed 12-inch stainless steel, cast iron, or non-stick skillet over high heat until lightly smoking. Add lamb to skillet fat-side down and sear until well-browned on all sides, turning with tongs as necessary, about 5 minutes total (for particularly large racks, sear lamb in 2 batches, tenting first batch with foil after searing to retain heat). Tent seared lamb with foil, allow to rest 5 minutes, carve, and serve.\nSerious Eats / J. Kenji Lopez-Alt\nFor Grill:\nLine large chimney starter 3/4 filled with charcoal (4 quarts, about 75 briquettes), and burn until coals are coated in thin layer of gray ash, about 20 minutes. Empty coals and spread evenly over half of grates. Position grill grates on top of grill, cover grill, and heat until grate is hot, about 5 minutes. Scrub grill clean with grill brush if necessary. Meanwhile, remove lamb racks from bags, discard aromatics (if using), and pat dry with paper towels. Rub lamb racks evenly with oil. Place racks, fat-side down over coals and grill until well browned on all sides, about 6 minutes total, moving lamb to cooler side of grill as necessary to avoid flare-ups. Remove lamb from grill, tent with foil, allow to rest 5 minutes, carve, and serve.\nNotes\nI prefer leaving extra fat and breast meat attached to the ribs for gnawing and bone-sucking but if desired it can be removed following\nour instructions on frenching here\n. Make sure you buy lamb racks with the chine bone removed to make it easier to cut between chops after cooking. Most pre-packaged lamb will already have the chine bone removed. If buying lamb from the butcher's case, ask your butcher to do it for you—it's impossible to do at home without a hacksaw.\nSpecial Equipment\nBeer cooler or sous-vide circulator\nLamb Mains\nSous Vide\nRack of Lamb",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/perfect-slow-cooked-rack-of-lamb-for-the-grill-or-the-stovetop-recipe.webp?"
}