{
  "url": "https://www.seriouseats.com/how-to-make-lardons-recipe-8716144",
  "image_url": "https://www.seriouseats.com/thmb/oapw7OvlHNjiyrzF0PHXvrlcklA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240920-Lardons-AmandaSuarez-11-a7c4feec83f04e2da27dc0d4490b4ee5.jpg",
  "tags": [
    "Bacon",
    "The Latest",
    "French",
    "Pork Belly"
  ],
  "title": "Lardons (Crisp and Chewy Bacon)",
  "full_text": "Lardons (Crisp and Chewy Bacon)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n6 mins\nTotal\n21 mins\nServes\n4\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(225g) ventrèche, pancetta, or slab bacon, or thick-cut\nbacon\nslices\nDirections\nIf Using Ventrèche, Whole Pancetta, or Slab Bacon:\nIf your pork belly is rolled, try to unroll it and press it flat; if this is not possible, proceed with recipe but see notes below for additional instructions on cutting the rolled meat. Freeze the pork for at least 15 minutes or up to 30 minutes (partially freezing makes it easier to slice). Using a sharp chef's knife, cut into 1/2-inch-thick strips (like rashers of bacon, these strips should transect the belly's layers of fat and meat).\nSerious Eats / Amanda Suarez\nCut strips crosswise into 1/4-inch-wide batons (lardons).\nSerious Eats / Amanda Suarez\nIf Using Thick-Cut Bacon:\nOn a parchment- or plastic-lined large plate or baking sheet, lay slices side by side and freeze for 15 minutes (partially freezing makes it easier to slice). Stack slices on top of each other and cut into 1/2-inch wide batons (lardons).\nIn a 12-inch skillet, combine pork with 2 tablespoons water, then cook over medium-low heat, stirring frequently and adjusting heat to avoid burning, until fat is rendered and lardons are browned but still chewy, 6 to 12 minutes. Using a slotted spoon, transfer bacon to a paper towel–lined plate. Use lardons immediately, or refrigerate following instructions below.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-inch skillet\nNotes\nIf using rolled round pancetta, cut each pancetta slice lengthwise into thirds, then cut each strip crosswise into 1/4-inch-wide batons (lardons).\nMake-Ahead and Storage\nThe cooked lardons and rendered fat can be refrigerated separately in airtight containers; the cooked lardons can be refrigerated for up to 3 days, while the rendered fat can be refrigerated for up to 1 month or frozen for up to 3 months. The rendered fat can be used to fry potatoes, cook eggs, make\nred-eye gravy\n, or in any other application you'd use bacon fat.\nBacon\nThe Latest\nFrench\nPork Belly",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lardons-crisp-and-chewy-bacon.webp?"
}