{
  "url": "https://www.seriouseats.com/how-to-make-holiday-flourless-chocolate-chestnut-torte-recipe",
  "image_url": "https://www.seriouseats.com/thmb/h-45Ctc14csLJyVIcoChK-jUv1A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__12__20141215-flourless-chocolate-chestnut-torte-yvonne-ruperti-1895547ce4744376a7c42135b3bad35b.jpg",
  "tags": [
    "Layer Cake",
    "Chocolate",
    "Chestnut",
    "Passover",
    "Winter Desserts"
  ],
  "title": "Flourless Chocolate-Chestnut Torte Recipe",
  "full_text": "Flourless Chocolate-Chestnut Torte Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n30 mins\nChilling Time\n4 hrs\nTotal\n4 hrs 55 mins\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\n10\ntablespoons\n(\n5\nounces\n)\nunsalted butter\n, softened, divided\n2/3\ncup\n(\n4 2/3\nounce\n) plus\n2\ntablespoons\ngranulated sugar\n, divided\n12\nounces\n(60 %)\nbittersweet chocolate\n, chopped\n3/4\ncup\nheavy cream\n, divided\n2\n(15-ounce) cans\nchestnut\npurée, divided\n1\ntablespoon\nplus\n1\nteaspoon\nbourbon\n, divided\n5\nlarge eggs\n1/2\ncup\nhazelnuts\n, lightly toasted, finely chopped\n8\ntablespoons\nconfectioner's sugar\n, divided\n1/2\nteaspoon\nvanilla extract\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F. Coat bottom and sides a 9-inch springform pan with 2 tablespoons butter. Evenly sprinkle 2 tablespoons granulated sugar into pan to coat.\nHeat chocolate and 1/2 cup cream in heatproof bowl over barely simmering water until smooth. Keep warm. Mash 1 can chestnut purée in large bowl with remaining 8 tablespoons butter and 1 tablespoon bourbon until creamy; set aside.\nIn stand-mixer bowl fitted with whisk attachment, beat eggs and remaining 2/3 cup sugar at high speed until light, creamy, and doubled in volume, about 5 minutes.\nStir chocolate mixture into chestnut mixture until smooth. Fold in 1/3 of egg mixture into chocolate-chestnut mixture to lighten. Gently fold in remaining egg mixture in 2 batches, folding gently until no streaks remain. Fold in nuts.\nPour batter into prepared pan and bake until edges are puffed and center is just set, but slightly wobbly, about 35 minutes. Transfer pan to cooling rack to cool, and then chill until set, about 4 hours.\nUsing mixer fitted with paddle, beat remaining can of chestnut purée with 6 tablespoons confectioners sugar until no lumps remain. Slowly mix in remaining 1/4 cup cream, remaining 1 teaspoon bourbon, and vanilla until combined. Adjust sweetness to taste, and then adjust consistency of chestnut purée with small amounts of water until a paste forms that easily presses through a potato ricer (see note).\nRemove torte from pan and place on serving plate. Press chestnut purée through the potato ricer into strands on top of torte in a circular motion. Dust with remaining 2 tablespoons confectioners' sugar and serve cold (for a more dense texture) or at room temperature (for a more mousse-like texture).\nSpecial equipment\n9-inch springform pan, potato ricer, stand mixer\nThis Recipe Appears In\nThe Perfect Holiday Dessert: Flourless Chocolate-Chestnut Torte\nLayer Cake\nChocolate\nChestnut\nPassover\nWinter Desserts"
}