{
  "url": "https://www.seriouseats.com/how-to-make-spinach-artichoke-dip-pierogi-dumplings-recipe",
  "image_url": "https://www.seriouseats.com/thmb/TpawoL_x4zXwE8fDTGHpXFgwojY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__03__20150309-spinach-artichoke-dip-pierogi-inside-shot-morgan-eisenberg-f8e13dc8616043cba205fec6fae46152.jpg",
  "tags": [
    "Polish",
    "Vegetarian Snacks & Appetizers",
    "Stovetop",
    "Artichoke",
    "Spinach"
  ],
  "title": "Spinach and Artichoke Dip-Filled Pierogi Recipe",
  "full_text": "Spinach and Artichoke Dip-Filled Pierogi Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n45 mins\nActive\n90 mins\nTotal\n65 mins\nServes\n30 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/4\ncups\nall-purpose flour\n, plus extra for dusting\n1\nteaspoon\nkosher salt\n, plus more as needed\n1\nlarge\negg\n, beaten\n1\ncup\nsour cream\n, plus more for serving\n7\ntablespoons\nunsalted butter\n, softened, divided\n2\nlarge\ncloves garlic\n, minced\n10\nounces\nfrozen chopped spinach\n, thawed and drained (see note)\n8\nounces\ncanned artichoke hearts\n8\nounces\ncream cheese\n, softened\n1/4\ncup\ngrated Parmigiano-Reggiano cheese\n1/4\ncup\nshredded mozzarella cheese\n1/4\ncup shredded\nprovolone cheese\nFreshly ground black pepper\nPinch\nground nutmeg\n1\ntablespoon\nvegetable or\ncanola oil\nHalved cherry tomatoes\n, for garnish\nCilantro or\nparsley, chopped\n, for garnish\nSour cream\n, for serving\nDirections\nIn a large bowl, whisk together flour and 1 teaspoon salt. Add egg, 1 cup sour cream, and 4 tablespoons softened butter. Stir until well combined and the dough pulls away from the bowl. If dough is too dry, add one tablespoon of water at a time until it comes together. Cover and refrigerate for at least 30 minutes or up to 48 hours.\nMeanwhile, heat 1 tablespoon butter in a skillet over medium heat. Add garlic and cook until fragrant, about 1 minute. Add spinach and cook, stirring often, until any remaining water has evaporated. Add all 4 cheeses, artichokes, salt and pepper, and nutmeg and stir until well-combined and completely melted. Remove from heat and set aside to cool.\nRemove the dough from the refrigerator and turn out onto a lightly floured work surface. Roll the dough out to a sheet about 1/16-inch thick. Using a 3-inch circular cookie cutter or the top of a glass, cut the dough into circles. Roll the excess dough into a new dough ball and wrap with plastic wrap; let rest for 5 minutes, then roll out and repeat. Discard any remaining dough scraps.\nPlace 2 teaspoons of filling in the center of each dough round. Working one at a time, use a wet finger to moisten the edge of each round with water, then fold into a semi-circle around the filling. Gently pinch edge together to seal, then press with tines of fork to make pleated edge. At this point, the pierogi can be frozen and saved for later use, if desired (to freeze, arrange pierogi on parchment-lined baking sheets and freeze, then transfer to zipper-lock bags and return to freezer until ready to use).\nBring a large pot of salted water to a gentle boil and add fresh or frozen pierogi in small batches. Boil until they float to the surface and are cooked through, about 3 minutes. Remove with a slotted spoon and let drain in a colander. Repeat until all of the pierogi have been boiled.\nHeat the oil and remaining 2 tablespoons butter in a non-stick skillet over medium heat until butter is melted. Working in batches, saute pierogi until crisp and browned on each side, about 6 minutes per batch.\nTransfer pierogi to a plate and top with cherry tomatoes, chopped parsley or cilantro, and sour cream. Serve warm.\nNotes\nMake sure to drain the spinach well before using. If the spinach and artichoke mixture is too wet, it will cause the pierogi to fall apart.\nThis Recipe Appears In\nWhy Dip it? Put Spinach and Artichoke Dip Inside Pierogi Instead\nPolish\nVegetarian Snacks & Appetizers\nStovetop\nArtichoke\nSpinach",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/spinach-and-artichoke-dip-filled-pierogi-recipe.webp?"
}