{
  "url": "https://www.seriouseats.com/how-to-roast-spaghetti-squash-7555179",
  "image_url": "https://www.seriouseats.com/thmb/r88v64cHo_sgPEhu8IfDYV6Pz1Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230629-SEA-HowtoRoastSpaghettiSquash-LorenaMasso-009-b2af1f738af741dba3034872b7cccf52.jpg",
  "tags": [
    "Winter Squash",
    "The Latest",
    "Roasted Vegetables",
    "Fall"
  ],
  "title": "How to Roast Spaghetti Squash",
  "full_text": "How to Roast Spaghetti Squash\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nCooling Time\n10 mins\nTotal\n65 mins\nServes\n4\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n3 to 3 1/2-pound; 1.4 to 1.6 kg\n)\nspaghetti squash\n1\ntablespoon\nvegetable oil\nKosher salt\nand freshly\nground black pepper\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (200°C). Line a rimmed baking sheet with parchment paper and set aside.\nSerious Eats / Lorena Masso\nCut off both ends (about 1 to 1 1/2 inches from each end) of the spaghetti squash, so you can just see the opening of the seed cavity. Discard squash ends. Cut squash in half crosswise through its equator, then scrape out and discard seeds and any loose stringy fibers. Drizzle with oil, rubbing all over until both flesh and skin of squash are evenly coated. Arrange squash halves, cut side down, on the prepared baking sheet.\nSerious Eats / Lorena Masso\nRoast squash until its flesh is fork-tender, 40 to 45 minutes. Set aside to cool slightly, about 10 minutes.\nSerious Eats / Lorena Masso\nUse a fork to separate and loosen the squash flesh from the skins. Discard skins. Using 2 forks, gently separate flesh into long spaghetti-like strands. Transfer strands of spaghetti squash to a bowl and season with salt and pepper to taste. Toss with butter, extra-virgin olive oil, or sauce of your choosing. Serve.\nSerious Eats / Lorena Masso\nNotes\nThe roasted spaghetti squash can be tossed with a flavorful sauce in a skillet over high heat to coat and warm through, or tossed with a vinaigrette and cooled down for a refreshing salad.\nThis recipe can be doubled and all four squash halves cooked on one baking sheet.\nMake-Ahead and Storage\nRoasted squash can be refrigerated in an airtight container for up to 3 days.\nWinter Squash\nThe Latest\nRoasted Vegetables\nFall",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-roast-spaghetti-squash.webp?"
}