{
  "url": "https://www.seriouseats.com/hummingbird-cake-recipe-8650354",
  "image_url": "https://www.seriouseats.com/thmb/brJE_gJ8VKczrOvwMNjQc2iOA3o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240517-SEA-HummingbirdCake-JenCausey-Hero-3f0da5dee8aa46ae80bd15f97c422831.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Desserts",
    "Pineapple",
    "Banana"
  ],
  "title": "Retro Hummingbird Cake",
  "full_text": "Retro Hummingbird Cake\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nCooling and Chilling Time\n3 hrs\nTotal\n4 hrs\nServes\n10\nto 12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nNonstick baking spray with\nflour\n113\ng\nraw\npecan\nhalves (\n4\nounces\n;\n1\ncup\n), plus more for decorating\n350\ng\ngranulated sugar\n(\n12 1/4\nounces\n;\n1 3/4\ncups\n)\n200\ng\nneutral\noil\n, such as vegetable (\n1\ncup\n;\n240\nml\n)\n3\nlarge\neggs\n2\nteaspoons\nvanilla extract\n2\n(8-ounce) cans\ncrushed pineapple\nin juice, undrained (about\n1 3/4\ncup\n)\n4\nsmall\noverripe\nbananas\n(about\n4 1/2\nounces\n;\n125\ng\neach unpeeled)\n345\ng\nbleached\ncake flour\n(about\n12\nounces\n;\n3\ncups\n)\n1 1/2\nteaspoons\nground cinnamon\n1 1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\nbaking soda\n3/4\nteaspoon\nbaking powder\n1/4\nteaspoon\nground allspice\nFor the Frosting:\n2\n(8-ounce) packages\ncream cheese\n, at room temperature\n226\ng\nunsalted butter\n(\n8\nounces\n;\n1\ncup\n), at room temperature\n400\ng\npowdered sugar\n(\n14\nounces\n;\n3 1/2\ncups\n), sifted\n1\ntablespoon\n(\n15\nml\n) reserved\npineapple juice\n(see below)\n1\nteaspoon\nvanilla extract\nDirections\nPrepare the Cakes:\nAdjust oven rack to middle position and preheat oven to 350°F (175ºC). Lightly grease three 8-inch round cake pans with baking spray and\nline with parchment\n.  Set aside.\nSerious Eats / Jen Causey\nSpread pecan halves in an even layer on a rimmed baking sheet. Bake until fragrant and toasted, about 8 minutes. Set aside until cool enough to handle, then chop finely (pieces no larger than ¼-inch). Set aside.\nSerious Eats / Jen Causey\nIn a large bowl, whisk together sugar, oil, eggs, and vanilla until smooth. Drain 1 tablespoon of juice from crushed pineapple; set aside for Frosting.\nSerious Eats / Jen Causey\nChop 2 of the bananas into small pieces (about 1 cup), and mash the other two (about 2/3 cup). Add chopped and mashed bananas to sugar mixture along with remaining crushed pineapple and its juice. Using a flexible spatula, stir to combine. In another large bowl, whisk together flour, cinnamon, salt, baking soda, baking powder, and allspice until evenly combined.\nSerious Eats / Jen Causey\nPour sugar mixture into flour mixture and, using the same spatula, gently fold until only a few streaks of flour remain. Fold in reserved toasted chopped pecans until evenly dispersed. Divide batter evenly between prepared cake pans (about 650g or 23 ounces per pan). Gently tap pans on counter to smooth batter and release any air bubbles.\nSerious Eats / Jen Causey\nBake until cakes are golden on top, spring back gently to the touch, and an instant read thermometer inserted in the center registers 200°F (93ºC), 25 to 28 minutes.\nSerious Eats / Jen Causey\nCool cakes in their pan on a cooling rack for 10 minutes.  Run an offset spatula or butter knife around edges of cakes, then invert cake onto a plate and transfer back to rack to cool completely, parchment-side down, 1 1/2 to 2 hours.\nSerious Eats / Jen Causey\nPrepare the Frosting:\nIn the bowl of a stand mixer fitted with a paddle attachment, or, using an electric hand mixer, beat cream cheese and butter on medium-low speed until smooth and creamy, 1 to 2 minutes, stopping to scrape down sides as needed. Reduce mixer speed to low, and gradually add powdered sugar, beating until fully incorporated  after each addition. Add reserved 1 tablespoon pineapple juice and vanilla, and increase mixer speed to medium-high; beat until fluffy, 1 to 2 minutes.\nSerious Eats / Jen Causey\nUsing a serrated knife,\nlevel cakes\nif necessary and set the scraps aside for snacking. Remove and discard parchment paper. Place 1 layer, top-side-up, on a turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with 1 cup frosting, using an offset spatula to spread it evenly from edge to edge. Repeat with the second and third layers, placing the cake layers bottom-side up, then cover the top and sides of the cake with a very thin layer of frosting to form a\ncrumb coat\n. Refrigerate, uncovered, until frosting is mostly set, 30 to 40 minutes.\nSerious Eats / Jen Causey\nRemove cake from refrigerator. Using an offset spatula, cover cake with remaining frosting, spreading it as smoothly as you can over top and sides of cake. Decorate with pecans, as desired.\nSerious Eats / Jen Causey\nSpecial Equipment\nThree 8-inch round cake pans, nonstick baking spray with flour, parchment paper, whisk, flexible spatula, stand mixer, offset spatula, serrated knife, turntable\nCakes\nThe Latest\nDesserts\nPineapple\nBanana",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/retro-hummingbird-cake.webp?"
}