{
  "url": "https://www.seriouseats.com/hummus-fatteh-recipe-8641111",
  "image_url": "https://www.seriouseats.com/thmb/D0k8zOh5fpT-OjGhxMNhWRLgYoY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240430-HummusFatteh-Mai-Kakish-12-69de3b3a31964881a1c288b17ffd6cc9.jpg",
  "tags": [
    "Hummus",
    "The Latest",
    "Middle Eastern",
    "Lamb",
    "Beef"
  ],
  "title": "Hummus Fatteh (Hummus With Crisp Pita, Fried Meat, and Pine Nuts)",
  "full_text": "Hummus Fatteh (Hummus With Crisp Pita, Fried Meat, and Pine Nuts)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n105 mins\nSoaking Time\n8 hrs\nTotal\n9 hrs 55 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Fatteh:\n1 1/4\ncups\ndried\nchickpeas\n(\n8\nounces\n;\n226\ng\n), see notes\n1\nteaspoon\nground cumin\n9\nounces\nthin\npita\n(about\n3\nthin\n8-inch pitas\n), cut into 3/4-inch squares (\n250\ng\n; about\n4 1/2\ncups\n)\n1\ncup\ntahini\n(about\n8 1/2\nounces\n;\n240\ng\n)\n1\nlarge\nclove garlic\n(\n10\ng\n), finely minced\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ncup\nfull-fat Greek-style or\nplain yogurt\n(about\n8 1/2\nounces\n;\n241\ng\n)\n1/4\ncup\n(\n60\nml\n) freshly squeezed\nlemon juice\nfrom\n2\nlemons\nFor the Lemon Dressing:\n1\nlarge\nclove garlic\n(\n10\ng\n), finely minced\n1\nmedium\ngreen\nchile\nsuch as jalapeño or Anaheim (\n1 3/4\nounce\n;\n50\ng\n), seeded, stemmed, and finely diced\n2\ntablespoons\n(\n30\nml\n) freshly squeezed\nlemon juice\nfrom\n1\nlemon\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\nKosher salt\nFor the Meat:\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n1\ntablespoon\n(\n15\nml\n) unsalted butter or\nghee\n1/3\ncup\npine nuts\n(\n1 1/2\nounces\n;\n42\ng\n)\n1\npound\n(\n454\ng\n) lamb loin,\nbeef tenderloin\n, or other tender and flavorful quick-cooking steak, cut into 1/2-inch cubes\n1\nteaspoon\nLebanese 7 spice or\nbaharat\n(see notes)\nKosher salt\nFor Serving:\n2\ntablespoons\nfinely chopped flat-leaf\nparsley\nRed pepper flakes\nor pomegranate seeds (optional)\nDirections\nFor the Fatteh:\nIn a large bowl, cover chickpeas with 6 cups (1.4L) cold water. Let stand at room temperature for at least 8 hours or overnight. Drain and rinse chickpeas thoroughly.\nSerious Eats / Qi Ai\nIn a 6- to 8-quart Dutch oven or saucepan, combine chickpeas and cumin. Add enough water to cover by 2 inches (about 8 cups; about 1.9L) and bring to a boil over high heat. Reduce to a simmer, cover with lid slightly ajar, and cook until chickpeas are completely tender but not falling apart, 1 hour 15 minutes to 1 hour 30 minutes. Check on chickpeas, stirring occasionally, and top off with more water if needed; chickpeas should be fully submerged at all times. (See notes if using canned chickpeas.)\nSerious Eats / Mai Kakish\nMeanwhile: Adjust oven rack to middle position and preheat to 350ºF (175ºC). Place sliced pita on a rimmed baking sheet and transfer to oven. Toast, using a spoon or spatula to turn pita occasionally, until squares are completely dry and crisp and starting to darken in color, about 15 minutes. Remove and set aside until ready to use.\nSerious Eats / Mai Kakish\nIn a medium bowl, stir tahini, garlic, salt, yogurt, and lemon juice together until smooth; the sauce should be thick and sticky. When chickpeas are done, add 1/2 cup to 3/4 cup of chickpea cooking liquid to bowl with tahini mixture and whisk well to incorporate. The sauce should have a consistency similar to maple syrup: thick but easily pourable. Set aside until ready to assemble.\nSerious Eats / Qi Ai\nFor the Lemon Dressing:\nIn a small bowl, combine garlic, green chile, lemon juice, and extra-virgin olive oil. Whisk well to combine and season to taste with salt. Set aside.\nSerious Eats / Mai Kakish\nFor the Meat:\nn a 10-inch skillet, heat olive oil and butter over medium heat until butter has melted. Add pine nuts and toast until light golden brown and fragrant, about 1 1/2 minutes. Using a fine-mesh sieve, immediately strain nuts over a small bowl and transfer to a paper-towel lined plate. Set aside. Return fat to pan. Increase heat to medium-high and add lamb or beef and season with spices and salt. Cook, stirring occasionally until meat is nicely browned and cooked through, about 4 minutes. Season to taste with salt.\nSerious Eats / Mai Kakish\nTo Assemble:\nArrange toasted pita on a large, deep serving platter and spoon half of the lemon dressing on top of the pita. Using a ladle, scoop chickpeas, along with about 1/2 cup of their cooking liquid, over the bread, reserving 2 tablespoons of chickpeas to garnish with. (You want the bread to soak up the liquid but not become a mushy mess.)\nSerious Eats / Qi Ai\nPour the tahini and yogurt mixture evenly over the chickpeas. Top with the fried meat and pine nuts. Garnish with the reserved chickpeas, chopped parsley, and pomegranate seeds, if using. Drizzle the remaining lemon dressing over and top with more olive oil if desired. Serve warm.\nSerious Eats / Mai Kakish\nSpecial Equipment\nRimmed baking sheet, 6- to 8-quart Dutch oven or stockpot, whisk, 10-inch skillet\nNotes\nTwo 14-ounce cans of chickpeas, drained and rinsed well, can be substituted for dried chickpeas. In a medium (4 - 6 qt) pot, cover chickpeas generously with water and add cumin. Bring to a simmer over medium heat until beans are heated through. Maintain a low simmer until you finish prepping the rest of the dish.\nLebanese 7 Spice or baharat can be purchased at Arabic grocery stores or online. 1 teaspoon Lebanese 7 Spice or baharat can be substituted with 1/4 teaspoon each of ground allspice, ground cumin, ground black pepper, and ground cinnamon.\nPine nuts are the traditional choice of nut to use, but any combination of pine nuts, cashews, or almonds will work.\nIf you are staying in the spirit of keeping this a frugal dish or simply want to avoid chopping meat, you can use ground beef in place of the lamb loin and beef tenderloin called for here.\nMake-Ahead and Storage\nThe toasted pita chips can be made up to a week in advance and stored in an airtight container\nThe chickpeas can be cooked the day before, refrigerated in their liquid, then reheated in reserved broth when ready to assemble. Reserve chickpea cooking liquid if you plan on preparing the chickpeas and sauce ahead of time.\nIf making tahini and yogurt sauce ahead of time, loosen with chickpea cooking liquid that has been reheated to a simmer, 1 tablespoon at a time, until you reach your desired consistency, before assembling the dish.\nHummus\nThe Latest\nMiddle Eastern\nLamb\nBeef"
}