{
  "url": "https://www.seriouseats.com/hummus-b-tahini-hummus-with-tahini-recipe-8637532",
  "image_url": "https://www.seriouseats.com/thmb/kTtNNAcQCfcqSUR8ImdGZpjVQyc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240422-SEA-HummusBtahini-Mai-Kakish-hero-e0142995ff0a44d19de71237283765fa.jpg",
  "tags": [
    "Middle Eastern",
    "The Latest",
    "Dips",
    "Quick Sides",
    "Chickpeas"
  ],
  "title": "Hummus B'Tahini (Hummus With Tahini)",
  "full_text": "Hummus B'Tahini (Hummus With Tahini)\nClose\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Hummus:\n1\n(14-ounce) can\nor jar of\nchickpeas\n, drained and rinsed well\n1/3\ncup\n(\n90\nml\n) cold\nwater\n(see notes)\n1/3\ncup\ntahini\n(\n3\nounces\n;\n85\ng\n), stirred well before measuring\n2\nteaspoons\nfreshly squeezed\nlemon juice\n, plus more as needed\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n, plus more as needed; if using table salt, use half as much by volume\nFor Serving:\nCooked chickpeas\n, toasted pine nuts, finely chopped parsley, paprika, ground cumin (optional)\nExtra-virgin olive oil\nPita\nSliced tomatoes\n, onions, and Middle Eastern cucumber pickles (optional)\nDirections\nSet aside 1 tablespoon of chickpeas to garnish with, if desired. In a tall container wide enough to fit the head of an immersion blender, combine remaining chickpeas, water, tahini, lemon juice, and salt. Place head of immersion blender into bottom of the cup and blend, moving it up and down and over the top until smooth, about 2 minutes. Alternatively, place chickpeas, water, tahini, lemon juice, and salt into a small food processor and process until smooth, scraping down as needed, about 2 minutes. Hummus should be thick and creamy; if it is too thick, add 1 tablespoon (15ml) of water at a time to thin to desired consistency. Season to taste with salt and lemon juice.\nSerious Eats / Mai Kakish\nTo Serve:\nServe hummus in a shallow bowl; using the back of the spoon to form a small well in the center. Garnish with cooked chickpeas (if using), toasted pine nuts, fresh parsley, paprika, and/or ground cumin, if using, and drizzle generously with olive oil. Serve with pita and sliced tomatoes, pickles, and onions, if desired.\nSerious Eats / Mai Kakish\nSpecial Equipment\nImmersion blender\nNotes\nThe recipe works well if doubled or tripled.\nHomemade chickpeas can be used in place of canned or jarred chickpeas. Just make sure they are cooked to a point where they are falling apart. This also ensures extra creamy and smooth hummus. But always blend when cold.\nTo prepare chickpeas from scratch: In a large bowl, cover 1 pound (454g) of dried chickpeas generously with cold water and let stand at room temperature overnight. Drain and rinse chickpeas thoroughly.\nIn a 6- to 8- quart Dutch oven or stock pot, combine chickpeas and 1 tablespoon Diamond Crystal kosher salt (if using table salt, use half as much by volume). Bring to a boil over high heat. Reduce to a simmer and cook until beans are almost falling apart, 1 1/2 to 2 hours, topping with water as needed. (Chickpeas should be submerged at all times.) Using a fine-mesh strainer, drain chickpeas.  Set aside 240g (about 8 1/2 ounces) cooked chickpeas and reserve 1/3 cup (90ml) cooking water for hummus. Set aside remaining chickpeas and freeze, or reserve for another use.\nThis recipe yields a very smooth hummus. However, for an even smoother hummus, you can use half the quantity of water specified (45g of water) and the remaining half (45g) as ice cubes.\nMake-Ahead and Storage\nHummus can be refrigerated in an airtight container for up to 3 days. Cooked chickpeas can be frozen for up to 6 months.\nMiddle Eastern\nThe Latest\nDips\nQuick Sides\nChickpeas"
}