{
  "url": "https://www.seriouseats.com/ideas-in-food-snickers-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/mMAGHmJMErskfm6s6kwEMPL6pxc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140909-ideas-in-food-Slice-Of-Finished-Snickers-Pie-c1185263a7cf49eca96b04bff93e2558.jpg",
  "tags": [
    "Ice Cream",
    "Icebox Cake",
    "Pies"
  ],
  "title": "The Ultimate Snickers Pie",
  "full_text": "The Ultimate Snickers Pie\nClose\nJump to recipe\nPrep\n70 mins\nCook\n2 hrs 20 mins\nActive\n2 hrs\nChilling and Freezing Time\n9 hrs\nTotal\n12 hrs 30 mins\nServes\n10\nto 12 servings\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pie Dough:\n150\ng\nall-purpose flour\n30\ng\nnatural cocoa powder\n12 1/2\ng\nsugar\n1 1/2\ng\nsea salt\n113\ng\nunsalted butter\n, cold, diced\n28\ng\nice water\n, more if needed\nFor the White Chocolate Peanut Butter:\n300\ng\nwhite chocolate chips\n290\ng\ncreamy peanut butter\n10\ng\nvanilla paste or\nvanilla extract\n150\ng\nsalted, roasted peanuts\n(we used the classic Planter’s)\nFor the Chocolate Caramel Sauce:\n250\ng\nsugar\n50\ng\nwater\n25\ng\ncorn syrup\n300\ng\nheavy cream\n300\ng\nbittersweet chocolate\n3\ng\nsalt\nFor the Caramelized Condensed Milk Ice Cream:\n1\n(396 g) can\ncondensed milk\n970\ng\nheavy cream\n4\ng\nsalt\nReserved frozen, streuselized white\nchocolate peanut butter\nTo Finish The Snickers Pie:\nReserved\nchocolate caramel sauce\n50\ng\nroughly chopped,\nsalted, roasted peanuts\nDirections\nFor the Pie Dough:\nCombine flour, cocoa, sugar and salt in a food processor and pulse them 4-5 times to blend. Add butter and pulse 2-3 times to blend, until mixture looks sandy. Strain ice water into food processor and run processor for 5-10 seconds to bring mixture together. If it seems a little dry, add more ice water 1 tablespoon at a time. The dough will resemble small pebbles and hold together when you squeeze a bit in your hand.\nTurn dough out onto a floured counter into a pile. Sprinkle the top lightly with flour. Starting at one end, use the heel of your hand to smear a small amount of dough against counter and continue moving through the pile until you have smeared most of it into flakes of dough. Do this quickly, being sure not to work any section of dough more than once. Once all the dough has been flattened, pile the layers up into a stack and gently press into a flattened disc.\nLightly flour countertop and roll dough out to fit into a 9-inch deep-dish pie pan. Lay dough in buttered pie pan and gently press it into pan. Trim top edges to 1-inch past edge of pie dish. Fold edge under and crimp circumference of dough. Let pie dough rest in freezer while oven preheats.\nAdjust oven rack to center position and preheat oven to 350°F (180°C). Line pie dough with foil or crumpled parchment paper and fill with pie weights. Bake for 20 minutes. Remove pie weights and return pie dough to oven for 10 minutes more. Pie crust should be fully cooked through and just set. Let cool completely at room temperature.\nSerious Eats / Ideas in Food\nFor the White Chocolate Peanut Butter:\nPut white chocolate, peanut butter, and vanilla paste into a food processor. Pulse machine 5 times to begin blending ingredients. Once a rough paste forms, turn food processor on and let run for 5 minutes until white chocolate and peanut butter form a smooth, uniform paste. Turn food processor off and add salted, roasted peanuts. Pulse machine 10 times to roughly chop peanuts into white chocolate peanut butter mixture. Put mixture into a plastic container, cover and freeze.\nSerious Eats / Ideas in Food\nWhen white chocolate peanut butter is frozen, divide it in half. Reserve half in a covered container in refrigerator or freezer. Chop remaining white chocolate peanut butter into chunks. Put frozen chunks into a food processor and pulse 5 times so mixture takes on a coarse streusel-like appearance. Put sandy white chocolate peanut butter in a covered container in freezer until ready to assemble pie. Remaining white chocolate peanut butter may be kept in refrigerator or freezer depending on what you want to do with it. It will keep for at least 2 weeks in refrigerator and up to 6 months in freezer.\nSerious Eats / Ideas in Food\nFor the Chocolate Caramel Sauce:\nPut sugar and water into a medium sized saucepan and stir together until the mixture resembles wet sand. Add corn syrup and set pot over medium-high heat. Put a lid on pot and cook mixture for 5 minutes. Remove lid and sugar mixture should be bubbling. Continue to cook without stirring mixture until it reaches between 385-387°F (195°C-197°C), about 10 minutes. Sugar will be a medium amber color.\nSerious Eats / Ideas in Food\nRemove pan from heat and carefully add heavy cream. The mixture will boil violently. Put pan back on low heat and stir mixture together until caramel is dissolved. Remove pan from heat and let mixture cool until it reaches 130°F (55°C). Add chocolate and salt and stir mixture together until chocolate is fully incorporated.\nSerious Eats / Ideas in Food\nTake about 1/4 of the sauce and use a pastry brush to spread it evenly over inside of cooled pie crust. Sprinkle half of frozen, streuselized white chocolate peanut butter over sauce, pressing it gently into crust if necessary. Reserve pie crust in freezer until you are ready to fill with ice cream.\nSerious Eats / Ideas in Food\nReserve remaining chocolate caramel sauce in a covered container at room temperature until you are ready to assemble pie. If you are not making the pie immediately, store caramel in refrigerator and let come to room temperature before using to finish the pie.\nFor the Caramelized Condensed Milk Ice Cream:\nPut 2 inches of water in bottom of a pressure cooker and add a small rack (the rack is usually included with every pressure cooker). Put condensed milk on rack and seal lid. Cook at high pressure for 90 minutes. Alternatively, cook canned condensed milk in a pot of boiling water for 3 hours, topping up the water as necessary.\nAllow pressure to release naturally. Prepare an ice bath. Once depressurized, open lid and, using tongs, transfer can of caramelized condensed milk to ice bath. Let chill for at least 1 hour, adding more ice as needed, until completely cool:\nDo not open can while hot because a hot can of caramelized condensed milk is still under pressure and can erupt.\nPut caramelized condensed milk, half of heavy cream and salt into the bowl of a stand mixer with whisk attachment. Turn mixer on low and increase speed to medium. Condensed milk will break apart and become absorbed into cream. Continue to whisk, about 5 minutes, until cream begins to thicken and caramelized condensed milk is dissolved in cream. Pour in remaining cream and increase speed to medium-high. Whip mixture until cream is at soft peaks. Turn mixer off and fold in the remaining sandy white chocolate peanut butter. Once inclusion is folded in, pour whipped mixture into prepared pie crust and freeze, uncovered for at least 4 hours and preferably overnight, until firm and frozen through.\nSerious Eats / Ideas in Food\nTo Finish The Snickers Pie:\nTake ice cream pie out of freezer once it’s fully frozen and use an offset spatula to spread remaining chocolate caramel sauce over top of pie in a thick layer. When ice cream is fully covered, sprinkle peanuts over top. Freeze pie for another hour to set frosting. Remove pie from freezer and let temper for at least 15 minutes. Slice and serve.\nSerious Eats / Ideas in Food\nSpecial Equipment\n9-inch deep dish pie pan; food processor; pressure cooker; stand mixer with whisk attachment\nNotes\nThis recipe makes twice as much white chocolate peanut butter as you will need. Originally we were going to cut the recipe in half, but after snacking on this straight from the freezer and then imagining it in everything from white-chocolate peanut butter paninis to cookies to pretzel dip, we felt that having a bit extra in our pantry was a good thing. We figured we wouldn't short-change you either.\nIce Cream\nIcebox Cake\nPies"
}