{
  "url": "https://www.seriouseats.com/ile-flottante-floating-island-7109973",
  "image_url": "https://www.seriouseats.com/thmb/1_sc1Z9OrsgyeY_3Va4To1-xflI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230216-ile-flottante-AmandaSuarez-hero-3a008ca690bd49a6ac7125a629c08057.JPG",
  "tags": [
    "French",
    "The Latest",
    "Desserts",
    "Egg Whites"
  ],
  "title": "Île Flottante (French Floating Meringues With Crème Anglaise)",
  "full_text": "Île Flottante (French Floating Meringues With Crème Anglaise)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nCooling Time\n60 mins\nTotal\n100 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nlarge\negg whites\n(\n210\ng\n)\n1/2\nteaspoon\ncream of tartar\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n2\ncups\n(\n400\ng\n)\ngranulated sugar\nNonstick\ncooking spray\n1\nquart\n(\n1\nL\n)\ncrème anglaise\n(this is double the linked recipe; see note)\nTo Garnish (optional):\nChopped, toasted nuts, such as pistachios, almonds, or\nhazelnuts\nChopped candied or\npreserved fruit\nCrushed cookies, such as\namaretti\nChopped\nalmond praline\nCaramel\nor\nspun sugar\n(see linked recipe for tips)\nDirections\nAdjust oven rack to the middle position and preheat to 325ºF (160ºC). Line a 2-quart baking dish (see note) with parchment overhanging two sides. Spray with nonstick cooking spray and set aside.\nIn the bowl of a stand mixer fitted with the whisk attachment, begin whipping egg whites at low speed until whites start to look wet and frothy, about 1 minute. With the mixer still running, add cream of tartar and salt and mix for 10 seconds.\nSerious Eats / Amanda Suarez\nKeeping the mixer at low speed, slowly add 1/4 of the sugar in a steady stream, then increase speed to medium and slowly add the remaining sugar. Continue mixing at medium speed until meringue is thick and glossy and holds firm peaks when you lift the whisk out of it, about 10 minutes. (While one could speed the mixer up for a faster meringue, the meringue is more stable when mixed for a longer time at slower speeds, making it less likely to deflate; the exact mixing time will depend on your mixer and other variables, so keep mixing to reach firm peaks even if longer than the estimated 10 minutes.)\nSerious Eats / Amanda Suarez\nUsing a silicone spatula, scrape meringue into the prepared baking dish. Using an offset spatula, spread meringue into an even layer. Bake until the meringue is still glossy, slightly firm, and bounces back when touched on one of its corners (to avoid leaving a fingerprint, wet your fingertip before lightly pressing the meringue), about 20 minutes. Remove from the oven. Place the baking dish on a cooling rack and allow to cool, about 1 hour.\nSerious Eats / Amanda Suarez\nWhen cool, lift meringue out of the baking dish and place on a work surface. Line a rimmed baking sheet with parchment paper and spray with nonstick spray. Using a knife dipped in hot water, and re-dipping between cuts, portion the meringue into 2-inch squares. Using a small offset spatula, transfer each square to the prepared baking sheet.\nSerious Eats / Amanda Suarez\nTo serve, spoon 1/2 cup crème anglaise into each of 6 shallow bowls. Place a meringue square into each bowl and garnish with toppings, if desired.\nSerious Eats / Amanda Suarez\nNotes\nIf you don’t feel like making crème anglaise, you can melt 2 pints of good quality, egg-free vanilla ice cream in a saucepan or microwave.\nVarious dimensions of baking dish will work as long as the baking dish has a roughly 2-quart volume.\nSpecial Equipment\nStand mixer\n,\noffset spatula\n,\n2-quart baking dish\n, nonstick cooking spray\nMake-Ahead and Storage\nThe linked recipe for crème anglaise makes 2 cups; for 1 quart (4 cups) you will need to double that recipe, which you can easily do, though you may want to use a slightly larger 3-quart saucier to better contain the increased volume. Cooking times may also be slightly longer given the larger volume.\nThe crème anglaise can be made up to 3 days in advance and kept refrigerated.\nFor best results, the meringue should be made no more than 1 to 2 hours before you plan to serve the dessert; as the meringue sits, it will eventually weep and beads of liquid will form on the surface.\nFrench\nThe Latest\nDesserts\nEgg Whites",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/le-flottante-french-floating-meringues-with-crme-anglaise.webp?"
}