{
  "url": "https://www.seriouseats.com/in-n-outs-double-double-animal-style-burger-recipe",
  "image_url": null,
  "tags": [
    "Burgers",
    "Stovetop Beef",
    "Ground Beef",
    "Beef Mains",
    "Sandwiches"
  ],
  "title": "In-N-Out's Double-Double, Animal Style Recipe",
  "full_text": "In-N-Out's Double-Double, Animal Style Recipe\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nTotal\n65 mins\nServes\n2 burgers\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n3\ntablespoons\n(\n45\nml\n)\nmayonnaise\n1\ntablespoon\n(\n15\nml\n)\nketchup\n2\nteaspoons\n(\n10\ng\n)\nsweet pickle relish\n1/2\nteaspoon\nsugar\n1/2\nteaspoon\ndistilled\nwhite vinegar\nFor the Burgers:\n8\nounces\n(\n225\ng\n) fresh\nbeef chuck\nwith plenty of fat, cut into 1-inch cubes\n2\nteaspoons\n(\n10\nml\n)\nvegetable oil\n, divided\n1\nlarge\nonion\n, finely chopped (about\n1 1/2\ncups\n)\nKosher salt\n2\nsoft\nHamburger buns\n, preferably Arnold brand\nFreshly\nground black pepper\n8\ndill pickles\nchips\n2\nquarter-inch-thick slices\nripe\ntomato\n2\nleaves\nfresh\niceberg lettuce\n, white core section removed, torn to bun-sized pieces\n1/4\ncup\n(\n60\nml\n)\nyellow mustard\n4\nslices\ndeli-cut\nAmerican cheese\nDirections\nFor the Sauce:\nCombine all ingredients in a small bowl, and stir to combine. Cover and refrigerate until ready to use (sauce can be refrigerated up to 5 days).\nAndrew Janjigian\nFor the Burgers:\nIf using a meat grinder:\nPlace feed shaft, blade, and 1/4-inch die of meat grinder in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece and place in freezer for 10 minutes until meat is firm. Combine meat in large bowl and toss to combine. Grind meat and refrigerate immediately until ready to use. Handle as gently as possible. Proceed to step 3.\nIf using a food processor:\nPlace bowl and blade of food processor in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece, and place in freezer for 10 minutes until meat is firm, but not frozen. Combine meat in large bowl and toss to combine. Working in two batches, place meat cubes in food processor and pulse until medium-fine grind is achieved, 8 to 10 one-second pulses, scraping down processor bowl as necessary. Refrigerate ground meat immediately until ready to use. Handle as gently as possible.\nAndrew Janjigian\nPreheat oven or toaster oven to 400°F (200°C). Meanwhile, in a 10-inch nonstick skillet, heat 1 teaspoon (5ml) oil over medium-high heat until shimmering. Add onion and 1/2 teaspoon salt, reduce heat to medium-low, and cook, tossing and stirring occasionally, until onions are well browned, about 15 minutes. Once onions begin to sizzle heavily and appear dry, add 1 tablespoon (15ml) water to skillet and stir to scrape up any browned bits. Continue cooking until water evaporates and onions start sizzling again, about 1 minute. Repeat process, adding 1 tablespoon (15ml) of water at a time, until onions are meltingly soft and dark brown, about 3 times total. Transfer to a small bowl and set aside.\nAndrew Janjigian\nPlace closed buns in preheated oven until slightly darkened and crisped, about 2 minutes. In a 12-inch skillet, heat 1/2 teaspoon oil over medium-high heat until shimmering. Open buns and add face-down to skillet. Toast until dark brown around the edges, about 1 minute total. Transfer buns to a plate or tray; wipe out skillet. Spread sauce on bottom halves of each bun, then top each with 4 pickle slices, 1 slice tomato, and 1 lettuce leaf. Set aside.\nAndrew Janjigian\nForm ground beef into four 2-ounce balls. Using damp hands, press each into a patty that is 3/16-inch-thick, and 4 inches in diameter. Season generously with salt and pepper.\nAndrew Janjigian\nIn now-empty skillet, heat remaining 1/2 teaspoon oil over medium-high heat until lightly smoking. Add beef patties and cook without moving until well browned and crusty on bottom side, about 2 minutes and 30 seconds. Using a spoon, spread 1 tablespoon (15ml) mustard on raw side of each patty. Using a spatula, flip patties so mustard side is down, and continue to cook for 1 minute. Top each patty with 1 slice of cheese. Divide onion mixture evenly between two patties. Place the other two patties directly on top of the onion-topped patties. Transfer burger stacks to prepared bottom buns. Close sandwiches, and serve immediately.\nAndrew Janjigian\nBurgers\nStovetop Beef\nGround Beef\nBeef Mains\nSandwiches"
}