{
  "url": "https://www.seriouseats.com/indian-milk-creams-recipe-8754898",
  "image_url": "https://www.seriouseats.com/thmb/a7NYEy9ZKv1S47hTDoVawh6MBag=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201222-milkcreams-nik-sharma-10-bdbc7ef62f6d4308a63a555ceffdb5e7.jpg",
  "tags": [
    "Candy",
    "Indian",
    "Desserts",
    "Christmas Candies"
  ],
  "title": "Milk Creams",
  "full_text": "Milk Creams\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nCooling and Setting Time\n14 hrs\nTotal\n14 hrs 35 mins\nServes\n20\nto 40 milk cream discs\nCook Mode\n(Keep screen awake)\nIngredients\nOne 14-ounce (\n396\ng\n) can\nsweetened condensed milk\n3 1/2 ounces (\n100\ng\n) sifted, finely ground\nraw cashews\n(about 3/4 cup plus 2 tablespoons)\n1\ntablespoon\n(14g) unsalted butter or\nghee\n, plus extra for greasing, kneading and shaping the milk creams\n1 teaspoon (\n5\nml\n) vanilla extract or\nalmond extract\nDirections\nPrepare an ice bath by combining cold water and ice cubes in a small mixing bowl. Lightly grease a dinner plate with butter or ghee. If using silicone molds, grease them lightly with butter or ghee; if you are not using silicone molds, lightly grease a rimmed baking sheet with butter or ghee.\nCombine sweetened condensed milk and ground cashews in a 3-quart saucier and stir with a rubber spatula until smooth. Place over low heat and, stirring constantly, bring mixture to 179°F (81°C), taking care not to exceed 180°F (82°C). Continue stirring constantly to prevent scorching or caramelization and cook until mixture reduces to a very thick paste the consistency of very thick, creamy peanut butter, 15 to 45 minutes. (Timing will depend on how closely you maintain a cooking temperature of 179°F.)\nTo Test the Dough:\nUsing a 1-teaspoon measuring spoon, drop a walnut-size portion of dough into the prepared ice bath and wait 1 minute. Using clean fingers, remove the chilled dough and try to form it into a ball; if the dough easily forms a non-sticky ball, the dough is ready. If the dough does not easily form a ball or is still quite sticky, continue to heat the cashew mixture over low heat, stirring constantly, and keep testing dough every 2 minutes until it reaches the desired consistency.\nRemove dough from heat and add 1 tablespoon (14g) butter or ghee and vanilla extract, stirring to thoroughly combine. Transfer dough to prepared, lightly greased plate and spread it out into a flat, even layer. Set aside and let cool to room temperature, about 2 hours.\nGrease your palms and fingers with 1 teaspoon (5g) of butter or ghee and knead cooled dough until it is no longer sticky, about 4 minutes.\nIf Using Silicone Molds:\nPortion dough into molds and, using knife, trim dough so it is flattened flush with the top of the mold. Set molds on the counter, covered with a clean kitchen towel if desired, until the surface is firm to touch and slightly dry, about 12 hours. Unmold milk creams and serve.\nIf Using Rimmed Baking Sheet:\nWorking with 1 tablespoon (20g) of dough at a time, shape dough into 1-inch discs and transfer them to the prepared baking sheet, leaving a 1-inch (2.5cm) space between each milk cream. Using a fork, prick the tops of the milk cream discs to form a decorative pattern. Set the baking sheet on the counter, covered with a clean kitchen towel if desired, until the surface is firm to touch and slightly dry, about 12 hours. Serve.\nSpecial Equipment\nFine-mesh strainer\n,\n3-quart saucier\n, silicone spatula, silicone molds\nNotes\nUsing a food processor to make your own cashew flour from raw, skinned cashews is an option; however, I strongly recommend you purchase finely ground cashew flour from a store or online.\nMake-Ahead and Storage\nMilk creams can be stored in an airtight container for up to 3 weeks at room temperature.\nCandy\nIndian\nDesserts\nChristmas Candies"
}