{
  "url": "https://www.seriouseats.com/instant-pot-lu-rou-fan-recipe-11710886",
  "image_url": "https://www.seriouseats.com/thmb/IKvbQqBeLhUi3CMosV7MZKmLyeU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250401-SEA-PressureCookerBraisedMincedPorkBelly-QiAi-Beauty2-75-d8ffb37e9abf45f093b0ccd85187fb10.jpg",
  "tags": [
    "Pork",
    "The Latest",
    "Recipes",
    "Pork Belly",
    "Braised & Stewed Pork"
  ],
  "title": "Instant Pot Lu Rou Fan (Braised Pork Belly Over Rice)",
  "full_text": "Instant Pot Lu Rou Fan (Braised Pork Belly Over Rice)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n90 mins\nTotal\n100 mins\nServes\n3\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n906\ng\n) skin-off\npork belly\n, cut into 1/2-inch pieces\n3\nmedium\ncloves garlic\n(\n15\ng\n), peeled and minced\n1 1/4\ncups\n(\n295\nml\n)\nwater\n1/2\ncup\nfried shallots\n(\n1 1/2\nounces\n;\n40\ng\n),\nhomemade\nor store-bought\n1/2\ncup\n(\n120\nml\n) all-purpose\nsoy sauce\n, such as Kikkoman\n2\ntablespoons\ngranulated sugar\n(\n1\nounce\n;\n30\ng\n)\n2\ntablespoons\noyster sauce\n(\n1\nounce\n;\n30\ng\n)\n2\ntablespoons\n(\n30\nml\n)\nrice wine\n, such as Taiwanese michiu or cooking sake\nCooked white rice\n, for serving\nDirections\nIn an electric multicooker (such as an Instant Pot) set to the sauté function, cook pork belly, stirring often, until opaque and some of its fat has rendered, about 5 minutes. Add the garlic and cook, stirring to combine, until fragrant, about 1 minute.\nSerious Eats / Qi Ai\nAdd water, fried shallots, soy sauce, sugar, oyster sauce, and rice wine. Seal cooker, bring to high pressure, and cook for 40 minutes. When done, let cooker depressurize naturally, 30 to 45 minutes.\nSerious Eats / Qi Ai\nOpen the cooker and mix well. If you’d like the braising liquid to be thicker, set pressure cooker to sauté function and simmer sauce until it’s thick, treacly, and slightly reduced, about 15 minutes. Serve over cooked white rice.\nSerious Eats / Qi Ai\nSpecial Equipment\nElectric multi-cooker, such as an Instant Pot\nNotes\nI’ve tested this recipe dozens of times, both on the stovetop and in a pressure cooker, and found that the ideal soy sauce-to-water ratio varies depending on the brand of soy sauce used and how salty you like your food. For convenience, I typically reach for Kikkoman, but if you're using a low-sodium soy sauce or one with added sugar, you’ll need to season to taste at the end. This dish is more of an art than an exact science, so don’t be afraid to tweak things.\nMake-Ahead and Storage\nLeftover lu rou fan stores beautifully in the fridge or freezer. Refrigerate in an airtight container for up to 3 days or freeze for up to 3 months. Freeze in individual portions and thaw in the refrigerator. To reheat, bring to a simmer over medium heat or microwave until warmed through.\nPork\nThe Latest\nRecipes\nPork Belly\nBraised & Stewed Pork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/instant-pot-lu-rou-fan-braised-pork-belly-over-rice.webp?"
}