{
  "url": "https://www.seriouseats.com/instant-pot-pressure-cooker-oatmeal-8772886",
  "image_url": "https://www.seriouseats.com/thmb/eRVDL1YUh1uvYIkVB1lwQrKHCIw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/120103-SEA-InstantPotOatmeal-AmandaSuarez-00-b668e2ca257f4e38a4040ffe517a4241.jpg",
  "tags": [
    "Oatmeal",
    "The Latest",
    "Breakfast & Brunch By Diet"
  ],
  "title": "Make-Ahead Pressure-Cooker Oatmeal",
  "full_text": "Make-Ahead Pressure-Cooker Oatmeal\nClose\nJump to recipe\nPrep\n0 mins\nCook\n50 mins\nTotal\n50 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n1\ncup\n(\n180\ng\n)\nsteel-cut oats\n3\ncups\n(\n710\nml)\nwater\n(see notes)\nPinch\nkosher salt\nToppings\n, as desired\nDirections\nIn an electric multicooker (such as an Instant Pot), melt butter using the sauté function, then add oats and cook, stirring frequently, until lightly toasted and fragrant, 3-4 minutes.\nSerious Eats / Amanda Suarez\nAdd water and salt (make sure oats are all submerged), close cooker, and set to cook at high pressure for 5 to 15 minutes (shorter if you want a nuttier chew and longer if you want a creamier, smoother result); if your cooker has a dedicated porridge mode, you can use that instead, following the manufacturer's instructions. Using the timer function on the cooker, set it to start cooking such that it will be ready and depressurized naturally when you want to eat (assume about 10-15 minutes heating time, 5-15 minutes cooking at pressure, and 30 -45 minutes depressurization time).\nSerious Eats / Amanda Suarez\nWhen ready, open cooker and stir oatmeal to ensure an even consistency throughout. Spoon into bowls and top as desired, then serve right away.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nInstant Pot or other electric multicooker\nNotes\nThe ratio of 3 cups of water for every 1 cup of steel-cut oats produces a thick but not stiff porridge, which I like. You may need to adjust the ratio of oats to water if your preferences are different from mine, or if your cooker produces slightly different results. Once you figure out the perfect ratio for your tastes and cooker, you'll be good to go.\nIt may be tempting to use milk instead of water; just beware that it's not safe to leave milk sitting in a cooker at room temperature overnight if you're planning to use the timer function. Milk also runs a higher risk of scorching as the sealed cooker heats, since you're not able to stir.\nMake Ahead and Storage\nLeftover cooked oatmeal can be stored in an airtight container in the refrigerator for up to 4 days or frozen for up to 3 months. For best results, freeze and thaw in individual portions and thaw overnight in the fridge.\nOatmeal\nThe Latest\nBreakfast & Brunch By Diet"
}