{
  "url": "https://www.seriouseats.com/iowa-steak-de-burgo-recipe-11761859",
  "image_url": "https://www.seriouseats.com/thmb/JXvAfZR5qOf__YNu8mkf3orW8CM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250625-SEA-IowaSteakDeBurgo-QiAi-03-fe82a275143240a7afe3cd0118861f2f.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Recipes By Ingredients",
    "Beef Mains",
    "Mains"
  ],
  "title": "The Butter-Soaked Steak Only Iowa Could Dream Up",
  "full_text": "The Butter-Soaked Steak Only Iowa Could Dream Up\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nRest:\n40 mins\nTotal\n60 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n2\n(8 ounces each)\ncenter-cut filets mignon\n, 1 1/2-2 inches thick, trimmed\nKosher salt\n, to taste\nFreshly\nground black pepper\n, to taste\n1\ntablespoon\nneutral oil such as canola\nor vegetable oil\n3\ntablespoons\n(\n42\ng\n)\nbutter\n3\ncloves\n(\n15\ng\n)\ngarlic\n, minced\n1/4\ncup\n(60) dry\nwhite wine\n, such as Sauvignon Blanc or Pinot Grigio\n2\ntablespoons\nchopped fresh basil\n2\nteaspoons\nchopped\nfresh oregano\nCrusty bread,\nmashed potatoes\n, or your preferred vegetables\nfor serving\nDirections\nPat steaks dry with paper towels. Season liberally with kosher salt and pepper and allow to rest at room temperature for at least 40 minutes and up to 2 hours. Alternatively, place salted steaks on a plate or a wire rack set in a rimmed baking sheet and refrigerate, uncovered, for up to 24 hours. (If choosing the latter option, remove from the refrigerator at least 40 minutes before cooking.)\nSerious Eats/ Qi Ai\nIn a large cast iron, carbon steel, or stainless steel skillet, heat oil over medium-high until shimmering. Add steaks and cook, flipping every 2 minutes, until the internal temperature has reached 110°F (43°C) for rare or 130°F (54°C) for medium, 6 to 12 minutes (steak will continue to cook a little bit as it rests). Transfer steaks to a plate and let rest at room temperature while preparing the sauce. Do not\nwipe out pan.\nSerious Eats/ Qi Ai\nAfter transferring steaks to plate, remove skillet from heat for 2 minutes, then set over medium heat, add butter, and swirl until melted. Once butter has melted, add minced garlic and cook, stirring constantly, until fragrant, about 30 seconds. (Do not allow garlic to brown!) Add white wine, scraping up any browned beef bits as you continue to stir. Simmer until sauce has reduced slightly, about 2 minutes, then add basil and oregano. Cook for 30 seconds, swirling skillet constantly, then remove from heat.\nSerious Eats/ Qi Ai\nSeason sauce with black pepper and salt to taste. Transfer rested steaks and any drippings to 2 plates and spoon prepared sauce over top, about 2 tablespoons per steak. Serve with steakhouse sides such as mashed potatoes, crisp-tender vegetables, and crusty bread for sopping up the buttery sauce and drippings.\nSerious Eats/ Qi Ai\nSpecial Equipment\nLarge cast iron, carbon steel, or stainless steel skillet\nMake-Ahead and Storage\nThis dish is best enjoyed right away, but leftovers can be refrigerated in an airtight container for up to 4 days.\nThe Latest\nRecipes\nRecipes By Ingredients\nBeef Mains\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-butter-soaked-steak-only-iowa-could-dream-up.webp?"
}