{
  "url": "https://www.seriouseats.com/iowa-taco-pizza-recipe-11713461",
  "image_url": "https://www.seriouseats.com/thmb/kmRJ82q8hqHGTdL3rUZ8C12DzL0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250411-UlitmateTacoPIzza-LorenaMasso-hero-65d025f033744121b4c47921d885979c.jpg",
  "tags": [
    "Pizza",
    "The Latest",
    "Recipes",
    "Midwestern"
  ],
  "title": "Iowa Taco Pizza",
  "full_text": "Iowa Taco Pizza\nClose\nJump to recipe\nPrep\n50 mins\nCook\n20 mins\nRising Time:\n4 hrs\nTotal\n5 hrs 10 mins\nServes\n4\nto 6\nMakes\n2 12” pies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n360\ng\n(\n2.5\ncups\n)\nbread flour\n1.5\ng\n(\n1/2\nteaspoon\n)\ninstant yeast\n7\ng\n(\n2\nteaspoons\n)\ndiastatic malt powder\n7\ng\n(\n1.5\nteaspoons\n)\noil\n227\ng\n(\n1\ncup\n)\nwater\n7\ng\n(\n2\nteaspoons\n)\nDiamond Crystal Kosher kosher salt\n; for table salt, use half as much by volume\n1/4\ncup\n(\n60\nml\n)\nolive oil\n, for brushing before baking\nFor the Taco Sauce (see notes):\n1\n(14.5-ounce) can\nwhole peeled tomatoes\n1/2\ncup\n(\n120\nml\n)\nwater\n3\ntablespoons\n(\n45\nml\n)\nwhite vinegar\n1/2\ntablespoon\n(\n7.5\nml\n)\nWorcestershire sauce\n1 1/2\nteaspoons\nground cumin\n1 1/2\nteaspoons\nonion powder\n3/4\nteaspoon\ngarlic powder\n3/4\nteaspoon\nground\ncayenne\n1\nteaspoon\nsmoked paprika\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n1/4\nteaspoon\nmonosodium glutamate\n, MSG (optional)\n1/8\nteaspoon\nxanthan gum\n(optional)\nFor the Toppings:\n2\nteaspoons\nground cumin\n1\nteaspoon\nchili powder\n3/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\ndried Mexican\noregano\n1/2\nteaspoon\nsmoked paprika\n1/2\nteaspoon\nonion powder\n1/4\nteaspoon\ncoriander\n1/4\nteaspoon\ngarlic powder\n2\nteaspoons\n(\n10\nml\n)\nneutral oil\nsuch as vegetable or canola oil\n12\nounces\nground beef\n, 80/20\n4\nounces\n(\n113\ng\n)\ncanned refried beans\n, preferably reduced sodium\n4\nounces\ncanned, unseasoned pure\ntomato sauce\n2\nounces\nprepared\ntaco sauce\nfrom recipe above\n4\nounces\nmild\ncheddar cheese\n, shredded on the largest holes of a box grater (about\n1\ncup\n)\n4\nounces\nMonterey Jack cheese\n, shredded on the largest holes of a box grater (about\n1\ncup\n)\n2\nscant\ncups\n(\n90\ng\n)\niceberg lettuce\n, finely shredded\n1\nPlum or\nRoma tomato\n(about\n80\ng\n), diced\n1\n(2.25 ounce) can\nsliced black olives\n120\ng\n(\n4\nounces\n)\ntaco-flavored tortilla chips\n(such as Doritos taco flavor tortilla chips), crumbled roughly into quarter-size pieces\nSour cream\nfor garnish (optional)\nDirections\nFor the Crust:\nIn bowl of a food processor,\nadd flour, yeast, and malt powder and pulse until combined, about 5 pulses. With food processor running, add oil and water in a steady stream until dough comes together, about 30 seconds. Stop processing and let dough rest in the bowl for 15 minutes. After the rest, add salt and process until salt is thoroughly incorporated and the dough forms a smooth ball, about 30 seconds more.\nSerious Eats / Lorena Masso\nTransfer dough to a clean countertop or cutting board and knead by hand until smooth and elastic, 1-2 minutes. Transfer dough to a lightly oiled container, cover tightly in plastic, and let rise at room temperature (70-75℉) until roughly doubled in size, about 3 hours.\nSerious Eats / Lorena Masso\nAfter 3 hours, divide dough into 2 even portions (about 300 g each) and shape into smooth, tight balls. Transfer dough balls to a lightly oiled baking sheet, leaving plenty of room for them to expand. Brush or spray tops of dough balls with a thin layer of oil and cover tightly with plastic wrap.\nSerious Eats / Lorena Masso\nIf Baking the Same Day:\nLet dough rise at room temperature until puffy and passes the “\npoke test\n,” about 1 more hour.\nIf Baking Later:\nAfter dividing dough, refrigerate for 1 to 2 days. Let refrigerated dough come to room temperature before baking, which should take an additional 1 to 2 hours ( see notes).\nFor the Taco Sauce:\nWhile dough balls proof, in a small saucepan, combine whole peeled tomatoes, water, vinegar, Worcestershire, cumin, onion powder, garlic powder, cayenne, smoked paprika, salt, and MSG (if using). Heat over medium-high, stirring frequently, until mixture comes to a boil, then reduce heat and simmer, breaking up tomatoes with a wooden spoon, until flavors meld, about five minutes.\nSerious Eats / Lorena Masso\nRemove saucepan from heat and add xanthan gum (if using). Process with an immersion blender until mixture is smooth and silky, about 15 seconds. (Alternatively, transfer to a food processor and process until smooth.)\nSerious Eats / Lorena Masso\nFor the Pizza:\nOne hour before baking, set a baking stone or steel on the middle rack of an oven and preheat to 500℉ (260℃).\nIn a small bowl, combine cumin, chili powder, kosher salt, Mexican oregano, smoked paprika, onion powder, coriander, and garlic powder and whisk vigorously with a fork to combine. In a medium bowl, add 1 teaspoon of this spice mixture, cheddar, and Monterey Jack cheeses and toss to combine. Cover cheese and freeze for 15 minutes.\nSerious Eats / Lorena Masso\nIn a large cast iron or nonstick skillet, heat oil over medium-high heat until shimmering. Add beef and 5 teaspoons of prepared spice mixture and cook, breaking up beef with a wooden spoon or spatula until browned, about 4 minutes. Remove beef from heat and transfer to a fine mesh strainer placed over a bowl to drain.\nSerious Eats / Lorena Masso\nWorking with one dough ball at a time, transfer dough to a clean, lightly floured work surface. Gently press out dough into an 8-inch circle, then stretch out dough into a 12-inch circle (about 1/4 inch thick) by draping over knuckles. Transfer dough round to a well-floured pizza peel.\nSerious Eats / Lorena Masso\nIn a medium bowl, whisk together refried beans, tomato sauce, and half of taco sauce until mixture is smooth. Spread half of sauce mixture (about 1/2 cup) over surface of one pie, being careful not to overload the center and leaving about a 3/4 inch border along the edge.\nSerious Eats / Lorena Masso\nWorking quickly, sprinkle half of beef mixture (4 ounces) over sauce, using an especially light hand for the center of the pie. Remove cheese from freezer and sprinkle half (4 ounces; about 1 cup) evenly over the surface of the pie. Dot with half (1 ounce) of sliced olives. Brush crust with olive oil and slide pie onto baking steel or stone. Bake until crust is golden brown and puffy, 15 to 18 minutes.\nSerious Eats / Lorena Masso\nRemove pizza from oven and transfer to wire rack to cool. Top immediately with shredded lettuce, chopped tomatoes, and crushed tortilla chips. Let cool on rack for 3 minutes before transferring to a cutting board. Drizzle pie with taco sauce and dollop with sour cream, if using. Cut into six slices and serve. Repeat shaping, topping, and baking the other pizza.\nSerious Eats / Lorena Masso\nNotes\nLetting the dough develop slowly in the fridge to proof for 1 to 2 days will improve its flavor and texture.\nIn an airtight container, taco sauce will keep in the fridge for up to three weeks and in the freezer for up to six months.\nDoritos makes “taco flavor” tortilla chips in a retro-hued bag, and those are your best bet for a widely available Happy Joe’s clone. If taco-flavored tortilla chips aren’t available at your grocery store, you can substitute an equivalent weight of nacho cheese flavored Doritos or similar. Do not use unflavored tortilla chips.\nYou can substitute a store-bought taco sauce for the homemade sauce if desired; look for a jarred sauce labeled “taco sauce,” not a hot sauce or canned enchilada sauce, which will differ in heat and consistency.\nYou can also sub in your favorite New York–style pizza dough recipe for the dough recipe here, though your experience with flopsog may vary. For extra insurance when substituting doughs, try parbaking the crust for a couple minutes before topping.\nSpecial Equipment\nLarge skillet, 2-quart saucepan, food processor, pizza peel, pizza steel or stone, wire baking rack\nMake-Ahead and Storage\nThe taco sauce can be refrigerated in an airtight container for up to 1 week.\nThe dough can be made and refrigerated up to 2 days ahead.\nPizza\nThe Latest\nRecipes\nMidwestern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/iowa-taco-pizza.webp?"
}