{
  "url": "https://www.seriouseats.com/iowa-loose-meat-sandwich-recipe-8662035",
  "image_url": "https://www.seriouseats.com/thmb/O02mHAg2EvE-uxPL-xGfGStqSRM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240608-Iowa-Loose-Meat-Sandwiches-Qi-Ai-hero-01-4-3sandwichinframeclosercrop-1e6a6dfc714c491cb1b9e5c4168dc7b4.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Beef Mains",
    "Ground Beef"
  ],
  "title": "Iowa Loose Meat Sandwich",
  "full_text": "Iowa Loose Meat Sandwich\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nResting Time\n15 mins\nTotal\n40 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nwater\n, divided\n1/2\nteaspoon\nbaking soda\n2\nteaspoons\nneutral oil such as vegetable or canola\noil\n1\npound\n80% lean ground beef\n1/2\nteaspoon\ncornstarch\n1/2\ncup\n(\n120\nml\n) homemade beef or\nchicken stock\nor store-bought low-sodium chicken broth\n1 1/2\nteaspoon\nfreshly\nground black pepper\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt, use half as much by volume\n1/2\nteaspoon\nred pepper flakes\n1/4\nteaspoon\nmonosodium glutamate\n(MSG), optional\n1\nmedium\nyellow onion\n, grated (\n8\nounces\n;\n227\ng\n)\n2\ncloves\ngarlic\n4\nsoft\nburger buns\n, for serving (see notes)\n4\nslices\nAmerican cheese\n, for serving\n8-12\ndill pickle chips\n(the thicker-cut, the better), for serving\nBrown mustard\n, for serving\nDirections\nIn a medium bowl, whisk to combine 1 tablespoon water with baking soda. Add the ground beef and mix to combine. Let sit for 15 minutes.\nSerious Eats / Qi Ai\nMeanwhile, in a small bowl, whisk the remaining 1 tablespoon water with cornstarch; set aside. In a separate small bowl, combine stock, black pepper, salt, red pepper flakes, and MSG, if using. Mix well and set aside.\nSerious Eats / Qi Ai\nIn a large sauté pan or stainless-steel skillet, heat 1 tablespoon oil over high heat until shimmering. Add beef and grated onion and cook, stirring frequently and breaking the beef into small pieces with a wooden spoon, until most of the beef is no longer pink and onions are softened, about 5 minutes. Add minced garlic and cook until fragrant, about 1 minute. Pour in the stock mixture and cook, stirring occasionally, until most of the liquid has evaporated, about 5 minutes. Add the cornstarch mixture and cook, stirring constantly, until the sauce has thickened and coats the ground beef, about 1 minute.\nSerious Eats / Qi Ai\nSeparate the buns and place a slice of American cheese on each bottom half. Using a slotted spoon, top cheese with about 1/4 of the loose meat filling (about 4 ounces per sandwich) and press gently to compact. Top with 2 to 3 dill pickle chips and mustard. Place the top buns on, squish to compact the layers, and serve immediately.\nSerious Eats / Qi Ai\nSpecial-Equipment\nLarge sauté pan or stainless-steel skillet\nNotes\nA potato roll is ideal, but any burger bun is fine, and using whatever you can get (within reason) is more true to the tradition than going to three stores looking for potato rolls.\nMake-Ahead and Storage\nYou\ncan\nmake the meat ahead of time, storing it in an airtight container in the refrigerator for up to four days. We don't recommend it. The meat takes under half an hour (and minimal effort) to prep and cook combined, and it'll never be better or juicier than when it's fresh. Likewise, any leftover cooked meat can be stored in a tightly sealed container in the fridge for up to four days.\nSandwiches\nThe Latest\nBeef Mains\nGround Beef"
}