{
  "url": "https://www.seriouseats.com/issan-style-thai-sliced-steak-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Qh38xFm6qWsjOKHsggUcbFQaU1I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__10__20141030-issan-salad-steak-kenji-11-688737b0accd43d0a044738a5dd1eb42.jpg",
  "tags": [
    "Thai",
    "Grilled Beef",
    "Stovetop Beef",
    "Steaks",
    "Herbs"
  ],
  "title": "Isan-Style Thai Sliced-Steak Salad Recipe",
  "full_text": "Isan-Style Thai Sliced-Steak Salad Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n120\nml\n)\nvegetable oil\n1\nstalk\nlemongrass\n, tough outer leaves removed, bottom four inches only, sliced as thinly as possible into rounds (\n20\ng\n)\nKosher salt\n2\nflat iron\n, flank, skirt, or hanger\nsteaks\n, about\n12\nounces\n(\n340\ng\n) total (see note)\nGround white or\nblack pepper\n3\nmedium\ncloves garlic\n(\n15\ng\n)\n1\nteaspoon\ndried Thai red chile powder\n, plus more to taste (see note)\n1\nsmall\ngreen Thai chile\nor\n1/2\nsmall\nSerrano chile, finely chopped\n1\ntablespoon\n(\n15\ng\n)\nbrown sugar\n, plus more to taste\n3\ntablespoons\nplus\n1\nteaspoon\n(\n50\nml\n)\nfish sauce\n, plus more to taste\n3\ntablespoons\nplus\n1\nteaspoon\n(\n50\nml\n) fresh\nlime juice\nfrom\n2\nwhole\nlimes\n, plus more to taste\n1/2\npint\n(\n180\ng\n)\ncherry tomatoes\n, sliced in half lengthwise\n1/2\nsmall\nred onion\n(\n3\nounces\n;\n85\ng\n), thinly sliced\n1\ncup\n(\n15\ng\n) roughly chopped fresh\nmint leaves\n1\ncup\n(\n12\ng\n)\nroughly chopped fresh basil\nDirections\nIn a small skillet, combine vegetable oil and lemongrass and place over medium heat. Cook, stirring frequently, until lemongrass is golden brown and crisp, about 6 minutes. Strain through a fine-mesh strainer set in a small saucepan. Transfer crisp lemongrass to a paper towel-lined plate and season with salt. Set aside.\nSerious Eats / J. Kenji López-Alt\nTo cook on a stovetop:\nSeason steak generously with salt and pepper. Transfer 2 teaspoons of reserved lemongrass oil to a large cast iron or stainless steel skillet (reserve remaining lemongrass oil for another use or discard, see note). Heat over high heat until lightly smoking. Cook steak, turning frequently, until well browned and an instant-read thermometer inserted into the center registers 125°F (52°C) for medium, 3 to 8 minutes total depending on thickness. Transfer steak to a cutting board, set aside, and proceed to step 4.\nAlternatively, to cook on a grill:\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate. Season steak generously with salt and pepper. Place steak directly on hot side of grill and cook, turning frequently, until well browned and an instant-read thermometer inserted into the center registers 125°F (52°C) for medium, 3 to 8 minutes total depending on thickness. Transfer steak to a cutting board and set aside.\nIn a mortar and pestle, combine garlic, pepper flakes, and Thai chiles and pound into a fine paste (see note). Add sugar, fish sauce, and lime juice, and pound until the sugar is dissolved. Taste dressing and add more sugar, fish sauce, lime juice, or pepper flakes to taste. It should be strongly spicy, sweet, salty, and acidic.\nSerious Eats / J. Kenji López-Alt\nThinly slice steak against the grain and transfer to a large bowl along with any juices that have accumulated on the cutting board. Add fried lemongrass, tomatoes, onion, mint, basil, and dressing. Toss to combine. Serve immediately.\nSerious Eats / J. Kenji López-Alt\nNotes\nAn equivalent weight of flap, tenderloin, strip, or tri-tip steak can be used in place of flat iron, flank, skirt, or hanger steak. Even for folks who prefer rare meat generally, I recommend cooking the steak to medium for cold recipes like this salad. The steak in this recipe can be cooked in a skillet indoors or, alternatively, prepared on a grill. See Step 3 for grilling instructions.\nDried Thai red chile powder can be found in Asian markets. Alternatively, use a combination of 1 1/2 teaspoons red pepper flakes and 1/2 teaspoon ancho chile powder.\nReserved lemongrass oil can be used in stir-fries or salad dressings.\nI strongly recommend using\na good mortar and pestle\nfor the dressing. If you do not have a mortar and pestle, dressing can be made by combining garlic, pepper flakes, fresh chiles, brown sugar, fish sauce, and lime juice in a blender and blending until a rough purée is formed, scraping down sides as necessary.\nSpecial Equipment\nMortar and pestle\n,\ncast iron skillet\nRead More\nLarb Muang Moo (Northern Thai-Style Chopped Pork Salad)\nThe Food Lab's Guide to Inexpensive Steak for the Grill\nPork Larb (Thai Salad with Pork, Herbs, Chili, and Toasted Rice Powder) Recipe\nThai\nGrilled Beef\nStovetop Beef\nSteaks\nHerbs",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/isan-style-thai-sliced-steak-salad-recipe.webp?"
}