{
  "url": "https://www.seriouseats.com/italian-pressure-cooker-chickpea-pork-rib-stew-8754879",
  "image_url": "https://www.seriouseats.com/thmb/Y_LOctLreCMFVXREYj66Fnelk9E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241204ItalianPressureCookerChickpeaandPorkRibStew-AmandaSuarez-hero-55e3e2270f334016b83206c63145f3fb.jpg",
  "tags": [
    "The Latest",
    "Pressure Cooker",
    "Pork Mains",
    "Chickpeas",
    "Braised & Stewed Pork"
  ],
  "title": "Italian Pressure-Cooker Chickpea and Pork Rib Stew",
  "full_text": "Italian Pressure-Cooker Chickpea and Pork Rib Stew\nClose\nJump to recipe\nPrep\n20 mins\nCook\n90 mins\nSoaking Time:\n8 hrs\nTotal\n9 hrs 50 mins\nServes\n8 Servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n454\ng\n)\ndried chickpeas\nKosher salt\n2 1/2\nteaspoons\n(13g)\nbaking soda\n, divided\n1 1/2\npounds\n(680g)\nbaby back pork ribs or spare ribs\n, divided in half through the bones and separated into individual ribs (see notes)\nFreshly ground black pepper\n2\ntablespoons\n(30ml)\nextra-virgin olive oil\n, plus more for serving\n1\nmedium\nyellow onion\n(8 ounces; 226g), minced\n1\nlarge\ncelery\nrib\n(2 ounces; 57g), minced\n3\nmedium\ncloves\ngarlic\n, slightly smashed\n1\ntablespoon\n(15g)\ntomato paste\n1\nlarge\nsprig\nfresh\nrosemary\n12\nounces\nyellow potatoes\n(340g; about 2 medium potatoes), such as Yukon Gold, peeled and cut into irregular chunks about 1/2 inch thick (see headnote above)\nFreshly grated\nParmigiano-Reggiano\n, for serving\nDirections\nIn a large bowl, combine chickpeas with 4 tablespoons (36g) kosher salt and 2 teaspoons (10g) baking soda. Cover with 3 quarts (3L) cold water, stirring to dissolve salt and baking soda. Let stand at room temperature overnight. Drain and rinse beans thoroughly.\nSerious Eats / Qi Ai\nSeason pork ribs all over with salt and pepper. In an electric multicooker (such as an Instant Pot), heat olive oil using the sear or sauté function until shimmering. Add ribs and cook until browned on 2 sides, about 10 minutes total. Transfer ribs to a plate.\nSerious Eats / Amanda Suarez\nAdd onion, celery, and garlic and cook, stirring and scraping, until softened and any browned bits on bottom of cooker have dissolved, about 5 minutes. Stir in tomato paste and cook for 1 minute.\nSerious Eats / Amanda Suarez\nAdd drained chickpeas, rosemary sprig, pork ribs (and any accumulated juices, and 8 cups (2L) water (this should be enough to cover the solids). Stir in remaining 1/2 teaspoon (3g) baking soda and a pinch of salt. Seal cooker, bring to high pressure, and cook at high pressure for 40 minutes.\nSerious Eats / Amanda Suarez\nDepressurize cooker using quick-release valve. Carefully remove pork ribs and transfer to a plate; discard rosemary sprig. If chickpeas are still noticeably firm at this point, return to high pressure and cook for an additional 15 minutes until fully softened (we did not find this necessary during recipe development and testing, but not all chickpeas cook as quickly as others).\nAdd potatoes and simmer, uncovered, until potatoes and chickpeas are very tender, about 25 minutes. If stew is too thick at this point, thin slightly with additional hot water. Season to taste with salt and return pork ribs to pot to warm through. Ladle into individual bowls and top with a generous drizzle of olive oil, some freshly ground black pepper, and a sprinkle of cheese. Serve.\nSerious Eats / Amanda Suarez\nNotes\nAsk your butcher to cut the ribs in half through the bones and to separate them. If you don't have a butcher who can do this, simply divided the whole baby back ribs into individual ribs; the stew will just have larger pork pieces in it.\nSpecial Equipment\nElectric multi-cooker, such as an Instant Pot\nMake-Ahead and Storage\nThe finished stew can be refrigerated in an airtight container for up to 5 days. Reheat, thinning with small amounts of water if necessary, before serving.\nThe Latest\nPressure Cooker\nPork Mains\nChickpeas\nBraised & Stewed Pork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/italian-pressure-cooker-chickpea-and-pork-rib-stew.webp?"
}