{
  "url": "https://www.seriouseats.com/italian-sausage-fontina-onion-pepper-fennel-shooter-sandwich-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/wnzMlR6gZT4bGMo04tOzVBhi4b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__03__20140316-sausage-fennel-cheese-shooter-sandwich-recipe-final-610-2bcf5d56e36d4d4d8b92d73268ae6927.jpg",
  "tags": [
    "Sandwiches",
    "Cheese",
    "Sausages",
    "Tomato"
  ],
  "title": "Italian Sausage and Fontina Shooter's-Style Sandwich With Sun-Dried Tomato-Caper Relish Recipe",
  "full_text": "Italian Sausage and Fontina Shooter's-Style Sandwich With Sun-Dried Tomato-Caper Relish Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nActive\n40 mins\nRest Time\n4 hrs\nTotal\n4 hrs 40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n8\n-\nounce\n)\njar\nsun-dried tomatoes\n, drained with 1/4 cup oil reserved, and roughly chopped\n1/3\ncup\ncapers\n, drained and roughly chopped\n1/4\ncup chopped\nfresh parsley leaves\n1\nsmall\nshallot\n, minced (about\n1/4\ncup\n)\n1\nmedium\ngarlic clove\n, minced (about\n1\nteaspoon\n)\n2\nteaspoons\nred wine vinegar\nKosher salt and freshly ground black pepper\n1\ntablespoon\noil\n1 1/2\npounds\nItalian sausage\n, removed from casing\n1\nlarge\nonion\n, thinly sliced\n1\nbulb\nfennel\n, thinly sliced\n1\nlarge\nred pepper\n, thinly sliced\n1\nloaf\nrustic Italian bread\n12\nounces\ngrated fontina cheese\nDirections\nCombine sun-dried tomatoes and 1/4 cup of their oil, capers, parsley, shallot, garlic, and vinegar in a small bowl and stir with a fork. Season to taste with salt and pepper.\nHeat oil in a large skillet over medium-high heat until shimmering. Add sausage and cook, breaking it up with a wooden spoon or a potato masher, until fully cooked and just starting to brown, about 8 minutes. Transfer to a bowl, leaving fat in skillet.\nAdd onions, fennel, and peppers to skillet and cook over medium-high heat, stirring occasionally, until fully softened and just starting to brown, about 12 minutes. Season to taste with salt and pepper. Transfer to a plate lined with a double layer of paper towels and press with more paper towels to drain completely.\nSlice off the top 1 to 1 1/2-inches of the loaf of bread using a bread knife. Cut around the perimeter of the interior crumb, making sure not to break through the bottom crust, then use your hand to lift out the excess bread from the inside, leaving you with a hollow bread boat.\nSpread half of relish on bottom of sandwich and top with half of pepper/fennel mixture. Add 1/3 of cheese, then 1/2 of sausage, another 1/3 of cheese, remaining sausage, remaining cheese, remaining peppers and onions, and remaining relish Close sandwich.\nWrap sandwich tightly in aluminum foil or burtcher's paper, then place in between two stiff cutting boards. Place a heavy weight on top (about 40 pounds), press down firmly to flatten sandwich, then let rest under the weight for at least 4 hours and up to overnight (keep an eye on the sandwich to ensure that it is pressing evenly).\nWhen ready to eat, adjust oven rack to center position and preheat oven to 375°F. Remove weights, slice sandwich into four to six pieces through paper or foil with a bread knife, unwrap, and transfer to a rimmed baking sheet, pressing the pieces back together to form a full sandwich shape. Place in oven until hot and cheese has melted, about 15 minutes. Serve immediately.\nThis Recipe Appears In\n4 Close-Up, High-Def, Insanely Awesome Shooter's-Style Sandwiches\nSandwiches\nCheese\nSausages\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/italian-sausage-and-fontina-shooters-style-sandwich-with-sun-dried-tomato-caper-relish-recipe.webp?"
}