{
  "url": "https://www.seriouseats.com/italian-style-eggplant-parmesan-melanzane-alla-parmigiana-recipe",
  "image_url": null,
  "tags": [
    "Eggplant",
    "Italian",
    "Savory",
    "Mozzarella",
    "Vegetable Mains"
  ],
  "title": "Melanzane alla Parmigiana (Italian-Style Eggplant Parmesan) Recipe",
  "full_text": "Melanzane alla Parmigiana (Italian-Style Eggplant Parmesan) Recipe\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nActive\n30 mins\nSalting and Resting Time:\n30 mins\nTotal\n85 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOlive oil\n, vegetable oil, or a combination, for frying\n2\npounds\n(\n0.9\nkg\n)\neggplant\n(about\n2\nItalian\neggplant\n), sliced into 1/4-inch-thick rounds\nKosher salt\n1 1/4\ncups\n(\n360\nml\n)\ntomato sauce\n(see notes)\n3/4\npound\nshredded\nfresh mozzarella\n(\n12\nounces\n;\n340\ng\n), patted dry of excess moisture\nFresh oregano\nleaves (from about\n4\nsprigs\n) or fresh basil leaves (from\n1 or 2\nsprigs\n), torn\nDirections\nSet wire racks in two rimmed baking sheets. Arrange eggplant slices on racks and sprinkle lightly on both sides with salt. Let stand 20 minutes, then blot dry with towels.\nPreheat oven to 400°F (200°C). Fill a large cast iron skillet with 1/2 inch oil and heat over high heat until shimmering. Working in 3 to 4 batches, fry eggplant slices, turning, until browned on both sides, about 5 minutes. Transfer fried eggplant to a paper towel–lined half sheet pan to drain well, replacing paper towels as needed. Season lightly with salt. Repeat with remaining eggplant, topping up oil as needed.\nIn a 6-cup baking dish, arrange a layer of eggplant slices. Top with a thin layer of tomato sauce, followed by shredded mozzarella and oregano or basil leaves. Continue layering eggplant, sauce, cheese, and herbs to fill baking dish. Do not add oregano or basil to the top layer.\nBake eggplant Parmesan until bubbling and browned on top, 25 to 30 minutes. Let stand for 10 minutes to reabsorb juices. Sprinkle with oregano or basil leaves and serve.\nSpecial Equipment\n6-cup baking dish,\n10-inch cast iron skillet\n,\nhalf sheet pan\nNotes\nThe most important thing is that the tomato sauce is not too thin and watery, so make sure whichever sauce you use has been simmered long enough to thicken to something close to a thin applesauce consistency.\nYou can use the tomato sauce of your choice, but it's worth noting that it can be as simple as one 15-ounce can of puréed whole peeled tomatoes or a bottle of passata (Italian strained tomatoes): Simply lightly brown a clove of garlic in 2 tablespoons extra-virgin olive oil, add pureed tomatoes, and simmer with a sprig of basil or fresh oregano. Season with salt and discard garlic and herbs before using.\nEggplant\nItalian\nSavory\nMozzarella\nVegetable Mains"
}