{
  "url": "https://www.seriouseats.com/italian-roast-chicken-under-a-brick-pollo-al-mattone",
  "image_url": null,
  "tags": [
    "Chicken Mains",
    "Whole Chicken",
    "Italian",
    "Gluten-free Mains",
    "Roasted Chicken"
  ],
  "title": "Pollo al Mattone (Italian Roast Chicken Under a Brick)",
  "full_text": "Pollo al Mattone (Italian Roast Chicken Under a Brick)\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n15 mins\nMarinating and Resting Time\n40 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\nJuice\nand\nzest\nof\n1\nlemon\n(about\n2\ntablespoons\n;\n30\nml\njuice), zest finely minced, plus lemon wedges for serving\n1\nteaspoon\nred pepper flakes\nNeedles from\n1\n(\n8-inch\n)\nrosemary sprig\n, finely minced\nLeaves from\n1\nlarge\nsage\nsprig (about\n8\nleaves\n), finely minced\n4\nmedium\ncloves garlic\n, finely minced\n1\n(\n4- to 5-pound; 1.8 to 2.3 kg\n)\nchicken\nKosher salt\nand freshly ground black pepper\nCooking spray,\nsuch as Pam, or other neutral oil, for greasing the equipment\nDirections\nIn a medium bowl, mix together olive oil, lemon juice and zest, red pepper flakes, rosemary, sage, and garlic.\nUsing sharp kitchen shears or poultry shears, remove spine from chicken (reserve spine for\nstock\nor another use). Flatten chicken by placing it skin side up on a cutting board and applying firm pressure to the breastbone. Transfer to a baking dish, season all over with salt and pepper, add marinade, and rub all over chicken. Cover dish with plastic. Marinate, refrigerated, at least 30 minutes and up to overnight.\nPreheat oven, along with all cooking equipment for whichever setup you're using, including skillets, foil-wrapped bricks, chicken press, barbell weight, et cetera (see the \"Special Equipment\" section below for more info), to 475°F (245°C).\nScrape marinade and minced aromatics off chicken as best you can. Using cooking spray or oil, grease the interior of the bottom skillet/roasting vessel. Lay chicken down in skillet, skin side up, arranging it so that it lies flat.\nUsing cooking spray or oil, grease the bottom of the top weight. (Depending on your setup, this could be one side of the foil-wrapped bricks, or the bottom of the second skillet or chicken-press weight.) Press the top weight down on the chicken, making sure it evenly covers it and is in contact with both the breast and the legs.\nTransfer to oven and cook until thickest part of breast, close to bone, registers 150°F (66°C) on an instant-read thermometer, about 30 minutes.\nRemove chicken from oven, remove top weight, and let rest 5 to 10 minutes. Carve and serve with lemon wedges, drizzling fresh olive oil over chicken at the table.\nSpecial Equipment\nPerhaps the easiest approach is to use two regular bricks wrapped in heavy-duty aluminum foil as the weights, with a skillet below. Or you can use two large aluminum, cast iron, or stainless steel skillets, or an Italian chicken press. If you're using lightweight aluminum skillets, it helps to add a five- or 10-pound barbell weight (also preheated) to the top one to press it down onto the chicken better. If you're using cast iron, stainless steel, or aluminum, make sure the exterior of the top skillet is not treated with any kind of special finish or enamel—it should just be plain aluminum, stainless steel, or cast iron all over. To spatchcock the chicken, use\nkitchen shears\nor\npoultry shears\n. And don't forget to test for doneness with an\ninstant-read thermometer\n.\nChicken Mains\nWhole Chicken\nItalian\nGluten-free Mains\nRoasted Chicken"
}