{
  "url": "https://www.seriouseats.com/italian-american-beef-pork-meatballs-red-tomato-sauce-recipe",
  "image_url": null,
  "tags": [
    "Italian-American",
    "Ground Beef",
    "Pork",
    "Pancetta & Guanciale",
    "Beef Mains"
  ],
  "title": "The Best Italian-American Meatballs",
  "full_text": "The Best Italian-American Meatballs\nJump to recipe\nPrep\n50 mins\nCook\n25 mins\nActive\n60 mins\nChilling Time\n30 mins\nTotal\n105 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n1/4\n-\nounce\n(\n7\ng\n)\npacket\nunflavored gelatin\n(optional, see note)\n1/2\ncup\n(\n120\nml\n)\nhomemade\nchicken stock\nor\nlow-sodium\nbroth (optional, see note)\n6\nounces\n(\n170\ng\n) crustless fresh\nwhite bread\n, cut into\n1/2-inch\ncubes\n(about\n2 1/2\nunpacked\ncups\n)\n1/3\ncup\n(\n80\nml\n)\nbuttermilk\n, plus more as needed\n2\ncups\nfinely minced yellow\nonion\n(\n9\nounces\n;\n265\ng\n) from\n1\nlarge\n10\n-\nounce\nonion\n3\nounces\n(\n85\ng\n)\nfatty pancetta\n, finely minced (about\n3/4\ncup\n), see note\n2\nounces\n(\n55\ng\n)\nParmigiano-Reggiano\n, grated (about\n1 1/4\ncups\n), plus more for serving\n8\nmedium cloves\ngarlic\n(about\n1 3/4\nounces\n;\n50\ng\n),\nfinely minced\n(about\n2 1/2\ntablespoons\n)\n1/2\ncup\nloosely packed\nfresh flat-leaf parsley leaves\n(\n1/2\nounce\n;\n15\ng\n), minced (about\n2 1/2\ntablespoons\n)\n4\nlarge\negg yolks\n1\nteaspoon\ndried oregano\n1\nteaspoon\nground fennel seed\n1\ntablespoon\nDiamond crystal\nkosher salt\n(\n9\ng\n); for table salt use half as much by volume or the same weight\n1/2\nteaspoon\nfreshly\nground black pepper\n1\npound\n(\n455\ng\n)\nground beef\n(\nat least 25% fat\n; see note)\n1\npound\n(\n455\ng\n)\nground pork\n(\nat least 25% fat\n; see note)\n5\ncups\n(\n1.2\nL\n)\ntomato sauce\n, such as\nQuick and Easy Italian American Red Sauce\n,\nThe Best Slow Cooked Tomato Sauce\n, or\nThe Best Fresh Tomato Sauce\nDirections\nIn a heatproof measuring cup, sprinkle gelatin all over surface of stock and let stand for 5 minutes. (If not using stock and gelatin, proceed to Step 2.) Microwave stock, stirring once or twice, until gelatin completely dissolves, 1 to 2 minutes. Pour stock into a wide heatproof bowl and refrigerate until fully set, about 30 minutes.\nIn the bowl of a stand mixer, combine bread with buttermilk, tossing to coat. Let stand, tossing occasionally, until bread is completely moist, about 10 minutes. Squeeze bread between your fingers or mash with a spoon to make sure there are no dry spots; if there are dry spots that refuse to moisten, add more buttermilk, 1 tablespoon at a time, until bread is moist throughout.\nVicky Wasik\nAdd onion, pancetta, Parmigiano-Reggiano, garlic, parsley, egg yolks, oregano, fennel, salt, and pepper to bread/buttermilk mixture. Finely mince gelled stock, if using, and add.\nVicky Wasik\nSet mixer bowl in stand mixer and attach paddle. Starting at low speed and gradually increasing to medium-high speed, beat bread mixture until thoroughly blended, stopping to scrape down sides as necessary, 1 minute. Add 1/3 each of the beef and pork and beat at medium-high speed until thoroughly blended with bread mixture.\nVicky Wasik\nRemove bowl from stand mixer and add remaining beef and pork. Using a clean hand, gently mix meatball mixture, teasing apart ground meat with your fingers, just until ground beef and pork are thoroughly mixed in and no pockets of unincorporated meat remain; avoid mixing any more than is necessary for even distribution.\nVicky Wasik\nPreheat broiler and set oven rack in upper position. Line 2 rimmed baking sheets with aluminum foil. Form meatball mixture into tight handball-sized balls (about 2-inches wide and about 3- to 3 1/4-ounces each) and arrange on prepared baking sheet; you should be able to make about 20. Broil meatballs until browned on top, 7 to 10 minutes. (Browning times can vary dramatically, depending on oven broiler strength.)  Repeat with remaining meatballs.\nVicky Wasik\nHeat tomato sauce in a medium pot until simmering and add half of the meatballs. Simmer until meatballs are just cooked through and register about 145°F (63°C) on an instant-read thermometer, about 10 to 12 minutes. Transfer to a serving bowl or platter. Repeat with remaining meatballs.\nVicky Wasik\nServe meatballs, spooning sauce all over and grating more cheese on top.\nVicky Wasik\nSpecial Equipment\nStand mixer\n,\nrimmed baking sheet\n,\ninstant-read thermometer\nNotes\nThis recipe makes about 20 handball-sized meatballs; you can make them smaller or larger, as you prefer, but cooking times will change.\nThe chicken stock and gelatin help make meatballs that are insanely juicy and tender, but these meatballs will still be incredibly moist even without them.\nThe pancetta in this recipe adds juiciness and moisture, so the fattier the better; if you use pancetta that is too lean (more than 50% muscle), you won't get the same benefit. Pancetta is easiest to mince when nearly frozen.\nIt can be difficult to guarantee the fat percentage of pre-ground meat, but a higher-fat mix of about 25% is one of the keys to juicy and tender meatballs, so do your best to track down ground beef and pork from a meat counter or butcher that can get you the meat ground to your specifications. Similarly, the meat should be a fine or medium grind, not coarse, so make sure to confirm a proper grind when buying. Of course you can control all of this by grinding the meat yourself using cuts like beef chuck and pork shoulder, which both will get you in the ballpark of the fat percentage you need; if you do grind the meat yourself, you can save time by running the pancetta through the grinder too (just make sure it's nice and cold before grinding).\nItalian-American\nGround Beef\nPork\nPancetta & Guanciale\nBeef Mains"
}