{
  "url": "https://www.seriouseats.com/italian-sausage-with-peppers-sandwich-recipe-8410214",
  "image_url": null,
  "tags": [
    "Sandwiches",
    "The Latest",
    "Sausages"
  ],
  "title": "Italian Sausage and Peppers Sandwich",
  "full_text": "Italian Sausage and Peppers Sandwich\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nTotal\n35 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, divided\n6\ngarlic\ncloves\n, finely minced (\n1\nounce\n;\n28\ng\n), divided\n2\nteaspoons\ndried\nItalian seasoning\nblend (see notes)\n1\nteaspoon\nfennel seeds\n1/4 to 1\nteaspoon\ncrushed red pepper flakes\n(see notes)\n1\ncup\n(\n237\nml\n) dry\nwhite wine\n2 1/2\ncups\n(\n591\nml\n) homemade or store-bought\nlow-sodium chicken stock\n1\n(15-ounce; 425 g) can\ntomato sauce\n3\nmedium yellow, red, or\ngreen bell peppers\n(\n1 pound; 453 g\neach), stemmed, seeded, and cut into 1/4-inch-wide strips (about\n5\ncups\n)\n2\nmedium\nsweet onions\n(\n6 ounces; 170 g\neach), thinly sliced (about\n3\ncups\n)\n1\nteaspoon\nkosher salt\n; for table salt use half as much by volume\n1/2\nteaspoon\nground black pepper\n4\nsweet or hot\nItalian sausages\n(\n4 ounces; 113 g\neach)\n4\n(\n8-inch)\nItalian\nsub rolls\n, split lengthwise and lightly toasted\nDirections\nIn a large saucepan, heat 2 tablespoons oil over medium heat until shimmering. Add half of the garlic, Italian seasoning, fennel seeds, and crushed red pepper and cook, stirring constantly, until fragrant and garlic is lightly browned, about 1 minute. Pour in the wine and cook, stirring, for 1 minute. Stir in chicken stock and tomato sauce and bring to a simmer.\nSerious Eats / Victor Protasio\nAdd sausages to the tomato mixture. Return mixture to a gentle simmer over medium heat and cook, stirring occasionally and adjusting heat as needed to maintain gentle simmer, until sausages registers 145°F (62℃), 8 to 10 minutes; remove from heat.\nSerious Eats / Victor Protasio\nMeanwhile, heat an empty large cast-iron skillet over medium-high heat for 3 minutes, then add remaining 2 tablespoons of oil and heat until shimmering. Add peppers, onions, salt and pepper and cook, stirring occasionally, until vegetables are softened and beginning to brown, 12 to 14 minutes. Add the remaining half of the garlic and cook, stirring occasionally, until fragrant, about 1 minute.\nSerious Eats / Victor Protasio\nUsing tongs, push onion mixture to the edges of the skillet and place sausages into the clearing in the center of the skillet. Sear the sausages over medium-high heat, flipping sausages and stirring vegetables occasionally, until sausages are well browned in spots, about 4 minutes. Transfer sausages to a plate.\nSerious Eats / Victor Protasio\nStir 1 cup of the cooked tomato mixture into pepper and onion mixture in the skillet. Cook, stirring constantly, until thickened and vegetables are well coated, about 1 minute. Remove from heat.\nSerious Eats / Victor Protasio\nPlace 1 sausage in each bun. Divide pepper and onion mixture evenly among buns, spooning any remaining sauce from the skillet over top. Serve.\nSerious Eats / Victor Protasio\nSpecial Equipment\nLarge saucepan\n,\nlarge cast-iron skillet\nNotes\nItalian seasoning blend is usually made from a mixture of dried herbs including oregano, basil, thyme, rosemary, sage, and marjoram. Feel free to mix up your own version using whichever of those dried herbs you have on hand.\nRed pepper flakes can vary significantly in their level of spiciness, as does an individual's tolerance for heat. Use more or less depending on the intensity of heat of your red chile flakes as well as your heat preference.\nSandwiches\nThe Latest\nSausages"
}