{
  "url": "https://www.seriouseats.com/italian-rainbow-cookies-recipe-8763695",
  "image_url": "https://www.seriouseats.com/thmb/a8Ks2C7CaOtc56dIBLpaygW4DlQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241217ItalianRainbowCookies-AmandaSuarez-30-df261e50af874b6a93199e5f7c97b5ed.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Italian-American",
    "Christmas"
  ],
  "title": "Italian Rainbow Cookies: A Step-by-Step Guide for Beginners",
  "full_text": "Italian Rainbow Cookies: A Step-by-Step Guide for Beginners\nClose\nJump to recipe\nPrep\n25 mins\nCook\n35 mins\nRefrigeration and Cooling\n3 hrs\nTotal\n4 hrs\nServes\n20\nMakes\n60 Cookies\nCook Mode\n(Keep screen awake)\nIngredients\n226g bleached\ncake flour\n(8 ounces;\n2\ncups)\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nkosher salt;\nfor table salt, use half as much by volume\n304\ng\nsugar\n(10 3/4 ounces; 1 1/2 cups)\n227\ng\n(8 ounces)\nalmond paste\n, cut into 1-inch pieces\n113g\nunsalted butter\n(4\nounces;\n8 tablespoons), cut into 8 pieces and softened to room temperature\n6\nlarge\neggs,\nroom temperature\n1 teaspoon (\n15\nml)\nvanilla extract\n1/4\nteaspoon\nred gel\nfood coloring\n, plus more if needed (see notes)\n1/4\nteaspoon\ngreen gel\nfood coloring,\nplus more if needed (see notes)\n160\ng\n(2/3 cup) apricot or\nraspberry jam\n170g\nbittersweet chocolate chips\n(6\nounces\n; 1 cup)\nDirections\nAdjust oven rack to middle position and heat oven to 350℉ (175℃). Grease 13 by 9-inch baking pan with nonstick cooking spray. Make parchment paper sling by folding 1 long sheet of parchment 13 inches wide and laying across width of pan, with extra parchment hanging over edges of pan. Push parchment into corners and up sides of pan, smoothing parchment flush to pan. Grease parchment with nonstick cooking spray.\nSerious Eats / Amanda Suarez\nIn a bowl, whisk flour, baking powder, and salt until well combined; set aside. In a stand mixer fitted with the paddle attachment, beat together sugar and almond paste on medium speed until well blended and sandy in texture, about 3 minutes; if some small bits of almond paste may remain that is OK.\nSerious Eats / Amanda Suarez\nAdd butter to the sugar mixture in the stand mixer bowl and beat together on medium speed until well combined and lightened, about 6 minutes; the mixture will be slightly dry and crumbly compared to butter creamed with sugar alone. Add eggs,1 at a time, beating well after each addition, followed by the vanilla. Slowly add flour mixture until just combined, scraping down sides of mixer bowl as needed to incorporate all the flour.\nSerious Eats / Amanda Suarez\nTransfer 1/3 of batter (380g) to prepared pan and spread in even layer with a small offset spatula (it will be a very thin layer of batter). Bake until top is set and edges are just starting to brown, 10 to 12 minutes. Let cool 10 minutes in pan. Using parchment overhang, carefully lift cake out of pan and transfer to wire rack. Let cake and pan cool, about 15 minutes.\nSerious Eats / Amanda Suarez\nDivide remaining batter between 2 medium bowls (380g batter per bowl). Stir red food coloring into first bowl and green food coloring into second bowl. Batter should be intense red and green at this stage; if needed, add more food dye to achieve this.\nSerious Eats / Amanda Suarez\nWorking with one colored batter at a time, make a new parchment sling following directions above for the now-empty pan, grease lightly, and repeat baking, letting pan cool after each batch.\nSerious Eats / Amanda Suarez\nOnce cake layers are all completely cooled, center a parchment paper–lined rimmed baking sheet over the red cake layer, invert red cake layer onto sheet, and gently remove top parchment. Spread 1/3 cup jam evenly over top. Using two hands, carefully and quickly invert plain cake layer onto red layer and gently remove top parchment. Spread remaining 1/3 cup jam evenly over top. Invert green layer onto plain layer and gently remove parchment.\nSerious Eats / Amanda Suarez\nCover with plastic wrap and weight with a large baking pan centered on top. Refrigerate for at least 2 hours or up to 8 hours.\nSerious Eats / Amanda Suarez\nRemove top sheet pan and plastic wrap. In a bowl, microwave chocolate at 50 percent power, stirring occasionally, until melted, 2 to 7 minutes. Spread chocolate evenly over top layer (it’s OK if some spills over the edges, they will be trimmed off layer). Let set for 2 minutes, then, using a fork, make a wavy decorative pattern in the chocolate. Let cool at room temperature until chocolate has set, 30 to 60 minutes.\nSerious Eats / Amanda Suarez\nUsing a very sharp serrated knife or very sharp long slicing knife, trim away edges. Cut lengthwise into 5 equal strips (about 1 1/2 inches wide) and then crosswise into 12 equal strips (about 1 inch wide). (For cleaner cuts, run knife under warm water and dry knife with a clean kitchen towel before portioning each slice.) Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nStand mixer with paddle attachment, parchment paper, nonstick cooking spray, sharp serrated knife\nNotes\nTo achieve a bright red and green color, you may need to adjust the amount of food dye you use. Add a few additional drops at a time as needed.\nMake-Ahead and Storage\nStore cookies layered between sheets of wax paper or parchment, in an airtight container at room temperature for up to 1 week. Cookies can also be frozen for up to 1 month. Thaw at room temperature before serving.\nCookies\nThe Latest\nItalian-American\nChristmas",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/italian-rainbow-cookies-a-step-by-step-guide-for-beginners.webp?"
}