{
  "url": "https://www.seriouseats.com/jalapeno-limeade-recipe-8648682",
  "image_url": "https://www.seriouseats.com/thmb/JHaZk5NvL6Kd7OWxpZYDvMM-_Pk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240513-SpicyLemonades-AmandaSuarez-33-25be348f4b2240c5b1914b453bef70ba.jpg",
  "tags": [
    "Non-Alcoholic Drinks",
    "The Latest",
    "Cucumbers",
    "Summer Drinks",
    "Lime"
  ],
  "title": "Spicy Cucumber-Jalapeño Limeade",
  "full_text": "Spicy Cucumber-Jalapeño Limeade\nClose\nJump to recipe\nPrep\n15 mins\nCook\n0 mins\nMacerating Time\n3 hrs\nTotal\n3 hrs 15 mins\nServes\n6\nto 8 servings\nMakes\n1 quart limeade concentrate\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.3\nkg\n)\nlimes\n(\n12 to 16\nmedium\nlemons\n)\n1\nlarge 12-ounce (340 g)\nEnglish cucumber\n1 to 2\nlarge\njalapeños\n(\n2 1/2\nounces\n;\n70\ng\n), stemmed and minced (see notes)\n14\nounces\nsugar\n(\n2\ncups\n;\n400\ng\n)\n20\nounces\ncold\nwater\n(\n2 1/2\ncups\n;\n590\nml\n)\nFresh mint sprigs\n, for garnish\nDirections\nCut off a 2-inch section from the cucumber and reserve, well wrapped in the refrigerator, for garnish. Very thinly slice the remaining cucumber and set aside. Bring limes to room temperature, then roll firmly against the counter to soften their rinds. Halve and juice; pour juice into a sealable container and add the sliced cucumber, then refrigerate.\nSerious Eats / Amanda Suarez\nCut lime rinds into 1-inch chunks. Toss with minced jalapeño and sugar in a large nonreactive mixing bowl, cover tightly with plastic, and let stand at room temperature, stirring once every 45 minutes or so, until sugar has completely dissolved, about 3 hours. (You can let the mixture stand up to 12 hours, if desired.)\nSerious Eats / Amanda Suarez\nStrain cucumber-infused lime juice; discard cucumber. Add water and 12 ounces (1 1/2 cups) of cucumber-lime juice (see note). Stir well, then strain through a nonreactive fine-mesh strainer or piece of cheesecloth into a glass or ceramic container, pressing to express liquid; discard solids. At this point, the concentrated jalapeño-limeade can be refrigerated for up to 1 week.\nSerious Eats / Amanda Suarez\nWhen ready to serve, pour spicy limeade over ice and adjust to taste with additional water or cucumber-lime juice, depending on personal preference; bear in mind, though, that the limeade will be diluted as the ice melts. (You will likely have some fresh cucumber-lime juice left over, which can be reserved for another use, though exactly how much you have will depend on how much you added to adjust the limeade.)\nSerious Eats / Amanda Suarez\nSpecial Equipment\nCheesecloth or nonreactive fine-mesh strainer, 2-quart pitcher\nNotes\nHow many jalapeños you use will depend heavily on your tolerance for heat. In our testing, 2 large jalapeños produced a limeade with strong but tolerable heat. Depending on your taste, you may want to use more or less jalapeño for hotter or milder effect. You can also use smaller green chiles such Serranos, but keep in mind that you may need to use a different total weight of those to compensate for their heat. If in doubt, start with less and taste the jalapeño-lime syrup as it develops; you can always add more but cannot remove the chiles if they're too much.\nMake-Ahead and Storage\nThe concentrated jalapeño-limeade can be refrigerated in an airtight container for up to 1 week.\nNon-Alcoholic Drinks\nThe Latest\nCucumbers\nSummer Drinks\nLime"
}