{
  "url": "https://www.seriouseats.com/jalea-peruvian-fried-seafood-salsa-criolla-recipe",
  "image_url": "https://www.seriouseats.com/thmb/0I8z93j5QHY6VpWhxDDXVLTn9Lc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__06__20150622-jalea-fried-seafood-peruvian-vicky-wasik-15-2f5d1581681f4b548b37d2af9bb92dc8.jpg",
  "tags": [
    "Seafood Mains",
    "Peruvian",
    "Halibut",
    "Squid",
    "Shrimp"
  ],
  "title": "Jalea (Peruvian Fried Seafood Platter With Lime-Marinated Onion & Tomato Salad)",
  "full_text": "Jalea (Peruvian Fried Seafood Platter With Lime-Marinated Onion & Tomato Salad)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n60 mins\nResting Time\n15 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salsa Criolla:\n1/2\nlarge\nred onion\n, very thinly sliced\n2\nmedium\nplum tomatoes\n, diced\n1/4\ncup\nloosely packed\nchopped cilantro\nleaves and tender stems\n1\nfresh\naji amarillo\npepper\n, stemmed, seeded, and minced (see notes)\n1\nmedium\nclove garlic\n, minced\n1/4\ncup\nfresh juice\nfrom\n3\nlimes\nKosher salt\nFor the Fried Seafood:\n1 1/2 to 2\nquarts\npeanut, canola, or\nvegetable oil\n4 1/2\ncups\nall-purpose flour\n, divided\n3/4\ncup\ncornstarch\n1 1/2\nteaspoons\nbaking powder\nKosher salt\nand freshly ground black pepper\n1/2\nteaspoon\npaprika\n2\ncups\nlight beer\n, divided\n1/2\npound\nskinned and boned firm white-fleshed fish, such as\nhalibut\n, wild striped bass, or cod, sliced into 1 1/2- by 1-inch pieces\n1/2\npound\nshelled and deveined large shrimp\n1/3\npound\ncleaned\nsquid\nbodies and tentacles, bodies sliced crosswise into 1/2-inch rings\nTo Serve:\n1\nrecipe\nfried yuca with spicy mayo\n, for serving\nDirections\nFor the Salsa Criolla:\nIn a large bowl, toss onion, tomatoes, cilantro, aji amarillo, garlic, and lime juice together until well combined. Season with salt. Let stand, stirring occasionally, until onions soften slightly and turn a brighter pink color, about 10 minutes. Drain well.\nSerious Eats / Vicky Wasik\nFor the Fried Seafood:\nPreheat oven to 400°F (200°C). In a fryer, medium pot, or wok, heat oil to 350°F (177°C), adjusting heat source as needed to maintain temperature.\nMeanwhile, add 1 1/2 cups flour to a large bowl with cornstarch, baking powder, 1 1/2 teaspoons salt, 3/4 teaspoon ground black pepper, and paprika. Whisk to combine. Add 1 1/2 cups beer, whisking to form a thick batter; some small lumps of flour are okay. In a separate medium bowl, add remaining 3 cups flour.\nSerious Eats / Vicky Wasik\nDredge white-fleshed fish in flour, shake off excess, and transfer to beer batter, turning to coat. Working one piece at a time, pick up the fish and allow excess batter to drip back into the bowl (a wire strainer can be helpful with this). Return it to the bowl with dry flour and quickly coat it on both sides. Repeat with remaining fish. Pick up fish pieces with your hands, tossing them gently in your open fingers to get rid of excess flour. Carefully lower into the hot oil and fry, agitating and turning frequently, until golden brown outside, about 3 minutes. Transfer fish to a large paper towel-lined mixing bowl and season with salt, shaking gently to absorb oil. Transfer fish to a wire rack set over a baking sheet.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nIncrease oil temperature to 375°F (191°C), adjusting heat to maintain temperature. Repeat dredging and battering process with shrimp and fry until golden, 2 to 3 minutes. Transfer to the large mixing bowl lined with fresh paper towels and season with salt, shaking gently to absorb oil. Transfer shrimp to wire rack with fish.\nSerious Eats / Vicky Wasik\nWhisk remaining 1/2 cup beer into batter until thoroughly incorporated (this will thin the batter slightly, making the squid easier to work with). Repeat dredging process with squid, making sure to drain each piece well of batter before the final coating in flour. Fry until golden, about 2 minutes. Transfer to the same large mixing bowl once again lined with fresh paper towels and season with salt. Shake gently to absorb excess oil.\nTo Serve:\nIf fried seafood has cooled, set in oven until reheated, about 3 minutes. Mound fried seafood on a plate. Arrange salsa criolla on top and serve immediately with fried yuca and its dipping sauce.\nSpecial Equipment\nMedium saucepan, wok, or deep fryer, instant-read thermometer\nNotes\nAji amarillo is a small yellow hot pepper popular in Peruvian cuisine. It can be difficult to find, but can easily be substituted with 1 small fresh Serrano chile, or 1/2 red Fresno chile or jalapeño.\nIf you do fry the yuca as recommended, I suggest frying it first, then rewarming it in the oven before serving.\nSeafood Mains\nPeruvian\nHalibut\nSquid\nShrimp",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/jalea-peruvian-fried-seafood-platter-with-lime-marinated-onion-tomato-salad.webp?"
}