{
  "url": "https://www.seriouseats.com/jamaican-curry-chicken-recipe-7371772",
  "image_url": "https://www.seriouseats.com/thmb/PBS-fhFZgy1m8IQ79nZjE_M8pYI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230327-SEA-CurryChicken-KarinaMatalon-29-2d341df986fb4be98369d38ddbe2fd93.JPG",
  "tags": [
    "Jamaican",
    "The Latest",
    "Chicken",
    "Braised & Stewed Chicken",
    "Stovetop Chicken"
  ],
  "title": "Jamaican Curry Chicken",
  "full_text": "Jamaican Curry Chicken\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nMarinating Time\n60 mins\nTotal\n2 hrs 10 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinated Chicken:\n3 1/2\npounds\n(\n1.6\nkg\n) bone-in, skin-on\nchicken\nparts (see notes)\n1\nlime or\nlemon\n, halved\nKosher salt\nand freshly ground black pepper\n2\nteaspoons\nground turmeric\n3\nmedium\ncloves garlic\n, minced\n1\nsmall\nScotch bonnet\npepper\n, stemmed, seeded, and minced\n1\ntablespoon\nJamaican\ncurry powder\n1\nteaspoon\nground allspice\n1\nteaspoon\nminced\nfresh ginger\n1\ntablespoon\npicked\nfresh thyme leaves\nFor the Curry:\n1/4\ncup\n(\n60\nml\n) canola or other neutral\noil\n, divided\n1\ntablespoon\nJamaican\ncurry powder\n1\nteaspoon\nminced\nfresh ginger\n1\nteaspoon\nground cumin\n, optional (see notes)\n1\nteaspoon\nground coriander\nseed, optional (see notes)\n1\nteaspoon\ngaram masala\n, optional (see notes)\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n237\ng\n), diced\n2\nmedium\ncarrots\n(about\n8\nounces\n;\n237\ng\ntotal), peeled and diced (optional; see notes)\n1\nsmall\nYukon Gold potato\n(\n5\nounces\n;\n142\ng\n), diced (optional; see notes)\n2\nthyme\nsprigs\n1\nsmall\nScotch bonnet\npepper\n, whole\n5\nwhole\nallspice berries\n1/2\ncup\n(\n113\nml\n)\ncoconut milk\nfrom\n1\n(13.5-ounce; 400 ml) can\n, plus more if needed (see notes)\nServing suggestions:\nJasmine or\nbasmati rice\n, mango or papaya chutney, fried plantains, and sliced avocado\nDirections\nFor the Marinated Chicken:\nRub chicken all over with lime (or lemon), then season all over with salt and pepper.\nSerious Eats / Karina Matalon\nIn a medium bowl, stir together turmeric, garlic, minced Scotch bonnet, curry powder, ground allspice, ginger, and thyme leaves. Add chicken pieces and, using gloved hands, massage the spice marinade all over chicken, including under the skin. Cover chicken and marinate, refrigerated, for at least 1 and up to 12 hours.\nSerious Eats / Karina Matalon\nFor the Curry:\nIn large heavy-bottomed pot or Dutch oven, warm 2 tablespoons (30ml) oil over medium heat until shimmering. Working in batches if necessary to avoid crowing the pot, add chicken pieces and cook, turning often, until lightly browned on both sides, about 5 minutes; be careful not to let the marinated chicken get too dark. Transfer chicken to a platter and set aside.\nSerious Eats / Karina Matalon\nAdd remaining 2 tablespoons (30ml) oil to pot. Add curry powder, ginger, cumin, coriander seeds, and garam masala (if using), and cook, stirring, until lightly toasted, about 1 minute.\nSerious Eats / Karina Matalon\nStir in onion, carrots, and potato (if using). Cook, until just starting to soften, about 5 minutes.\nSerious Eats / Karina Matalon\nAdd chicken back to pot along with any accumulated juices and stir to coat with aromatics and spices. Add 1 cup (227ml) hot water, thyme sprigs, whole Scotch bonnet, and allspice berries and bring to a boil. Cover, reduce heat to low, and simmer 30 minutes.\nSerious Eats / Karina Matalon\nUncover and add 1/2 cup (113ml) coconut milk, then continue to simmer, uncovered, until the sauce forms a rich, gravy-like consistency, about 15 minutes. If needed, add more water and/or coconut milk to thin an over-reduced sauce. Season with salt and pepper.\nSerious Eats / Karina Matalon\nWe like to serve this with jasmine or basmati rice, mango or papaya chutney, fried ripe plantains, and sliced avocado.\nSerious Eats / Karina Matalon\nSpecial Equipment\nDutch oven\nNotes\nYou can use any combination of breasts and/or legs, or a whole chicken cut into pieces. In Jamaica it's most common to chop the chicken pieces through the bone into even smaller pieces, which you can do here; at the very least, separate drumsticks and thighs at the joint and divide the breast in two, such that one piece of the breast has the wing attached and the other is the tapered end.\nWe like to add ground cumin, coriander seed, and garam masala to Jamaican curry powder for additional depth of flavor, but it's not required, and not something many Jamaican cooks would do. Feel free to omit those additional spices, if desired.\nPotatoes and carrots are something some cooks in Jamaica add to their curry chicken, while others don't. Our personal preference is not to include them, but we've left them as optional here in case you're a fan.\nCoconut milk, while not in many Jamaican curry chicken recipes, is a must-add for us, as it creates a gravy that is delicate yet rich, with a deeper depth of flavor.\nMake-Ahead and Storage\nThe curry chicken can be refrigerated in an airtight container for up to 2 days.\nJamaican\nThe Latest\nChicken\nBraised & Stewed Chicken\nStovetop Chicken"
}