{
  "url": "https://www.seriouseats.com/jamaican-escovitch-fish-recipe-8399349",
  "image_url": "https://www.seriouseats.com/thmb/U9RTN6WFpFNk0HSFievYRKtUJwc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231127-SEA-JamaicanEscovitchFish-KarinaMatalon-hero-b30d273afd724c5cad0c2f1c747503ce.jpg",
  "tags": [
    "Snapper",
    "The Latest",
    "Fried Seafood",
    "Jamaican",
    "Fish"
  ],
  "title": "Jamaican Escovitch Fish",
  "full_text": "Jamaican Escovitch Fish\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Fried Fish:\n4\n(8- to 10-ounce; 225-285 g\n) whole cleaned\nsnapper\nor\n4\n(6- to 8-ounce; 170-230 g)\nskin-on snapper fillets\n4\nlimes\n, halved\n2\nmedium\ncloves garlic\n, minced\nKosher salt\nand\nfreshly ground black pepper\n1/4\ncup\nall-purpose flour\n(\n32\ng\n)\n1 1/2\ncups\nunrefined\ncoconut oil\n, for frying\nFor the Escovitch Sauce:\n2\ncups\n(\n473\nml\n) white\ncane vinegar\n, such as Grace brand, or distilled white vinegar\n1\nteaspoon\ngranulated\nsugar\nPinch\nkosher salt\n1\ncup\n(\n100\ng\n) julienned\nchayote\n1\ncup\n(\n100\ng\n) julienned\ncarrot\n2\nmedium\nyellow onions\n(\n8 ounces; 227 g\neach), thinly sliced crosswise into rounds\n1\nScotch bonnet pepper,\nstemmed and thinly sliced either with or without seeds (keep seeds if you want more heat)\n6\nallspice berries\nDirections\nFor the Fried Fish:\nWash fish well and rub all over with cut surface of lime halves, including inside cavity if using whole fish. Pat dry. Using a sharp knife, score the skin side of the fish by cutting a series of diagonal slashes through the skin. Rub garlic all over, then season lightly with salt and pepper, including inside the fish cavity if using whole fish.\nSerious Eats / Karina Matalon\nSpread flour in a wide, shallow dish. Dredge fish lightly by dipping both sides into flour and then shaking off excess.\nSerious Eats / Karina Matalon\nIn a large cast iron skillet or stainless-steel sautè pan, heat 1/2 inch oil over medium heat until melted and shimmering. Gently add fish, skin side down, and fry until golden brown on first side, 3 to 4 minutes.\nSerious Eats / Karina Matalon\nCarefully flip fish and cook until second side is golden brown and flesh is opaque and flaky, 3 to 4 minutes. Using a slotted fish spatula, carefully lift fish from oil and transfer to paper towel-lined plate to drain.\nSerious Eats / Karina Matalon\nFor the Escovitch Sauce:\nIn a 2-quart saucepan, bring vinegar, 1 cup (237ml) water, sugar, and salt  to a boil over medium heat. Add chayote, carrots, onions, Scotch bonnet, and allspice berries, then return to simmer and cook for 3 minutes. Remove from heat.\nSerious Eats / Karina Matalon\nTransfer fried fish to a rimmed heatproof platter or serving dish. Pour hot escovitch sauce over fried fish. Serve hot or let cool to room temperature before serving.\nSerious Eats / Karina Matalon\nSpecial Equipment\nLarge cast iron skillet or stainless-steel sautè pan\nNotes\nChayote is a type of squash that is native to Mexico, but popular in Jamaican cuisine. The fruit is a member of the gourd family and it looks like a large pear, with a more wrinkly bottom. Look for a chayote squash that is even in color, firm, free of blemishes, and on the smaller side.\nNowadays, Escovitch fish is often served with fried bammy, a local cassava flatbread inherited from our Taino heritage.\nMake-Ahead and Storage\nThe escovitch pickle can be stored for up to 7 days in the fridge.\nSnapper\nThe Latest\nFried Seafood\nJamaican\nFish"
}