{
  "url": "https://www.seriouseats.com/jamaican-breadfruit-recipe-8407277",
  "image_url": "https://www.seriouseats.com/thmb/1PoJg46Z_d6ovtvM0-3sbw9tqg0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231129-SEA-Breadfruit-KarinaMatalon-hero-5968808bc1e24a81b5b73841d55819c0.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Fruit",
    "Roasting",
    "Jamaican",
    "Grilled Fruit"
  ],
  "title": "Jamaican Roasted Breadfruit",
  "full_text": "Jamaican Roasted Breadfruit\nClose\nJump to recipe\nPrep\n5 mins\nCook\n90 mins\nCooling Time\n20 mins\nTotal\n115 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n3- to 4-pound)\nbreadfruit\n(\n1.4-1.8 kg\n)\nSoftened salted or\nunsalted butter,\nfor serving\nFlaky or\nsea salt\n, for serving\nDirections\nUsing a sharp knife, cut out stem end of breadfruit (similar to hulling a strawberry or coring a tomato). Make an X-shaped crosscut at opposite end.\nSerious Eats / Karina Matalon\nIf using a Charcoal Grill:\nOpen bottom vent of grill. Light one large chimney filled with charcoal (about 6 quarts). When all charcoal is lit and top coals are covered with gray ash, pour coals and spread evenly over half of coal grate. Carefully nestle the breadfruit, stem side down, in the hot coals, mounding additional hot coals up around the breadfruit.\nEmber-roast the breadfruit, using grill tongs or fireproof grill mitts to carefully rotate breadfruit every 15 minutes, until skin is charred all over and flesh can be easily pierced through to the center with a skewer or knife, 40 to 60 minutes.\nSerious Eats / Karina Matalon\nIf Using a Gas Grill:\nTurn on grill burners to medium. Set breadfruit on grill grate, stem side down, directly over flame. Roast, using grill tongs or a fireproof grill mitt to carefully rotate breadfruit every 15 minutes, until skin is deeply browned all over and flesh can be easily pierced through to the center with a skewer or knife, about 1 hour.\nIf Using the Oven:\nAdjust oven rack to middle position and preheat oven to 400°F (200°C). Place breadfruit directly on oven rack and roast, flipping once halfway through cooking, until well browned on outside and flesh can be easily pierced through to the center with a skewer or knife, 1 to 1 1/2 hours.\nSerious Eats / Karina Matalon\nLet cool for 20 minutes. Using a sharp knife, peel off blackened skin.\nSerious Eats / Karina Matalon\nCut breadfruit into quarters, then cut out the fibrous core (or \"heart\"). Cut lengthwise into thin slices. Spread liberally with butter and sprinkle with salt. Serve immediately.\nSerious Eats / Karina Matalon\nSpecial Equipment\nCharcoal grill or gas grill\nMake-Ahead and Storage\nRoasted breadfruit that is not consumed can be stored in an airtight container in the fridge. To eat after it has been chilled, fry the slices in oil until exterior is crispy and lightly golden, about 2 minutes per side. Sprinkle with sea salt and enjoy as a snack or side dish.\nSnacks & Appetizers\nFruit\nRoasting\nJamaican\nGrilled Fruit",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/jamaican-roasted-breadfruit.webp?"
}