{
  "url": "https://www.seriouseats.com/jamaican-pickled-herring-recipe-7498860",
  "image_url": "https://www.seriouseats.com/thmb/ivRd0gLr5USQtZ5WxbAx_H17_8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230516-SEA-PickledHerring-KarinaMatalon13-2291ef2e292b4b289d1eb67435a9a8c5.jpg",
  "tags": [
    "Jamaican",
    "The Latest",
    "Snacks & Appetizers",
    "Fish",
    "Caribbean"
  ],
  "title": "Jamaican Pickled Herring",
  "full_text": "Jamaican Pickled Herring\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nSoaking and Chilling Time\n90 mins\nTotal\n115 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1 to 1 1/2\npounds\n(\n450-680\ng\n) package salted dried boneless\nred herring fillets\n(see notes)\n1/2\nmedium\nchayote\n(about\n4\nounces\n;\n113\ng\n), julienned\n1/2\nmedium\nyellow onion\n(\n4\nounces\n;\n113\ng\n), thinly sliced\n1\nmedium\ncarrot\n(\n4\nounces\n;\n113\ng\n), julienned\n1/2\ncup\n(\n120\nml\n) white cane vinegar, such as Grace brand, or distilled\nwhite vinegar\n1/4\ncup\n(\n15\nml\n)\nextra-virgin olive oil\n(optional; see notes)\n2\ntablespoons\n(\n30\nml\n) aged\nrum\n, such as Kingston 62 Gold or Appleton Signature (optional; see notes)\n2\ntablespoons\nchopped\ncilantro leaves\nand tender stems (optional; see notes)\n1\nScotch bonnet pepper\n, stemmed, seeded, and thinly sliced\nKosher or\nsea salt\n, as needed\nJamaican\nwater crackers\n(such as Excelsior) or cream crackers, for serving\nSliced\navocado\n, for serving (optional)\nDirections\nIn a large pot or heatproof bowl, cover herring fillets with boiling water and let stand 15 minutes. (This process helps remove some salt and makes fish tender enough to shred.) Taste a piece of herring to gauge saltiness; if fish is still too salty for your taste, drain water and replace with fresh cold water; then allow to soak for 15 to 30 minutes longer. Repeat with additional changes of cold water, if necessary, but bear in mind that some level of saltiness is required for the dish to have the proper flavor. (The finished dish should be on the salty side, meant to be eaten in small bites with a drink and crackers.) Drain fillets and rinse under cool running water.\nSerious Eats / Karina Matalon\nPat fillets dry, then, using your hands, shred meat by breaking fish into bite-sized bits, removing any prickly tiny bones as you go; note that you will likely not be able to remove all the bones, which is okay as the smallest ones are so fine that they don't really pose a threat.\nSerious Eats / Karina Matalon\nTransfer picked fish to a large bowl and mix with chayote, carrot, and onion. Add vinegar, olive oil (if using), rum (if using), cilantro (if using), and Scotch bonnet pepper and stir to combine. Season with salt only if necessary; the dish should be quite salty already given the amount of salted herring, so only add more salt if it falls short of its desirably salty flavor. Cover and refrigerate for at least 1 hour before serving.\nSerious Eats / Karina Matalon\nServe with hearty Jamaican water crackers or cream crackers and avocado, if desired.\nSerious Eats / Karina Matalon\nNotes\nSalted herring fillets (also sometimes called smoked herring fillets) are sold at Jamaican and Caribbean markets. Use more herring if you want a more intensely salty pickle, and less if you want a little more vegetable relative to the herring to cut some of the intensity.\nRum, olive oil, and cilantro are ingredients we like to add to our version for more flavor, though they aren't traditional. Feel free to leave them out for a more standard version.\nMake-Ahead and Storage\nPickled herring can be refrigerated for up to 2 weeks in an airtight container.\nJamaican\nThe Latest\nSnacks & Appetizers\nFish\nCaribbean",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/jamaican-pickled-herring.webp?"
}