{
  "url": "https://www.seriouseats.com/jamaican-sorrel-hibiscus-drink",
  "image_url": null,
  "tags": [
    "Non-Alcoholic Drinks",
    "Jamaican",
    "Juneteenth Recipes"
  ],
  "title": "Jamaican Sorrel (Hibiscus) Drink",
  "full_text": "Jamaican Sorrel (Hibiscus) Drink\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n25 mins\nInfusing Time\n8 hrs\nTotal\n8 hrs 35 mins\nServes\n12\nto 14 servings\nMakes\n3 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n5 1/4\nounces\n(\n150\ng\n; about\n3\ncups\n)\ndried\nsorrel (\nhibiscus\n), rinsed with cold water in a colander or strainer\n3/4\npound\n(\n350\ng\n) peel-on\nfresh ginger\n, washed and grated (see note)\n10\nwhole\ncloves\n10\nallspice\nberries\n, roughly crushed with the side of a knife\n1\npound\n1 1/2\nounces\n(\n495\ng\n; about\n2 1/2\ncups\n)\nsugar\nDirections\nIn a 4- or 5-quart pot or Dutch oven, bring 3 quarts water to a boil. Add sorrel, grated ginger, cloves, and crushed allspice, and boil until the sorrel begins to plump and swell, about 8 minutes.\nSerious Eats / Vicky Wasik\nRemove from heat and let stand until cooled, then continue to steep in an airtight vessel in the refrigerator for at least 8 hours and up to 3 days.\nStrain the liquid through a fine-mesh strainer or through cheesecloth into a large pitcher, pressing on solids to express as much liquid as possible. If needed, strain again until it is clear of any ginger remnants. Discard solids.\nSerious Eats / Vicky Wasik\nIn a 2-quart saucepan, bring 2 cups of water to a boil with the sugar. Continue to cook, stirring, until sugar has completely dissolved. Remove simple syrup from heat.\nSerious Eats / Vicky Wasik\nStir simple syrup into the strained sorrel, 1/2 cup at a time, until desired sweetness level is reached.\nSerious Eats / Vicky Wasik\nChill until ready to drink. Serve over ice.\nSerious Eats / Vicky Wasik\nNotes\nFor this quantity of ginger, it's best to use a box grater or even the grating disc on a food processor (the fibers will clog up a Microplane or other fine grater very quickly).\nMake-Ahead and Storage\nThe strained sorrel can be kept refrigerated for up to 5 days.\nRead More\nHibiscus's Bold Flavor Connects the Dots of the African Diaspora\nNon-Alcoholic Drinks\nJamaican\nJuneteenth Recipes"
}