{
  "url": "https://www.seriouseats.com/jamaican-rundown-recipe-8386886",
  "image_url": "https://www.seriouseats.com/thmb/0-xu4E2q6EcT-47SSuT7wsdTfzk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231201-SEA-Rundown-KarinaMatalon-13-24bd602710804804abf92f13a2c22956.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Seafood Mains",
    "Jamaican",
    "Fish"
  ],
  "title": "Jamaican Rundown",
  "full_text": "Jamaican Rundown\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nSoaking Time\n2 hrs\nTotal\n3 hrs\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Rundown:\n1\npound\n(\n454\ng\n) pickled boneless\nmackerel\n(see notes)\n1\ntablespoon\n(\n15\nml)\ncoconut oil\n1\nlarge\nyellow onion\n(\n12\nounces\n;\n340\ng\n), diced\n2\nplum tomatoes\n(about\n4\nounces\n;\n115\ng\neach), cored and diced\n2\nscallions\n, ends trimmed and cut into 1/4-inch lengths\n1\nmedium\nclove garlic\n, minced\n3\ncups\nfresh coconut milk\nor canned\ncoconut milk\nabout\n2\n(13.5 ounce) cans\n(see notes)\n1\nwhole\nScotch bonnet pepper\n4\nallspice berries\n1\nspring\nfresh thyme\n1\nboiled green banana\nFor the Boiled Green Banana:\n1\nbunch very\ngreen bananas\n(see notes)\nKosher salt\nUnsalted butter\n, softened\nDirections\nFor the Rundown:\nIn a large bowl, soak mackerel in hot water, changing the water once or twice during soaking, until saltiness has been reduced, 2 to 3 hours (the mackerel should still be noticeably salty, but not painfully so, as it is the only source of salt in the dish). Drain mackerel and carefully remove any remaining fish bones. Cut or tear mackerel into bite-sized pieces (about 1-inch). Set aside.\nSerious Eats / Karina Matalon\nIn a Dutch oven, melt coconut oil over medium-high heat. Add onion, tomatoes, scallions, and garlic, then stir in\nfresh\nor canned coconut milk. Add Scotch bonnet, allspice berries, and thyme. Bring to a simmer, then reduce heat to maintain simmer, adjusting heat as needed, and cook until coconut milk has reduced to a creamy, custardy texture, about 10 minutes. This is called rundown sauce.\nSerious Eats / Karina Matalon\nStir torn mackerel into rundown sauce and cook over medium heat until liquid is further reduced and fish, vegetables, and rundown sauce are combined in a thick and creamy stew, about 15 minutes.\nSerious Eats / Karina Matalon\nMeanwhile, for the Boiled Green Bananas (Optional):\nFill a large bowl with cold water. Using gloved hands, cut ends off green bananas. Then, using a paring knife and working with one banana at a time, make a lengthwise slit into the skin from top to bottom. Remove skin from banana, then, scrape away any stringy bits from the banana. Transfer to a large bowl of water and repeat with remaining bananas.\nSerious Eats / Karina Matalon\nIn a large pot of salted boiling water, boil bananas until fork-tender, about 20 minutes (cooking time will vary depending on the size of the bananas). Drain bananas, transfer to bowl, and season with salt and butter to taste. Use the back of a fork to mash boiled bananas, if desired.\nSerious Eats / Karina Matalon\nServe rundown warm, with the boiled green bananas. (see notes)\nSerious Eats / Karina Matalon\nSpecial Equipment\nDutch oven, large pot (for the optional boiled green bananas)\nNotes\nTwo 13.5 ounce cans of coconut milk may be substituted for the fresh coconut milk.\nPickled mackerel, also often sold as \"salt mackerel,\" is often sold at Jamaican and West Indian markets. When buying pickled mackerel, make sure that the fish is firm to the touch. While any size mackerel can be used, it is easier to remove bones from larger mackerel.\nGreen bananas are not the same as green plantains; you can often find green bananas at Caribbean markets. These boiled bananas need to be truly green, not just under-ripe as is common for bananas in markets in North America. Make sure the wear gloves while peeling the bananas to avoid purple stained fingers.\nRundown is also greats served with fried yellow plantain, callaloo, and fried breakfast dumplings called Johnny cakes.\nBreakfast & Brunch\nThe Latest\nSeafood Mains\nJamaican\nFish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/jamaican-rundown.webp?"
}