{
  "url": "https://www.seriouseats.com/jamaican-oxtail-recipe-7505218",
  "image_url": "https://www.seriouseats.com/thmb/3d8lcwXW9RaT8PCZf4y264qqcws=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230531-SEA-Oxtail-KarinaMatalon-hero-24a6a91d87cd4cefa8dc43adf4b456af.jpg",
  "tags": [
    "Jamaican",
    "The Latest",
    "Braised & Stewed Beef",
    "Beef",
    "Caribbean"
  ],
  "title": "Jamaican Oxtail",
  "full_text": "Jamaican Oxtail\nClose\nJump to recipe\nPrep\n20 mins\nCook\n3 hrs 30 mins\nMarinating and Resting Time\n24 hrs 15 mins\nTotal\n28 hrs 5 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinated Oxtail:\n1/2\nmedium\nyellow onion\n, roughly chopped\n3\nscallions\n, root ends trimmed and cut into 2-inch segments\n4\nmedium\ncloves garlic\n1/2\nScotch bonnet pepper\n, stemmed, seeded, and chopped\n3\npounds\n(\n1.4\nkg\n)\noxtail\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\nfreshly\nground black pepper\n1\ntablespoon\npicked\nfresh thyme\nleaves\nFor the Oxtail Stew:\n2\ntablespoons\n(\n30\nml\n) vegetable oil or other neutral\noil\n, plus more as needed\n1/2\nmedium\nyellow onion\n(about\n4\nounces\n;\n113\ng\n), cut into large chunks\n1\nscallion\n, root end trimmed and roughly chopped\n4\nmedium\ncloves garlic\n, roughly chopped\n10\nsprigs\nfresh thyme\n1\nwhole\nScotch bonnet pepper\n, optional\n1\ntablespoon\n(\n15\nml\n) browning, such as Grace brand, or\nsoy sauce\n(see notes)\nFor the Spinners (Optional) and to Finish:\n1 1/2\ncups\nall-purpose flour\n(\n6 3/4\nounces\n;\n191\ng\n)\nKosher salt\n2\ncans\nbutter beans\nor broad beans, drained\n1\ntablespoon\nfreshly\nground black pepper\nCooked\nwhite rice\nor rice and peas, fried plantain, sliced avocado, and/or green salad, for serving\nDirections\nFor the Marinated Oxtail:\nIn a blender, combine onion, scallion, garlic, and Scotch bonnet with 1/2 cup (120ml) water and blend until thoroughly pureed. Rub oxtail all over with soy sauce, salt, pepper, and thyme. Transfer oxtail to a large bowl or large zipper-lock bag and pour blended aromatics on top. Mix well to coat, then cover bowl or seal bag, pushing out air as you go. Refrigerate for 24 hours.\nSerious Eats / Karina Matalon\nRemove oxtail from marinade and scrape off excess marinade. Reserve marinade for later use.\nSerious Eats / Karina Matalon\nFor the Stew:\nIn a Dutch oven, heat oil over medium-high heat until shimmering. Working in batches to avoid crowding the pot, add oxtail and cook until browned all over, about 5 minutes per side (oxtail will brown more quickly and deeply due to the marinade, but turn down heat if it threatens to burn). Transfer oxtail to a platter and repeat with remaining oxtail, adding more oil to the pot if necessary.\nSerious Eats / Karina Matalon\nAdd 1 cup (240ml) water to Dutch oven and bring to a simmer, scraping bottom of pot to remove any browned bits. Return oxtail and any juices to the pot.\nSerious Eats / Karina Matalon\nAdd onions, scallion, garlic, thyme, Scotch bonnet pepper, and browning or soy sauce to oxtail. Add just enough water to cover meat, bring to a simmer, then reduce heat, cover, and let simmer for 40 minutes.\nSerious Eats / Amanda Suarez\nAdd reserved oxtail marinade to pot and stir to combine. Continue to gently simmer, uncovered, adding a little water from time to time to ensure oxtail remains just barely covered, until oxtail is tender, about 2 hours.\nSerious Eats / Karina Matalon\nFor the Spinners (Optional) and to Finish:\nIf making spinners: In a small bowl, whisk together flour and a large pinch of salt. Add 1/2 cup (118ml) cold water and knead until a sticky dough ball forms. Cover and let rest 15 minutes. Tear off small pieces of dough and roll them into cigarette-sized strips. Stir into oxtail.\nSerious Eats / Karina Matalon\nStir in butter or broad beans and let simmer until stew is thickened, about 30 minutes. Remove thyme sprigs.\nSerious Eats / Karina Matalon\nAdd black pepper, season with salt, and serve with white rice or rice and peas, plantain, sliced avocado, and a nice fresh green salad.\nSerious Eats / Karina Matalon\nSpecial Equipment\nDutch oven\nNotes\nBrowning, the Jamaican kitchen pantry staple, is a sauce made of caramelized sugar and is used to lend color and scorchy-sweet-umami flavor to this recipe. You can use a bottled version of browning in this recipe, such as Grace brand. In a pinch, soy sauce may be substituted.\nIn Jamaica, the oxtails are small and the meat is not very thick on the bone. It can be quite tough, so many prefer to use a pressure cooker to prepare it. While our recipe does not require that, it is an option. If using a pressure cooker, reduce cooking time of oxtail by about 1 hour; seal the pressure cooker after adding marinade in Step 6 and bring to high pressure, then cook for 1 hour. Once pressure is released, oxtail should be tender and you can proceed with recipe as written.\nMake-Ahead and Storage\nThe finished oxtail can be frozen for up to 2 months. To freeze, separate meat from liquid, then seal in an airtight container and freeze separately; to reheat, bring liquid to a boil and add frozen meat as needed. Adjust sauce with more liquid if necessary.\nJamaican\nThe Latest\nBraised & Stewed Beef\nBeef\nCaribbean"
}