{
  "url": "https://www.seriouseats.com/jamaican-banana-fritters-recipe-7498871",
  "image_url": "https://www.seriouseats.com/thmb/DZSa0ISc88H1UgDXBRgm-1uVarA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230516-SEA-BananaFritters--KarinaMatalonhero-f2c71180ec264a30ba3a0f7b688f2668.jpg",
  "tags": [
    "Jamaican",
    "The Latest",
    "Snacks & Appetizers",
    "Breakfast & Brunch",
    "Banana"
  ],
  "title": "Jamaican Banana Fritters",
  "full_text": "Jamaican Banana Fritters\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nTotal\n30 mins\nServes\n10\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\nmashed overripe\nbananas\n(\n14\nounces\n;\n395\ng\n) from\n4\nmedium\nbananas\n1 1/2\nteaspoons\n(\n7\nml\n)\nvanilla extract\n1/8\nteaspoon\nground nutmeg\n1 1/2\ncups\nall-purpose flour\n(\n6 3/4\nounces\n;\n192\ng\n)\n3/4\ncup\n(\n175\nml\n)\nmilk\nor water, plus more as needed\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n, plus more as needed\n1 1/2\ntablespoons\n(\n20\ng\n)\ngranulated sugar\n1/2\nteaspoon\nground cinnamon\nKosher salt\n, to taste\nDirections\nIn a medium bowl, stir bananas, vanilla extract, and nutmeg to combine. Whisk in flour, followed by milk or water, until a thick and slightly lumpy batter begins to form. (Exactly how thick varies from cook to cook, but a general goal is a batter that’s thicker than pancake batter, spreadable, but not free-flowing.) If needed, add additional liquid, 1 tablespoon at a time, to achieve the desired texture.\nSerious Eats / Karina Matalon\nIn a large sauté or frying pan or nonstick skillet, heat oil over medium-high heat until shimmering. Working in batches to avoid crowding the pan, carefully add a 1-ounce spoonfuls (about 2 tablespoons) of banana batter to oil, making sure to release them close to oil to prevent splashing. Fry until golden on first side, 45 seconds to 1 minute. Flip and fry until golden on second side side, 45 seconds to 1 minute longer. Transfer to paper towels to drain, and repeat with remaining batter, adding oil as needed if pan is dry and adjusting heat to prevent over browning.\nSerious Eats / Karina Matalon\nIn a small bowl, stir sugar and cinnamon to combine. Transfer fritters to a serving dish and sprinkle cinnamon-sugar and salt to taste all over hot fritters. Serve hot or at room temperature as a side dish with a meal or as a quick and tasty snack.\nSerious Eats / Amanda Suarez\nIn a small bowl, stir together sugar and cinnamon. Transfer fritters to a serving dish and sprinkle cinnamon-sugar all over hot fritters. Serve hot or at room temperature as a side dish with a meal or as a quick and tasty snack.\nSerious Eats / Karina Matalon\nMake-Ahead and Storage\nThe banana fritters are best eaten immediately.\nJamaican\nThe Latest\nSnacks & Appetizers\nBreakfast & Brunch\nBanana",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/jamaican-banana-fritters.webp?"
}