{
  "url": "https://www.seriouseats.com/japanese-style-broiled-eggplant-with-bonito-scallions-and-ginger",
  "image_url": "https://www.seriouseats.com/thmb/f2MrRTXe7Bn9rVDeY_EytTyANpQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__07__20180620-japanese-breakfast-vicky-wasik-22-e58deab18b0d47a79c562fd15153d2ab.jpg",
  "tags": [
    "Eggplant",
    "Japanese",
    "Dairy-free Sides",
    "Braised & Stewed Vegetables",
    "Quick Sides"
  ],
  "title": "Japanese-Style Broiled Eggplant With Bonito, Scallions, and Ginger Recipe",
  "full_text": "Japanese-Style Broiled Eggplant With Bonito, Scallions, and Ginger Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n10 mins\nTotal\n15 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole\nJapanese eggplants\nor other slender eggplants (about\n10\nounces\ntotal); see note\n2\nmedium\nscallions\n, white and light-green parts only, thinly sliced\nSmall handful (about\n5\ng\n) katsuobushi (\nJapanese dried bonito flakes\n), preferably the larger, feathery flakes called\nhanakatsuobushi\n; see note\nOne\n1/2-inch knob\nginger\n, peeled and grated\n1\ntablespoon\nsoy sauce\n, for serving\nDirections\nTo Prepare the Eggplant:\nPlace oven rack in top position and preheat broiler. With the tip of a sharp knife, score the eggplants around their circumference at both the stem end and the globe end. Score the eggplants along their length 3 times. If you're using an eggplant that is slightly thicker than an inch (see note), score it 4 times along its length.\nPlace eggplants on a wire rack set in a sheet pan. Broil until eggplant skin darkens and begins to char a bit, about 3 to 4 minutes.\nRotate eggplants and cook the other side until skin has darkened and charred a bit all around and the flesh is giving but not mushy when you push on it with your finger, about 3 to 4 minutes longer.\nRemove eggplants from oven and set aside until still warm but cool enough to handle (see note).\nPeel eggplants, leaving stems attached, and cut each crosswise into 1/2-inch sections. Arrange on serving plates in a way that preserves the eggplants' natural shape, with the stem end at one end of the plate. Top with thinly sliced scallions and katsuobushi and place a small mound of grated ginger alongside. Serve with soy sauce on the side for each diner to pour over the eggplant, to taste.\nNotes\nJapanese eggplants are typically more slender than other varieties, usually no more than an inch in width. As a result, they're well suited for quick cooking. If you can't find Japanese eggplants, look for other thin varieties of eggplant, such as Chinese eggplant; the cooking time will vary depending on the thickness of the variety you're using. Just be sure to cook the eggplant until it's giving but not totally collapsing—you want a little structural integrity, so that each chunk is easy to pick up with a pair of chopsticks.\nServing the eggplant hot is preferable, but it can be served at room temperature, too. While it's easier to peel the eggplant when it's hot, you can also peel it while just warm, and save yourself some burnt fingertips.\nYou can purchase\nkatsuobushi\nat Japanese specialty stores, at some Asian supermarkets, and online. While it is atypical, I suggest using\nhanakatsuobushi\n, the larger, feathery flakes of katsuobushi, although any type will do.\nSpecial Equipment\nQuarter-sheet tray, wire rack for quarter-sheet tray\nThis dish can easily be made on a grill instead of under the broiler.\nThis Recipe Appears In\nHow to Make a Japanese Breakfast\nEggplant\nJapanese\nDairy-free Sides\nBraised & Stewed Vegetables\nQuick Sides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/japanese-style-broiled-eggplant-with-bonito-scallions-and-ginger-recipe.webp?"
}