{
  "url": "https://www.seriouseats.com/japanese-fruit-sandwich-recipe-8603819",
  "image_url": null,
  "tags": [
    "Fruit",
    "The Latest",
    "Japanese",
    "Sandwiches"
  ],
  "title": "Japanese Fruit Sando (Fruit Sandwich)",
  "full_text": "Japanese Fruit Sando (Fruit Sandwich)\nJump to recipe\nPrep\n15 mins\nChilling Time\n60 mins\nTotal\n75 mins\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\nmascarpone\n(about 4 ounces; 120g)\n1 cup (\n240\nml)\nheavy cream\n2 tablespoons (\n14\ng\n)\npowdered sugar\n1/4\nteaspoon\nvanilla extract\nPinch\nkosher salt\n4 slices\nshokupan\n,\nhomemade\nor store-bought (see notes)\n8 to 10\nmedium\nstrawberries\n(1 to 2 inches wide), hulled, or assorted pieces of cut fruit (see above)\nDirections\nIn the bowl of a stand mixer fitted with the whisk attachment, whisk mascarpone on medium speed until smooth, about 1 minute. Add heavy cream, powdered sugar, vanilla extract, salt, and whip on medium speed until stiff peaks form, 3 to 4 minutes. Do not over whip; over whipped cream will be grainy. (To fix over whipped cream, see notes.)\nSerious Eats / Debbie Wee\nPlace slices of shokupan on a clean cutting board and, using an offset spatula, spread 3 tablespoons of whipped cream mixture onto each slice of bread. To build one sandwich, place 4 to 5 strawberries on their sides onto 1 slice of bread, arranging them in a “X” pattern that runs corner to corner. (See notes for assembling with other fruit.) Cover with a second slice of bread, cream-side down, press very gently to adhere, and being careful not to squish the whipped cream filling out the sides, wrap tightly with plastic wrap. Using a Sharpie, mark where you plan to cut the sandwich in order to reveal the cut sides of the fruit. Repeat with remaining bread and strawberries.\nSerious Eats / Debbie Wee\nRefrigerate until cream has chilled and sandwich is firm when pressed gently, about 1 hour.\nSerious Eats / Debbie Wee\nWhen ready to serve, remove plastic wrap and place sandwiches on cutting board. Using a serrated knife and using a steady back and forth sawing motion, carefully remove crusts and cut sandwiches in half diagonally, slicing strawberries in half. Serve immediately.\nSerious Eats / Debbie Wee\nSpecial Equipment\nStand mixer, offset spatula, plastic wrap, serrated knife\nNotes\nAvoid using strawberries larger than 2 inches tall, as they will be more difficult to sandwich.\nTo fix over whipped cream, drizzle 2 to 3 tablespoons heavy cream to mixing bowl and whisk on low speed until just incorporated.\nIf you can’t find shokupan, pain de mie or a fluffy white sandwich bread can be substituted.\nMake-Ahead and Storage\nIt may be tempting to keep a stash of fruit sandos in your fridge for convenient snacking, but I don’t recommend refrigerating the sandwiches for longer than an hour. As Daniel wrote\nhere\n, refrigeration is terrible for bread because it recrystallizes starches, causing bread to harden and stale.\nFruit\nThe Latest\nJapanese\nSandwiches"
}