{
  "url": "https://www.seriouseats.com/japanese-miso-eggplant-burger-recipe",
  "image_url": "https://www.seriouseats.com/thmb/tj1bYcEjn30eAcwXAxTVMA_gP-o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__20140730-burger-toppings-week-japanese-miso-eggplant-burger-vicky-wasik-1-b33dab80da4a48a3832f1aa23777d108.jpg",
  "tags": [
    "Japanese",
    "American",
    "Grilled Beef",
    "Ground Beef",
    "Cucumbers"
  ],
  "title": "Japanese Miso-Glazed Eggplant Burgers With Fresh Pickles Recipe",
  "full_text": "Japanese Miso-Glazed Eggplant Burgers With Fresh Pickles Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n35 mins\nResting Time\n10 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nmirin\n(see note)\n2\ntablespoons\nsake\n1/4\ncup\nmild red or\nwhite miso\n6\ntablespoons\nsugar\n, divided\n1\nlarge\nglobe eggplant\n, cut crosswise into 4 (1/2 inch thick) rounds (see note)\nVegetable oil\n, for brushing\n1/2\ncup\nrice vinegar\n1/2\ncup\nwater\n1/2\ntablespoon\nkosher salt\n, plus more for seasoning\n2\ncups\nthinly sliced\nJapanese or\nEnglish cucumbers\n(about 2 Japanese or 1/2 English)\n1 1/2\npounds\nfreshly ground beef chuck\n, preferably about 80 percent lean, formed into 4 (4 1/2 inch wide) patties\nFreshly ground black pepper\nMayonnaise,\npreferably\nKewpie\n, for serving\nSriracha\n, for serving\n4\nEnglish muffins\n, split and toasted\nDirections\nPreheat oven to 350°F. In a medium bowl, whisk together mirin, sake, miso, and 2 tablespoons sugar until well combined. Set aside.\nLine a rimmed baking sheet with parchment paper. Brush eggplant slices with vegetable oil and set on prepared baking sheet. Bake eggplant, turning once, until very tender, about 25 minutes.\nMeanwhile, combine vinegar, water, remaining 4 tablespoons sugar, and 1/2 tablespoon salt in a small saucepan and bring to a boil over high heat. Remove from heat. Add cucumber slices and stir. Cover with a clean kitchen towel or a double layer of heavy duty paper towels, pressing down until towel is saturated with liquid and in direct contact with the cucumbers. Let rest 10 minutes, then transfer cucumbers to a sealable container. Top up with liquid and discard the rest. Store in the refrigerator for up to 1 month.\nSeason patties generously with salt and pepper. Cook to desired doneness on a hot grill or in a skillet on the stovetop, 125°F for medium rare or 135°F for medium. Transfer to a plate and allow to rest for 5 minutes.\nTurn on broiler. Brush top sides of eggplant slices with miso glaze and broil until browned on top, about 2 minutes. Spread mayonnaise and sriracha on English muffin top halves. Set burger patties on English muffin bottom halves, and top each with an eggplant slice. Top with pickled cucumbers, saving the rest for another use, close burgers and serve immediately.\nNotes\nMirin is a sweet rice-based wine. It can be found in any Japanese or Asian grocery story. If unavailable, you can make a substitute by heating 1 cup of sake with 1 cup of sugar until dissolved. While you only need 4 slices of eggplant for these burgers, you can (and should) cook even more slices of the eggplant, using the extra glaze, because they're delicious.\nThis Recipe Appears In\nBurger Toppings Week: Japanese Miso-Eggplant Burger With Fresh Pickles\nJapanese\nAmerican\nGrilled Beef\nGround Beef\nCucumbers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/japanese-miso-glazed-eggplant-burgers-with-fresh-pickles-recipe.webp?"
}