{
  "url": "https://www.seriouseats.com/japanese-cotton-soft-cheesecake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ovQCm9itiTHOBGLDHih75BZnP3w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__08__20150804-kenji-lopez-alt-japanese-cotton-soft-cheesecake-step-by-step16-a7802a58f8444c80bf60046732a41795.jpg",
  "tags": [
    "Cakes",
    "Japanese",
    "Cheesecakes",
    "Easter Desserts",
    "Mother's Day"
  ],
  "title": "Japanese Cotton-Soft Cheesecake Recipe",
  "full_text": "Japanese Cotton-Soft Cheesecake Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n40 mins\nChilling Time\n4 hrs\nTotal\n5 hrs\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(8-ounce) package\ncream cheese\n, softened\n4\ntablespoons\n(\n2\nounces\n)\nunsalted butter\n, softened\n1/2\ncup\n(\n3 1/2\nounces\n)\ngranulated sugar\n, divided\nPinch\nof\nkosher salt\n5\nlarge\neggs\n, separated\n1\npacked teaspoon\nzest\nand\n2\ntablespoons\nfresh juice\nfrom\n1\nlemon\n1/2\ncup\nsour cream\n, at room temperature\n1/3\ncup\n(\n1 1/3\nounces\n)\ncake flour\n2\ntablespoons\n(\n1/2\nounce\n)\ncornstarch\n1/4\nteaspoon\ncream of tartar\nDirections\nAdjust oven rack to lower-middle position and preheat to 340°F (170°C). Grease the bottom and sides of an 8- by 3-inch springform pan and wrap the bottom half of the pan with foil to create a waterproof seal (see note). Set into a roasting pan.\nSerious Eats / J. Kenji López-Alt\nIn a stand mixer fitted with a paddle attachment, beat cream cheese, butter, 2 tablespoons sugar, and salt on medium speed until very creamy, scraping down sides as necessary with a rubber spatula (about 2 minutes). Beat in egg yolks and lemon zest until smooth, about 30 seconds. Replace paddle attachment with whisk attachment. Whisk in the lemon juice and sour cream on medium speed, scraping down sides as necessary with a rubber spatula, until combined.\nSerious Eats / J. Kenji López-Alt\nSift the flour and cornstarch over the batter and whisk until completely combined. Transfer mixture to a large bowl, using a rubber spatula. Thoroughly wash and dry stand mixer bowl and whisk (a dirty bowl will prevent whites from aerating properly)\nSerious Eats / J. Kenji López-Alt\nUsing the mixer's whisk attachment, beat egg whites and cream of tartar on high speed until frothy. Slowly pour in the remaining sugar and continue to whip to medium-peak stage (see note). Don't over-whip.\nSerious Eats / J. Kenji López-Alt\nFold a third of the meringue into the batter with a rubber spatula until almost combined. Gently fold in the remaining meringue in two more batches.\nSerious Eats / J. Kenji López-Alt\nPour the batter into the springform pan and set on the oven rack. Pour about 2 inches hot water into the roasting pan (see note). Bake until the cake is golden and just firm in the center, 40 to 45 minutes.\nSerious Eats / J. Kenji López-Alt\nRemove roasting pan from oven and let springform pan remain in water bath for 30 minutes. Set on wire rack to cool for another 30 minutes, then chill until set, about 3 hours. Serve.\nSpecial Equipment\n8- by 3-inch round\nspringform pan\n,\nroasting pan\n,\nmixer\n,\nwire rack\nNotes\nI used a tall-sided springform pan; if you don't have a pan with sides at least 3 inches tall, you can use a 9-inch pan (which means the cheesecake will be much flatter), or line the sides of the pan with a parchment collar to keep the batter from overflowing the pan. There is flour in this cake. Beaten whites are medium-peak when the peak gently and partially flops over after the whisk is lifted from them. When pouring water into the pan, keep it below the foil, or the water will seep through and make the bottom of the cake soggy.\nThis Recipe Appears In\nMeringue Is the Secret to Lighter-Than-Air Japanese Cheesecake\nCakes\nJapanese\nCheesecakes\nEaster Desserts\nMother's Day"
}