{
  "url": "https://www.seriouseats.com/japanese-cheesecake-recipe-11738806",
  "image_url": "https://www.seriouseats.com/thmb/A1DsobdaekQghohySdO8uQyguCM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250520-SEA-JapanesseCheesecake-AmandaSuarez-02-6f6ec4463b4c43558660f5e1e7c371ee.jpg",
  "tags": [
    "Cheesecakes",
    "The Latest",
    "Recipes",
    "Cakes",
    "Desserts"
  ],
  "title": "How to Make the Silkiest, Airiest Japanese Cheesecake Ever",
  "full_text": "How to Make the Silkiest, Airiest Japanese Cheesecake Ever\nClose\nJump to recipe\nPrep\n20 mins\nCook\n75 mins\nCooling Time:\n2 hrs\nTotal\n3 hrs 35 mins\nServes\n8\nto 10\nMakes\n1 9-inch cheesecake\nCook Mode\n(Keep screen awake)\nIngredients\n56\ng\nunsalted butter\n(\n2\nounces\n;\n4\ntablespoons\n), cut into 1-inch cubes, plus more for greasing\n43\ng\nall-purpose flour\n(\n1 1/2\nounces\n;\n1/3\ncup\n), plus more for dusting\n1\n(8-ounce) package\ncream cheese\n, cut into 1-inch cubes\n1/2\ncup\n(\n120\nml\n)\nheavy cream\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n6\nlarge\neggs\n, yolks and whites separated\n15\ng\ncornstarch\n(\n1/2\nounce\n;\n2\ntablespoons\n)\n1/4\nteaspoon\ncream of tartar\n1\ntablespoon\n(\n15\nml\n)\nlemon juice\nfrom\n1\nmedium\nlemon\n80\ng\ngranulated sugar\n(about\n2 3/4\nounces\n;\n1/\n2\ncup\nplus\n2\ntablespoons\n)\nConfectioners’ sugar\n, for dusting (optional)\nDirections\nAdjust oven rack to lower-middle position and preheat to 350ºF (175ºC). Grease an 9- by 3-inch round springform pan with unsalted butter, then dust with flour, shaking out excess. Using aluminum foil, wrap bottom half of the pan to create a waterproof seal. Set in a roasting pan.\nSerious Eats / Amanda Suarez\nIn a large heatproof mixing bowl, combine cream cheese, butter, heavy cream, and salt. Set mixing bowl over a saucepan of simmering water. (Make sure bottom of bowl does not touch the water.) Cook, whisking frequently, until mixture is smooth and creamy and butter has melted, 3 to 5 minutes. Remove from heat. Add egg yolks and whisk until well combined and no streaks remain, about 1 minute. Using a fine-mesh sieve, sift in flour and cornstarch, and whisk until smooth; set aside.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment or using a hand mixer and a large bowl, begin whipping egg whites at low speed until whites look wet and frothy, about 1 minute. With the mixer running, add cream of tartar and lemon juice and mix until cream of tartar is dissolved, about 10 seconds.\nSerious Eats / Amanda Suarez\nKeeping the mixer at low speed, slowly add about a quarter of the sugar in a steady stream. Increase speed to medium and slowly add remaining sugar. Continue mixing at medium speed until meringue is thick and glossy and holds firm peaks when you lift the whisk, about 10 minutes.\nSerious Eats / Amanda Suarez\nUsing a flexible spatula, scrape 1/3 of the meringue into the cream cheese mixture, and gently fold until smooth. Add the remaining meringue, and continue folding cake batter until just combined and no streaks remain. Do not overmix.\nSerious Eats / Amanda Suarez\nScrape batter into prepared springform pan and set roasting pan on oven rack. Pour about 2 inches hot water into the roasting pan, and bake until cheesecake top begins to turn light golden brown, about 15 minutes. Reduce oven temperature to 300ºF, and continue baking until cake is firm but still jiggly, another 45 minutes to 1 hour. Turn oven off and leave door slightly ajar; let cake cool in oven for 30 minutes. Remove cake from oven. Carefully slide an offset spatula around the edges of the cake pan, then remove sides of the pan. Let cake cool completely on a wire rack, about 90 minutes. Cake can be served immediately or refrigerated until chilled. For a creamier, denser cheesecake, serve chilled; for a lighter, fluffier cheesecake, serve at room temperature. Dust cake with confectioners’ sugar just before serving, if desired.\nSerious Eats / Amanda Suarez\nSerious Eats / Amanda Suarez\nSpecial Equipment\n8- by 3-inch round springform pan, aluminum foil, roasting pan, large heatproof mixing bowl, stand mixer, flexible spatula, wire rack\nMake-Ahead and Storage\nThe cake can be made up to 3 days in advance, loosely wrapped in plastic and refrigerated. Dust with confectioners' sugar just before serving, if desired. Leftover can be stored in a tightly sealed container in the refrigerator for up to 3 days.\nCheesecakes\nThe Latest\nRecipes\nCakes\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-make-the-silkiest-airiest-japanese-cheesecake-ever.webp?"
}