{
  "url": "https://www.seriouseats.com/japanese-yakitori-negima-grilled-chicken-skewer-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ZJbhj96NdEKnLj8TatxPZzm89BI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__06__20160606-yakitori-negima-13-61803f895fdc4c138f56e09dbc24648f.jpg",
  "tags": [
    "Grilled Chicken",
    "Japanese",
    "Chicken Thighs",
    "Scallions",
    "Chicken Mains"
  ],
  "title": "Negima Yakitori (Japanese Chicken Skewers With Scallion) Recipe",
  "full_text": "Negima Yakitori (Japanese Chicken Skewers With Scallion) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n60 mins\nResting Time\n5 mins\nTotal\n30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n1\nkg\n)\nboneless, skinless chicken thighs\n, cut into 1-inch dice\nKosher salt\nand freshly ground white or black pepper\n1\nbunch\nscallions\n, cut into 1-inch pieces\n1/2\ncup\n(\n120\nml\n)\nteriyaki sauce\n(see notes)\nDirections\nIn a large bowl, toss chicken pieces with 2 teaspoons kosher salt and a few grinds of pepper. Thread 2 to 3 pieces of chicken onto a skewer (enough to add up to around 1/2 to 3/4 inch when pressed tightly together), then thread a segment of scallion onto skewer. Continue alternating every few pieces of chicken with scallion until chicken and scallions are used up, using as many skewers as necessary. Make sure all the meat and scallions are tightly packed.\nLight 2/3 chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate.\nPlace chicken skewers directly over the hot portion of the grill, cover, and cook, turning frequently, until chicken is well browned, scallions are tender, and a piece of chicken looks cooked when removed and cut in half with a knife, about 10 minutes. Season with additional salt and pepper 2 to 3 times during the cooking process.\nBrush chicken and scallions with teriyaki glaze and cook for 30 seconds. Turn, brush second side with teriyaki, and cook for 30 seconds longer. Remove chicken from grill and allow to rest for 1 to 2 minutes. Brush with additional glaze and serve immediately.\nSpecial Equipment\nGrill\n,\nskewers\nNotes\nI strongly suggest making your own teriyaki sauce instead of using store-bought; it will taste much better. For an even more flavorful sauce, try adding a few smashed garlic cloves, slices of ginger, and roughly chopped scallions to the saucepan as the sauce reduces.\nRead More\nGrilled Skewered Shishito Peppers With Teriyaki Glaze\nGrilled King Oyster Mushrooms With Bacon and Teriyaki Glaze\nBasic Teriyaki Sauce\nGrilled Chicken\nJapanese\nChicken Thighs\nScallions\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/negima-yakitori-japanese-chicken-skewers-with-scallion-recipe.webp?"
}