{
  "url": "https://www.seriouseats.com/jeni-britton-bauers-jasmine-green-tea-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PxSN4DO3yy-vDcFlT_Soez1YF3M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120725-jenis-green-tea-ice-cream-f3d811a723524530bcd387021f49a289.jpg",
  "tags": [
    "Ice Cream",
    "Heavy Cream"
  ],
  "title": "Jeni Britton Bauer's Jasmine Green Tea Ice Cream Recipe",
  "full_text": "Jeni Britton Bauer's Jasmine Green Tea Ice Cream Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n20 mins\nChurning/Freezing Time\n5 hrs\nTotal\n5 hrs 50 mins\nServes\n6\nto 8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nwhole milk\n1\ntablespoon\nplus\n1\nteaspoon\ncornstarch\n1 1/2\nounces\n(\n3\ntablespoons\n)\ncream cheese\n, softened\n1 1/4\ncups\nheavy cream\n2/3\ncup\nsugar\n2\ntablespoons\nlight corn syrup\n1/4\ncup\njasmine green tea leaves\n2\ncups\nSugar-Plumped Cherries\n(recipe below)\nFor Sugar-Plumped Cherries:\n2\ncups\ndried cherries\n1\ncup\nplus\n2\ntablespoons\nwater\n1\ncup\nsugar\nDirections\nMake Cherries\n: Put the cherries in a heatproof bowl. Combine the water and sugar in a small saucepan and bring to a boil, stirring to dissolve the sugar. Pour the syrup over the cherries and let cool to room temperature. Refrigerate until chilled (the cherries will keep for up to a month in the refrigerator).\nPrep\n: Mix about 2 tablespoons of the milk with the cornstarch in a small bowl to make a smooth slurry. Whisk the cream cheese in a medium bowl until smooth. Fill a large bowl with ice and water.\nCook\n: Combine the remaining milk, the cream, sugar, and corn syrup in a 4-quart saucepan, bring to a rolling boil over medium-high heat, and boil for 4 minutes. Remove from the heat, add the tea, and let steep for 10 minutes.\nStrain the milk mixture through a fine sieve, pressing on the tea leaves to extract as much cream as possible. Return to the saucepan and gradually whisk in the cornstarch slurry. Bring back to a boil over medium-high heat and cook, stirring with a heatproof spatula, until slightly thickened, about 1 minute. Remove from the heat.\nChill\n: Gradually whisk the hot milk mixture into the cream cheese until smooth. Pour the mixture into a 1-gallon Ziploc freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.\nFreeze:\nPour the ice cream base into the frozen canister and spin until thick and creamy. Drain the cherries well. Pack the ice cream into a storage container, layering it with the cherries as you go. Press a sheet of parchment directly against the surface and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours.\nIce Cream\nHeavy Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/jeni-britton-bauers-jasmine-green-tea-ice-cream-recipe.webp?"
}