{
  "url": "https://www.seriouseats.com/jeni-britton-bauers-tuscan-sundae-recipe",
  "image_url": "https://www.seriouseats.com/thmb/qIBHRpYEV1DyKpjBpYivGg7LHV0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120727-jenis-Tuscan20Sundae-e53ce30794d14f478d4fca1dcfe0472e.jpg",
  "tags": [
    "Ice Cream",
    "Summer Desserts"
  ],
  "title": "Jeni Britton Bauer's Tuscan Sundae Recipe",
  "full_text": "Jeni Britton Bauer's Tuscan Sundae Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n110 mins\nChurning/Freezing Time\n5 hrs 10 mins\nTotal\n7 hrs 20 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sundaes:\n1 1/2\ncups\nhoney\n1 1/2\ncups\nVin Santo\nor\nIl Santo\n1\nwhole\nstar anise\n(optional)\nSalty caramel ice cream (see below)\n6\nbiscotti\n(see below)\n6\nbrandied cherries\n(see below)\nSalty Caramel Ice Cream:\n2\ncups\nwhole milk\n1\ntablespoon\nplus\n1\nteaspoon\ncornstarch\n1 1/2\nounces\n(\n3\ntablespoons\n)\ncream cheese\n, softened\n1/2\nteaspoon\nfine sea salt\n1 1/4\ncups\nheavy cream\n2\ntablespoons\nlight corn syrup\n2/3\ncup\nsugar\n2\nteaspoons\nvanilla extract\nThe Cake/Biscotti:\n3\ntablespoons\nunsalted butter\n1 1/2\nteaspoons\nvanilla extract\n2\nlarge eggs\n2\nlarge egg yolks\n1/4\ncup\ngranulated sugar\n1/4\ncup packed\nlight brown sugar\n1/4\nteaspoon\nsea salt\n3/4\ncup\nsifted\ncake flour\nBrandied Cherries:\n1\npound\nfresh black cherries\n, pitted, or\nfrozen black cherries\n1/4\ncup\nsugar\n1/4\ncup\nbrandy\nDirections\nMake Ice Cream\n: Mix about 2 tablespoons of the milk with the cornstarch in a small bowl to make a smooth slurry. Whisk the cream cheese and salt in a medium bowl until smooth. Mix the cream with the corn syrup in a measuring cup with a spout. Fill a large bowl with ice and water.\nHeat the sugar in a 4-quart saucepan over medium heat until it is melted and golden amber in color (see note). Remove from the heat and, stirring constantly, slowly add a bit of the cream and corn syrup mixture to the caramel: It will fizzle, pop, and spurt. Stir until well combined, then add a little more and stir. Keep adding the cream a little at a time until all of it is incorporated.\nReturn the pan to medium-high heat and add the milk. Bring to a rolling boil and boil for 4 minutes. Remove from the heat and gradually whisk in the cornstarch slurry. Bring back to a boil over medium-high and cook, stirring with a heatproof spatula, until slightly thickened, about 1 minute. Remove from the heat. If any caramel flecks remain, pour the mixture through a sieve.\nGradually whisk the hot milk mixture into the cream cheese until smooth. Pour the mixture into a 1-gallon zipper-lock freezer bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.\nPour into frozen canister and spin until thick and creamy. Pack the ice cream into a storage container, press a sheet of parchment directly against the surface, and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours.\nMake the Cake/Biscotti:\nPreheat the oven to 350°F (175°C). Butter the bottom of a 9-inch square baking pan (not the sides) or line it with parchment paper. Melt the butter in a saucepan or the microwave. Add the vanilla; set aside.\nCombine the eggs, egg yolks, both sugars, and salt in the bowl of a stand mixer fitted with the whisk attachment. Whip for 8 to 10 minutes, until very thick, light lemon in color, and tripled in volume. Fold in the flour. Fold in the melted butter mixture.\nPour into the baking pan and bake for about 20 minutes, until the cake is golden brown and pulling away from the sides of the pan. Let cool for 10 minutes on a rack, then unmold and let cool completely.\nTo make biscotti: Make the cake adding 1/2 cup almonds or other nuts or 1/2 teaspoon ground cardamom or other spice to the batter, if desired. Let the cake cool completely, then refrigerate it so that it is really firm. Preheat the oven to 325°F (165°C). Lay the cake on a cutting board and, using a serrated knife, slice it in half, then slice each half crosswise into 4 slices. Lay the slices on a baking sheet and toast in the oven for about 25 minutes, flipping them halfway through, until golden brown.\nFor the biscotti cubes for ice creams, cut each slice lengthwise in half and then cut into cubes. Toast on a baking sheet in a 325°F oven, turning the cubes as necessary, for about 12 minutes, or until golden.\nMake Cherries\n: Combine the cherries, sugar, and brandy in a medium saucepan and bring to a boil, stirring to dissolve the sugar. Boil for 5 minutes, then remove from the heat and let cool. Refrigerate, overnight if possible, before serving.\nMake Sundaes\n: Combine the honey, Vin Santo, and star anise, if using, in a small saucepan and heat over low heat until warm. Remove from the heat and discard the star anise, if you used it.\nPlace 2 small scoops of ice cream on each plate or in each bowl. Top each with 1/3 cup warm sauce and garnish with a biscotti, whipped cream, and a cherry.\nNotes\nDanger!\nThe ice cream uses a dry-burn technique. I don't add water to the sugar before putting it on the heat, as some chefs do. Caramelizing sugar dry means it goes faster, but you have to watch it more closely and be ready with your cream. Here is an overview of what you are going to do:\nStand over the pan of sugar with a heatproof spatula ready, but do not touch the sugar until there is a full layer of melted and browning liquid sugar on the bottom with a smaller layer of unmelted white sugar on the top. When the edges of the melted sugar begin to darken, use the spatula to bring them into the center to help melt the unmelted sugar. Continue stirring and pushing the sugar around until it is all melted and evenly amber in color--like an old penny. When little bubbles begin to explode with dark smoke, give the sugar another moment and then remove from the heat. Immediately but slowly pour about 1/4 cup of the cream and corn syrup mixture into the burning-hot sugar. Be careful! It will pop and spit! Stir until it is incorporated, then add a bit more cream and stir, then continue until it is all in.\nIce Cream\nSummer Desserts"
}