{
  "url": "https://www.seriouseats.com/jerk-pork-recipe-8414749",
  "image_url": "https://www.seriouseats.com/thmb/aXfI4kUXUEPajeBpk6Wcnd7rP-w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-JerkPork-LorenaMasso24-69d01ed5f7e44697bc920d4b58c70ed9.jpg",
  "tags": [
    "Smoked Pork",
    "The Latest",
    "Pork Shoulder",
    "Jamaican",
    "Jamaican Cuisine"
  ],
  "title": "Jamaican Jerk Pork",
  "full_text": "Jamaican Jerk Pork\nClose\nJump to recipe\nCook\n4 hrs\nMarinating Time\n12 hrs\nTotal\n16 hrs\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Jerk Marinade:\n1\ncup\nwater\n8 to 12\nounces\nScotch bonnet peppers\n(\n227-340\ng\n), stemmed (see notes)\n6\nounces\n(\n170\ng\n)\nscallions\n(about\n3\nbunches\n), ends trimmed and roughly chopped\n4\nounces\nfresh ginger\n(\n113\ng\n), peeled and roughly chopped\n1/2\nmedium\nyellow onion\n(\n4\nounces\n;\n113\ng\n), roughly chopped\n1\nwhole head\ngarlic\n(about\n1 1/2\nounces\n;\n45\ng\n), cloves peeled\n1/4\ncup\nDiamond Crystal kosher salt\n(\n1 1/4\nounces\n;\n36\ng\n); for table salt, use half as much by volume or the same weight\n1\nounce\n(\n28\ng\n)\nfresh thyme sprigs\n(about\n1/4\ncup\n), thicker woody stems removed\n2\ntablespoons\nwhole allspice berries\n2\ntablespoons\n(\n30\nml\n)\nbrowning,\nsuch as Grace brand (optional)\nFor the Jerk Pork:\n1\n(6 to 8 pound; 2.7 kg to 3.6 kg)\nskin-on bone-in pork butt (bone-in shoulder roast)\nKosher salt\nand\nfreshly ground black pepper\n2\ncups\n(\n473\nml\n)\njerk marinade\n(from above)\n1\nbunch\n(about\n2\nloosely packed cups\n)\nfresh allspice leaves\n(or\nfresh bay\nor\nbanana leaves\n), soaked in water for 10 minutes, drained, then bruised with a back of a knife (see notes)\n4\nPimento wood chunks\n,\nbriquettes\n, or\n2\ncups\nwood chips\n, soaked in water for 10 minutes then drained (see notes)\nFor Serving:\n16\nfestivals\nPickled Scotch bonnet peppers\nKetchup\nDirections\nFor the Jerk Marinade:\nIn a blender, combine water, Scotch bonnet peppers, scallions, ginger, onion, garlic, salt, thyme springs, allspice berries and browning, if using. Blend into a smooth puree, (in batches if needed), about 1 minute. (see notes)\nSerious Eats / Lorena Masso\nIn a medium saucepan, bring jerk marinade to a boil over high heat, then reduce heat and simmer until reduced to a paste-like consistency and measures about 3 1/2 cups, about 20 minutes.\nSerious Eats / Lorena Masso\nRemove from heat and let cool, about 1 hour at room temperature, then refrigerate in an airtight container until ready to use.\nSerious Eats / Lorena Masso\nFor the Jerk Pork:\nUsing a sharp paring knife, Cut through one side of the pork shoulder to the bone, following the length of the bone. Cut around the bone and keep cutting to within an inch of the other side of the shoulder. Open the pork shoulder flat like a book. Cut under the bone and remove it to finish butterflying the roast open. The roast should now be splayed flat and measure about 3-inches thick.\nSerious Eats / Lorena Masso\nWith the pork shoulder butterflied open skin-side up on the cutting board, use a sharp knife to score the skin 1/2 -inch deep and 1- inch apart to create evenly spaced parallel cuts. Flip pork over and repeat on the flesh side.\nSerious Eats / Lorena Masso\nSeason pork lightly all over with salt and pepper. Transfer pork to a large baking dish (9 by 13-inch) or a half-hotel pan. Using gloved hands, rub 2 cups of the jerk marinade all over pork, making sure to get some inside cuts and crevices. Next, rub bruised pimento (or bay or banana) leaves between your hands to release the natural oils, then rub leaves all over the marinated pork on all sides. Cover and refrigerate for at least 12 or up to 24 hours.\nSerious Eats / Lorena Masso\nFor a Charcoal Grill:\nLight a chimney full of charcoal briquettes (about 6 quarts). When all charcoal is lit and covered with gray ash, pour out and arrange coal on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil grilling grate. Cover grill and wait until temperature falls to about 300°F (150°C), adding chunks of wood (or wood briquettes or chips) when at temperature. (Follow\nhere\nfor how to set up a kettle grill with indirect heat as a smoker.) When the wood is ignited and producing smoke, remove pork from marinade, letting excess marinade drip off into pan, then transfer to grill (on cooler side if cooking with indirect heat) skin side up. Cover with the pimento leaves from the marinade, and close the lid. Cook, undisturbed, until the meat begins to caramelize and char on the bottom side, about 1 hour.\nSerious Eats / Lorena Masso\nRemove the leaves, turn pork skin side down, then reposition on the cooler side of the grill and re-cover with the leaves. Continue to cook, covered, until beginning to char on the now-bottom side of the pork, about 1 hour. (Adjust heat by adding coals and/or adjusting the air vents to maintain grill temperature around 300℉ (150°C).) Add extra wood chunks to coals as needed to maintain smoke.)\nSerious Eats / Lorena Masso\nRemove the leaves, flip pork, keeping on the cooler side of the grill, re-cover with the leaves, and continue to cook until pork is well charred all over and interior reaches 185°F (85°C), 1 to 2 hours longer, flipping pork and repositioning leaves as needed for even charring.\nSerious Eats / Lorena Masso\nTransfer pork to a work surface, discard leaves, and let rest for 30 minutes. Slice pork into thick slices or chop in rough chunks, which is how they serve it in Jamaica.\nSerious Eats / Lorena Masso\nServe with festival, pickled Scotch bonnet peppers, and ketchup on the side.\nSerious Eats / Lorena Masso\nSpecial Equipment\nBlender\n,\ncharcoal- or wood-burning grill\n, pimento or sweet wood briquettes or wood chips\nNotes\nJerk is traditionally very spicy and salty (and it is supposed to be that way) so gauge the level of heat that you want and adjust the quantity of Scotch bonnet peppers and salt that you use accordingly, based on your own palate. If you want it intensely spicy, use 3/4 pound Scotch bonnet peppers; if you want jerk seasoning that is still very hot but not quite as extreme, use 1/2 pound. Similarly, you can reduce the salt to suit your preference.\nPimento wood briquettes and chips are available online in the United States. If you are unable to find pimento wood, use your preferred sweet wood for smoking, such as apple or cherry woods.\nAllspice (or pimento, as it's called in Jamaica) leaves are slightly larger than bay leaves and much smaller than banana leaves, making it difficult to give a quantity in this recipe. Allspice leaves will be the hardest to find. The idea is to have enough leaves that you can cover the meat and trap the smoke. Dried bay leaves that are soaked to soften will also work as a substitution. If you can't find any of these leaves, you can use sheets of aluminum foil instead.\nMake-Ahead and Storage\nThe jerk seasoning marinade can be made ahead and refrigerated for up to 2 weeks.\nSmoked Pork\nThe Latest\nPork Shoulder\nJamaican\nJamaican Cuisine"
}