{
  "url": "https://www.seriouseats.com/jewish-deli-tuna-melt",
  "image_url": "https://www.seriouseats.com/thmb/eAH0gjSECvHJARrnYQbTpdqslMY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__04__20200427-tuna-melt-deli-style-daniel-gritzer-4-a76508febba740bf84e457fae198f591.jpg",
  "tags": [
    "American",
    "Stovetop",
    "Cheese",
    "Tuna",
    "Celery"
  ],
  "title": "Jewish Deli–Style Tuna Melt With Relish, Dill, Celery, and Swiss Recipe",
  "full_text": "Jewish Deli–Style Tuna Melt With Relish, Dill, Celery, and Swiss Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(5-ounce; 142g) can\noil- or water-packed tuna\n, drained well\n1/2\ncup\n(\n120\ng\n)\nmayonnaise\n, such as\nHellmann's\n(see note)\n2\ntablespoons\n(\n10\ng\n)\npanko bread crumbs\n(optional; see note)\n2\ntablespoons\n(\n20\ng\n)\nminced red onion\n1\ntablespoon\n(\n5\ng\n)\nminced fresh dill\n1\ntablespoon\n(\n20\ng\n)\ndrained sweet relish\n1/2\nrib\ncelery\n(\n30\ng\n), very finely diced\n1/2\nteaspoon\n(\n5\ng\n)\ncoarse ground mustard\nKosher salt\nand\nfreshly ground black pepper\n4\n1/2-inch-thick slices\nrye sandwich bread\nVegetable oil\n,\nclarified butter\n, and/or\nmelted butter\n, for brushing the bread\n4\nslices\nSwiss cheese\nDirections\nAdjust oven to middle position and preheat oven to 350°F (175°C). In a small mixing bowl, combine tuna, mayonnaise, panko (if using), red onion, dill, sweet relish, celery, and mustard. Stir, mashing very well with a fork or stiff spatula, until almost no flakes of tuna remain. Season with salt and pepper.\nUsing a pastry brush, lightly but evenly brush both sides of each slice of bread with oil, clarified butter, or melted butter. In a large cast iron or nonstick skillet, or using a griddle, toast bread slices on first side over medium heat until nicely browned and crisp, about 3 minutes; using a cooking weight or spatula, gently press down on bread slices while toasting to ensure even heating and browning.\nFlip bread and lay one slice of cheese on top of each bread slice. Mound tuna salad on top of 2 of the bread slices, spreading it in an even layer. Close sandwiches, placing top bread slices cheese side down, and continue to cook until bottom of sandwich is well toasted; press down gently on sandwich with cooking weights or a spatula to ensure even heating and browning.\nFlip tuna melt and cook until second side is well toasted. If cheese at this point isn't melted enough, transfer sandwiches to a baking sheet and heat in oven until cheese is melted, about 3 minutes. Serve.\nSpecial equipment\nLarge (12-inch) cast iron pan\n, nonstick skillet, or a\ngriddle\nNotes\nWe don't often specify brands, but in this classic tuna melt, Hellmann's adds its signature flavor. Feel free to use another preferred brand or homemade if you prefer.\nPanko helps make a tuna salad that's light and fluffy and moist without being runny. If you don't have it, do not substitute with another type of bread crumb as they will be too dense. Instead, reduce the mayonnaise from 1/2 cup (120g) to 6 tablespoons (90g).\nFor the fat to toast the bread, a neutral vegetable oil will make very crisp toasts but won't add any flavor; clarified butter will also make very crisp bread with a buttery flavor; melted butter will add buttery flavor too, but its water content will impede crisping slightly. You can use any three by themselves, or toast with oil for maximum crispness and then lightly brush with melted butter for just a bit of that rich dairy flavor.\nMake-Ahead and Storage\nThe tuna salad can be refrigerated in an airtight container overnight.\nThis Recipe Appears In\nThe Tuna Melt Manifesto: 7 Ways to Improve Your Melt\nAmerican\nStovetop\nCheese\nTuna\nCelery"
}