{
  "url": "https://www.seriouseats.com/jewish-braised-brisket-recipe",
  "image_url": "https://www.seriouseats.com/thmb/kbVumrg5wFWYTE9-ZMcxF-p4ihQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__04__2016-040-12-jewish-brisket-daniel-gritzer-6-2-45c14d8fac574b15a2999a4d819c466b.jpg",
  "tags": [
    "Brisket",
    "Passover",
    "Braised & Stewed Beef",
    "Hanukkah"
  ],
  "title": "Jewish-Style Braised Brisket With Onions and Carrots",
  "full_text": "Jewish-Style Braised Brisket With Onions and Carrots\nClose\nJump to recipe\nCook\n4 hrs 25 mins\nActive\n45 mins\nResting Time\n60 mins\nTotal\n5 hrs 25 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\npounds\n(\n2.75\nkg\n)\nwhole beef brisket\n(see note)\nKosher salt\nand\nfreshly ground black pepper\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n2\npounds\nyellow onions\n(\n1\nkg\n; about\n5\nmedium\n), sliced 1/4 inch thick\n1\npound\ncarrots\n(\n450\ng\n; about\n6\nmedium\n), cut into large dice\n1/2\npound\ncelery\n(\n225\ng\n; about\n4\nlarge ribs\n), cut into large dice\n6\nmedium cloves\ngarlic\n1\ncup\n(\n240\nml\n)\ndry red wine\n1\n(\n14\n-\nounce\n;\n400\ng\n)\ncan whole peeled tomatoes\n, crushed by hand, with the juices\n1/3\ncup\n(\n80\nml\n)\nketchup\n4\nsprigs\nthyme\n2\nbay leaves\nDirections\nIf Using a Stainless Steel Roasting Pan:\nSeason brisket all over with salt and pepper. Set a large stainless steel roasting pan over 2 burners set to medium-high heat, add oil, and heat until shimmering. Add brisket and brown on both sides, about 6 minutes per side. Transfer brisket to a work surface. Add onion, carrot, celery, and garlic to roasting pan and cook, stirring, until just starting to brown in spots, about 6 minutes; season with salt. Add wine and bring to a simmer while scraping up browned bits from bottom of pan. Stir in tomatoes and ketchup and return brisket to roasting pan, nestling it among vegetables.\nIf Using a Disposable Aluminum Roasting Pan:\nPreheat broiler and set oven rack to highest position. Season brisket all over with salt and pepper and place on a wire rack set over a rimmed baking sheet. Broil brisket, turning once, until browned on both sides, about 6 minutes per side. Transfer brisket to a disposable aluminum roasting pan. Remove rack from baking sheet, pour wine into baking sheet, and scrape up any browned bits on bottom. Meanwhile, in a large cast iron or stainless steel skillet, heat oil over medium-high heat until shimmering. Add onion, carrot, celery, and garlic and cook, stirring, until starting to brown in spots, about 6 minutes; season with salt. Add wine to vegetables and bring to a simmer, then stir in tomatoes and ketchup. Scrape vegetables into roasting pan with brisket.\nSerious Eats / Vicky Wasik\nAdd thyme and bay leaves to roasting pan and cover well with foil. Set oven to 300°F (150°C) and cook brisket on middle rack until fork-tender, 3 to 4 hours.\nSerious Eats / Vicky Wasik\nTransfer brisket to a work surface and let rest 30 minutes. Skim fat from surface of braising liquid and season liquid with salt and pepper; discard thyme sprigs and bay leaves. Slice brisket thinly against the grain, then transfer back to braising liquid, making sure to submerge slices well. Cover and let stand for 30 minutes in a warm place. Serve. Brisket can be made up to 4 days ahead and refrigerated whole or sliced in its braising liquid. Reheat gently before serving.\nSerious Eats / Daniel Gritzer\nSpecial Equipment\nStainless steel roasting pan\n, or disposable aluminum baking pan and\nrimmed baking sheet with wire rack\nNotes\nFor the juiciest brisket, try to use one that still has the second cut (also called the point or the deckle) attached. It has more intramuscular fat than the more common, lean first cut, and will remain moister as a result. If using just the first cut, be sure not to trim any fat—it needs the fat for moistness.\nFor a pressure cooker version of this recipe, click\nhere\n.\nBrisket\nPassover\nBraised & Stewed Beef\nHanukkah",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/jewish-style-braised-brisket-with-onions-and-carrots.webp?"
}