{
  "url": "https://www.seriouseats.com/juicy-lucy-cheeseburger-recipe-8681601",
  "image_url": null,
  "tags": [
    "Burgers",
    "The Latest",
    "American",
    "Midwestern"
  ],
  "title": "The Juiciest Juicy Lucy",
  "full_text": "The Juiciest Juicy Lucy\nJump to recipe\nPrep\n25 mins\nCook\n35 mins\nChilling and Cooling Time\n35 mins\nTotal\n95 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the “American” Cheese (Optional):\n1/3\ncup\n(\n80\ng\n) light\nlager beer\n(see notes)\n7\ng\nsodium citrate\n, about\n1 ½\nteaspoon\n8\nounces\n(\n225\ng\n) extra-sharp\ncheddar cheese\n, shredded\nFor the Onions:\n2\ntablespoons\nunsalted butter\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n225\ng\n) peeled, halved, and cut into thin slices\nKosher salt,\nto taste\nFreshly\nground black pepper,\nto taste\nFor the Burgers:\n1 1/2\npounds\n80% lean ground beef\n1\nteaspoon\nunflavored\npowdered gelatin\n, such as Knox\n1\ntablespoon\nwater\n1\nrecipe\nprepared\n“American” Cheese\n(above), or\n8\nslices\nstore-bought\nAmerican cheese\n, cut into 3½-inch rounds with a biscuit cutter or a glass\nKosher salt\nFreshly\nground black pepper\nCooked\nonions\n(recipe above)\nDill pickle\nslices, for serving\n4\npotato rolls\n, for serving\nDirections\nFor the “American” cheese (if making):\nAdjust oven rack to its middle position and preheat oven to 200℉. Line a 9.5 x 9.5” baking pan with a piece of parchment paper, and place lined pan into the oven to keep warm. (Warming the pan ensures that the cheese will not cool and set before it settles into an even layer.)\nSerious Eats / Qi Ai\nIn a small saucepan, add lager and sodium citrate and bring to a simmer over medium-high heat, whisking occasionally to dissolve sodium citrate. Once simmering, whisk in the cheese, then lower heat to medium-low and cook, whisking frequently, until cheese melts into a pale, uniform paste, 3 to 5 minutes.\nSerious Eats / Qi Ai\nRemove prepared baking pan from the oven and pour cheese sauce into the warmed pan. Working quickly, tilt the pan to distribute the cheese in a thin, even layer (use a small offset spatula to spread if necessary). Once spread, refrigerate the pan until the cheese is firm, about 15 minutes. Cover and return to the refrigerator until ready to use. (You can leave the cheese in the pan or remove the cheese, still on the parchment, from the pan and place it in a large zipper-lock bag, or wrap it in plastic wrap.)\nSerious Eats / Qi Ai\nWhen ready to make the burgers, remove cheese from the refrigerator and use a 3 ½- round biscuit cutter or drinking glass to punch out 4 cheese rounds. (see notes)\nSerious Eats / Qi Ai\nFor the onions:\nWhile cheese cools, in a 12-inch cast-iron skillet, melt butter over medium heat. Add onions and cook, stirring occasionally, until softened and beginning to caramelize, 10 to 15 minutes. If onions are beginning to burn before softened, add a splash of water (or, even better, a splash of the beer you used to make the beer cheese). Season with salt and pepper to taste and transfer to a bowl. Reserve the cast-iron skillet for cooking the burger.\nSerious Eats / Qi Ai\nFor the burgers:\nRemove beef from the refrigerator 20-30 minutes before cooking, to give it time to warm to room temperature. Add it to a medium mixing bowl. In a separate small bowl, combine gelatin and 1 tablespoon water, mix well, and immediately pour over the beef. Mix into the beef thoroughly but gently, taking care not to overwork it. Shape the beef into eight 3-ounce balls—two per burger. Place each ball, one at a time, between two sheets of plastic wrap or parchment, and flatten it with the bottom of a heavy skillet, pressingly evenly and firmly, until the patties are about 5 inches wide and about 1/4-inch thick.\nSerious Eats / Qi Ai\nPlace 1 flattened patty on a plate or cutting board, and place 1 beer cheese round (or two 3½-inch American cheese rounds) in the middle of each patty. Lay a second patty over the top and crimp the edges of the patties together. Carefully flip the burger and crimp the edges together on other side, taking care to seal the entire perimeter. Then, gently press the sides of the patty in to form a burger about 4-inches wide and 1/2-inch thick. Repeat until finished. Transfer flattened patties back to a large plate and refrigerate until firm to the touch, 15 minutes, or up to 24 hours.\nSerious Eats / Qi Ai\nIn the now-empty cast-iron skillet, heat 1 teaspoon oil over medium-high heat until smoking. Season the patties generously with salt and pepper on both sides. Carefully transfer the burgers to the skillet and cook until well browned on both sides, 2 to 3 minutes per side. (Don’t use a thermometer, which will liberate the molten cheese inside.)\nSerious Eats / Qi Ai\nTransfer the burgers to a plate, lower the heat to medium-low, and toast the buns in skillet, face-down, in two batches if necessary. Rest the patties for 5 minutes to cool the molten cheese inside slightly. Then, assemble the burgers: bottom bun, onions, patty, 3-4 pickle slices, top bun. Careful with that first bite.\nSerious Eats / Qi Ai\nSpecial Equipment\n12-inch cast iron skillet, 9.5 x 9.5” baking pan if making the “American\" cheese, parchment paper\nNotes\nIf making the “American” cheese, feel free to substitute water or milk for the beer. You can also experiment with different kinds of cheese (warning—they may set differently, depending on their moisture content, but you should end up with something burger-worthy).\nIf making the “American” cheese, you will end up with cheese scraps. Use them anywhere you’d use American or melt them down with another big splash of beer to make a gooey beer cheese dip.\nFeel free to add seasonings, such as mustard powder, cayenne, and granulated garlic, to the meat mixture.\nMake-Ahead and Storage\nThe “American” cheese can be made ahead and refrigerated in an airtight container for up to 2 weeks.\nSerious Eats / Qi Ai\nBurgers\nThe Latest\nAmerican\nMidwestern"
}