{
  "url": "https://www.seriouseats.com/ka-ak-al-quds-recipe-6889570",
  "image_url": "https://www.seriouseats.com/thmb/AEpZOXKziqFLGK7eYLOoJApQp_8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221212-Kaak-al-Quds-hero-ad5281ef046d4c94bbf90c8c57b8d86b.jpg",
  "tags": [
    "Middle Eastern",
    "The Latest",
    "Yeast Breads"
  ],
  "title": "Ka'ak al Quds (Jerusalem Sesame Bread)",
  "full_text": "Ka'ak al Quds (Jerusalem Sesame Bread)\nClose\nJump to recipe\nPrep\n2 hrs\nCook\n20 mins\nTotal\n2 hrs 20 mins\nMakes\n6 ka’ak\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n500\ng\nwhite bread flour\n(\n17 2/3\nounces\n; shy\n4\ncups\n,\nspooned\n), such as\nKing Arthur Bread Flour\n25\ng\n(scant\n2\ntablespoons\n)\nsugar\n12\ng\n(\n3\nteaspoons\n)\nDiamond Crystal kosher salt\n; for table or fine sea salt use half as much by volume or the same weight\n10\ng\n(\n1\ntablespoon\n)\ninstant dry yeast\n, such as\nSAF\n; not RapidRise or active dry (see notes and also more info\nhere\n)\n4\ng\n(\n1\nteaspoon\n)\nbaking powder\n355\ng\n(\n1 1/2\ncups\n)\nwhole milk\n, warm\nExtra-virgin olive oil\n, for rubbing on the dough\nTo Form and Bake:\n225\ng\nhulled sesame seeds\n(about\n1 1/2\ncups\n)\n150\ng\ngrape molasses\n(about\n1/2\ncup\n; see note)\nDirections\nFor the Dough:\nIn the bowl of a stand mixer fitted with a dough hook, combine bread flour, sugar, salt, yeast, baking powder, and milk and mix at medium speed until a smooth and elastic dough forms. Alternatively, mix the dough ingredients in a large bowl, kneading by hand until a smooth and elastic dough forms.\nSerious Eats / Mai Kakish\nRub the dough all over with just enough olive oil to very lightly coat, cover the bowl with a damp kitchen towel or plastic wrap, and set aside to rise in a warm location until almost doubled in size, about 1 hour.\nSerious Eats / Maureen Celestine\nTo Form and Bake:\nMeanwhile, in a large shallow tray such as a rimmed quarter sheet pan, stir together the sesame seeds and grape molasses, gradually adding water 1 tablespoon (15ml) at a time until just thinned enough not to cause the seeds to clump (about 2 to 4 tablespoons in total). Set aside.\nSerious Eats / Maureen Celestine\nGently punch down risen dough, then divide into 6 equal portions and place on a lightly floured work surface. Loosely cover again with the plastic wrap or kitchen towel and let rest 15 minutes.\nSerious Eats / Maureen Celestine\nPreheat oven to 450°F (220°C) and line two rimmed baking sheets with parchment paper. Working with one dough portion at a time, roll and stretch dough into logs about 12 inches long (30cm), then pinch the ends together to form rings; arrange formed rings on lightly-floured work surface. Cover once more with plastic wrap or clean kitchen towels and let rest 30 minutes.\nSerious Eats / Mai Kakish\nWorking with one dough ring at a time and continuously holding the pinched ends together, gently stretch the ring between your palms until it forms an elongated oval ring about 8 inches (20cm) long and 5 inches (12cm) wide (measuring from the outer edges). If you struggle getting the ends to remain attached, dampen your hands and sprinkle some flour just near the attached ends as you continue to shape and stretch it.\nSerious Eats / Mai Kakish\nPress each ring in the sesame mixture, turning to coat both sides, then transfer 3 rings to each baking sheet and let rest for 10 minutes.\nSerious Eats / Mai Kakish\nWorking with one sheet of dough rings at a time, bake until golden brown, 15 to 18 minutes. Transfer ka'ak to a wire rack to cool slightly. Repeat with remaining baking sheet of dough rings. Serve ka'ak warm.\nSerious Eats / Mai Kakish\nSpecial Equipment\nStand mixer with dough hook attachment, rimmed baking sheets\nNotes\nThese breads are normally dipped in a simple water-and-sesame mixture, which helps the sesame seeds stick to the dough. The high temperature of traditional wood ovens then gives the breads their famous dark golden brown color. The best way to achieve this in a standard home oven is to use a mixture of water, sesame seeds, and some kind of molasses. Grape molasses is the most traditional, but if you do not have it at home, you can easily substitute it with maple syrup or honey.\nMake-Ahead and Storage\nThe baked ka’ak al quds can be frozen in zipper-lock bags for up to 1 month; reheat in a moderate oven before eating.\nMiddle Eastern\nThe Latest\nYeast Breads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kaak-al-quds-jerusalem-sesame-bread.webp?"
}