{
  "url": "https://www.seriouseats.com/kabab-halla-recipe-7109593",
  "image_url": "https://www.seriouseats.com/thmb/BQZACTKI5cSzREkYNGQ2LaTppz0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Serious-Eats_2023MPP_Greg-DuPree_KababHalla_5851-25770082a526461689128fa66cd99083.jpg",
  "tags": [
    "The Latest",
    "Braised & Stewed Beef",
    "Beef Mains",
    "North African",
    "Beef"
  ],
  "title": "Kabab Halla (Egyptian Braised Beef With Onions)",
  "full_text": "Kabab Halla (Egyptian Braised Beef With Onions)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n3 hrs\nResting Time\n20 mins\nTotal\n3 hrs 40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/4\npounds\n(\n1\nkg\n)\nboneless beef chuck\n, trimmed and cut into 1-inch cubes\nKosher salt\nand\nfreshly ground black pepper\n2\ntablespoons\n(\n30\nml\n)\nghee\nor\nneutral oil\nlike\ncanola oil\n, plus more if needed (see note)\n4\nmedium\nyellow onions\n(\n8\nounces\n,\n225\ng\neach), thinly sliced (about\n8\ncups\n)\n3\nmedium\ncloves garlic\n, minced (about\n2\nteaspoons\n)\n1/2\nteaspoon\nground allspice\n1/2\nteaspoon\ncayenne pepper\n(optional)\n1/2\nteaspoon\nground coriander\n1/2\nteaspoon\nsweet paprika\n1/4\nteaspoon\nground cardamom\n1/4\nteaspoon\nground cumin\n1/4\nteaspoon\nfreshly grated nutmeg\n1/2\ncup\n(\n120\nml\n)\nhomemade beef stock\nor\nlow-sodium chicken broth\n, plus more if necessary (see note)\n1\n(3-inch)\ncinnamon stick\n2\nbay leaves\nRoughly chopped flat-leaf parsley\n, to garnish (optional)\nCooked white rice\n, preferably\nEgyptian misri\nor other\nlong-grain rice\nsuch as\nbasmati\n, for serving\nWarmed pita\n, for serving\nDirections\nPat beef dry with paper towels and season all over with salt and 1 1/2 teaspoons freshly ground black pepper.\nIn a Dutch oven or a large, heavy-bottomed pot, heat ghee over medium-high heat until shimmering. Working in batches to avoid crowding the pan, add beef in a single layer and cook until evenly browned on all sides, 6 to 8 minutes. Transfer to a clean plate. Repeat with remaining beef.\nAdd onions to the Dutch oven and cook, stirring often, until they begin to soften and brown, about 5 minutes; add additional ghee or oil if pot becomes too dry. Add the garlic along with the allspice, cayenne, coriander, paprika, cardamom, cumin, and nutmeg, and continue to cook, stirring, for 1 minute. (You don’t need to caramelize the onions all the way as they will brown further during the slow cooking process.)\nReturn the beef and any accumulated juices to the pot. Stir in the broth along with the cinnamon stick and bay leaves. Bring to a boil then cover and reduce heat to low. Simmer, covered, until meat is tender, 2 to 2 1/2 hours, checking every 20-30 minutes to make sure that the braise does not become dry and adding more water or broth if necessary (you want the braise to be moist but the meat should not be submerged in excess liquid). Once meat is tender, uncover, increase heat to medium-low, and simmer gently to reduce the sauce until thick and jammy, 20 to 30 minutes; season with salt, if needed. The braise is ready when the meat is fork-tender and the onions have completely melted into a thick sauce.\nTransfer to a deep serving dish. Garnish with fresh parsley leaves, if desired, and serve hot with rice and/or pita.\nSpecial Equipment\nDutch oven\nNotes\nThe buttery flavor of ghee is preferable, but a neutral oil like canola oil will work in a pinch (regular butter risks scorching with high-heat searing so is best avoided).\nStore-bought beef stock is frequently a poor substitute for the real thing so we recommend homemade if possible; store-bought chicken stock is generally the better substitute to homemade, unless you have a source of high-quality beef stock.\nThe cooking time of this beef braise depends on the meat cut used. So adjust the cooking time accordingly and add more water or broth if necessary.\nMake-Ahead and Storage\nKabab halla can be made 1-3 days in advance and kept refrigerated.\nYou can make a big batch of kabab halla and freeze it in zipper-lock bags.\nThe Latest\nBraised & Stewed Beef\nBeef Mains\nNorth African\nBeef",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kabab-halla-egyptian-braised-beef-with-onions.webp?"
}