{
  "url": "https://www.seriouseats.com/kachumbari-tomato-salad-recipe-8692614",
  "image_url": "https://www.seriouseats.com/thmb/UOCM27z2_T4E0gexv3LUlbOuz6U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240808-SEA-KachumbariKenyanTomatoSalad-AmandaSuarez-05-44fa04a01f1943d5851ac3da2e801a7f.jpg",
  "tags": [
    "Salads",
    "The Latest",
    "Tomato",
    "Quick Salads",
    "East African"
  ],
  "title": "Kachumbari (East African Tomato Salad)",
  "full_text": "Kachumbari (East African Tomato Salad)\nClose\nJump to recipe\nPrep\n20 mins\nTotal\n20 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nsmall\nred onion\n(\n3\nounces\n;\n85\ng\n) thinly sliced\n1 1/2\npounds\n(\n680\ng\n)\nripe plum\nor\nRoma tomatoes\n(about\n6\nlarge\n), cored and diced into 1-inch bite-size pieces (about\n3\ncups\n) (see notes)\n3/4\nteaspoon\nkosher salt\nplus more to taste; for table salt use half as much by volume\n1\nfresh\nserrano\nor\njalapeño chile pepper\n, stemmed and sliced into thin rings or finely diced (see notes)\n1/2\ncup\nroughly chopped fresh cilantro leaves\nand\ntender stems\n(from\n1\nsmall bunch\ncilantro\n)\n2\ntablespoons\n(\n30\nml\n)\nfresh lime\nor\nlemon juice\n, plus more to taste\nDirections\nIn a large bowl, cover onion with hot water (110 to 130℉) and let sit for 1 minute. Drain with a colander, then briefly rinse under hot water, and transfer to a small bowl; set aside.\nSerious Eats / Amanda Suarez\nPlace chopped tomatoes in the now-empty colander set over the now-empty large bowl and season with 3/4 teaspoon kosher salt. Toss to coat. Set aside at room temperature to drain, tossing occasionally until tomatoes release their juices, a minimum of 15 minutes or up to 1 hour.\nSerious Eats / Amanda Suarez\nDiscard juice from bowl, and transfer the tomatoes to the now-empty large bowl. Add the rinsed onions, serrano, cilantro, and lemon or lime juice. Season with salt and extra lime or lemon juice to taste, if needed. Serve immediately.\nSerious Eats / Amanda Suarez\nVariations\nCommon additions include diced cucumber and diced avocado. If adding avocado, make sure it is ripe but firm enough to hold its shape.\nSpecial Equipment\nColander\nNotes\nThe recipe can be doubled.\nWhile Roma tomatoes are used to make the salad in Kenya, any fresh, ripe tomato can be used in this salad.\nFor a less spicy version, remove the seeds from the chile pepper before slicing and/or substitute with a jalapeño chile.\nMake-Ahead and Storage\nThe onions can be rinsed and the tomatoes can be salted and left draining at room temperature for up to 1 hour ahead of making the salad.\nKachumbari is best enjoyed fresh, but it can be stored at room temperature for up to 1 hour or refrigerated for up to 1 day before serving. Refrigerate any leftovers in an airtight container for up to 1 day. If refrigerating, bring to room temperature before serving and drain any pooled excess liquid before serving.\nSalads\nThe Latest\nTomato\nQuick Salads\nEast African"
}