{
  "url": "https://www.seriouseats.com/kadhkhadi-coconut-and-tamarind-shrimp-recipe-8698458",
  "image_url": "https://www.seriouseats.com/thmb/pChsVgSze2bxYVwXmTVvjosPc2Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240903-SEA-Kadhkhadi-KanikaandJatinSharma-hero-565613b2722643acb6cdcd294a4d1ea8.jpg",
  "tags": [
    "Shrimp",
    "The Latest",
    "Indian",
    "Seafood Mains"
  ],
  "title": "Khadkhadi (Coconut-Tamarind Shrimp)",
  "full_text": "Khadkhadi (Coconut-Tamarind Shrimp)\nClose\nJump to recipe\nPrep\n45 mins\nCook\n15 mins\nTotal\n60 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor Brining the Shrimp:\n1 pound (\n454g\n)\nshrimp\n(any size will work), peeled, deveined, and tails removed (see notes)\n2\nteaspoons\nDiamond Crystal\nkosher salt;\nfor table salt, use half as much by volume or the same amount by weight\n2\nteaspoons\nred chile p\nowder (Bedgi or Kashmiri), plus more to taste\n1/2\nteaspoon\nground turmeric\n1/4\nteaspoon\nbaking soda\nFor the Tamarind Paste:\n2\nounces\npeeled, skinned, seedless\ntamarind\nfruit pulp (sold in compact blocks)\n1/2 cup plus\n2 t\nablespoons (\n145ml) boiling\nwater\nFor the Coconut-Garlic Paste:\n3\nounces\n(90g; 3/4 cup) frozen grated\nfresh coconut,\nthawed (see notes)\n1\nmedium\ngarlic clove\n, chopped\n2\ntablespoons\n(30ml)\nwarm water,\nplus more if needed\nFor Cooking the Shrimp:\n2\ntablespoons\n(30ml)\nvegetable oil\n1/4\nteaspoon\nblack\nmustard seeds\n8 to\n10\ntablespoons\nthick\ntamarind paste\n(see above)\nAbout\n4\nounces\ncoconut-\ngarlic paste (see above)\n1/4\ncup\nwater\nDirections\nFor brining the shrimp:\nIn a large metal or glass bowl, toss the shrimp with salt, chile powder, turmeric, and baking soda until combined and refrigerate for 30 to 45 minutes before cooking.\nSerious Eats / Kanika and Jatin Sharma\nFor the tamarind paste:\nWhile the shrimp brine, in a separate bowl, break up the tamarind into 2-inch chunks as best you can. Cover with boiling water for 15 minutes. Then, using your hands or a potato masher, mash the tamarind to break it up thoroughly to separate the pulp from the fruit fibers. Lightly squeeze the tamarind pulp to extract as much liquid as possible. Continue to soak for 5 minutes more. Use a fine-mesh strainer to drain the mixture into another bowl, and use a spatula to press gently on the pulp to extract as much pulp as possible through the strainer, scraping the bottom of the strainer occasionally and adding that extracted pulp to the bowl below. Discard the remaining threads, seeds, and skin of the fruit. You should have 8 to 10 tablespoons of the pulp paste; set aside.\nSerious Eats / Kanika and Jatin Sharma\nFor the coconut-garlic paste:\nWhile tamarind soaks, in high powdered blender, pulse coconut, garlic, and water to a fine, soft paste.  Add up to 2 tablespoons more water if needed to get a silky paste. The paste should be very soft, finer than pesto, with no visible coconut flecks. There should also be no freestanding water left after grinding. If there is water, pulse further (3 to 4 more pulses) to incorporate the water into the coconut. (Alternatively, grind the coconut, garlic, and water to a fine, soft paste with a mortar and pestle, adding water 1 tablespoon at a time as needed to loosen the mixture. )\nSerious Eats / Kanika and Jatin Sharma\nFor cooking the shrimp:\nKeeping a lid or screen handy, in a medium saucepan, heat the oil over medium-high heat until shimmering. Reduce heat to low and test the oil with one mustard seed. If it pops right away, the oil is ready to proceed; if not, return heat to medium-high briefly (about 15 seconds) and retest. When ready, quickly add the remaining mustard seeds to the saucepan and cover quickly with the lid/screen. The mustard seeds will pop, making a sound like popping corn for about 15 seconds. Once the popping stops, reduce heat to low, uncover and immediately add coconut-garlic paste. Cook, stirring often with a spoon and scraping the bottom of the pan periodically to ensure that no coconut sticks to it, until the mixture begins to turn golden and aromatic, being careful to not burn the mixture, 1 to 2 minutes.\nSerious Eats / Kanika and Jatin Sharma\nIncrease the heat to medium–high and add the brined shrimp to the pan and stir to combine with the paste. Add the prepared tamarind pulp and water into the pan and stir to combine. Cook until bubbling, 1 to 2 minutes.\nSerious Eats / Kanika and Jatin Sharma\nReduce heat to medium-low and cook until shrimp just turn opaque and pink and sauce is bubbling and thickened, 2 to 3 minutes.\nSerious Eats / Kanika and Jatin Sharma\nLet sit off heat, covered, until shrimp is fully cooked, 1 to 5 minutes. Serve immediately with rice and garnish with cilantro or cool to room temperature, then refrigerate in an airtight container until ready to serve. The shrimp can be served warm, at room temperature, or chilled.\nSerious Eats / Kanika and Jatin Sharma\nSpecial Equipment\nMetal or glass bowl for brining shrimp (so the turmeric does not stain plastic), fine-mesh strainer, food processor or mortar and pestle, medium saucepan with a lid or screen\nNotes\nThe recipe can easily be doubled, if desired.\nIf serving the shrimp hot as a main course, I recommend using large shrimp, while if planning to serve the shrimp cold as a condiment or spread on toast, I prefer to use smaller shrimp.\nFor a spicier version, add more chile powder to the shrimp brine.\nMake-Ahead and Storage\nMake khadkhadi as a condiment up to 7 days before you wish to serve it. Store in an airtight glass jar or other tightly sealed container. Serve at room temperature or cold.\nShrimp\nThe Latest\nIndian\nSeafood Mains"
}