{
  "url": "https://www.seriouseats.com/kafta-bi-bandora-recipe-6749298",
  "image_url": "https://www.seriouseats.com/thmb/WEZD9WWiHHFqAJg8p08rPWzViH0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221011-Kafta-MaiKakish-hero-b96c8a540540434c8f2e439d6491e4ab.JPG",
  "tags": [
    "Lamb",
    "Middle Eastern",
    "The Latest"
  ],
  "title": "Kafta bi Bandora (Palestinian Ground Meat Patties in Tomato Sauce)",
  "full_text": "Kafta bi Bandora (Palestinian Ground Meat Patties in Tomato Sauce)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n60 mins\nTotal\n90 mins\nServes\n6\nto 8 servings\nMakes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Meat:\n4\nmedium\npotatoes\n(about 1 1/2 pounds; 680g), peeled and sliced into 1/2 inch thick rounds (see note)\n1\ntablespoon\n(15ml)\nextra-virgin olive oil\n, plus more for drizzling\nDiamond Crystal\nkosher salt\nor fine sea salt\n3 1/2\nounces\n(100g)\npita bread\nor crustless white bread, roughly torn (about 2 loosely packed cups)\n1\nmedium\n(6-ounce; 170g)\ntomato\n, cored and roughly diced\n1\nsmall\n(6-ounce; 170g)\nyellow onion\n, roughly diced\n2\nmedium\ncloves garlic\n1\nfresh green chile\n, such as Anaheim, jalapeño, or serrano, stemmed and seeded (optional)\n2\ntablespoons\nchopped cilantro\nleaves and tender stems\n2\ntablespoons chopped\nflat-leaf parsley\nleaves and tender stems\n1\nteaspoon\nground allspice\n1\nteaspoon\nground cinnamon\n1/2\nteaspoon\nground black pepper\n1/2\nteaspoon\nground cumin\n1/2\nteaspoon\nground coriander\n(optional)\n2\npounds\n(900g)\nground meat\n(beef, lamb, veal, or a combination), preferably\n20% fat\n(see note)\nFor the Sauce and to Assemble:\nOne\n28-ounce\n(794g)\ncan\nwhole peeled tomatoes\n, crushed with their juices by hand or with a potato masher\n1/4\ncup\n(60ml)\nextra-virgin olive oil\n2\nmedium\ncloves garlic\n, crushed\nKosher or\nsea salt\nand freshly ground black pepper\n2\nmedium\ngreen bell peppers\n(about 5 ounces; 142g each), stemmed, seeded, and sliced crosswise into 1/4 inch thick rounds\nVermicelli rice\n,\ncooked white rice\n, and/or pita bread, for serving\nDirections\nFor the Meat:\nPreheat oven to 425°F (220°C). On a rimmed baking sheet, toss potatoes with olive oil and a large pinch of salt, then arrange in a single layer. Roast until nicely browned, about 35  minutes. Set aside.\nSerious Eats / Mai Kakish\nMeanwhile, in a food processor, combine bread, tomato, onion, garlic, chile (if using), cilantro, parsley, allspice, cinnamon, black pepper, cumin, and ground coriander along with the 1 tablespoon olive oil and 1 tablespoon (9g) Diamond Crystal kosher salt (for fine sea salt, use half as much by volume or the same weight). Pulse, scraping down sides as necessary, until a coarse paste forms.\nSerious Eats / Mai Kakish\nIn a large mixing bowl, combine ground meat with the processed vegetables and spices and mix well with your hands just until fully combined.\nSerious Eats / Mai Kakish\nShape the meat mixture into 3-inch-wide by 3/4-inch-thick patties (about 15 to 18 patties), and arrange on a second rimmed baking sheet. Cook until the surface has nicely browned, about 15 minutes. Set aside.\nSerious Eats / Mai Kakish\nFor the Sauce and to Assemble:\nIn a medium mixing bowl, stir together crushed tomatoes and their juices with the olive oil and garlic along with 1/2 cup (118ml) water. Season with salt and pepper.\nSerious Eats / Mai Kakish\nIn a 9- by 13-inch rectangular baking dish or a 10- or 11-inch oval baking dish, arrange kafta patties in an upright shingled pattern, alternating with potato slices and green bell pepper rounds (you will only need around 15 to 20 slices each of potato and bell pepper; reserve any extra for snacking). Add any accumulated juices from the katfa baking sheet, then pour tomato sauce all over.\nSerious Eats / Mai Kakish\nBake until sauce is bubbling and slightly thickened and the bell peppers are browning in spots, about 25 minutes.\nSerious Eats / Mai Kakish\nServe with vermicelli rice or plain white rice and/or fresh pita bread.\nSerious Eats / Mai Kakish\nMake-Ahead and Storage\nThe kafta and potatoes can be roasted several hours and assembled in the baking dish with green peppers and sauce, then refrigerated for several hours until ready to bake.\nNotes\nI prefer russet potatoes for this dish, as they tend to smash more when you eat the kafta with bread and rice, but other varieties, such as Yukon gold, will work.\nThe type of meat you use is flexible. Using only lamb will provide the gamiest flavor, which works very well with the seasonings in this dish. Using only beef or veal will be more mild; veal also provides more gelatin than the other two, which can improve juiciness, though any of these meats at 20% fat will be very juicy. If you want a subtle lamb flavor, creating a 1:1 mixture of ground beef and lamb or a 1:1:1 mixture of beef, veal, and lamb will both work, as will any other ratio, depending on your flavor preferences.\nLamb\nMiddle Eastern\nThe Latest"
}