{
  "url": "https://www.seriouseats.com/kale-and-mushroom-egg-bites-recipe-11703113",
  "image_url": "https://www.seriouseats.com/thmb/7z2oEQIH49TSOInO0aZtrlamf4c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250226-SEA-KaleandMushroomEggBitesMuffinTin-ShriRepp-Beauty3-35-d6295f0c9eb7476eab6e3eefd8b0b914.jpg",
  "tags": [
    "Baked Eggs",
    "The Latest",
    "Breakfast & Brunch",
    "Vegetarian Breakfast & Brunch"
  ],
  "title": "Muffin Tin Egg Bites With Mushrooms, Kale, and Swiss Cheese",
  "full_text": "Muffin Tin Egg Bites With Mushrooms, Kale, and Swiss Cheese\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nCooling Time\n5 mins\nTotal\n60 mins\nServes\n6\nto 8 Servings\nMakes\n12 egg bites\nCook Mode\n(Keep screen awake)\nIngredients\nCooking spray\n7\nlarge\neggs\n2/3\ncup\n2% small-curd\ncottage cheese\n(\n6\nounces\n;\n170\ng\n)\n3\nounces\n(\n90\ng\n)\nSwiss cheese\n, shredded (about\n3/4\ncup\n)\n1 1/2\nteaspoons\nrice starch or\ncornstarch\n1\nteaspoon\nhot sauce\n, optional\n1\nteaspoon\n(\n3\ng\n)\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\n1/4\nteaspoon\ngarlic powder\n3\ntablespoon\n(\n45\nml\n)\ncanola oil\n, divided\n1 2/3\ncups\nfinely chopped\nportobello mushroom caps\n, from\n2\nmedium\n(3 1/2-inch)\ncaps\n(\n5\nounces\n;\n140\ng\n)\n2\ncups\nlightly packed stemmed and chopped\nlacinatio kale\n(\n2\nounces\n;\n60\ng\n)\nBoiling\nwater\nfor water bath\nDirections\nAdjust oven rack to middle positions, and preheat oven to 325°F (160℃). Lightly coat a 12-cup muffin pan with cooking spray; set aside.\nSerious Eats / Shri Repp\nIn a blender jar, combine eggs, cottage cheese, Swiss cheese, rice starch or cornstarch, hot sauce (if using), salt, black pepper, and garlic powder and blend on medium speed until smooth, about 30 seconds. Pour 2 cups of the egg mixture into a liquid measuring cup; set aside. Leave remaining egg mixture in the blender jar.\nSerious Eats / Shri Repp\nIn a large skillet, heat 2 tablespoons oil over medium-high heat until shimmering. Add mushrooms, and cook, stirring often, until lightly browned, about 6 minutes; transfer to a large bowl. Add remaining 1 tablespoon oil to skillet. Reduce heat to medium, and add kale. Cook, stirring often, until wilted, about 2 minutes. Scrape kale into blender jar with remaining egg mixture. Process on medium speed until kale is very finely chopped, about 10 seconds. Stir kale and egg mixture into mushrooms in bowl.\nSerious Eats / Shri Repp\nDivide vegetable-egg mixture into prepared muffin cups. Gently pour reserved egg mixture over mushroom-kale-egg mixture.\nSerious Eats / Shri Repp\nSet filled muffin tin in a roasting pan. Place roasting pan on middle oven rack and pour boiling water around muffin tin until water is 1 inch deep, about halfway up the sides of the muffin tin. Bake until the center of the egg bites look dry, with some bubbles on the surface, but edges are still wet, 10 minutes. Carefully remove roasting pan with muffin tin from oven, and using a toothpick or small spoon, gently stir each egg bite, combining the soft egg curds with the wet egg mixture. Return to oven, and continue to bake until eggs are completely set, about 20 minutes longer. Carefully remove muffin pan from roasting pan. Let cool for 5 minutes. Run a small offset spatula or butter knife around the edges of each egg bite to loosen, then gently turn the pan upside down to remove the egg bites. Serve or let cool completely before storing.\nSerious Eats / Shri Repp\nSpecial Equipment\nBlender, large skillet, 12-cup muffin tin, roasting pan, small offset spatula or butter knife\nMake-Ahead and Storage\nCooled egg bites can be refrigerated in an airtight container for up to 4 days or frozen for up to 1 month. For frozen bites, thaw in the refrigerator overnight. To reheat, microwave until heated through, about 30 seconds, or warm in a 350℉ (175℃) oven until warmed through, about 5 minutes.\nBaked Eggs\nThe Latest\nBreakfast & Brunch\nVegetarian Breakfast & Brunch",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/muffin-tin-egg-bites-with-mushrooms-kale-and-swiss-cheese.webp?"
}