{
  "url": "https://www.seriouseats.com/kanafeh-middle-eastern-cheese-and-phyllo-dessert",
  "image_url": "https://www.seriouseats.com/thmb/dEsc-3GpUZTp0YfK0tzjEs4PMlA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__06__20180622-knafeh-vicky-wasik-15-3980154060cb4e539076395c5fb41a7f.jpg",
  "tags": [
    "Baking",
    "Desserts",
    "Middle Eastern",
    "Pastries",
    "Cheese"
  ],
  "title": "Kanafeh (Middle Eastern Cheese and Phyllo Dessert) Recipe",
  "full_text": "Kanafeh (Middle Eastern Cheese and Phyllo Dessert) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n20 mins\nTotal\n60 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Kanafeh:\n8\nounces\n(\n225\ng\n)\nnabulsi\n,\nakkawi\n, or\nmozzarella cheese\n, roughly chopped or shredded\n2/3\ncup\n(\n5\nounces\n;\n140\ng\n)\nclotted cream\n,\ncrème fraîche\n, or\ncream cheese\n1\npound\n(\n454\ng\n)\nshredded phyllo\n, thawed\n1 1/2\ncups\n(\n12\nounces\n;\n340\ng\n)\nghee\n, melted\nFor the Syrup:\n1 1/2\ncups\ngranulated sugar\n(\n11.5\nounces\n;\n325\ng\n)\n2\ntablespoons\nlemon juice\n1\nteaspoon\nrose water\n1/2\nteaspoon\norange blossom water\n3/4\ncup\nchopped, toasted pistachios\n(\n3\nounces\n;\n84\ng\n)\nDirections\nGetting Started:\nSet the oven rack to the lower-middle position and preheat to 400°F (204°C).\nFor the Kanafeh:\nIn a medium bowl, combine the cheese and clotted cream and set aside. With a serrated knife, slice the shredded phyllo crosswise into 1/4- to 1/2-inch lengths and transfer to a large bowl. Pour the melted ghee over the phyllo and, using your hands, toss and mix the phyllo with the ghee in a gentle rubbing motion to ensure that all the phyllo shreds are evenly coated, about 5 minutes.\nTransfer half the coated phyllo to a 10-inch cast iron skillet, evenly distributing it along the bottom of the pan. Use the bottom of a glass or measuring cup to firmly pack the phyllo, creating an even crust. Top this with the cheese mixture, spreading it evenly over the first phyllo layer and leaving a 1/2-inch border along the rim. Spread the remaining phyllo over the cheese and once again firmly pack it down. Bake in the preheated oven until deeply golden brown, about 40 minutes.\nFor the Syrup:\nPrepare the syrup while the kanafeh bakes. In a medium sauce pot, add the sugar, lemon juice, and 1 cup of water. Simmer until the syrup reaches 234°F (112°C), or when a small amount dropped into ice water forms a soft ball. Remove from heat and set aside to cool slightly. When the kanafeh is ready, finish the syrup by adding the rose and orange blossom waters.\nTo Serve:\nAfter removing the kanafeh from the oven, immediately drizzle on about 1/3 of the syrup. Invert the pie onto a serving platter and drizzle with the remaining syrup. Sprinkle with chopped nuts and serve right away.\nSpecial Equipment\nBread knife\n, offset spatula,\n10-inch cast iron skillet\n,\nrimmed baking sheet\nNotes\nThe brined nabulsi and akkawi cheeses need to be soaked in water overnight to remove excess salt. Alternatively, you can gently simmer the cheese in water (and changing the water if it becomes too cloudy) for about 15 minutes.\nThis Recipe Appears In\nKanafeh Is the Crispy, Gooey, Nutty, Syrupy Dessert for Cheese Lovers\nBaking\nDesserts\nMiddle Eastern\nPastries\nCheese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kanafeh-middle-eastern-cheese-and-phyllo-dessert-recipe.webp?"
}