{
  "url": "https://www.seriouseats.com/kanom-jeen-nam-ya-thai-fish-curry-rice-noodles-5199040",
  "image_url": "https://www.seriouseats.com/thmb/WYBn_ueaOIJMMozZMPmJGsHYoks=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-southern-thai-fish-curry-rice-noodles-KanomJeenNamYaGati-vicky-wasik-seriouseats-24-103e63c6d619403b8c1d6b11245ad851.jpg",
  "tags": [
    "Thai",
    "Rice Noodles",
    "Seafood Mains",
    "Fish",
    "Mains"
  ],
  "title": "Kanom Jeen Nam Ya (Thai Fish Curry with Rice Noodles)",
  "full_text": "Kanom Jeen Nam Ya (Thai Fish Curry with Rice Noodles)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nTotal\n65 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Curry:\n3\ncups\n(\n710\nml\n) full-fat\ncoconut milk\n, such as Aroy-D, divided (see note)\n7\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core sliced into 1/4-inch-thick rounds (\n70\ng\nsliced\nlemongrass\n)\n3\nounces\n(about\n12\npieces\n;\n85\ng\n)\ngrachai\n, cut into 1/4-inch-thick rounds (see note)\n6\nsmall\nshallots\n(\n120\ng\n)\n5\nmedium\ngarlic cloves\n(\n25\ng\n)\n1\n(2-inch) piece\nfresh\ngalangal\n, peeled and thinly sliced (about\n2\ntablespoons\n;\n15\ng\n) (see note)\n1\ntablespoon\n(\n7\ng\n)\nmakrut lime zest\nfrom\n3\nmakrut limes\n(optional, see note)\n15\ndried\nThai chiles\n(\n7\ng\n), stemmed*\n10\ndried spur\nchiles\n(\n15\ng\n), stemmed and seeded (see note)\n2\ntablespoons\n(\n40\ng\n) Thai\nshrimp paste\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n8\n(\n4-ounce\n;\n115 g\n) bone-in\nmackerel steaks\n(see note)\n1/4\ncup\nplus\n2\ntablespoons\n(\n90\nml\n)\nfish sauce\nFor Serving:\n10 1/2\nounces\n(\n300\ng\n) dried thin\nrice noodles\n(vermicelli)\nAssorted raw vegetables, such as\ngreen cabbage\n,\ncucumbers\n,\nmung bean sprouts\n,\nlong beans\n, and\nbanana blossom\n, thinly sliced (mung bean sprouts left whole)\nSoft-boiled eggs\n, for serving (optional)\nFresh\nsweet basil\nleaves (a.k.a. Thai basil), for serving (optional)\nDirections\nFor the Curry:\nIn a 3-quart saucepan, whisk together 2 cups (475ml) coconut milk and 4 cups (1L) water. Add lemongrass, grachai, shallots, garlic, galangal, both kinds of dried chiles, shrimp paste, salt, and mackerel. Stir to combine and bring to a boil over medium-high heat. Cook at a boil, stirring occasionally, until fish is cooked through, about 10 minutes. Using a slotted spoon, transfer fish to a plate and set aside to cool.\nVicky Wasik\nReturn saucepan to medium-high heat, and continue to cook until liquid is reduced to approximately 3 cups (710ml), 10 to 15 minutes. Transfer contents of saucepan to a blender and blend on high speed until smooth, 1 to 2 minutes; wipe out saucepan and return to stovetop. Set aside blended curry.\nVicky Wasik\nUsing clean hands, pick fish meat from bones and transfer to a mortar and pestle or food processor bowl; discard bones and skin. Pound or pulse until fish is the texture of cooked ground meat, about 1 minute.\nVicky Wasik\nReturn fish and blended curry to saucepan along with remaining 1 cup (240ml) coconut milk, fish sauce, and 1/2 cup (120ml) water. Stir to combine and bring to a boil over over medium-high heat. Reduce to a simmer and cook, stirring occasionally, until curry thickens to a saucy consistency, about 20 minutes.\nVicky Wasik\nFor Serving:\nMeanwhile, bring a pot of water to a boil over high heat. Add noodles and cook, stirring occasionally, until just tender, about 7 minutes (cooking time varies for vermicelli, so start checking for doneness after 3 minutes). Drain and rinse under cold water. Transfer noodles to a large serving platter or individual plates. Spoon curry over top or pass at the table along with vegetables, eggs, and sweet basil, allowing guests to garnish plates as they please. Serve.\nVicky Wasik\nSpecial Equipment\n3-quart saucepan,\nblender\n,\nfood processor\nor\ngranite mortar and pestle\nNotes\nWhen purchasing coconut milk, look for versions like the one from Aroy-D that have \"100% coconut milk\" as the only listed ingredient, rather than those made with coconut extract and water.\nGrachai, sometimes spelled krachai, is known by many names in English, including wild ginger, fingerroot, and Chinese keys. Like ginger and galangal, grachai is a rhizome, with a slightly bitter and medicinal aroma. Fresh grachai is nearly impossible to find in the US, but frozen or brined grachai can be found at Southeast Asian markets.\nFresh makrut limes can be hard to find in the US. You can order them online, though they are a seasonal product and may not always be available (note that they are often sold under a different name that we avoid using, as it is a\nderogatory term in some contexts\n); you may also be able to find them in the freezer section at Southeast Asian markets. Makrut lime zest freezes well. If you cannot find makrut lime, you are better off omitting it, as the more common Persian lime and other citrus are not good substitutes.\nDried spur chiles are a type of Thai chile known as prik cheefa haeng; they have a fruity, mild flavor, and are prized for the color they impart to curry pastes. They can be hard to come by in the US, but are sometimes available online. Alternatively, you can substitute puya or guajillo chiles, which are available at Central American markets.\nFreshwater fish such as tilapia or catfish can be substituted for mackerel. If using boneless fillets, adjust cooking time as needed in step 1, taking into account that fish will cook more quickly.\nMake-Ahead and Storage\nCurry can be made in advance, and refrigerated in an airtight container for up to 3 days or frozen for up to 2 months. Bring to room temperature, or gently warm on stovetop before serving.\nThai\nRice Noodles\nSeafood Mains\nFish\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kanom-jeen-nam-ya-thai-fish-curry-with-rice-noodles.webp?"
}