{
  "url": "https://www.seriouseats.com/kansas-city-steak-soup-recipe-11682976",
  "image_url": "https://www.seriouseats.com/thmb/VSgyjBH6fvIu60Y7JD8DYH_pQNU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250218-SEA-KansasCitySteakSoup-QiAi-Beauty1-39-5f9d7b372cda415baebd05c4f2f0532c.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Midwestern",
    "Steaks",
    "Strip Steaks"
  ],
  "title": "Kansas City Steak Soup",
  "full_text": "Kansas City Steak Soup\nClose\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nTotal\n65 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n950\nml\n)\nhomemade chicken stock\nor store-bought low-sodium chicken broth (see note)\n1/2\nounce\n(\n14\ng\n)\ndried porcini mushrooms\n1\npound\nKansas City strip steak\nor NY strip steak (about\n2\nsteaks\n), trimmed of excess fat and diced into 3/4 inch cubes\n1\nteaspoon\nDiamond Crystal kosher salt\nplus more for seasoning steak; for table salt, use half as much by volume\n1\nteaspoon\nfreshly ground\nblack pepper\n, plus more for seasoning steak\n4\ntablespoons\n(\n57\ng\n)\nunsalted butter\n, divided\n8\nounces\n(\n227\ng\n)\ncremini mushrooms\n, trimmed and thinly sliced\n1/2\nmedium\nyellow onion\n(\n4\nounces\n;\n110\ng\n), diced\n1\nmedium\ncarrot\n(\n4\nounces\n;\n80\ng\n), peeled and diced\n2\nsmall ribs\ncelery\n(\n80\ng\n), halved lengthwise, then sliced\n1\ntablespoon\n(\n25\ng\n)\ntomato paste\n1/4\ncup\n(\n37\ng\n)\nall-purpose flour\n1/2\ncup\n(\n120\nml\n)\ndry sherry\n, such as oloroso sherry\n(\n8\nounces\n)\ncanned diced tomatoes\n, drained (\n1\ncup\n)\n1\ntablespoon\n(\n15\nml\n)\nbottled steak sauce\n, preferably A1\n1\ntablespoon\n(\n15\nml\n)\nWorcestershire sauce\nDirections\nIn a microwave-safe container, heat chicken stock and dried porcini mushrooms until stock is hot and mushrooms are fully hydrated, about 3 minutes on high. Use a slotted spoon to transfer hydrated porcini to a cutting board. Chop porcini and return to stock. Set aside.\nPat steak dry and season steak cubes generously with salt and pepper. In a large Dutch oven or heavy-bottomed stockpot, heat 2 tablespoons butter over medium-high heat until melted. Once foaming subsides and butter begins to brown, add steak and sear, stirring occasionally, until cubes are generously browned all over, 2 to 3 minutes. Transfer to a large plate and set aside.\nSerious Eats / Qi Ai\nAdd cremini mushrooms to Dutch oven and sauté, stirring occasionally, until mushrooms release their liquid and are deeply browned, about 8 minutes. Transfer to a bowl and set aside.\nSerious Eats / Qi Ai\nAdd remaining 2 tablespoons of butter, then onions, carrots, and celery. Stir until vegetables are softened and browned around edges, about 4 minutes. Add tomato paste and stir to incorporate, about 30 seconds. Add flour and stir until vegetables are coated and no bright white streaks remain, about 30 seconds.\nSerious Eats / Qi Ai\nAdd sherry and stir vigorously, scraping up browned bits with a wooden spoon, until fragrant and almost completely evaporated, about 30 seconds. Add broth with porcini mushrooms, tomatoes, cooked cremini mushrooms, steak sauce, Worcestershire sauce, 1 teaspoon salt, and 1 teaspoon pepper. (Do not add steak.)\nSerious Eats / Qi Ai\nBring to a boil, then reduce heat to medium low and simmer, stirring occasionally, until soup is glossy and has thickened, about 15 minutes. Season with additional salt and pepper to taste. Add steak and stir just until heated through, about one minute. Ladle into individual bowls and serve.\nSerious Eats / Qi Ai\nSpecial equipment\nDutch oven\nor large heavy-bottomed stock pot\nNote\nFor the stock, you can also use\nhomemade beef stock\n, but I do not recommend using store-bought beef stock or broth.\nMake-Ahead and Storage\nLeftover soup can be refrigerated in an airtight container for up to 4 days or frozen for up to 2 months.\nSoups\nThe Latest\nMidwestern\nSteaks\nStrip Steaks"
}