{
  "url": "https://www.seriouseats.com/kanuchi-cherokee-pureed-nut-soup",
  "image_url": "https://www.seriouseats.com/thmb/lGcd9z_dBitl_qNLIK9_KhA286g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__11__20191104-kanuchi-native-american-pecan-soup-vicky-wasik-5-abcbbee45e204834a2ad9e9f8c7fa218.jpg",
  "tags": [
    "Soups",
    "North American",
    "Vegetarian Mains",
    "Stovetop",
    "Nuts & Seeds"
  ],
  "title": "Kanuchi (Cherokee Pureed Nut Soup)",
  "full_text": "Kanuchi (Cherokee Pureed Nut Soup)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n30 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(\n340\ng\n)\nraw shelled hickory nuts\nor\npecans\n(see note)\n1\nteaspoon\nkosher salt\n, plus more as needed\n1\ntablespoon\nmaple syrup\n1\ncup\ncooked and drained whole or cracked hominy\n, or\n1\nlarge\nsweet potato\n(\n1\npound\n6\nounces\n;\n625\ng\n), peeled, cut into 1/2-inch dice, and roasted (see note)\nDirections\nIn a food processor, process nuts, scraping down sides once or twice during processing, until they form a thick paste, about 3 minutes. Scrape nut paste into a medium bowl.\nSerious Eats / Vicky Wasik\nDivide paste into 3 even portions. You only need one portion to make this recipe; you can save the rest for future batches or use it as a nut butter in other preparations. To save the extra nut paste: If the paste is thick enough to hold its shape, form the remaining portions into balls, wrap tightly in plastic and then aluminum foil, and freeze for up to 3 months; if the paste is too loose to hold its shape, transfer portions to small zipper-lock bags, press out the air, then seal and freeze for up to 3 months.\nTransfer remaining portion of nut paste to a 3-quart saucepan and add 1 quart (1 liter) cold water along with the 1 teaspoon kosher salt. Set over high heat and bring to a boil, whisking to incorporate nut paste. Reduce heat to maintain a simmer and cook uncovered, stirring occasionally, until reduced by half, about 30 minutes.\nSerious Eats / Vicky Wasik\nAdd maple syrup, then increase heat to high, allowing soup to boil until any separated fats on the surface have emulsified back into the soup. Taste, adding more salt if desired.\nTo serve, briefly reheat hominy or sweet potato. Ladle hot soup into bowls and garnish with hominy or sweet potato.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n,\n3-quart saucepan\nNotes\nHominy comes precooked in cans and sold dry; if dry, boil in ample water until tender, about 1 hour (though cooking time will depend on the size and type of hominy).\nIf roasting sweet potatoes, preheat oven to 400°F (200°C). Drain sweet potatoes and transfer to medium bowl. Toss with just enough oil to coat and season with salt. Spread sweet potatoes on a rimmed baking sheet and roast, turning sweet potato pieces once or twice during cooking with a thin metal spatula, until lightly browned and tender, about 30 minutes. Set aside until ready to use.\nMake-Ahead and Storage\nThe soup base can be refrigerated in an airtight container for up to one week; reheat before serving. The extra nut paste can be tightly wrapped and frozen for up to three months.\nRead More\nGhanaian Chicken and Peanut Stew (Groundnut Soup) Recipe\nWest African Peanut Stew Recipe\nVegan Peanut, Sweet Potato, and Kale Soup with Coconut Recipe\nWild Hickory Nut Shortbread Cookies Recipe\nSoups\nNorth American\nVegetarian Mains\nStovetop\nNuts & Seeds",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kanuchi-cherokee-pureed-nut-soup.webp?"
}