{
  "url": "https://www.seriouseats.com/kare-kare-filipino-curry-5196493",
  "image_url": null,
  "tags": [
    "Filipino",
    "Stovetop Beef",
    "Beef Mains",
    "The Latest"
  ],
  "title": "Kare-Kare (Filipino Curry)",
  "full_text": "Kare-Kare (Filipino Curry)\nJump to recipe\nCook\n4 hrs\nTotal\n4 hrs\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n20\ng\n)\nwhite rice flour\n6\ntablespoons\n(\n90\nml\n)\ncanola oil\n, divided\n2 1/4\npounds\n(\n1\nkg\n)\noxtails\n, fat trimmed (see note)\n14\nmedium\ngarlic cloves\n(\n60\ng\n), minced, divided\n1/2\nmedium\nred onion\n(about\n4\nounces\n;\n115\ng\n), finely diced, divided\n1\nscallion\n, ends trimmed and sliced thinly on a bias for garnish, trimmings reserved\n4\nsmall\nbok choy\n(about\n1/4\npound\n;\n115\ng\n), halved lengthwise\n1\nmedium\nChinese eggplant\n(about\n1/2\npound\n;\n225\ng\n), ends trimmed and cut into 3-inch-long by 1-inch-thick batons\n4\nounces\n(\n115\ng\n)\nChinese long beans\nor\nstring beans\n, stem ends trimmed and beans cut into 3-inch lengths\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n8 1/2\nounces\n(about\n1\ncup\n;\n240\ng\n)\nnatural creamy peanut butter\n(see note)\n1\ntablespoon\n(\n20\ng\n)\nannatto powder\n2\nounces\nginisang bagoong\n(\n1/4\ncup\n;\n60\ng\n), plus more for serving (see note)\n2 1/2\nounces\nroasted, unsalted peanuts\n(about\n1/2\ncup\n;\n70\ng\n), crushed, for garnish\n2\ntablespoons\n(\n15\ng\n)\nhomemade\nor\nstore-bought fried garlic\n, for garnish\n1\ncup\ncooked white rice\nDirections\nAdjust oven rack to top position and preheat to 350°F (175°C). Spread rice flour on a rimmed baking sheet. Bake, shaking pan occasionally, until lightly browned, about 15 minutes. Transfer toasted rice flour to a small bowl; set aside.\nRezel Kealoha\nIn a large Dutch oven, heat 2 tablespoons (30ml) oil over medium-high heat until shimmering. Using tongs, add oxtails and cook, turning occasionally, until well browned on all sides, about 15 minutes. Transfer oxtails to plate; set aside.\nRezel Kealoha\nAdd half of the garlic (30g), half of the onion (58g), and scallion trimmings to Dutch oven. Cook, stirring occasionally, on medium-high heat until garlic is golden brown and onions are translucent, about 3 minutes.\nRezel Kealoha\nReturn oxtails to Dutch oven along with 4 quarts (3.8L) water. Bring to boil, cover partially with lid, and cook for 1 1/2 hours, skimming any fat and scum that accumulates on the surface. Lower heat to maintain a simmer, cover, and continue to cook until oxtails are tender, about 3 hours.\nRezel Kealoha\nAdd bok choy and cook until bottoms are translucent, about 2 minutes.\nRezel Kealoha\nUsing tongs, remove bok choy and oxtails and transfer to a large heatproof bowl; set aside. Using an immersion blender, purée the braising liquid in the Dutch oven (if you don’t have an immersion blender, you can transfer liquid to a blender). Strain liquid through a fine-mesh strainer set over a large heatproof bowl; reserve strained liquid (you should have about 3 cups; 710ml).\nRezel Kealoha\nMeanwhile, adjust oven rack to lower-middle position and increase oven temperature to 375°F (190°C). In a large mixing bowl, toss eggplant and beans with 3 tablespoons (45ml) oil and fish sauce. Spread eggplant and beans on rimmed baking sheet and roast until tender, about 15 minutes. Set aside.\nRezel Kealoha\nIn a 4-quart saucepan, heat remaining 1 tablespoon (15ml) oil over medium-high heat until shimmering. Add remaining garlic and onion. Cook, stirring occasionally, until garlic is golden brown and onions are translucent, about 3 minutes.\nRezel Kealoha\nStir in 1 cup (235ml) reserved braising liquid, peanut butter, toasted rice flour, annatto powder, and ginisang bagoong. If you want your sauce to be less viscous, stir in reserved braising liquid in 1/4 cup (60ml) increments to reach desired consistency (save remaining braising liquid for another use). (If you prefer a smooth sauce, use an immersion blender to smooth it out; if you don’t have an immersion blender, you can transfer sauce to a blender).\nRezel Kealoha\nArrange oxtails, bok choy, eggplant, and beans in serving bowls. Spoon sauce on top, then garnish with scallions, peanuts, and fried garlic. Serve with rice and additional ginisang bagoong alongside.\nRezel Kealoha\nSpecial equipment\nLarge\nDutch oven\n, immersion blender, 4-quart saucepan.\nNotes\nIf you want to substitute tripe for oxtails, I recommend using book tripe, not honeycomb tripe; book tripe has a softer yet chewy texture that I prefer. Most tripe is bleached, so before you cook it, rinse it under cold running water.  Once clean, boil the tripe in salted water for 10 minutes. Using tongs, remove the tripe from the water (discard the water) and rinse the tripe under cold running water. In Step 4, add tripe to the Dutch oven and simmer until tripe is tender with a slight chewy bite, between 1 to 2 hours. Proceed with the recipe as directed.\nAvoid using commercial-style peanut butter, which has added sugar, because it will add a noticeable sweetness that doesn't fit the flavor profile of the dish.\nGinisang bagoong is fermented shrimp paste that has been sautéed with onion, garlic, vinegar, and sugar. It can be found in Filipino or Asian specialty markets and online.\nIf you have a pressure cooker or electric multicooker (such as an Instant Pot), you can sear the oxtails and then sauté the garlic, onions, and scallions trimmings in it instead of a Dutch oven; then return oxtails to the cooker and fill with water to the max-fill line. Cook at high pressure for 1 hour and 15 mins.  Proceed with the recipe as directed. This process saves you time, but you’re sacrificing the amount of broth you can keep for future use.\nMake-ahead and Storage\nLeftover braising liquid can be frozen in an airtight container for up to 1 month.\nThe sauce can be refrigerated in an airtight container for up to 3 days or frozen for up to 1 month.\nFilipino\nStovetop Beef\nBeef Mains\nThe Latest"
}