{
  "url": "https://www.seriouseats.com/kasam-sabi-bornean-fermented-mustard-greens-recipe-8610615",
  "image_url": "https://www.seriouseats.com/thmb/0P8T7HB4wzRYdRfPMa2d5Qm_czg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240318-SEA-KasamSabi-AmandaSuarez-12-9b3c669d93c34d52836ca67ba0558ea8.jpg",
  "tags": [
    "Malaysian",
    "The Latest",
    "Fermentation",
    "Vegetables"
  ],
  "title": "Kasam Sabi (Bornean Fermented Mustard Greens)",
  "full_text": "Kasam Sabi (Bornean Fermented Mustard Greens)\nClose\nJump to recipe\nPrep\n15 mins\nFermenting Time\n96 hrs\nTotal\n96 hrs 15 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\n3\nbunches\nmustard green\nleaves (\n14\nounces\n;\n400\ng\n), roots trimmed (if present)\n2\ntablespoons\n(\n18\ng\n) Diamond Crystal\nkosher salt\n, plus more if needed; for table salt, use half as much by volume or the same weight\n1/3\ncup\nwhite medium-grain\nrice\n(\n2 1/2\nounces\n;\n70\ng\n), cooked according to package instructions and cooled to room temperature\nDirections\nIn a large bowl, wash the mustard leaves in several changes of cold water to remove any sand or grit. Using a salad spinner, spin dry.\nSerious Eats / Jordan Provost\nIn a medium bowl, massage the mustard leaves with salt, using your hands to lightly bruise the leaves without tearing them, until the leaves begin to turn limp and juices slowly build up, 3 to 5 minutes. Add the rice and mix well.\nSerious Eats / Jordan Provost\nIn a clean, airtight fermentation vessel, pack in the mustard leaves and their brine while distributing the rice grains evenly throughout. Press down to submerge greens and rice with brine; if there is not enough natural brine to fully cover the solids, make additional brine by dissolving 1 teaspoon (3g) Diamond Crystal kosher salt (or 1/2 teaspoon table salt) in 1 cup (240ml) room temperature water, then pour this brine into the fermentation vessel until there is enough to fully submerge the solids. Press plastic wrap directly on the surface of the mustard greens and their brine to help keep them submerged, weighing it down if necessary, then close container.\nSerious Eats / Jordan Provost\nAllow mustard leaves to ferment at room temperature until the kasam sabi is pleasantly sour and salty, 4 days to 2 weeks (fermentation time can vary depending on the climate); make sure mustard greens remain submerged throughout the fermentation process as exposure to oxygen can lead to spoilage. Signs the ferment has gone wrong include an unpleasant, spoiled aroma, excessive visible mold (small amounts can be scraped off the surface), and any kind of slimy texture. Transfer to the refrigerator and consume within 2 to 3 months.\nSerious Eats / Jordan Provost\nSpecial Equipment\nAirtight food container for fermentation\nNotes\nIn Borneo, the mustard leaves are a variety locally known as ensabi, which has a pungent aftertaste when consumed raw. It’s seldom found outside of Borneo, but you can substitute with any available mustard greens.\nKasam sabi can be used as a condiment to accompany stews or soups, or stir-fried with onions, garlic, and fresh red or green chiles to be eaten as a side with rice.\nMake-Ahead and Storage\nOnce the kasam sabi has fermented, it can be kept in the refrigerator to slow its fermentation for up to 3 months (technically it can last even longer, but its flavor will begin to fade).\nMalaysian\nThe Latest\nFermentation\nVegetables",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kasam-sabi-bornean-fermented-mustard-greens.webp?"
}