{
  "url": "https://www.seriouseats.com/katsu-sando-recipe-8605317",
  "image_url": "https://www.seriouseats.com/thmb/yFSv5Pc60tIvFAEP9hmy1F-gUCk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240308-SEA-KatsuSando-TwoBites-22-91a43cf20b844d90889653c8d552e46b.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Chicken",
    "Japanese",
    "Pork"
  ],
  "title": "Katsu Sando (Japanese Breaded Pork or Chicken Cutlet Sandwich)",
  "full_text": "Katsu Sando (Japanese Breaded Pork or Chicken Cutlet Sandwich)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n20 mins\nTotal\n55 mins\nServes\n2\nMakes\n2 Sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cutlet:\n8\n(1-inch-thick) slices\nday-old Japanese milk bread\n, divided (see note)\n1\nboneless, skinless\nchicken breast\n, about\n8\nounces\n(\n225\ng\n); or\n2\nboneless, skinless chicken thighs\n,\n4 to 5 ounces (110 to 140g) each\n; or\n2\nboneless pork sirloin cutlets\n,\n4 to 5 ounces (110 to 140g) each\nKosher salt\nand\nfreshly ground black pepper\n1\ncup\nall-purpose flour\n(about\n5\nounces\n;\n140\ng\n)\n2\nlarge\neggs\n1\ntablespoon\nwater\n(\n30\nml\n)\nNeutral oil\nsuch as\nvegetable\n,\ncanola\n, or\npeanut oil\n, for frying\nFor the Cabbage:\n2\ncups\nfinely shredded green cabbage\n(about\n4\nounces\n;\n115\ng\n)\n1\ntablespoon\ntoasted sesame seeds\n1\ntablespoon\nKewpie mayonnaise\n, plus extra for serving\n2\nteaspoons\nDijon mustard\n1\nteaspoon\nrice wine vinegar\n1\nteaspoon\nsoy sauce\n1/2\nteaspoon\ntoasted sesame oil\n1/2\nteaspoon\ngranulated sugar\nTo Assemble and Serve:\n4\ntablespoons\nunsalted butter\n(\n28\ng\n), divided\nTonkatsu sauce\n, preferably store-bought (see note)\nDirections\nUsing a sharp or serrated knife, trim ends of 4 pieces of milk bread so that no crust remains; discard trimmings. Cut trimmed bread lengthwise into 1 1/2-inch thick batons. Using a food processor fitted with the grater attachment, process bread into coarse flakes. Transfer fresh panko flakes to a large, shallow bowl or high-rimmed plate and set aside.\nSerious Eats / Two Bites\nIf Using Chicken Breasts:\nSlice breast in half horizontally into 2 thin cutlets. Place them, one at a time, in a heavy-duty zipper-lock bag and pound gently to 1/4-inch thickness using a meat pounder or the bottom of a heavy 8-inch skillet. (See\nthis guide\nfor step-by-step directions.) Season generously with salt and pepper. For best results, let them rest in the refrigerator for at least 4 hours and up to overnight after seasoning. Proceed to step 4.\nIf Using Chicken Thighs or Pork Cutlets\n: Place thighs or cutlets, one at a time, in a heavy-duty zipper-lock bag and pound gently to 1/4-inch thickness using a meat pounder or the bottom of a heavy 8-inch skillet. Season generously with salt and pepper. Proceed immediately to step 4.\nSerious Eats / Two Bites\nFor the Cabbage:\nPlace cabbage in a salad spinner and cover with ice water. Let cabbage sit until crisp, about 20 minutes. Drain cabbage thoroughly and spin until dry.\nSerious Eats / Two Bites\nMeanwhile, in a mortar or suribachi, add sesame seeds and pound until seeds are coarsely ground, about 30 seconds. Transfer seeds to a large bowl and whisk in mayonnaise, mustard, vinegar, soy sauce, sesame oil, and sugar until combined. Transfer cabbage to large bowl with dressing and toss to combine; Set aside.\nSerious Eats / Two Bites\nTo Fry The Cutlets:\nFill a wide, shallow bowl or high-rimmed plate with flour. In a small bowl, whisk eggs and water until smooth, then strain through a fine-mesh strainer into a second shallow bowl or high-rimmed plate. Place flour, egg, and reserved fresh panko next to each other, in order. Working with one thigh or cutlet at a time, dredge in flour with your first hand, shaking off excess. Transfer to egg dish, then turn thigh or cutlet with your second hand to coat both sides. Lift and allow excess egg to drain off, then transfer to fresh panko panko. With your first hand, scoop bread crumbs on top of thigh or cutlet, then gently press, turning to ensure a good layer of crumbs on both sides. Transfer thigh or cutlet to a clean plate and repeat with remaining meat. If this is done properly, your first hand should touch only dry ingredients, while your second hand should touch only wet, making the process less messy.\nSerious Eats / Two Bites\nFill a Dutch oven or wok with 2 inches of oil. Heat over high heat until oil registers 350°F (175°C) on an instant-read thermometer. Set a wire rack on a rimmed baking sheet, line it with paper towels, and set aside.\nSerious Eats / Two Bites\nUsing tongs or your fingers, gently lower cutlets into Dutch oven, laying them down away from you. Fry, gently rotating cutlets for even browning, and adjusting heat as necessary to maintain temperature around 300 to 325°F; 150 to 160°C, until bottom side is set, about 1 1/2 minutes. Gently flip cutlets and fry until second side is set, about 1 1/2 minutes longer. Continue cooking, basting frequently with a large spoon and flipping occasionally, until well browned on both sides, about 3 minutes longer. Transfer to prepared baking sheet to drain and season on both sides with salt. Let rest for 5 minutes.\nSerious Eats / Two Bites\nTo Assemble Sandwiches:\nIn a 12-inch nonstick skillet, melt 2 tablespoons butter over medium heat until just melted. Add 2 slices milk bread and cook, swirling bread around pan frequently, until toasted evenly on one bottom, about 3 minutes. Transfer bread, toasted side up, to cutting board. Repeat with remaining butter and remaining 2 slices of milk bread.\nSerious Eats / Two Bites\nSpread thin layer of mayonnaise (if using) on toasted side of bread slices. Top 2 of the bread slices with one cutlet each and drizzle with tonkatsu sauce. Place a handful of dressed cabbage on the sauced cutlet, making sure to wring excess moisture from cabbage before placing. Top with remaining bread slices, mayo side down. If desired, trim left and right ends from the sandwich, then slice in half. Serve.\nSerious Eats / Two Bites\nSpecial Equipment\nDutch oven or wok, rimmed baking sheet, 12-inch nonstick skillet\nNotes\nIf you can’t find Japanese milk bread, you can substitute it with thick slices of white bread or pain de mie.\nWhile you can certainly\nmake your own tonkatsu sauce\n, many, including myself, would argue that there’s no substitute for Bull-Dog brand sauce.\nIf your food processor does not have a grater attachment, you can simply process the bread using the normal blade. The panko flakes will not be as large, but will still produce a great cutlet.\nMake-Ahead and Storage\nHomemade fresh panko flakes can be refrigerated in an airtight container for up to 5 days.\nSandwiches\nThe Latest\nChicken\nJapanese\nPork"
}