{
  "url": "https://www.seriouseats.com/kaya-toast-recipe-8599165",
  "image_url": "https://www.seriouseats.com/thmb/_plZgEI0v2JPznLAMJRynBzUuuM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240223-SEA-KayaToast-MichelleYip-04hero-d7da174497f64fd196ef1accb85b5e8a.jpg",
  "tags": [
    "The Latest",
    "Breakfast & Brunch",
    "Condiments & Sauces",
    "Breakfast Sandwich",
    "Coconut"
  ],
  "title": "Kaya Toast",
  "full_text": "Kaya Toast\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nTotal\n45 mins\nServes\n1\nMakes\n2 cups kaya\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Kaya:\n4\nlarge\neggs\n1 1/2\ncups\ngranulated sugar\n(\n10 1/2\nounces\n;\n300\ng\n), divided\n1\n(14.5-ounce) can\ncoconut cream\n, such as\nAroy-D\n, stirred\n2\ntablespoons\n(\n30\nml\n)\nunrefined coconut oil\nFor the Kaya Toast:\n2\nslices\nwhite sandwich bread\n, crusts removed and lightly toasted\n2\ntablespoons\n(\n30\nml\n)\nkaya\n,\nhomemade\nor\nstore-bought\n, room temperature\n4\ntablespoons\ncold salted butter\n(\n56\ng\n;\n2\nounces\n), sliced into 1/8-inch thick slabs\n2\nsoft boiled-eggs\n(optional, for serving)\nHot coffee\n(optional, for serving)\nDirections\nIn a medium bowl, whisk eggs. Strain eggs through a fine-mesh sieve into a large metal heat-proof bowl, and whisk in 1 cup 3 tablespoons (240g) granulated sugar until well incorporated.\nSerious Eats / Michelle Yip\nSet the bowl over a pot of simmering water; cook, and, using a whisk or flexible spatula, stir gently and constantly, until the mixture reaches 176ºF (80ºC) and begins to set and resemble a thick pancake batter, 12 to 18 minutes.\nSerious Eats / Michelle Yip\nStir in coconut milk and continue to cook, stirring gently, until the mixture reaches at least 176ºF (80°C), 10 to 12 minutes longer. Remove from heat and stir occasionally to prevent kaya from overcooking.\nSerious Eats / Michelle Yip\nIn a small saucepan set over low heat, sprinkle remaining 1/4 cup plus 2 teaspoons (60g) sugar in an even layer and cook, undisturbed, until sugar has melted and is a dark amber color, about 6 minutes. Add coconut oil and, using a clean, dry whisk, stir continuously until smooth.\nSerious Eats / Michelle Yip\nPour coconut oil syrup into the kaya mixture and stir well to combine, making sure to quickly and constantly whisk to prevent the caramel from scrambling the eggs in the custard. Continue cooking kaya until it reaches 176ºF (80ºC). Remove kaya from heat and, using a fine-mesh sieve, strain cooked kaya into heat-proof jars, let cool, and refrigerate.\nSerious Eats / Michelle Yip\nFor the Kaya Toast:\nUsing a butter knife or offset spatula, spread about 1 tablespoon of kaya over each slice of toast. Place 2 thin slabs of cold salted butter on one of the slices, and close the sandwich. Slice the toast sandwich lengthways and serve immediately with strong hot coffee or milk tea.\nSerious Eats / Michelle Yip\nSpecial Equipment\nFine-mesh sieve, metal heat-proof bowl, instant-read thermometer, whisk, butter knife or offset spatula\nMake-Ahead and Storage\nThe kaya can be refrigerated for about 2 weeks. We do not recommend freezing kaya jam. Kaya toast sandwiches should be eaten immediately.\nThe Latest\nBreakfast & Brunch\nCondiments & Sauces\nBreakfast Sandwich\nCoconut"
}