{
  "url": "https://www.seriouseats.com/kenyan-njahi-in-coconut-sauce-5180229",
  "image_url": "https://www.seriouseats.com/thmb/IPYzGkUyA9AfLB3oMgJOoim2kTY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210420-njahi-beans-coconut-sauce-vicky-wasik-27-73d6e6fd551640a58399cecb31f2a7c8.jpg",
  "tags": [
    "Black Beans",
    "Beans Sides",
    "East African",
    "Coconut Milk & Cream",
    "Vegetarian Sides"
  ],
  "title": "Njahi (Kenyan Black Beans) in Coconut Sauce",
  "full_text": "Njahi (Kenyan Black Beans) in Coconut Sauce\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 40 mins\nSoaking Time\n8 hrs\nTotal\n10 hrs 45 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n13\nounces\n;\n370\ng\n)\nnjahi beans\n(see note)\nDiamond Crystal kosher salt\n1/4\ncup\n(\n60\nml\n)\nneutral oil\nsuch as\navocado oil\n, plus more if needed\n1/2\nmedium\nred onion\n(\n5\nounces\n;\n150\ng\n), finely diced\n1/2\nlarge\ngreen bell pepper\n(\n4\nounces\n;\n110\ng\n), stemmed, seeded, and finely diced\n6\nmedium\ngarlic cloves\n, thinly sliced\n4\nscallions\n, ends trimmed and thinly sliced\n1\n(1-inch piece)\nginger\n(\n1/3\nounce\n;\n10\ng\n), peeled and minced\n1\nteaspoon\ncumin seeds\n3\ntablespoons\n(\n40\ng\n)\ntomato paste\n2\nteaspoons\ngaram masala\n1\njalapeño\n, stemmed, seeded, and minced\n1\nteaspoon\nground paprika\n1/2\nteaspoon\nground turmeric\n1\n(13.5-ounce; 400 ml) can\ncoconut milk\n1/4\ncup\nroughly chopped cilantro leaves\nand\ntender stems\nDirections\nIn a large bowl, combine the beans with 2 tablespoons kosher salt. Cover with about 4 cups (1L) water and soak at room temperature until beans swell, about 8 hours or overnight. Once the beans have soaked overnight, they will turn from black to dark brown.\nVicky Wasik\nDrain beans and rinse well under cold running water. Transfer the beans to a large pot or Dutch oven, and cover with at least 2 inches fresh water. Set over high heat and bring to a boil. Cook the beans at a hard boil for 10 minutes, then lower the heat to a gentle simmer and cook, uncovered and stirring occasionally, until the beans are tender, 1 1/2 to 4 hours (our tests revealed a wide range of cooking times for the njahi beans, likely dependent on source and age). Skim any scum that accumulates on the surface. Keep an eye on the water level, adding more water if it gets too low.\nVicky Wasik\nStrain beans, reserving at least 2 cups (475ml) of the cooking liquid. Lightly wash pot.\nVicky Wasik\nIn the same pot, heat the oil over medium-high heat until fragrant and shimmering. Add the onions and bell pepper and cook, stirring, until the onions have softened, about 4 minutes.\nAdd the garlic, scallions, ginger, and cumin seeds and cook, stirring, until fragrant, about 2 minutes.\nVicky Wasik\nStir in the tomato paste, garam masala, jalapeño, paprika, ground turmeric, and 1 teaspoon salt, and cook until the tomato paste darkens, about 2 minutes.\nSlowly stir in the coconut milk until well combined. Add the cooked beans and 1 cup (235ml) of the reserved cooking liquid. Season generously with salt. Bring to a simmer, lowering heat to maintain simmer, and cook, uncovered, until beans are suspended in a creamy sauce, 30 minutes to 1 hour.\nVicky Wasik\nRemove from heat, stir in cilantro, and serve.\nVicky Wasik\nNotes\nNjahi can be purchased online or at specialty grocery. If you can't find njahi beans, you can substitute black beans, but reduce the bean cooking liquid added in Step 7 to 1/2 cup (120ml), adding additional bean cooking liquid a few tablespoons at a time only if the stew becomes too thick (this is because black beans can produce a thinner broth than njahi beans, and thus usually require less liquid to reach the final creamy consistency).\nBlack Beans\nBeans Sides\nEast African\nCoconut Milk & Cream\nVegetarian Sides"
}