{
  "url": "https://www.seriouseats.com/kerabu-malaysian-vegetable-salad-recipe-8547064",
  "image_url": "https://www.seriouseats.com/thmb/SA8FCNm18jVkDHEkgB0TiSAVtfg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-Kerabu-MichelleYip-01-c599e231fd1242ccbb52a1cfa1388539.jpg",
  "tags": [
    "Green Salads",
    "The Latest",
    "Malaysian"
  ],
  "title": "Kerabu (5-Ingredient Malaysian Vegetable Salad)",
  "full_text": "Kerabu (5-Ingredient Malaysian Vegetable Salad)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nTotal\n35 mins\nServes\n4 side dish servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Kerisik:\n18\nounces\n(\n500\ng\n)\nfresh grated coconut\nor\n10\nounces\n(\n300\ng\n)\nfinely shredded unsweetened desiccated coconut\nFor the Kerabu:\n2\ncups\nvegetable of choice\n, such as\nwinged beans\n,\nwater celery\n,\nlong beans\n, or\nwatercress\n, cleaned and chopped into bite-sized pieces\n2\nshallots\n, peeled and thinly sliced (\n1\nounce\n;\n30\ng\n)\n1\ntablespoon\nsambal belacan\n1\ntablespoon\n(\n15\nml\n)\ncalamansi\nor\nPersian lime juice\n, plus more as needed\nDirections\nFor the Kerisik:\nIn a dry skillet or wok, add the grated or desiccated coconut and set over medium heat. Toast coconut, stirring continuously, until it reaches the desired color, anywhere between light tan to chocolate brown; it will take between 40-60 minutes to toast fresh grated coconut, or 10-40 minutes for desiccated coconut. Remove from heat and set aside to cool. If making a darker kerisik: Transfer the cooled toasted coconut to a mortar and pestle, spice grinder, or food processor, and pound or process until it becomes a powder.\nSerious Eats / Michelle Yip\nFor the Kerabu:\nHeartier vegetables like beans or water celery are best if blanched, while leafy vegetables are often better left raw. If blanching the vegetables: In a large saucepan, bring 4 cups (1 quart/1L) water to a boil over high heat. Add chopped vegetables and cook until crisp-tender, about 30 seconds (time will vary depending on the vegetable being cooked). Strain vegetables and set aside to cool.\nSerious Eats / Michelle Yip\nIn a large mixing bowl, add the vegetables (blanched or raw), sliced shallots, sambal belacan, lime juice, and 1 tablespoon kerisik and stir to combine. Taste for balance: It should have the crunch of the vegetables, the astringency of the shallots, the spice and savoriness of the sambal belacan, the smoky sweetness of the kerisik, and the bright acidity of the lime. Add more sambal belacan, kerisik, or lime if needed and mix well. Serve.\nSerious Eats / Michelle Yip\nSpecial Equipment\nMortar and pestle or spice grinder or food processor\nNotes\nWater celery or minari is available at Korean marts. Fresh grated coconut and winged bean (also called goa bean) can be found in specialty Asian markets. Desiccated coconut is usually available at baking supply stores.\nMake-Ahead and Storage\nDark toasted kerisik can last up to a month in the fridge if stored carefully. It also freezes well for up to 6 months. Prepared kerabu, depending on the vegetable used, can last up to 2 days in the fridge.\nGreen Salads\nThe Latest\nMalaysian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kerabu-5-ingredient-malaysian-vegetable-salad.webp?"
}