{
  "url": "https://www.seriouseats.com/kettle-corn-recipe-8717685",
  "image_url": "https://www.seriouseats.com/thmb/DDn8PaBuGFjENU8n-3TqWJdA5CQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240924-SEA-KettleCorn-MorganHuntGlaze-Hero-58-3703669624054975aa4b3bc60d374420.jpg",
  "tags": [
    "Corn",
    "The Latest",
    "Popcorn"
  ],
  "title": "Kettle Corn Recipe",
  "full_text": "Kettle Corn Recipe\nClose\nJump to recipe\nCook\n5 mins\nCooling Time\n5 mins\nTotal\n10 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(60ml) neutral oil such as vegetable or canola\noil\n1/2\ncup\nmushroom popcorn\nkernels\n(4 ounces; 113g) , divided (see note)\n3\ntablespoons\ngranulated sugar\n3/4\nteaspoon\nDiamond Crystal\nkosher salt; for table salt use half as much by volume\nDirections\nLine a large rimmed baking sheet with parchment paper; set aside. Add oil and 2 individual corn kernels to a wide 6-quart heavy-bottomed pot of Dutch oven, cover with a lid, preferably clear. Heat over medium-high heat, without moving or lifting lid, until both kernels pop and oil is hot (around 390°F), 3 to 4 minutes.\nSerious Eats / Morgan Hunt Glaze\nAdd remaining corn kernels to pot, and gently stir to coat all kernels; sprinkle sugar and salt over kernels and gently stir to evenly coat. Cover with a lid, keeping lid slightly ajar by about 1/2 inch. Swirl the pot to move kernels around, lifting and swirling pot every 2 to 3 seconds until sugar is melted and kernels start to pop, 4 to 5 minutes. Once kernels begin to pop frequently, continue shaking pot, holding lid on tightly (but still slightly ajar), every 4 to 5 seconds, until popping slows down to 2- to 3-second intervals, 2 to 3 minutes total time.\nSerious Eats / Morgan Hunt Glaze\nRemove pot from heat; vigorously shake pot, holding lid on tightly. Let stand for a few seconds until popping stops. Pour popcorn onto the prepared baking sheet. Let cool for 5 minutes before transferring to a bowl and serving.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nLarge rimmed baking sheet with parchment paper, 6-quart heavy bottomed pot or Dutch oven\nNotes\nMushroom popcorn has a round and compact shape that closely resembles a mushroom cap. If unavailable, this recipe will still work with any variety of popcorn kernels, though you might need to adjust the cook time slightly.\nMake-Ahead and Storage\nThe prepared kettle corn can be stored in an airtight container at room temperature for up to 2 days.\nCorn\nThe Latest\nPopcorn",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kettle-corn-recipe.webp?"
}