{
  "url": "https://www.seriouseats.com/key-lime-pie-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zQZUYiDIX01cuYx9XtYM1_raJrY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120529-127677-LTE-Key-Lime-Cake-PRIMARY-175ce5202ad74b4bb4424b0b9a2fb51b.jpg",
  "tags": [
    "Cakes",
    "Summer Desserts"
  ],
  "title": "Key Lime Pie Cake Recipe",
  "full_text": "Key Lime Pie Cake Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n60 mins\nActive\n60 mins\nCooling and Chilling Time\n3 hrs 30 mins\nTotal\n4 hrs 55 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nBaking spray\n2 1/4\ncups\n(about\n11 1/4\nounces\n)\nall-purpose flour\n2\nteaspoons\nbaking powder\n1\nteaspoon\nbaking soda\n3/4\nteaspoon\nsalt\n1\ncup\nbuttermilk\n, at room temperature\n2\nteaspoons\npure\nvanilla extract\n2\nsticks\n(\n8\nounces\n)\nunsalted butter\n, at room temperature\n3\nlarge eggs\n, at room temperature\n1 3/4\ncups\n(about\n12 1/4\nounces\n)\ngranulated sugar\nFor the Graham Cracker Crunch:\n1 1/4\ncups\ngraham cracker crumbs\n2\nounces\n(\n1/2\nstick\n)\nunsalted butter\n, melted and slightly cooled\n1/4\ncup\n(about\n1 3/4\nounces\n) packed\nlight brown sugar\n1/4\nteaspoon\nsalt\nFor the Key Lime Icing:\n1/2\ncup\n(about\n3 1/2\nounces\n)\ngranulated sugar\n6\nlarge\negg yolks\n, at room temperature\n1/8\nteaspoon\nsalt\n2\ntablespoons\nfinely grated\nzest\nand\n3/4\ncup\njuice\nfrom\n12\nwhole\nKey limes\nor\n8\nlimes\n1\n(14-ounce) can\nsweetened condensed milk\n1\n(.25-ounce) package\nunflavored gelatin\n3\ntablespoons\nwater\n2\nounces\ncream cheese\n, at room temperature\n2\ntablespoons\nconfectioners sugar\n1/2\ncup\nheavy cream\nDirections\nFor the Cake:\nAdjust oven rack to middle positions and preheat oven to 350°F. Coat 13- by 9-inch baking pan with baking spray. Whisk flour, baking powder, baking soda, and salt together in medium bowl; reserve. Combine buttermilk and vanilla in glass measuring cup; reserve.\nBeat butter and sugar on medium speed until light and fluffy, about 2 minutes. Add eggs, one at a time, beating well after each addition. Decrease speed to low; add flour mixture in three additions, alternating with buttermilk mixture, scraping down sides and bottom of bowl as necessary. Scrape batter into prepared pan.\nBake until tester inserted in center of cakes comes out clean, about 30 minutes. Transfer cake to cooling rack and cool completely in pan, 1 hour.\nFor the Graham Cracker Crunch:\nAdjust oven rack to middle position and preheat oven to 350°F. Line of 8- by 8-inch cake pan foil, allowing some excess to hang over sides. Combine cracker crumbs, melted butter, brown sugar, and salt in medium bowl, stirring until crumbs are thoroughly saturated with butter. Press onto bottom of prepared cake pan.\nBake until golden, 10 to 12 minutes. Transfer to cooling rack and cool completely, 15 to 20 minutes. Break into irregular pieces.\nFor the Key Lime Icing:\nWhisk sugar, egg yolks, and salt together in medium heavy-bottomed saucepan until thick and pale. Add lime zest and juice and cook over medium heat, whisking constantly, until thickened and the consistency of pudding, 8 to 10 minutes.\nRemove from heat and whisk in sweetened condensed milk. Place a piece of plastic wrap directly on the surface of the curd and cool completely, about 1 hour. Alternatively, place the curd in an ice bath and whisk until cooled, about 10 minutes. Curd may be prepared up to 2 days in advance and refrigerated in an airtight container.\nCombine gelatin and water in small bowl and allow to soften, about 5 minutes. Microwave 45 seconds and allow to cool to room temperature, 5 to 7 minutes.\nBeat cream cheese and confectioners’ sugar on medium speed until light and fluffy, about 2 minutes. Add gelatin and beat to combine, about 30 seconds. Add cream and beat to soft peaks, about 2 minutes. Add curd and beat to combine, about 30 seconds.\nTo Assemble:\nSpread Key lime topping evenly over cake. Sprinkle with graham cracker crunch. Refrigerate for 1 hour to allow to set. Serve.\nSpecial equipment\n13- by 9-inch cake pan, electric mixer, rubber spatula, cooling rack, medium heavy-bottomed saucepan, whisk, 8- by 8-inch baking pan\nCakes\nSummer Desserts"
}