{
  "url": "https://www.seriouseats.com/khao-soi-gai-northern-thai-coconut-curry-noodle-soup-recipe-laksa",
  "image_url": "https://www.seriouseats.com/thmb/5JLA8LFACf__s-k522KVYDw4qD0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/khao-soi-gai-northern-thai-coconut-curry-noodle-soup-recipe-laksa-hero-whitebowl-58fb7baced8f4949a995dc61d2dc3e3b.JPG",
  "tags": [
    "Thai",
    "Braised & Stewed Chicken",
    "Coconut Milk & Cream",
    "Egg Noodles",
    "Chicken Mains"
  ],
  "title": "Real-Deal Khao Soi Gai (Northern Thai Coconut Curry Noodle Soup With Chicken) Recipe",
  "full_text": "Real-Deal Khao Soi Gai (Northern Thai Coconut Curry Noodle Soup With Chicken) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nActive\n45 mins\nTotal\n90 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmall bunch\ncilantro stems\n, leaves and thin stems reserved for another use\n2\nwhole\nsmall\nshallots\n, peeled and sliced into quarters\n4\nwhole\ncloves\ngarlic\n1\n(1-inch) knob\nfresh turmeric\n, roughly chopped\n2\nthin slices\nfresh ginger\n1\nstalk\nlemongrass\n, bottom 4 inches only, roughly chopped\n1\nwhole\ndried Thai bird chile\n(or\n1\nwhole\nchile de arbol\n), more or less to taste\n1\nteaspoon\nmakrut lime zest\n, or\n2\nwhole\nmakrut lime leaves\n(see note)\n1\nteaspoon\nwhole coriander seed\n6\npods\nThai black cardamom\nor\n1\npod\ngreen cardamom\n, inner seeds only\nKosher salt\n1 1/2\ntablespoons\nThai shrimp paste\n1\ncup\nvegetable\nor\ncanola oil\n1\npound\nfresh Chinese-style egg noodles\n, divided\n2\n(15-ounce) cans\ncoconut milk\n, or\n2\ncups\nfresh coconut milk\n(do not shake)\n1\ncup\nhomemade\nor\nstore-bought low-sodium chicken stock\n2\ntablespoons\npalm sugar\n(see note)\n4\nchicken legs\n, split into drumsticks and thighs\nFish sauce\n, to taste\nSliced shallots\n,\nlime wedges\n, and\npickled Chinese mustard greens\n(see note), for serving\nDirections\nPlace cilantro stems, shallots, garlic, turmeric, ginger, lemongrass, chile, lime zest, coriander seed, and cardamom in the center of a 12- by 12-inch square of heavy-duty aluminum foil. Gather up edges to make a tight pouch. Place pouch directly over the flame of a gas burner and cook, turning occasionally, until aromatic and wisps of smoke begin to rise, about 8 minutes. If no gas burner is available, place the pouch in the bottom of a wok or cast iron skillet and heat over high heat, turning occasionally, until smoky, about 10 minutes. Allow contents to cool slightly and transfer to a large mortar and pestle.\nSerious Eats / Qi Ai\nAdd a large pinch of salt to the aromatics. Pound until a very fine paste is formed, about 10 minutes. Add shrimp paste and pound to incorporate. Set curry paste mixture aside.\nSerious Eats / Qi Ai\nSeparate out 1/4 of the noodles (enough noodles to make a crispy fried-noodle topping for 4 bowls) and set the remaining noodles aside. Heat vegetable oil in a large wok over high heat until shimmering. Working in batches, add noodles to oil and fry, stirring and flipping until golden brown and crisp. Transfer to a paper towel-lined plate. Season with salt and set aside.\nSerious Eats / Qi Ai\nDiscard all but 1 tablespoon oil from wok. Using a spoon, skim 2 tablespoons of creamy fat off the top of the coconut milk and add to the wok. Heat wok over high heat and cook, stirring constantly, until coconut milk breaks and oil begins to lightly smoke, about 2 minutes. Add curry paste mixture and cook, stirring and smearing the paste into the oil, until aromatic, about 45 seconds.\nSerious Eats / Qi Ai\nSlowly stir in the coconut milk, followed by the chicken stock and palm sugar. Add chicken legs and bring to a simmer. Cook, turning chicken occasionally, until chicken is tender and broth is very flavorful, about 30 minutes. Season to taste with fish sauce.\nSerious Eats / Qi Ai\nBring a pot of salted water to a boil. Add remaining uncooked noodles and cook until al dente, about 1 minute. Drain noodles and divide between four warmed bowls. Top noodles with two pieces of chicken. Divide broth evenly between bowls. Top with fried noodles and serve immediately with sliced shallots, lime wedges, and pickled mustard greens on the side.\nSerious Eats / Qi Ai\nSpecial Equipment\nWok\n,\nmortar and pestle\nNotes\nMakrut lime and palm sugar can be found in Asian specialty grocers or some high-end supermarkets. If palm sugar can't be found, brown sugar can be used in its place. If makrut lime can't be found, omit. Pickled mustard greens can be found in most Chinese markets.\nRead More\nFour Essential Northern Thai Dishes to Make Right Now\nThai\nBraised & Stewed Chicken\nCoconut Milk & Cream\nEgg Noodles\nChicken Mains"
}