{
  "url": "https://www.seriouseats.com/khao-piak-sen-lao-chicken-noodle-soup",
  "image_url": "https://www.seriouseats.com/thmb/RD66WCnAomxAw6BrlTrPuCr4O_U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190718-Khao-piak-sen-laotian-noodle-soup-liz-clayman-25-9ed0f66181f440bdacbd24f99bb852c5.jpg",
  "tags": [
    "Southeast Asian",
    "Noodles",
    "Whole Chicken",
    "Ginger",
    "Lemongrass"
  ],
  "title": "Khao Piak Sen (Lao Chicken Noodle Soup) Recipe",
  "full_text": "Khao Piak Sen (Lao Chicken Noodle Soup) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n3 hrs\nActive\n3 hrs 30 mins\nTotal\n3 hrs 15 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Fried Garlic and Shallot:\n1\ncup\n(\n240\nml\n)\nvegetable oil\n24\ncloves\ngarlic\n(\n120\ng\n), sliced thinly crosswise, preferably with a\nmandoline\n3\nmedium\nshallots\n(\n150\ng\n), sliced thinly crosswise into rounds, preferably with a mandoline\nFor the Broth and Chicken:\n1\nmedium\nyellow onion\n(\n10\nounces\n;\n280\ng\n), peeled and quartered through the root end\n3\nlarge knobs\nginger\n(\n3\nounces\n;\n90\ng\n), peeled and sliced crosswise into 1/4 inch thick rounds\n3\ntablespoons\n(\n45\nml\n)\ngarlic and shallot oil\n, from above\n1\nstalk\nlemongrass\n(\n2 3/4\nounces\n;\n80\ng\n), outer layer discarded then roughly chopped\n6\nmedium\ncloves garlic\n(\n1\nounce\n;\n30\ng\n), peeled and thinly sliced crosswise\n5\nmakrut lime leaves\nStems\nfrom\n1\nbunch\ncilantro\n(\n2\nounces\n;\n60\ng\n), chopped (see note)\n1\n(3- to 4-pound; 1.3 to 1.8 kg)\nwhole chicken\n, blotted dry (see note)\n2\ntablespoons\nkosher salt\n(\n3/4\nounce\n;\n25\ng\n), plus more as needed\n2\ntablespoons\nsoy sauce\n(\n1\nounce\n;\n30\ng\n)\n2\ntablespoons\nAsian fish sauce\n(\n1\nounce\n;\n30\ng\n)\n1\nteaspoon\nsugar\nFor the Noodles:\n7\nounces\n(\n200\ng\n) plus\n3/4\nounce\n(\n20\ng\n)\nwhite rice flour\n, divided (see note)\n7\nounces\n(\n200\ng\n) plus\n3/4\nounces\n(\n20\ng\n)\ntapioca flour\n, divided\n1 3/4\ncups\n(\n415\nml\n)\nboiling water\nTo Finish and Serve the Soup:\n2\nscallions\n, sliced thinly on the bias\n2\nfresh bird’s eye chiles\n, stemmed and minced\n5\nsprigs\nmorning glory\n, pulled through a morning glory shredder (optional; see note)\nLime wedges\nFried garlic\n, from above\nFried shallots\n, from above\nPicked cilantro leaves\nand\ntender stems\nDirections\nFor the Fried Garlic and Shallot:\nLine a plate with paper towels and set a fine-mesh strainer over a medium heatproof bowl. In a medium frying pan, heat oil over medium heat until shimmering. Add garlic and fry, swirling and stirring frequently, until golden brown all over, approximately 4 minutes. Pour garlic and oil into prepared strainer and allow to drain. Transfer garlic to the prepared paper towels, spreading it out in an even layer, and allow to drain further.\nReturn oil to pan, then set fine-mesh strainer over the same heatproof bowl. Line a second plate with clean paper towels.\nAdd shallots to pan and cook over high heat, stirring frequently, until shallots begin to bubble, about 1 minute. Continue cooking, stirring constantly as the shallots fry to ensure even cooking, until shallots turn pale golden brown, about 3 minutes longer. Working quickly, pour contents of saucepan into strainer set over bowl. (Shallots will continue cooking for a brief period after draining, so do not allow them to get too dark.) Reserve garlic-shallot oil.\nFor the Broth and Chicken:\nIf desired, grill or sear (in a cast iron pan without oil) two of the onion quarters and two-thirds of the sliced ginger until well charred, about 2 minutes per cut side (this will add depth and complexity to the broth, but is optional).\nSerious Eats / Liz Clayman\nRoughly chop all of the onion and ginger, whether charred or not.\nIn a large 8-quart Dutch oven or soup pot, heat garlic-shallot oil over medium heat until shimmering. Add chopped onion and ginger, lemongrass, sliced garlic, lime leaves, and cilantro stems. Season lightly with salt, then cook, stirring, until onions are softened, about 7 minutes.\nSerious Eats / Liz Clayman\nAdd chicken to pot and top with at least 5 quarts (5L) cold water, or enough to cover. Add the 2 tablespoons kosher salt along with the soy sauce, fish sauce, and sugar. Bring to a simmer, then lower heat to maintain a gentle simmer. Cook, covered, for 2 hours, lifting lid occasionally to skim the surface of broth of any foam or scum that accumulates.\nSerious Eats / Liz Clayman\nCarefully remove chicken from the pot and transfer to a work surface (it may fall apart after this long cooking; simply fish out all the parts and bones). When cool enough to handle, pull meat from bones and shred with your hands or a fork. Discard bones and skin. Reserve chicken meat.\nSerious Eats / Liz Clayman\nMeanwhile, bring broth to a rolling boil and cook, uncovered, for 30 minutes. Strain broth, discarding solids, then return to cleaned pot. Season with salt.\nFor the Noodles:\nWhile the broth simmers, make the noodles. In a stand mixer fitted with the dough hook, add 7 ounces rice flour and 7 ounces tapioca flour. Turn mixer to medium-low speed and drizzle in boiling water. Continue to mix, pausing occasionally to scrape down the sides with a flexible spatula, until a moist dough ball forms, about 3 minutes.\nSerious Eats / Liz Clayman\nWhisk together remaining rice and tapioca flours, then sprinkle on a work surface. Turn dough ball out onto floured work surface. Knead dough by hand until all of the flour on the board has been fully incorporated into a supple dough, about 4 minutes.\nRoll dough into a thick log and divide into 8 equal portions. Roll each portion into a small ball, then flatten with the palm of your hand.\nSerious Eats / Liz Clayman\nWorking one dough disc at a time, and keeping the remainder covered with a kitchen towel to prevent drying, roll using a rolling pin until roughly 1/8 inch thick and about 6 inches long.\nSerious Eats / Liz Clayman\nUsing a sharp knife, slice into noodles roughly 1/4 inch wide. Transfer to a rimmed baking sheet, dusting and tossing gently with rice flour to prevent sticking. Keep noodles covered with a damp towel so they don’t dry out. Repeat with remaining dough.\nTo Finish and Serve the Soup:\nAdd noodles to boiling finished broth and cook, stirring very minimally to prevent them from breaking (they're brittle until they cook through), until noodles float to the surface, 1 to 2 minutes.\nSerious Eats / Liz Clayman\nTransfer noodles to soup bowls. Add shredded chicken to each bowl. Ladle broth into bowls. Serve hot, allowing diners to garnish their soup with scallions, chiles, morning glory (if using), lime, fried garlic, fried shallots, and cilantro leaves and tender stems.\nSpecial Equipment\nStand mixer\n,\nscale\n,\nfine-mesh strainer\n,\n8-quart Dutch oven\nor\nsoup pot\n, morning glory shredder (optional)\nNotes\nIf you can find it, you can also use cilantro roots. An old hen, if you can find it, works well in this recipe; otherwise, any whole chicken will be good.\nThis recipe uses finely milled white rice flour, commonly found in Asian grocery stores. These are different than those available at most chain grocery stores, such as Bob’s Red Mill, because the finer rice flour is much more absorbent. If you are using a brand such as Bob’s Red Mill, add an additional 30g of rice flour to the original mixture and increase the amount of both rice flour and tapioca flour for the second step of the kneading process to 50g.\nMorning glory, also known as\nwater spinach\n, can be found at Asian markets.\nMake-Ahead and Storage\nThe fried garlic and shallots and the broth can be made up to five days in advance; refrigerate the broth until ready to use, and keep the fried garlic and shallots in airtight containers at room temperature.\nThe noodles can be frozen for up to one month: To freeze, arrange in thin, even layers on parchment on a rimmed baking sheet, stacking more parchment between each layer; wrap well in plastic, then freeze. To cook frozen noodles, place directly into boiling broth without thawing and let cook 1 to 2 minutes longer than fresh noodles until they float to the surface.\nRead More\nLao Food 101: Essential Dishes From Laos and Isan\nSoutheast Asian\nNoodles\nWhole Chicken\nGinger\nLemongrass",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/khao-piak-sen-lao-chicken-noodle-soup-recipe.webp?"
}