{
  "url": "https://www.seriouseats.com/khoresh-e-bademjan-persian-meat-and-eggplant-stew-recipe-8422715",
  "image_url": "https://www.seriouseats.com/thmb/k7DmJzzgr5vRP_y-QxtM7PUxEQ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-Khoresh-e-Bademjan-NaderMehravari-30-3e7ce98fb5df49cbbe26089eb3f53c1f.jpg",
  "tags": [
    "Lamb Mains",
    "The Latest",
    "Braised & Stewed Lamb",
    "Middle Eastern"
  ],
  "title": "Khoresh-é-Bādemjan (Persian Meat and Eggplant Stew)",
  "full_text": "Khoresh-é-Bādemjan (Persian Meat and Eggplant Stew)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs\nTotal\n2 hrs 5 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n60\nml\n) olive or vegetable\noil,\ndivided, plus oil for frying the eggplant and optional tomato pieces\n2\npounds\n(\n900\ng)\nlong, slender\neggplant\n, trimmed, peeled, and halved lengthwise (see notes)\n1\npound\n(\n450\ng\n) boneless leg of\nlamb\n, shoulder, neck or shank, or stewing beef, cut in 1- to 1 1/2-inch chunks\n1\nteaspoon\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nfreshly\nground black pepper\n1\nsmall\nyellow onion\n(about\n4\nounces\n;\n114\ng\n), cut into 1/4-inch dice\n1\nteaspoon\nground turmeric\n3\ntablespoons\n(\n45\ng\n)\ntomato paste\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice,\nplus extra to taste\n1\nmedium\ntomato,\ncored and into 3 round slices (optional)\nDirections\nSet a wire rack in a rimmed baking sheet and line with a triple layer of paper towels. Fill a 12-inch cast-iron skillet 1/4 inch deep with oil, then heat over medium-high heat until oil is shimmering but not smoking. Working in batches to prevent crowding the skillet, carefully add eggplant slices, cut side down, and fry, lowering the heat as needed to prevent the oil from smoking and flipping once halfway through, until eggplant is dark golden brown on both sides, about 10 minutes. Transfer eggplant to prepared wire rack. Repeat with remaining eggplant, topping up with additional oil if needed. Set cooked eggplant aside.\nSerious Eats / Nader Mehravari\nIn a Dutch oven, heat oil over medium-high heat until shimmering. Season meat evenly with the salt and pepper and add to the saucepan in a single layer. Cook, turning occasionally, until meat is well browned on all sides, about 10 minutes. With a slotted spoon, transfer meat to a plate and set aside.\nSerious Eats /  Nader Mehravari\nHeat remaining fat in the Dutch oven over medium heat until shimmering, and add chopped onion. Cook until the onion is softened and golden brown, 5 to 7 minutes.\nSerious Eats / Nader Mehravari\nStir in turmeric and cook until aromatic,  30 seconds. Stir in tomato paste and cook until well incorporated and beings to darken in color, 1 minute longer.\nSerious Eats /  Nader Mehravari\nAdd 2 cups water and bring to a boil over medium-high heat. Scrape the bottom of the saucepan to free up any brown bits stuck to the bottom. Stir in the meat and return to a boil, then cover, reduce heat to medium-low, and cook for 10 minutes.\nSerious Eats /  Nader Mehravari\nRemove the lid and give the contents a gentle stir. Adjust the heat as needed to maintain a gentle simmer. Cover and cook for 30 minutes. Stir in lemon juice.\nSerious Eats /  Nader Mehravari\nGently arrange the eggplant halves on top of the meat in an even layer, overlapping if needed. Using a spatula, gently press down on the eggplant and carefully shake the pot in a swirling motion to submerge the eggplant into the braising liquid (you don’t want to break the eggplant pieces by stirring them in). Cover and continue cooking at a gentle simmer for 30 minutes longer, swirling the pot every 10 minutes.\nSerious Eats /  Nader Mehravari\nMeanwhile, in a small skillet, heat 1 1/2 teaspoons oil over medium heat until shimmering, then cook the tomato slices until limp, about 5 minutes.\nSerious Eats /  Nader Mehravari\nSeason with additional salt or lemon juice, if desired (Persian dishes are often more sour than salty, though feel free to follow your personal preferences). Gently transfer the finished braise to a serving dish. (Rather than spooning it in, which can break up the eggplant too much, I usually tip the pot carefully over the edge of the serving dish so that the contents can slowly slide into it.) Garnish with tomato slices and serve.\nSerious Eats /  Nader Mehravari\nNotes\nI prefer to use slender, purple-hued eggplant. Thin eggplants labeled as Japanese eggplant or Chinese eggplant will both work well in this recipe. You may substitute fatter round eggplants such as globe eggplant; if using this type, slice them into 1-inch-thick (2cm) disks for frying.\nIf you own an electric griddle, you can use it to fry the eggplant slices. With its large surface area, the griddle allows you to fry in fewer batches than a cast-iron pan, and I have found that it uses less oil and gives results that are just as good.\nAll braising times given above are sufficient to result in a well “ja-oftādeh” (integrated) authentic khoresh-é-bādemjan. However, with this dish, you won’t go wrong if you let it simmer, covered, over very low heat, for another 30 minutes or more; it will simply get more flavorful.\nMake-Ahead and Storage\nLike many other Persian khoreshes, khoresh-é-bādemjan can be made a day or two ahead of time and reheated gently.\nPan-fried eggplants freeze quite well as long as they are stored in an airtight container. Whenever I see good-quality skinny eggplants at a reasonable price, I buy several pounds, pan-fry them, and store them in 1-pound portions in freezer bags for making this or other eggplant-based dishes later.\nKhoresh-é-bādemjan is extremely leftover-friendly. Store any leftovers in an airtight container in the refrigerator for up to a week or in the freezer for up to three months.\nLamb Mains\nThe Latest\nBraised & Stewed Lamb\nMiddle Eastern"
}