{
  "url": "https://www.seriouseats.com/khorovats-armenian-shish-kebabs-7091621",
  "image_url": "https://www.seriouseats.com/thmb/B7k0_4SlsrJBmzbQcBp4f6NTCTg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230106-SHISH-KEBAB-ANDREW-JANJIGIAN-25-09d222b8b2764cfdb058e5ac592a99c4.jpg",
  "tags": [
    "Armenian",
    "The Latest",
    "Grilling",
    "Lamb",
    "Beef"
  ],
  "title": "Khorovats (Armenian Shish Kebabs)",
  "full_text": "Khorovats (Armenian Shish Kebabs)\nClose\nJump to recipe\nPrep\n25 mins\nCook\n6 mins\nMarinating Time\n4 hrs\nTotal\n4 hrs 31 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nmedium (8-ounce; 225g)\nyellow onion\n, peeled and halved crosswise\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n1/4\ncup\n(\n60\ng\n)\ndouble-concentrated tomato paste\n1/4\ncup\n(\n60\nml\n)\nred wine\n1\ntablespoon\n(\n9\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n1/2\nteaspoon\nfreshly ground black pepper\n2\npounds\n(\n900\ng\n)\nboneless beef flap meat\nor\nlamb leg\n, trimmed of excess external fat, silver skin, and tough sinew, and cut into 1-inch wide by 1/2- to 1-inch-thick pieces (see note)\n4\n10- to 12-inch\npitas\n, for serving (see note)\nDirections\nGrate onion on the large holes of a box grater into a large bowl. Add oil, tomato paste, red wine, salt, and pepper, and whisk until evenly combined. Transfer marinade, along with meat, to a 1-gallon zipper-lock bag. Press out air, seal bag, and turn to coat meat in marinade. Refrigerate for at least 4 hours and up to 24 hours.\nSerious Eats / Andrew Janjigian\nThread meat tightly onto skewers without compressing the individual pieces, leaving no parts of the skewer exposed except for a 2-inch handle at the bottom, and the pointy tip at the top. Line a shallow serving bowl with 1 or 2 pita breads and set aside.\nSerious Eats / Andrew Janjigian\nSet up grill for skewers\n, making sure to adjust distance between bricks to the length of your skewers.\nLight one chimney full of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly in the channel between the bricks. Alternatively set burners on a gas grill to the highest heat setting, cover, and preheat for 15 minutes.\nClean and oil\ncooking grate.\nSerious Eats / Andrew Janjigian\nPlace skewers on grill (directly over coals if using charcoal, balancing them on top of the bricks, with the handles overhanging the bricks closest to you, and the tips balancing on the farther wall of bricks). Cook (covered if using gas), turning frequently, until meat is lightly charred and an instant-read thermometer inserted into the center of the thickest piece registers between 135°F and 145°F (57 to 60°C), 6 to 9 minutes for charcoal and 8 to 12 minutes for gas; if flare-ups occur, move the skewers around as needed to avoid scorching.\nSerious Eats / Andrew Janjigian\nUsing tongs or a pita as an “edible oven mitt”, slide meat off of skewers into prepared serving bowl, season to taste with salt, tent loosely with aluminum foil, and let rest for 2 minutes. Serve immediately, passing remaining pita on side, and alongside\nrice pilaf\nand grill-roasted onions, peppers, and tomatoes.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nGrill (charcoal or gas), 4 (12-inch) metal skewers or 6 (10-inch) wooden skewers\nNotes\nThis dish is either made with leg of lamb or beef. Flap meat is identical to sirloin steak tips, but in larger pieces. If available, purchase in one piece to cut down yourself. If lamb leg is unavailable, use lamb shoulder instead.\nThe pita used to line the serving platter soaks up juices from the cooked meat and is meant to serve as a tasty treat for the grill cook or anyone else, wrapped around pieces of meat.\nMake-Ahead and Storage\nShish kebab is best enjoyed immediately. Leftovers can be refrigerated in an airtight container and reheated gently, or sliced and served cold in sandwiches.\nArmenian\nThe Latest\nGrilling\nLamb\nBeef"
}