{
  "url": "https://www.seriouseats.com/kilawin-5195492",
  "image_url": "https://www.seriouseats.com/thmb/EDJACM-L6nyjz87glF5ASLbuT7I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210727-KILAWIN-PORKBELLY-JANJIGIAN-seriouseats-10-420c5c458ac9456d8013b65f78950d1c.jpg",
  "tags": [
    "Filipino",
    "Grilled Pork",
    "Snacks & Appetizers",
    "Mains",
    "Pork Mains"
  ],
  "title": "Kilawin: Grilled Pork, Punchy Sauce, Can't Lose",
  "full_text": "Kilawin: Grilled Pork, Punchy Sauce, Can't Lose\nClose\nJump to recipe\nPrep\n6 hrs\nCook\n40 mins\nTotal\n6 hrs 40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Inihaw Na Liempo (Grilled Pork Belly):\n1/2\ncup\n(\n120\nml\n)\nwater\n1/4\ncup\n(\n60\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or an equal amount by weight\n2\ntablespoons\n(\n30\nml\n)\nfresh lemon juice\nfrom\n1\nwhole\nlemon\n2\ntablespoons\n(\n25\ng\n)\nsugar\n1/2\nteaspoon\nground black pepper\n2\npounds\n(\n910\ng\n)\nboneless, skin-on pork belly\n, cut into 2-inch-wide by 4-inch-long blocks\nFor the Kilawin:\n1\nlarge\nred onion\n(about\n10 1/2\nounces\n;\n300\ng\n), thinly sliced\n5\nmedium\ngarlic cloves\n(\n25\ng\n), minced\n1/2\ncup\n(\n120\nml\n)\nsukang Iloko vinegar\n(see note)\n1\ntablespoon\n(\n7\ng\n)\nfreshly ground black pepper\n2\nteaspoons\n(\n8\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or an equal amount by weight\n1\nteaspoon\n(\n4\ng\n)\nsugar\n1\nmedium (4-1/8\" long)\nscallion\nDirections\nFor the Grilled Pork Belly:\nIn a small bowl, whisk together water, salt, lemon juice, sugar, and black pepper until sugar is completely dissolved. Set aside.\nAndrew Janjigian\nPlace pork belly in a gallon zipper-lock bag or large baking dish and pour marinade over the meat. Toss to evenly distribute the marinade, then seal bag, removing as much air as possible (if using baking dish, wrap tightly with plastic wrap). Transfer to refrigerator, and marinate for at least 6 hours and up to 24 hours.\nAndrew Janjigian\nLight 1/2 chimney of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grill grates.\nRemove pork belly from marinade, wipe off excess, and pat dry with paper towels; discard marinade. Cook pork directly over the hot side of the grill. If using a charcoal grill, leave uncovered; if using a gas grill, cover. Cook, turning occasionally, until pork is cooked through and lightly charred on all sides and the thickest part registers 155°F (68°C) on an instant-read thermometer, between 20 to 25 minutes (if a\nflare-up\noccurs, quickly move pork to cooler side of grill; once flare-up subsides, move pork back to hotter side of grill and continue to cook). Transfer to a cutting board and let rest for 5 minutes; slice pork belly into 1-inch-wide by 2-inch-long strips.\nAndrew Janjigian\nFor the Kilawin:\nIn a large bowl, add half of the sliced onion, garlic, vinegar, black pepper, salt, and sugar, and stir until sugar and salt have fully dissolved. Add pork and toss to evenly coat with dressing.\nAndrew Janjigian\nTransfer to serving platter or bowl, garnish with scallions and remaining sliced onion. Serve.\nAndrew Janjigian\nSpecial Equipment\nCharcoal\nor\ngas\ngrill, wire rack,\ninstant-read thermometer\nNotes\nSukang Iloko is a specialty vinegar hailing from the Ilocos Region on the island of Luzon in the northern Philippines. It's made with sugar cane molasses, a byproduct of the sugar refining process, which is mixed with native botanicals like the bark of the duhat tree (or Java plum tree) or fruits, and fermented in earthenware jars until it becomes a sweet wine called Basi. When the wine sours, it becomes a dark, almost-black vinegar with a touch of sweetness that tastes similar to sherry vinegar. You can find sukang Iloko at Filipino or Asian markets and online. The most popular brand is Datu Puti. If you can’t find sukang Iloko, you can substitute it with cane vinegar or distilled white vinegar.\nMake-ahead and Storage\nKilawin can be refrigerated in an airtight container for up to 3 days. To reheat, preheat oven to 350°F (177°C). Transfer kilawin to a rimmed baking sheet lined with aluminum foil and reheat until hot, about 5 minutes. Alternatively, you can reheat in the microwave in 15-second intervals.\nFilipino\nGrilled Pork\nSnacks & Appetizers\nMains\nPork Mains"
}