{
  "url": "https://www.seriouseats.com/kimchi-spam-fried-rice-recipe",
  "image_url": null,
  "tags": [
    "Rice & Grain Mains",
    "Korean",
    "Pork",
    "White Rice",
    "Quick Dinners"
  ],
  "title": "Kimchi and Spam Fried Rice Recipe",
  "full_text": "Kimchi and Spam Fried Rice Recipe\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n15 mins\nTotal\n30 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\ncooked white rice\n(\n12\nounces\n;\n350\ng\n) (see notes)\n3/4\npound\nkimchi with juices\n(about\n1\ncup packed\n;\n340\ng\n)\n2\ntablespoons\n(\n30\nml\n)\nvegetable\nor\ncanola oil\n, divided\n1\n(12-ounce; 340 g) can\nof\nSpam\n, cut into 1/4- to 1/2-inch dice\n1\nlarge\nonion\n, finely diced (\n1 1/2\ncups\n;\n12\nounces\n;\n340\ng\n)\n4\nmedium\nscallions\n, white and pale green parts only, thinly sliced (about\n1/4\ncup\n;\n40\ng\n)\n2\nmedium\ncloves garlic\n, minced (about\n2\nteaspoons\n;\n10\nml\n)\n1\nhot red\nor\ngreen chile\n(such as\njalapeño\n,\nserrano\n, or\nThai bird\n), stemmed and thinly sliced\nFreshly ground black pepper\n2\nteaspoons\n(\n10\nml\n)\nAsian fish sauce\n1\nteaspoon\n(\n5\nml\n)\ntoasted sesame oil\n1/2\ncup\nchopped fresh cilantro leaves and fine stems\n(\n1/2\nounce\n;\n14\ng\n)\nKosher salt\nFried eggs\n, for serving\nHot sauce\n, for serving\nDirections\nIf using day-old rice, transfer to a medium bowl and break rice up with your hands into individual grains before proceeding. Place kimchi in a fine-mesh strainer set over a large bowl and squeeze out excess liquid. Reserve liquid and finely chop kimchi.\nSerious Eats / J. Kenji López-Alt\nHeat 1/2 tablespoon oil in a wok over medium-high heat until shimmering. Add Spam and cook, tossing and stirring frequently, until well browned and starting to crisp. Add chopped kimchi and onion and cook, stirring and tossing regularly, until vegetables are softened, about 4 minutes. Transfer to a bowl and set aside.\nSerious Eats / J. Kenji López-Alt\nAdd another 1/2 tablespoon oil to wok. Increase heat to high and heat until smoking. Add half of rice and cook, stirring and tossing, until rice is pale brown, toasted, and has a slightly chewy texture, about 3 minutes. Transfer to a medium bowl. Repeat with another 1/2 tablespoon oil and remaining rice.\nReturn all rice to wok and press it up the sides, leaving a space in the middle. Add another 1/2 tablespoon oil to the space. Add scallions (reserving some for garnish), garlic, and chile. Stir gently and cook until lightly softened and fragrant, about 1 minute. Toss with rice to combine. Add onion, kimchi, and Spam mixture and toss to combine. Pour in reserved kimchi juice and season generously with black pepper. Add fish sauce, sesame oil, and cilantro (reserving some cilantro for garnish). Toss everything to combine. Season to taste with salt if necessary. When ready to serve, allow rice to sit in wok without tossing for 45 seconds to create a crisp crust underneath.\nSerious Eats / J. Kenji López-Alt\nTurn rice out onto a serving platter, trying to get as much of the crispy rice facing up as possible. Top with fried eggs, sprinkle with reserved scallions and cilantro, and serve immediately with hot sauce.\nSerious Eats / J. Kenji López-Alt\nNotes\nFor best results, use Chinese-style medium-grain rice, jasmine rice, or sushi rice. Rice should either be cooked fresh, spread on a tray, and allowed to cool for 5 minutes, or transferred to a loosely covered container and refrigerated for at least 12 hours and up to three days.\nSpecial Equipment\nFine-mesh strainer\n,\ncarbon steel skillet\nor\nwok\nRead More\nEasy Fried Rice\nSpam Hacks: 12+ Things to Do with SPAM\nRice & Grain Mains\nKorean\nPork\nWhite Rice\nQuick Dinners"
}