{
  "url": "https://www.seriouseats.com/kimchi-cheese-rice-recipe",
  "image_url": null,
  "tags": [
    "Rice & Grain Sides",
    "Cheese",
    "East Asian",
    "Cabbage",
    "Quick Dinners"
  ],
  "title": "Crispy Kimchi Cheese Rice Recipe",
  "full_text": "Crispy Kimchi Cheese Rice Recipe\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n10 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n, softened\n4\ncups\ncooked\nshort-grain\nrice\n(see notes)\n3\ntablespoons\n(\n45\nml\n)\ngochujang\n3\ntablespoons\n(\n45\nml\n)\nsoy sauce\n1\ntablespoon\n(\n15\nml\n)\nrice vinegar\n4\nthinly sliced\nmedium\nscallions\n(\n80\ng\n), white and green parts divided\n3\nounces\n(\n85\ng\n)\ngrated low-moisture mozzarella cheese\n(see note), divided\n2\nounces\n(\n57\ng\n)\ngrated Gruyère cheese\n(see note), divided\n5\nounces\n(\n141\ng\n)\nchopped drained\nkimchi\n(see note)\n1\nounce\n(\n28\ng\n)\ngrated Cotija cheese\n(see note)\nDirections\nPreheat oven to 400°F (200°C). Grease a 10-inch cast iron pan with 1 tablespoon (15g) butter, making sure to fully cover both the bottom and the sides.\nIn a medium mixing bowl, combine rice, gochujang, soy sauce, rice vinegar, and sliced scallion whites. Using a flexible spatula, mix thoroughly.\nScrape half of rice mixture into buttered cast iron skillet and, using the bottom of a drinking glass or measuring cup, press down firmly to create a single even layer of seasoned rice. Distribute half of the mozzarella and Gruyère over the layer of rice, then scrape the rest of the rice mixture over grated cheese. Using the bottom of a drinking glass or measuring cup, press down firmly to create an even top layer of seasoned rice. Transfer pan to oven and cook for 35 minutes.\nRemove pan from oven. Turn off oven and turn broiler on high. While broiler preheats, top rice with chopped kimchi. Distribute remaining Gruyère and mozzarella over kimchi and sprinkle Cotija over the other cheeses.\nPlace pan under broiler for about 2 minutes, or until Gruyère and mozzarella melt and bubble and Cotija begins to char in spots. Remove pan from under broiler, top with sliced scallion greens, and serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n10-inch cast iron skillet\nNotes\nThis recipe was designed to use up leftover rice, but you can use freshly cooked rice, too, without altering the recipe. Short- or medium-grain rice is preferred, but any rice variety works.\nIf you have more than one type of kimchi available, feel free to use a mix for even greater flavor. Similarly, this recipe offers suggestions of types of cheeses to use, but any good melting cheese will work for the interior and on top, and most any hard cheese will work for the broiling step, too.\nMake-Ahead and Storage\nThis recipe is best eaten immediately after being prepared.\nRice & Grain Sides\nCheese\nEast Asian\nCabbage\nQuick Dinners"
}