{
  "url": "https://www.seriouseats.com/king-ranch-casserole-recipe-8704170",
  "image_url": "https://www.seriouseats.com/thmb/SLnZqwg3JgiFMkoFC-voYjAQPfg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240815-SEA-KingCasserole-MorganHuntGlaze-Hero2-18-3cd840dc7d3e49668fe613a14697f7c8.jpg",
  "tags": [
    "Chicken",
    "The Latest",
    "Chicken Breast",
    "North American"
  ],
  "title": "King Ranch Casserole",
  "full_text": "King Ranch Casserole\nClose\nJump to recipe\nPrep\n25 mins\nCook\n100 mins\nCooling Time\n10 mins\nTotal\n2 hrs 15 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Poached Chicken:\n1 1/2\ntablespoons\ncumin seeds\n3\nboneless, skinless chicken breasts\n(\n10\nounces/\n283g each; 30 ounces/849g total)\n6\ncups\n(1.5L)\nunsalted chicken broth\n,\nhomemade\nor store-bought, at room temperature\n2 small\njalapeño\nchiles (1 ounce;\n28\ng\n), halved and unseeded\n1\ntablespoon\n(9g) Diamond Crystal\nkosher salt\n; if using table salt, use half as much by volume\nFor the Casserole:\n18\n(about 5 1/2-inch)\ncorn tortillas\n(see notes)\nNonstick\ncooking spray\n3 tablespoons\nunsalted butter\n(\n1 1/2\nounces\n; 42g)\n1\nlarge\nyellow onion\n(10 ounces; 284g), chopped\n2\nlarge\nred bell peppers\n(about 5 3/4 ounces; 166g each), chopped\n1 large\npoblano pepper\n(\n3 1/2\nounces\n; 100g), seeded and chopped\n3 medium\ncloves garlic\n(\n15\ng\n), finely chopped\n1/4 cup\nall-purpose flour\n(about\n1\nounce\n; 30g)\n1\ntablespoon\nchili powder\n2 1/2\nteaspoons\ngranulated\nchicken bouillon\n, such as Maggi\nOne\n10\n-\nounce\ncan\ndiced tomatoes\nand green chiles, such as Rotel, drained\n1/2\ncup\n(120ml)\nheavy cream\n1\ncup\nchopped\nfresh cilantro\n(1 ounce; 28g), plus more for garnish\n1/3 cup\nsour cream\n(about\n2 3/4\nounces\n; 76g)\n1 1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2 1/2\ncups\nMonterey Jack cheese\n, shredded (10 ounces; 280g), divided\nDirections\nFor the Poached Chicken:\nIn a medium pot set over medium heat, toast cumin seeds, stirring constantly, until fragrant, about 40 seconds. Add chicken, chicken broth, chiles, and salt. Increase heat to medium-high and cook until broth is just shy of a simmer and the temperature registers between 150º and 160ºF (65 to 70ºC) on an instant-read thermometer, about 12 minutes. (See notes.)\nSerious Eats / Morgan Hunt Glaze\nReduce heat to low to maintain the temperature of the broth. (To help maintain the temperature, increase or reduce the heat as needed, and/or re-position the pot over stovetop burner so that the heat source only partially touches bottom of the pot.) Cook until an instant-read thermometer inserted into thickest portion of chicken registers 150°F (65ºC), 30 to 35 minutes. Carefully transfer chicken to a large bowl, and let rest until chicken is cool enough to handle, about 10 minutes. Using 2 forks, shred chicken; set aside. Using a fine-mesh strainer set over a large bowl, strain broth; discard solids. Set aside 2 1/2 cups (592ml) broth. Reserve remaining broth for another use.\nSerious Eats / Morgan Hunt Glaze\nWhile chicken cooks, prepare the casserole:\nAdjust oven racks to top third and lower third positions and preheat oven to 400ºF (205ºC). Arrange tortillas on 2 large rimmed baking sheets (they will be slightly overlapping). Lightly spray both sides with cooking spray. (Alternatively, use pastry brush to lightly brush tortillas with a thin layer of neutral oil.)\nSerious Eats / Morgan Hunt Glaze\nBake until slightly crisp and browned in spots, about 14 minutes, flipping tortillas halfway through and rotating baking sheets between top and bottom racks. Remove from oven and let cool until ready to use. (Tortillas will continue to crisp as they cool.)\nSerious Eats / Morgan Hunt Glaze\nIn a large pot or Dutch oven set over medium-high, melt butter. Add onion, bell pepper, poblano, and garlic; cook, stirring occasionally, until softened, about 8 minutes. Add flour, chili powder, and granulated chicken bouillon. Cook, stirring often, until fragrant and flour just begins to stick to bottom of the pot, about 1 minute. Add diced tomatoes and green chiles, cream, and 2 1/2 cups reserved broth; bring to a simmer over medium-high. Simmer, stirring occasionally, until slightly thickened, about 4 minutes. Remove from heat, and stir in cilantro, sour cream, salt, and shredded chicken until thoroughly combined.\nSerious Eats / Morgan Hunt Glaze\nTo assemble, place 6 tortillas in the bottom of a 9- by 13-inch baking dish. Spoon 3 cups of the chicken mixture over tortillas, and top with 1/2 cup of Monterey Jack cheese. Repeat with second layer. Top with remaining 6 tortillas, remaining 2 cups chicken mixture, and remaining 1 1/2 cups cheese.\nSerious Eats / Morgan Hunt Glaze\nBake, uncovered, at 400°F on top third rack of oven until bubbling and browned, 15 to 20 minutes. Garnish with additional cilantro.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nMedium pot, rimmed baking sheet, large pot or Dutch oven, 9- by 13-inch baking dish\nNotes\nCrushed tortilla chips can be used in place of the crisper tortillas, but they won’t yield even layers or be as flavorful as the tortillas.\nIf you don’t have an instant read thermometer, the water should be about poaching temperature when wisps of steam begin to rise from the water.\nIf you’d like to skip the poaching step and substitute rotisserie chicken, add 2 teaspoons ground cumin and 1/4 teaspoon cayenne pepper along with the flour and chili powder in step 5.\nA combination of Monterey Jack and cheddar cheese can be used, if desired.\nMake-Ahead and Storage\nThe casserole can be made 1 day in advance. Prepare casserole through step 6. Let cool slightly, uncovered, at room temperature for 1 hour. Cover with aluminum foil and refrigerate up to 24 hours. When ready to serve, uncover and let casserole come to room temperature for 30 minutes while oven preheats to 400ºF (205ºC). Bake, uncovered, until bubbling and browned and casserole is heated through, about 25 minutes, loosely covering with aluminum foil to prevent overbrowning, if needed. Garnish and serve as directed.\nLeftovers can be refrigerated in an airtight container for up to 3 days, but the tortillas will soften as they sit.\nChicken\nThe Latest\nChicken Breast\nNorth American",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/king-ranch-casserole.webp?"
}