{
  "url": "https://www.seriouseats.com/kiwi-passion-fruit-pavlova-recipe-11730985",
  "image_url": "https://www.seriouseats.com/thmb/C9n2HpVO1WvAVe7E4WGqpYcf3OI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250501-SEA-KiwiPassionfruitPavlova-RobbyLozano-Beauty1-85-c86b8a06e72040878ef9306cedbbc52b.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Recipes",
    "Fruit",
    "Summer Desserts"
  ],
  "title": "This Kiwi and Passion Fruit Pavlova Tastes Like a Vacation Down Under",
  "full_text": "This Kiwi and Passion Fruit Pavlova Tastes Like a Vacation Down Under\nClose\nJump to recipe\nPrep\n45 mins\nCook\n90 mins\nCooling Time:\n3 hrs\nTotal\n5 hrs 15 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n322\ng\ngranulated sugar\n(\n11 1/4\nounces\n;\n1 1/2\ncups\nplus\n1 1/2\ntablespoons\n), divided\n8\ng\n(\n1\ntablespoon\n)\ncornstarch\n5\nlarge\negg whites\n(\n180\ng\n; about\n6 1/2\nounces\n), at room temperature\n1 1/2\nteaspoons\nwhite\ndistilled vinegar\n1\nteaspoon\nvanilla extract\n80\ng\npassion fruit\npulp with seeds (\n2 3/4\nounces\n;\n1/3\ncup\n), fresh or thawed from frozen (see notes)\n3\nmedium\nkiwis\n(about\n3 1/4\nounces\n;\n90\ng\neach), peeled and thinly sliced (about\n1 1/2\ncups\n)\n1 1/2\ncups\n(\n355\nml\n)\nheavy cream\n18\ng\nconfectioners’ sugar\n(about\n3/4\nounce\n;\n2\ntablespoons\n)\nDirections\nAdjust oven rack to middle position and preheat to 275°F (135°C). Line a 13- by 18-inch rimmed baking sheet with parchment paper; set aside. In a medium bowl, whisk cornstarch and 1 1/2 cups (300 g; 10 1/2 ounces) sugar; set aside.\nSerious Eats / Robby Lozano\nIn the bowl of a stand mixer fitted with the whisk attachment or using a hand mixer and a large bowl, beat egg whites on medium speed until light, fluffy, and soft peaks form, about 2 minutes. With the mixer still running on medium, slowly add sugar mixture, one tablespoon at a time, beating for 30 seconds after each addition. Continue beating until meringue is thick, glossy, and holds firm peaks when you lift the whisk, 8 to 12 minutes longer. Using a flexible spatula, scrape bottom and sides of the bowl. With the mixer running on medium speed, drizzle in vinegar and vanilla, and continue beating until fully incorporated.\nSerious Eats / Robby Lozano\nScrape meringue onto center of prepared baking sheet. Using a flexible spatula or the back of a spoon, spread and smooth meringue from center outward into a 9-inch disc, creating a rim that is about 1/4-inch higher around the edges.\nSerious Eats / Robby Lozano\nPlace in oven and immediately reduce temperature to 225°F (110°C). Bake until meringue is dry and pale beige, about 1 1/2 hours. Turn oven off and allow meringue to cool in the oven with the door closed, at least 2 hours and up to 16.\nSerious Eats / Robby Lozano\nTo Assemble:\nIn a small bowl, stir passion fruit pulp with 1 tablespoon (15 g; 1/2 ounce) sugar to combine. In another small bowl, stir kiwis and remaining 1 1/2 teaspoons (6 g) sugar. Let sit at room temperature for 30 minutes.\nSerious Eats / Robby Lozano\nIn the clean bowl of a stand mixer fitted with the whisk attachment or using a hand mixer, beat cream and confectioners’ sugar on medium speed until soft peaks form, 2 to 3 minutes.\nSerious Eats / Robby Lozano\nCarefully peel parchment away from bottom of meringue and transfer meringue to a cake stand or large platter. Spoon whipped cream into depression of the meringue, followed by the passion fruit pulp and kiwi slices. Serve immediately.\nSerious Eats / Robby Lozano\nSpecial Equipment\n13- by 18-inch rimmed baking sheet, parchment paper, stand mixer or hand mixer, flexible spatula, cake stand or large platter\nNotes\nIf using fresh passion fruit, you will need 2 to 3 medium passion fruit for 1/3 cup of pulp.\nMake-Ahead and Storage\nOnce cooled, the meringue can be stored in an airtight container, ideally with a silica packet, for up to 5 days at room temperature but may soften as it sits. Once assembled, pavlova should be eaten immediately.\nDesserts\nThe Latest\nRecipes\nFruit\nSummer Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-kiwi-and-passion-fruit-pavlova-tastes-like-a-vacation-down-under.webp?"
}