{
  "url": "https://www.seriouseats.com/kkakdugi-radish-kimchi-5184673",
  "image_url": "https://www.seriouseats.com/thmb/IOqbjFT8FbnnqWqxqASB9p5Rm1w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210520-kkakdugi-radish-kimchi-Beauty-tim-chin-seriouseats-v2-f1f1ad5d4bb94470b80c79057504a5b1.jpg",
  "tags": [
    "Korean",
    "Vegetable Sides",
    "Radishes",
    "The Latest"
  ],
  "title": "How to Make Kkakdugi (Radish Kimchi)",
  "full_text": "How to Make Kkakdugi (Radish Kimchi)\nClose\nJump to recipe\nPrep\n10 mins\nFermentation Time\n120 hrs\nTotal\n120 hrs 10 mins\nServes\n32 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.4\nkg\n)\ndaikon\nor Korean moo radish, peeled and cut into a 1-inch dice\n1\ntablespoon\nplus\n1\nteaspoon\n(\n15\ng\n) Diamond Crystal\nkosher salt\n2\nteaspoons\n(\n10\ng\n)\nsugar\n1/4\ncup\nplus\n2\ntablespoons\n(\n40\ng\n) coarse ground\ngochugaru\n(Korean chile powder)\n12\ngarlic cloves\n(\n60\ng\n), finely chopped\n1\n(3-inch) piece\nfresh ginger\n(about\n1.75 ounces\n;\n50 g\n), peeled and finely chopped\n5\nscallions\n(about\n60 g\n), cut into 1-inch pieces\n2\ntablespoons\n(\n40 g\n) saeujeot (\nKorean salted shrimp\n)\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\nDirections\nPlace radish in a large bowl, and sprinkle evenly with salt, sugar, and gochugaru. Using clean hands, mix, agitate, and massage radish to coat evenly with seasoning, until radish pieces begin to release moisture and are stained red from gochugaru, 4 to 5 minutes.\nTim Chin\nAdd garlic, ginger, scallions, saeujeot, and fish sauce, and continue to mix by hand until thoroughly combined, about 1 minute. Transfer mixture to a non-reactive 1/2-gallon container, such as a fermentation crock or glass canning jar. Press down on mixture to eliminate air pockets, cover surface with plastic wrap, pressing gently to ensure full contact, and weigh down with fermentation weight. Seal container with airlock lid following manufacturer's instructions.\nTim Chin\nStore kimchi in dark area away from sun and let ferment, maintaining an ambient temperature between 55°F (13°C) and 75°F (24°C) for 3 days; check mixture daily for signs of gas formation (this is a good sign). After first 24 hours, vegetables should have released a good deal of moisture; using a clean spoon, press down on radish mixture to submerge in liquid.\nTim Chin\nAfter 3 days, transfer container to refrigerator and continue to ferment for at least 2 more days before eating. After 5 total days of fermentation, begin tasting kimchi daily until it has reached desired flavor. Check progress of fermentation every 3 to 5 days, stirring kimchi with a clean spoon and making sure to keep vegetables submerged in liquid. Properly stored, kkakdugi kimchi can be refrigerated for up to 3 months (its flavor will change over time, becoming more \"ripe\" and intense as it ages; peak flavor falls around the 14-day mark).\nTim Chin\nTo serve as a banchan, divide kimchi between small individual serving dishes, and spoon liquid from fermentation container over top. Serve.\nTim Chin\nKorean\nVegetable Sides\nRadishes\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-make-kkakdugi-radish-kimchi.webp?"
}