{
  "url": "https://www.seriouseats.com/knickerbocker-glory-recipe-8677382",
  "image_url": "https://www.seriouseats.com/thmb/eENIGIGZOUaB1xQAMvkvF-ftkVQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240711-Knickerbocker-Glory-Larisa-Niedle-hero-SEA-0f45f352052444bb8e95e1c22ec04f25.jpg",
  "tags": [
    "Summer Desserts",
    "The Latest",
    "Strawberry",
    "British",
    "No-Cook Desserts"
  ],
  "title": "Knickerbocker Glory (British Ice Cream Sundae)",
  "full_text": "Knickerbocker Glory (British Ice Cream Sundae)\nClose\nJump to recipe\nPrep\n20 mins\nTotal\n20 mins\nServes\n2\nMakes\n1 sundae\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\nscoop\ns\nvanilla ice cream\n, divided\n3/4\ncup\ndiced\nfresh strawberries\n(105g; about 5 large berries), divided\n1 tablespoon plus 1 teaspoon (\n10\ng\n)\npowdered sugar\n, divided\n1/4\ncup\nheavy cream\n1/4\ncup\nraspberries\n1\ncookies\nwafer\nDirections\nRemove container of ice cream from freezer. Set aside to soften until easily scoopable but not melted, about 10 to 15 minutes. Meanwhile, prepare the other components.\nSerious Eats / Larisa Niedle\nIn the bowl of a food processor or the jug of an immersion blender, combine 1/2 cup (70g) diced strawberries and 1 tablespoon powdered sugar. Purée until smooth, about 1 minute. Using a fine-mesh sieve set over a small bowl, strain purée, scraping and pressing with a flexible spatula to push mixture through as needed. Set aside.\nSerious Eats / Larisa Niedle\nIn the bowl of a stand mixer fitted with the whisk attachment, whip heavy cream and 1 teaspoon powdered sugar, if using, on medium-high speed until stiff peaks form, about 2 minutes. (Alternatively, place heavy cream in a medium bowl and, using a hand mixer, whip heavy cream and powdered sugar, if using, on medium-high speed until stiff peaks form, about 2 minutes.) Using a flexible spatula, transfer whipped cream to prepared piping bag and refrigerate until ready to use.\nSerious Eats / Larisa Niedle\nCover bottom of a parfait glass with 1 tablespoon strawberry purée. Add remaining 1/4 cup (35g) diced strawberries. Top with 1 scoop vanilla ice cream and drizzle with 1 tablespoon strawberry purée. Top with 1 more scoop vanilla ice cream and raspberries, using an iced tea–spoon to smooth ice cream and arrange fruit as needed. Top with 1 scoop vanilla ice cream and drizzle with remaining strawberry purée.\nSerious Eats / Larisa Niedle\nPipe whipped cream over the sundae and garnish with a fan wafer. Serve immediately with iced tea–spoon.\nSerious Eats / Larisa Niedle\nSpecial Equipment\nPiping bag, star piping tip, parfait glass, hand mixer, food processor, fine-mesh strainer, ice cream scoop, long spoon\nNotes\nIf you don't have a parfait glass, you can assemble your knickerbocker glory in a tall drinking glass or glass jar instead.\nIf you can’t find fan wafers, you can garnish your knickerbocker glory with rolled wafer sticks.\nMake-Ahead and Storage\nYou can prepare the strawberry purée up to 48 hours in advance. Refrigerate in an airtight container until ready to use.\nSummer Desserts\nThe Latest\nStrawberry\nBritish\nNo-Cook Desserts"
}