{
  "url": "https://www.seriouseats.com/knoephla-north-dakota-cream-and-dumpling-soup-recipe-8640262",
  "image_url": "https://www.seriouseats.com/thmb/uZ7m6FPvtINsR7F29ml0TYAGowE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240426-knoephla-soup-recipe-Qi-Ai-hero-spoon-side-hero-d35f1ff9945a446085ae92ea2bef3e27.jpg",
  "tags": [
    "Comfort Food",
    "The Latest",
    "Soups",
    "Midwestern"
  ],
  "title": "Knoephla (North Dakota Cream-and-Dumpling Soup)",
  "full_text": "Knoephla (North Dakota Cream-and-Dumpling Soup)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nResting Time\n30 mins\nTotal\n75 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dumplings:\n2\ncups\nall-purpose flour\n(\n296\ng\n)\n1\nteaspoon\nDiamond Crystal salt\n(\n3\ng\n); if using table salt, use half as much by volume\n1\nteaspoon\nbaking powder\n2\nlarge\neggs\n(\n110\ng\n)\n6\ntablespoons\nwhole milk\n(\n90\nml\n), plus more if needed\nFor the Soup:\n4\ntablespoons\nunsalted butter\n(\n56\ng\n)\n1\nmedium\nyellow onion\n(\n8\nounces\n;\n227\ng\n), diced small\n4\nstalks\ncelery\n(\n6.5\nounces\n;\n190\ng\n), plus any\nleaves\n, diced small\n1\ntablespoon\nDiamond Crystal kosher salt\n(\n9\ng\n), plus more to taste; for table salt use half as much by volume\n1\nteaspoon\nfreshly ground white pepper\n, plus more to taste\n1/4\ncup\nall-purpose flour\n(\n37\ng\n)\n8\ncups\nhomemade chicken stock\nor\nstore-bought low-sodium chicken broth\n1 1/2\npounds\nwaxy potatoes\n(about\n5 to 6\nmedium\npotatoes\n), cut into 1/2-inch cubes\n1\ncup\n(\n240\nml\n)\nheavy cream\nDirections\nFor the Dumplings:\nIn a large mixing bowl, whisk flour, salt, and baking powder to combine. In a separate small bowl, whisk eggs and milk until eggs are thoroughly beaten. Pour wet ingredients into the dry and stir until a shaggy dough forms. (If dough is too dry, add milk 1 tablespoon at a time until dough comes together. Be patient.)\nSerious Eats / Qi Ai\nTurn dough out onto a lightly floured work surface and knead until a smooth, elastic dough forms, about 5 minutes. Roll dough into a ball, wrap tightly with plastic wrap, and let rest at room temperature for at least 30 minutes and up to 1 hour.\nSerious Eats / Qi Ai\nCut dough into eight equal sized pieces (about 65g each), cover loosely with a kitchen towel or plastic wrap and let rest for 5 minutes. Working with 1 dough piece at a time, roll each piece into a long thin rope about 1/2-inch thick and 9 inches long. If dough springs back while rolling, re-cover and let sit to relax for 5 to 10 minutes while you start the soup.\nSerious Eats / Qi Ai\nUsing a knife or a bench scraper, cut each dough rope, right before adding to the soup, into ½-inch long dumplings, dusting the work surface lightly with flour as needed to prevent sticking.\nSerious Eats / Qi Ai\nFor the Soup:\nWhile the dumpling dough is resting before cutting ,in a Dutch oven or large stockpot, heat butter over medium-high heat until melted and beginning to foam. Add onion, celery, salt, and pepper and cook until vegetables are softened and translucent, 5 to 7 minutes.\nSerious Eats / Qi Ai\nAdd flour and cook, stirring constantly until no dry flour remains, about 2 minutes. Slowly pour in broth, scraping bottom of pan to loosen any stuck bits and whisking to break up any lumps. Bring to a simmer then add potatoes and dumplings. Simmer, adjusting heat as needed to maintain simmer, until potatoes are tender and the dumplings are cooked through, 15 to 20 minutes. Remove from heat and stir in cream. Season with salt and white pepper to taste. Serve.\nSerious Eats / Qi Ai\nSpecial Equipment\nDutch oven or large pot\nMake-Ahead and Storage\nThe finished soup can be cooled down and refrigerated in an airtight container for up to 3 days, with a caveat that the knoephla dumplings will swell and soften as they absorb the broth. (A lot of people consider that a good thing. In my research, I came across multiple recipes that mentioned that knoephla soup is better the second day!)\nComfort Food\nThe Latest\nSoups\nMidwestern"
}