{
  "url": "https://www.seriouseats.com/kofte-kebabs-with-spicy-harissa-yogurt-sauce",
  "image_url": "https://www.seriouseats.com/thmb/EH_QRjNB4pCVD4Z6liaI2cMm1ug=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120513-kofta-kebab-carrot-dip-bread-8-4a7ea05e3f8543fdb7832097f9ec0c62.jpg",
  "tags": [
    "Middle Eastern",
    "Grilled Beef",
    "Grilled Lamb",
    "Ground Beef",
    "Ground Lamb"
  ],
  "title": "Kofte Kebabs With Spicy Harissa Yogurt Sauce and Grilled Flatbread (Minced Lamb Kebabs) Recipe",
  "full_text": "Kofte Kebabs With Spicy Harissa Yogurt Sauce and Grilled Flatbread (Minced Lamb Kebabs) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n30 mins\nResting Time\n5 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\nstrained yogurt\n4\ntablespoons\nharissa\n(to taste, see note)\n4\nmedium\ncloves garlic\n, minced on a microplane grater (about\n4\nteaspoons\n)\n1\ncup\nfresh mint\nor\nparsley leaves\n(or\na mix\n), minced\nKosher salt\nand\nfreshly ground black pepper\n2\npounds\nground lamb\nor\nbeef\n, at least 20% fat\n1\ntablespoon\nred chili flakes\n2\nteaspoons\nground cumin\n1\nteaspoon\nground coriander\n1/4\nteaspoon\nground cinnamon\n1\n(2-inch) knob\nof\nginger\n, grated on the medium holes of a box grater\n1\nsmall\nonion\n, grated on the medium holes of a box grater (about\n1/2\ncup\n)\nThinly sliced red onions\n, soaked in cold water\n1\nlemon\n, cut into wedges for serving\nA\nhandful\nof\ngreens\n, such as\narugula\n(optional)\n1\nrecipe\ngrilled naan\n, or\nstore-bought flatbread\nwarmed on grill\nDirections\nSoak 12 large bamboo skewers in water (unless using metal skewers). Combine yogurt, half of harissa (more or less depending on spice tolerance), half of garlic, and half of herbs. Whisk to combine and season to taste with salt and pepper.\nCombine lamb, chile flakes, cumin, coriander, cinnamon, ginger, onion, remaining garlic, remaining harissa, and remaining herbs in a large bowl. Season with salt. Work the meat together with your bare hands until homogenous, then pull off a small piece and place it on a microwave-safe plate. Microwave on high power until cooked through, about 15 seconds. Taste meat and add salt as necessary. Repeat the tasting process until seasoned to your liking.\nWorking with wet hands, divide meat into 12 balls. Roll each ball into a long sausage-like shape, then insert skewer through center of each kebab.\nSerious Eats / J. Kenji López-Alt\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate.\nPlace kebabs directly over coals. Cover and cook until well-charred, about 2 minutes. Carefully flip kebabs, cover, and cook until second side is well-charred. Remove cover, transfer kebabs to cooler side of grill, cover, and continue cooking until desired doneness is reached, about 2 minutes more (you can tear off a piece of one to check). Transfer to a large plate and let rest for 3 minutes.\nSerious Eats / J. Kenji López-Alt\nServe kebabs with lemon wedges, sliced onions, greens, and yogurt sauce on boiled rice or with a grilled flatbread, such as grilled naan.\nSpecial Equipment\nGrill, metal or wooden skewers\nNotes\nKofte kebabs are traditionally made with lamb, however, ground beef or pork can be substituted.\nHarissa is a Tunisian spice paste made from piri-piri peppers. It can be found in cans or bottles in most major supermarkets or specialty grocers. It's not in any way Lebanese, but I like the flavor it adds to the dish. If you can't find it, any fresh chili sauce will do, such as sambal oelek. Serve kebabs with yogurt sauce on boiled rice or with a grilled flatbread, such as this\ngrilled naan\n.\nRead More\nAdana Kebabs (Ground Lamb Kebabs)\nSeekh Kebabs (Pakistani Spicy Grilled Ground Meat Skewers)\nHow to Get Started Grilling\nMiddle Eastern\nGrilled Beef\nGrilled Lamb\nGround Beef\nGround Lamb"
}