{
  "url": "https://www.seriouseats.com/koji-cured-turkey-confit-recipe-5210234",
  "image_url": "https://www.seriouseats.com/thmb/U7Ar6gHgu1vXuUgJNz7pH8jXU-Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/KojiTurkeyLegHero_1-31daeb8424ff429b851817533ae96642.jpg",
  "tags": [
    "Thanksgiving",
    "Turkey Guides",
    "Thanksgiving Turkeys"
  ],
  "title": "Koji-Cured Turkey Confit",
  "full_text": "Koji-Cured Turkey Confit\nClose\nJump to recipe\nPrep\n5 mins\nCook\n4 hrs 35 mins\nCuring and Cooling Time\n13 hrs\nTotal\n17 hrs 40 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4 to 4 1/2\npounds\n(\n1.8 to 2\nkg\n)\nturkey legs\n, number will vary by size\n1\ncup\n(\n300\ng\n;\n240\nml\n)\nhomemade shio koji\n(see note)\n2\nteaspoons\n(\n6\ng\n) whole black\npeppercorns\n6\nsprigs\nfresh thyme\nApproximately\n4\ncups\n(\n950\nml\n) rendered\nduck fat\n(see note)\nDirections\nThe Day Before Cooking Confit:\nCombine turkey legs, shio koji, peppercorns, and thyme in a 2-gallon zipper-lock bag. Seal bag, pressing out as much air as possible. Massage bag until turkey legs are evenly coated on all sides with shio koji. Lay bag flat on a rimmed baking sheet and refrigerate for at least 12 and up to 24 hours. Do not cure legs longer than 24 hours, as they will over-cure, resulting in salty and dry confit.\nTim Chin\nWhen Ready to Cook:\nAdjust oven rack to middle position and preheat oven to 225°F (105°C). Melt duck fat, either in a Dutch oven over low heat, or in a microwave-safe bowl in the microwave. Remove turkey legs from cure, wiping away as much of the cure mixture as possible before rinsing legs gently under cold water to remove all seasonings; discard cure. Pat duck legs dry with paper towels, then arrange in single layer in Dutch oven with duck fat, making sure the legs are completely submerged. Alternatively, arrange turkey legs snugly in a medium baking dish and cover with melted duck fat, making sure legs are fully submerged.\nTim Chin\nCover Dutch oven or baking dish with lid or aluminum foil and transfer to oven. Cook until turkey is completely tender and meat shows almost no resistance when pierced with a paring knife, and skin has begun to pull away from bottom of the drumstick, 4 to 4 1/2 hours.\nTim Chin\nRemove from oven and remove lid. Cool turkey to room temperature in its cooking vessel while still submerged in fat. Once cool, cover container tightly and transfer to refrigerator, where confit can be stored for up to 1 month.\nTim Chin\nSpecial Equipment\nDutch oven or baking dish with lid.\nNotes\nWe do not recommend using pre-brined turkey; the resulting meat will be over-cured and excessively salty.\nPrepared shio koji from the store is treated with alcohol to extend its shelf life, and varies wildly in quality and flavor; it will not work well in this recipe. Making your own shio koji is worth the effort.\nThe amount of duck fat needed for this recipe is dependent on the size of your cooking vessel. You need enough rendered duck fat to fully cover the legs and keep them submerged throughout cooking. You can render duck fat yourself from breaking down whole ducks or you can purchase containers of rendered duck fat at well-stocked supermarkets or online.\nThis recipe can easily be scaled up or down for any number of turkey legs you want to make; just note that the ratio of rendered fat to meat may change dramatically with the size and shape of the cooking vessel.\nMake-Ahead and Storage\nCooked confit turkey legs can be stored submerged in fat in the refrigerator for up to 1 month.\nThanksgiving\nTurkey Guides\nThanksgiving Turkeys"
}