{
  "url": "https://www.seriouseats.com/koji-prime-rib-recipe",
  "image_url": "https://www.seriouseats.com/thmb/1AjE9RUzN8jEm4k7AwLI-Z2wLxQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__12__20191119-koji-prime-rib-vicky-wasik-59-fa6c80859be34f9b94f6b7db066cf075.jpg",
  "tags": [
    "Beef Mains",
    "Beef",
    "Roasted Beef",
    "Thanksgiving Dinner",
    "Christmas Dinners"
  ],
  "title": "Koji Prime Rib",
  "full_text": "Koji Prime Rib\nClose\nJump to recipe\nPrep\n20 mins\nCook\n4 hrs 10 mins\nActive\n15 mins\nRefrigerating and Resting Time\n12 hrs 30 mins\nTotal\n17 hrs\nServes\n6\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nstanding rib roast (prime rib)\n,\n7 to 12\npounds\n(\n3.2 to 5.4\nkg\n; see notes)\n1\ncup\n(\n300\ng\n;\n240\nml\n)\nshio koji\n(see note)\nFreshly ground black pepper\nFor Serving:\nKoji beef jus\n(optional)\nDirections\nFor the Prime Rib (the day before roasting):\nUsing a sharp knife, cut meat away from bone in one piece, cutting as close to the bone as possible, leaving you with a boneless roast and a slab of rib bones; reserve rib bones. Pat roast dry with paper towels; then using your hands, slather shio koji over entire surface of the roast and rib bones. Place roast back on bones, and, using butcher's twine, tie together so that roast looks as it did before meat was removed from the bones. Transfer roast, fat cap side up, to a wire rack set in a foil-lined rimmed baking sheet, then refrigerate, uncovered, at least 12 hours and up to 24 hours.\nWhen Ready to Cook:\nAdjust oven rack to center position and preheat oven to 225°F (110°C). Using a paper towel, gently wipe away excess bits of shio koji from the fat cap side of the roast. Transfer baking sheet with rack and roast to oven and cook until internal temperature registers 125°F (52°C) on an\ninstant-read thermometer\nat the roast's thickest point for medium-rare or 135°F (57°C) for medium, 4 to 5 hours.\nRemove roast from oven, tent loosely with foil, and let rest at room temperature for at least 30 minutes and up to 1 1/2 hours. Meanwhile, increase oven temperature to 500°F (260°C) or highest possible temperature.\nTen minutes before guests are ready to be served, remove foil, place roast back in hot oven, and cook until deeply browned and crisp on the exterior, 6 to 10 minutes. Remove from oven, and transfer roast to a carving board.\nFor Serving:\nCut away twine, and separate roast from ribs. Using a sharp knife, cut between ribs to separate into individual pieces, and then slice roast into 3/4-inch-thick slices. Serve right away, passing coarse sea salt and koji beef jus (if using) at the table.\nSpecial Equipment\nButcher's twine,\nrimmed baking sheet\n,\nwire rack\n,\ninstant-read thermometer\nNotes\nThis recipe works for prime rib roasts of any size, from three to six ribs. For best results, use a dry-aged prime-grade or grass-fed roast. Cooking time is identical regardless of the number of ribs on the roast.\nWe do not recommend using store-bought prepared shio koji for any recipe, as store-bought versions vary wildly in quality. They are often too sweet and are treated with alcohol to extend shelf life. Making your own\nshio koji\nis worth the effort.\nThis recipe is best enjoyed right away.\nRead More\nKoji Beef Jus\nThe Food Lab's Definitive Guide to Prime Rib\nRoasted and Reverse Seared Prime Rib\nPerfect Prime Rib With Red Wine Jus\nBeef Mains\nBeef\nRoasted Beef\nThanksgiving Dinner\nChristmas Dinners"
}