{
  "url": "https://www.seriouseats.com/koji-duck-confit",
  "image_url": "https://www.seriouseats.com/thmb/b4kmJDzwRnx0cA6J8pnLI7_EVuI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200107-duck-confit-33-vicky-wasik-ec616512300e4f528ce2dab54a84908c.jpg",
  "tags": [
    "Duck Mains",
    "Stovetop",
    "Duck"
  ],
  "title": "Koji Duck Confit Recipe",
  "full_text": "Koji Duck Confit Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n4 hrs 5 mins\nActive\n10 mins\nMarinating and Cooling Time\n12 hrs 30 mins\nTotal\n16 hrs 40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nduck\nlegs\n(about\n2 1/4\npounds\ntotal;\n1\nkg\n) (see note)\n1\ncup\n(\n300\ng\n;\n240\nml\n)\nhomemade shio koji\n(see note)\n2\nteaspoons\n(\n6\ng\n)\nwhole black peppercorns\n3\nstar anise\npod\n2 to 4\ncups\n(\n475 to 950\nml\n)\nrendered duck fat\n(see note)\nDirections\nThe Day Before Cooking Confit:\nCombine duck legs, shio koji, peppercorns, and star anise in a 1-gallon zipper-lock bag. Seal bag, pressing out as much air as possible. Massage bag until duck legs are evenly coated on all sides with shio koji. Lay bag flat on a rimmed baking sheet and refrigerate, for at least 12 hours and up to 24 hours. Do not cure legs longer than 24 hours, as they will over-cure, resulting in salty and dry confit.\nSerious Eats / Vicky Wasik\nWhen Ready to Cook:\nAdjust oven rack to middle position and preheat oven to 225°F (105°C). Melt duck fat, either in a 3-quart saucier over low heat, or in a microwave-safe bowl in the microwave. Remove duck legs from cure, wiping away as much of the cure mixture as possible before rinsing legs gently under cold water to remove all seasonings; discard cure. Pat duck legs dry with paper towels, then arrange in single layer in saucier with duck fat (if using), making sure they are completely submerged in fat. Alternatively, arrange duck legs snugly in a small baking dish and cover with melted duck fat, making sure legs are fully submerged in fat.\nSerious Eats / Vicky Wasik\nCover saucier or baking dish with lid or aluminum foil, and transfer to oven. Cook until duck is completely tender and meat shows almost no resistance when pierced with a paring knife, and skin has begun to pull away from bottom of the drumstick, 3 1/2 to 4 hours.\nSerious Eats / Vicky Wasik\nRemove from oven and cool duck to room temperature in its cooking vessel, removing lid but keeping it submerged in fat. Once cool, cover container tightly and transfer to refrigerator, where confit can be stored for up to 1 month.\nSpecial Equipment\n3-quart stainless steel saucier\nNotes\nThis recipe will work with all breeds of duck, but was developed using Pekin (also known as Long Island), and Alina ducks.\nWe do not recommend using store-bought prepared shio koji for any recipe, as store-bought versions vary wildly in quality. They are often too sweet and are treated with alcohol to extend shelf life. Making your own shio koji is worth the effort.\nThe amount of duck fat needed for this recipe is dependent on the size of your cooking vessel. You need enough rendered duck fat to fully cover the legs and keep them submerged throughout cooking. You can\nrender duck fat yourself from breaking down whole ducks\n, and also purchase containers of rendered duck fat at well-stocked supermarkets or online.\nThis recipe can easily be scaled up or down for any number of duck legs you want to make; just note that the ratio of rendered fat to duck may change dramatically as the size and shape of the cooking vessel does.\nMake-Ahead and Storage\nDuck confit can be refrigerated in an airtight opaque container, with legs completely submerged in fat, for up to 1 month. The duck fat from the confit can be re-used at least 2 more times for subsequent batches of confit; after the third use, taste it for salinity as it will eventually become too salty.\nRead More\nHow to Make Classic Duck Confit (and Give It a Koji Twist)\nBreak Out Your Nonstick Skillet for the Best Crispy Duck Leg Confit\nSous Vide Duck Confit Recipe\nCrispy Koji Duck Confit With Garlicky Duck-Fat Rice and Umeboshi Recipe\nHow to Get the Most Dang for Your Duck\nHow to Break Down Whole Ducks Like a Pro\nDuck Mains\nStovetop\nDuck"
}