{
  "url": "https://www.seriouseats.com/koji-beef-jus-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5Lj7_O8UClXHXm8gA5Ova4vNFfc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__12__20191119-koji-prime-rib-vicky-wasik-57-e38e88083e994e1aa65d1e3af9452488.jpg",
  "tags": [
    "Oxtail",
    "Braised & Stewed Beef",
    "Stovetop Beef",
    "Condiments & Sauces"
  ],
  "title": "Koji Beef Jus Recipe",
  "full_text": "Koji Beef Jus Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 25 mins\nActive\n30 mins\nTotal\n2 hrs 30 mins\nServes\n8 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n2\npounds\n(\n900\ng\n) beef shins or\noxtail\n1\nlarge\ncarrot\n, peeled and roughly chopped (about\n1 1/2\ncups\n)\n2\nribs\ncelery\n, roughly chopped (about\n1 1/2\ncups\n)\n1\nlarge\nonion\n, peeled and roughly chopped (about\n1 1/2\ncups\n)\n1\n(750 ml) bottle\ndry red wine\n2\nbay leaves\n4\nsprigs\nfresh thyme\n4\nsprigs\nfresh parsley\n1\nquart\n(\n950\nml\n)\nhomemade beef stock\n, homemade\nbrown\nor\nwhite\nchicken stock\n, or store-bought low-sodium chicken stock (see notes)\n1/4\ncup\n(\n60\nml\n)\nblended\nshio koji\nDirections\nIn a large Dutch oven, heat oil over high heat until lightly smoking. Add beef shins or oxtail, and cook, flipping and stirring pieces occasionally, until well browned on all sides, 12 to 15 minutes. Using tongs, transfer beef to a large plate, and set aside. Reduce heat to medium-high.\nSerious Eats / Vicky Wasik\nAdd carrot, celery, and onion to now-empty pot and cook, stirring occasionally, until starting to lightly brown, about 8 minutes. Add wine, bay leaves, thyme, and parsley and cook, scraping up browned bits from bottom of pot. Bring to a boil over high heat and cook until reduced by half, about 10 minutes.\nSerious Eats / Vicky Wasik\nAdd stock and return beef to the pot. Bring to a boil, and then reduce to a light simmer. Simmer, stirring occasionally, until beef is just tender and liquid is reduced by half, about 1 hour.\nSerious Eats / Vicky Wasik\nUsing tongs, transfer beef to a medium saucepan. Pour remaining contents of pot through a fine-mesh strainer into saucepan. Discard strained vegetables and aromatics.\nSerious Eats / Vicky Wasik\nUsing a ladle, skim excess fat off top of liquid and discard. Bring to a boil, reduce heat to a light simmer, and cook until beef is completely tender and liquid is reduced to about 2 cups (475ml), about 45 minutes. Transfer beef to a serving plate and tent with foil to keep warm or set aside for another use. Stir in shio koji and taste for seasoning, adjusting with salt and pepper if desired (jus shouldn't need additional salt). Keep warm, until ready to serve with\nkoji prime rib\n.\nSpecial Equipment\nDutch oven\n,\n3-quart stainless steel saucier\n,\nfine-mesh strainer\nNotes\nA good\nhomemade beef stock\nis great here, but you can also use homemade\nbrown\nor\nwhite\nchicken stock. If you buy store-bought stock, we recommend chicken, as most mass-market beef stock has a poor flavor (if you know a source for good quality store-bought beef stock, such as a local butcher, that would work too).\nMake-Ahead and Storage\nThe jus can be made ahead and refrigerated in an airtight container for up to one week, or frozen for up to 6 months.\nRead More\nKoji Prime Rib\nPerfect Prime Rib With Red Wine Jus\nOxtail\nBraised & Stewed Beef\nStovetop Beef\nCondiments & Sauces",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/koji-beef-jus-recipe.webp?"
}