{
  "url": "https://www.seriouseats.com/kookoo-sabzi-persian-herb-egg-bake-recipe-8714097",
  "image_url": "https://www.seriouseats.com/thmb/xPUxbo_ZbaluVznLK69Tmv0eFQo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240912-SEA-HerbKookoo-NaderMehravari-Hero6-26-0cc4a3a8bb8b46f7bceffd071880f35b.jpg",
  "tags": [
    "Eggs",
    "The Latest",
    "Middle Eastern"
  ],
  "title": "Kookoo-Sabzi (Persian Eggs With Green Herbs)",
  "full_text": "Kookoo-Sabzi (Persian Eggs With Green Herbs)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nTotal\n45 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n8\nlarge\neggs\n2\nteaspoons\n(6g) Diamond Crystal\nKosher salt;\nfor table salt us half as much by volume\n3 1/2 ounces (\n10\n0g)\nfresh\ncilantro leaves\nand most tender stems (see notes)\n3 1/2 ounces (\n100\ng)\nfresh flat leaf\nparsley leaves\nand tender stems of fresh flat leaf parsley\n3 1/2 ounces (\n100\ng)\nleaves and most tender stems of fresh\ndill\n3 1/2 ounces (\n100\ng)\nfresh Persian leaks, or chives, or\nscallion greens\n1 tablespoon (\n2 1/2\ng)\ncrushed dried\nfenugreek\nleaves\n1/2 cup\ndried barberries\n(1.3 ounces;\n3\n5g)\n1\ntablespoon\nall-purpose flour\n1/2\nteaspoon\nbaking powder\n1\nteaspoon\nfreshly\nground black pepper\n4\ntablespoons\n(56g)\nbutter,\nghee, olive oil, or your favorite cooking oil, divided\nDirections\nWash all fresh herbs and leeks or chives well. Spread over a kitchen towel and gently roll to remove excess water. Alternatively, use a salad spinner to achieve the same results.\nHarvest the leaves and most tender stems from the bundles of parsley and coriander. (If you wish, save the scraps and longer tough stems for other purposes such as making broth.) Chop all fresh herbs (including chives or leeks) as finely as you can. Feel free to use a food processor to chop the herbs. (see notes.)\nSerious Eats / Nader Mehravari\nIn a large mixing bowl, beat eggs and salt until frothy. Add the chopped fresh herbs and stir to combine.\nSerious Eats / Nader Mehravari\nAdd crushed dried fenugreek, barberries, if using, flour, baking powder, and ground black pepper. Stir until thoroughly combined.\nSerious Eats / Nader Mehravari\nIn a 10-inch nonstick skillet, Add 3 tablespoons butter (or ghee or oil) and heat over medium heat until butter is melted or ghee/oil is shimmering. Once melted, pour the egg mixture into the skillet and using a spatula, spread into an even layer, and cook, gently swirling and sliding the skillet back and forth for the first 3 minutes of cooking.\nSerious Eats / Nader Mehravari\nCover, reduce heat to medium-low, and continue cooking until edges of the kookoo are set and the center third is still slightly runny, 10 to 15 minutes.\nSerious Eats / Nader Mehravari\nFor Flipping in Sections:\nIf you decide to flip the kookoo in pieces, use a stiff spatula to cut the partially cooked kookoo into quarters. Using a flexible (silicone) spatula to temporarily remove one of the segments, add the remaining tablespoon of butter or oil to the skillet. Return the first segment back into the skillet, uncooked side down. Continue flipping the rest of the segments and cook, uncovered, until the eggs are completely set and dark golden brown on the bottom, about 5 minutes.\nSerious Eats / Nader Mehravari\nFor Flipping the Entire Kookoo:\nIf you decide to flip the kookoo in one piece, once the kookoo is partially set but still runny in the center, carefully place a large heatproof plate or baking sheet or cutting board on top of the skillet. Using a dish towel for gripping, quickly invert both the skillet and plate together, flipping the kookoo onto the plate. Return the now-empty skillet to the stovetop and melt 1 tablespoon butter over medium-low heat until melted (if using ghee or oil, until shimmering). Using a silicone spatula, gently slide the kookoo back into the skillet and gently press the edges of the kookoo into the skillet for even cooking. Continue to cook, uncovered, until eggs are completely set and the bottom is dark golden brown, about 5 minutes.\nSerious Eats / Nader Mehravari\n11. Slice and serve.\nSerious Eats / Nader Mehravari\nVariations\nAdd Walnuts:\nThe most popular variation of Kookoo-Sabzi involves the addition of about a half cup of crushed walnuts to the batter. It adds a bit of crunch to the kookoo as well as making it a heartier meal. This variation is so popular that many Persian home cooks consider this variation as their primary recipe for kookoo-sabzi.\nBake in the Oven:\nAn alternative to cooking on the stovetop is to cook the kookoo in the oven. It eliminates the need to flip the kookoo, but you will miss out on both sides of the kookoo being pan-fried and the texture will not be as uniform as most of the egg will migrate towards the bottom part of the kookoo–hence, it is not my preferred method. Preheat the oven to 350°F. Line an approximately 2-inch deep 8x8 inch square or 8-inch round ovenproof baking dish with parchment paper. Evenly spread the entire 4 tablespoons of butter or oil on the bottom of the lined pan, pour the contents of the mixing bowl (from Step 7 above), spread evenly with a spatula, and bake until set, about 35 minutes. Let cool for 10 minutes. Flip the pan onto a cooling rack or a baking sheet for the baked kookoo to fall out of the pan. Peel off the parchment paper. Flip it again onto another cooling rack or baking sheet. Let cool for another 10 minutes before cutting into squares or rectangles.\nSerious Eats / Nader Mehravari\nA better way to cook the kookoo in an oven is to use a silicone muffin pan to make cupcake-shaped mini kookoos perfect for parties. Fill each cavity to the brim and bake for 20 minutes at 350°F. To prevent baked mini kookoos from getting soggy, take them out of the muffin pan as soon as you can safely handle them. This recipe will have enough batter for about 18 mini kookoos. You can garnish the mini kookoos with barberries.\nVegan/Gluten-Free:\nKookoo-Sabzi is a vegetarian dish to begin with. Using commercially available vegan egg substitutes (such as Just Egg brand) and using your favorite vegetable oil (instead of butter or ghee) results in an acceptable vegan Kookoo-Sabzi. The easiest way to make a gluten-free version of kookoo-sabzi is to use your favorite measure-for-measure gluten-free flour (such as King Arthur brand) as the replacement for the 1 tablespoon of all-purpose flour that is called for in the basic recipe. Alternatively, simply eliminate the flour, which will result in a slightly denser kookoo but otherwise the same flavor. With regards to the baking powder that is asked for in the basic recipe, these days most baking powders are gluten-free, as its typical ingredients are an acid, baking soda, and a gluten-free starch like potato or corn.\nSpecial Equipment\n10-inch nonstick skillet\nNotes\nFor the herbs, you will need to buy approximately 9 ounces (250g) cilantro, 7 ounces (200g) parsley, and 7 ounces (200g) fresh dill.\nNever chop the chives or leeks in the food processor by themselves–otherwise they will turn into a green watery mess. Either combine them with the parsley, coriander, and dill to be chopped in the food processor together or simply chop them separately the good old-fashioned way with a sharp knife on a cutting board.\nThe two sides of the pan-fried kookoo will typically have slightly different colors. The side that gets pan fried first is more brownish whereas the side that gets pan fried second is more greenish.\nIf you are not able to use fresh cilantro, parsley, dill, or leeks, there are two alternatives. The best option is to use commercial bags of frozen chopped herbs that might be available in your local supermarkets. Some Persian and Middle Eastern markets may even have pre-mixed frozen combinations of kookoo herbs. The other option is to use dried versions of each of the herbs. If using frozen herbs, substitute 1-to-1 by weight. If using dry herbs substitute 1-to-3 dried to fresh by weight as dry herbs are much more potent.\nMake-Ahead and Storage\nYou can prepare your herbs (including chopping them) a day or two ahead of time, as long as you store them in the refrigerator in an airtight container that has been lined with a sheet or two of damp paper towels. I do not recommend making the batter ahead of time as it will become overly watery and the beaten eggs will not cling to the vegetables, resulting in a kookoo that has a layer of egg and a layer of herbs, which is not what you want.\nLeftover kookoo-sabzi is a tasty snack and a popular picnic food, as it is very transport friendly, and is an excellent primary ingredient for a sandwich. Leftovers can be stored for about a week in an airtight container in the refrigerator.\nThe best way to warm up leftover kookoo-sabzi is to use your toaster oven or your standard kitchen oven (particularly if your oven is on for some other reason). Put the kookoo segments on an oven-safe plate (or simply on a double-folded sheet of aluminum foil) at 300°F for about 10 minutes, or until you see tiny oil bubbles forming on the top and/or where they touch your warming vessel.\nThe quickest way to warm kookoo up is to zap them in your microwave oven for 2 minutes—but they will be a bit soggy, so opt for the oven if you have time.\nKookoo-sabzi is also very freezer friendly. Wedges of cooked kookoo-sabzi stored in tightly sealed freezer bags can be stored in the freezer for 3 to 6 months. After defrosting them on the counter for about 30 minutes, you can warm them up as explained above or eat them at room temperature.\nEggs\nThe Latest\nMiddle Eastern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kookoo-sabzi-persian-eggs-with-green-herbs.webp?"
}