{
  "url": "https://www.seriouseats.com/korean-scallion-pancake-with-shrimp-bacon-and-kimchi",
  "image_url": "https://www.seriouseats.com/thmb/uVzZKiKkEifcBJnW0CoZMNwAFM4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__10__201201008-224897-dinner-tonight-korean-pancake-bacon-shrimp-kimchi-primary-1642a57617a74bea859f1349456a65e0.jpg",
  "tags": [
    "Quick Dinners",
    "Shrimp",
    "Scallions"
  ],
  "title": "Korean Scallion Pancake with Shrimp, Bacon, and Kimchi Recipe",
  "full_text": "Korean Scallion Pancake with Shrimp, Bacon, and Kimchi Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n20 mins\nTotal\n40 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\negg\n1/2\ncup\nwater\n1/2\ncup\nall-purpose flour\n1\ntablespoon\nrice flour\n2\ntablespoons\nsoy sauce\n2\nteaspoons\nrice vinegar\nPinch\nred chile flakes (preferably Korean)\n1/2\nteaspoon\nsugar\n4\nslices\nthick-cut bacon\n, chopped\n12\nmedium\nshrimp\n, peeled, deveined, sliced in half lengthwise, and cut in half crosswise\n1\ncup\nkimchi\n, drained and chopped\n2\ntablespoons\ncanola oil\n4\nscallions\n, sliced\n2\ncups\nmixed leaf lettuce\n, torn into 2-inch pieces\nDirections\nWhisk together egg and water until homogenous. Add flour and rice flour and whisk until no lumps remain.\nIn a small bowl, whisk together the soy sauce, rice vinegar, chili flakes, and sugar.\nAdd the bacon to a 12-inch nonstick skillet set over medium heat. Cook, stirring occasionally, until the fat has rendered and the bacon pieces are crisp. Add the shrimp pieces, stir well, and cook until the shrimp turn pink, about 1 minute. Add the chopped kimchi, stir well, and cook until the kimchi is hot and most of the liquid has evaporated, about 1 minute longer. Transfer mixture to a bowl and set aside.\nPreheat the oven to 200°F. Heat 1/2 tablespoon oil in a small non-stick skillet over medium heat until shimmering. Add 1/4 of the scallions, and cook until soft, about 30 seconds. Pour in 1/4 cup of the egg batter and tilt the pan so the entire bottom is covered. Cook until the bottom is lightly browned, about two minutes. Flip the small pancake with a spatula, and cook on the other side until lightly browned, another two minutes. When done, slide the pancake onto a plate, and transfer plate to the warm oven. Repeat process until three more are completed.\nCarefully remove the plates from the oven. Top each with a handful of the lettuce and a quarter of the kimchi and shrimp mixture. Serve with the sauce on the side.\nQuick Dinners\nShrimp\nScallions"
}