{
  "url": "https://www.seriouseats.com/korean-fried-chicken-recipe",
  "image_url": null,
  "tags": [
    "Fried Chicken",
    "Chicken Wings",
    "Korean",
    "Chicken Mains",
    "Snacks & Appetizers"
  ],
  "title": "The Best Korean Fried Chicken",
  "full_text": "The Best Korean Fried Chicken\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n30 mins\nChilling Time\n30 mins\nTotal\n85 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n3/4\ncups\ncorn starch\n1\nteaspoon\nbaking powder\n2\npounds\nchicken wings\n(about\n12\nwhole\nwings\n, see note)\n2\nquarts\npeanut oil\n1/2\ncup\nall-purpose flour\n1/2\ncup\ncold\nwater\n1/2\ncup\nvodka\n1\nrecipe\nsweet soy sauce\nor\nsweet and spicy chili sauce\nDirections\nCombine 2 teaspoons kosher salt, 1/4 cup cornstarch, and 1/2 teaspoon baking powder in a large bowl and whisk until homogenous. Add chicken wings and toss until every surface is coated. Transfer wings to a wire rack set in a rimmed baking sheet, shaking vigorously as you go to get rid of excess coating. Transfer to refrigerator and let rest, uncovered, for at least 30 minutes and up to overnight.\nSerious Eats / Vicky Wasik\nWhen ready to fry, preheat oil to 350°F (177°C) in a large wok, Dutch oven, or deep fryer.\nCombine remaining 1/2 cup cornstarch, 1/2 teaspoon baking powder, flour, and 2 teaspoons kosher salt in a large bowl and whisk until homogenous. Add water and vodka and whisk until a smooth batter is formed, adding up to 2 tablespoons additional water if batter is too thick. It should have the consistency of thin paint and fall off of the whisk in thin ribbons that instantly disappear as they hit the surface of the batter in the bowl.\nSerious Eats / Vicky Wasik\nAdd half of the wings to the batter. Working one at a time, lift one wing and allow excess batter to drip off, using your finger to get rid of any large pockets or slicks of batter. Carefully lower wing into hot oil. Repeat with remaining wings in first batch. Fry, using a metal spider or slotted spatula to rotate and agitate wings as they cook until evenly golden brown and crisp all over, about 8 minutes. Transfer to a paper towel-lined plate and season immediately with salt. Keep warm while you fry the remaining wings.\nServe plain, or toss with sweet soy sauce for Korean fried chicken or sweet and spicy chili sauce for Korean fried chicken (or serve sauce on side).\nSpecial Equipment\nWok\n,\nDutch oven\n, or\ndeep fryer\nNotes\nA Cornish hen broken down into frying parts (drumstick, thighs, and breast quarters) can be used in place of the the chicken wings.\nFried Chicken\nChicken Wings\nKorean\nChicken Mains\nSnacks & Appetizers"
}