{
  "url": "https://www.seriouseats.com/koshari-egyptian-lentils-rice-and-pasta-recipe-8653829",
  "image_url": "https://www.seriouseats.com/thmb/6Bet79lOqaqpGIiuQUsI3ldeKhk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240524-SEA-KevinWhite-Koshari-7135-c500ac8ef6234d598fc7343799743e21.jpg",
  "tags": [
    "The Latest",
    "White Rice",
    "Chickpeas",
    "Vegetarian",
    "Lentils"
  ],
  "title": "Koshari (Egyptian Lentils, Rice, and Pasta)",
  "full_text": "Koshari (Egyptian Lentils, Rice, and Pasta)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs 15 mins\nTotal\n2 hrs 30 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Fried Shallots and Shallot-Infused Oil:\n1\ncup\n(\n237\nml\n)\nneutral frying oil\n, such as canola\n10\nmedium\nshallots\n(\n14\nounces\n;\n397\ng\n), thinly sliced\nKosher salt\nFor the Salsa (Mild Tomato Sauce):\n2\ntablespoons\n(\n30\nml\n)\nshallot-infused oil\n(recipe above)\n2\nmedium cloves\ngarlic\n, minced (about\n1\ntablespoon\n)\n2\ntablespoons\n(\n30\nml\n)\ndistilled white vinegar\n1\ncup\n(\n240\nml\n)\ntomato passata\n1\ntablespoon\n(\n15\nml\n)\ntomato paste\n1\nteaspoon\ngranulated sugar\n1\nteaspoon\nground cumin\n1\nteaspoon\nground coriander\nKosher salt\nand\nfreshly ground black pepper\n, to taste\nFor the Da’ah (Garlic-Vinegar Sauce):\n2\ntablespoons\n(\n30\nml\n)\nonion-infused oil\n6\nmedium\ncloves garlic\n(\n30\ng\n), minced\n1/2\ncup\n(\n120\nml\n)\ndistilled white vinegar\n1/2\ncup\n(\n120\nml\n)\nroom temperature water\n, plus more as needed\n1\ntablespoon\nground cumin\n1\ntablespoon\n(\n15\nml\n)\nlime juice\nKosher salt\nand\nfreshly ground black pepper\nFor the Shatta (Chile-Garlic Sauce)\n1\ntablespoon\n(\n15\nml\n)\nonion-infused oil\n(recipe above)\n1\ntablespoon\nred pepper flakes\n3\nmedium\ncloves garlic\n(\n15\ng\n), minced\n2\ntablespoons\n(\n30\nml\n)\ntomato paste\n1/4\ncup\n(\n60\nml\n)\nmild Tomato Sauce\n(recipe above)\n1/4\nteaspoon\nground cumin\nKosher salt\nand\nfreshly ground black pepper\nFor the Koshari:\n1/2\ncup\n(\n1200\nml\n)\nonion-infused oil\n(recipe above)\n1/2\ncup\nwhite basmati rice\n(about\n3\nounces\n;\n90\ng\n), soaked in cold water for 30 minutes then thoroughly rinsed and drained\n1/2\ncup\nItalian vermicelli pasta\n(about\n2 1/4\nounces\n;\n65\ng\n)\n1/2\ncup\nblack lentils\n, such as\nbeluga\n(\n3 1/2\nounce\ns;\n100\ng\n), soaked in hot water for 1 hour\n1/2\ncup\nelbow pasta\n(about\n2 3/4\nounces\n;\n75\ng\n)\n2\nteaspoons\nground cumin\n2\nteaspoons\nground coriander\nKosher salt\nand\nfreshly ground black pepper\nTo Garnish:\n1\n(14.5-ounce can)\nchickpeas\n, drained and rinsed\n1/4\ncup\nda’ah\n(recipe above)\n1/2\ncup\nsalsa\n(recipe above)\n1/2\ncup\nfried onions\n(recipe above)\nShatta\n(recipe above)\nDirections\nFor the Fried Shallots and Shallot-Infused Oil:\nIn a 10-inch skillet, combine oil and shallots over medium heat, and cook, stirring often, until shallots are golden brown and crisp, 20 to 30 minutes.\nSerious Eats / Kevin White\nStrain through a fine-mesh strainer into a heatproof bowl. Transfer shallots to a paper-towel lined plate to drain and season with salt. Set shallot-infused oil aside to cool. Store the fried shallots in an airtight container until you are ready to use. Store the shallot-infused oil in a clean jar once cooled.\nSerious Eats / Amanda Suarez\nFor the Salsa\n: In a medium saucepan, heat 2 tablespoons of shallot-infused oil over medium-low heat until shimmering. Add garlic and cook, stirring constantly, until garlic is fragrant and golden brown, 1 to 2 minutes. Whisk in vinegar, tomato passata, sugar, cumin, and coriander. Adjust heat to low and simmer until slightly thickened, about 10 minutes. (The sauce should have the consistency of a marinara; if it becomes too thick, loosen the sauce with additional water as needed.) Remove from heat and set aside uncovered; remove 1/4 cup salsa and set aside for shatta.\nSerious Eats / Kevin White\nFor the Da’ah:\nIn a small saucepan, heat 2 tablespoons shallot-infused oil over medium-low heat until shimmering. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Whisk in vinegar, water, lime juice, and cumin. Season with salt to taste. (If sauce is too acidic, add one or two tablespoons of water.) Remove from heat and set aside. Wipe saucepan clean to prepare the shatta.\nSerious Eats / Kevin White\nFor the Shatta:\nIn the now-clean small saucepan,\nheat 1 tablespoon\nshallot-infused oil over medium-low heat until shimmering. Add red pepper flakes, stirring constantly until fragrant, 30 seconds to 1 minute. Add garlic, and cook, stirring constantly, until fragrant, about 1 minute. Stir in tomato paste until well combined, followed by 1/4 cup salsa (prepared in step 3) and ground cumin. Simmer on low heat until slightly thickened, 2 minutes. Remove from heat and season with salt to taste. Set aside. (See notes.)\nSerious Eats / Kevin White\nFor the Koshari:\nIn a small saucepan or kettle, bring 2 cups (240ml) of water to a boil, set aside. In a 6-quart heavy-bottom pot, heat 1/4 cup shallot oil over medium-low heat until shimmering. Add vermicelli, stirring to coat in oil until they are a deep amber color, about 4 minutes. Add rice and elbow pasta to vermicelli and stir until evenly coated in the oil, 1 to 2 minutes. Stir in the black lentils. Pour in the 2 cups of freshly boiled water; there should be just enough to cover the ingredients. Add cumin, coriander, 1/2 teaspoon salt, and pepper, and bring to a boil over high heat, cooking until all the water has been absorbed, about 5 minutes. Reduce heat to medium, cover with lid, and cook until rice and lentils are tender, about 3 minutes. Let rest off heat for 1 minute, then uncover the pot and, using a fork, fluff rice and season with salt to taste.\nSerious Eats / Kevin White\nTo Assemble:\nTransfer koshari to a large serving dish. Drizzle koshari with da’ah and remaining salsa, top with chickpeas, and garnish with the prepared fried shallots. Serve warm with remaining sauce and shatta on the side.\nSerious Eats / Kevin White\nSpecial Equipment\n10-inch nonstick or cast iron skillet, fine-mesh strainer, medium saucepan, small saucepan, large heavy-bottom pot\nNotes\nThis recipe can be halved or doubled.\nThe shatta should have a similar texture slightly thicker than hot sauce, like that of sriracha. Sriracha or store-bought chile garlic sauce can be substituted for homemade shatta.\nMake-Ahead and Storage\nThe sauces can be refrigerated in airtight containers for up to 3 days. The fried onions can be made 1 day in advance and stored in an airtight container at room temperature.\nThe koshari can be stored in an airtight container or zip-top bag and frozen for up to 1 month.\nTo reheat koshari in the oven: Preheat the oven to 350ºF (175ºC). Place koshari in a baking dish, cover tightly with aluminum foil, heat until warmed through, about 15 minutes.\nTo reheat in the microwave, place koshari in a microwave-safe container and heat until warm, about 90 seconds.\nThe Latest\nWhite Rice\nChickpeas\nVegetarian\nLentils",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/koshari-egyptian-lentils-rice-and-pasta.webp?"
}