{
  "url": "https://www.seriouseats.com/kotlet-persian-ground-meat-and-potato-patties-recipe-8421664",
  "image_url": "https://www.seriouseats.com/thmb/5ZZSHIGR-fVg85yOrkSIrjnbD3U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-VyTran-Kotlet-NaderMehravari-29-ba19a1160a9647c5b8492e16173e60b8.jpg",
  "tags": [
    "Ground Beef",
    "The Latest",
    "Middle Eastern",
    "Frying"
  ],
  "title": "Kotlet (Persian Ground Meat and Potato Patties)",
  "full_text": "Kotlet (Persian Ground Meat and Potato Patties)\nClose\nJump to recipe\nPrep\n25 mins\nCook\n60 mins\nTotal\n85 mins\nServes\n8\nMakes\n24 Patties\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n680\ng\n)\nrusset potatoes\n, peeled, cut in 2-inch chunks, and rinsed under cold running water\nKosher salt\n4\nlarge\neggs\n1\npound\n(\n450\ng\n)\nground beef\n,\nground lamb\n, or a\ncombination\n1\nteaspoon\nground turmeric\n1/2\nteaspoon\nfreshly ground black pepper\nAll-purpose flour\n, for dusting the patties\nExtra-virgin olive oil\n,\nneutral vegetable oil\n, or a\ncombination\n, for pan-frying\nDirections\nIn a large saucepan, cover the potatoes with at least 1 inch cold water. Season with salt (the water should taste seasoned but not unpleasantly so). Bring to a boil over medium-high heat, then reduce heat to maintain a gentle simmer and cook until potatoes are tender, approximately 15 minutes.\nSerious Eats / Nader Mehravari\nDrain potatoes into a colander and then briefly rinse with warm running water. Let stand in colander until the potatoes' residual heat dries them slightly, 1 to 2 minutes.\nSerious Eats / Nader Mehravari\nPress the cooked potatoes through a ricer or a food mill into the now-empty saucepan. Alternatively, mash well with a potato masher or whisk.\nSerious Eats / Nader Mehravari\nIn a large mixing bowl or in a stand mixer fitted with the paddle attachment, beat the eggs vigorously until foamy.\nSerious Eats / Nader Mehravari\nAdd ground meat, ground turmeric, pepper, and 2 1/2 teaspoons (8g) salt and mix either by hand or with the stand mixer until ingredients are well combined.\nSerious Eats / Nader Mehravari\nAdd mashed potatoes and mix well until ingredients are thoroughly combined into a uniform sticky mass. (I use my bare hand to do this, which is not only the fastest and most effective method, but also gives you a feel for the mixture that you will be making patties from.)\nSerious Eats / Nader Mehravari\nPreheat oven to 250°F (120°C). Line a baking sheet with parchment paper. Scoop out 1 3/4–ounce (50g) portions (3 to 4 tablespoons) of the mixture onto the parchment paper (I use my #20\nice cream disher\nto do this).\nSerious Eats / Nader Mehravari\nSpread flour in a pie plate or wide, shallow bowl. Set a wire rack inside a rimmed baking sheet.\nIn a large cast-iron skillet or stainless-steel sauté pan, heat 1/8 inch oil over medium heat until shimmering (you can also tell whether the oil is hot enough if a couple of pea-size pieces of the mixture dropped in sizzle vigorously).\nSerious Eats / Nader Mehravari\nVery lightly dredge 1 portion of meat mixture in flour, then shake off excess flour. Gently form into an oval patty approximately 1/2 inch thick, and carefully place in the skillet. Using a soup spoon, gently press a slight dimple, no more than 1/8 inch deep, into the middle of the patty.\nSerious Eats / Nader Mehravari\nRepeat dredging, forming patties, and putting in the skillet until the skillet is full but not crowded; leave about 1/2 inch space between patties. (I can comfortably fit 7 or 8 patties in my 12-inch cast iron skillet.)\nSerious Eats / Nader Mehravari\nCook until the first patty that you have placed in the skillet is deep brown on the bottom, about 8 minutes. Flip patty, then continue to flip subsequent patties as each browns sufficiently, and cook until the second side is deep brown, 4 to 5 minutes longer. Transfer cooked patties to prepared wire rack and keep warm in oven.\nSerious Eats / Nader Mehravari\nContinue forming and frying until all of the mixture has been used and all the patties have been pan-fried.\nSerious Eats / Nader Mehravari\nSpecial Equipment\nLarge sauce pan, colander, ricer or food-mill, pie plate or wide shallow bowl, large cast-iron skillet or large stainless-steel sauté pan\nNotes\nKotlet is an excellent reuse of leftover mashed potatoes from holiday dinners.\nThis recipe can easily be doubled if you want extra leftovers. If making two batches, although it’s not critical, do consider replacing the oil in the skillet after the first recipe's worth as, by then, some of the dredging flour that has come off the patties has burned.\nMake-Ahead and Storage\nThe potatoes can be cooked, mashed, and stored in an airtight container in the refrigerator a day or two ahead of time. I don’t recommend mixing all the ingredients ahead of time because the eggs get deeply absorbed by the mashed potatoes and ground meat, turning the mixture into a very dense mass which makes it harder to form the patties and changes the texture of the kotlets.\nAfter the cooked kotlets have been thoroughly cooled, they can be transferred to an airtight container and stored in the refrigerator for about a week—although they will disappear much faster than that! Kotlets also freeze very well if stored in freezer-safe plastic bags or containers.\nCold cooked kotlets can easily be warmed up if zapped for a minute or two in the microwave but will not be crispy. The best way to heat up kotlets and restore their external crispiness is to warm them up in your toaster oven or full-size oven at 300°F (150°C) for about 10 minutes. If the kotlets have been frozen, there’s no need to defrost them; just increase the heating time to about 15 minutes. You can tell they are ready when you see tiny bubbles of oil forming on the surface.\nGround Beef\nThe Latest\nMiddle Eastern\nFrying",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/kotlet-persian-ground-meat-and-potato-patties.webp?"
}