{
  "url": "https://www.seriouseats.com/labaniyeh-bil-ruz-yogurt-rice-porridge-8718740",
  "image_url": "https://www.seriouseats.com/thmb/_B-swAyr70nZP5XOm2qGpqN3Bzk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/210427-LABINYEH-JillianAtkinson-9-a18aa3266e0c448fb6269d01f342dc9b.jpg",
  "tags": [
    "Middle Eastern",
    "White Rice",
    "Quick Dinners",
    "Yogurt & Cultured Dairy"
  ],
  "title": "Labaniyeh bil Ruz (Garlicky Yogurt and Rice Porridge)",
  "full_text": "Labaniyeh bil Ruz (Garlicky Yogurt and Rice Porridge)\nClose\nJump to recipe\nCook\n20 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(450g)\nfull-fat\nplain or\nGreek yogurt\n1\nteaspoon\ncornstarch\nKosher or\nsea salt\n1\ntablespoon\n(15ml)\nextra-virgin olive oil\n4\ncloves\ngarlic\n, minced\n1\nteaspoon\n(5ml)\nfresh lemon juice\n(optional)\n2 cups (about 11 ounces;\n310\ng\n)\ncooked plain\nmedium- or\nshort-grain white rice\n1/4\ncup\n(1 ounce; 25g) toasted or fried\npine nuts\nor slivered almonds, for garnish (optional)\nCrushed dried mint\n, for garnish (optional)\nDirections\nIn a 3- to 4-quart stainless-steel saucepan or enameled Dutch oven, combine yogurt, 2 cups (475ml) water, and cornstarch and bring to a boil over medium-high heat, whisking constantly to prevent curdling (you do not want the yogurt to break into curds, so constant whisking until it boils is absolutely essential). Reduce heat to a bare simmer, whisking occasionally to prevent scorching. Season with salt.\nJillian Atkinson\nWhile the yogurt simmers, combine olive oil and garlic in a small skillet and set over medium heat. Cook, stirring and swirling the skillet often, until garlic is fragrant but not browned, 1 to 2 minutes.\nJillian Atkinson\nPour the garlic and its oil into the yogurt and stir. The sauce should be quite sour, but will vary based on the yogurt used; add optional lemon juice, if needed.\nJillian Atkinson\nStir rice into the yogurt until well combined; season with salt, if needed. Increase heat slightly and bring to a simmer, then cook, stirring often, until you reach a porridge-like consistency similar to a thin risotto or rice pudding, about 15 minutes; you may need to add more water depending on the rice you are using, but keep in mind that the consistency will also thicken as it cools.\nJillian Atkinson\nTo serve, ladle the rice into shallow bowls and, if using, top with the toasted nuts and/or dried mint.\nJillian Atkinson\nNotes\nTo reheat any leftovers, add water and reheat slowly on the stove, adjusting seasoning if needed.\nMake-Ahead and Storage\nLabaniyeh bil ruz can be refrigerated in an airtight container for up to 5 days. Reheat slowly on the stovetop, thinning with water and adjusting seasoning as needed.\nMiddle Eastern\nWhite Rice\nQuick Dinners\nYogurt & Cultured Dairy",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/labaniyeh-bil-ruz-garlicky-yogurt-and-rice-porridge.webp?"
}