{
  "url": "https://www.seriouseats.com/lactation-cookie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/01fKKlUTMxGrZl6alH526ZEC-JU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190708-lactation-cookies-vicky-wasik-16-86cb59aad42c454698b63a7a65861c3c.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Chocolate",
    "Oats",
    "Nuts & Seeds"
  ],
  "title": "Lactation Cookies",
  "full_text": "Lactation Cookies\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\nAbout 30 mins\nTotal\n45 mins\nServes\n40 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dry Mix:\n7\nounces\nold-fashioned rolled oats\n, not instant or thick-cut (about\n2\ncups\n;\n200\ng\n)\n6\nounces\nchocolate chips\n(about\n1\nheaping cup\n;\n170\ng\n), preferably a blend of percentages and styles (see our list of favorite supermarket chocolate chips for recommendations), plus more for garnishing\n5\nounces\ntoasted macadamia nuts\n(about\n1\nheaping cup\n;\n140\ng\n), roughly chopped\n3\nounces\ncommercial oat flour\n, such as Bob’s Red Mill (about\n3/4\ncup\nplus\n1\ntablespoon\n;\n85\ng\n); not homemade (see note)\n3\nounces\nnon-bitter brewer's yeast powder\n, such as\nBlueBonnet\n(about\n2/3\ncup\n, spooned;\n85\ng\n)\n2 1/2\nounces\nall-purpose flour\n, such as\nGold Medal\n(about\n1/2\ncup\n, spooned;\n70\ng\n)\n2\nounces\nflax meal\n(about\n1/2\ncup\n, spooned;\n55\ng\n)\nFor the Cookie Dough:\n8\nounces\nunsalted butter\n(about\n16\ntablespoons\n;\n225\ng\n), soft but cool, about 65°F (18°C)\n7\nounces\nwhite sugar\n(about\n1\ncup\n;\n200\ng\n)\n2\nounces\nbarley malt syrup\n, such as\nEden Foods\n(about\n3\ntablespoons\n;\n55\ng\n)\n1\nounce\nvanilla extract\n(about\n2\ntablespoons\n;\n30\ng\n)\n1 1/4\nteaspoons\nbaking soda\n1 1/4\nteaspoons\nground cinnamon\n1\nteaspoon\nground ginger\n3/4\nteaspoon\n(\n3\ng\n)\nDiamond Crystal kosher salt\n, or more to taste; for table salt, use about half as much by volume or the same weight\n1\nlarge\negg\n(about\n1 3/4\nounces\n;\n50\ng\n), straight from the fridge\nDirections\nFor the Dry Mix:\nIn a large bowl, combine rolled oats, chocolate chips, macadamia nuts, oat flour, brewer's yeast powder, all-purpose flour, and flax meal, tossing with a flexible spatula until mixture is completely homogenized. Proceed immediately to the next step or transfer the dry mix to an airtight container and store at cool room temperature until the date stamped on the package of macadamia nuts.\nSerious Eats / Vicky Wasik\nFor the Cookie Dough:\nSet oven rack to middle position and preheat to 350°F (180°C). In the bowl of a stand mixer fitted with a paddle attachment, combine butter, sugar, barley malt syrup, vanilla extract, baking soda, cinnamon, ginger, and salt. Mix on low speed to combine, then increase to medium and cream until soft, pale, and light, about 5 minutes. Along the way, pause to scrape the bowl and beater using a flexible spatula.\nSerious Eats / Vicky Wasik\nWhile mixing on medium speed, add egg and continue beating until smooth and homogeneous, scraping bowl as needed. Reduce speed to low and add dry mix all at once. Continue mixing until thoroughly incorporated, with no visible patches of dry mix. Scrape bowl and beater with flexible spatula, then fold dough a few times by hand to be sure the texture is even.\nSerious Eats / Vicky Wasik\nUsing a 2-tablespoon cookie scoop, divide dough into approximately 40 portions. If you like, top each piece with a few extra chocolate chips for garnish. Arrange up to 12 portions of dough on a parchment-lined half-sheet pan and transfer remaining dough to a heavy-duty zipper-lock bag for cold storage. The dough can be refrigerated for about 2 weeks or frozen for up to 3 months, then thawed to about 70°F (21°C) before being baked as directed.\nSerious Eats / Vicky Wasik\nBake portioned freshly made or thawed dough on parchment-lined half-sheet pan until cookies are puffy and golden brown and firm to the touch around the edges, but a little soft and fragile in the center, about 14 minutes. Enjoy warm, or let cookies cool and transfer to an airtight container, where they can be stored for up to 1 week at room temperature.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\n2-tablespoon cookie scoop\n,\nflexible spatula\n,\nhalf-sheet pan\nNotes\nCommercial oat flour is made from whole, raw oat groats milled to a texture as fine as that of traditional flour. Homemade \"oat flour\" generally starts with rolled oats ground in a food processor; not only does this produce a coarser texture, but the composition is different as well, as rolled oats are made from steamed husked oat groats, which reduces their thickening power and nutritional value. Commercial oat flour thus provides a higher \"dose\" of oats than rolled oats alone, while also acting as a better thickener for the cookies.\nMake-Ahead and Storage\nThe dry mix can be stored in an airtight container at cool room temperature until the date stamped on the package of macadamia nuts.\nIn a heavy-duty zip-top bag, the dough can be refrigerated for about two weeks or frozen for up to three months, then thawed to about 70°F (21°C) before being baked as directed. Once baked, the cookies will keep for about one week in an airtight container at cool room temperature.\nRead More\nVegan Lactation Cookies\nBeyond Casseroles: What to Cook for New Parents\nCookies\nBaking\nChocolate\nOats\nNuts & Seeds",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lactation-cookies.webp?"
}