{
  "url": "https://www.seriouseats.com/lacto-fermented-dill-pickle-recipe",
  "image_url": "https://www.seriouseats.com/thmb/UxmMjRufAmPjSMANReq_3seY9tU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__08__20170808-preservation-acid-pickling-vicky-wasik-15-b3c5c7b0b1494aa285a99689aa70bae5.jpg",
  "tags": [
    "Pickling",
    "Fermentation",
    "No-Cook",
    "Cucumbers",
    "Summer Snacks & Appetizers"
  ],
  "title": "Lacto-Fermented Dill Pickles",
  "full_text": "Lacto-Fermented Dill Pickles\nClose\nJump to recipe\nPrep\n10 mins\nActive\n45 mins\nFermenting Time\n504 hrs\nTotal\n504 hrs 10 mins\nServes\n10 pickles\nMakes\n1 quart jar\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\nplus\n2\ntablespoons\npickling salt\nor other\npure salt\n(\n3 3/4\nounces\n/\n105\ng\n), divided\n10\npickling cucumbers\n(\nnumber-one or number-two-size\n; see note)\n3\ntablespoons\nwhole\nmustard seeds\n, divided\n1\ntablespoon\nwhole\nallspice\n1\ntablespoon\nwhole\njuniper berries\n1\ntablespoon\nground turmeric\n2\nteaspoons\ncoriander seeds\n5\nwhole\ncloves\n1\nteaspoon\nground ginger\n2\nbay leaves\n, crushed\n1\nsmall (\n2-inch\n)\ncinnamon stick\n, broken into pieces\n1\nwhole\nstar anise\n, broken into pieces (optional)\n1/4\ncup\nthinly sliced\nwhite onion\n(from about\n1/4\nmedium\nonion\n)\n2\ncloves\npeeled\ngarlic\n1\nstem\nof\nwhole, mature dill weed\n, including flower, or\n1\nmedium-size tuft\nof\nyoung feather-like dill\n1\nquart\nwater\n(\n1\nliter\n), preferably distilled (see note)\nDirections\nIn a large bowl, combine 1 quart (1 liter) cold water with 1/4 cup of salt, stirring to dissolve the salt. Meanwhile, wash cucumbers, then trim off the flower-end (opposite of the stem) using a paring knife. Place cucumbers in cold saltwater bath. Let stand while you prepare the spice mixture.\nIn a small bowl, stir together 2 tablespoons of mustard seeds with the allspice, juniper, turmeric, coriander, cloves, ground ginger, bay leaves, cinnamon, and star anise, if using. Measure out 1 tablespoon pickling spice blend and reserve the rest for a future batch.\nSerious Eats / Vicky Wasik\nWash 1 (1-quart) glass canning jar with warm soapy water and rinse well. Pack the sliced onion, garlic, dill, 1 tablespoon pickling spice, and remaining 1 tablespoon mustard seeds into the jar, pressing firmly into the bottom.\nSerious Eats / Vicky Wasik\nIn a medium bowl, stir together remaining 2 tablespoons salt with 1 quart cold water until salt is dissolved. Drain cucumbers and pack into the jar. Pour saltwater brine over cucumbers until covered. Close jar, fitting it with a Pickle Pipe or other airlock system for canning jars.\nSerious Eats / Vicky Wasik\nPlace fermenting vessel in a cool, dry location away from direct sunlight to ferment. Ideal fermentation temperature is 60°F (16°C) to 70°F (21°C). Dry basements are ideal as they maintain a relatively consistent temperature. Check on your fermenting vessel every few days, looking for any evidence of spoilage or rot. You may notice some whitish growth; this is yeast and can be skimmed (or, if you're like me, you can toss the batch if you see yeast, as it can affect the flavor of the pickles). Your crock should develop a sour aroma; if it smells of mold or rot and the cucumbers are gray, soft, or otherwise discolored, your batch has been contaminated and must be discarded.\nThe exact fermentation time is hard to predict, but generally it takes about 3 weeks to reach the half-sour stage and 6 weeks to reach the full-sour stage. When your pickles reach your desired sourness level, transfer to the refrigerator. The finished pickles can be refrigerated for up to 2 months.\nVariation:\nTo make a Polish-style vinegar-fermented hybrid pickle, follow the recipe as written, adding 1 cup of white vinegar for every quart of water. This method comes directly from my husband’s family.\nSpecial Equipment\n1-quart glass canning jar, Pickle Pipe or other\nairlock system for canning jars\nNotes\nPickling cucumbers are rated by size using numbers. \"Number one\" cucumbers are smaller than \"number two\" cucumbers; either will work here, though larger ones may not all fit into the jar. This recipe can be increased by keeping the salt-to-water-to-cucumber ratios intact. The recipe calls for distilled water; in areas where water quality is good, this isn't necessary, but if you are unsure, or if you have poor water quality, distilled water will help guarantee a good fermentation.\nMake-Ahead and Storage\nPickles can be refrigerated in an airtight jar for up to 2 months.\nRead More\nThe Science of Lactic Acid Fermentation\nThe Essential Tools You Need for Fermentation at Home\nHomemade Sauerkraut Recipe\nFermented Radish Slices Recipe\nGarlic Dill Pickles Recipe\nPickling\nFermentation\nNo-Cook\nCucumbers\nSummer Snacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lacto-fermented-dill-pickles.webp?"
}