{
  "url": "https://www.seriouseats.com/lacy-brown-butter-and-ricotta-cookies",
  "image_url": "https://www.seriouseats.com/thmb/apPxDpBp0XjMNcCj7tuUgDXnFDY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__01__20180129-ricotta-cookies-vicky-wasik-11-1d837d0393a04c97a85d1f96cd6f2728.jpg",
  "tags": [
    "Cookies",
    "Ricotta",
    "Easter Desserts",
    "Christmas Cookies"
  ],
  "title": "Lacy Brown Butter and Ricotta Cookies",
  "full_text": "Lacy Brown Butter and Ricotta Cookies\nClose\nJump to recipe\nPrep\n10 mins\nCook\n70 mins\nActive\n15 mins\nCooling Time\n25 mins\nTotal\n105 mins\nServes\n35 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n5\nounces\nunsalted butter\n(about\n10\ntablespoons\n;\n140\ng\n)\n1\nleftover vanilla bean pod\n, optional (see\nthis article on working with leftover vanilla\n)\n7\nounces\nplain or\ntoasted\nsugar\n(about\n1\ncup\n;\n195\ng\n)\n2\nteaspoons\n(\n10\ng\n)\nvanilla extract\n1\nteaspoon\n(\n4\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\n(\n1.25\ng\n)\nbaking soda\n4\nounces\ncold ricotta\n(about\n1/2\ncup\n;\n110\ng\n), strained if watery (see note)\n4 1/2\nounces\nall-purpose flour\n, such as\nGold Medal\n(about\n1\ncup\n, spooned;\n125\ng\n)\nDirections\nGetting Ready\n: In a large skillet, melt butter over medium-low heat. When it has completely melted, add vanilla pod (if using) and increase heat to medium. Simmer, stirring and scraping with a heat-resistant spatula while butter hisses and pops. When butter is golden yellow and perfectly silent, remove from heat and pour into a medium bowl, making sure to scrape up all the toasty brown bits from along the bottom. Cool until slightly thickened and opaque, but still slightly warm, around 80°F (27°C). This will take about 75 minutes at room temperature or 25 minutes in the fridge; if refrigerating, stir butter every 6 minutes or so to prevent it from hardening around the edges of the bowl.\nSerious Eats / Vicky Wasik\nMake the Dough\n: Adjust oven rack to middle position and preheat to 350°F (180°C). When brown butter has cooled, remove vanilla pod (if using) and stir in sugar, vanilla extract, salt, and baking soda. Stir until baking soda is well distributed, about 1 minute, then fold in cold ricotta. Once ingredients are combined, stir in flour to form a soft dough.\nSerious Eats / Vicky Wasik\nPortioning the Dough\n: Divide into 1-tablespoon portions and arrange on a parchment-lined half sheet pan, leaving about 4 inches between cookies to account for their significant spread. (If you like, the dough can be placed on a parchment-lined plate and frozen until firm, then transferred to a zip-top bag for storage. It can be refrigerated for up to 1 week or frozen for up to 3 months.)\nSerious Eats / Vicky Wasik\nBake until cookies are lacy, thin, and golden brown around the edges, but still rather pale in the middle, about 12 minutes. Cool completely on baking sheet, as the cookies will be doughy and soft while warm. Portion and bake remaining cookie dough (see note). Enjoy after cooling, or store up to 1 week in an airtight container at room temperature.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nHalf sheet pans\n,\none-tablespoon cookie scoop\n(optional)\nNotes\nThe appearance of these cookies will vary with the fat and moisture contents of the ricotta, which differ wildly from brand to brand, but their delicious flavor will remain the same.\nIf you have two half sheet pans, you can save a lot of time by baking a batch of cookies on the second sheet as the batch fresh from the oven cools.\nRead More\nTaste Test: The Best Ricotta Cheese\nFiori di Sicilia Cookies\nThe Serious Eats Guide to Cookie Styles\nCookies\nRicotta\nEaster Desserts\nChristmas Cookies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lacy-brown-butter-and-ricotta-cookies.webp?"
}