{
  "url": "https://www.seriouseats.com/lahmajun-armenian-flatbread-with-spiced-lamb-recipe-7368970",
  "image_url": "https://www.seriouseats.com/thmb/r0QDmGQZj4uD0rOd4BHmT-mZAz0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230317-SEA-20230313-LAHMAJUN-ANDREW-JANJIGIAN-HERO-0e2a574dcd8d4edabedcd9f70340dd4b.JPG",
  "tags": [
    "Ground Lamb",
    "The Latest",
    "Baking",
    "Armenian"
  ],
  "title": "Lahmajun (Armenian Flatbread With Spiced Lamb)",
  "full_text": "Lahmajun (Armenian Flatbread With Spiced Lamb)\nClose\nJump to recipe\nPrep\n90 mins\nCook\n30 mins\nProofing Time\n10 hrs\nTotal\n12 hrs\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough (see note):\n400\ng\n(\n2 3/4\ncups\nplus\n2\ntablespoons\n)\nbread flour\n2\ng\n(\n1/2\nteaspoon\n)\ninstant yeast\n15\ng\n(\n1\n​​\ntablespoon\n)\nsugar\n9\ng\n(\n1\ntablespoon\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n265\ng\n(\n1\ncup\nplus\n1\ntablespoon\n)\nroom-temperature water\n(about 75˚F/24˚C)\n23\ng\n(\n2\nteaspoons\nplus\n1\ntablespoon\n)\nvegetable oil\n, divided\nFor the Topping:\n1\nlarge\nred bell pepper\n(\n8\nounces\n;\n225\ng\n), stemmed, seeded, and cut into 1-inch pieces\n1\nsmall\nyellow onion\n(\n4\nounces\n;\n115\ng\n), quartered lengthwise\n1 1/4\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume\n1/4\ncup\n(\n4\ng\n)\nfresh parsley leaves and tender stems\n3\ntablespoons\n(\n45\ng\n)\nmild biber salçasi pepper paste\n(see note)\n2\ntablespoons\n(\n30\ng\n)\ntomato paste\n2\nmedium\ngarlic cloves\n(\n10\ng\n), peeled\n1\nteaspoon\nground allspice\n1\nteaspoon\npaprika\n1\nteaspoon\nground cumin\n1/2\nteaspoon\nfreshly ground black pepper\n8\nounces\n(\n225\ng\n)\nground beef\n, at least 15% fat, or\nground lamb\nFor the Salad (optional):\n1\nmedium\nred onion\n(\n8\nounces\n;\n225\ng\n), thinly sliced\n1/2\ncup\n(\n8\ng\n)\nfresh parsley leaves and tender stems\n, coarsely chopped\n2\ntablespoons\nground sumac\n(see note)\n1\ntablespoon\n(\n15\nml\n)\nextra virgin olive oil\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice\n1/2\nteaspoon\nDiamond Crystal kosher salt\n, plus more to taste; for table salt, use half as much by volume\n1/4\nteaspoon\nfreshly ground black pepper\n, plus more to taste\nFor Serving:\n1\nfruit (2-3/8\" dia)\nlemon\nDirections\nFor the Dough:\nIn a medium bowl, whisk together bread flour, yeast, sugar, and salt until thoroughly combined. In a separate medium bowl, combine water and 10g (2 teaspoons) oil. Add half of flour mixture to oil-water mixture and stir with a dough whisk or a whisk until a smooth batter forms. Add remaining flour mixture and stir with a whisk or knead by hand until a shaggy dough forms and no dry flour remains. Cover bowl with plastic wrap or a clean kitchen towel and let sit at room temperature for 30 minutes.\nSerious Eats / Andrew Janjigian\nUsing lightly-moistened hands, knead dough in bowl gently until it tightens up, 10 to 20 seconds, then gather dough into a smooth ball. Cover bowl with plastic wrap or a clean kitchen towel and let stand at warm room temperature (75˚F/24˚C) until dough is puffy and about 1 1/2 times in volume, 1 to 2 hours.\nSerious Eats / Andrew Janjigian\nOn a lightly-floured work surface, divide dough into 4 equal portions (7 ounces; about 175g each). Add remaining 13g (1 tablespoon) oil to now-empty dough bowl and set aside. Shape each portion into a tight, smooth ball, making sure to seal seams on the underside tightly. Working one at a time, set each dough ball in the oil-containing bowl and, using your hands, turn to evenly coat the exterior. Transfer dough balls to a lightly-oiled rimmed baking sheet or individual containers (such as pint-sized deli containers), seam side down. Cover loosely but completely with plastic wrap and refrigerate for at least 8 hours and up to 24 hours.\nSerious Eats / Andrew Janjigian\nFor the Topping:\nIn the bowl of a food processor fitted with a metal blade, combine bell pepper, onion, and 1/2 teaspoon salt. Process, scraping down sides of bowl as needed, until finely chopped, 10 to 20 seconds. Transfer mixture to a fine-mesh strainer set over a medium bowl and let drain for at least 10 minutes.\nSerious Eats / Andrew Janjigian\nUsing a flexible spatula, press on onion-pepper mixture to extract any remaining liquid, then return to food processor bowl; discard drained liquid. Add parsley, pepper paste, tomato paste, garlic, allspice, paprika, cumin, pepper, and remaining 3/4 teaspoon salt. Process, scraping down sides of bowl as needed, until mixture is finely chopped, 10 to 20 seconds.\nSerious Eats / Andrew Janjigian\nUsing your hands, break ground meat into walnut-sized chunks and distribute around bowl. Process, scraping down sides of bowl as needed, until mixture is just combined, 5 to 10 pulses. Transfer to an airtight container and use right away or refrigerate for up to 24 hours.\nSerious Eats / Andrew Janjigian\nFor the Salad (optional):\nMeanwhile, place red onion in a medium heatproof bowl, cover by at least 1 inch boiling water, and let stand for 5 minutes. Drain onion through a fine-mesh strainer then rinse for 10 seconds under cold running water and shake dry. Transfer to a clean kitchen towel or paper towel and pat dry. Return onion to now-empty bowl, along with parsley, sumac, olive oil, lemon juice, salt, and pepper. Stir to combine, season with salt and pepper to taste, and set aside.\nSerious Eats / Andrew Janjigian\nTo Assemble and Bake the Lahmajun:\nOne hour before baking, adjust an oven rack to the upper-middle position (rack should be 4 to 5 inches from broiler element), set a baking stone or steel on rack, and heat oven to 500˚F (or 550˚F, if your even allows it).\nSerious Eats / Andrew Janjigian\nThirty minutes before baking, remove topping from refrigerator and allow to warm slightly at room temperature, about 30 minutes.\nSerious Eats / Andrew Janjigian\nDust tops of dough balls liberally with flour, then transfer to a well-floured work surface, seam side down. Working one at a time, use the heel of your hand to press a dough ball into a 5-inch disk. Using a rolling pin, gently roll the disk into an 11- to 12-inch round, adding flour to top and underside of dough and countertop as needed to prevent sticking.\nSerious Eats / Andrew Janjigian\nTransfer to a well-floured baking peel (or a rimless cookie sheet if you don't have a baking peel). Scatter one-quarter of topping (1/2 cup; 125g) evenly over top of dough in 1-teaspoon amounts. Using the back of a spoon and your fingertips, gently flatten and spread topping into an even layer, leaving 1/8-inch border untopped.\nSerious Eats / Andrew Janjigian\nShake peel to loosen dough, then carefully slide lahmajun onto baking stone. Bake until bottom crust is browned and upper edges are lightly browned, 4 to 6 minutes. While lahmajun bakes, begin rolling next dough ball. Transfer baked lahmajun to a wire rack, stacking or overlapping them on the wire rack as they're finished. Repeat assembling and baking steps with the remaining dough balls and topping.\nSerious Eats / Andrew Janjigian\nOnce all 4 lahmajun are baked, return them to the oven, overlapping them to fit on the stone, until reheated, about 2 minutes (alternatively, you can eat them warm, room temperature, or cold—lahmajun are great at all temperatures). Serve lahmajun with onion-parsley salad, if desired, and lemon wedges.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nKitchen scale, food processor, rolling pin (preferably straight), baking steel or stone, wide pizza peel or rimless baking sheet, wire rack\nNotes\nFor best results, use a digital scale set in grams to measure ingredients for the dough. For the yeast, using a jeweler’s scale will give you the most precise measurement possible.\nBiber salçasi can be found in Middle Eastern grocery stores or online. If unavailable, increase volume of tomato paste to 3 tablespoons, paprika to 4 teaspoons, and add 1/8 to 1/4 teaspoon cayenne pepper.\nGround sumac can be found at Middle Eastern markets or online.\nMake-Ahead and Storage\nThe topping and salad can be made up to 24 hours in advance and refrigerated separately in airtight containers. Bring the salad to room temperature before serving.\nTo reheat lahmajun, place pairs of them on a baking sheet face to face (topping sides in contact with one another) and transfer to a 300˚F oven until hot and crisp, 10 to 12 minutes.\nGround Lamb\nThe Latest\nBaking\nArmenian"
}