{
  "url": "https://www.seriouseats.com/lamb-biryani",
  "image_url": null,
  "tags": [
    "Rice & Grain Mains",
    "South Asian",
    "Braised & Stewed Lamb",
    "Leg of Lamb",
    "Lamb"
  ],
  "title": "Lamb Biryani With Saffron, Yogurt, and Caramelized Onions",
  "full_text": "Lamb Biryani With Saffron, Yogurt, and Caramelized Onions\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 5 mins\nActive\n90 mins\nMarinating Time\n8 hrs\nTotal\n10 hrs 10 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n910\ng\n)\nboneless leg of lamb\n, trimmed of excess fat and cut into 1-inch (2 cm) cubes\n1\ncup\nplain, unsweetened full-fat yogurt\n6\nmedium\ngarlic cloves\n, peeled and finely grated\n1\n(2–inch piece)\nfresh ginger\n, peeled and grated\n3\nteaspoons\nDiamond Crystal kosher salt\n, divided; if using table salt, use half as much by volume\n1/4\ncup\n(\n60\nml\n) plus\n2\nteaspoons\n(\n10\nml\n)\nghee\nor\nneutral oil\n, such as\ngrapeseed\n, divided\n2\nlarge\nyellow or white onions\n(\n26\nounces\n;\n750\ng\ntotal), sliced thinly\n5\ngreen cardamom\npods\n, lightly cracked, divided\n1\ncinnamon\nstick\n4\ncloves\n2\ndried bay leaves\n1\nteaspoon\ngaram masala\n, store-bought or\nhomemade\n1\nteaspoon\nground Kashmiri chile\n(see note)\n1/2\nteaspoon\nground mace\n1/2\nteaspoon\nground turmeric\n1\ncup\n(\n240\nml\n)\nwater\nor\nlow-sodium stock\n(\nlamb\n,\nbeef\n, or\nchicken\n)\n1\nbunch\nfresh cilantro\nleaves and tender stems, chopped\n1\nbunch\nfresh mint leaves\n, chopped\n1\nfresh green\nchile\n, such as a\nserrano\nor\nThai bird\n, minced\n2\ncups\n(\n400\ng\n)\nbasmati rice\n1/4\ncup\n(\n60\nml\n)\nfresh lemon or lime juice\n1/4\ncup\n(\n60\nml\n)\nwhole milk\n20\nstrands\nof\nsaffron\n, divided\n2\nteaspoons\nrosewater\n2\nteaspoons\npandan (kewra/screwpine) water\n(see note)\nDirections\nPlace lamb in a 1 gallon (3.8L) zip-top bag. In a medium bowl, mix yogurt, garlic, ginger, and 1 1/2 teaspoons salt until combined, pour yogurt mixture over lamb, seal bag, and shake bag to coat lamb well. Leave zip-top bag in refrigerator to marinate overnight.\nSerious Eats / Qi Ai\nHeat 1/4 cup (60ml) ghee or oil in a Dutch oven or saucepan with a heavy bottom over medium heat. Add onions, season with a pinch of salt, and cook, stirring occasionally, until onions caramelize and turn dark brown (but not black), about 25 to 30 minutes.\nSerious Eats / Qi Ai\nReduce heat to low. Remove half of the caramelized onions and reserve to use as garnish for biryani. Add 3 green cardamom pods, cinnamon, cloves, bay leaves, garam masala, Kashmiri chile, mace, and turmeric, and sauté just until spices become fragrant, 30 to 45 seconds. Add lamb along with yogurt marinade, water or stock, cilantro, mint, and green chile. Stir to mix well, increase heat to medium-high, and bring liquid to a boil. Reduce heat to low, cover with lid, and cook for 30 to 45 minutes, stirring occasionally, until lamb is completely tender.\nSerious Eats / Qi Ai\nMeanwhile, as lamb cooks, prepare rice. Pick over rice for any debris, then place it in a fine-mesh strainer and rinse under cold running water, until runoff is no longer cloudy; drain well. Place rice in a bowl and cover with 4 cups (960ml) water and let stand for 30 minutes. Strain rice, discarding soaking water. In a large saucepan, combine rice with 4 cups cold water, lemon juice, remaining 1 1/2 teaspoons kosher salt, remaining 2 green cardamom pods, and remaining 2 teaspoons of ghee or oil and bring to a boil over medium heat. Boil for 2 minutes and then strain rice; discard cooking water. It will be partially cooked—if you break a grain of rice, you will see an outer translucent ring and a tiny, opaque inner ring.\nSerious Eats / Qi Ai\nWhen lamb is tender, remove lid and increase heat to medium, stirring often to prevent scorching, and cook until liquid starts to thicken and reduces to about 1 1/2 cups (360ml), about 5 minutes. Remove from heat. Using a clean, large wooden spoon or spatula, spread rice out in an even layer over meat in Dutch oven.\nSerious Eats / Qi Ai\nSet oven rack at the middle position and heat oven to 350°F (180°C). Place half the saffron threads in a mortar and pestle and grind to a fine powder. In a small saucepan placed over low heat, warm milk just until it starts to bubble, then turn off heat. Add ground saffron and remaining saffron strands to hot milk and let steep for 10 minutes.\nSerious Eats / Qi Ai\nSprinkle saffron-infused milk over rice, followed by rosewater and pandan water. Garnish top of the rice with reserved caramelized onions. Cover Dutch oven with two sheets of aluminum foil and crimp overhang to form tight seal, place lid over foil, and place Dutch oven in preheated oven for 20 minutes to let rice steam. Remove from oven and let stand for 5 minutes. Uncover pot and carefully peel off aluminum seal. Use a fork to loosen rice a little and serve immediately straight from Dutch oven. Alternatively, biryani can be transferred to a platter and served.\nSerious Eats / Qi Ai\nSpecial Equipment\nDutch oven\n, 3-quart\nsaucepan\n,\n2-quart saucepan\n,\nfine-mesh strainer\n,\nmortar and pestle\n, zip-top bag\nNotes\nThe ground Kashmiri chile can be replaced with a combination of 3/4 teaspoon ground smoked sweet paprika and 1/2 teaspoon ground cayenne.\nPandan water can be purchased at specialty food stores or online.\nMake-Ahead and Storage\nLamb biryani is best served immediately, but will keep in an airtight container for up to one week in the refrigerator.\nRead More\nThe Science of Yogurt Marinades\nBiryani-Style Roast Chicken Recipe\nVegetable Biryani Recipe\nQidreh (Palestinian Bone-In Lamb With Spiced Rice) Recipe\nHashweh (Palestinian Spiced Rice and Meat) Recipe\nMaqlubeh (Palestinian \"Upside Down\" Meat, Vegetables, and Rice) Recipe\nRice & Grain Mains\nSouth Asian\nBraised & Stewed Lamb\nLeg of Lamb\nLamb"
}