{
  "url": "https://www.seriouseats.com/lamb-and-prune-tagine-recipe-11681891",
  "image_url": "https://www.seriouseats.com/thmb/EE3cPDVA0wyWEFJLCeZ0AfAiEJU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250129-SEA-LambandPruneTagine-LarisaNiedle-Beauty2-17-00dff2570ad549bd8cc3af00da951e39.jpg",
  "tags": [
    "Braised & Stewed Lamb",
    "The Latest",
    "Moroccan"
  ],
  "title": "Lamb and Prune Tagine",
  "full_text": "Lamb and Prune Tagine\nClose\nJump to recipe\nCook\n2 hrs 30 mins\nTotal\n2 hrs 30 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Lamb:\n2\ntablespoons\n(\n30\nml)\nolive oil\n2\nmedium\nyellow onions\n(about\n1\npound\n;\n455\ng\n), diced\n3\nmedium\ncloves garlic\n(\n15\ng\ntotal), minced\n1 1/2\nteaspoons\nground turmeric\n1 1/2\nteaspoons\nground ginger\n1/2\nteaspoon\nground coriander\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt,\nplus more to taste; for table salt use half by volume\n1/4\nteaspoon freshly\nground black pepper\n2 1/2\npounds\n(\n1.13\nKg\n)\nboneless lamb neck\nor lamb stew meat (leg or shoulder or a combination), trimmed of excess fat and cut into 2- to 3-inch pieces\n1\nsmall\nbunch\ncilantro\n, stems and leave separated, stems tied into a bundle with kitchen twine and leaves reserved for garnish\n1/2\ncup\n(120\nml)\nhomemade chicken stock\nor\nhomemade vegetable stock\nor store-bought\nchicken broth\nor vegetable broth\nFor the Caramelized Prunes:\n1 1/2\ncups\nsoft\npitted prunes\n(\n10.5\nounces\n;\n300\ng\n)\n1/2\ncup\n(\n120\nml)\nhomemade chicken stock\nor\nhomemade vegetable stock\nor store-bought\nchicken broth\nor vegetable broth\n3\ntablespoons\n(\n45\nml\n)\nhoney\n1 1/2\nteaspoons\n(\n7.5\nml\n)\nolive oil\n3/4\nteaspoon\nground cinnamon\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\nFor Serving:\nReserved\ncilantro\nleaves from above\nLoaf of crusty\nbread\n,\ncouscous\n, or\ncooked rice\nToasted sesame seeds\nDirections\nFor the Lamb:\nIn a large Dutch oven or heavy-bottomed pot, heat oil over medium-low until shimmering. Add onions, cover, and cook, stirring occasionally, until onions are soft and translucent, 10 to 15 minutes.\nSerious Eats / Larisa Niedle\nAdd garlic, turmeric, ginger, coriander, salt, and pepper and cook, stirring occasionally, until fragrant, about 3 minutes.\nSerious Eats / Larisa Niedle\nAdd lamb pieces and stir to combine with onions and spices, then add stock or broth and cilantro bunch. Increase heat to medium-high and bring to a boil, then cover pot, reduce heat to low, and simmer, adjusting heat as needed to maintain a gentle simmer and stirring every 30 minutes to prevent sauce from sticking to bottom of pot, until meat is tender and separates easily when pressed with a fork, 2 to 2 1/2 hours. Sauce may thicken slightly during cooking, but pan should not be dry; if necessary, add more stock or water, 1 tablespoon at a time, until there is at least half an inch of sauce in pan. Season with salt to taste.\nSerious Eats / Larisa Niedle\nFor the Caramelized Prunes:\nOnce meat is cooked, in a medium saucepan, add prunes, vegetable stock, honey, olive oil, cinnamon, salt, and pepper and bring to a simmer over medium-low heat. Gently simmer until sauce thickens slightly into a dark syrup, about 7 minutes. Season with salt to taste.\nSerious Eats / Larisa Niedle\nTo Serve:\nDiscard cilantro bouquet from the lamb. Transfer lamb tagine to a serving bowl then arrange prunes with their syrup over lamb. Garnish with toasted sesame seeds and cilantro leaves. Serve with your choice of bread, couscous, or rice.\nSerious Eats / Larisa Niedle\nSpecial Equipment\nKitchen twine, large Dutch oven or heavy-bottomed pot, medium saucepan\nNotes\nIn traditional Moroccan tagine preparation, browning the meat is not typically done. However, if desired, you can brown the meat in 2 tablespoons of olive oil at the beginning of the recipe.\nMake-Ahead and Storage\nThe cooked lamb tagine and the prunes with syrup can be refrigerated separately in airtight containers for up to 5 days. Reheat on stovetop on medium heat, adding water if needed to prevent scorching. Add garnishes just before serving.\nBraised & Stewed Lamb\nThe Latest\nMoroccan"
}