{
  "url": "https://www.seriouseats.com/lane-cake-recipe-11717929",
  "image_url": "https://www.seriouseats.com/thmb/mhGwwyrlqzlcbOWCgBeRn4vCZlQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241203-SEA-AlabamaLaneCake-MorganHuntGlaze-Hero1-42-3a367f85889f4ce78fba5dbae6d5d5a0.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Recipes",
    "Baking",
    "Desserts"
  ],
  "title": "This Majestic Southern Cake Was One of Jimmy Carter’s Favorite Desserts",
  "full_text": "This Majestic Southern Cake Was One of Jimmy Carter’s Favorite Desserts\nClose\nJump to recipe\nPrep\n20 mins\nCook\n85 mins\nCooling and Resting Time:\n9 hrs 15 mins\nTotal\n11 hrs\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nBaking spray with flour\n8\nlarge\negg whites\n(\n8 1/2\nounces\n;\n240\ng\n), at room temperature\n15\nounces\nbleached cake flour\n(\n425\ng\n;\n3 1/3\ncups\n)\n15 3/4\nounces\ngranulated sugar\n(\n450\ng\n;\n2 1/4\ncups\n)\n1/2\nounce\nbaking powder\n(\n16\ng\n;\n4\nteaspoons\n)\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n8\nounces\nunsalted butter\n(\n227\ng\n;\n2\nsticks\n), at room temperature\n1 1/2\ncups\n(\n355\nml\n)\nwhole milk\n, at room temperature\n1/4\ncup\n(\n60\nml\n)\nneutral oil\n, such as canola\n1\ntablespoon\n(\n15\nml\n)\nvanilla extract\n1/4\nteaspoon\nalmond extract\nFor the Filling:\n12\nlarge\negg yolks\n(\n7\nounces\n;\n200\ng\n)\n10 1/2\nounces\ngranulated sugar\n(\n300\ng\n;\n1 1/2\ncups\n)\n6\nounces\nunsalted butter\n(\n170\ng\n;\n12\ntablespoons\n), at room temperature\n6\nounces\nfinely chopped toasted\npecans\n(\n170\ng\n;\n1 1/2\ncups\n)\n6\nounces\nfinely\nshredded unsweetened coconut\n(\n170\ng\n;\n1 1/2\ncups\n)\n6\nounces\ngolden raisins\n(\n170\ng\n;\n1 1/2\ncups\n), finely chopped\n6\nounces\ndried sweetened tart cherries\n(\n170\ng\n;\n1\ncup\n), finely chopped\n1/2\ncup\n(\n120\nml\n)\nbourbon\n2\nteaspoons\nvanilla extract\n1\nteaspoon\nfinely grated\norange zest\nfrom\n1\nmedium\norange\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Frosting:\n4\nlarge\negg whites\n(\n4 1/4\nounces\n;\n120\ng\n)\n8 3/4\nounces\ngranulated sugar\n(\n250\ng\n;\n1 1/4\ncups\n)\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/8\nteaspoon\ncream of tartar\n10\nounces\nunsalted butter\n(\n284\ng\n;\n20\ntablespoons\n), softened cut into 1-inch size pieces\nDirections\nFor the Cake:\nAdjust oven racks to lower-middle and middle position and preheat oven to 325°F (165ºC). Using baking spray with flour, evenly coat four 9-inch round cake pans. Line bottoms with parchment paper; set aside.\nSerious Eats / Morgan Hunt Glaze\nIn the bowl of a stand mixer fitted with the whisk attachment, beat egg whites on medium-low speed until frothy, about 1 minute. Increase speed to medium-high and beat until stiff but not dry, about 2 minutes. Using a flexible spatula, gently transfer egg whites into a separate bowl; set aside. Rinse and dry stand mixer bowl and clean whisk attachment.\nSerious Eats / Morgan Hunt Glaze\nIn the bowl of a stand mixer fitted with the paddle attachment, combine flour, sugar, baking powder, and salt, and mix on low speed to combine. Add butter, and beat on low speed until mixture is fine and crumbly and resembles damp sand with no visible pieces of butter, about 5 minutes. (If your mixer has a 5 quart or smaller capacity, use a bowl shield or wrap a clean kitchen towel around your mixer to prevent flour from flying out at the start of the mixing process). Add milk, oil, vanilla, and almond extract and beat on medium-low speed until smooth, about 3 minutes, stopping to scrape down sides with a flexible spatula as needed.\nSerious Eats / Morgan Hunt Glaze\nUsing a flexible spatula, gently fold beaten egg whites into batter mixture in 3 additions until no streaks remain. Divide batter evenly between prepared pans. (Each pan should have about 15 ounces or 425 g of batter.) Bake, rotating cake pans from top to bottom halfway through, until edges begin to pull away from sides of pan and top springs back gently to the touch, about 20 minutes. (See notes.)\nSerious Eats / Morgan Hunt Glaze\nTransfer pans to a wire rack and let cakes cool in pan for 15 minutes. Run an offset spatula or butter knife around the edges of the cake, then carefully invert onto wire rack. Let cool completely, about 1 hour.\nSerious Eats / Morgan Hunt Glaze\nFor the Filling:\nIn a medium saucepan, whisk egg yolks, sugar, and butter to combine. Cook over medium-low heat, whisking constantly, until mixture reaches 175°F (80ºC), about 10 minutes. Remove from heat and, using a heat-proof spatula, stir in pecans, coconut, raisins, cherries, bourbon, vanilla, orange zest, and salt until evenly combined. Transfer mixture to a large bowl and set aside until cooled to room temperature, about 45 minutes, stirring occasionally.\nSerious Eats / Morgan Hunt Glaze\nTo Assemble:\nPlace 1 cake layer on a waxed cardboard cake round. Set on a turntable and top with 1 1/3 cups filling (14 ounces; 396 g), using an offset spatula to spread it evenly from edge to edge. Repeat with remaining cake layers and filling, ending with a layer of cake. Wrap tightly in plastic wrap and refrigerate for at least 8 hours and up to 14 hours.\nSerious Eats / Morgan Hunt Glaze\nFor the Frosting:\nFill a small saucepan at least 1 inch of water and bring to a simmer over medium heat. In the bowl of a stand mixer, combine egg whites, sugar, salt, and cream of tartar. Set bowl over saucepan of simmering water, ensuring that the bottom of the bowl is not touching the water. Cook, using a flexible heat-proof spatula tostir and scrape constantly, until sugar is dissolved and mixture registers 165ºF (74ºC) on an instant-read thermometer, 4 to 5 minutes.\nSerious Eats / Morgan Hunt Glaze\nTransfer bowl to stand mixer fitted with a whisk attachment and beat on high speed until meringue is glossy, stiff, and cool to the touch, 10 to 12 minutes. With mixer on medium-high speed, add butter, about 2 tablespoons at a time, until fully incorporated, about 3 minutes. Increase speed to high and beat until light and fluffy, about 1 minute. Add vanilla and almond extract, and beat on medium speed until smooth and creamy, about 2 minutes.\nSerious Eats / Morgan Hunt Glaze\nUnwrap cake. Using an offset spatula, spread frosting evenly over top and sides of cake. Transfer to a serving plate and allow cake to come to room temperature before serving, about 30 minutes.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nStand mixer, waxed cardboard cake round, turntable, instant-read thermometer, offset spatula\nNotes\nIf you cannot fit all 4 pans in your oven at once or if you need to reuse pans, it’s OK to bake in batches. The batter can hold at room temperature for up to 1 hour.\nMake-Ahead and Storage\nOnce cooled, the individual cake layers can be wrapped tight in plastic and frozen for up to 3 months. Let thaw in fridge overnight before using.\nThe finished cake can be loosely covered with plastic wrap and kept at room temperature for up to 1 day or refrigerated for up to 3 days. Let cake come to room temperature before serving.\nCakes\nThe Latest\nRecipes\nBaking\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-majestic-southern-cake-was-one-of-jimmy-carters-favorite-desserts.webp?"
}