{
  "url": "https://www.seriouseats.com/lasagna-napoletana-sausage-smoked-cheese-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ND6p0gf59WBc1II518y8YypVdG8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__01__20150113-lasagna-napoletana-meatball-ragu-italian-food-lab-30-6002f876884246cbb76825085e5454cf.jpg",
  "tags": [
    "Italian",
    "Savory",
    "Mozzarella",
    "Ricotta",
    "Lasagna"
  ],
  "title": "Lasagna Napoletana (Lasagna With Sausage, Smoked Cheese, and Meatballs) Recipe",
  "full_text": "Lasagna Napoletana (Lasagna With Sausage, Smoked Cheese, and Meatballs) Recipe\nClose\nJump to recipe\nPrep\n60 mins\nCook\n5 hrs 30 mins\nActive\n90 mins\nResting Time\n10 mins\nTotal\n6 hrs 40 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\npork spare ribs\n(about\n1/2\nlarge\nrack\n), cut into\n3\nto\n4\nchunks\nKosher salt\nand\nfreshly ground black pepper\n3\ntablespoons\nextra-virgin olive oil\n, divided\n1\nlarge\nonion\n, finely chopped (about\n1 1/2\ncups\n)\n12\nmedium\ncloves garlic\n,\nfinely minced\n, divided\n1/2\nteaspoon\nred chile flakes\n1\nteaspoon\ndried oregano\n2\ncups\ndry white wine\n2\n(28-ounce) cans\nwhole peeled tomatoes\n, preferably\nD.O.P. San Marzano\n, crushed by hand in a large bowl\n1\n(\n2- to 3-inch\n)\nParmesan rind\n1\nbunch\nfresh basil\n1\npound\nmild sausage, in the casings\n(see note)\n2\nslices\nwhite bread\n, crusts removed\n2\nlarge\neggs\n6\nounces\nParmesan cheese\n, divided\n1/2\ncup\npicked fresh parsley leaves\nVegetable oil\n, for frying\n1\npound\nwhole-milk ricotta cheese\n(see note)\n1\npound\nfresh\nor\ndried lasagna noodles\n1\ntablespoon\nunsalted butter\n2/3\npound\nmozzarella cheese\n, cut into 1/2-inch cubes\n2/3\npound\nmozzarella cheese\nDirections\nAdjust oven rack to lower-middle position and preheat oven to 300°F. Season ribs with salt and pepper. Heat 2 tablespoons olive oil in a large Dutch oven over high heat until shimmering. Add ribs and cook without moving until well browned, 8 to 10 minutes. Flip and cook until second side is well browned, 5 to 7 minutes longer. Transfer to a plate and set aside.\nAdd onions to now-empty dutch oven and cook, scraping up any browned bits, and stirring frequently until just beginning to brown, about 6 minutes. Add 8 cloves garlic and continue cooking until onions and garlic are lightly browned, about 3 minutes longer. Add pepper flakes and oregano and cook, stirring, for 30 seconds. Add wine and cook until nearly completely reduced, about 5 minutes.\nAdd tomatoes, Parmesan rind, and 3/4 of basil. Return ribs to pot and bring to a simmer. Cover with lid slightly ajar and place in the oven. Cook, stirring occasionally, until the rib bones can be easily pulled from the meat, about 3 hours. Add sausages and continue cooking for 30 minutes. Remove pot from oven and increase oven temperature to 375°F.\nTransfer ribs to a bowl, discard bones, and let stand until cool enough to handle. Scrape off excess sauce and return it to the pot. Roughly shred rib meat (there should be about 1 1/2 pounds) and transfer to the work bowl of a food processor.\nProcess until it forms a finely shredded paste, scraping the sides of the processor as necessary. Transfer mixture to a large bowl and season to taste with salt and pepper.\nAdd bread, eggs, 3 ounces of Parmesan, remaining 4 cloves garlic, and parsley and process until a smooth paste is formed. Transfer to bowl with meat and fold by hand until homogenous.\nForm mixture into 1/2-inch balls using wet hands. You should end up with about 60 meatballs.\nHeat vegetable oil in a 10-inch no-stick or cast iron skillet over high heat until it reaches 350°F. Add as many meatballs fit in a single layer, dropping them in gently one at a time. Cook without moving until well browned on first side, about 1 1/2 minutes. Carefully flip and cook until browned all over (meatballs will be very delicate). Transfer to a paper towel-lined plate and repeat until all the meatballs are cooked.\nCombine ricotta with 1 1/2 cups sauce in a medium bowl. Cook lasagna noodles in a large pot of boiling water according to package directions. Drain on clean kitchen towels. If using no-boil noodles, soak in warm water for 30 minutes to partially hydrate.\nRemove the sausages from the sauce and slice into thin disks. Butter the bottom and sides of a lasagna pan. Spread 1/5 of red sauce on bottom of pan and top with a layer of lasagna noodles.\nSpread 1/3 of ricotta mixture over the noodles, followed by 1/3 of meatballs, 1/3 of sliced sausage, 1/4 of mozzarella, and 1/4 of smoked mozzarella. Top with another 1/5 of red sauce and a generous grating of Parmesan cheese.\nRepeat step 11 two more times. You should have used up all the noodles, meatballs, sausage, and ricotta mixture. Top final layer of noodles with remaining sauce and remaining cheeses. Tear up remaining basil leaves and sprinkle over the top. Drizzle with remaining 1 tablespoon olive oil.\nCover tightly with aluminum foil and bake for 30 minutes. Remove foil and continue baking until browned and bubbly, about 20 minutes longer. Remove from oven, allow to rest for 10 minutes, slice, and serve.\nSpecial equipment\nDutch oven, food processor, lasagna pan\nThis Recipe Appears In\nThe Food Lab: Introducing Lasagna Napoletana, the Meatball and Cheese-Packed Lasagna of Your Dreams\nItalian\nSavory\nMozzarella\nRicotta\nLasagna"
}