{
  "url": "https://www.seriouseats.com/late-summer-mixed-fruit-pie-recipe",
  "image_url": null,
  "tags": [
    "Pies",
    "Pie Dough",
    "Fruit",
    "Summer"
  ],
  "title": "Late-Summer Mixed-Fruit Pie Recipe",
  "full_text": "Late-Summer Mixed-Fruit Pie Recipe\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nActive\n15 mins\nChilling and Cooling Time\n3 hrs 30 mins\nTotal\n5 hrs\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nmedium\nplums\n,\napricots\n, or\nnectarines\n(about\n12\nounces\n;\n340\ng\n)\n9\nounces\npitted cherries\n(\n1 2/3\nheaping cups\n;\n255\ng\n), from about\n12\nounces\nwhole fruit\n(\n2 1/4\nheaping cups\n;\n340\ng\n)\n6\nounces\nfresh blueberries\n,\nblackberries\n, or\nraspberries\n(\n1\ncup\n;\n170\ng\n)\n4\nounces\nCape gooseberries\n,\ncurrants\n, or\nfresh cranberries\n(\n1/2\ncup\n;\n110\ng\n)\n7\nounces\nsugar\n(\n1\ncup\n;\n195\ng\n)\n1/2\nteaspoon\n(\n2\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or use the same weight\n1 1/2\nounces\ntapioca starch\n(\n1/3\ncup\nplus\n1\nteaspoon\n;\n40\ng\n), such as\nBob's Red Mill\n(see notes)\nOld-fashioned flaky pie dough\n, rolled and chilled as per the directions for a double crust\nFor the Egg Wash (optional):\n1\nlarge\negg\n1\nlarge\negg yolk\n1/2\nounce\nheavy cream\n(\n1\ntablespoon\n;\n15\ng\n)\n1/8\nteaspoon\n(\n1/2\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or use the same weight\nDirections\nFor the Filling (see notes):\nWash plums (no need to peel), cut into 1/2-inch slices, and measure out 9 ounces (1 1/2 cups; 255g) in a large bowl. Add pitted cherries, blueberries, and Cape gooseberries, or whatever mix of fruit you prefer, to bring the total weight to 28 ounces (790g; volume will vary). Toss with sugar, salt, and tapioca starch, folding with a flexible spatula until well combined. Scrape into prepared pie shell and top with remaining dough, as a solid sheet, a\nlattice\n, a\nherringbone\n, or checkerboard. Trim away excess dough and refrigerate to ensure top crust is completely chilled, about 30 minutes. Meanwhile, adjust oven rack to lower-middle position and preheat to 400°F (205°C).\nSerious Eats / Vicky Wasik\nFor the Egg Wash (if using):\nWhisk egg, egg yolk, cream, and salt in a small bowl. Brush over chilled top crust in a thin, even layer. This will give the crust a glossy, golden sheen, but is not necessary in any way.\nPlace chilled pie on a parchment-lined rimmed baking sheet. Bake until crust is golden, about 1 hour, then loosely cover with tented foil. (Alternatively, an empty baking sheet can be placed on topmost rack of oven to serve as a shield.) Continue baking until filling is bubbling even in the very center of the pie, about 15 minutes more. If crust completely covers filling, bake until pie reaches an internal temperature of 212°F (100°C) on a digital thermometer.\nSerious Eats / Vicky Wasik\nTo Serve:\nCool pie until center of filling is no warmer than 85°F (29°C) on a digital thermometer, about 3 hours depending on the type of pie plate. (Above that temperature, filling will be runny and thin.) Slice into wedges with a sharp knife, pressing firmly against bottom and sides of pie plate to ensure under-crust is completely cut. Wrapped in foil, leftovers will keep up to 3 days at room temperature; warm 10 minutes in a 350°F (175°C) oven to revive crust before serving.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n9-inch pie plate\n(preferably tempered-glass), pastry brush (if using egg wash),\nrimmed baking sheet\n,\ninstant-read thermometer\nNotes\nThis recipe works best with fruits similar to those listed in the ingredients, rather than wildcards such as apples, figs, or melons. When mixing things up with a\nvariety of fruits in a pie\n, you have no better partner in the kitchen than a scale—particularly if you want to experiment beyond the suggestions given. If measuring with cups, stick to the listed ingredients, and take care not to pile the fruit too high.\nDue to disparate sourcing practices, tapioca starch manufactured in Asia may be derived from plants other than cassava, which have different gelling properties. Look for products that mention cassava by name on the packaging, such as Bob's Red Mill.\nActive time will fluctuate depending on the complexity of crust design.\nRead More\nButtery, Flaky Pie Crust Recipe\nHow to Bake a Pie With Frozen Fruit\nHow to Freeze and Thaw a Fresh-Fruit Pie\nThe Best Blueberry Pie Recipe\nThe Best Cherry Pie (With Fresh or Frozen Fruit) Recipe\nPies\nPie Dough\nFruit\nSummer"
}