{
  "url": "https://www.seriouseats.com/lavash-armenian-flatbread-5206283",
  "image_url": "https://www.seriouseats.com/thmb/7yR-FtGpk0lbNAzA_imqgeUVC34=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211001-20211001-LAVASH-ANDREW-JANJIGIAN-49-87a8f5eb951e41adbe2ce75ef7954283.jpg",
  "tags": [
    "Armenian",
    "Yeast Breads",
    "The Latest"
  ],
  "title": "Lavash (Armenian Flatbread)",
  "full_text": "Lavash (Armenian Flatbread)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nRising Time\n13 hrs 45 mins\nTotal\n14 hrs 25 mins\nServes\n4 servings\nMakes\n4 lavash\nCook Mode\n(Keep screen awake)\nIngredients\n180\ng\n(\n6 1/3\nounces\n; shy\n1 1/2\ncups\n,\nspooned\n)\nbread flour\n, or\nhigh protein all-purpose flour,\nsuch as\nKing Arthur\n, plus extra for flouring counter\n30\ng\n(about\n1\nounce\n;\n1/4\ncup\n)\nwhole wheat flour\n(see notes)\n11\ng\n(\n4\nteaspoons\n)\ncornstarch\n1\ng\n(\n1/4\nteaspoon\n)\ninstant yeast\n; not RapidRise or active dry (more info\nhere\n)\n170\ng\n(about\n6\nounces\n;\n3/4\ncup\nminus\n2\nteaspoons\n)\nmilk\n, warmed to 75°F (24°C)\n10\ng\n(\n2\nteaspoons\n)\nvegetable oil\n, plus extra for coating dough balls\n7\ng\n(\n1\nteaspoon\n)\nhoney\n5\ng\n(\n1\nheaping teaspoon\n)\nDiamond Crystal kosher salt\n; if using table salt, use half as much by volume\nDirections\nPlace flours, cornstarch, and yeast in a medium bowl and whisk to combine. Add milk, oil, and honey and stir with a wooden spoon or\ndough whisk\nuntil combined and no dry flour remains, 15 to 30 seconds. Cover and let sit at room temperature for 20 minutes.\nSerious Eats / Andrew Janjigian\nAdd salt to top of dough and, using lightly-moistened hands (or a dough whisk), knead in bowl until salt is fully incorporated and dough is even in texture, about 30 seconds. Cover and let sit at room temperature for 45 minutes.\nSerious Eats / Andrew Janjigian\nUsing lightly-moistened hands, knead dough in bowl until uniform in texture, 5 to 10 seconds. Cover and let sit at room temperature until puffy and not quite doubled in volume, 30 to 60 minutes.\nSerious Eats / Andrew Janjigian\nTransfer dough to lightly-floured counter, flour top of dough lightly, and divide into 4 equally-sized pieces (about 100g each). Form each piece into a smooth, taut round. Coat each dough ball lightly with oil, then transfer to lightly-oiled containers or a lightly-oiled tray, spaced at least 2 inches apart. Cover and refrigerate for 12 to 24 hours.\nSerious Eats / Andrew Janjigian\nAdjust oven rack to lower-middle position. Place baking steel or stone on rack, and preheat oven to maximum temperature, 500 or 550°F (260 or 290°C), for at least 30 minutes if using baking steel, or 1 hour if using a stone.\nSerious Eats / Andrew Janjigian\nOnce oven and baking steel/stone are preheated, set broiler to high and remove dough balls from refrigerator. Set a wire rack inside a rimmed baking sheet, cover with a clean dish towel, and set aside. Place 1/3 cup (45g) flour in a mound on center of countertop and transfer one ball of dough to flour. Flip dough ball over once or twice to coat thoroughly with flour. Using a rolling pin, roll gently into a roughly 14- by 11-inch rounded rectangle, flipping dough as needed to coat with flour and prevent sticking or tearing.\nSerious Eats / Andrew Janjigian\nUsing a fine pastry brush, brush excess flour from top surface of dough. Transfer lavash to an 18- by 13-inch sheet of parchment, and then to a lightly-floured wide peel, rimless cookie sheet, or inverted rimmed baking sheet. Using misting bottle, mist top of dough lightly with water. Transfer to baking surface.\nSerious Eats / Andrew Janjigian\nBake until dough puffs up into a single balloon, about 30 seconds; the color change will not be substantial. Flip dough, remove the parchment sheet, and bake for an additional 10 seconds. (If dough does not puff completely after 30 seconds, flip anyway.) Transfer to prepared cooling rack and cover loosely with towel. Using bench scraper, gather flour into mound on countertop again. Repeat rolling and baking with remaining dough balls, one at a time, reusing the same parchment and stacking finished lavash on top of previous ones. Allow the stack of lavash to steam for at least 15 minutes. Brush off excess flour from each lavash, and serve.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nKitchen scale\n,\nrolling pin\n(preferably straight),\nbaking steel or stone\n,\nrimmed baking sheet\n,\nwire rack\n, rimless cookie sheet or\nwide pizza peel\n, pastry brush,\nparchment paper\n, water mister bottle.\nNotes\nThe recipe can easily be doubled if desired.\nWhole wheat flour variations, like white wheat or whole wheat pastry flour, will not perform well in this recipe.\nYou can either refrigerate the dough balls on a tray, spaced at least 2 inches apart, or in individual pint deli containers. If using a tray, be sure to wrap the dough tightly with plastic wrap without compressing it.\nThe dough should be rolled and baked straight from the fridge; do not let it warm up before using.\nMake-Ahead and Storage\nLavash are best eaten within 6 hours of baking; store in a plastic bag if not using within that time frame. They can be refreshed by overlapping the breads in a single layer on a rack set into a rimmed baking sheet in a 200°F (95°C) oven for 3 to 5 minutes. They can also be refreshed by spraying the breads with a water mister bottle or even placing them very briefly under running water; allow to rest for 30 minutes to rehydrate. (Lavash can be dried out completely by placing the breads in a single layer on a rack set into a rimmed baking sheet in a 200°F (95°C) oven for 50 to 60 minutes, after which they can be broken into delicate, crisp crackers.)\nArmenian\nYeast Breads\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lavash-armenian-flatbread.webp?"
}