{
  "url": "https://www.seriouseats.com/lavash-triangles-5324636",
  "image_url": "https://www.seriouseats.com/thmb/zU1F_VOc7jHNlA8O2_bjvWgC66g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220525-LAVASH-BEAN-TRIANGLES-ANDREW-JANJIGIAN-Hero-aa7b65a0f62246a9924066a57c964548.JPG",
  "tags": [
    "Armenian",
    "Pastries",
    "Snacks & Appetizers",
    "Pinto Beans",
    "The Latest"
  ],
  "title": "Lavash Triangles",
  "full_text": "Lavash Triangles\nClose\nJump to recipe\nPrep\n19 mins\nCook\n45 mins\nCooling and Resting Time\n55 mins\nTotal\n119 mins\nServes\n16 triangles\nMakes\n16 triangles, serving 6 to 8 as an appetizer, 4 as an entree\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Triangles:\n1/3\ncup\nplus\n3\ntablespoons\n(\n125\nml\n)\nvegetable oil\n, divided\n1/2\ncup\n(\n75\ng\n) finely diced\nyellow onion\n(about\n1/2\nmedium\nonion)\n1 1/4\nteaspoons\n(\n4\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for table salt use half as much by volume\n1/8\nteaspoon\nbaking soda\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\nAleppo pepper\n(see note)\n2\n(15.5-ounce; 439 g) cans\npinto beans, drained and rinsed\n(or\n3\ncups\n/\n25\nounces\ncooked, drained beans)\n2\ntablespoons\ncoarsely chopped fresh cilantro\nleaves and tender stems\n2\ntablespoons chopped\nfresh parsley\nleaves and tender stems\n1\ntablespoon\ncoarsely chopped\nfresh dill\nleaves and tender stems\n4 to 5\nlarge\nsheets\nhomemade\nor store-bought\nlavash\n(at least\n1\npound\n)\nFor the Herb Sauce:\n2 1/3\nounces\n(about\n1\ncup\n;\n65\ng\n)\ncoarsely chopped fresh cilantro\nleaves and tender stems\n2 1/3\nounces\n(about\n1\ncup\n;\n65\ng\n) coarsely\nchopped fresh parsley\nleaves and tender stems\n3/4\ncup\n(\n180\nml\n)\nextra-virgin olive oil\n1/2\nounce\n(about\n1/4\ncup\n;\n16\ng\n) coarsely chopped\nfresh dill\nleaves and tender stems\n2\ntablespoons\n(\n30\nml\n)\nfresh juice\nfrom\n1\nwhole\nlemon\n2\nmedium\ngarlic cloves\n1\nteaspoon\nAleppo pepper\n1\nteaspoon\nkosher salt\n1/2\nteaspoon\nground cumin\nDirections\nFor the triangles:\nIn a large Dutch oven, heat 2 tablespoons of vegetable oil over medium heat until shimmering. Add onion, salt, and baking soda and cook, stirring occasionally, until onion has broken down into a soft paste and is just starting to stick to pot, 6 to 8 minutes. Add beans, black pepper, and Aleppo pepper and cook until mixture is hot, about 2 minutes.\nSerious Eats / Andrew Janjigian\nRemove pot from heat and, using a potato masher or pastry cutter, mash beans to form a coarse paste. Fold in cilantro, parsley, and dill. Taste for seasoning and add more salt to taste. Cover and let cool to room temperature.\nSerious Eats / Andrew Janjigian\nFor the sauce:\nPlace parsley, cilantro, olive oil, dill, lemon juice, garlic, Aleppo pepper, salt, and cumin in the jar of a countertop blender or food processor and process until just smooth, 15 to 30 seconds. Taste for seasoning and add more salt to taste. Transfer to a serving bowl and set aside. (Sauce may be refrigerated in an airtight container for up to 24 hours.)\nSerious Eats / Andrew Janjigian\nTo finish:\nPlace 1 tablespoon vegetable oil on a rimmed baking sheet and, using a brush, spread evenly on bottom of sheet. Cut lavash into sixteen 11-inch-long, 3-inch-wide strips. Keep cut lavash covered or in a plastic bag so strips don’t dry out.\nSerious Eats / Andrew Janjigian\nLay 3 or 4 lavash strips on the countertop side by side, with short ends facing edge of countertop. Using a mister bottle, lightly spray both sides of each strip with water to soften.\nSerious Eats / Andrew Janjigian\nUsing a 1/4 cup measure, place scant 3 tablespoons (about 40g) filling on the bottom left-hand corner of one strip, about one inch from the bottom edge. Using a spoon, form filling into a rough triangle with its long edge (hypotenuse) facing the bottom right edge of the lavash. Working gently, lift the bottom right corner of the lavash and fold it over the filling and gently press to form a right triangle. Continue folding up and over, like folding a flag, until you reach the end of lavash strip. Using a sharp knife, trim off any overhanging lavash. Place the triangle seam-side down on the prepared sheet and repeat with the remaining three strips.\nSerious Eats / Andrew Janjigian\nRepeat with remaining lavash strips and filling, arranging triangles in pairs with long edges facing each other, so that they form four rows of four triangles. Cover tray and allow to rest at room temperature for at least 30 minutes. (Alternatively, refrigerate tray for up to two hours.\nSerious Eats / Andrew Janjigian\nSet an oven rack to the middle position and heat oven to 350°F (175°C). When oven is ready, place remaining 1/3 cup oil in a small bowl. Using a brush, thoroughly coat both sides of each triangle with oil and return to tray, seam-side down.\nSerious Eats / Andrew Janjigian\nBake until golden and crisp on one side, 12 to 15 minutes. Remove sheet pan from oven, brush tops of triangles with oil and then drizzle any oil remaining in bowl over them. Flip triangles and continue to bake until they are golden brown and crisp on both sides, 12 to 15 minutes longer. Transfer baking sheet to wire rack and let triangles cool at least 5 minutes before serving, passing sauce on side.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nRimmed baking sheet, pastry brush, wire rack, water mister bottle\nNotes\nIf you want to use dried beans here, use 3 cups cooked and drained pinto beans in place of the canned ones.\nIt’s a good idea to buy more lavash than you need, just in case some of it is torn or too narrow to yield the necessary 11-inch long strips. Lavash is commonly sold in 1-pound packages; 1 ½ pounds lavash should be more than enough.\nBe liberal with water when spraying the lavash strips, particularly if your lavash seems fragile. It can handle a lot of moisture, and any excess will evaporate during baking.\nAleppo chile peppers, which have been cultivated in Syria for centuries, are quite mild in terms of heat, with a hint of raisin-y, sun-dried tomato sweetness. Due to the ongoing civil war, true Aleppo pepper from Syria is no longer available for import, but chiles grown in neighboring Turkey are. You can find Aleppo pepper at Middle Eastern markets, or online. Korean gochugaru or paprika (plus 1/8 teaspoon cayenne to add heat to the latter) can be substituted for Aleppo pepper in this recipe.\nMake-Ahead and Storage\nThe herb sauce can be held in the fridge for up to 48 hours; allow to warm to room temperature before serving.\nTo make the triangles ahead of time, it is best to bake them off, cool them to room temperature, and then refrigerate them in an airtight container for up to 2 days. (Or freeze for up to 3 weeks.)\nTo reheat, place on a wire rack set inside a rimmed baking sheet in a 350˚F oven for 15 to 20 minutes (20 to 25 if frozen).\nArmenian\nPastries\nSnacks & Appetizers\nPinto Beans\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lavash-triangles.webp?"
}