{
  "url": "https://www.seriouseats.com/lazy-daisy-cake-recipe-11734164",
  "image_url": "https://www.seriouseats.com/thmb/059Y6cuYhp6g1Pbt-JzirQt4cA8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250513-SEA-LazyDaisyCake-AmandaSuarez18-631e334fa34e4e2cb7aaaebb1e5f3ba3.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Recipes",
    "Desserts",
    "Coconut"
  ],
  "title": "The Unusual Techniques That Make This \"Forgotten\" Retro Cake Tender, Easy, and Delicious",
  "full_text": "The Unusual Techniques That Make This \"Forgotten\" Retro Cake Tender, Easy, and Delicious\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nTotal\n55 mins\nServes\n15\nMakes\n1 9- by 13-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nNonstick\ncooking spray\n57\ng\nunsalted butter\n(\n2\nounces\n;\n4\ntablespoons\n)\n3/4\ncup\n(\n180\nml\n)\nwhole milk\n4\nlarge\neggs\n(\n7\nounces\n;\n200\ng\n)\n300\ng\ngranulated sugar\n(\n10 1/2\nounces\n;\n1 1/2\ncups\n)\n192\ng\nall-purpose flour\n(\n6 3/\n4\nounces\n;\n1 1/2\ncups\n), plus more for dusting\n1 1/2\nteaspoons\nbaking powder\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Topping:\n85\ng\nunsalted butter\n(\n3\nounces\n;\n6\ntablespoons\n)\n107\ng\ndark brown sugar\n(\n3 1/4\nounces\n;\n1/2\ncup\n)\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/4\ncup\n(\n60\nml\n)\nwhole milk\n198\ng\nsweetened shredded coconut\n(\n7\nounces\n; about\n2 1/3\ncups\n)\nDirections\nAdjust oven rack to middle position and preheat to 350°F (180°C). Grease a 9- by 13-inch baking pan with unsalted butter, then dust with flour, shaking out excess.\nIn a medium saucepan, combine butter and whole milk. Bring to a gentle simmer over medium-low heat; set aside and let cool slightly, about 5 minutes.\nSerious Eats / Amanda Suarez\nIn a medium bowl, whisk together flour, baking powder, and salt; set aside.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment, whip eggs and granulated sugar on medium-high speed until yolks are thick, pale yellow, and doubled in volume, about 7 minutes.\nSerious Eats / Amanda Suarez\nReduce mixer speed to low, and slowly pour in milk and butter mixture. Reserve saucepan for topping; no need to clean. Continue to whisk until combined, about 15 seconds.\nSerious Eats / Amanda Suarez\nWith the mixer on low speed, gradually add flour mixture 1/4 cup at a time until just incorporated, about 2 minutes. Using a flexible spatula, scrape down sides and bottom of the bowl to ensure there are no dry bits. (If any remain, use spatula to gently fold until incorporated.) Pour batter into prepared baking pan and gently tap pan on kitchen counter 2 to 3 times to eliminate any large air bubbles.\nSerious Eats / Amanda Suarez\nBake until cake has risen by about 1 inch and is light golden, about 25 minutes.\nMeanwhile, for the Coconut Topping:\nMelt butter over medium heat and cook, whisking and swirling, until milk solids turn golden brown and butter smells nutty, 4 to 5 minutes. Reduce heat to low. Whisk in brown sugar, salt, and milk and bring to a simmer, stirring constantly until sugar dissolves, 2 to 3 minutes. (Mixture will sputter slightly—this is normal.) Remove from heat and fold in coconut; set aside.\nSerious Eats / Amanda Suarez\nCarefully remove cake from oven and dollop coconut topping over it, using a spoon or offset spatula to spread evenly from side to side. Bake until coconut topping is golden brown, 20 to 25 more minutes.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9- by 13-inch baking pan, stand mixer, flexible spatula, whisk\nMake-Ahead and Storage\nOnce cooled, the cake can be stored in an airtight container at room temperature for up to 5 days.\nCakes\nThe Latest\nRecipes\nDesserts\nCoconut",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-unusual-techniques-that-make-this-forgotten-retro-cake-tender-easy-and-delicious.webp?"
}