{
  "url": "https://www.seriouseats.com/leaf-wrapped-salad-bites-miang-kham-from-simple-thai-food",
  "image_url": "https://www.seriouseats.com/thmb/nF8gMO7wb1VbJ6Kim4hv5JMIbSA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__20140520-293185-cook-the-book-leaf-wrapped-salad-bites-9c510363b56c4eff825f35172975f1c6.jpg",
  "tags": [
    "Salads",
    "Thai",
    "Shrimp"
  ],
  "title": "Leaf-Wrapped Salad Bites (Miang Kham) From 'Simple Thai Food'",
  "full_text": "Leaf-Wrapped Salad Bites (Miang Kham) From 'Simple Thai Food'\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n45 mins\nSoaking Time\n15 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nSauce:\n1\ntablespoon\nmeaty\ndried shrimp\n1/2\ncup\nhot\nwater\n1\nstalk\nlemongrass\n1/2\ncup\nplus\n2\ntablespoons\nunsweetened dried coconut flakes\n1\nshallot\n, about\n1\nounce\n, peeled and sliced thinly against the grain\n2\n(\n1/4-inch-thick\n)\nslices\ngalangal\n, coarsely chopped\n2\ntablespoons\ncoarsely\nchopped\npeeled\nginger\n1\nteaspoon\nshrimp paste\n1/2\ncup\npacked grated\npalm sugar\nplus\n1/3\ncup\npacked\ndark brown suga\nr (or substitute\n2/3\ncup packed\ndark brown sugar\n)\n1\ntablespoon\nfish sauce\n1/4\ncup\nwater\n2\ntablespoons\nfinely\nchopped\nroasted peanuts\nSalad:\n1\nlime\n1\n(\n3-inch) piece\nfresh ginger\n, peeled and cut into 1/4-inch dice\n2\nshallots\n, about\n1 ounce\neach, peeled and cut into 1/4-inch dice\n1/2\ncup\nroasted peanuts\n5 or 6\nfresh bird’s eye\nchiles\n, sliced crosswise 1/4 inch thick\n1/3\ncup\nmeaty\ndried shrimp\nTo Serve:\n20 to 30\ncha-phlu leaves or\n3-inch squares\ncollard green\nor Chinese broccoli leaves\nDirections\nTo make the sauce, soak the dried shrimp in hot water for 15 minutes. Meanwhile, trim off and discard the leafy parts of the lemongrass stalk, remove the tough outer leaves of the bulb portion until the smooth, pale green core is exposed, and trim off the root end. Working from the root end, cut the bulb crosswise into paper-thin slices, stopping once you reach the point at which the purple rings disappear. Set the slices aside and discard the remainder.\nPut the dried coconut flakes in a wok or 14-inch skillet and toast them on medium heat, stirring constantly, until medium brown, about 2 to 3 minutes. Reserve 2 tablespoons of the toasted coconut flakes for the sauce and set the remainder aside for the salad. Wipe out any toasted coconut sediment from the wok. Add the lemongrass slices, shallot, galangal, and ginger to the clean wok, then toast over medium-high heat, stirring constantly, until fragrant and the shallot slices are dry to the touch, about 5 minutes. Place the toasted mixture, drained dried shrimp, and shrimp paste in a mortar or a mini chopper and grind to a smooth paste.\nPut the prepared paste, sugars, fish sauce, and water in a 1-quart saucepan and bring to a boil over medium-high heat, stirring constantly. When the sauce has thickened and reduced to about 1 cup, after 2 to 3 minutes, take the saucepan off the heat. Let the sauce cool completely. Once the dressing is cooled, stir in the chopped peanuts and the reserved 2 tablespoons toasted coconut flakes and transfer to a small serving bowl.\nTo prepare the salad, quarter the lime lengthwise and trim away the core. Cut the quarters into 1⁄4-inch dice, leaving the rind intact. Alternatively, for those who are sensitive to the bitterness of the lime rind, cut the lime into wedges (as shown in the photograph) and invite diners to squeeze about 1/2 teaspoon lime juice onto each composed salad bite.\nArrange the lime, ginger, shallots, peanuts, chilies, dried shrimp,\ncha-phlu\nleaves, and the dressing on a large serving platter.\nTo eat, put a leaf on your palm, add a bit of each component to the center of the leaf, top with a small spoonful of dressing, gather up the corners of the leaf to form a bag, and eat the whole thing in one bite.\nNote: If the diced ginger tastes too spicy hot, rinse it in cold water three or four times until the water runs clear and blot it dry.\nSalads\nThai\nShrimp",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/leaf-wrapped-salad-bites-miang-kham-from-simple-thai-food.webp?"
}