{
  "url": "https://www.seriouseats.com/lebkuchen-spice-cookie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/W02YYpsPV-DtGANy8ZsEzOfTQA4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121210-clara-lebkuchen-a95b236b8db74200a1e8ed5f0487dd50.jpg",
  "tags": [
    "Cookies",
    "German",
    "Christmas Cookies"
  ],
  "title": "Lebkuchen Cookies Recipe",
  "full_text": "Lebkuchen Cookies Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n20 mins\nResting Time\n60 mins\nTotal\n105 mins\nServes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\ncandied orange peel\n1/4\ncup\ncandied lemon peel\n3\ntablespoons\ngood\ndark rum\n1\ncup\nground hazelnuts\n1\ncup\nground almonds\n1\ntablespoon\nlebkuchen spice\n1/4\nteaspoon\nbaking powder\n2\nlarge\neggs\n3/4\ncup\nbrown sugar\nA\npinch\nof\nsalt\n24\nbaking wafers\nDirections\nMix candied peel with rum and set aside to soak. Toss ground nuts with spices and baking powder and set aside.\nBeat the eggs on high until pale yellow, about four minutes. Add sugar and salt, and beat on high five minutes more.\nIf very wet (though it likely won't be), drain the candied peel. Using a wooden spoon, fold the nut flour mixture and candied peels into the egg mixture until the flour is well incorporated, but do not over mix.\nLine a baking sheet with parchment paper. Place rounded spoonfuls of the mixture on the parchment paper, making sure each cookie is at least 2 cm tall and leaving 3 to 4 cm between them. The cookies do not spread much in baking, so if you prefer perfectly smooth lebkuchen rather than craggy ones, it’s best to smooth them out by hand at this point. Optional: if using back-oblaten, form cookies directly on wafers, making sure that each cookie is about 2cm tall. Again, as the cookies don't spread in baking, cover the entire wafer.\nAllow the cookies to rest for one hour at room temperature.\nPreheat the oven to 150°C (302°F). Bake cookies for 15 to 18 minutes, rotating pans halfway through, until the cookies are lightly browned, and spring back to the touch. (It’s better to air on the side of slight undercooking, as you want them to be moist and they dry out quickly.) Remove them from the oven and cool slightly on the baking sheet before transferring to a wire rack.\nStore lebkuchen in an air tight container between layers of wax paper in the fridge. Cookies will keep, refrigerated, up to two weeks.\nFor an extra treat, dip them in chocolate, or glaze them with a thin sugar icing.\nCookies\nGerman\nChristmas Cookies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lebkuchen-cookies-recipe.webp?"
}