{
  "url": "https://www.seriouseats.com/leche-flan-filipino-baked-custard-5195622",
  "image_url": "https://www.seriouseats.com/thmb/ylleIZRoHcfrxYtDyx_Pz7ytWiw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210723-Leche-Flan-Rezel-17-3bdcb943a559409d9b62976818423d96.jpg",
  "tags": [
    "Filipino",
    "Baking",
    "Eggs",
    "Custards, Mousses & Puddings",
    "The Latest"
  ],
  "title": "Leche Flan (Filipino Baked Custard)",
  "full_text": "Leche Flan (Filipino Baked Custard)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n65 mins\nChilling Time\n7 hrs\nTotal\n8 hrs 20 mins\nMakes\n36 one-inch squares\nCook Mode\n(Keep screen awake)\nIngredients\n7\nounces\ngranulated sugar\n(\n1\ncup\n;\n200\ng\n)\n12\nlarge\negg yolks\n(\n8\nounces\n;\n225\ng\n)\n1\n(12-ounce; 355 ml) can\nevaporated milk\n2\n(14-ounce; 800 ml) cans\nsweetened condensed milk\n1\nteaspoon\nvanilla extract\n1\nteaspoon\nfreshly grated lemon zest\nfrom\n1\nwhole\nlemon\nDirections\nAdjust oven rack to middle position and preheat to 325°F (163°C). Bring 3 quarts (2.8L) water to a boil to use in a water bath during baking.\nIn a 2-quart saucepan, place sugar over medium-high heat and cook, stirring constantly with a fork, until sugar melts and syrup is a deep copper brown color, about 5 minutes. Carefully pour the hot caramel into an oven-safe 8-inch square baking dish, making sure the bottom is evenly coated with caramel. Set aside.\nRezel Kealoha\nIn a medium mixing bowl, whisk together egg yolks, evaporated milk, condensed milk, and vanilla extract until thoroughly combined. Strain mixture through a fine-mesh strainer set over a large bowl (this ensures that your flan will be smooth).\nRezel Kealoha\nPour egg mixture into the prepared caramel-lined dish. Tap dish gently on a work surface to pop any bubbles. Sprinkle lemon zest evenly over top and cover with foil. With the tip of a sharp knife, poke 2 1/2-inch slits in the foil so moisture can escape and won’t condense onto your flan as it bakes.\nRezel Kealoha\nIn a roasting dish, casserole dish, or another high-walled, oven-safe dish, set a wire rack in the bottom and place the foil-covered flan-filled dish on top. Place in oven. Carefully pour boiling water into the roasting dish until about halfway up the side of the flan-filled dish.\nRezel Kealoha\nBake until flan is just set to the touch, with a slight jiggle in the center, and an instant read thermometer reads 175°F (80°C) in the center, about 1 hour.\nRezel Kealoha\nTransfer flan to a wire rack and let cool to room temperature, about 1 hour. Cool fully in the refrigerator for at least 6 hours or overnight.\nTo serve, run a paring knife or offset spatula along the edge to loosen the flan from the dish. Set a larger plate, upside down, on top of flan-filled dish, then quickly flip both dishes over to invert the flan and catch the caramel sauce. Slice into 36 one-inch squares and serve.\nRezel Kealoha\nSpecial Equipment\nOven-safe 8-inch square baking dish,\nwire rack\n,\nlarge roasting pan\nMake-ahead and Storage\nLeche flan can be refrigerated in an airtight container for up to 2 weeks.\nFilipino\nBaking\nEggs\nCustards, Mousses & Puddings\nThe Latest"
}