{
  "url": "https://www.seriouseats.com/leeks-vinaigrette-recipe-11734937",
  "image_url": "https://www.seriouseats.com/thmb/OpMKBCi9axqmW89jknPPPF9izIE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250423-SEA-LeeksVinaigrette-VictorProtasio-Beauty1-93-686f33e287a44e259f9c6f65d12b8dd7.jpg",
  "tags": [
    "Leeks",
    "The Latest",
    "Recipes",
    "French",
    "Vegetarian"
  ],
  "title": "An Easy French Classic Every Home Cook Should Try",
  "full_text": "An Easy French Classic Every Home Cook Should Try\nClose\nJump to recipe\nPrep\n15 mins\nCook\n12 mins\nCooling Time:\n10 mins\nTotal\n37 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\n(\n1.9\nL\n)\ntap water\n1 1/4\nounces\nDiamond Crystal kosher salt\n(\n36\ng\n;\n1/4\ncup\nplus\n1/4\nteaspoon\n), divided; for table salt, use half as much by volume\n4\nsmall\nleeks\n(6 ounces; 170 g each), white and light green parts (see notes)\n1 1/2\ntablespoons\n(\n22\nml\n)\nsherry vinegar\nor red wine vinegar\n1\ntablespoon\n(\n9\ng\n)\nfinely chopped shallot\n, from\n1\nmedium\nshallot\n2\nteaspoons\nwhole-grain\nmustard\n1\nteaspoon\nDijon mustard\n1/4\nteaspoon\nfreshly\nground black pepper\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\nTo Garnish:\n1\nhard-boiled\negg\n, chopped\n1\ntablespoon\nchopped fresh flat-leaf\nparsley\n1\nteaspoon\ncapers\nDirections\nIn a 4-quart saucepan, bring water and 1/4 cup salt to a boil over high heat. While water comes to a boil, trim roots from leeks, taking care to leave base intact. Halve leeks lengthwise, stopping 1-inch above the base. Rinse leeks thoroughly under cool running water to remove any dirt between layers. Using kitchen twine, tie both halves of each leek about two-thirds of the way up to hold them together. Line a plate with paper towels or a clean kitchen towel; set aside.\nSerious Eats / Victor Protasio\nLower leeks into boiling water; reduce heat to medium-low, and cook, covered, until base of leek can be easily pierced with a paring knife, about 12 minutes. Using tongs or a spider skimmer, transfer leeks to a paper towel-lined plate, allowing excess water to drip off. Let rest at room temperature until cool enough to handle, about 10 minutes.\nSerious Eats / Victor Protasio\nWhile leeks cool, place sherry vinegar and shallots in a medium bowl and let sit for 5 minutes. Whisk in whole-grain mustard, Dijon mustard, pepper, and remaining 1/4 teaspoon salt. Slowly stream in olive oil, whisking vigorously and constantly, until emulsified and creamy. Set vinaigrette aside.\nSerious Eats / Victor Protasio\nRemove twine from leeks. Completely halve leeks lengthwise, and arrange, cut side down, on paper towel-lined plate. Place paper towels on top of leeks, and gently press down on leeks to remove any excess water.\nSerious Eats / Victor Protasio\nSpread half (40 ml) of the vinaigrette evenly over platter. Arrange leeks, cut side up, on platter; drizzle with remaining vinaigrette. Garnish with hard-boiled eggs, parsley, and capers.\nSerious Eats / Victor Protasio\nSpecial Equipment\n4-quart\nsaucepan\n, tongs or\nspider skimmer\n, kitchen twine\nNotes\nLook for leeks that are 1 to 1 1/2 inches in diameter, as they tend to be sweeter and more tender.\nMake-Ahead and Storage\nThe vinaigrette can be made up to 3 days in advance and refrigerated in an airtight container. If the vinaigrette separates, whisk it or shake it in a tightly sealed container to re-emulsify.\nThe leeks can be cooked and marinated in the vinaigrette up to 3 hours before serving. Refrigerate until ready to serve. Remove leeks from fridge about 20 minutes before serving.\nThe finished dish is best eaten the day it's prepared, but leftovers can be stored in an airtight container for up to 3 days.\nLeeks\nThe Latest\nRecipes\nFrench\nVegetarian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/an-easy-french-classic-every-home-cook-should-try.webp?"
}