{
  "url": "https://www.seriouseats.com/leftover-thanksgiving-turkey-carnitas-recipe",
  "image_url": "https://www.seriouseats.com/thmb/DmyLT6xRan89AhlmqXnEk4i-Xds=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__11__20151124-turkey-carnitas-recipe-4-8ba2ab16773b4dd4be2391b4cd4c5b00.jpg",
  "tags": [
    "Turkey Mains",
    "Tacos",
    "Thanksgiving Turkeys"
  ],
  "title": "Leftover Turkey \"Carnitas\"",
  "full_text": "Leftover Turkey \"Carnitas\"\nClose\nJump to recipe\nPrep\n5 mins\nCook\n75 mins\nActive\n20 mins\nTotal\n80 mins\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n) leftover cooked dark-meat\nturkey meat\n(thighs and drumsticks; see note)\n1\norange\n, preferably sour, quartered (see note)\n1\nmedium\nyellow onion\n(about\n8\nounces\n;\n225\ng\n), quartered\n2\nbay leaves\n2\ntablespoons\n(\n30\nml\n) vegetable\noil\n, chicken fat, turkey fat, or duck fat\nKosher salt\nDirections\nCombine turkey meat (with bones if available), orange, onion, and bay leaf in a pot that fits them snugly. Add enough water to cover halfway. Cover and bring to a boil, then reduce to a bare simmer and cook until turkey is fall-off-the-bone tender, 45 minutes to 1 hour. Discard orange, onion, and bay leaves and drain turkey well. Shred turkey and discard bones.\nHeat oil or fat in a cast iron or nonstick skillet over medium-high heat until shimmering. Add turkey and spread into an even layer. Cook, without moving, until meat is well browned and crisp on the bottom, about 5 minutes. Stir turkey to incorporate the crisp bits and introduce new soft bits to the bottom. Continue this process until the turkey is as crisp as you like it (I like mine quite crisp). Season with salt.\nNotes\nYou can make this recipe from scratch by roasting turkey legs in a 400°F (200°C) oven until they reach an internal temperature of 165°F (74°C) (45 minutes to 1 hour), then proceeding as directed. Meat picked from the scraps of turkey used to make stock can also be crisped in a skillet and deliver delicious results. After making turkey stock or soup, remove some dark meat, shred it, and proceed as directed in step 2. Sour oranges can be purchased in a Latin market or well-stocked supermarket.\nTurkey Mains\nTacos\nThanksgiving Turkeys",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/leftover-turkey-carnitas.webp?"
}