{
  "url": "https://www.seriouseats.com/lemon-ricotta-pancakes-recipe-11739876",
  "image_url": "https://www.seriouseats.com/thmb/x9dnw5wGbbGIrDkGt2pdZcc1JIA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250522-SEA-LemonRicottaPancakes-AmandaSuarez-10-aa2e86e0baa646398b031b4e0212d7a3.jpg",
  "tags": [
    "Pancakes",
    "The Latest",
    "Recipes",
    "Breakfast & Brunch",
    "Lemon"
  ],
  "title": "One Reader’s Family Called These Lemon Ricotta Pancakes “The Best They’ve Ever Had”",
  "full_text": "One Reader’s Family Called These Lemon Ricotta Pancakes “The Best They’ve Ever Had”\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nTotal\n20 mins\nServes\n2\nto 3\nMakes\n8 pancakes\nCook Mode\n(Keep screen awake)\nIngredients\n226\ng\nwhole milk ricotta cheese\n(\n8\nounces\n;\n1\ncup\n)\n3/4\ncup\n(\n180\nml\n)\nwhole milk\n4\nlarge\neggs\n, separated\n1/2\nteaspoon\nvanilla extract\n141\ng\nall-purpose flour\n(\n5\nounces\n;\n1\ncup\nplus\n1\ntablespoon\n)\n1\nteaspoon\nbaking powder\n1/2\nteaspoon\nDiamond Crystal kosher sal\nt; for table salt, use half as much by volume\n45\ng\ngranulated sugar\n(\n1 1/2\nounce\n;\n3\ntablespoons\n)\n1\nteaspoon\ngrated\nlemon zest\n28\ng\nunsalted butter\n(\n1\nounce\n;\n2\ntablespoons\n), plus more for serving\nFresh fruit or compote\n, for serving\nMaple syrup\n, for serving\nDirections\nIn a small bowl, combine 1 tablespoon granulated sugar and lemon zest, using your fingers to rub them together until mixture is fragrant, about 30 seconds; set aside.\nSerious Eats / Amanda Suarez\nIn a large bowl, whisk ricotta, milk, egg yolks, vanilla, and lemon sugar to combine; set aside. Using fine-mesh sieve, sift in flour, baking powder, and salt to ricotta mixture. Whisk until just combined.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment, whisk egg whites on medium speed until they begin to foam, about 1 minute. With mixer running at medium speed, slowly add remaining 2 tablespoons (30 g) sugar. Continue to whisk until meringue is glossy and reaches medium-stiff peaks, about 5 minutes. Using a flexible spatula, gently fold meringue into pancake batter. (Alternatively, egg whites can be whisked in a large bowl using a traditional whisk or an electric hand mixer.)\nSerious Eats / Amanda Suarez\nPlace a wire rack inside a 13- by 18-inch rimmed baking sheet; set aside.\nHeat a large electric nonstick griddle to medium heat (350°F/175°C) or large nonstick, cast iron, or carbon steel skillet or stovetop griddle over medium heat. Melt 1/2 tablespoon butter, and, using a 1/3 cup scoop or measuring cup, scoop batter onto griddle or skillet to form 3-inch pancakes spaced 1/2 to 1 inch apart, working in batches if necessary. Cook until bubbles begin to appear on top of batter and bottoms are golden brown, 2 to 3 minutes. Carefully flip pancakes and cook until bottoms are lightly golden and pancakes are cooked through, 2 to 4 minutes. Transfer to prepared wire rack. Repeat with remaining batter. Serve warm with fresh fruit, compote, and/or maple syrup.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWhisk, stand mixer or hand mixer, wire rack, rimmed baking sheet, nonstick electric griddle or large nonstick, cast iron, or carbon steel skillet or stovetop griddle\nMake-Ahead and Storage\nOnce cooled, pancakes can be refrigerated in an airtight container for up to 5 days. Reheat in the microwave or a 300°F (150°C) oven until warmed through.\nPancakes\nThe Latest\nRecipes\nBreakfast & Brunch\nLemon",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/one-readers-family-called-these-lemon-ricotta-pancakes-the-best-theyve-ever-had.webp?"
}