{
  "url": "https://www.seriouseats.com/lemon-sugar-cookies-recipe-8760430",
  "image_url": "https://www.seriouseats.com/thmb/a0vy6lbbON_DWw8VcDPCS5Nhuvc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241203-SEA-LemonSugarCookies-RobbieLozano-Hero1-78-e4db66a0929c438db1d6223a5bfced9c.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Lemon",
    "Christmas Cookies"
  ],
  "title": "Lemon Sugar Cookies",
  "full_text": "Lemon Sugar Cookies\nClose\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nChilling and Cooling Time:\n2 hrs 30 mins\nTotal\n3 hrs 25 mins\nServes\n12\nMakes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookies:\n270\ng\ngranulated sugar\n(\n9 1/2\nounces\n;\n1 1/4\ncups\n)\n6\ng\n(\n2\ntablespoons\n) packed grated\nlemon zest\nplus\n1 1/2\ntablespoons\nfresh juice\nfrom\n4\nlarge\nlemons\n, divided\n227\ng\n(\n2\nsticks\n)\nunsalted butter\n, softened\n1\nlarge egg\n, room temperature\n5\ng\n(\n1\nteaspoon\n)\nvanilla extract\n320\ng\nall-purpose flour\n(about\n11 1/4\nounces\n;\n2 1/2\ncups\n)\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Glaze:\n140\ng\nsifted powdered sugar\n(about\n5\nounces\n;\n1 1/2\ncups\n)\n3\ntablespoons\nfresh lemon juice\nfrom\n1\nlarge\nlemon\n1/4\nteaspoon\nvanilla extract\nLemon zest\n, for garnish\nDirections\nFor the Cookies:\nIn a large bowl, combine sugar and lemon zest, using your fingers to rub them together until mixture is fragrant, about 30 seconds. Transfer 1/4 cup lemon-sugar mixture to a small bowl. Set aside.\nSerious Eats / Robby Lozano\nAdd butter to the large bowl with lemon-sugar mixture and, using an electric mixer, beat on medium-high speed until fluffy and combined, about 2 minutes, stopping to scrape down sides as needed. (Alternatively, in the bowl of a stand mixer fitted with a paddle attachment, beat lemon-sugar mixture and butter on  medium-high speed until fluffy and combined, about 2 minutes, stopping to scrape down sides as needed.)\nSerious Eats / Robby Lozano\nAdd egg, lemon juice, and vanilla; beat on medium-high speed until creamy and fluffy, about 15 seconds.\nSerious Eats / Robby Lozano\nIn a medium bowl, whisk flour, baking powder, and salt to combine. Add flour mixture to butter mixture, and beat on low speed until just combined, about 20 seconds.\nSerious Eats / Robby Lozano\nDivide dough in half, about 14 ounces (397g) each. Place each half on a large piece of plastic wrap. Fold plastic wrap over to cover dough, and, using your hands, roll each portion of dough into a smooth 2-inch-wide log about 6 inches long and wrap tightly, twisting the ends of the plastic to seal. Refrigerate until firm, at least 1 hour and 30 minutes or up to 8 hours.\nSerious Eats / Robby Lozano\nAdjust oven rack to middle position and preheat oven to 350°F (175ºC). Line 2 large rimmed baking sheets with parchment paper. Remove logs from refrigerator. Spread the reserved lemon-sugar on a large plate. Remove dough logs from plastic wrap, and roll in lemon-sugar mixture to coat evenly, pressing firmly to help sugar adhere evenly. Using a sharp knife, trim off about 1/4 inch from each end of dough log and discard or reserve for another use. Using a sharp knife, slice each log into 1/2-inch thick rounds; you should have about 12 cookies per log.\nSerious Eats / Robby Lozano\nPlace slices on prepared baking sheets, leaving at least 1 1/2 inches between each cookie. Freeze until firm, about 15 minutes.\nSerious Eats / Robby Lozano\nBake cookies, 1 sheet at a time (leaving second sheet in the freezer while first bakes), until edges are set and beginning to lightly brown, 14 to 15 minutes. Cool on baking sheets for 5 minutes. Transfer to a wire rack, and let cool to room temperature, about 30 minutes.\nSerious Eats / Robby Lozano\nPrepare the Glaze:\nIn a medium bowl, whisk powdered sugar, lemon juice, and vanilla extract until smooth and well combined.\nSerious Eats / Robby Lozano\nTo Assemble:\nUsing an offset spatula, spread the lemon glaze (about 1 teaspoon per cookie) on the cooled cookies and garnish with lemon zest. Let stand until the glaze is set, about 15 minutes.\nSerious Eats / Robby Lozano\nSpecial Equipment\nElectric mixer, 2 large rimmed baking sheets, parchment paper, offset spatula\nMake Ahead and Storage\nPrepared and sliced dough can be stored for up to 3 months in the freezer. Freeze on a baking sheet until solid, then transfer to a freezer bag or other airtight container. Cookies can be baked from frozen according to the directions (step 8) above; add a few minutes to the bake time if necessary.\nCooled cookies can be stored, separated by layers of parchment paper to prevent sticking, at room temperature for about a week.\nRead More\nLemon Meltaways Recipe\nCookies\nThe Latest\nLemon\nChristmas Cookies"
}