{
  "url": "https://www.seriouseats.com/lemon-curd-recipe-8683021",
  "image_url": "https://www.seriouseats.com/thmb/4OarBA7pDwgBxold0hqcJfeHdTM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240722-SEA-LemonCurd-AmandaSuarez-00-8b25c4e2e5c0455fb28068f0822ce0fe.jpg",
  "tags": [
    "The Latest",
    "Desserts",
    "Vegetarian",
    "Condiments & Sauces",
    "Gluten-free"
  ],
  "title": "Quick and Easy Lemon Curd",
  "full_text": "Quick and Easy Lemon Curd\nClose\nJump to recipe\nPrep\n5 mins\nCook\n6 mins\nCooling Time\n30 mins\nTotal\n41 mins\nServes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1/3\ncup\nlemon zest\n(\n1\nounce\n;\n28\ng\n) from\n6\nmedium\nlemons\n3/4\ncup\ngranulated sugar\n(\n5 1/4\nounces\n;\n150\ng\n)\n1\ncup\n(\n240\nml\n)\nlemon juice\nfrom\n6\nmedium\nlemons\n3\nlarge\neggs\n4\nlarge\negg yolks\n(\n2\nounces\n;\n56\ng\n)\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n5\ntablespoons\nunsalted butter\n(\n2 1/2\nounces\n;\n70\ng\n), softened\nDirections\nIn a medium bowl, combine lemon zest with granulated sugar, and use your fingers to rub them together until the mixture becomes fragrant, about 30 seconds. Set aside for 10 minutes.\nSerious Eats / Amanda Suarez\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nIn a medium saucepan, bring lemon juice to a simmer over medium heat, about 3 minutes. Add eggs, yolks, and salt to bowl with lemon zest and sugar, and whisk together until smooth.\nSerious Eats / Amanda Suarez\nSlowly drizzle heated lemon juice into yolk mixture, whisking constantly, until all of it has been incorporated. Return mixture to saucepan and cook over medium heat, whisking slowly but frequently, until mixture thickens slightly and registers 170ºF (77ºC) on an instant-read thermometer, about 6 minutes. Remove from heat and whisk in butter until melted and curd is smooth.\nSerious Eats / Amanda Suarez\nStrain curd through a fine-mesh strainer set over a medium bowl. Using a flexible spatula, scrape any residual curd from the bottom of the stainer into the bowl. Press plastic wrap against the surface of the lemon curd and transfer bowl to prepared ice bath. Chill for 30 minutes, then refrigerate until cold, about 1 hour. Transfer to an airtight container for later use.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nMedium saucepan, whisk, fine-mesh strainer, plastic wrap\nMake-Ahead and Storage\nLemon curd can be refrigerated in an airtight container for up to 5 days. Lemon curd can be frozen for up to 3 months in an airtight container; to use, thaw in refrigerator overnight.\nThe Latest\nDesserts\nVegetarian\nCondiments & Sauces\nGluten-free",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/quick-and-easy-lemon-curd.webp?"
}