{
  "url": "https://www.seriouseats.com/lemon-tart-recipe-8635255",
  "image_url": "https://www.seriouseats.com/thmb/m-ZIlbdASQj_R-NaCVXYbn_ITEI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240418-SEA-Lemon-Tart-AmandaSuarez-hero2-5808e7667177400486366bedc6c4323b.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "French",
    "Pies",
    "Lemon"
  ],
  "title": "Lemon Tart Recipe",
  "full_text": "Lemon Tart Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nCooling Time\n60 mins\nTotal\n115 mins\nServes\n6\nto 8\nMakes\n1 tart\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n1 1/2\ncups\n(\n6 2/3\nounces\n;\n190\ng\n)\nall-purpose flour\n1/4\ncup\n(\n1 3/4\nounce\n;\n50\ng\n)\ngranulated sugar\n1/4\nteaspoon\nDiamond Crystal kosher salt\n(for table salt, use half as much by volume)\n8\ntablespoons\n(\n113\ng\n)\nunsalted butter\n, melted and cooled slightly\n2\ntablespoons\n(\n30\nml\n)\nwater\nFor the Lemon Filling:\n3\nlarge\nwhole eggs\nplus\n6\nlarge\negg yolks\n1/2\ncup\n(\n120\nml\n)\nhoney\n1/4\ncup\ngrated lemon zest\nplus\n3/4\ncup\njuice\n(\n4\nwhole\nlemons\n)\n1/4\nteaspoon\nDiamond Crystal kosher salt\n(for table salt, use half as much by volume)\n4\ntablespoons\n(\n113\ng\n)\nunsalted butter\n, cut into ½-inch pieces\n3\ntablespoons\nheavy cream\n(see notes)\nDirections\nFor the Crust:\nAdjust oven rack to middle position and heat oven to 350℉. In a large bowl, whisk flour, sugar, and salt together. Pour butter and water into the flour mixture and using a flexible spatula, stir until well combined and a uniform dough is formed.\nSerious Eats / Amanda Suarez\nUsing your hands, pinch off and distribute three-quarters of the dough over the bottom of a 9-inch tart pan with a removable bottom. Using your hands and an off-set spatula or the bottom of a large measuring cup, press dough to an even thickness in the bottom of the pan. Pinch the remaining dough into smaller pieces and scatter evenly around the edge of the pan, then use your fingers to press dough into fluted sides of the pan. Press dough to even thickness until sides are completely covered.\nSerious Eats / Amanda Suarez\nPlace the dough-lined pan on wire rack set in rimmed baking sheet and bake until crust is light golden brown and firm to touch, 25 to 35 minutes, rotating pan halfway through baking. Set aside until ready to fill. (Cooled crust can be wrapped loosely in plastic wrap and stored at room temperature for up to 24 hours.)\nSerious Eats / Amanda Suarez\nFor the Lemon Filling:\nWhisk eggs and yolks, honey, lemon zest and juice, and salt together in a medium saucepan until smooth. Cook over medium-low heat, stirring constantly with rubber spatula, until mixture thickens slightly and registers 165°F, 5 to 7 minutes. Off heat, whisk in butter until melted. Strain lemon curd through fine-mesh strainer set over a bowl, then gently stir cream into the strained mixture with a rubber spatula.\nSerious Eats / Amanda Suarez\nPour the warm lemon curd over the baked crust. Bake until the filling is shiny and opaque and center jiggles slightly when shaken, 10 to 12 minutes, rotating halfway through baking. Cool on a wire rack to room temperature, at least 1 hour.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9-inch tart pan with removable bottom, wire rack and rimmed baking sheet, medium saucepan\nNotes\nIf you do not have heavy cream on hand, you can omit and add an additional 2 tablespoons butter in its place.\nMake-Ahead and Storage\nCrust can be made up to 24 hours in advance of filling. After baking, cool crust completely, then wrap loosely in plastic wrap and store at room temperature until ready to fill.\nLeftover tart can be covered with plastic wrap and stored in the refrigerator for up to 3 days.\nDesserts\nThe Latest\nFrench\nPies\nLemon"
}