{
  "url": "https://www.seriouseats.com/lemon-pastry-cream",
  "image_url": "https://www.seriouseats.com/thmb/lYBYPEZAAYlfiztwMvQHUJYluu8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201210-choux-lemon-cream-puffs-vicky-wasik-1-7-7f11b50130984834a615b94042b531ad.jpg",
  "tags": [
    "Pastries",
    "Lemon"
  ],
  "title": "Lemon Pastry Cream Recipe",
  "full_text": "Lemon Pastry Cream Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n20 mins\nChilling Time\n2 hrs 30 mins\nTotal\n2 hrs 50 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\n(\n1/2\ncup\n;\n115\ng\n)\ngranulated sugar\n1 1/4\nounces\n(\n3\ntablespoons\nplus\n2\nteaspoons\n;\n35\ng\n)\ncornstarch\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nYolks\nfrom\n5\nlarge\neggs, straight from the fridge (\n3 1/2\nounces\n;\n95\ng\n)\n2\ncups\n(\n455\ng\n)\nwhole milk\n1\ntablespoon\nfreshly grated\nlemon zest\n(\n1/8\nounce\n;\n4\ng\n), from\n2\nlarge\nlemons\n1\nounce\nunsalted butter\n(\n2\ntablespoons\n;\n30\ng\n), cut into 1/2-inch cubes\n2\ntablespoons\n(\n30\nml\n)\nfresh juice\nfrom\n1\nzested\nlemon\nDirections\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nIn a medium heatproof mixing bowl set on top of a dampened towel (this serves as a stable base), stir together sugar, cornstarch, and salt. Whisk in egg yolks until mixture is pale yellow, smooth, and fluffy, about 1 minute.\nIn a 2-quart stainless steel saucier, combine milk and lemon zest. Bring to a bare simmer over medium heat.\nRemove milk from heat. While whisking continuously, slowly pour milk into egg yolk mixture in a thin stream until all of it has been added.\nReturn the mixture to the same saucier. Cook over medium heat, whisking constantly until pastry cream begins to thicken, about 2 minutes. Once it thickens, continue to whisk, pausing every few seconds to check for bubbles, about 1 minute. When it begins to bubble, set a timer and continue whisking for 1 minute. This step is important to neutralize starch-dissolving protein found in egg yolks.\nOff-heat, whisk in butter until melted and thoroughly combined. Strain pastry cream through a fine-mesh strainer set over a medium heatproof bowl. Immediately place plastic wrap or buttered parchment paper directly on the surface of the cream to prevent a skin from forming. Transfer bowl to prepared ice bath to chill for 30 minutes, then refrigerate until cold, about 2 hours.\nWhen you are ready to use the pastry cream, add lemon juice and whisk until smooth.\nSpecial Equipment\n2-quart stainless steel saucier,\nballoon whisk\n,\nfine-mesh strainer\nNotes\nYou can substitute part or all of the lemon with lime zest and juice to make lemon-lime or lime pastry creams.\nMake-Ahead and Storage\nPastry cream can be stored in an airtight container, with plastic wrap or buttered parchment paper placed directly on the surface, and refrigerated for up to 3 days.\nPastries\nLemon",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lemon-pastry-cream-recipe.webp?"
}