{
  "url": "https://www.seriouseats.com/lemon-poppy-seed-muffin-recipe-11739490",
  "image_url": "https://www.seriouseats.com/thmb/N1fW_KUspvXVi0_m3nTn5-cL5JM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250521-SEA-LemonPoppySeedMuffins-AmandaSuarez-hero-943db7b31c5342c19006a505c217cc43.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Snacks & Appetizers",
    "Breakfast & Brunch",
    "Baking"
  ],
  "title": "How to Make Bakery-Worthy Lemon–Poppy Seed Muffins",
  "full_text": "How to Make Bakery-Worthy Lemon–Poppy Seed Muffins\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nCooling Time:\n35 mins\nTotal\n75 mins\nServes\n14\nMakes\n14 muffins\nCook Mode\n(Keep screen awake)\nIngredients\n200\ng\ngranulated suga\nr (\n7\nounces\n;\n1\ncup\n)\n170\ng\nunsalted butter\n(\n6\nounces\n;\n1 1/2\nsticks\n), room temperature, cut into 1/2-inch cubes\n32\ng\n(\n1/4\ncup\n)\nlemon zest\nplus\n3\ntablespoons\n(\n45\nml\n)\nlemon juice\nfrom\n4\nlemons\n340\ng\nall-purpose flour\n(\n12\nounces\n;\n2 1/3\ncups\n)\n2\nteaspoons\n(\n8\ng\n)\nbaking powder\n1/4\nteaspoon\nbaking soda\n3/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n2\ntablespoons\n(\n18\ng\n)\npoppy seeds\n2\nlarge\neggs\n, room temperature\n1\ntablespoon\nvanilla extract\n3/4\ncup\n(\n180\nml\n)\nwhole milk\n, room temperature\nFor the Glaze:\n2\ntablespoons\n(\n30\nml\n)\nlemon juice\n57\ng\nconfectioners’ sugar\n(\n2\nounces\n;\n1/2\ncup\n), plus more as needed\nDirections\nAdjust oven rack to middle position and preheat to 350°F (180°C). Line a 12-cup muffin tin with paper or reusable baking cups; set aside.\nIn the bowl of a stand mixer fitted with the paddle attachment, combine sugar with lemon zest, using your fingers to rub them together until mixture is fragrant, about 30 seconds. Let sit for 5 minutes. (Alternatively, sugar and lemon zest can be combined in a large bowl and an electric hand mixer can be used.)\nSerious Eats / Amanda Suarez\nIn a medium bowl, whisk flour, baking powder, baking soda, salt, and poppy seeds; set aside.\nSerious Eats / Amanda Suarez\nAdd butter to lemon and sugar mixture and mix on low speed to roughly incorporate. Increase speed to medium and beat until fluffy and light, pausing to scrape down sides and bottom of the bowl halfway through, about 5 minutes. With the mixer still running, add eggs one at a time, letting each fully incorporate before adding the next, then drizzle in vanilla.\nSerious Eats / Amanda Suarez\nStop mixer and scrape down bowl. On low speed, add 1/2 of the flour mixture, beat until just combined, then add milk and lemon juice and beat until combined. Add remaining flour and resume mixing on medium speed for about 3 seconds to ensure everything is well combined.\nSerious Eats / Amanda Suarez\nEvenly divide batter between baking cups, filling each about 2/3 of the way. Bake until a wooden toothpick or cake tester inserted into center comes out clean and muffins spring back when touched, about 25 minutes. Let cool in pan for 5 minutes, then transfer to a wire rack to cool completely, about 30 minutes. Repeat with remaining batter.\nSerious Eats / Amanda Suarez\nWhile the muffins cool, prepare the glaze:\nIn a small bowl, whisk lemon juice and confectioners’ sugar until smooth. For a thicker frosting, whisk in additional confectioners’ sugar, one tablespoon at a time, until desired consistency. Using a spoon, drizzle or spread glaze over cooled muffins.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-cup muffin tin; paper or reusable baking cups; stand mixer or electric hand mixer; flexible spatula; whisk\nMake-Ahead and Storage\nOnce cooled, muffins can be stored in an airtight container or zip-top bag at room temperature for up to 5 days. They can also be frozen in an airtight container for up to 3 months; thaw overnight in the fridge before serving.\nThe Latest\nRecipes\nSnacks & Appetizers\nBreakfast & Brunch\nBaking"
}