{
  "url": "https://www.seriouseats.com/lemon-ricotta-cheesecake",
  "image_url": "https://www.seriouseats.com/thmb/dfe_9tEoqyuKuersT0cJP4YAMrw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__11__20191107-lemon-ricotta-cheesecake-vicky-wasik-12-bdb1f60f78774258885ebc6b5ee0d3ab.jpg",
  "tags": [
    "Cheesecakes",
    "Spring Desserts",
    "Gluten-free Desserts",
    "Ricotta",
    "Lemon"
  ],
  "title": "Lemon-Ricotta Cheesecake",
  "full_text": "Lemon-Ricotta Cheesecake\nClose\nJump to recipe\nPrep\n10 mins\nCook\n3 hrs 30 mins\nActive\nAbout 30 mins\nChilling Time\n13 hrs\nTotal\n16 hrs 40 mins\nServes\n10\nto 12 servings\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Graham Cracker Crust:\n9\nounces\nfine cookie crumbs\n,\nstore-bought\nor\nhomemade\n, such as\ngingerbread\n,\ngingersnaps\n, or\ngraham crackers\n, see note (about\n2\ncups\n;\n250\ng\n)\n1\nounce\nunsalted butter\n, melted (about\n2\ntablespoons\n;\n30\ng\n)\nPinch\nof\nsalt\nFor the Cheesecake:\n24\nounces\nfull-fat cream cheese\n, such as\nPhiladelphia\n, brought to about 70°F/21°C (about\n3\ncups\n;\n680\ng\n)\n24\nounces\nfresh ricotta\n, strained if watery, brought to about 70°F/21°C, see note (about\n3\ncups\n;\n680\ng\n)\n10\nounces\nplain\nor\ntoasted sugar\n(about\n1 1/2\ncups\n;\n280\ng\n)\n1\nounce\nfreshly squeezed lemon juice\n(about\n2\ntablespoons\n;\n30\ng\n)\n1\ntablespoon\nfreshly grated lemon zest\n, not packed (about\n5\ng\n)\n1/2\nteaspoon\nlemon oil\nor\nlemon extract\n1/2\nteaspoon\norange flower water\n1/4\nteaspoon\n(\n1\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\n8\nlarge\neggs\n(about\n14\nounces\n;\n395\ng\n)\nTo Serve:\nCandied lemon peel\n,\nblueberry jam\n, or other accompaniments, such as\n1\nrecipe\n(about\n1/2\ncup\n)\ncomplementary\nfruit syrup\nor\njelly\n, for saucing the fruit, optional\nDirections\nGetting Ready:\nThis recipe requires an 8- by 4-inch nonreactive aluminum pan, preferably a non-latching, two-piece style, such as\nthis one\n. Otherwise, a traditional cake pan of those dimensions will work, with a touch more effort to unmold. Of course, cheesecake can be baked in any size or style of pan, but the volume of batter, target temperatures, and times will require individual adjustments, which have not been tested here.\nSerious Eats / Vicky Wasik\nIf using a two-piece pan, wrap the bottom piece in foil before assembly, then tear away the excess so the pan sits flat. If using a traditional cake pan, line the bottom with a parchment round (explanation and tutorial\nhere\n). In either case, lightly grease the pan.\nSerious Eats / Vicky Wasik\nFor the Crust:\nAdd the cookie crumbs, melted butter, and salt to the pan, and stir with a fork until well combined. If needed, season to taste with additional salt. With your fingers, compress into an even layer along the bottom of the pan. The mixture may seem drier than you might expect, but it will absorb moisture from the cheesecake as it bakes.\nSerious Eats / Vicky Wasik\nFor the Cheesecake:\nAdjust the oven rack to the middle position and preheat to 225°F (110°C). Combine cream cheese, ricotta, sugar, lemon juice, lemon zest, lemon oil, orange flower water, and salt in the bowl of a 14-cup food processor and process until smooth, pausing to scrape the bowl as needed to dislodge any pieces of cream cheese that do not initially incorporate. Once smooth, add the eggs and process only until well combined. Use immediately or refrigerate the batter in an airtight container until needed, up to one week. Please note that the volume of batter will overwhelm mini-choppers as well as food processors with a \"thick liquid\" max-fill line of less than 10-cups; if this equipment is not available, the ingredients will need to be combined by hand or with great care in a stand mixer to avoid over-aeration.\nSerious Eats / Vicky Wasik\nPour batter into the prepared pan and place on a baking sheet. Bounce a spoon across the surface to dislodge any air bubbles in the batter. If you don't see any, no need to continue. If you do notice a few rising up, keep bouncing the spoon until they're gone.\nSerious Eats / Vicky Wasik\nBake until the cheesecake feels firm around the edges, though the innermost ring of cheesecake will wobble when you shake the pan. This softer zone should be no more than 3 inches across. The cheesecake will be done when the very center registers 155°F (68°C) on a digital thermometer inserted into the very center of the cheesecake. Testing with a thermometer will not cause the cheesecake to crack; cracking is the result of over-baking and nothing more. In an accurate oven, with an 8- by 4-inch aluminum pan, the cheesecake will bake in about 3 1/2 hours. Please be aware the bake time will vary, perhaps substantially, according to the accuracy of the oven's temperature, pan style, batter temperature, and other factors. Cool the cheesecake at least 1 hour (or up to 4) before covering it to refrigerate until cold to the core, at least 12 hours.\nUnmolding the Cheesecake From a Loose-Bottom Cake Pan\n: Loosen the sides of the cheesecake from the pan with a thin knife or offset spatula. Place the pan on a large can of tomatoes or a similarly sized object; something tall enough to lift the cheesecake 4 inches from the counter, and wide enough to form a stable base. With both hands on the sides of the pan, pull downward to drop the outer ring away from the bottom. Place the cake onto a flat work surface, loosen it from the bottom of the pan with an offset spatula, and transfer to a large, flat serving plate. Cover with plastic and refrigerate until needed, up to 10 days.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nUnmolding the Cheesecake From a Traditional Cake Pan\n: Loosen the sides of the cheesecake from the pan with a thin knife or offset spatula. Stand the cake in a few inches of scalding hot water until the pan feels warm (a roasting pan works well for this). Drape the cake in plastic wrap to protect its surface and then invert onto a large, flat plate. Lift the pan to pull it away. It should slide free without any resistance; if not, continue standing in hot water a few minutes more. After removing the pan, peel the parchment from the crust, and re-invert the cheesecake onto a serving plate. Cover with plastic and refrigerate until needed, up to 10 days.\nTo Serve:\nTop with candied lemon rind, jam, or homemade fruit syrup. Cut the cheesecake with a large chef's knife dipped in hot water; for clean and tidy portions of cheesecake, pause to clean the blade under hot running water between each slice.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nOne 8- by 4-inch non-reactive loose bottom pan\n,\nfood processor\n,\noffset spatula\n(optional)\nNotes\nThe lemony flavor of this cheesecake pairs nicely with many types of cookie crumbs, whether homemade (recipe suggestions follow) or store-bought, particularly those with a strong note of ginger or spice to balance the bright lemon. Suggestions include\ngingersnaps\n,\ngingerbread\n, and\nlemon-ginger creams (wafers only)\n, or options like\nBiscoff-style speculoos cookies\nor homemade graham crackers. Gluten-free alternatives to any of these options will work equally well.\nThe flavor, texture, and appearance of this cheesecake can vary substantially depending on the composition of the ricotta itself, so expect deviations from brand to brand and style to style, depending on factors such as fat, protein, and moisture content. These variations will all produce an enjoyable cheesecake, so long as the ricotta has a good flavor and texture to start. A grainy, gritty ricotta will make a grainy, gritty cheesecake.\nMake-Ahead and Storage\nIn an airtight container, the cheesecake batter can be refrigerated up to one week and used straight from the fridge. Wrapped in plastic, the finished cheesecake will keep well for about 10 days in the fridge.\nRead More\nBasque Cheesecake\nJapanese Cotton-Soft Cheesecake\nPay De Queso (Mexican Cheese Pie)\nTaste Test: The Best Ricotta Cheese\nCheesecakes\nSpring Desserts\nGluten-free Desserts\nRicotta\nLemon"
}