{
  "url": "https://www.seriouseats.com/lemon-pepper-chicken-recipe-8779734",
  "image_url": "https://www.seriouseats.com/thmb/Yim46XGKRQNbzHkUuPF7BmiZ6ac=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250102-SEA-LemonPepperChicken-FredHardy-Hero1-31-0f52609331b544d5be27bae231c0986f.jpg",
  "tags": [
    "Chicken",
    "The Latest",
    "Lemon",
    "Chicken Breast"
  ],
  "title": "Lemon-Pepper Chicken",
  "full_text": "Lemon-Pepper Chicken\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nTotal\n50 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1\nmedium\nlemon\n(\n5\nounces\n;\n141\ng\n)\n1/2\ncup\nall-purpose flour\n(\n2 1/4\nounces\n; 64\ng\n)\n4\nboneless, skin-on\nchicken breasts\n(\n12\nounces\n;\n340\ng\n), patted dry\n2 3/4\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\n1\nteaspoon\nfreshly\nground black pepper\n, divided, plus more for garnish\n1/4\ncup\n(\n60\nml\n)\nextra virgin olive oil\n1/3\ncup\n(\n90\nml\n)\nwhite wine\n4\ntablespoons\nunsalted butter\n(\n2\nounces\n;\n57\ng\n), cubed\n1\ntablespoon\nfresh thyme\nleaves, plus more for garnish\nDirections\nAdjust oven rack to middle position, and preheat to 400°F (205ºC). Using a microplane grater, zest lemon to yield 2 teaspoons zest; set aside. Halve lemon crosswise; set aside separately from zest.\nSerious Eats / Fred Hardy\nIn a wide, shallow bowl, spread flour in an even layer. Sprinkle chicken evenly with 2 1/2 teaspoons salt and 3/4 teaspoon black pepper. Working with one chicken breast at a time, dredge chicken in flour, shaking off excess. Transfer to a plate, and repeat with remaining chicken breasts; set aside.\nSerious Eats / Fred Hardy\nIn a 12-inch enameled cast iron or stainless steel skillet, heat oil over medium heat until just shimmering. Add reserved lemon halves, cut sides down, and cook, undisturbed, until edges begin to brown, about 5 minutes. Remove lemon halves from skillet; set aside. Increase heat to medium-high; add chicken to skillet, skin sides down, and cook, rotating pan as needed, until skin is golden brown and crisp, 6 to 8 minutes. Using tongs, carefully flip chicken breasts, skin sides up, and return lemon halves to skillet, cut sides down. Remove from heat.\nSerious Eats / Fred Hardy\nPlace skillet in oven and bake until a thermometer inserted into thickest part of chicken registers 160°F (71ºC) on an instant-read thermometer, 15 to 18 minutes. Let rest 5 minutes; temperature will continue to rise to 165°F (74ºC). Transfer chicken breasts to a platter; loosely tent with foil to keep warm, and let rest while making sauce. Juice caramelized lemon halves to yield 2 tablespoons juice; set juice aside. Do not wipe skillet clean.\nSerious Eats / Fred Hardy\nFor the Sauce:\nWhile chicken is resting, return skillet to medium-high. Add remaining 1/4 teaspoon each salt and pepper to drippings in skillet; cook, stirring constantly, for 1 minute. Add wine and cook, stirring constantly, until reduced by half, about 2 minutes.\nSerious Eats / Fred Hardy\nAdd butter; cook, whisking constantly, until butter is melted, about 1 minute. Lower heat to medium; cook, whisking constantly, until a creamy, emulsified sauce is formed, about 1 minute. (When ready, it should coat the back of a spoon and a finger dragged through it should leave a trail.) Whisk in reserved lemon juice and thyme. Drizzle sauce over chicken, and garnish with additional freshly ground black pepper, thyme, and reserved lemon zest.\nSerious Eats / Fred Hardy\nSpecial Equipment\nMicroplane grater, 12-inch enameled cast iron or stainless steel skillet, instant-read thermometer, whisk\nMake-Ahead and Storage\nThe chicken and sauce is best served the day of, but leftovers can be safely stored for up to 4 days in an airtight container in the refrigerator.\nChicken\nThe Latest\nLemon\nChicken Breast"
}