{
  "url": "https://www.seriouseats.com/lemon-drizzle-cake-recipe-8779610",
  "image_url": "https://www.seriouseats.com/thmb/RVRw00DlYdV4I975qw590vIeAhU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250123-SEA-LemonDrizzleCake-MaureenCelestine-Beauty1-91-5509584e04214ef68d1a0b30a10736ee.jpg",
  "tags": [
    "Lemon",
    "The Latest",
    "Cakes",
    "Desserts",
    "British"
  ],
  "title": "Lemon Drizzle Cake",
  "full_text": "Lemon Drizzle Cake\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nCooling Time\n3 hrs\nTotal\n4 hrs 10 mins\nServes\n10\nMakes\n1 9-inch loaf\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nNonstick\nspray\n250\ng\nself-rising flour\n(\n8 3/4\nounces\n; about\n2\ncups\n), see notes\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n226\ng\nunsalted butter\n(\n8\nounces\n;\n2\nsticks\n), softened to about 60º to 65ºF (16º to 18ºC)\n226\ng\ngranulated\nsugar\n(\n8\nounces\n;\n1\ncup\nplus\n2\ntablespoons\n)\n4\nlarge\neggs\n3 tablespoons lemon zest (1/2 ounce; 15g) and 2 tablespoons (30ml) fresh lemon juice  from\n1\nmedium\nlemon\n1\nteaspoon\nvanilla\npaste or vanilla extract (see notes)\nFor the Drizzle:\n100\ng\ngranulated sugar\n(\n3 1/2\nounces\n;\n1/2\ncup\n), see notes\n1/4\ncup\n(60ml)\nfresh lemon juice\nfrom about 2 lemons\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Using nonstick spray, generously grease a 9- by 5-inch loaf pan. Line pan with parchment cross-wise, allowing a 1-inch overhang on the longer sides of the pan.\nSerious Eats / Maureen Celestine\nIn a medium bowl, sift together flour and salt. Set aside.\nSerious Eats / Maureen Celestine\nIn the bowl of a stand mixer fitted with paddle attachment, beat butter and sugar on medium-high speed until pale and fluffy, about 2 minutes. Add the eggs, lemon juice, lemon zest, and vanilla paste and mix until fully combined, about 45 seconds. (Mixture will look slightly separated.) Add the dry ingredients and mix, pausing to scrape down the sides of the bowl with a flexible rubber spatula as needed, until just combined and no dry spots remain, about 30 seconds. Do not overmix. Using a flexible rubber spatula, spread batter into prepared pan. (Alternatively, the batter can be prepared in a large mixing bowl using an electric hand mixer.)\nSerious Eats / Maureen Celestine\nBake until top of loaf is golden brown and a cake tester or skewer inserted in the middle comes out clean, 55 to 60 minutes. (Check the cake at the 40 minute mark; if the cake is becoming too dark, tent it with foil and continue to bake.)  Remove cake from oven. Using a cake tester or skewer, prick the top of the cake about 15 to 20 times; set aside.\nSerious Eats / Maureen Celestine\nFor the Drizzle:\nIn a spouted measuring cup, whisk sugar and lemon juice until a cloudy syrup forms. (The sugar should not be dissolved.) Drizzle over still-hot cake, distributing mixture evenly across entire surface to adequately soak the loaf. Using a flexible rubber spatula, scrape any remaining granulated sugar from the cup and onto the cake, taking care to spread it evenly across the loaf.\nSerious Eats / Maureen Celestine\nSet pan on a wire rack and allow cake to cool completely, until bottom of pan is cool to the touch and a white crystallized topping has formed on top of the cake, about 3 hours. Lift parchment to remove cake from pan. Slice with serrated knife and serve at room temperature.\nSerious Eats / Maureen Celestine\nSpecial Equipment\n9- by 5-inch\nloaf pan\n,\nstand mixer\nor\nhand mixer\n, cake tester or skewer, spouted measuring cup, serrated knife\nNotes\nVanilla paste will give the cake a more pronounced vanilla flavor, but good-quality vanilla extract can also be used.\nThough you can substitute granulated sugar with finer sugar like caster or superfine sugar in the drizzle, your cake will not develop the crackly coating of sugar.\nTo make your own self-rising flour: In a large bowl, whisk 2 cups all-purpose flour with 3 teaspoons baking powder and 1 1/2 teaspoons Diamond Crystal kosher salt. (For table salt, use half as much by volume.)\nI recommend slicing the cake with a\nserrated knife\n, as its jagged edges guarantee clean, even slices. Though you can slice the loaf with a chef’s knife, it may result in ragged slices or cause the delicate cake to crumble.\nMake-Ahead and Storage\nOnce cooled, the leftover cake can be loosely wrapped in foil and stored at room temperature for up to 3 days. (Avoid storing the cake in an airtight container, as the trapped moisture will cause the drizzle to lose its crunch.) Do not refrigerate.\nCake can be tightly wrapped in foil or plastic wrap and frozen for up to 3 months. Thaw overnight at room temperature.\nLemon\nThe Latest\nCakes\nDesserts\nBritish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lemon-drizzle-cake.webp?"
}