{
  "url": "https://www.seriouseats.com/lemon-pound-cake-recipe-11713660",
  "image_url": "https://www.seriouseats.com/thmb/U3MwLEei9sU9zU2eG8c0RLnJVLM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250411-LemonPoundCake-DebbieWee-hero-3-1-342ba77a185b4c68aab926b62618a9ff.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Recipes"
  ],
  "title": "Lemon Pound Cake",
  "full_text": "Lemon Pound Cake\nClose\nJump to recipe\nPrep\n20 mins\nCook\n70 mins\nCooling Time:\n2 hrs\nTotal\n3 hrs 30 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n6\ng\n(\n2\ntablespoons\n) packed grated\nlemon zest\nplus\n1\ntablespoon\nfresh\njuice\nfrom\n2\nlarge\nlemons\n, divided\n240\ng\nsugar\n(\n8.5\nounces\n;\n1 1/4\ncups\n)\n198\ng\nbleached\ncake flour\n(\n7\nounces\n;\n1 1/2\ncups\n), plus extra for flouring pan\n1\nteaspoon\nbaking powder\n4\nlarge\neggs\n, room temperature\n5\ng\n(\n1\nteaspoon\n)\nvanilla extract\n227\ng\nunsalted butter\n(\n2\nsticks\n;\n16\ntablespoons\n), softened plus extra for greasing pan\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n30\nml\n(\n2\ntablespoons\n)\nwhole milk\n, room temperature\nFor the Syrup:\n50\ng\ngranulated sugar\n(\n1/4\ncup\n;\n1 3/4\nounces\n)\n60\nml\n(\n1/4\ncup\n)\nlemon juice\n(from\n2\nlemons\n)\nFor the Glaze:\n57\ng\nconfectioners' sugar\n(\n2\nounces\n;\n1/2\ncup\n), sifted\n15\nml\n(\n1\ntablespoon\n)\nlemon juice\n(from\n1\nlemon\n)\nLemon zest\nor fresh or candied lemon slices for garnish, optional\nDirections\nFor the Cake:\nAdjust oven rack to middle position and heat oven to 350°F (175°C). Generously butter a 9- x 5-inch (or 8 1/2- x 4 1/2-inch) loaf pan; dust pan liberally with flour and knock out excess flour.\nSerious Eats / Debbie Wee\nIn a large bowl, combine sugar and lemon zest, using your fingers to rub them together until mixture is fragrant, about 30 seconds.\nSerious Eats / Debbie Wee\nIn a medium bowl, whisk flour and baking powder to combine; set aside. In a 2-cup liquid measuring cup or medium bowl, whisk eggs and vanilla until combined; set aside.\nSerious Eats / Debbie Wee\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter and salt on medium-high speed until shiny, smooth, and creamy, 2 to 3 minutes, scraping down bowl as needed. Reduce speed to medium and gradually pour in lemon-sugar mixture (this should take about 60 seconds). Once all sugar is added, increase speed to medium-high and beat until mixture is fluffy and almost white in color, 5 to 8 minutes, scraping down bowl as needed.\nSerious Eats / Debbie Wee\nReduce speed to medium and gradually add egg mixture in slow, steady stream (this should take 60 to 90 seconds). Scrape down bowl. Increase speed to medium-high and beat mixture until light and fluffy, 3 to 4 minutes (mixture may look slightly broken).\nSerious Eats / Debbie Wee\nStop mixer and scrape down bowl. On low speed, add 1/3 of the flour mixture, beat until just combined, then add milk and lemon juice and beat until combined. Add another 1/3 of the flour mixture, beat until just combined, then repeat with remaining flour. Scrape bottom of bowl to ensure that batter is homogenous.\nSerious Eats / Debbie Wee\nTransfer batter to prepared loaf pan and smooth surface with rubber spatula. Bake until golden brown and wooden skewer, cake tester, or butter knife inserted in center of cake comes out clean, 1 hour 10 minutes to 1 hour 20 minutes (see notes). If cake starts to turn too dark before it is fully baked inside, cover loosely with aluminum foil towards the end of baking.\nSerious Eats / Debbie Wee\nFor the Syrup:\nWhile cake bakes, in a small saucepan, stir together sugar and lemon juice and cook over medium-high heat until sugar dissolves. Simmer for 2 minutes, remove from heat, and set aside.\nSerious Eats / Debbie Wee\nOnce cake is baked, cool cake in pan on a wire rack for 10 minutes, then turn cake out onto rack. Brush top and sides of still-warm cake with syrup and cool completely, about 2 hours.\nSerious Eats / Debbie Wee\nFor the Glaze:\nOnce cake is cooled, in a small bowl, whisk confectioners' sugar and lemon juice until smooth. Spread glaze over cake, allowing some to drip down sides. Garnish with additional lemon zest or candied or fresh lemon slices, if desired. Let glaze set for at least 15 minutes before serving.\nSerious Eats / Debbie Wee\nSpecial Equipment\n9- x 5-inch (or 8 1/2- x 4 1/2-inch) loaf pan, stand mixer with paddle attachment, small saucepan, pastry brush\nMake-Ahead and Storage\nLeftover cake can be stored at room temperature for up to 5 days or frozen for up to 1 month.\nCakes\nThe Latest\nRecipes"
}