{
  "url": "https://www.seriouseats.com/les-halles-boeuf-bourguignon-recipe",
  "image_url": null,
  "tags": [
    "Beef Mains",
    "French",
    "Braised & Stewed Beef",
    "Beef"
  ],
  "title": "Les Halles's Boeuf Bourguignon Recipe",
  "full_text": "Les Halles's Boeuf Bourguignon Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 45 mins\nTotal\n2 hrs 55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nbeef shoulder\nor neck, cut into 1 1/2–inch pieces\nSalt\nand\npepper\n1/4\ncup\nolive oil\n4\nonions\n, thinly sliced\n2\ntablespoons\nall-purpose flour\n1\ncup\nred Burgundy\n6\ncarrots\n, cut into 1-inch pieces\n1\ngarlic\nclove\n1\nbouquet garni\nA little\nchopped flat parsley\nDirections\nSeason the meat with salt and pepper. In the Dutch oven, heat the oil over high heat until it is almost smoking. Add the meat, in batches, and sear on all sides until it is well browned. When all the meat is a nice, dark brown color and has been set aside, add the onions to the pot. Lower the heat to a medium high until the onions are soft and golden brown (about 10 minutes). Sprinkle the flour over them. Continue to cook for about 4 to 5 minutes, stirring occasionally, then add the red wine. Naturally, you want to scrape up all the really good\nfond\nfrom the bottom of the pot with your wooden spoon. Bring the wine to a boil.\nReturn the meat to the pot and add the carrots, garlic, and bouquet garni. Add just enough water so that the liquid covers the meat by one third—meaning you want a ratio of 3 parts liquid to 2 parts meat. Bring to a boil, reduce to a gentle simmer, and let cook for about 2 hours, or until the meat is tender.\nCheck the dish every 15 to 20 minutes, stirring and scraping the bottom of the pot to make sure the meat is not sticking or scorching. You should also skim off any foam or sum or oil collecting on the surface. When done, removed and discard the bouquet garni, add the chopped parsley to the pot, and serve.\nBeef Mains\nFrench\nBraised & Stewed Beef\nBeef"
}