{
  "url": "https://www.seriouseats.com/let-them-eat-chocolate-salted-caramel-buche-de-noel-christmas-cake-roll-yule-log-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Uu2dFImaIXRUqRveKP8WTFuQLTE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111227-127677-LTE-Chocolate-Buche-PRIMARY-df31791890104fe0b8f06d38503f7431.jpg",
  "tags": [
    "Cakes",
    "Chocolate",
    "Christmas Desserts"
  ],
  "title": "Chocolate and Salted Caramel Bûche de Nöel Recipe",
  "full_text": "Chocolate and Salted Caramel Bûche de Nöel Recipe\nClose\nJump to recipe\nPrep\n50 mins\nCook\n2 hrs\nActive\n2 hrs 30 mins\nCooling and Chilling Time\n2 hrs 45 mins\nTotal\n5 hrs 35 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cocoa Meringue Decorations:\n5\nlarge\negg whites\n, at room temperature\n3/4\ncup\nsugar\n6\ntablespoons\nunsweetened cocoa powder\n2\ntablespoons\nconfectioners sugar\nMaldon salt\n, to taste (optional)\nFor the Cake:\nBaking spray\n1/2\ncup\nplus\n2\ntablespoons\nsifted\ncake flour\n(See Notes)\n1\ncup\nunsweetened cocoa powder\n3/4\ncup\nsugar\n1 1/2\nteaspoons\nbaking powder\n3\nlarge\negg yolks\n, at room temperature\n1/4\ncup\nvegetable oil\n2\nteaspoons\npure\nvanilla extract\n1/4\ncup\nhot\nwater\n4\nlarge\negg whites\n, at room temperature\n1/2\nteaspoon\nsalt\nFor the Salted Caramel Filling:\n1\ncup\nplus\n2\ntablespoons\nsugar\n1/2\ncup\nwater\n4\ntablespoons\nlight corn syrup\n3/4\ncup\nheavy cream\n1\nteaspoon\nMaldon\nsalt\n3\nlarge\negg whites\n, at room temperature\n1\nstick\nunsalted butter\n(\n4\nounces\n) cut into\n8\npieces\n, at room temperature\n1\nteaspoon\npure\nvanilla extract\nFor the Chocolate Icing:\n2/3\ncups\nheavy cream\n2\ntablespoons\nlight corn syrup\n4\nounces\nbittersweet chocolate\n1/8\nteaspoon\nsalt\nDirections\nFor the Cocoa Meringue Decorations:\nAdjust oven rack to upper third and lower third positions and preheat oven to 225°F. Line 2 baking sheets with parchment paper.\nBeat whites on medium speed until frothy, 1 to 2 minutes. Slowly add sugar and continue beating until stiff peaks form and no grit remains, about 7 minutes.\nSift 1/4 cup cocoa powder and confectioners’ sugar over mixture and beat just until incorporated. Transfer half of meringue to large pastry bag (or gallon-sized zipper-lock bag) fitted with 1/4-inch pastry tip (See Notes). Sift remaining 2 tablespoons cocoa powder over remaining meringue and beat just to combine; set aside.\nPipe out 5- to 10-inch batons and 1/2-inch buttons on prepared baking sheet.\nFit a second pastry bag with the 1/4-inch pastry tip and fill with remaining cocoa meringue. Repeat piping procedure.\nBake until meringues are set and dry, 60 to 90 minutes. Transfer to cooling rack and cool completely, about 30 minutes. Carefully break batons up into different sized pieces.\nMeringues may be prepared a day in advance: cover cooled meringues with plastic wrap and store in a dry, room-temperature place.\nFor the Chocolate Icing:\nIn small saucepan, bring cream and corn syrup to simmer over medium-high heat (or microwave in bowl). Place chocolate in medium bowl. Pour warm cream over mixture, and whisk until smooth.\nPress plastic wrap directly on chocolate, and refrigerate until set and spreadable, 1 to 2 hours.\nFor the Cake:\nAdjust oven rack to middle position and preheat oven to 325°F. Lightly coat jelly roll pan (See Notes) with baking spray. Line with parchment paper and once again lightly coat with baking spray. Dust with enough cocoa powder and tap to evenly distribute and knock out excess.\nSift sifted cake flour, 1/2 cup cocoa powder, 1/2 cup sugar, and baking powder. Sift mixture once again, then, place in large bowl.\nIn medium bowl, whisk egg yolks, oil, and vanilla on until smooth. Add to flour mixture and whisk together until combined (mixture will be thick). Whisk in hot water and mix until smooth.\nIn separate clean, dry mixing bowl, whip egg whites and salt with whisk attachment on medium speed soft peaks form, about 2 minutes. Increase speed to medium-high and gradually add remaining 1/4 cup sugar; continue whipping until stiff peaks form, 1 to 2 minutes longer.\nStir 1/3 of egg whites into cake batter until thoroughly combined. With rubber spatula, gently fold in remaining egg whites.\nScrape batter into prepared pan and spread out evenly. Bake until top of cake is pale golden and lightly springs back when you press down on it, about 15 minutes.\nWhile cake bakes, dust clean, dry kitchen towel with cocoa powder.\nRun a knife around edges of just-baked cake. Turn cake over onto prepared towel. Starting at the short end, roll cake in towel and place seam-side down on cooling rack. Cool completely, about 45 minutes.\nFor the Salted Caramel Filling:\nCombine 1/2 cup sugar, 1/4 cup water, and 2 tablespoons corn syrup in heavy-bottomed medium saucepan, stirring with wooden spoon over medium heat until sugar dissolves. Simmer mixture until it turns dark amber and just begins to smoke.\nImmediately remove from heat and stir in cream and salt. Stir until smooth. Transfer to bowl and cool to room temperature.\nMeanwhile, stir remaining 1/2 cup plus 2 tablespoons sugar, remaining 1/4 cup water, and remaining 2 tablespoons corn syrup in heavy-bottomed medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 238°F on candy thermometer, 3 to 5 minutes.\nWhile syrup boils, place egg whites in clean, dry mixing bowl. Whip with whisk attachment on medium speed until soft peaks form, about 2 minutes. Carefully start pouring in the hot syrup in a slow, steady stream with the machine still running. Beat the mixture until the outside of the bowl is cool to the touch and the whites are thick and glossy, 5 to 7 minutes. Add butter, 1 tablespoon at a time, waiting until each piece is incorporated before adding the next.\nAdd cooled caramel sauce and mix just until combined. Refrigerate until needed (if it is too firm to spread, let sit at room temperature about 15 minutes, then whisk to smooth out).\nTo Assemble:\nCarefully unroll cake, leaving it on towel. Spread cake with caramel filling, leaving a 1/2-inch border on all sides. Slowly and gently roll the cake, this time without the towel, starting at the short end. Place the cake, seam-side down on a baking sheet and refrigerate until filling is firm, about 30 minutes.\nFrost roll with chocolate icing. Decorate with meringue sticks and buttons. Sprinkle with additional Maldon salt. Slice and serve.\nSpecial equipment\nsifter, 2 jelly roll pans / large baking sheets (See Notes), parchment paper, stand or handheld electric mixer, 1/4-inch pastry tip (See Notes), 2 gallon-sized zipper-lock bags, clean kitchen towel, cooling racks, heavy-bottomed medium saucepan, candy thermometer, plastic wrap\nCakes\nChocolate\nChristmas Desserts"
}