{
  "url": "https://www.seriouseats.com/lidia-bastianichs-farro-with-tuna-and-tomatoes",
  "image_url": "https://www.seriouseats.com/thmb/0EuQvv_WZuOfnjX-GiBd0SzwpRU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120418-202422-dinner-tonight-lidia-bastianich-farro-primary-2c327eb58d234b7fb0342ff830f7f74a.jpg",
  "tags": [
    "Farro & Other Wheat"
  ],
  "title": "Lidia Bastianich's Farro with Tuna and Tomatoes Recipe",
  "full_text": "Lidia Bastianich's Farro with Tuna and Tomatoes Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n30 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nfarro\n2\nbay leaves\n, preferably fresh\n1\ntablespoon\ncoarse sea salt\n, divided\n10\ntablespoons\nextra-virgin olive oil\n, divided\n6\nplump garlic\ncloves\n, sliced\n1/2\nteaspoon\npeperoncino flakes\n1\n(\n28-ounce) can\nwhole tomatoes\n, crushed by hand\n4\ntablespoons\ncapers\n, drained\n2\n(\n6-ounce) cans\ntuna in olive oil\n2\ntablespoons\nfresh Italian parsley\n, chopped\nDirections\nToss farro in a sieve and rinse under cold water. Let it drain, and then dump it in a large pot, along with 6 cups of water, bay leaves, 1/2 teaspoon salt, and 2 tablespoons of olive oil. Bring to a boil over high heat, stirring occasionally. Reduce heat to a simmer, and partially cover. Cook until grains are cooked through, but are still a little al dente, about 30 minutes. Most of liquid should be absorbed, but drain off any water that is left. Discard bay leaves.\nMeanwhile, add 1/3 cup of olive oil to a large skillet set over medium-high heat. When oil starts to shimmer, add garlic and peperoncino, stirring with a wooden spoon until the mixture is very fragrant, 30 seconds to a minute. Add tomatoes, 2 teaspoons salt, and the capers. Let mixture bubble for about five minutes, stirring occasionally.\nWhile that's cooking, drain cans of tuna, and use your fingers to flake tuna into 1/2-inch pieces. After tomatoes have cooked for five minutes, add flaked tuna to the skillet. Carefully stir mixture, so that you don't break tuna up too much. Cook, carefully stirring every minute or so, for another five minutes.\nReduce heat to medium, and pour in remaining olive oil (approximately 3 tablespoons). Stir in farro, and cook until farro is very hot and covered in sauce, about one minute. Season with more salt, if needed. Garnish with parsley and serve immediately.\nFarro & Other Wheat",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lidia-bastianichs-farro-with-tuna-and-tomatoes-recipe.webp?"
}