{
  "url": "https://www.seriouseats.com/light-and-fluffy-pancakes-recipe",
  "image_url": null,
  "tags": [
    "Pancakes",
    "Father's Day",
    "Buttermilk",
    "Mother's Day",
    "Winter Breakfast & Brunch"
  ],
  "title": "Light and Fluffy Buttermilk Pancakes",
  "full_text": "Light and Fluffy Buttermilk Pancakes\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n4\nto 6 servings\nMakes\n16 pancakes\nCook Mode\n(Keep screen awake)\nIngredients\nBasic Dry Pancake Mix:\n10\nounces\n(about\n2\ncups\n)\nall-purpose flour\n1\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1\nteaspoon\nkosher salt\n1\ntablespoon\nsugar\nFor Each Batch of Pancakes\n2\nlarge\neggs\n, separated\n1 1/2\ncups\n(about\n12\nounces\n)\nbuttermilk\n1\ncup\n(about\n8\nounces\n)\nsour cream\n(see notes)\n4\ntablespoons\nunsalted butter\n, melted, plus more for serving\nWarm\nmaple syrup\nDirections\nFor the Dry Pancake Mix:\nCombine flour, baking powder, baking soda, salt, and sugar in a medium bowl and whisk until homogenous. Transfer to an airtight container. The mix will stay good for 3 months. (See note.)\nSerious Eats / Mateja Zvirotic Andrijanic\nFor each Batch of Pancakes:\nPlace one batch of dry mix in a large bowl. In a medium clean bowl, whisk the egg whites until stiff peaks form. In a large bowl, whisk the egg yolks, buttermilk, and sour cream until homogenous. Slowly drizzle in the melted butter while whisking. Carefully fold in the egg whites with a rubber spatula until just combined. Pour the mixture over the dry mix and fold until just combined (there should still be plenty of lumps).\nSerious Eats / Mateja Zvirotic Andrijanic\nHeat a large heavy-bottomed nonstick skillet over medium heat for 5 minutes (or use an electric griddle). Add a small amount of butter or oil to the griddle and spread with a paper towel until no visible butter or oil remains. Use a 1⁄4-cup dry measure to place 4 pancakes in the skillet and cook until bubbles start to appear on top and the bottoms are golden brown, about 2 minutes. Carefully flip the pancakes and cook on the second side until golden brown and completely set, about 2 minutes longer. Serve the pancakes immediately, or keep warm on a wire rack set on a rimmed baking sheet in a warm oven while you cook the remaining 3 batches. Serve with warm maple syrup and butter.\nSerious Eats / Mateja Zvirotic Andrijanic\nNotes\nPancake dry mix can be scaled up as many times as you'd like. Each batch of pancakes takes 11 ounces of dry mix to make (about 2 cups plus 2 tablespoons). The sour cream can be replaced with more buttermilk.\nRead More\nOatmeal and Brown Butter Pancakes\nFluffy Vegan Oatmeal Pancakes Recipe (With Aquafaba)\nEasy Homemade Pancake Mix\nPancakes\nFather's Day\nButtermilk\nMother's Day\nWinter Breakfast & Brunch"
}