{
  "url": "https://www.seriouseats.com/light-tender-potato-gnocchi-recipe",
  "image_url": null,
  "tags": [
    "Gnocchis",
    "Italian",
    "Sage",
    "Russet Potatoes",
    "Pasta Mains"
  ],
  "title": "Light and Tender Potato Gnocchi With Sage-Butter Sauce Recipe",
  "full_text": "Light and Tender Potato Gnocchi With Sage-Butter Sauce Recipe\nJump to recipe\nPrep\n45 mins\nCook\n55 mins\nActive\n60 mins\nTotal\n100 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.4\nkg\n)\nrusset potatoes\n, scrubbed and pierced all over with a fork\n3\nlarge\negg yolks\n, lightly beaten\n(optional; see note)\n3/4\ncup\nall-purpose flour\n(about\n3 1/2\nounces\n;\n100\ng\n), divided, plus more for dusting and as needed\nKosher salt\n1\nstick\nunsalted butter\n(\n4\nounces\n;\n119\ng\n)\nLeaves from\n1\nlarge sprig\nfresh sage\n(about\n15\nlarge and small leaves\n)\nParmigiano-Reggiano cheese\n, for grating\nDirections\nPreheat oven to 450°F (232°C). Set potatoes either on a wire rack set over a baking sheet, on a baking sheet lined with a layer of salt, or directly on the oven's racks. Bake until completely tender throughout when pierced with a fork, about 45 minutes.\nTransfer potatoes to a work surface. Using tongs to hold hot potatoes, slice each in half lengthwise.\nUsing a spoon, scoop potato flesh into a ricer or food mill fitted with the finest disk. Press potato flesh onto a clean work surface, spreading it into an even layer, and allow steam to escape for a few minutes.\nDrizzle egg yolks all over, if using.\nScoop 1/2 cup flour into a fine-mesh sieve and tap to dust flour all over potatoes.\nUsing a pastry blender or bench scraper, chop down repeatedly all over to cut flour and egg into potato.\nUsing a bench scraper, gather up shaggy potato mass and pat into a loose ball. Press ball flat with hands, then fold in half using bench scraper and press down again.\nScoop remaining 1/4 cup flour into sieve and dust all over potato dough. Continue to gently fold and press, just until a uniform dough comes together. (Make sure to simply fold and press down; avoid the smearing motion more commonly used when kneading bread.)\nDust potato dough all over with flour and gently form into a log.\nClean work area well and dust with fresh flour. Using bench scraper, slice off a roughly 1-inch-thick portion of dough and roll into a snake about 1/2 inch thick; use a light touch as you roll, trying to use your palms more than your fingers, and dusting as necessary with flour to prevent sticking.\nUsing bench scraper, cut snake into 1-inch portions, trimming off uneven ends as necessary. Transfer gnocchi to a well-floured area or baking sheet and repeat with remaining dough.\nBring a large pot of very well-salted water to a boil. Meanwhile, melt butter in a large skillet over medium-high heat until it foams. Add sage and fry until very aromatic and butter begins to lightly brown; remove from heat.\nUsing a bench scraper or slotted spatula to scoop them up, transfer gnocchi to boiling water. Stir once very gently with a spider or slotted spoon to prevent sticking. When gnocchi begin to float to the surface, wait about 20 seconds, then taste one; it should be soft yet cooked through, without any raw-flour flavor.\nUsing spider or slotted spoon, scoop gnocchi directly into skillet with sage butter, allowing some of the water clinging to them to come along. Cook gnocchi in sage butter over medium-high heat, tossing very gently and adding a splash of cooking water as needed if sauce becomes greasy or breaks, until gnocchi are coated in a rich, creamy sauce, about 1 minute.\nCarefully spoon gnocchi into serving dishes and top with grated Parmesan cheese. Serve right away.\nSpecial Equipment\nPotato ricer\nor\nfood mill\n,\nfine-mesh sieve\n,\nbench scraper\n, pastry blender (optional)\nNotes\nEgg yolks make a slightly firmer dough that is easier to work with and less likely to fall apart when cooked, but they also cover up the potato's flavor slightly and produce gnocchi that are a little denser. If you're new to making gnocchi, we recommend starting with egg yolk; if you are more practiced, try omitting the egg yolk for gnocchi that are lighter and more potato-y. In our tests, we found that the amount of flour should be roughly the same whether you use egg yolks or not.\nGnocchis\nItalian\nSage\nRusset Potatoes\nPasta Mains"
}