{
  "url": "https://www.seriouseats.com/light-and-silky-banana-cremeux",
  "image_url": "https://www.seriouseats.com/thmb/eWL0p-bti5hJM6t4YdmUR6a0FVQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__12__20181127-banana-pudding-vicky-wasik-26-9266bab46ef54f7498a1bc5c665524c4.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "Banana",
    "Easter Desserts"
  ],
  "title": "Light and Silky Banana Crémeux Recipe",
  "full_text": "Light and Silky Banana Crémeux Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n30 mins\nResting Time\n6 hrs\nTotal\n6 hrs 40 mins\nServes\n9 servings\nCook Mode\n(Keep screen awake)\nIngredients\n28\nounces\nmilk\n,\nany percentage will do\n(about\n3 1/2\ncups\n;\n790\ng\n)\n16\nounces\npeeled, ripe\nbanana\nfrom about\n5\nmedium\nbananas\n, sliced into 1/2-inch pieces (about\n3\ncups\n;\n455\ng\n)\n1\nempty\nvanilla bean\npod\n, left over from another project, optional\n7\nounces\nplain\nor\ntoasted sugar\n(about\n1\ncup\n;\n195\ng\n)\n1 1/2\nounces\ncornstarch\n(a shy\n1/3\ncup\n;\n35\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use about half as much by volume or the same weight\n1/8\nteaspoon\n(\n0.5\ng\n)\nground cloves\n5\nounces\negg yolk\n(from about\n10\nlarge\neggs\n;\n140\ng\n)\n1/4\nounce\nvanilla extract\n(\n1 1/2\nteaspoons\n;\n7\ng\n)\n12\nounces\nheavy cream\n(about\n1 1/2\ncups\n;\n340\ng\n)\nDirections\nInfuse the Milk:\nCombine milk, sliced banana, and empty vanilla bean pod (if using) in\n3-quart stainless steel saucier\nand bring to simmer over medium heat, stirring from time to time with flexible spatula to prevent scorching along bottom. When dairy comes to a simmer, remove from heat, cover and let cool to room temperature, about 4 hours. Proceed to next step, or refrigerate up to 24 hours to extract stronger banana flavor. The exact timing will depend on both personal preference and convenience.\nMake the Custard:\nReturn banana milk to simmer over medium heat, stirring as before; then strain through\nfine-mesh sieve\ninto medium bowl. Press gently on banana pulp to release liquid, but don't allow pulp to pass through sieve. Pulp can be refrigerated to use in muffins, pancakes, or smoothies, but it will not benefit the custard. If using vanilla pod, scrape out flavorful milk inside each half with flexible spatula before discarding.\nUsing the same 3-quart saucier as before (no need to wash), whisk sugar, cornstarch, salt, and cloves together until well combined, followed by egg yolks. Whisk in infused milk. Return to stovetop and warm over medium-low heat, whisking gently until custard is steaming hot, about 5 minutes.\nIncrease heat to medium and continue cooking until the custard thickens, about 5 minutes more. When it begins to bubble, set timer and continue whisking for 90 seconds. This step is important to neutralize starch-dissolving protein found in egg yolks. Off-heat, stir in vanilla extract and season to taste with additional vanilla, salt, or cloves. If desired, strain custard through same sieve as before (again, no need to wash) to remove bits of chalazae that may remain or any accidentally curdled custard. Scrape into large glass or ceramic baking dish; then cover and refrigerate until firm and cold, at least 2 hours, although timing will vary. Alternatively, the prepared custard can be refrigerated up to one week.\nFinishing the Crémeux:\nIn the bowl of a stand mixer, whip cream to stiff peaks. Meanwhile, use flexible spatula to stir chilled custard until smooth and soft (this can be done right in the baking dish or in a separate bowl if you prefer). Add about 1/3 of the cream to banana custard; then fold and stir until smooth before folding in remaining whipped cream. Transfer to disposable piping bag fitted with a large star tip and divide between serving dishes. Serve immediately, or cover and refrigerate until needed, up to 24 hours. Pair with toasted nuts, cocoa nibs, fresh fruit, unsweetened whipped cream, or whatever toppings you desire.\nSpecial equipment\n3-quart stainless steel saucier, Nonreactive sieve, Whisk, Flexible spatula, Disposable pastry bag, Large star piping tip\nNotes\nThis cornstarch-thickened custard works well as the filling in traditional banana pudding, or it can be used as a light and creamy filling for cream puffs, doughnuts, and other filled desserts.\nMake-Ahead and Storage\nThe prepared custard can be refrigerated up to one week, allowing the finished crémeux to be assembled in about 10 minutes.\nThis Recipe Appears In\nTurn Speckled Bananas Into Spectacular Banana Pudding\nCustards, Mousses & Puddings\nBanana\nEaster Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/light-and-silky-banana-crmeux-recipe.webp?"
}