{
  "url": "https://www.seriouseats.com/liver-stuffing-recipe",
  "image_url": "https://www.seriouseats.com/thmb/wuZAewE2wmcbLQJgYLVYlcYuotI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__11__20121116-nasty-bits-liver-stuffing-baked-5b743503f7d74e56a88ade4ec2633270.jpg",
  "tags": [
    "Sides",
    "Thanksgiving Stuffings",
    "Chicken"
  ],
  "title": "Liver Stuffing Recipe",
  "full_text": "Liver Stuffing Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n105 mins\nActive\n45 mins\nCooling Time\n5 mins\nTotal\n2 hrs 5 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(about\n1\nmedium-sized loaf\n) high quality\nsandwich bread\nor\nsoft Italian\nor\nFrench bread\n, cut into 3/4-inch dice, about\n8\ncups\n1\nstick\nbutter\n2\nmedium-sized\nonions\n, diced (about\n1 1/2\ncups\n)\n3\nribs\ncelery\n, diced (about\n1\ncup\n)\n10\nounces\nchicken livers\n(about\n5 to 6\npieces\n)\n1\nquart\nlow-sodium store-bought or homemade chicken\nor\nturkey stock\n2\nwhole\neggs\n1\nteaspoon\ndried thyme\n1\nteaspoon\ndried rosemary\nKosher salt\nand freshly\nground black pepper\n1/4\ncup\nchopped\nfresh parsley leaves\nDirections\nAdjust oven racks to lower-middle and upper-middle position. Preheat oven to 300°F (150°C). Spread bread evenly over 2 rimmed baking sheets. Bake until bread cubes are completely dried, 30 to 40 minutes, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool. Increase oven heat to 375°F (190°C).\nMelt 4 tablespoons butter in a large skillet or sauté pan over medium-high heat. Add diced onions and celery and sauté over medium heat until softened but not browned, about 5 minutes. Remove and set aside.\nPat livers dry with a paper towel and cut into 2-inch segments. Melt 2 tablespoons butter in the pan over high heat. Add livers and cook until well browned on one side, about 2 minutes. Flip and continue cooking until centers are medium-rare, about 1 minute longer. Remove livers and add 1 cup of stock to pan. Remove from heat.\nIn a blender, food processor, or with an immersion blender, purée livers with the deglazing liquid until mixture is mostly smooth with a few small chunks of liver remaining. Set aside.\nSerious Eats / Robyn Lee\nWhisk remaining stock, eggs, and dried herbs in large bowl until homogeneous. Whisk in liver mixture. Add 1/2 teaspoon salt and 1/2 teaspoon pepper. Fold in bread cubes, onions, and celery.\nUse part of stuffing to stuff bird if desired. To cook remaining stuffing, transfer to a buttered 9-inch square baking dish, cover tightly with aluminum foil, and bake until an instant-read thermometer reads 150°F (66°C) when inserted into center of dish, about 45 minutes. Remove foil and continue baking until golden brown and crisp on top, about 10 minutes longer. Remove from oven, let cool for 5 minutes, sprinkle with parsley, and serve.\nSerious Eats / Robyn Lee\nSpecial Equipment\nOne 9-inch square baking dish,\ninstant-read thermometer\nNotes\nThis recipe can be doubled easily. To double, bake the stuffing in a 9- by 13-inch baking dish.\nRead More\nClassic Sage and Sausage Stuffing (Dressing) Recipe\nCornbread Dressing With Sausage and Sage Recipe\nChicken Liver Pâté With Bourbon and Cranberry Gelée Recipe\nHow to Make Chopped Liver: The Jewish Foie Gras\nSides\nThanksgiving Stuffings\nChicken"
}