{
  "url": "https://www.seriouseats.com/loaded-baked-sweet-potatoes-recipe-8781199",
  "image_url": "https://www.seriouseats.com/thmb/b2lDm4n-xtwqQgz8am4_6624fwI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250127-BakedSweetPotatoes-AmandaSuarez-09-9efeb456c7974c29a390a1af3e4a4bcd.jpg",
  "tags": [
    "Sweet Potatoes",
    "The Latest",
    "Fall",
    "Vegetarian Mains",
    "Winter"
  ],
  "title": "Loaded Baked Sweet Potatoes",
  "full_text": "Loaded Baked Sweet Potatoes\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nTotal\n85 mins\nServes\n2\nto 4\nMakes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\n4\nmedium\nsweet potatoes\n(about\n12\nounces\n;\n340\ng\neach), washed, scrubbed, and dried\nCanola, vegetable, or extra-virgin olive\noil\n, for rubbing\n4\ntablespoons\nunsalted butter\n(\n2\nounces\n;\n56\ng\n), diced\nKosher\nsalt and freshly ground black pepper\nToppings of your choice, such as\ngrated cheddar cheese\n, crispy diced bacon bits, minced chives, sour cream, and store-bought\nhomemade chili\nDirections\nAdjust oven rack to middle position and preheat to 375ºF (190ºC). Using a fork or paring knife, puncture sweet potatoes in several spots. Rub each sweet potato all over with a light coating of oil. Arrange on a wire rack set on a rimmed baking sheet and bake until a fork can easily be inserted into the center of each sweet potato and skin is crisp and lightly browned, about 1 hour 15 minutes.\nSerious Eats / Amanda Suarez\nLet sweet potatoes rest 5 minutes. Slice each open lengthwise almost all the way through, open like a book, and scoop flesh into a mixing bowl. Add butter, season with salt and pepper, and using a potato masher, mash until butter is incorporated but potatoes are still slightly chunky.\nSerious Eats / Amanda Suarez\nScoop mashed sweet potatoes back into skins. (You can refill each skin, making 4 smaller potatoes, or use all the mashed sweet potatoes to refill only half the skins, making 2 overstuffed sweet potatoes.) Using your hands, reshape each stuffed sweet potato back into a classic baked potato shape.\nTop with toppings of your choice. To melt cheese, add it first, then return sweet potatoes to oven until cheese is melted, about 1 minute. If topping with chili, place about 1/2 cup chili onto potato, top with grated cheddar, then return stuffed sweet potatoes to oven until cheese is melted, about 1 minute. Serve right away.\nSerious Eats / Amanda Suarez\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWire rack, rimmed baking sheet, potato masher\nNotes\nIf you’re baking four potatoes, you can refill each skin to make four smaller sweet potatoes, or fill two of the skins for two big, overstuffed sweet potatoes.\nThis recipe can be doubled.\nMake-Ahead and Storage\nOnce cooled, baked sweet potatoes can be refrigerated in an airtight container for up to 3 days. Reheat in a 350ºF (175ºC) oven, air fryer, or microwave until warmed through.\nSweet Potatoes\nThe Latest\nFall\nVegetarian Mains\nWinter"
}