{
  "url": "https://www.seriouseats.com/lobster-thermidor-recipe-8790007",
  "image_url": "https://www.seriouseats.com/thmb/WoGZrLtBwKNxCy6h62fM9ht-Lus=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250212-SEA-LobsterThermidor-AmandaSuarez-hero-1d4d6f1652e649b1a883fffb54dd2c2e.jpg",
  "tags": [
    "Lobster",
    "The Latest",
    "Christmas Dinners",
    "Valentine's Day",
    "New Years"
  ],
  "title": "Lobster Thermidor",
  "full_text": "Lobster Thermidor\nClose\nJump to recipe\nPrep\n30 mins\nCook\n90 mins\nTotal\n2 hrs\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nTwo\n1 1/2–pound\n(\n680\ng\n)\nlobsters\n, plus\none\n1-pound\n(\n454\ng\n)\nlobster\n(see notes)\nFor the Lobster Stock:\n2\ntablespoons\n(\n30\nml\n) vegetable or other neutral\noil\n2\nlarge\nshallots\n(about\n8\nounces\n;\n225\ng\ntotal), thinly sliced\n4\nmedium cloves\ngarlic\n, smashed\n1\ncelery\nrib\n(\n2\nounces\n;\n60\ng\n), thinly sliced\nReserved lobster shells\n, from above\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n1/4\ncup\n(\n60\ng\n)\nbrandy\nor\ndry sherry\n4\ncups\n(\n1\nL\n)\nwater\n2\nsprigs\ntarragon\nFor the Lobster Thermidor:\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n1\nlarge\nshallot\n(\n4\nounces\n;\n113\ng\n), finely minced\n2\ntablespoons\n(\n16\ng\n)\nall-purpose flour\n1/4\nteaspoon\ncayenne pepper\n1\ncup\n(\n237\ng\n)\nLobster Stock\n, from above\n1/2\ncup\n(\n120\ng\n)\nheavy cream\n1\ntablespoon\n(\n15\ng\n)\nDijon mustard\n2\nounces\n(\n60\ng\n) grated or finely diced\nGruyère cheese\n, plus more grated Gruyère for sprinkling\n1\ntablespoon\nminced\nfresh tarragon\nleaves\nKosher salt\nand freshly ground black or white pepper\nGrated Parmigiano-Reggiano\n, for sprinkling\nLemon wedges\n, for serving\nDirections\nOn a work surface, kill each lobster by pressing the tip of a heavy chef's knife in the crack just behind the eyes in the center of the carapace, pressing down to split the head in half.\nSerious Eats / Amanda Suarez\nPrepare an ice bath in a large mixing bowl. Place a steamer insert in the bottom of a large lidded stock pot and add 1-inch of water. Bring to a boil over high heat, then steam lobsters, covered, until just cooked through, about 9 minutes. (This slightly shorter cooking time may not cook all the tomalley or roe inside the lobster, if the lobster has roe, but will produce more tender meat for this recipe.) Immediately transfer lobsters to ice bath and let cool, about 4 minutes.\nSerious Eats / Amanda Suarez\nAs soon as lobster is cool, split the lobsters lengthwise through the middle. Using a spoon, gently remove any tomalley and roe, if present, and save for another use or discard. Remove stomach (a small sac located in the carapace behind the lobster's eyes) and discard.\nSerious Eats / Amanda Suarez\nBeing careful not to break apart the halved lobster shells, remove the tail meat and transfer to a medium bowl. Carefully twist lobster claws and knuckles from bodies, again taking care not to break apart the body shells. Using kitchen shears, lobster crackers, and/or the back of a heavy cleaver, crack claws and knuckles and remove meat, transferring it to the bowl with the lobster tails; transfer claw and knuckle shells to a bowl and set aside. On a work surface, cut lobster meat into large chunks, then return to bowl. Cover lobster meat and transfer to refrigerator.\nSerious Eats / Amanda Suarez\nArrange the 4 lobster shell halves from the 2 larger lobsters on a rimmed baking sheet; cover and refrigerate. Cut up the remaining shells and body of the smaller lobster and transfer to the bowl with the claw shells (these shells will be used in the stock).\nSerious Eats / Amanda Suarez\nFor the Lobster Stock:\nIn a large saucepan or 4- or 5-quart Dutch oven, heat oil over medium-high heat until shimmering. Add shallots, garlic, and celery and cook, stirring often, until softened, about 3 minutes.\nSerious Eats / Amanda Suarez\nAdd reserved lobster shells and cook, stirring, until the ingredients begin to brown on the bottom the pot, about 4 minutes. Stir in tomato paste and cook for 1 minute. Add brandy and cook, stirring and scraping bottom of pot, until some of the raw alcohol smell is gone, about 2 minutes. Add water and tarragon sprigs and cook, stirring occasionally, until stock is flavorful and liquid is reduced by about half, about 20 minutes. (Note: Your liquid will likely not cover all the shells; for this quick stock, that is OK, just give it a stir from time to time.) Strain, discarding solids and reserving lobster stock.\nSerious Eats / Amanda Suarez\nFor the Lobster Thermidor:\nIn a 2- or 3-quart sauté pan or saucier, melt butter over medium-heat heat. Add shallot and cook, stirring, until softened, about 3 minutes. Stir in flour and cayenne and cook until raw flour smell has cooked off, about 1 minute.\nSerious Eats / Amanda Suarez\nWhisk in 1 cup reserved lobster stock, adding it in small additions and whisking out lumps as you go to ensure a smooth sauce. Then whisk in cream and mustard. Add Gruyère cheese and cook, stirring or whisking constantly, until fully melted. Remove from heat. Stir in tarragon and season with salt and pepper to taste. Scrape thermidor sauce into a heatproof container, press plastic directly against its surface to prevent a skin from forming, and let cool in the refrigerator.\nSerious Eats / Amanda Suarez\nWhen ready to cook, position oven rack about 6 inches from broiler element and heat broiler. Remove lobster meat from refrigerator and drain any accumulated liquid. Stir cooled thermidor sauce into lobster meat.\nSerious Eats / Amanda Suarez\nMound dressed lobster meat into reserved body shells along their entire length from tail to head. Sprinkle with additional grated Gruyère cheese and Parmigiano-Reggiano. Broil until heated through and browned on top; if surface browns before lobster meat is warmed through, switch off the broiler, turn the oven to 350°F (175°C) and continue to cook until warmed through.\nSerious Eats / Amanda Suarez\nCarefully transfer stuffed lobster shells to plates and serve with lemon wedges.\nSerious Eats / Amanda Suarez\nNotes\nThe smaller lobster is to provide a little additional meat to make this an extra-special meal, which is what it should be. Plus, that smaller lobster yields shells for making the stock. If you want, you can try to get a cull, which is a lobster that has lost one of its claws; they're even cheaper and will still work just fine for this purpose.\nSpecial Equipment\nLarge soup or stock pot (for steaming lobsters); Dutch oven or soup pot (for stock); saucepan or saucier (for thermidor sauce)\nMake-Ahead and Storage\nAll components can be made up to 1 day in advance and refrigerated separately in airtight containers: the cooked lobsters and meat; the stock; the thermidor sauce. If desired, the recipe can be prepared all the way through stuffing the shells with the dressed meat, then refrigerated until ready to cook/broil. Top with grated cheeses just before broiling.\nLobster\nThe Latest\nChristmas Dinners\nValentine's Day\nNew Years"
}