{
  "url": "https://www.seriouseats.com/lomo-al-trapo-colombian-cloth-wrapped-salt-crusted-beef-tenderloin-recipe",
  "image_url": "https://www.seriouseats.com/thmb/C9nXimhEOY9AkL1XnUqKZA_n7TY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__08__20150821-lomo-al-trapo-01-7ef0e56cfb144c4482589a98917c2049.jpg",
  "tags": [
    "Beef Mains",
    "Colombian",
    "Grilled Beef",
    "Tenderloin Steak",
    "Father's Day"
  ],
  "title": "Lomo al Trapo (Colombian-Style Cloth-Wrapped Grilled Beef Tenderloin)",
  "full_text": "Lomo al Trapo (Colombian-Style Cloth-Wrapped Grilled Beef Tenderloin)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n20 mins\nTotal\n75 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2 to 2\npounds\nkosher salt\n6 to 8\nsprigs\noregano\n,\nrosemary\n, or\nthyme\n1\ncenter-cut\ntrimmed\nbeef tenderloin\n(\n2 to 2 1/2\npounds\n)\n1\nrecipe\nají\nor\nchimichurri\n, if desired\nDirections\nDip a clean dish towel in a bowl of cold water or run it briefly under a cold tap, then wring it thoroughly so it is just slightly damp. Lay it on your work surface, with the short edge parallel to the counter edge. Spread a layer of salt at least 1/2 inch thick on the towel, starting about 1 inch up from the leading edge and progressing back about 12 inches, leaving a 2-inch space on either side. Scatter with herbs and place beef directly on the salt on the edge closest to you.\nSerious Eats / J. Kenji López-Alt\nCarefully roll the beef up until it is completely surrounded in salt. Tuck the leading side of the towel into the roll, fold in the sides to form a neat package, then continue rolling until the beef is completely wrapped in the towel.\nSerious Eats / J. Kenji López-Alt\nUsing butcher's twine, secure the package at 1- to 2-inch intervals, tying as tightly as possible.\nSerious Eats / J. Kenji López-Alt\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate.\nSerious Eats / J. Kenji López-Alt\nPlace beef directly on coals. Partially cover grill and cook for 10 minutes. Flip beef and continue cooking until an instant-read thermometer inserted into the deepest part of the package registers 95°F (35°C) for rare or 105°F (41°C) for medium-rare. (I do not advise cooking for longer than that if you want juicy meat.) Transfer the whole package to a metal tray or pan and let rest until the core reaches 120°F (49°C) for rare or 130°F (54°C) for medium-rare, about 10 to 20 minutes.\nSerious Eats / J. Kenji López-Alt\nWhen ready to serve, carefully crack open the crust with the back of a knife, reserve some of the smoky salt for serving, and discard the burnt cloth and remaining salt. Use the back of your knife or a pastry brush to remove any excess salt. Slice tenderloin and serve with\nají\nor\nchimichurri\nas desired.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nClean cotton dish towel, butcher's twine,\ncharcoal grill\nor fireplace\nNotes\nA quadruple layer of cheesecloth can be used in place of the cotton dish towel in this recipe.\nRead More\nHow to Trim a Whole Beef Tenderloin for Roasting\nSlow-Roasted Beef Tenderloin\nHow to Grill-Roast a Whole Beef Tenderloin\nSalt-Baked Whole Fish With Fresh Herbs\nColombian-Style Salt-Crusted New Potatoes\nBeef Mains\nColombian\nGrilled Beef\nTenderloin Steak\nFather's Day"
}