{
  "url": "https://www.seriouseats.com/losh-kebabs-armenian-grilled-meat-patties-7091816",
  "image_url": "https://www.seriouseats.com/thmb/Kp45s7hSDVNgx151HYReWZSRGJo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230106-LOSH-KEBAB-ANDREW-JANJIGIAN-24-Edit-31cf4eab78174b96b71fb0aaeb2c8a7c.JPG",
  "tags": [
    "Armenian",
    "The Latest",
    "Ground Beef",
    "Grilling",
    "Ground Lamb"
  ],
  "title": "Losh Kebabs (Armenian Grilled Meat Patties)",
  "full_text": "Losh Kebabs (Armenian Grilled Meat Patties)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nDraining and Chilling Time\n75 mins\nTotal\n105 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nmedium\nyellow onion\n(about\n8\nounces\n;\n225\ng\n), cut into 2-inch pieces\n1\nlarge\nred bell pepper\n(about\n8 3/4\nounces\n;\n250\ng\n), stemmed, seeded, and cut into 1-inch pieces\n1/3\ncup\n(\n12\ng\n) minced fresh flat-leaf\nparsley\n1\ntablespoon\n(\n15\ng\n) mild biber salçasi\npepper\npaste (see note)\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n1/2\nteaspoon\nground allspice\n1/2\nteaspoon\nfreshly\nground black pepper\n1 1/2\nteaspoons\nunflavored\ngelatin\n2\npounds\n(\n900\ng\n)\nground beef\nor lamb, at least 15% fat, or a 50/50 combination (see note)\n1/3\ncup\n(\n20\ng\n)\npanko breadcrumbs\nPita bread\n, for serving (see note)\nDirections\nIn the bowl of the food processor fitted with a metal blade, combine onion and bell pepper and process until a smooth paste forms, 30 to 45 seconds, scraping down sides of bowl as needed. Transfer mixture to a fine mesh strainer set over a medium bowl and allow to drain, about 15 minutes, pressing on solids with a rubber spatula to remove as much liquid as possible. Transfer onion-red pepper mixture to a large bowl, discarding any liquid.\nSerious Eats / Andrew Janjigian\nAdd parsley, red pepper paste, tomato paste, salt, allspice, pepper, and gelatin to bowl and stir until uniform. Add ground meat and breadcrumbs and knead with your hands until mixture is thoroughly combined and feels slightly sticky, about 2 minutes.\nSerious Eats / Andrew Janjigian\nDivide mixture into 8 equal portions (about 5 ounces; 140g each) and place on a parchment- or foil-lined rimmed baking sheet. Gently shape each one into a patty about 3 1/2 inches wide and approximately 3/4 inch thick. Using three or four fingers, create a dimple by pushing down in the center of each patty. The dimple should be about 1/4 inch deep and 2 inches wide. Cover baking sheet with plastic wrap and refrigerate for at least 1 hour or up to 24 hours.\nSerious Eats / Andrew Janjigian\nLight one chimney full of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively set\nburners on a gas grill to the highest heat setting, cover, and preheat for 15 minutes.\nClean and oil\ncooking grate.\nSerious Eats / Andrew Janjigian\nLine a shallow serving bowl with one or two pita breads and set aside. Place patties on grill (directly over coals if using charcoal). Cook (covered if using gas) until patties are browned on the bottom and release easily from the grill, 4 to 7 minutes. Flip and continue to cook until browned on second side and meat registers 160˚F (71˚C), about 6 minutes longer. (If flare-ups occur, move patties around grill to avoid scorching.) Transfer patties to serving bowl, tent loosely with foil, and let rest for 2 minutes. Serve, passing remaining pita on the side.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nGrill (charcoal or gas)\nNotes\nBiber salçasi can be found in Middle Eastern grocery stores or online. If unavailable, increase tomato paste to 2 tablespoons and add 1/2 teaspoon Aleppo pepper or 1 teaspoon sweet paprika.\nFreshly-ground beef or lamb from your butcher, with a loose, coarse texture, works best here.\nThe pita used to line the serving platter soaks up juices from the cooked meat and is meant to serve as a tasty treat for the grill cook or anyone else, wrapped around pieces of meat.\nMake-Ahead and Storage\nLosh kebab is best enjoyed immediately. Leftovers can be refrigerated in an airtight container and reheated gently, or sliced and served cold in sandwiches.\nArmenian\nThe Latest\nGround Beef\nGrilling\nGround Lamb"
}