{
  "url": "https://www.seriouseats.com/lumpiang-shanghai-filipino-egg-rolls-5196324",
  "image_url": "https://www.seriouseats.com/thmb/2qb6HSdvO82S2SIM-IdDIB7X9gg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210805-Lumpia-Rezel-19-291fd6c696e44df7837d4264e35a8ae9.jpg",
  "tags": [
    "East Asian",
    "Filipino",
    "Snacks & Appetizers",
    "Frying",
    "The Latest"
  ],
  "title": "Lumpiang Shanghai (Filipino Egg Rolls)",
  "full_text": "Lumpiang Shanghai (Filipino Egg Rolls)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n20 mins\nTotal\n80 mins\nMakes\n25 four-inch lumpia rolls\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dipping Sauce:\n6\ntablespoons\nlight brown sugar\n(\n3\nounces\n;\n85\ng\n)\n3\ntablespoons\n(\n45\nml\n)\ncane vinegar\n(see note)\n1\ntablespoon\n(\n15\ng\n)\nbanana ketchup\n(see note)\n1\nteaspoon\n(\n4\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n2\nbird’s eye chiles\n, stemmed, seeded, and minced\nFor the Lumpia Rolls:\n1 1/4\npounds\n(\n565\ng\n)\nground pork\n(at least 30% fat)\n2\nsmall\ncarrots\n(about\n4\nounces\n;\n115\ng\n), peeled and finely diced\n1/2\nmedium\nred onion\n(about\n4\nounces\n;\n115\ng\n), finely diced\n7\nmedium\ngarlic cloves\n, minced\n3\ntablespoons\n(\n45\nml\n)\nsoy sauce\n, preferably Filipino brands such as\nSilver Swan\nor\nDatu Puti\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1\ntablespoon\n(\n7\ng\n)\nfreshly ground black pepper\n25\n(5-inch-square)\nspring roll (lumpia) wrappers\n(see note)\n1\nlarge\negg\n, beaten\n2\ncups\n(\n475\nml\n)\ncanola oil\nor other\nneutral oil\nfor frying\nDirections\nFor the Dipping Sauce:\nIn a small bowl, stir together sugar, vinegar, ketchup, salt, and chiles until well combined. Taste and adjust to your preference by adding more sugar, vinegar, ketchup, salt, and/or chiles incrementally (remember, we’re going for a balance of sweet and sour). Set aside.\nRezel Kealoha\nFor the Lumpia Rolls:\nIn a large bowl, combine pork, carrots, onion, garlic, soy sauce, fish sauce, and pepper. Using clean hands or a spoon, mix until well combined.\nRezel Kealoha\nOn a work surface, position one spring roll wrapper so it resembles a diamond with a point facing you. Measure 1 1/2 tablespoons (28g) of filling, then, using your hands, shape into a 4-inch long cylinder, and place horizontally in the center of the wrapper.\nRezel Kealoha\nStarting with the point closest to you, fold the wrapper over the filling, tucking the point underneath the filling. Using your finger, moisten the left and right points of the wrapper with egg wash. Fold the left point towards the middle, fold the right point towards the middle, then roll tightly away from you, leaving about 1 inch of the top point exposed. Moisten the top point with egg wash, then finish rolling to seal. Repeat with remaining wrappers and filling.\nRezel Kealoha\nHeat oven to 200°F (95°C). Set a wire rack in a rimmed baking sheet and line with a double layer of paper towels. In a wok, heat oil over high heat to 375°F (190°C). Working in batches of 5 lumpia at a time, fry lumpia, turning occasionally with tongs, until golden brown all over, about 3 minutes; adjust heat as needed to return to and then maintain a frying temperature of 375°F (190°C). Transfer fried lumpia to prepared wire rack, then transfer to oven to keep warm. Repeat with remaining lumpia.\nRezel Kealoha\nSlice lumpia in half crosswise on a bias, transfer to a plate, and serve with dipping sauce alongside.\nSpecial equipment\nWok\nNotes\nCane vinegar is the most common Filipino vinegar. It’s usually sold as white distilled vinegar (a spiced version, infused with onion, garlic, and chiles, is also available). You can find it in most Asian markets and online under the brands Datu Puti, Mama Sita, or Marca Pina.\nYou can find banana ketchup at Filipino or Asian specialty markets and online. In a pinch, tomato ketchup is an acceptable substitute.\nSpring roll wrappers can be found at most Asian supermarkets. They are made with wheat flour and are often labeled as “spring roll pastry.” Chinese or Vietnamese wrappers will work as long as they are meant for frying. Do not use dried rice paper wrappers. If you cannot find square wrappers, round wrappers work well, too. To defrost the spring roll wrappers, transfer to the refrigerator the night before, or let them sit at room temperature for 30 minutes prior to using.\nMake-ahead and Storage\nThe dipping sauce can be prepared ahead of time and refrigerated in an airtight container for up to 5 days.\nUncooked lumpia can be frozen by arranging them side-by-side on a baking sheet, then sliding strips of parchment paper between adjacent rolls to prevent sticking. Freeze until firm, then transfer to a zipper-lock bag and store in the freezer for up to 3 months. Fry frozen lumpia from frozen (frying time may double to about 5 minutes).\nEast Asian\nFilipino\nSnacks & Appetizers\nFrying\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lumpiang-shanghai-filipino-egg-rolls.webp?"
}