{
  "url": "https://www.seriouseats.com/lyonnaise-potatoes-recipe-5220155",
  "image_url": "https://www.seriouseats.com/thmb/Itwc0HxJ9zH4zXxnTUfWUO4PZIM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220303-lyonnaise-potatoes-vicky-wasik-10-6c0206084fe64a28825657b5db0f4dd7.jpg",
  "tags": [
    "Potatoes",
    "French",
    "The Latest"
  ],
  "title": "Lyonnaise Potatoes",
  "full_text": "Lyonnaise Potatoes\nClose\nJump to recipe\nCook\n45 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n680\ng\n)\nYukon Gold potatoes\n(about\n4\nmedium\npotatoes\n), peeled and cut into 1/4-inch-thick rounds\n2\ntablespoons\n(\n18\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for\ntable salt\nuse half as much by volume or the same weight\n2\ntablespoons\n(\n30\nml\n)\ndistilled white vinegar\n5\nt\nablespoons\n(\n75\ng\n) melted\nhomemade\nor store-bought\nclarified butter\n, divided\n1\nlarge\nsweet onion\n(\n8\nounces\n;\n225\ng\n), thinly sliced\nFreshly ground black pepper\nFinely chopped\nflat-leaf parsley leaves\nand\ntender stems\n, for garnish\nDirections\nIn a large pot, cover potatoes with 1 inch cold water (about 2 quarts; 1.9L). Add salt and vinegar. Bring to a boil over high heat, then reduce heat to maintain a simmer. Cook until potatoes are barely tender, offering some resistance when poked with a paring knife, about 4 minutes. Drain potatoes; set aside.\nVicky Wasik\nMeanwhile, in a 12-inch cast iron skillet, nonstick skillet, or stainless-steel sauté pan or skillet, heat 1 tablespoon (15g) clarified butter over medium-high heat until shimmering. Add onion, season lightly with salt, and cook, stirring occasionally, until lightly browned and softened, about 10 minutes. Add 1 tablespoon (15ml) water and scrape up browned bits on bottom of skillet. Transfer onions to a medium heatproof bowl and set aside.\nVicky Wasik\nAdd 2 tablespoons (30g) clarified butter to now-empty skillet and heat over medium-high heat until shimmering. Add half of the drained potatoes in a single even layer and cook, without moving, until golden brown on bottom, about 3 minutes, adjusting heat as needed if at risk of scorching. Using an offset or thin metal spatula, flip potatoes and continue to cook until completely tender, offering little to no resistance when poked with a paring knife, and golden brown on second side, about 3 minutes. Transfer potatoes to bowl with onions and set aside.\nVicky Wasik\nAdd remaining 2 tablespoons (30g) clarified butter to now-empty skillet and repeat with remaining potatoes.\nReturn reserved potatoes and onions to skillet, toss to combine, and cook until heated through, about 1 minute. Season with salt and pepper to taste.\nVicky Wasik\nTransfer pommes lyonnaise to a serving bowl, sprinkle with parsley, and serve immediately.\nVicky Wasik\nSpecial Equipment\n12-inch stainless-steel skillet\nor\nstraight-sided sauté pan\n,\nnonstick skillet\n, or\ncast iron skillet\nMake-Ahead and Storage\nPommes lyonnaise can be refrigerated in an airtight container for up to 3 days. Reheat gently in a microwave before serving.\nPotatoes\nFrench\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/lyonnaise-potatoes.webp?"
}