{
  "url": "https://www.seriouseats.com/macau-pork-chop-sandwich-recipe-8605269",
  "image_url": "https://www.seriouseats.com/thmb/l8X8ux9j6ZpEewS6XCINxDy87IM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240308-SEA-PorkChopSandwich-AmandaSuarez-hero-de5c9846ceff491881d94118901e88ac.jpg",
  "tags": [
    "Pork",
    "The Latest",
    "Sandwiches",
    "East Asian",
    "Pork Chop"
  ],
  "title": "Macau Pork Chop Sandwich",
  "full_text": "Macau Pork Chop Sandwich\nClose\nJump to recipe\nPrep\n5 hrs\nCook\n25 mins\nTotal\n5 hrs 25 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume or same weight\n1/2\nteaspoon\nMSG\n, such as Aji-no-moto\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nfive spice powder\n(see notes\n3\ntablespoons\n(\n45\ng\n)\ndark brown sugar\n3\nleaf\nbay leaves\n1 1/2\nteaspoons\ncumin seeds\n1 1/2\nteaspoons\ncoriander seeds\n1/4\nteaspoon\nwhite\npeppercorns\nFour\n1/2-inch-thick\nbone-in pork chops\n(about\n6 ounces\n;\n170 g\neach), see notes\n4\npineapple buns\nor\nPortuguese rolls\n, halved horizontally (see notes)\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\nVegetable oil\n, for frying\nDirections\nIn a small bowl, whisk together salt, MSG, baking soda, five spice powder, and dark brown sugar until well combined. Set aside.\nSerious Eats / Amanda Suarez\nIn a small skillet, toast bay leaves, cumin seeds, coriander seeds, and white peppercorns over medium heat until fragrant, about 1 minute. Transfer to a spice grinder or mortar and pestle and grind until a rough powder is formed. Add spice blend to salt mixture and whisk to combine. Set aside.\nSerious Eats / Amanda Suarez\nPlace one pork chop on a clean cutting board and, using the ridged side of a meat tenderizer or blunt side of a Chinese cleaver, pound pork chops gently to 1/4-inch thickness. Set aside and repeat with remaining pork chops. Season each of the pork chops generously with the spice mixture, place in a large bowl or on a rimmed baking sheet, and cover tightly with plastic wrap. Let pork chops rest in the refrigerator for at least 4 hours or up to 8 hours.\nSerious Eats / Amanda Suarez\nAdjust oven rack to upper-middle position (about 6-inches from broiler element) and preheat broiler. Brush inside of buns with melted butter and arrange on a baking sheet. Broil on the upper-middle rack, cut side up, until bread is lightly browned, about 3 minutes. Set aside.\nSerious Eats / Amanda Suarez\nSet a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels. Fill a medium or large Dutch oven or wok with 2 inches of vegetable oil and set over medium heat until oil registers 375ºF (190ºC).  Remove pork chops from refrigerator, pat dry with paper towels, and set on a clean baking sheet or plate.\nSerious Eats / Amanda Suarez\nAdd one pork chop to hot oil, dropping it from as close to the oil’s surface as possible to minimize splashing. Fry, using tongs or long cooking chopsticks to flip halfway through, until golden brown on all sides, 4 to 5 minutes. Transfer pork chop to prepared wire rack and repeat with remaining pork chops.\nSerious Eats / Amanda Suarez\nSandwich pork chop between toasted buns and serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nMortar and pestle or spice grinder, meat tenderizer or Chinese cleaver, pastry brush, 9- by 13-inch baking sheet, 4-quart Dutch oven, wire rack, rimmed baking sheet, tongs\nNotes\nIf you can’t find thin-cut pork chops, you can purchase 1-inch thick bone-in pork chops. On a clean work surface, place pork chops between two pieces of plastic wrap, and using a meat mallet or the blunt side of a Chinese cleaver, pound pork chops gently until they are a 1/4-inch thick.\nPineapple buns can be purchased from Chinese bakeries. If you can’t find pineapple buns, you can substitute with Portuguese rolls or  6-inch hoagie rolls.\nAs Serious Eats contributor Max Falkowitz noted in his\nguide to five spice\n, the powder refers not to the number of spices in it—but the flavor profile. Typically, the blend includes cinnamon, clove, star anise, fennel, and Sichuan peppercorns. As with all spices, I recommend purchasing the blend from single origin spice companies, as the spices tend to be higher quality. I like the blend from Burlap & Barrel, but you can use your preferred brand.\nTo toast the rolls in a toaster oven, preheat oven to 350ºF (175ºC). Place rolls, cut side up, on the rack and toast until lightly browned, 5 to 7 minutes.\nMake-Ahead and Storage\nThe pork chop sandwiches are best eaten immediately.\nPork\nThe Latest\nSandwiches\nEast Asian\nPork Chop",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/macau-pork-chop-sandwich.webp?"
}