{
  "url": "https://www.seriouseats.com/machaca-mexican-dried-beef",
  "image_url": "https://www.seriouseats.com/thmb/kX-ZdfKO02Rf8nAe29qnhox2EjE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201029-machaca-jillian-atkinson-5-341aee7afef24fe6a355fbcefd812fcd.jpg",
  "tags": [
    "Beef",
    "Mexican",
    "Roasted Beef"
  ],
  "title": "Homemade Machaca (Northern Mexican Dried Beef) Recipe",
  "full_text": "Homemade Machaca (Northern Mexican Dried Beef) Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n3 hrs\nActive\n2 hrs\nTotal\n3 hrs 30 mins\nServes\n6\nto 8 servings\nMakes\n3/4 pound dried beef\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n)\ntrimmed flat-cut brisket\n, partially frozen for about 1 hour before slicing (see note)\n10\nmedium\ncloves garlic\n, minced (\n1\nounce\n;\n30\ng\n)\n2\nteaspoons\nfreshly\nground black pepper\n1 1/2\ntablespoons\nkosher\nor\nfine sea salt\n(\n22\ng\n)\nDirections\nSet oven racks to upper and lower positions and preheat oven to “warm;” use an oven thermometer to confirm temperature is between 140 and 160°F (60 to 70°C). If there is no \"warm\" setting, set oven to its lowest temperature and regulate temperature by keeping door ajar and/or opening and closing it as needed while monitoring an oven thermometer. Alternatively, you can use a dehydrator; set the temperature of a dehydrator to 145°F (63°C).\nUsing a sharp knife, slice brisket against the grain into roughly 3- by 1-inch pieces that are between 1/8 and 1/4 inch thick. In a large bowl, toss beef strips with garlic, black pepper, and salt until evenly coated.\nLine two rimmed baking sheets with wire racks. Arrange beef on wire racks in a single layer, making sure none of the pieces are touching. Place both baking sheets in the oven and let dry for 30 minutes. Flip beef slices and dry for 30 minutes longer. Rotate baking sheets top to bottom and front to back and continue to dry in oven, flipping beef once or twice more during drying, until beef has darkened and dried to a jerky-like texture, about 2 hours longer. Once dry, let machaca cool completely.\nSerious Eats / Jillian Atkinson\nPrepare a strong work surface that won't move or slide around as you pound the machaca. Working with 3 to 4 slices of machaca at a time, cut the pieces into 1/4-inch strips. Arrange these strips together in a flat, tightly grouped layer on the work surface; then, using the spiked side of a meat pounder/tenderizer, smash machaca until the beef breaks apart into shreds and smaller pieces (about 150 short, hard strikes, though this will depend on how hard you hit as well as the design of the tenderizer you're using); continue to re-gather the pieces of beef together as you work to prevent them from flying away. Use your hands to tear apart any remaining pieces that are bigger than a pebble. You should have a mix of light fluff, crumbs, and small pebble-size pieces.\nSerious Eats / Jillian Atkinson\nThe shredded machaca can be used right away in a recipe that calls for it, refrigerated in an airtight container for up to 1 week, or frozen in zipper-lock bags with the air pushed out for up to 1 month.\nSpecial Equipment\nTwo\nrimmed baking sheets\n, two\ncooling racks\n,\nmeat pounder\nwith tenderizing teeth\nNotes\nA whole brisket has two distinct parts: the flat and the point. The flat is the more common cut, and it's much leaner than the point, though it will sometimes have a fat cap on it. For this recipe, you want the lean beef of the flat (trimmed of its fat cap), so make sure not to buy the point by accident.\nMake-Ahead and Storage\nThe shredded machaca can be refrigerated in an airtight container for up to 1 week or frozen in zipper-lock bags with the air pushed out for up to 1 month.\nRead More\nBeef Jerky\nBeef Jerky Empanada\nCowboy Beans From 'The Homesick Texan's Family Table'\nBeef\nMexican\nRoasted Beef"
}