{
  "url": "https://www.seriouseats.com/madeleines-6951118",
  "image_url": "https://www.seriouseats.com/thmb/lSfW2BLVYOsyBCfX7Q9xfEFghKk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221221-Madelines-AmandaSuarez-01-bd70df59b0bd4a17b7a4910d071f4507.JPG",
  "tags": [
    "French",
    "The Latest",
    "Cakes"
  ],
  "title": "Madeleines",
  "full_text": "Madeleines\nClose\nJump to recipe\nPrep\n10 mins\nCook\n11 mins\nChilling Time\n4 hrs\nTotal\n4 hrs 21 mins\nMakes\n12 madeleines\nCook Mode\n(Keep screen awake)\nIngredients\n2.6\nounces\nall-purpose flour\n(\n1/2\ncup\nplus\n1 1/2\ntablespoons\n;\n75\ng\n)\n2.6\nounces\ngranulated sugar\n(\n1/4\ncup\nplus\n2\ntablespoons\n;\n75\ng\n)\n1/2\nteaspoon\nbaking powder\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n2\nlarge\neggs\n(\n3.5\nounces\n;\n100\ng\n), well beaten\n1 1/2\nteaspoons\nvanilla extract\n, optional (see note)\n2.6\nounces\nunsalted butter\n(about\n5\ntablespoons\n;\n75\ng\n), melted and slightly cooled, plus extra for greasing\nDirections\nIn a medium bowl, thoroughly whisk together flour, sugar, baking powder, and salt, about 30 seconds. Add eggs and vanilla extract, if using, and whisk until a thick batter forms, about 30 seconds. Add butter and whisk until fully incorporated and batter is smooth and slightly shiny, about 1 minute. Cover bowl with plastic wrap (or transfer to an airtight container) and refrigerate for at least 4 hours and up to 2 days.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and preheat oven to 425°F (220°C). Set a 12-cup nonstick madeleine pan inside a rimmed baking sheet. Using a pastry brush, grease madeleine pan with melted butter. Using a 1-tablespoon cookie scoop or measuring spoon, add 20g (slightly more than 1 tablespoon) of batter into the center of each cup. The batter will spread as it bakes.\nSerious Eats / Amanda Suarez\nBake madeleines for 3 minutes then reduce oven temperature to 400°F (205°C). Continue to bake until madeleines are domed in the center and golden brown around the edges, about 8 minutes.\nSerious Eats / Amanda Suarez\nRemove madeleines from oven and immediately invert the hot pan over a wire rack, gently rapping the pan to release the madeleines. (Letting the madeleines cool even slightly in the pan will make it difficult to remove them from the pan.) Flip madeleines over so that the shell pattern is on the bottom and let cool slightly. Serve warm or at room temperature.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-cup nonstick madeleine pan, 1-tablespoon cookie scoop or measuring spoon, digital scale, wire rack\nNote\nYou can flavor the madeleines with almond extract and/or 1 to 2 teaspoons freshly grated lemon or orange zest.\nMake-Ahead and Storage\nThe batter can be prepared ahead of time and refrigerated for up to 2 days.\nMadeleines are best enjoyed on the same day they’re baked.\nFrench\nThe Latest\nCakes"
}