{
  "url": "https://www.seriouseats.com/maftool-recipe-6831610",
  "image_url": "https://www.seriouseats.com/thmb/JuJhZqICOuWvMJKaD7vXmGvoSk4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221121-Maftool-MaiKakish-Hero-cb412095f0d84cc4bf0d852c8c3aa427.JPG",
  "tags": [
    "Middle Eastern",
    "The Latest",
    "Chicken",
    "Butternut Squash"
  ],
  "title": "Maftool (Palestinian Wheat Pearls in a Vegetable, Chickpea, and Chicken Stew)",
  "full_text": "Maftool (Palestinian Wheat Pearls in a Vegetable, Chickpea, and Chicken Stew)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs\nTotal\n2 hrs 30 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spiced Chicken Stock:\n4\nbone-in, skin-on chicken pieces\n(about\n2 1/4\npounds\n;\n1\nkg\n), either\n4 breasts\n,\n4\nlegs\n, or\na combination\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n1\nmedium\n(\n8-ounce\n;\n226 g\n)\nyellow onion\n, diced\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\nuse half as much by volume or the same weight\n2\nteaspoons\nground caraway\n2\nteaspoons\nground cumin\n1\nteaspoon\nground allspice\n1/2\nteaspoon\nground cinnamon\n1/2\nteaspoon\nfreshly\nground black pepper\n1\nteaspoon\ntomato paste\n(optional)\n1\nbay leaf\nFor the Butternut Squash Broth:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1\nmedium\n(\n8-ounce\n;\n226 g\n)\nyellow onion\n, sliced 1/4 inch thick\n1/2\nmedium\n(\n2 1/2–pound\n;\n1 kg\n)\nbutternut squash\n,\npeeled and diced\ninto roughly 1-inch pieces\n1\nquart\n(\n1\nL\n)\nSpiced Chicken Stock\n, from above\nOne\n15-ounce\n(\n425\ng\n) can\nchickpeas\n, drained and rinsed\nFor the Maftool:\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n1\npound\n(\n453\ng\n)\nmaftool\n(see note)\n2 1/4\ncups\n(\n532\nml\n)\nSpiced Chicken Stock\n, from above\nFor the Chicken:\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1\nteaspoon\n(\n5\nml)\ntomato paste\n1\ntablespoon\n(\n15\ng\n)\nGreek yogurt\nKosher\nor\nsea salt\nand freshly\nground black pepper\nDirections\nFor the Spiced Chicken Stock:\nIn a large pot or stockpot of boiling water, boil chicken for 2 minutes. Transfer chicken to a platter, discard water and wash and dry pot. Add olive oil to pot and heat over medium-high heat until shimmering. Add the onion, salt, caraway, cumin, allspice, cinnamon, black pepper, tomato paste, and bay leaf and stir until the onion starts to soften and the spices become fragrant, about 2 minutes. Add 2 quarts (1.9L) water along with the reserved chicken and bring to a boil, skimming any foam from the surface, then lower heat to maintain a simmer and cook until chicken is fully cooked but not falling apart, about 1 hour. Carefully remove the chicken, making sure to keep the pieces intact, and set skin side up on a rimmed baking sheet. Strain stock, discarding solids.\nSerious Eats / Mai Kakish\nFor the Butternut Squash Broth:\nIn a Dutch oven, heat olive oil over medium-high heat until shimmering. Add sliced onions and cook, stirring often, until softened and golden brown at the edges, about 5 minutes. Stir in butternut squash and cook, stirring frequently, for 2 minutes. Add the 1 quart (1L) spiced chicken stock along with the chickpeas, bring to a simmer, then continue to cook at a simmer until butternut squash is tender, about 20 minutes. Set aside and keep warm.\nSerious Eats / Mai Kakish\nMeanwhile, for the Maftool:\nIn a 3- or 4-quart pot, heat the olive oil and butter over medium heat until butter is melted. Add the maftool and cook, stirring, until it smells lightly toasted but hasn't darkened in color, about 5 minutes. Add the 2 1/4 cups (532ml) spiced chicken stock, cover with a tight-fitting lid, and bring to a simmer. Lower heat to maintain a gentle simmer and cook, covered, until the maftool has absorbed most of the liquid (see package directions for recommended cooking times). Remove from heat, insert a paper towel or clean kitchen towel under the lid, and let stand 15 minutes.\nSerious Eats / Mai Kakish\nFor the Chicken:\nTurn on broiler and set oven rack to the second-highest position. In a small bowl, stir together olive oil, tomato paste, and yogurt until thoroughly combined. Season with salt and pepper. Spread yogurt mixture all over skin side of reserved chicken, then broil until the skin is a golden brown, about 5 minutes (note broiling times can vary depending on strength of broiler; keep a close eye on the chicken as it broils).\nSerious Eats / Mai Kakish\nTo serve, fluff up the maftool with a fork and spoon onto a large serving platter. Ladle some of the butternut squash over it with enough broth to moisten without the maftool becoming soupy. Top with the chicken pieces and serve with bowls of the butternut squash broth on the side.\nSerious Eats / Mai Kakish\nSpecial Equipment\nDutch oven, 3- or 4-quart pot\nNotes\nMaftool is becoming more widely available in supermarkets and online, but if you are unable to find it, you can substitute it with fregola sarda, giant couscous, or even very coarse-grain bulgur, following package instructions for cooking times in each case.\nMake-Ahead and Storage\nThe butternut squash broth and the maftool can be refrigerated separately for up to 3 days. The chicken is best enjoyed the day it is prepared, but leftover chicken can be shredded and added to the broth before refrigerating.\nTo reheat, add a ladleful of broth to the pot of maftool and warm on the stove  over low heat. Alternatively, use a microwave.\nBring the remaining broth back to a boil before serving; the leftover shredded chicken can be reheated in the broth.\nMiddle Eastern\nThe Latest\nChicken\nButternut Squash"
}