{
  "url": "https://www.seriouseats.com/maja-blanca-filipino-coconut-pudding-with-corn-recipe-8757944",
  "image_url": "https://www.seriouseats.com/thmb/_mFdsIO-qJoTfACnI9CVzSMjtYs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220314-maja-blanca-rezel-kealoha-27-cropped-6f2f3ef6f4004e0386c96e7119efe24a.JPG",
  "tags": [
    "Corn",
    "Filipino",
    "Coconut"
  ],
  "title": "Maja Blanca (Filipino Coconut Pudding With Corn)",
  "full_text": "Maja Blanca (Filipino Coconut Pudding With Corn)\nClose\nJump to recipe\nCook\n90 mins\nCooling Time\n3 hrs\nTotal\n4 hrs 30 mins\nServes\n24 servings\nMakes\n24 2-inch squares\nCook Mode\n(Keep screen awake)\nIngredients\n3 1/2\nounces\nunsweetened shredded coconut\n(100g; 1 cup)\n2\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt use half as much by volume or the same weight\n2\ntablespoons\nlight brown sugar\n(1 ounce; 30g)\nPan spray\n, for greasing\n2\nears\nfresh corn\n, shucked (see note)\n2\ntablespoons\n(30ml)\ncoconut oil\n, virgin or refined, melted\n5\nounces\ncornstarch\n(145g; 1 cup)\n8\nounces\n(240ml)\nwater\nOne 13.5-ounce (\n400\nml\n) can full-fat\ncoconut milk\n5 1/4\nounces\nsugar\n(150g; 3/4 cup)\n12\nounces\nmacapuno\n(340g; 1 1/4 cups), see note\nDirections\nAdjust oven rack to top position and preheat to 375°F (190°C). Spread coconut on a rimmed baking sheet. Bake, shaking pan occasionally, until golden brown, about 12 minutes. Transfer toasted coconut to a small bowl and let cool until room temperature, about 10 minutes. Add 1 teaspoon salt and brown sugar and stir until thoroughly combined. Set aside.\nRezel Kealoha\nIncrease oven temperature to 425°F (220°C). Grease a 9- by 13-inch glass baking dish with pan spray; set aside. Line a rimmed baking sheet with parchment paper.\nPlace corn on prepared baking sheet and brush with coconut oil on all sides. Roast, rotating pan halfway through, until corn is tender and lightly brown, about 30 minutes. Set aside until cool enough to handle, about 10 minutes.\nRezel Kealoha\nTo remove kernels from the cobs, place a large bowl on your work surface  and invert a small bowl within the large bowl (this serves as a base on which to rest the corncob). Working with one ear of corn at a time, place one end of a cob on the inverted, smaller bowl. Using a sharp knife, slice downward as close to the base of the kernels as possible, while taking care not to angle the blade into the cob itself. Rotate the ear of corn, and continue until all kernels have been removed. Repeat with the remaining ear of corn. Set aside; discard cobs.\nRezel Kealoha\nIn a medium bowl, whisk together cornstarch and water until smooth; set aside.\nRezel Kealoha\nIn a 3-quart saucepan, whisk together coconut milk and sugar, and set over medium-high heat. Cook, whisking frequently, until sugar is fully dissolved, about 2 minutes. Bring to a boil then lower heat to maintain a steady simmer. Whisk in reserved corn kernels, macapuno, and remaining 1 teaspoon salt.\nRezel Kealoha\nRe-whisk prepared cornstarch mixture. While whisking continuously, slowly pour cornstarch mixture into coconut mixture in a thin stream, until all of it has been added. Using a flexible spatula, cook, stirring constantly, until the coconut mixture is thick and sticks to the sides and bottom of the saucepan, 3 to 5 minutes. Transfer mixture to prepared baking dish, and smooth top into an even layer.\nRezel Kealoha\nLet cool at room temperature for 1 hour, then refrigerate until fully set, at least 2 hours.\nSerious Eats / Rezel Kealoha\nSlice into 24 2-inch squares. Top each square with 2 teaspoons of reserved toasted coconut mixture before serving.\nRezel Kealoha\nSpecial Equipment\n9- by 13-inch glass baking dish\n, rimmed baking sheets\nNotes\nIf you are unable to purchase fresh corn, you can substitute with 6 ounces (170g) drained canned whole kernel sweet corn. In Step 3, toss corn kernels with coconut oil in a medium bowl before roasting, then proceed to Step 5.\nMacapuno, or coconut sport strings, are preserved young coconut strips made from a variety of coconut that has a soft jelly-like flesh and contains very little water. It tastes sweeter than typical coconut and is commonly used in Filipino desserts. Macapuno can be found in Filipino and Asian specialty markets as well as online. If you are unable to find macapuno, you can opt to not add it.\nMake-Ahead and Storage\nThe toasted coconut topping can be stored in an airtight container for up to 1 week.\nThe corn can be prepared ahead of time and refrigerated in an airtight container for up to 3 days.\nMaja blanca can be refrigerated in an airtight container for up to 1 week.\nCorn\nFilipino\nCoconut",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/maja-blanca-filipino-coconut-pudding-with-corn.webp?"
}