{
  "url": "https://www.seriouseats.com/make-ahead-fall-harvest-salad-8735096",
  "image_url": "https://www.seriouseats.com/thmb/RHAVXK5SNtqKFWW7hyPfqgm61Y0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__11__20141119-brassica-salad-vicky-wasik-3-d83ac582c63c407ca16b5fec6affea80.jpg",
  "tags": [
    "Salads",
    "Roasted Vegetables",
    "Vegetarian",
    "Thanksgiving",
    "Vegetables"
  ],
  "title": "Fall Harvest Salad",
  "full_text": "Fall Harvest Salad\nClose\nJump to recipe\nPrep\n10 mins\nCook\n80 mins\nTotal\n90 mins\nServes\n6\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5\npounds\nmixed brassicas\n, such as broccoli, cauliflower, and romanesco broccoli, cut into florets (see note)\n1 3/4\ncups\nextra-virgin olive oil\n, divided\nKosher salt\n3/4\npound\nradishes\n(about 15 large radishes), 1/2 pound quartered and 1/4 pound thinly sliced on a mandoline (see note)\n1 1/2\npounds\nsunchokes\n, 1 pound cut into 3/4-inch chunks and 1/2 pound peeled and sliced thinly on a mandoline (see note)\n1 1/2\npounds\nmixed fingerling potatoes\n(see note)\n2\nsprigs\nrosemary\n5\nmedium\ncloves garlic\n1/3\ncup\napple cider vinegar\n1\nsmall\nshallot\n, roughly chopped\n1\ntablespoon\nDijon mustard\n1/4\ncup\npacked tarragon leaves\n, chopped\n2\nloosely packed cups picked parsley leaves\n(from one bunch; see note)\n1/2\ncup\nsunflower seeds\n, toasted (see note)\n2\nsmall heads\nfrisee lettuce\n, cored and trimmed of damaged leaves (see note)\n1\nsmall head\nradicchio\n, halved, cored, and cut into 1-inch strips (see note)\nDirections\nAdjust oven rack to upper and lower middle positions. Preheat oven to 450°F (230°C). In a large bowl, toss brassicas with 1/2 cup olive oil, season with salt, and spread in an even layer on 2 rimmed baking sheets. Roast, rotating sheets halfway through cooking, until tender and browned, about 35 minutes. Transfer to a large bowl to cool.\nWhen brassica are cooked, toss radish quarters with 2 tablespoons olive oil, season with salt, and arrange in an even layer on one of the now-empty rimmed baking sheets. Toss sunchoke chunks in 2 tablespoons olive oil, season with salt, and arrange in an even layer on the second rimmed baking sheet. Season all vegetables with salt. Roast radishes and sunchokes until each is tender and browned, about 35 minutes. Let cool to room temperature.\nMeanwhile, put fingerling potatoes in a Dutch oven, cover with water and season generously with salt. Add rosemary and garlic and heat over medium-high heat until barely simmering. Lower heat and cook at a very gentle simmer until potatoes can be pierced with a fork with no resistance, about 30 minutes. Let cool slightly in cooking water, then drain and discard rosemary and garlic. Cut fingerlings into 1/4-inch thick coins.\nUsing an immersion blender or standing blender, blend cider vinegar, shallot, Dijon mustard, tarragon, and a large pinch of salt until thoroughly combined and tarragon and shallot are finely chopped. Transfer to a mixing bowl and whisk in remaining 1 cup olive oil. Season with salt, if needed.\nIn a large salad bowl, combine roasted brassicas, roasted radishes, and roasted sunchokes with potato slices, radish slices, sunchoke slices, parsley leaves, sunflower seeds, frisee, and radicchio. Add dressing and toss gently with clean hands until salad is evenly coated. Season with salt to taste and serve.\nSpecial Equipment\n2 rimmed baking sheets, immersion blender or standing blender\nNotes\nThe roasted brassicas, boiled whole potatoes, and dressing can be made up to 3 days ahead and refrigerated; let come to room temperature before finishing salad and serving. Sunflower seeds can be toasted up to 5 days in advance and held in an airtight container. Frisee, parsley leaves, and radicchio can be prepared 1 day ahead and refrigerated in airtight containers with a moist (but not wet) paper towels. Sliced raw radishes can be held in water in the refrigerator for 1 day; sliced raw sunchokes can be held in water with lemon juice in the refrigerator for 1 day. Use whichever brassicas you can find—halved Brussels sprouts would be great here in place of the romanesco if you can't find it.\nRead More\nRoasted Beet and Citrus Salad with Ricotta and Pistachio Vinaigrette\nSalads\nRoasted Vegetables\nVegetarian\nThanksgiving\nVegetables"
}