{
  "url": "https://www.seriouseats.com/makhloota-chickpeas-and-fava-beans-with-tahini-recipe-8638862",
  "image_url": "https://www.seriouseats.com/thmb/N6lCjprh7svNqyivkJvi0SBcul8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240426-SEA-Makhloota-MaiKakish15-ce060dc481c646bb913e2ffd374b2d89.jpg",
  "tags": [
    "Chickpeas",
    "The Latest",
    "Middle Eastern",
    "Vegetarian",
    "Vegan"
  ],
  "title": "Makhloota (Chickpeas and Fava Beans With Tahini)",
  "full_text": "Makhloota (Chickpeas and Fava Beans With Tahini)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs\nSoaking Time\n8 hrs\nTotal\n10 hrs 10 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Makhloota:\n4\nounces\ndried chickpeas\n(\n113\ng\n; about\n1/2\ncup\n) or\none\n14-ounce can\nchickpeas\n, rinsed and drained (see notes)\n4\nounces\ndried mini fava beans\n(\n113\ng\n; about\n1/2\ncup\n) or\none\n14-ounce can\nof\nful medames\n(see notes)\n4\nmedium\ngarlic cloves\n(\n20\ng\n), finely grated on a microplane\n2\ntablespoons\n(\n30\nml\n) freshly squeezed\nlemon juice\n, plus more as needed\n1\nmedium\ngreen chile\n, such as\njalapeño\nor\nAnaheim\n, stemmed, seeded, and finely diced\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n1/2\nteaspoon\nground cumin\nFor the Tahini Sauce (Optional):\n1/4\ncup\n(about\n3\nounces\n;\n70\ng\n)\ntahini\n2\ntablespoons\n(\n30\nml\n)\nlemon juice\n2\ntablespoons\n(\n30\nml\n)\nGreek-style\nor\nplain yogurt\nKosher salt\nA very\nsmall\nhandful\nof\nflat-leaf parsley leaves\n(about\n10\ng\n), finely chopped\nExtra-virgin olive oil\n, for drizzling\nPita\nDirections\nIn a medium bowl, cover chickpeas with 4 cups (946ml) cold water. In another medium bowl, cover fava beans with 4 cups (946ml) cold water. Let stand at room temperature at least 8 hours. Using a colander, drain and rinse both thoroughly.\nSerious Eats / Mai Kakish\nIn a medium saucepan or pot, combine chickpeas with enough water to cover by 2 inches. Bring to a boil over high heat, reduce to a simmer. Simmer, covered with lid slightly ajar, stirring occasionally and topping off with more water as needed to keep beans fully covered, until chickpeas are completely tender but not falling apart, 1 1/2 hours to 2 hours.\nSerious Eats / Lorena Masso\nAt the same time the chickpeas are cooking, in a separate medium saucepan or pot, combine the fava beans with enough water to cover by 2 inches. Bring to a boil over high heat, reduce to a simmer. Simmer, covered with lid slightly ajar, stirring occasionally and topping off with more water as needed to keep beans fully covered, until fava beans are completely tender but not falling apart, 1 1/2 hours to 2 hours.\nSerious Eats / Mai Kakish\nIn a small bowl, combine garlic, lemon juice, chile, salt, and cumin. Transfer half to another small bowl. Using a slotted spoon, transfer cooked chickpeas and 3 to 4 tablespoons of the braising liquid to the first bowl. Using a slotted spoon, transfer cooked fava beans and 3 to 4 tablespoons of the braising liquid to the other bowl. Stir each to combine until slightly thickened, using the back of a spoon to mash some of the beans as you stir—you are looking for a consistency in which most of the beans remain intact but are coated by a thick stew-like liquid Season to taste with additional lemon juice and salt.\nSerious Eats / Mai Kakish\nFor the Tahini Sauce:\nIn a small bowl, whisk tahini, lemon juice, yogurt, and salt with 2 tablespoons water until well-combined. (For a looser consistency, add an extra tablespoon of water.) Set aside.\nSerious Eats / Mai Kakish\nTo Serve:\nPlace the dressed chickpeas on one side of the serving bowl and the fava beans on the other. Drizzle with tahini sauce, if using. Garnish with parsley and drizzle generously with olive oil. Serve with pita for scooping.\nSerious Eats / Mai Kakish\nSpecial Equipment\n2 medium saucepans\nNotes\nCanned chickpeas and/or fava beans can be substituted for dried. To use canned beans,  drain and rinse well. In a small pot, combine chickpeas and 1/2 teaspoon cumin. Cover with water and simmer over medium heat for 10 minutes, until fully heated through. Repeat with fava beans.\nChickpeas\nThe Latest\nMiddle Eastern\nVegetarian\nVegan"
}