{
  "url": "https://www.seriouseats.com/mala-spiced-chex-mix-recipe-8751313",
  "image_url": "https://www.seriouseats.com/thmb/d5RbFxk4MqZAWiK0m98fcAIuMhY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241125-MalaSpicedChexMix-AmandaSuarez-15-be2250fb6c95496b91f817aade9d730f.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Vegetarian"
  ],
  "title": "Mala-Spiced Chex Mix",
  "full_text": "Mala-Spiced Chex Mix\nClose\nJump to recipe\nPrep\n5 mins\nCook\n21 mins\nTotal\n26 mins\nServes\n12\nto 16\nMakes\n13 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\nCorn Chex or similar\ncorn cereal\n(about 5 ounces; 145g)\n4\ncup\ns Rice Chex or similar\nrice cereal\n(5 1/2 ounces; 155g)\n4\ncups\nWheat Chex or similar\nwheat cereal\n(about 9 1/4 ounces; 260g)\n1 1/2\ncups\nroasted unsalted peanuts\n(7 1/2 ounces; 213g)\n2\ncups\npretzels\n(3 ounces; 86g), see notes\n4 tablespoons (\n20\ng\n) Sichuan\npeppercorns\n(see notes)\n1 1/2\ntablespoons\n(7g)\ncumin seeds\n1\ntablespoon\n(6g)\nfennel seeds\n2\nstar anise\nSeeds of\n2\ncardamom pods\nor 1/4 teaspoon ground cardamom\n1 1/2\ntablespoons\n(22g)\ndark brown sugar\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n8\ntablespoons\nunsalted butter\n(4 ounces; 113g)\n1/4\ncup\nchili\ncrisp (1 1/2 ounces; 44g), such as Lao Gan Ma (see notes)\nDirections\nAdjust oven racks to the second-from-top and second-from-bottom positions. Preheat oven to 325ºF (160ºC). Line 2 rimmed baking sheets with parchment (this will make it easier to transfer the cereal into a bowl after); set aside.\nIn a large bowl, combine Corn Chex, Rice Chex, Wheat Chex, and roasted peanuts. Divide cereal and nut mixture evenly between the 2 sheets and toast, using a flexible spatula or wooden spoon to stir occasionally, until evenly golden brown, about 20 minutes. Remove from oven and let cool 5 minutes. Lift up the shorter sides of the parchment to form a “sleeve” to gather the cereal and nuts, then transfer mixture to a large bowl. Add pretzels and toss to combine. Set aside.\nSerious Eats / Amanda Suarez\nIn a small skillet, toast Sichuan peppercorns, cumin seeds, fennel seeds, star anise, and cardamom over medium heat, tossing constantly, until fragrant, 30 seconds to 1 minute. Transfer toasted spices, brown sugar, and salt to a spice grinder or mortar and pestle and grind to a fine powder. Set aside.\nSerious Eats / Amanda Suarez\nIn the same skillet, melt butter over medium heat. Whisk in toasted spices and cook over medium heat until fragrant, about 3 minutes. Remove from heat and, using a flexible spatula, fold in chili crisp. Pour spice mixture over cereal and nut mixture and, using two large wooden spoons or flexible spatulas, toss to evenly coat, taking care to scoop from the bottom of the bowl, until everything is well-combined. Season to taste with additional salt and brown sugar.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n2 rimmed baking sheets, parchment, spice grinder or mortar and pestle\nNotes\nRegular, bite-size, or pretzel sticks can be used in this recipe.\nIf you want a milder Chex mix, you can reduce the amount of Sichuan peppercorns to two tablespoons and substitute the chili crisp with four additional tablespoons of unsalted butter.\nMake-Ahead and Storage\nChex mix can be stored in an airtight container at room temperature for up to 5 days.\nSnacks & Appetizers\nThe Latest\nVegetarian"
}