{
  "url": "https://www.seriouseats.com/malaysian-fiddleheads-and-fava-beans-in-spicy-coconut-milk-recipe-8645256",
  "image_url": "https://www.seriouseats.com/thmb/Ka06Y2pQw055UWXOj8zxvE8KZE8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240120-MasakLemakCiliApi-MichelleYip-Hero1-SEA-2ce838bb86e74957ae0a166fbe91ac7c.jpg",
  "tags": [
    "Malaysian",
    "The Latest",
    "Coconut Milk & Cream",
    "Southeast Asian Cuisines",
    "Fava Beans"
  ],
  "title": "Malaysian Fiddleheads and Fava Beans in Spicy Coconut Milk",
  "full_text": "Malaysian Fiddleheads and Fava Beans in Spicy Coconut Milk\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nTotal\n25 mins\nServes\n4 as a side\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(\n350\ng\n)\nfiddlehead ferns\n(see notes)\n6\nfresh\nbird’s eye chiles\n(about\n3/4\nounces\n;\n20\ng\n), stems removed, thinly sliced\n2\nsmall\nAsian shallots\n(\n2\nounces\n;\n57\ng\n), peeled and thinly sliced cross-wise\nOne\n2-inch piece\n(\n6\ng\n) fresh\nturmeric\n, peeled and thinly sliced cross-wise\n1/2\nounce\n(\n15\ng\n) cleaned\ndried anchovies\n(see notes)\n1\nstalk\nlemongrass\n, bottom 4 to 5 inches only (about\n1/2\nounce\n;\n12\ng\n)\n2 1/4\nounces\n(\n65\nml\n)\ncoconut milk\n(see note)\n1 1/2\ncups\n(\n360\nml\n)\nwater\n1\nturmeric leaf\n, optional\n2 3/4\nounces\n(\n75\ng\n) sheeled and peeled\nfava beans\n(from about\n1\npound\nfava pods\n), split into their natural halves\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n1\nteaspoon\ngranulated\nsugar\nCooked white rice\n, for serving\nDirections\nTrim the fiddleheads to remove any woody stem. (If using the more leafy Southeast Asian variety, trim and reserve the leaves, removing any woody steam, and chop the leaves into bite-size lengths.) Rinse under running water and set aside.\nSerious Eats / Michelle Yip\nUsing a mortar and pestle, pound bird’s eye chiles, Asian shallots, and fresh turmeric into a coarse paste, 2 to 3 minutes. Add dried anchovies and pound until crushed slightly, 10 to 15 seconds (you’re only looking to crush them slightly, not pulverize them). Place lemongrass stalk in the mortar and pound 1 or 2 times with the pestle to bruise.\nSerious Eats / Michelle Yip\nIn a medium saucepan, stir together the contents of the mortar and pestle with the coconut milk and water. Bring to a boil over medium heat.\nSerious Eats / Michelle Yip\nWhen the liquid begins to bubble, add trimmed fiddleheads to saucepan. Stir, then cover, reduce heat to low, and cook until leaves are just wilted, about 5 minutes.\nSerious Eats / Michelle Yip\nMeanwhile, prepare the turmeric leaf, if using: Using a sharp knife, trim the turmeric leaf away from the spine. Stack the 2 pieces of leaf together, roll them up tightly, then slice into very thin strips.\nSerious Eats / Michelle Yip.\nStir in fava beans, sliced turmeric leaf (if using), salt, and sugar. Cover the saucepan and cook until the beans are just tender, another 3 to 5 minutes. Serve with cooked white rice.\nSerious Eats / Michelle Yip\nSpecial Equipment\nMortar and pestle\nNotes\nThe fiddleheads in Malaysia are leafier than the ones sold in US markets. Either will work here, though the US fiddleheads will remain in more distinct whole pieces.\nThis recipe was tested with boxed coconut milk, which comes in a variety of sizes. If using canned, stir the coconut cream and coconut milk together before measuring.\nDried anchovies (called ikan bilis in Malay) can be found at any good Asian grocery store, especially those specializing in Southeast Asian imports. They are sometimes sold already cleaned and gutted, but those will be more expensive; if yours aren't cleaned, you'll need to prep them by removing the heads, then splitting the fish lengthwise so you can gut and debone them.  The bigger varieties tend to be quite salty, so seek out the smaller varieties. If using whole anchovies, you’ll need about ten 3-inch anchovies.\nTurmeric leaves are the young, tender leaves of fresh turmeric rhizomes. The leaves are available in Malaysian and Indonesian grocery stores under the name “daun kunyit.”\nFresh turmeric is available at Southeast Asian and South Asian grocery stores.\nMake-Ahead and Storage\nIn the unlikely event that there are leftovers, store them in an airtight container in the fridge for up to three days.\nSerious Eats / Michelle Yip\nMalaysian\nThe Latest\nCoconut Milk & Cream\nSoutheast Asian Cuisines\nFava Beans",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/malaysian-fiddleheads-and-fava-beans-in-spicy-coconut-milk.webp?"
}