{
  "url": "https://www.seriouseats.com/malloreddus-alla-campidanese-7091596",
  "image_url": "https://www.seriouseats.com/thmb/OhrWFXSfGe0DiG8tqXhwUr6ARuA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230109-Malloreddus-alla-Campidanese-Lorena-Masso-26-4d3d14cd996145569c6f4ec32dc1fb2b.JPG",
  "tags": [
    "Italian",
    "The Latest",
    "Pastas",
    "Pork"
  ],
  "title": "Malloreddus Alla Campidanese (Sardinian Ridged Pasta With Saffron and Pork Ragù)",
  "full_text": "Malloreddus Alla Campidanese (Sardinian Ridged Pasta With Saffron and Pork Ragù)\nClose\nJump to recipe\nPrep\n115 mins\nCook\n55 mins\nTotal\n2 hrs 50 mins\nServes\n4\nto 5 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sausage (optional; see note):\n1 1/2\npounds\n(\n680\ng\n)\nground pork\n(see note)\n1/2\nteaspoon\nred pepper flakes\n1\nteaspoon\nfennel seeds\n, coarsely ground\n1\nteaspoon\n(\n3\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n1/2\nteaspoon\nfreshly ground black pepper\n2\nmedium\ngarlic cloves\n(\n10\ng\n), minced\nFor the Malloreddus:\n10 1/2\nounces\n(about\n2\ncups\n;\n300\ng\n)\nfinely-ground semolina flour\n, plus more for dusting (see note)\nSaffron powder\n, optional\n5\nfluid ounces\n(\n150\nml\n)\nwater\nFor the Sausage Ragu:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1\nsmall\nyellow onion\n(\n5 1/2\nounces\n;\n156\ng\n), finely chopped\n2\nmedium\ngarlic cloves\n(\n10\ng\n), thinly sliced\n1/4\nteaspoon\ncrushed red pepper flakes\n1/4\nteaspoon\nfreshly ground black pepper\n1\nbay leaf\n7\nsaffron\nthreads\n, or\n1/4\nteaspoon\nsaffron powder\n1/4\ncup\n(\n60\nml\n)\nvernaccia di Oristano\n, or\nfino sherry\n1\n(28-ounce; 794g) can\nwhole peeled tomatoes\n, such as\nAntonella\n,\nAlessi\n, or\nDeLallo\n1\nteaspoon\n(\n3\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n4\nfluid ounces\n(\n120\nml\n)\nwater\n2\nounces\n(\n1/2\ncup\n;\n60\ng\n)\ngrated Parmigiano-Reggiano\n, plus more for serving\nDirections\nFor the Sausage (optional; see note):\nIn a large bowl, combine ground pork, red pepper flakes, fennel seeds, salt, pepper, and garlic and, using your hands or a sturdy spatula, mix until thoroughly combined, sticky, and cohesive, about 1 minute. Cover bowl with plastic wrap and refrigerate for at least 1 hour.\nSerious Eats / Lorena Masso\nFor the Malloreddus:\nIn a large bowl, whisk together semolina flour and a pinch of saffron powder (if using) until well combined. Using your hands, make a small well in the center of the flour, then pour 5 fluid ounces water into the well. Using your fingertips, gradually stir the flour into the water until it holds together in a single mass. Then, knead dough in the bowl until a cohesive ball forms, 1 to 2 minutes. Transfer dough ball to a work surface lightly dusted with semolina flour. Knead until dough is smooth and no dry flour remains, about 5 minutes. Shape dough into a ball, wrap with plastic wrap, and let sit at room temperature for 30 minutes.\nSerious Eats / Lorena Masso\nAlternatively, in the bowl of a stand mixer fitted with the dough hook, combine\nsemolina flour, a pinch of saffron powder (if using), and 5 fluid ounces water and mix on low speed until flour is fully moistened, about 2 minutes. Scrape down bowl, then continue kneading on low speed until a smooth ball forms and no dry flour remains, about 3 minutes. Using your hands, shape the dough into a ball, wrap with plastic wrap, and let rest at room temperature for at least 30 minutes.\nSerious Eats / Lorena Masso\nLightly dust a rimmed baking sheet with semolina flour and set aside. On a clean work surface lightly dusted with semolina flour, roll dough into a roughly 12-inch long cylinder. Using a bench scraper, divide the cylinder into 8 equal portions and cover loosely with plastic wrap. Working with one portion at a time, roll into a long rope, about 1/4 inch thick. Using a bench scraper, cut rope into roughly 1/4-inch segments. Repeat with remaining portions, covering with plastic wrap as you go.\nSerious Eats / Lorena Masso\nUse a gnocchi board, sushi mat, or fork to shape the gnocchi. To do so, hold one piece of dough with the cut-side facing you, then use your thumb to pull the dough along the ridges of the board, sushi mat, or fork (ridges should be vertical to the dough). The shaped dough will have a little indentation from your thumb and should resemble a tiny tube. Transfer malloreddus to prepared baking sheet, cover with plastic wrap, and repeat with remaining dough, lightly dusting with additional flour as you go.\nSerious Eats / Lorena Masso\nFor the Sausage Ragù:\nIn a large Dutch oven, heat olive oil over medium heat until shimmering. Add prepared sausage, using a wooden spoon to spread in an even layer across bottom of pot, and cook for 1 minute. Stir to break up sausage into 1/2-inch pieces.\nSerious Eats / Lorena Masso\nReduce heat to medium-low, add onion and cook, stirring frequently, until softened and nearly translucent, about 5 minutes. Stir in garlic, crushed red pepper, black pepper, bay leaf, and saffron and cook until fragrant, about 1 minute. Pour in vernaccia di Oristano or sherry, using a wooden spoon to scrape up any brown bits on the bottom of the pot, and cook until raw alcohol smell has mostly cooked off, about 1 minute.\nSerious Eats / Lorena Masso\nAdd canned tomatoes and their liquid, salt, and 1/2 cup water, then crush the whole tomatoes roughly with a spoon. Return to a simmer, reduce heat to low, partially cover pot, and cook, stirring occasionally, for 30 minutes. Remove lid, increase heat to medium, and cook, stirring frequently, until sauce is thick and slightly darker in color, about 10 minutes. Remove from heat and set aside.\nSerious Eats / Lorena Masso\nTo Assemble and Serve:\nMeanwhile, bring a large pot of very well-salted water to a boil. Add malloreddus to boiling water and cook, stirring frequently, until they float to the surface, about 2 minutes. Using a spider skimmer or slotted spoon, scoop malloreddus and add directly to sausage ragù, along with 1/4 cup (60ml) pasta cooking water.\nSerious Eats / Lorena Masso\nIncrease heat to medium and cook, stirring gently, until malloreddus are coated in the slightly thickened sauce, about 1 minute. Stir in Parmigiano-Reggiano. Serve immediately, passing more grated cheese at the table.\nSerious Eats / Lorena Masso\nSpecial Equipment\nStand mixer, Dutch oven, bench scraper, gnocchi board or sushi mat (optional)\nNotes\nIf you don’t want to make the sausage, you can buy 1 1/2 pounds (680g) fresh sweet Italian sausage (about 6 sausage links), removed from the casing.\nIf you choose to make the sausage, I recommend asking your butcher for ground pork that’s a mix of dark and light meat.\nFor finely-ground semolina flour, I like\nKing Arthur’s finely-ground durum flour\n(durum wheat is the varietal used to make semolina).\nMake-Ahead and Storage\nTo freeze uncooked shaped malloreddus, place pasta on a half sheet pan lined with parchment paper and freeze until firm, then transfer to a zipper-lock bag or an airtight container and store in the freezer for up to 1 month.\nThe sausage ragù can be made in advance and refrigerated in an airtight container for up to 4 days or frozen for up to 6 months. We don’t recommend cooking the pasta and coating it in the ragù if you’re planning on storing it for a later time; the malloreddus will get soft and mushy.\nItalian\nThe Latest\nPastas\nPork"
}