{
  "url": "https://www.seriouseats.com/mangonada-recipe-7511131",
  "image_url": "https://www.seriouseats.com/thmb/lhow61FleNqJTetQd0Ej-nbgDJk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230613-SEA-Mangonada-AmandaSuarez-hero-bec77dd91b054789a538631d4d2e0cee.jpg",
  "tags": [
    "Mango",
    "The Latest",
    "Mexican"
  ],
  "title": "Mangonada",
  "full_text": "Mangonada\nClose\nJump to recipe\nPrep\n15 mins\nTotal\n15 mins\nMakes\n2\nto 4 drinks\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n1 kg\n(\n35.27-ounce\n)\npackage\nfrozen alphonso mango pulp\nor\none\n850 g\n(\n30-ounce\n)\ncan\nalphonso mango pulp\nor\n1 1/2\npints\nmango sorbet\n(see notes)\n1/4\ncup\n(\n60\nml\n)\nfresh lime juice\n, plus more to taste\nHomemade\nor store-bought\nchamoy\n, to taste\nTajín\n, to taste\n4\nripe\nAtaúlfo (champagne) mangoes\n(about\n6 ounces\nor\n170 g\neach), peeled, pitted, and cut into roughly 1/2-inch chunks\nChile-coated tamarind straws\nand/or\ntamarind candies\nand/or other fun garnishes of your choosing\nDirections\nIf Using Frozen Mango Pulp:\nRemove frozen pulp from its packaging and, using a sharp chef's knife, cut it into roughly 2-inch chunks. Transfer frozen chunks to a high-powered blender or food processor along with the 1/4 cup lime juice and pulse until a smooth, sorbet-like puree forms; you may need to use your blender's tamper (if it has one) and/or stop to mix and scrape down the sides as needed to fully break up all the frozen chunks. If your blender or food processor is struggling, let the frozen puree stand until slightly softened to make processing easier, as you do not want to damage your equipment by forcing it beyond its capabilities.\nIf Using Canned Mango Pulp:\nIf using canned mango pulp, open the can, then either churn the pulp in an ice cream maker with the 1/4 cup lime juice until a sorbet-like texture forms or transfer to the freezer until pulp is almost completely frozen, about 8 hours, then transfer to a blender or food processor and process with the 1/4 cup lime juice until a smooth, sorbet-like texture forms. Do not freeze an unopened can, as it can rupture from the expanding contents (note that stirring occasionally during freezing will help form the sorbet-like texture and may help avoid the need to process the frozen pulp at all).\nIf Using Mango Sorbet:\nUsing a food processor or blender, combine sorbet and the 1/4 cup lime juice and process/blend until well incorporated.\nSprinkle a thin, even layer of chamoy in one small dish and pour a thin, even layer of Tajín in a second small dish. Dip the rims of two large (or 3 or 4 smaller) drinking glasses in the chamoy followed by the Tajín to make a seasoned rim. Spoon about 2 tablespoons (30ml) chamoy, or to taste, into the bottoms of each glass, then swirl to coat the bottom and surrounding walls slightly. Add some chunks of diced fresh mango to the bottom of each glass, then spoon the frozen mango puree on top until glasses are about half full.\nSerious Eats / Amanda Suarez\nAdd some more mango chunks on top of the mango puree, along with a squeeze of fresh lime juice, a sprinkling of Tajín, and more chamoy (exactly how much lime, Tajín, and chomay you add is up to personal preference, based on how tart and spicy you want it to be).\nSerious Eats / Amanda Suarez\nSpoon more mango puree on top of until glasses are nearly full, then top with more fresh mango pieces and Tajín. Garnish with tamarind straws, tamarind candy, or anything else you think would be fun and delicious.\nSerious Eats / Amanda Suarez\nNotes\nThe best mangonadas are made with the most delicious mango, and in this case that usually means frozen or canned alphonso mango puree, which can be ordered online or found at South Asian grocers like Patel brothers. You can use mango puree made from other varieties of mango, including kestar and ataulfo, though we think alphonso mango is among the tastiest. If you can't find these options, your next best bet is a good quality mango sorbet. Fresh mango, while a seemingly good choice, is the least good option, as quality is much harder to ensure, and many mangos sold in the United States are not nearly as delicious has the pureed options.\nSpecial Equipment\nHigh-powered blender, food processor, or ice-cream maker (depending on method you choose for the frozen mango puree).\nMango\nThe Latest\nMexican",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mangonada.webp?"
}