{
  "url": "https://www.seriouseats.com/mango-shandy-recipe-8687470",
  "image_url": "https://www.seriouseats.com/thmb/emSagLZukFQEe0OWgK10jHWLUNQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__07__20200728-mango-shandy-vicky-wasik-3-bb56fd20f68743138751ef8e90adcafb.jpg",
  "tags": [
    "Mango",
    "Summer Drinks",
    "Ginger"
  ],
  "title": "Mango Shandy With Chile, Ginger, and Lime",
  "full_text": "Mango Shandy With Chile, Ginger, and Lime\nClose\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 cups (13 oz;\n370\ng\n)\ncubed\nsweet, ripe mango\n, from 2 large or 4 medium mangoes (see note)\nOne 1/4-inch piece (0.2 ounce;\n4\ng\n)\nfresh ginger\n, peeled and\nsliced\n1/2 small green\njalapeño\n(0.3 oz;\n8\ng\n), stemmed (see note)\n1/2\ncup\n(120ml) cold\nwater\nTwo\n12-ounce\n(355ml) cans/bottles\nlager\n(see note)\nTwo\n12-ounce\n(355ml) cans/ bottles\nlemon-lime soda\n(see note)\nFreshly squeezed lime juice\n, to taste\nDirections\nCombine mangoes, ginger, jalapeño and water in a blender or canister of a hand-held blender. Blend until smooth, about 1 minute.\nSet a fine-mesh strainer in a medium mixing bowl. Strain mango purée through strainer, using a flexible spatula to help push mixture through; discard solids left in the strainer.\nPour half of the strained purée into a large jug (the mixture will froth up once you add the soda and lager). Top with half the lager and half the lemon-lime soda.\nStir and taste. If you like the way it tastes, add the rest of the purée, followed by the rest of the lager and soda to maintain the same mango purée to lager to soda ratio. Alternatively, add remaining purée, lager, and lemon-lime soda in proportions that accord more with your taste.\nTo serve: Pour into chilled glasses and top with a squeeze of lime juice. Garnish with a lime slice, if you like, and serve immediately.\nSpecial Equipment\nBlender\nor\nhand-held blender\n;\nfine-mesh strainer\nNotes\nUse your favorite variety of mango; I prefer to use Haden or Kent mangoes, but I know my friends love making this drink with Alphonso mangoes, too. Frozen mangoes can be used as well; defrost them slightly before blending.\nAny lemon-lime soda will work, but I prefer Sprite.\nAny hoppy lager will work, too, but I prefer to use Heineken.\nTo reduce the spiciness of the drink, you can remove the seeds and ribs from the jalapeño before blending.\nMake-Ahead and Storage\nThe fruit purée can be made up to 3 days in advance and refrigerated in an airtight container. You can also freeze the purée; I've found it easiest to freeze it in ice cube trays. Once frozen, transfer mango purée cubes to a freezer zipper lock bag for longer term storage.\nMango\nSummer Drinks\nGinger",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mango-shandy-with-chile-ginger-and-lime.webp?"
}