{
  "url": "https://www.seriouseats.com/mansaf-recipe-6888919",
  "image_url": "https://www.seriouseats.com/thmb/EgBZ3JxNFUZAd4rMLcZWzGZqaaE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221208-Mansaf-Mai-Kakish-hero-ec9c515c00d24b5c9ef567854036f044.JPG",
  "tags": [
    "Middle Eastern",
    "The Latest",
    "Lamb Shank",
    "Yogurt & Cultured Dairy",
    "White Rice"
  ],
  "title": "Mansaf (Palestinian Spiced Lamb With Rice and Yogurt Sauce)",
  "full_text": "Mansaf (Palestinian Spiced Lamb With Rice and Yogurt Sauce)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs\nResting Time\n20 mins\nTotal\n2 hrs 30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n4\nlamb shanks\n(about\n3 1/2\npounds\n;\n1.5\nkg\ntotal)\n1\nmedium\n(\n8-ounce\n;\n226 g\n)\nyellow onion\n, peeled but left whole\n10\nallspice berries\n5\ncardamom pods\n4\ncloves\n3\nbay leaves\n1\ncinnamon stick\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\nuse half as much by volume or the same weight\nFor the Yogurt Sauce:\nOne\n2.2-pound\n(\n1 kg\n)\nTetra Pak of liquid jameed\n, such as Kasih and Ziyad, or\n1\n(roughly\n8-ounce\n/\n226 g\n) disc of\njameed\nsoaked overnight in\n2\ncups\n(\n473\nml\n)\nwater\nand then blended until smooth\n1\npound\n(\n453\ng\n)\nfull-fat plain yogurt\n(preferably goat or sheep, but cow milk works as well)\n1\ntablespoon\n(\n10\ng\n)\ncornstarch\nKosher\nor\nsea salt\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n8\nmedium\ncloves garlic\n, crushed or minced\nFor the Rice:\n1 1/4\npounds\n(\n566\ng\n)\njasmine\nor\nCalrose rice\n2\ntablespoon\n(\n30\nml\n)\nunsalted butter\nor\nghee\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\nuse half as much by volume\n1/4\nteaspoon\nturmeric\nTo Assemble and Serve:\n1\nlarge\nshrak\n,\nmarkook\n, or other\nthin flatbread\n(see note)\n1\ncup\nslivered almonds\n(\n4\nounces\n/\n113\ng\n), toasted until golden (see note)\nDirections\nFor the Broth:\nIn a large pot or Dutch oven, cover the lamb shanks with enough water to barely submerge. Set over medium-high heat and cook just until water comes to a boil and foam rises to the surface. Remove from heat, drain shanks, then wash with water to remove any foam clinging to them.\nSerious Eats / Mai Kakish\nWash pot well, then return the shanks to it along with the onion, allspice, cardamom, cloves, bay leaves, cinnamon, and salt. Add enough water to cover all the ingredients by one inch. Bring to a boil over medium-high heat, then reduce heat to maintain a simmer and cook until shanks are very tender but not falling off the bone, 1 1/2 to 2 hours.\nSerious Eats / Mai Kakish\nTransfer shanks to a platter and keep warm. Strain broth, discarding solids; keep warm. Wash pot once more.\nSerious Eats / Mai Kakish\nMeanwhile, for the Yogurt Sauce:\nIn a small saucepan, whisk together liquid jameed (or reconstituted jameed), yogurt, cornstarch, and 1/2 cup (118ml) water. Season with salt. Bring to a boil over medium heat, whisking constantly, then remove from heat (it is very important to whisk continuously to prevent curdling; if it does curdle, use a handheld immersion blender to bring it back together into a smooth sauce). The sauce should be relatively thick at this point, almost like a pureed vegetable soup.\nSerious Eats / Mai Kakish\nIn a small skillet, heat olive oil and garlic over medium heat until garlic is fragrant and cooked through, but not at all browned, about 2 minutes. Pour the garlic and its oil into the yogurt and stir to combine. The sauce should be quite salty and sour, so add salt as needed.\nSerious Eats / Mai Kakish\nFor the Rice:\nIn a medium mixing bowl, rinse rice in several changes of cold water until water is almost clear, then cover rice with cold water and let soak for 15 minutes. Drain well.\nSerious Eats / Mai Kakish\nIn a large nonstick pot or Dutch oven, heat the butter and oil over high heat until butter is melted. Add rice, stirring to fully coat in the oil, then add 3 cups (710ml) water along with the salt and turmeric. Bring to a boil, then reduce heat to a simmer and cook, uncovered, until most of the water has been absorbed, 2 to 5 minutes. Stir once, then carefully cover pot with a clean kitchen towel and cover tightly with the lid. Remove from heat and let stand 15 minutes.\nSerious Eats / Mai Kakish\nTo Assemble and Serve:\nPour 4 cups (1L) of the strained broth into the cleaned large pot or Dutch oven along with the yogurt sauce. Whisk to form a very smooth sauce (if it isn't smooth, use an immersion blender to smooth it out). The sauce should have a consistency somewhere between whole milk and half-and-half; if it's too thick, whisk in more broth 1/4 cup (15ml) at a time until proper consistency is reached. Season once more with salt, if necessary, bearing in mind the sauce should be very salty and tangy, almost like a very strong feta cheese.\nSerious Eats / Mai Kakish\nAdd the lamb shanks to the sauce and bring to a boil over medium-high heat, then reduce heat to a simmer and cook until lamb is heated through and the sauce is thick enough to coat the shanks in a thickened and creamy glaze, about 15 minutes. If sauce is still too thin, continue simmering until the sauce reaches a heavy cream–like consistency.\nSerious Eats / Mai Kakish\nTo serve, tear up bread into large pieces and arrange on a large, round serving platter in a single, slightly overlapping layer. Pour enough yogurt sauce over the bread to soak through and soften. Fluff the rice, then spoon in a mound on top of the bread. Set shanks on top. Ladle more yogurt sauce all over until it has soaked through the rice and bread (you don't want the mansaf so wet that it begins to flow like soup, but you can be generous with the sauce). Sprinkle all over with the toasted almonds.\nSerious Eats / Mai Kakish\nServe, passing more yogurt sauce at the table for diners to add to their plates.\nSerious Eats / Mai Kakish\nSpecial Equipment\nLarge nonstick pot or Dutch oven\nNotes\nFlatbreads like shrak or markook, which can be found in some Middle Eastern markets, can vary quite a bit in terms of size, thickness, and shape; while they're often more than one foot in diameter, this is not always the case. If you can't find them, substitution options include very thin (pocketless) Lebanese pita or even, as my mother in law sometimes does, good quality flour tortillas. While it's less traditional, I sometimes skip the bread entirely and still love this dish. Because these breads can vary so much in size, the best way to know how much to use is to fully cover the surface of whatever serving platter you will be using with the torn pieces.\nYou can toast almonds in a dry stainless-steel skillet, tossing frequently; in a moderate oven, stirring occasionally; or in the\nmicrowave\n.\nMake-Ahead and Storage\nThe strained lamb broth can be refrigerated for up to 2 days with the lamb shanks in it to keep them moist; remove any solidified fat on the surface before rewarming and separating shanks from broth.\nIf making this for your family and not for a large gathering, you can assemble individual plates and avoid preparing the large serving platter; this will make it easier to store and reheat leftovers.\nMiddle Eastern\nThe Latest\nLamb Shank\nYogurt & Cultured Dairy\nWhite Rice"
}