{
  "url": "https://www.seriouseats.com/maple-angel-food-cake",
  "image_url": "https://www.seriouseats.com/thmb/PSO2-5w4ecjKBAycczUeFAfotbg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__12__20181217-maple-angel-food-cake-vicky-wasik-12-93cf703fd58b490fac0a60337fe4ed68.jpg",
  "tags": [
    "Cakes",
    "Baking",
    "Mother's Day"
  ],
  "title": "Maple Angel Food Cake Recipe",
  "full_text": "Maple Angel Food Cake Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n45 mins\nActive\n15 mins\nCool\n2 hrs\nTotal\n3 hrs 5 mins\nServes\n10\nto 12 servings\nMakes\n1 tube cake\nCook Mode\n(Keep screen awake)\nIngredients\n5\nounces\nbleached cake flour\n, such as Swans down or\nthis gluten free blend\n(\n1\ncup\nplus\n2\ntablespoons\n;\n140\ng\n) (see note)\n15\nounces\negg whites\n, straight from the fridge (\n2\ncups\n;\n425\ng\n; from\n12\nlarge\neggs\n)\n15\nounces\ngranulated maple sugar\n(\n2\ncups\n;\n425\ng\n)\n1\ntablespoon\n(\n15\ng\n)\nvanilla extract\n1\nounce\nfreshly squeezed orange juice\n(\n2\ntablespoons\n;\n25\ng\n) from\n1\nsmall\norange\n1/2\nteaspoon\n(\n2\ng\n)\nDiamond Crystal kosher salt\n, or more to taste; for table salt, use half as much by volume or use the same weight\nDirections\nAdjust oven rack to the middle position and preheat to 350°F (180°C). Sift cake flour and set aside. Combine egg whites, maple sugar, and vanilla extract in the bowl of a stand mixer fitted with the whisk attachment. Mix on low speed to loosen, about 1 minute, then increase to medium-low (4 on a KitchenAid) and whip 3 minutes; the whites will be dense and dark.\nWith the mixer still running, add orange juice and salt. Immediately increase to medium (6 on a KitchenAid) and whip 3 minutes longer; the meringue will be thin but foamy. Increase to medium-high (8 on a KitchenAid) and continue whipping until the meringue is glossy white and thick enough that you can see the pattern left by the wire whisk. This can take between 2 and 4 minutes, depending on the freshness of the whites and the horsepower of your mixer. When meringue is ready, it should be soft enough to run off the wires when the whisk attachment is removed, but thick enough to mound up on itself like soft serve in the bowl.\nSprinkle cake flour on top and stir with a flexible spatula to roughly combine. Switch to a folding motion, scraping from the bottom up and folding through the center, until no pockets of flour remain. Scrape the batter into a 10-inch aluminum tube pan (do not butter or grease pan); if you notice any small pockets of unincorporated flour, simply pause to mix them in. Bake until the cake is puffed, golden blond, and firm to the touch, about 45 minutes, or to an internal temperature of 206°F (97°C).\nInvert pan onto its stilts and cool upside down until absolutely no trace of warmth remains, at least 2 hours. Slide an offset spatula around the sides of cake to loosen, remove the insert, and slide spatula under the bottom as well. Flip onto a serving plate, pulling gently on the sides of the cake to release it from the center tube. To serve, cut with a chef's knife, using a gentle sawing motion and only the slightest downward pressure. Serve plain, or garnish with fresh fruit, whipped cream, chocolate ganache, or whatever accompaniment you prefer. Wrapped tightly in plastic, leftovers will keep up to 1 week at room temperature.\nNotes\nSmall packages of maple sugar can be surprisingly expensive, but buying in bulk can help bring the cost down. Look for bins of maple sugar at organic markets, or buy larger quantities online, whether in big five-pound bags or smaller 25-ounce packages.\nSpecial Equipment\nStand mixer\n, flexible spatula, 10-inch aluminum tube pan,\noffset spatula\n,\ndigital thermometer\n, optional\nMake-Ahead and Storage\nWrapped tightly in plastic, leftovers will keep up to 1 week at room temperature.\nThis Recipe Appears In\nMaple Angel Food Cake: A Study in Sweet Simplicity\nCakes\nBaking\nMother's Day"
}