{
  "url": "https://www.seriouseats.com/maple-walnut-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/E_KtKdrxDSFsvLDKcUDINcNUO9E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__05__20150511-nut-ice-cream-vicky-wasik-6-f208fd8e89c24895ab85e2db19c5d7d6.jpg",
  "tags": [
    "Ice Cream",
    "Heavy Cream",
    "Walnuts"
  ],
  "title": "Maple Walnut Ice Cream Recipe",
  "full_text": "Maple Walnut Ice Cream Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 5 mins\nActive\n60 mins\nChurning/Freezing Time\n8 hrs 30 mins\nTotal\n10 hrs 40 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nunsalted walnuts\n, divided\n2\ncups\nheavy cream\n1\ncup\nwhole milk\n6\nlarge\negg yolks\n3/4\ncup\ndarkest grade\nmaple syrup\n1/2 to 1\nteaspoon\nkosher salt\n, to taste\nDirections\nToast 4 ounces walnuts in a\nmicrowave\nor a dry saucepan over high heat until they darken slightly and begin to smell nutty, about 1 minute, then finely chop and set aside. While walnuts toast, bring cream and milk to a simmer in a heavy-bottomed saucepan. Remove from heat, stir in walnuts, cover, and steep for 1 to 2 hours.\nIn a heavy-bottomed saucepan, whisk together egg yolks and maple syrup until well combined. Strain cream mixture through a fine-mesh strainer into pot with eggs and maple syrup; discard soaked walnuts. Whisk until fully combined, then set over medium heat and cook, whisking frequently, until a custard forms on a spoon and a finger swiped across the back leaves a clean line, or until custard temperature reaches 170°F. Add salt to taste.\nPour custard through a fine mesh strainer into an airtight container and chill in an ice bath or refrigerator until temperature drops to 40°F, about 4 hours for ice bath, up to overnight for refrigerator.\nChurn ice cream according to manufacturer's instructions. While ice cream churns, toast and roughly chop remaining 4 ounces of walnuts, then chill in freezer. Add walnuts to ice cream during final minute of churning. Transfer churned ice cream to an airtight container and harden in freezer for at least 4 hours before serving.\nSpecial Equipment\nIce cream maker\nThis Recipe Appears In\nHow to Add Rich, Nutty Depth to Any Ice Cream Recipe\nIce Cream\nHeavy Cream\nWalnuts"
}