{
  "url": "https://www.seriouseats.com/maple-mustard-broiled-salmon-recipe-8662312",
  "image_url": "https://www.seriouseats.com/thmb/E0QVDpU6IQJyx48o_CkwFWQSOLE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240612SE_Maple-Mustard-Salmon_Jordan-Provost15-15-a814278cff2c4f5e8776df462d3cc6c1.jpg",
  "tags": [
    "Salmon",
    "The Latest",
    "Quick Dinners",
    "Mains"
  ],
  "title": "15-Minute Maple-Mustard Broiled Salmon",
  "full_text": "15-Minute Maple-Mustard Broiled Salmon\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nTotal\n15 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\ng\n)\nmayonnaise\n2\ntablespoons\n(\n30\ng\n)\nDijon mustard\n1\ntablespoon\n(\n15\ng\n)\nmaple syrup\n1/4\nteaspoon\nsmoked paprika\n,\nchipotle powder\n, or\ncayenne\n(optional)\nKosher salt\nand\nfreshly ground black pepper\n2\npounds\nsalmon fillet\n(\n900\ng\n), with or without skin and either whole or divided into individual portions (see notes)\nDirections\nPreheat broiler and set oven rack to about 6 inches below broiler element. Meanwhile, in a small bowl, whisk together mayonnaise, mustard, maple syrup, and smoked paprika, chipotle powder, or cayenne (if using). Season with salt and pepper; feel free to adjust flavor and heat level by adding more paprika, if desired.\nSerious Eats / Jordan Provost\nLine a rimmed baking sheet with aluminum foil. Lightly season salmon all over with salt and pepper. Set salmon on prepared baking sheet and rub a thin, even layer of the maple-mustard mixture all over the surface and sides.\nSerious Eats / Jordan Provost\nBroil salmon until browned on top and the center registers 115 to 125°F (46 to 52°C) for medium-rare to medium, respectively, about 5 minutes; it can help to keep the oven door cracked while salmon is cooking to prevent the broiler from cycling on and off (though not all ovens function this way). If salmon becomes well browned on top before it is cooked enough in the center, switch off the broiler and set the oven to 425°F (220°C), then continue cooking until done (this shouldn't take more than 1 to 2 minutes longer).\nSerious Eats / Jordan Provost\nTransfer salmon to plates or a platter and serve.\nSerious Eats / Jordan Provost\nSpecial Equipment\nRimmed baking sheet\n, aluminum foil,\ninstant-read thermometer\nNotes\nYou can make this recipe with salmon that's already been portioned into individual servings, or a larger fillet for a party or large gathering (just keep in mind that once cooked, a large piece of salmon won't cut cleanly). This recipe works equally well with skin-on and skinned salmon.\nSalmon\nThe Latest\nQuick Dinners\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/15-minute-maple-mustard-broiled-salmon.webp?"
}