{
  "url": "https://www.seriouseats.com/marbled-tea-eggs-recipe-11689967",
  "image_url": "https://www.seriouseats.com/thmb/F5htAzELu5xYjbrQOayrrUy-bGg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250212-SEA-MarbledTeaEggs-VyTran-Beauty1-54-7bfa203ef4ab4ca69655f1a72936ef04.jpg",
  "tags": [
    "Eggs",
    "The Latest",
    "Snacks & Appetizers",
    "Boiled Eggs",
    "East Asian"
  ],
  "title": "Marbled Tea Eggs",
  "full_text": "Marbled Tea Eggs\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nSteeping and Cooling\n24 hrs 30 mins\nTotal\n25 hrs 45 mins\nServes\n2\nto 4\nMakes\n12 eggs\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n475\nml\n) Chinese\nlight soy sauce\n1/4\ncup\n(\n60\nml\n)\ndark soy sauce\n6\ncups\n(\n1.4\nL\n)\nwater\n1\ncup\nlight brown sugar\n(\n7 1/2\nounces\n;\n213\ng\n)\nOne\n3-inch piece\nginger\n(\n2 1/2\nounces\n;\n70\ng\n), cut into 1/4-inch segments\nOne 3-inch piece\ngalangal\n(1/2 ounce; 15 g), cut into 1/4-inch segments (see notes)\n2\nteaspoons\nfennel seeds\n10\ncloves\n6\nstar anise\nTwo\n3-inch pieces\ncassia bark\n, see notes\n1 1/2\nounces\n(\n40\ng\n) loose leaf\ntea\n, such as tie guan yin, xiang pian or pu-erh, see notes\n12\nlarge\neggs\nDirections\nIn a medium pot, combine light soy sauce, dark soy sauce, water, brown sugar, ginger, galangal, fennel seeds, cloves, star anise, and cassia bark. Bring to a boil over medium-high heat, stirring occasionally to dissolve sugar. Reduce heat to low and simmer until deeply infused with the fragrance of the spices and aromatics, about 20 minutes.\nSerious Eats / Vy Tran\nUsing a fine-mesh sieve, strain liquid into a heatproof container or bowl. Add tea leaves and let steep until leaves unfurl and liquid is aromatic, about 15 minutes. (If using black or oolong tea, add tea leaves immediately. If using a more delicate tea, such as jasmine, let liquid cool slightly to 158 to 176°F/70 to 80°C before adding tea.)\nSerious Eats / Vy Tran\nMeanwhile, set up an ice bath by filling a large bowl with ice and water. Bring a large pot of water to the boil. Using a slotted spoon or strainer, gently lower eggs into water and cook to your desired doneness: 6 minutes for soft-boiled, 7 minutes for jammy yolks, or 11 minutes for hard-boiled eggs. Using slotted spoon or strainer, remove eggs and immediately place in ice bath. Allow eggs to cool for at least 15 minutes.\nSerious Eats / Vy Tran\nUsing the back of a spoon, firmly tap eggshells all over  to form defined cracks. (There should be cracks but the eggshell should still be in one piece.) Place eggs in tea mixture, cover with a lid or plastic wrap, and refrigerate until the eggs have developed a distinct marbled appearance and are well seasoned, about 24 hours.  Let eggs sit at room temperature for 10 minutes before serving.\nSerious Eats / Vy Tran\nSpecial Equipment\nMedium pot, fine-mesh sieve, large bowl, slotted spoon or strainer, large pot\nNotes\nLight soy sauce can be substituted for dark soy sauce in the recipe, though the tea eggs may have a less complex flavor.\nIf galangal is unavailable, you can prepare the tea eggs without it, but they may be less complex in flavor.\nIf cassia bark is unavailable, cinnamon sticks can be used instead.\nMake-Ahead and Storage\nTea eggs can be refrigerated in their marinating liquid in an airtight container for up to 3 days; they will become darker and more flavorful the longer they sit. Let eggs come to room temperature for 10 minutes before serving.\nEggs\nThe Latest\nSnacks & Appetizers\nBoiled Eggs\nEast Asian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/marbled-tea-eggs.webp?"
}