{
  "url": "https://www.seriouseats.com/maritozzi-recipe-11684437",
  "image_url": "https://www.seriouseats.com/thmb/BiINPmOagrs5TuG8evWN6C8G4hg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250221-SEA-Maritozzi-AmandaSuarez-34-bbf212192dc14add93a8cdd482c8d411.jpg",
  "tags": [
    "Bread",
    "The Latest",
    "Italian",
    "Breakfast & Brunch",
    "Yeast Breads"
  ],
  "title": "Maritozzi",
  "full_text": "Maritozzi\nClose\nJump to recipe\nPrep\n6 hrs 15 mins\nCook\n30 mins\nCooling Time\n15 mins\nTotal\n7 hrs\nServes\n8\nMakes\n10 buns\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Scald:\n2 1/2\nounces\nglutinous\nrice flour\n(\n70\ng\n;\n6\ntablespoons\nplus\n1\nteaspoon\n), see notes\n3/4\ncup\nplus\n2\ntablespoons\nwhole milk\n(\n200\nml\n;\n209\ng\n)\n1 1/2\nounces\nhoney\n(\n45\ng\n; 2 tablespoons)\nFor the Dough:\n1 1/2\nounces\ncold\nwhole milk\n(\n45\ng\n;\n3\ntablespoons\n)\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, plus more for greasing\n1\nlarge\negg yolk\n10\nounces\nbread flour\nor high-protein flour (\n283\ng\n;\n2\ncups\nplus\n2\ntablespoons\n)\n1\ntablespoon\norange zest\nfrom 1 large orange\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3/4\nteaspoon\nyeast\nFor the Egg Wash:\n1\nlarge\negg\n, lightly beaten\nFor the Filling:\n4\nounces\nmascarpone\n(\n113\ng\n;\n1/2\ncup\n)\n1\ncup\n(\n240\nml\n)\nheavy cream\n2\ntablespoons\n(\n14\ng\n)\nconfectioners' sugar\n, plus more for dusting\n1/4\nteaspoon\nvanilla extract\nPinch\nkosher salt\nToppings (Optional)\n2\nounces\nunsalted\npistachios\n(\n60\ng\n;\n1/2\ncup\n), lightly toasted and coarsely chopped\nChocolate\ncurls\nCandied citrus\nDirections\nFor the Scald\n: Place sweet rice flour in a medium bowl. In a small saucepan, combine whole milk and honey, and bring to a boil over medium heat, 3 to 5 minutes. Pour boiling milk and honey over sweet rice flour and rapidly whisk until mixture thickens to a pudding-like consistency and registers between 155 to 170°F (68 to 77°C).\nSerious Eats / Amanda Suarez\nCover bowl with a large plate or plastic wrap, and let sit until mixture has cooled to at least 80°F (27°C), about 1 hour.\nFor the Dough:\nAdd milk, olive oil, and egg yolk to the scald mixture. Whisk until well combined.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the dough hook attachment, combine flour, orange zest, salt, and yeast, and mix on low speed until well combined, about 15 seconds. Turn off mixer, then add scalded rice flour mixture all at once and mix on low speed until dough is uniform, about 2 minutes, using a flexible spatula to scrape down sides of bowl and dough hook as needed.\nSerious Eats / Amanda Suarez\nIncrease speed to medium and mix until dough just starts to come away from sides of bowl, about 8 minutes. (The dough will remain sticky and webby. Do not overmix here— the dough should not be bouncy.)\nSerious Eats / Amanda Suarez\nLightly grease a large bowl with olive oil; the bowl should be big enough for dough to double in size. Transfer dough to the greased bowl, and cover bowl tightly with plastic wrap. Let sit at warm room temperature (75 to 80°F; 24 to 27°C) until dough is puffy and expanded by about 1 1/2 times its original volume, 60 to 90 minutes.\nSerious Eats / Amanda Suarez\nUsing lightly moistened hands, deflate dough until it is restored to its original volume. Cover tightly with plastic wrap and refrigerate until dough is no higher than 55°F (13°C), at least 2 hours and up to 24 hours.\nSerious Eats / Amanda Suarez\nLightly flour top of dough and transfer to a lightly floured work surface. Using a knife or dough scraper, divide dough into 8 equal pieces, each about 70g (2 1/2 ounces) each. Gently shape each into a round. Cover loosely with plastic wrap and let sit for 30 minutes. Line two 13- by 18-inch rimmed baking sheets with parchment paper; set aside.\nSerious Eats / Amanda Suarez\nWorking with one ball of dough at a time (seam-side down) on a lightly floured work surface, shape each dough portion by cupping the dough in your hand and rolling it in a circular motion until a tight ball forms. Repeat with remaining dough portions and transfer buns to prepared baking sheet, spacing about 1 inch apart. Loosely cover with plastic wrap, and let buns rise until puffy and doubled in volume, about 3 hours.\nSerious Eats / Amanda Suarez\nWhen buns have proofed for about 2 hours 30 minutes, adjust oven racks to the second-from-top and second-from bottom positions. Preheat to 350°F (175°C). Brush buns with egg wash and bake until golden brown and puffed, about 20 minutes.\nSerious Eats / Amanda Suarez\nRemove from oven. Let cool on trays for 5 minutes, then transfer to a wire rack to cool completely, about 15 minutes.\nFor the Filling:\nWhile the buns cool, in the bowl of a stand mixer fitted with the whisk attachment, whisk mascarpone on medium speed until smooth, about 1 minute. Add heavy cream, powdered sugar, vanilla extract, and salt, and whip on medium speed until stiff peaks form, 3 to 4 minutes. (Alternatively, filling can be prepared in a large bowl using an electric hand mixer.)\nSerious Eats / Amanda Suarez\nWhen buns have cooled, use a serrated knife to cut a slit from top to bottom most of the way through each bun. Take care not to cut all the way through; the bottom should remain intact. Gently open 1 bun and, using a spoon or offset spatula, fill bun with cream mixture. Using an offset spatula, level cream with bun and smooth the edges, removing excess cream as needed. Garnish with desired toppings and dust with confectioners’ sugar. Repeat with remaining buns.\nSerious Eats / Amanda Suarez\nBread\nThe Latest\nItalian\nBreakfast & Brunch\nYeast Breads"
}