{
  "url": "https://www.seriouseats.com/maryland-crab-boil",
  "image_url": null,
  "tags": [
    "Seafood Mains",
    "American",
    "Gluten-free Mains",
    "Stovetop Seafood",
    "Crab"
  ],
  "title": "Maryland Crab Feast Recipe",
  "full_text": "Maryland Crab Feast Recipe\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n15 mins\nTotal\n30 mins\nCook Mode\n(Keep screen awake)\nIngredients\nOne or two\n(12-ounce) cans\nbeer\n, such as a\nlight American lager\nDistilled white\nor\ncider vinegar\n, as needed, plus more for serving\nLive\nMaryland blue crabs\n, as many as you want\nOld Bay\nor other similar\nseasoning mixture\n, as needed\nDrawn\nor\nmelted butter\n, for serving\nDirections\nAdd enough beer to the largest pot you own to reach a depth of roughly 1 inch. Pour in a generous splash of vinegar. The exact quantity isn't important; just give it a good little glug. (Note: You can also just use water to steam the crabs, if you want. The flavor difference will be subtle.)\nAdd a steaming rack tall enough to stand higher than the liquid level in the pot. If you don't have one, try wadding aluminum foil into ropes to make a makeshift rack that will hold the crabs aloft.\nSerious Eats / Vicky Wasik\nAdd the crabs, a few at a time, generously sprinkling Old Bay all over them as you go. Add Old Bay to taste (the more you use, the spicier the crabs will be). If you can't fit all your crabs in the pot and/or can't fit a cover on the pot, you will have to steam them in batches.\nSerious Eats / Vicky Wasik\nSet over high heat and bring to a boil. Cover pot and cook for 15 minutes. Check the crabs: They should be bright red and piping-hot when done. If they're not, cook for an additional 5 to 15 minutes, until crabs are bright red and no traces of blue remain.\nRemove crabs and repeat with any remaining crabs. Serve with distilled vinegar and drawn butter on newspaper-covered tables. Sides like\ncorn on the cob\n,\ncornbread\n, and\ncoleslaw\nare commonly served alongside.\nSpecial Equipment\nSteamer basket,\nstockpot\nNotes\nFor a more sustainable approach, ask your fishmonger for male crabs, as many female crabs contain roe that could otherwise help maintain the crab population.\nSeafood Mains\nAmerican\nGluten-free Mains\nStovetop Seafood\nCrab"
}