{
  "url": "https://www.seriouseats.com/masala-chai-shortbread-recipe",
  "image_url": "https://www.seriouseats.com/thmb/egPhGfhfOmSxu6D5TsDh1JjdThM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121210-james-masala-chai-shortbread-893cf86efc064338bb8f93ae215c4f45.jpg",
  "tags": [
    "Cookies",
    "Baking"
  ],
  "title": "Masala Chai Shortbread Recipe",
  "full_text": "Masala Chai Shortbread Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n15 mins\nChilling Time\n30 mins\nTotal\n80 mins\nMakes\n30 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nall-purpose flour\n1/4\nteaspoon\nsalt\nLeaves\nfrom\n5\nblack tea bags\n(I used Twinings English Breakfast)\nHeaping\n1/4\nteaspoon\nfreshly toasted and\nground cardamom\n1/8\nteaspoon\nfreshly grated\nnutmeg\n1/8\nteaspoon\nfreshly grated\ncinnamon\n1/16\nteaspoon\nfreshly\nground black pepper\n1\nstick\n(\n4\nounces\n)\nunsalted butter\n, room temperature\n1/4\ncup\nsugar\nDirections\nSift the flour, salt, tea leaves, cardamom, ginger, nutmeg, cinnamon, and black pepper into a medium bowl.\nAdd the butter and sugar to the bowl of a stand mixer fitted with the paddle attachment and beat on medium speed until light and fluffy, about 3 minutes. Add the flour mixture and mix on the lowest speed until just combined.\nTransfer the dough to a large sheet of plastic wrap and roll into a log about 1 1⁄2” thick. Wrap well and freeze for 30 minutes or refrigerate for at least an hour. If you want to cut the dough into shapes, form the dough into a disk, wrap well, and refrigerate for at least one hour.\nHeat your oven to 325°F and line two baking sheets with parchment or Silpats.\nForm the cookies:\nIf you’ve rolled the dough into a log, use a sharp knife to cut it into slices about 3/8” thick, the most important thing being that all the slices are of even thickness. If you’re cutting out the cookies, lightly flour your work surface and roll it out about 3/8” thick and cut out shapes using a cookie cutter. Gently re-roll the scraps and repeat.\nBake until the edges are barely golden, about 15 minutes. Cool the cookies on the sheet completely, then transfer to an airtight container. The cookies last about two weeks at room temperature but will keep longer if you refrigerate or freeze them.\nCookies\nBaking"
}