{
  "url": "https://www.seriouseats.com/masa-ball-soup-corn-matzo-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LxMGhGcdr8x_3R5qvSuo163UUZc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150414-massa-ball-soup-daniel-gritzer-12-2d7396b068c04103a47843f8949a5c23.jpg",
  "tags": [
    "Soups",
    "Mexican",
    "Gluten-free Snacks & Appetizers",
    "Stovetop",
    "Cinco de Mayo"
  ],
  "title": "Masa Ball Soup (Corn Dumplings in Chicken Soup) Recipe",
  "full_text": "Masa Ball Soup (Corn Dumplings in Chicken Soup) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nActive\n25 mins\nChilling Time\n30 mins\nTotal\n95 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\neggs\n, beaten\n1/4\ncup\nseltzer\nor water\n1/4\ncup\nlard\n,\nschmaltz\n(\nrendered chicken fat\n) or\nneutral oil\nlike\nvegetable\nor\ncanola oil\n(see note)\n1\ncup\nmasa harina para tamales\n(see note)\n1\nteaspoon\nbaking powder\n1\nteaspoon\nkosher salt\n, plus more to taste\nFreshly ground black pepper\n3\nquarts\nhomemade\nor store-bought\nlow-sodium chicken stock\n1\nmedium\ncarrot\n, cut into 1/4-inch dice\n1\nrib\ncelery\n, cut into 1/4-inch dice\n3/4\ncup\n1/4-inch diced\nbutternut squash\n1/4\ncup\ncilantro leaves and tender stems\n1\njalapeño\nor\nSerrano pepper\n, thinly sliced\n1\nlime\ncut into wedges, for serving\nDirections\nIn a large mixing bowl, combine eggs with seltzer and schmaltz or oil. In a small bowl, stir together masa harina with baking powder, salt, and pepper. Add dry ingredients to wet ingredients and stir to combine thoroughly. Refrigerate uncovered for 30 minutes.\nMeanwhile, divide stock evenly between two pots, season both to taste with salt, and bring to a simmer. Add diced carrots, celery, and squash to one pot and simmer until just tender. Set aside.\nUsing wet hands, and re-wetting hands as necessary, form masa mixture into 1- to 1 1/2-inch balls, and add to simmering pot of stock that doesn't have the vegetables (the mixture may feel a little soft, but should form balls easily enough). When all masa balls are added, cover and simmer until cooked through, 30 to 45 minutes.\nCooked masa balls\ncan be kept warm in their broth until ready to serve.\nReheat both the vegetable pot and the masa-ball pot. Using a slotted spoon, transfer masa balls to serving bowls (you should have at least 3 per bowl); strain masa ball cooking broth with a fine-mesh strainer into the pot with the remaining broth and vegetables. Ladle hot broth with vegetables into each bowl and garnish with cilantro and jalapeño or Serrano peppers. Serve, passing lime wedges at the table.\nSpecial Equipment\nFine-mesh strainer\nNotes\nMasa harina para tamales is a corn-based flour used for making tamales that can be found in most Latin markets or well-stocked supermarkets. If you can't find it, regular masa harina can be used in its place.\nLard will deliver the most Mexican flavor, while schmaltz keeps things more in line with traditional matzo balls; canola or vegetable oil will yield the most neutral results.\nRead More\nSopa de Albóndigas de Pollo (Nicaraguan Chicken Meatball Soup) Recipe\nChicken-Stuffed Matzo Balls\nBasic Chicken Stock\nSoups\nMexican\nGluten-free Snacks & Appetizers\nStovetop\nCinco de Mayo"
}