{
  "url": "https://www.seriouseats.com/mascarpone-no-churn-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/sGfR_Ki-2jfCdklPkic8in3vGJo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190429-mascarpone-no-churn-ice-cream-vicky-wasik-9-50b1aac40a064569b9d4a7797e47888e.jpg",
  "tags": [
    "Ice Cream",
    "Gluten-free Desserts",
    "Stovetop",
    "Mascarpone",
    "Heavy Cream"
  ],
  "title": "No-Churn Mascarpone Ice Cream Recipe",
  "full_text": "No-Churn Mascarpone Ice Cream Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nActive\n30 mins\nFreezing Time\n8 hrs\nTotal\n8 hrs 40 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nmascarpone\n(about\n1\ncup\n;\n225\ng\n)\n2\nounces\nheavy cream\n(about\n1/4\ncup\n;\n55\ng\n)\n1/4\nounce\nvanilla extract\n(about\n1/2\ntablespoon\n;\n7\ng\n)\n3\nlarge\neggs\n(about\n5 1/2\nounces\n;\n155\ng\n)\n3\nounces\nsugar\n(shy\n1/2\ncup\n;\n85\ng\n)\n1\nounce\nlight brown sugar\n, or\nnatural sugar\nsuch as\nDemerara\nor\nturbinado\n, et cetera (about\n2\ntablespoons\n;\n30\ng\n)\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use about half as much by volume or the same weight\nDirections\nIn the bowl of a stand mixer fitted with a whisk attachment, whip mascarpone, cream, and vanilla until thick enough to hold stiff peaks; the time this step takes will vary depending on the power of a given mixer, so keep a close eye on the process. Transfer to a large, nonreactive container, such as a 2-quart baking dish (this will be used to hold the ice cream later on), then cover and refrigerate until needed. Rinse bowl and whisk attachment (no need to fully wash), then wipe dry before reusing in step 2.\nFill a large pot or Dutch oven with a few inches of water; bring to a boil, then lower heat to maintain a simmer/steady supply of steam. Place eggs, sugar, brown sugar, and salt in the stand mixer bowl and stir with a flexible spatula to combine. Set bowl over the steaming pot, using a crumpled strip of foil formed into a ring to act as a booster seat so that the bowl does not touch the bottom or sides of the pot. Cook, stirring and scraping constantly, until egg/sugar mixture has warmed to 160°F (71°C), about 5 minutes. This should not take significantly longer than 5 minutes; major delays simply indicate insufficient heat/lack of steam.\nSerious Eats / Vicky Wasik\nTransfer egg/sugar mixture to a stand mixer fitted with the whisk attachment and whip on high speed until the mixture is foamy, more than quadrupled in size, and thick enough to briefly mound up like soft-serve ice cream when dropped from the whisk, between 5 and 8 minutes depending on the horsepower of the mixer (see notes).\nSerious Eats / Vicky Wasik\nUsing a balloon whisk, add whipped mascarpone and whisk gently by hand to combine, working to homogenize the whipped custard without deflating or over-mixing. Scrape into the now-chilled container and cover with a layer of plastic wrap pressed directly against the surface of the ice cream. To protect the ice cream from freezer odors, cover again with a sheet of foil, or a lid if the container has one. Freeze until firm enough to scoop. The freezing time required will vary depending on the size and material of the container, but expect this to take 6 to 8 hours. Once it is cold, scoop like ice cream and serve in chilled dishes.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nDutch oven\n,\ndigital thermometer\nNotes\nIf you've had trouble foaming eggs in the past,\nyour stand mixer's bowl-to-beater clearance may need adjusting\n.\nMake-Ahead and Storage\nWith a layer of plastic wrap pressed directly against the surface of the ice cream, plus a secondary lid or layer of foil, the ice cream will keep up to three weeks in the freezer.\nRead More\nNo-Churn Vanilla Ice Cream\nNo-Churn Chocolate Ice Cream\nHazelnut Mascarpone Ice Cream\nLemon Mascarpone Gelato\nIce Cream\nGluten-free Desserts\nStovetop\nMascarpone\nHeavy Cream"
}