{
  "url": "https://www.seriouseats.com/mast-o-khiar-persian-yogurt-with-cucumber-recipe-8424023",
  "image_url": "https://www.seriouseats.com/thmb/Z-pzgAkaUq4a0NLiGDLd5soCgww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-Mast-o-Khiar-NaderMehravari-hero-a225e9704b134537af247d5f07c754c7.jpg",
  "tags": [
    "The Latest",
    "Dips",
    "Cucumbers",
    "Middle Eastern",
    "Condiments & Sauces"
  ],
  "title": "Māst-o-Khiār (Persian Yogurt with Cucumber)",
  "full_text": "Māst-o-Khiār (Persian Yogurt with Cucumber)\nClose\nJump to recipe\nPrep\n10 mins\nTotal\n10 mins\nServes\n8\nMakes\n4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n4\nPersian cucumbers\nor\n1\nEnglish cucumber\n(about\n14\nounces\n;\n400\ng\ntotal), peeled (see notes)\n2\ncups\n(\n475\ng\n)\nplain yogurt\n(see notes)\n2\nteaspoons\ncrushed\ndried mint leaves\n(see notes), plus extra for garnish\n1/2\nteaspoon freshly\nground black pepper\nKosher salt\nDirections\nDice the peeled cucumber into 1/4-inch (0.5cm) pieces. Alternatively, shred the cucumber on the large holes of a box grater.\nSerious Eats / Nader Mehravari\nIn a large mixing bowl, stir together the cucumber, yogurt, mint, and pepper. Season with salt to taste. Transfer to a serving dish and sprinkle with additional mint for garnish, if desired. Serve.\nSerious Eats / Nader Mehravari\nNotes\nEnglish cucumber may be substituted for Persian cucumber with an equal amount by weight. Information on how to dice cucumbers can be found\nhere\n.\nRegular (undrained) yogurt or Greek (drained) yogurt will both work in this recipe. The drained yogurt will produce a thicker māst-o-khiār perfect as an appetizer or a dip. Regular undrained yogurt will make a thinner and more pourable māst-o-khiār that is great served as an accompaniment to a rice dish or grilled meat. You can use full- or partial-fat yogurt; keep in mind that full-fat yogurt will produce a richer result, but more important than anything is to use an appropriately tangy yogurt if at all possible (see headnote for more guidance on yogurt type).\nMake Sure to use dried spearmint, and not dried peppermint for this recipe.\nWhen it comes to the amount of cucumber and yogurt, māst-o-khiār is a very flexible recipe in the sense that you do not need to be exact.\nMake-Ahead and Storage\nMāst-o-khiār always tastes better the day after it has been made. Simply store it in a covered container in the refrigerator.\nIf you do make it a day ahead of time, and want to increase its natural tanginess, leave it in a covered container on your kitchen counter at room temperature overnight before transferring the container to your refrigerator. The yogurt will naturally ferment a bit more.\nMāst-o-khiār keeps very well: Store any leftovers in an airtight container in the refrigerator for up to 10 days. I almost always make a double batch.\nThe Latest\nDips\nCucumbers\nMiddle Eastern\nCondiments & Sauces",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mst-o-khir-persian-yogurt-with-cucumber.webp?"
}