{
  "url": "https://www.seriouseats.com/mazagran-coffee-iced-coffee-lemonade-8647476",
  "image_url": null,
  "tags": [
    "Coffee",
    "The Latest",
    "Portuguese"
  ],
  "title": "Mazagran Coffee (Iced Coffee Lemonade)",
  "full_text": "Mazagran Coffee (Iced Coffee Lemonade)\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nServes\n1 serving\nMakes\n1 drink\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\ncold concentrated\nor strongly\nbrewed coffee\n, such as\ncold brew concentrate\n,\nespresso\n,\nmoka pot\n, or\nAeropress\n(see notes)\n1/4\ncup\n(\n60\nml\n) freshly squeezed\nlemon juice\n, plus more to taste\n2\ntablespoons\n(\n25\ng\n)\ngranulated\nor\nsuperfine sugar\nor\n3\ntablespoons\n(\n45\nml\n)\nsimple syrup\n(see notes)\nScant\npinch\nkosher salt\nLemon\nrounds, for garnish\nIce\nOptional:\n1 to 2\nfluid ounces\nwhite\nor\naged rum\nDirections\nIn a serving glass, combine concentrated coffee with lemon juice, sugar, and salt, stirring to combine and fully dissolve sugar (if not using simple syrup). Taste, then adjust flavor as desired with additional lemon juice and/or sugar until the flavor is strong but properly balanced between sweet, tart, and coffee. Add ice, dilute to taste with cold water, and garnish with lemon rounds. If desired, spike with rum to taste. Serve.\nSerious Eats / Amanda Suarez\nNotes\nThe type of coffee you use and how concentrated it is will have a big effect on how much lemon juice and sugar to add; this is a variable this recipe can not account for, so adjust accordingly. If you're using a regular-concentration coffee, start by doubling the amount of coffee relative to the lemon juice and sugar (so: 1/2 cup coffee for each 1/4 cup lemon juice and 2 tablespoons sugar), then adjust to taste; you may not need to dilute this coffee beyond the addition of ice.\nYou can make a 1:1 simple syrup by dissolving equal volumes of granulated sugar and water. While the sugar will dissolve the most quickly if heated with the water, you then have to allow it to cool; it's faster to simply combine the sugar and cold water and shake or stir until fully dissolved.\nMake-Ahead and Storage\nThe coffee concentrate and simple syrup can be refrigerated separately for up to 2 weeks, but the lemon juice should be squeezed fresh and the drink should be mixed to-order.\nCoffee\nThe Latest\nPortuguese"
}