{
  "url": "https://www.seriouseats.com/mcdonalds-style-eggnog-shake-recipe-8757946",
  "image_url": "https://www.seriouseats.com/thmb/CcmHVM5GM_ekROJbwpxg9rF25lg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__11__20111128eggnogrecipe-5fcc1fa85ae44860b734bb4e6ee5fb66.jpg",
  "tags": [
    "Christmas Desserts",
    "Desserts",
    "Christmas",
    "Winter Desserts"
  ],
  "title": "McDonald's-Style Eggnog Shake",
  "full_text": "McDonald's-Style Eggnog Shake\nClose\nJump to recipe\nPrep\n0 mins\nCook\n15 mins\nSteeping, Chilling, and Churning Time\n7 hrs 15 mins\nTotal\n7 hrs 30 mins\nMakes\n4 shakes\nCook Mode\n(Keep screen awake)\nIngredients\n12\nfluid\nounces\nwhole milk\n(355ml; 1 1/2 cups)\n8\nfluid\nounces\nheavy cream\n(240ml; 1 cup)\n1\nTahitian\nvanilla bean\n, split and scraped; seeds reserved\nOne 3-inch\ncinnamon stick\n3\nwhole\nnutmeg\n, roughly chopped\n3\nounces\n(85g)\negg yolks\n(from about 5 large eggs)\n7\nounces\ngranulated\nsugar\n(198g; about 1 cup)\n3/4\nteaspoon\nDiamond Crystal kosher\nsalt\n; for table salt, use half as much by volume\n2 ounces\nFrangelico\n(see notes)\nFor the Whipped Cream Mix-In/Topping:\n12\nfluid\nounces\nwhipped cream\n(355ml; 1 1/2 cups)\n2\nounces\nlight\nbrown sugar\n(56g; about 1/4 cup)\n4\nmaraschino cherries\n(optional)\nDirections\nPrepare Shake Base\n: In a medium pot, bring milk and cream to a simmer together with vanilla bean, cinnamon and nutmeg. When mixture begins to simmer, remove from heat and cover with a lid. Steep for one hour.\nMeanwhile, place egg yolks in a medium bowl. Add granulated sugar gradually, whisking to incorporate. (It's a lot of sugar, so don't dump it in all at once or it will be difficult to incorporate.) Whisk in salt.\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice; set aside.\nReturn dairy to a simmer over medium heat, using a spatula to scrape out heavily flavored cream from inside vanilla pod. Remove vanilla bean and spices; discard.\nWhisk hot cream into egg yolks, one ladle at a time, until egg mixture is quite warm. Whisk egg mixture into pot of cream. Reduce heat to medium low, using a flexible spatula to stir and scrape the bottom and sides of the pot constantly to prevent curdling.\nCook until mixture registers 145ºF (63ºC) on an instant-read thermometer. Remove from heat immediately and, using a fine-mesh sieve, strain mixture into a large bowl. Stir in Frangelico and vanilla extract. Set bowl in prepared ice bath and let cool, about 30 minutes. Remove mixture from ice bath and refrigerate, covered, until thoroughly chilled; about 6 hours.\nWhen ready, process chilled ice cream base in ice cream maker just until it begins to thicken. Remember, a proper milkshake is made by blending ice cream with milk; we're cutting straight to the chase by just churning until the base takes on a shake-like texture. Exactly how long this takes will vary from maker to maker, but in my machine that's about 15 minutes.\nTo Finish the Shake:\nWhile the shake base is churning, combine brown sugar and whipped cream in a medium bowl. Using a hand or stand mixer, whip cream and brown sugar mixture on medium speed until cream holds stiff peaks, 2 to 3 minutes. Use a rubber spatula to transfer about 4 ounces (113g) to a pastry bag fitted with a large star tip. Set aside.\nPlace remaining 8 ounces (226g) whipped cream in a large bowl. Shut off ice cream maker and pour or scoop thickened base and additional alcohol, if using, into bowl of whipped cream. (See notes.) Using a flexible spatula, fold thickened base into whipped cream to combine.\nPour shake into 4 glasses and, using prepared piping bag, top each with a swirl of whipped cream. Garnish each glass with a maraschino cherry, if desired.\nSpecial Equipment\nIce cream maker\n,\nmixer\n, pastry bag, large star tip\nNotes\nTwo ounces of Frangelico split four ways isn't enough booze to get the party started, if you know what I mean. At any rate, I didn't include it for for its alcohol, but for its slightly nutty flavor that matches the odd aftertaste found in McDonald's Egg Nog shake. If you don't consume alcohol, replace it with an extra two ounces of milk plus 1/4 teaspoon almond extract; it'll get the job done.\nIf you\ndo\nconsume alcohol, feel free to mix in a shot or two of your favorite holiday spirit along with the whipped cream at the end. Add it earlier and you'll prevent the shake from thickening in the ice cream maker.\nAll measurements are in weights, as volume measures can be very imprecise. I strongly recommend using a scale for all pastry projects.\nRead More\nCopycat Shamrock Shake\nMalted Chocolate Milkshake\nClassic Eggnog\nChristmas Desserts\nDesserts\nChristmas\nWinter Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mcdonalds-style-eggnog-shake.webp?"
}