{
  "url": "https://www.seriouseats.com/melting-cabbage-recipe-11682376",
  "image_url": "https://www.seriouseats.com/thmb/VyuDA_RRtiBEsZqpTu2mp1Hir0c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250213-SEA-MeltingCabbage-JenCausey-Beauty1-72-5edf1c4a147345ea958a83847aaa12cb.jpg",
  "tags": [
    "Cabbage",
    "The Latest",
    "Braising & Stewing"
  ],
  "title": "Melting Cabbage",
  "full_text": "Melting Cabbage\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs\nTotal\n2 hrs 15 mins\nServes\n4\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n2-pound (\n907\ng\n)\nhead\ngreen cabbage\n, any bruised outermost leaves removed\n1/4\ncup\n(\n60\nml\n)\nneutral cooking oil\nsuch as canola oil, divided\n1 1/2\nteaspoons\nDiamond Crystal kosher salt\n, divided, plus more to taste; for table salt, use half as much by volume\n1/2\nteaspoon\nfreshly\nground black pepper\n, divided, plus more to taste\n5\ntablespoons\n(\n70\ng\n)\nunsalted butter\n, divided\n1\nsmall\nyellow onion\n(\n6\nounces\n;\n170\ng\n), thinly sliced\n5\nlarge\ncloves garlic\n, thinly sliced (about\n3\ntablespoons\n)\n1/2\ncup\n(\n120\nml\n)\ndry sherry\n1 1/2\ncups\n(\n360\nml\n)\nunsalted\nhomemade chicken\nor\nvegetable stock\nor store-bought unsalted chicken or vegetable broth\nFour\nthyme\nsprigs\n, plus more fresh leaves for garnish\n2\ntablespoons\n(\n30\nml\n)\nstone-ground mustard\n2\nteaspoons\n(\n10\nml\n)\nhoney\n1/2\nteaspoon\ndried\nItalian seasoning\nor a combination of\n1/4\nteaspoon dried oregano plus\n1/4\nteaspoons\ndried basil\n(see notes)\nDirections\nAdjust oven rack to middle position and preheat oven to 375°F (190℃).\nSlice cabbage in half through core. Cut each half through core into four wedges (approximately 2 inches thick each), keeping the stem intact. In a 12-inch stainless steel or cast iron skillet, heat 2 tablespoons oil over medium heat until shimmering. Add 4 cabbage wedges; cook until browned on both sides, 3 to 5 minutes per side. Transfer to a large plate; sprinkle both sides evenly with 1/4 teaspoon salt and 1/8 teaspoon pepper. Repeat with remaining 2 tablespoons oil and remaining cabbage wedges; then sprinkle both sides evenly with 1/4 teaspoon salt and 1/8 teaspoon pepper. Wipe skillet dry.\nSerious Eats / Jen Causey\nHeat 2 tablespoons butter in now-empty skillet over medium heat until melted; add onion and garlic and cook, stirring often, until onion is softened and just starting to brown, 2 to 4 minutes. Add sherry and cook, stirring frequently, until nearly evaporated, about 3 minutes. Increase heat to medium-high and add broth, thyme sprigs, mustard, honey, Italian seasoning, remaining 1 teaspoon salt, and remaining 1/4 teaspoon pepper. Cook, stirring occasionally, until boiling, about 3 minutes.\nSerious Eats / Jen Causey\nRemove skillet from heat, and carefully nestle seared cabbage wedges into skillet cut sides down, in a single layer, overlapping slightly if necessary.\nSerious Eats / Jen Causey\nCover and bake for 45 minutes. Uncover and flip cabbage wedges and continue to bake, uncovered, until cabbage is very tender and sauce is reduced, about 60 to 70 minutes. Remove from oven, transfer cabbage wedges to a platter, and keep warm. Wearing kitchen mitts when handling skillet, gradually stir remaining 3 tablespoons butter into sauce, 1 tablespoon at a time, until melted and well combined. Season to taste with salt and pepper, if needed. Return cabbage to skillet, or pour sauce over cabbage on serving platter. Garnish with thyme, and serve.\nSerious Eats / Jen Causey\nSpecial Equipment\n12-inch stainless-steel or cast iron skillet with lid\nMake-Ahead and Storage\nLeftovers can be refrigerated in an airtight container for up to 4 days.\nCabbage\nThe Latest\nBraising & Stewing",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/melting-cabbage.webp?"
}