{
  "url": "https://www.seriouseats.com/menudo-mexican-soup-red-chile-tripe-recipe",
  "image_url": "https://www.seriouseats.com/thmb/YSMmWNbcOm1XtXngVfp0ufcwTfE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/menudo-mexican-soup-red-chile-tripe-recipe-Beauty-03-FredHardy-01202023-03-5db3568bce8f442cb9593c684eada48d.JPG",
  "tags": [
    "Soups",
    "Mexican",
    "Beef Liver & Organ Meats",
    "Chile Pepper"
  ],
  "title": "Menudo Rojo (Mexican Red-Chile Tripe Soup)",
  "full_text": "Menudo Rojo (Mexican Red-Chile Tripe Soup)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n3 hrs 45 mins\nResting Time:\n40 mins\nTotal\n5 hrs\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Soup:\n2\npounds\n(\n907\ng\n)\nbeef honeycomb tripe\n2\ntablespoons\nfresh\nlime juice\n(from\n1\nlarge\nlime\n)\n2\ntablespoons\n(\n18\ng\n) plus\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n, divided, plus more to taste (for\ntable salt\n, use half as much by volume or the same weight)\n1\npork trotter\n(about\n1\npound\n5\nounces\n;\n600\ng\n), halved lengthwise\n1\ntablespoon\ndried oregano\n, preferably\nMexican oregano\n2\ndried\nbay leaves\n10\nmedium cloves\ngarlic\n(\n2 1/2\nounces\n;\n70\ng\ntotal), crushed, divided\n1\nlarge\nwhite onion\n(\n12\nounces\n;\n340\ng\n), chopped (about\n2\ncups\n), divided\n1\nteaspoon\ncumin seeds\n8\nmedium\ndried New Mexico chiles\n(about\n1.43\nounces\n;\n40\ng\ntotal; see note)\nOne\n29-ounce can\nwhite hominy\n, drained (about\n2 1/2\ncups\n)\nFor Serving:\nFresh lime wedges\nChopped white onion\nFresh cilantro\nSliced serrano chiles\nWarmed\nsoft corn tortillas\n, for serving\nDirections\nFor the Soup:\nWash and rinse tripe thoroughly in warm water. Place in a large bowl, then sprinkle with lime juice and 1 tablespoon (9g) salt, and scrub vigorously. Let soak 30 minutes, then rinse and wash the tripe again in warm water. Drain.\nSerious Eats / Fred Hardy\nCut tripe into 1- to 2-inch pieces. Place tripe and pork trotter in a large stockpot, cover with water by 2 inches, and bring to a boil. Boil for 5 minutes, then drain and rinse. If necessary, wipe out pot.\nSerious Eats / Fred Hardy\nReturn tripe and trotter to stockpot. Add 12 cups (2.8L) water, oregano, bay leaves, 6 garlic cloves, and half of the onion (about 1 cup). Bring to a boil over medium-high heat, skimming surface as needed; then reduce heat to medium-low and partially cover. Simmer gently until tripe is very tender, 2 to 3 hours.\nSerious Eats / Fred Hardy\nSet a large cast iron or stainless-steel skillet over medium heat. Add cumin seeds and toast, tossing often, until fragrant and slightly darkened, 2 to 3 minutes; remove from skillet and set aside. In same skillet, toast chiles until pliable and slightly darkened, 30 to 60 seconds per side.​​ Tear chiles open; remove and discard stems and seeds. Place chiles in a heatproof bowl, then submerge in boiling water. Cover and let soak until softened, about 15 minutes.\nSerious Eats / Fred Hardy\nRemove pork trotters and set aside until cool enough to handle; pick off any pieces of meat and return them to pot, discarding bones.\nSerious Eats / Fred Hardy\nDrain chiles and place them in a blender with remaining onion, 4 cloves garlic, and toasted cumin. Add 2 cups of simmering broth, and blend until very smooth, 1 to 2 minutes; to prevent the hot liquid from erupting violently when blending, make sure to open the vent on the blender lid, hold it covered with a clean kitchen towel, and start the blender at its lowest speed before increasing to high. Strain chile-broth mixture through a fine mesh sieve and stir it back into the soup, along with the hominy. Simmer until hominy is tender and flavors have melded, 20 to  30 minutes. Season to taste with additional salt, if desired.\nSerious Eats / Fred Hardy\nTo Serve:\nServe hot with condiments and tortillas on the side, to be used according to personal taste.\nSerious Eats / Fred Hardy\nSpecial Equipment\nBlender, fine-mesh strainer\nNotes\nCalifornia chiles can be substituted for the New Mexico chiles for less heat, as can guajillo chiles, for more heat.\nSoups\nMexican\nBeef Liver & Organ Meats\nChile Pepper"
}