{
  "url": "https://www.seriouseats.com/meringue-cupcakes-strawberry-nutella-recipe",
  "image_url": "https://www.seriouseats.com/thmb/AciT28tKoKp_Ba6YhpCUC1beOM4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120424-127677-LTE-Meringue-Cupcakes-Nutella-photo20Tara20Striano-PRIMARY-3d6442c84a3f49e5b4bf3788babe10fb.jpg",
  "tags": [
    "Desserts",
    "Cupcakes",
    "Strawberry"
  ],
  "title": "Meringue Cupcakes With Nutella and Strawberries Recipe",
  "full_text": "Meringue Cupcakes With Nutella and Strawberries Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs 30 mins\nActive\n30 mins\nTotal\n2 hrs 50 mins\nMakes\n12 cupcakes\nCook Mode\n(Keep screen awake)\nIngredients\nBaking spray\n8\nlarge\negg whites\n, at room temperature\n1\nteaspoon\nwhite vinegar\n1/4\nteaspoon\nsalt\n2\ncups\nsugar\n2\nteaspoons\ncornstarch\n2\nteaspoons\npure\nvanilla extract\n3/4\ncup\nNutella\n24\nstrawberries\n, hulled and sliced\nDirections\nAdjust oven rack to middle position and preheat oven to 200°F. Spray a 12-cup muffin tin with baking spray, then line tin with cupcake liners and once again lightly spray tin with baking spray, making sure to coat surface of tin.\nBeat whites, vinegar, and salt on medium-low speed until loosened, about 30 seconds. Increase speed to medium-high and beat until soft peaks form, 2 to 3 minutes. Combine sugar and cornstarch and, with mixer running, add to bowl 1 tablespoon at a time.\nOnce all the sugar mixture has been added, continue mixing until stiff, glossy peaks form, about 2 minutes longer. Add vanilla and beat just until combined.\nTransfer mixture to a pastry bag or large zipper-lock bag fitted with a 1/2-inch star or plain pastry tip. Pipe meringue in a circular motion, pressing tip into meringue as it pipes out, into prepared tin, mounding meringue about 1-inch above edge.\nBake cupcakes until firm and dry, about 1 1/2 hours, then, shut oven off and prop door open. Allow cupcakes to sit in oven an additional 1 hour.\nGently remove cupcakes from tins and, with a serrated knife, gently cut off tops at the point where the cupcake liner meets with the cupcake top’s base.\nFill each cupcake with 2 tablespoons Nutella and 2 sliced strawberries. If desired, serve with whipped cream or vanilla ice cream.\nSpecial equipment\n12-cup muffin tin, 12 paper cupcake liners, electric mixer, rubber spatula, pastry bag or large zipper-lock bag, 1/2-inch plain or star tip, serrated knife\nThis Recipe Appears In\nLet Them Eat: Meringue Cupcakes with Nutella and Strawberries\nDesserts\nCupcakes\nStrawberry"
}