{
  "url": "https://www.seriouseats.com/mexican-tuna-cake-recipe-8667152",
  "image_url": "https://www.seriouseats.com/thmb/DlEkre0bFLLHLOOOB2bNIcJfxeM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220511-Pastel-de-atun-hero-fixed2-6bb6bac2b9bf459fa9c1deb194f1afed.jpg",
  "tags": [
    "Tuna",
    "The Latest",
    "Mexican",
    "Summer"
  ],
  "title": "Pastel de Atún (Mexican Tuna Cake)",
  "full_text": "Pastel de Atún (Mexican Tuna Cake)\nClose\nJump to recipe\nPrep\n90 mins\nCook\n0 mins\nTotal\n90 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\n(5-ounce) cans\nwater-packed tuna\n(\n280\ng\n), such as\nyellowfin\n,\nchunk light\n, or\nskipjack\n, drained well\n2/3\ncup\n(\n160\nml\n)\nmedia crema\n(see note)\n2/3\ncup\ndrained canned red bell pepper strips\n(\n5 1/4\nounces\n;\n150\ng\n), plus extra for garnish (see note)\n1/2\ncup\nplain full-fat cream cheese\n(\n4\nounces\n;\n120\ng\n)\n2\nslices\n(\n36\ng\n)\nAmerican cheese\n, such as\nKraft singles\n1/3\ncup\n(\n2\nounces\n;\n60\ng\n)\ndrained canned pickled sliced jalapeño peppers\n(see note)\nKosher salt\n20\nslices\n(\n600\ng\n)\nwhite sandwich bread\n, such as\nBimbo\nor\nWonder Bread\n, crusts removed\nDirections\nIn a blender, combine tuna, media crema, pepper strips, cream cheese, and American cheese and blend until smooth, scraping down sides halfway through with a flexible spatula, about 1 minute. Working in batches, blend in jalapeño peppers until desired heat level is reached and a completely smooth sauce has formed. Season with salt to taste. Transfer sauce to a medium bowl.\nSerious Eats / Amanda Suarez\nUsing a small offset spatula, spread 1/2 cup sauce (115g) in an even layer that covers the bottom of a 8- by 8-inch square pan, then lay down four slices of bread on top of sauce, so that the edges are touching, forming a single solid layer. Repeat layering process with sauce and bread, making sure to spread the sauce evenly across bread and covering any exposed areas (the sauce should be absorbed by the bread without soaking it all the way through); you should have 5 layers. Cover top layer of bread evenly with remaining sauce, smoothing out any rough areas. Garnish top with pepper strips as desired. Refrigerate uncovered for at least 1 hour and up to 3 hours.\nSerious Eats / Amanda Suarez\nSlice cake into quarters or eighths and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nBlender, 8- by 8-inch square pan, small offset spatula.\nNotes\nIf desired, you can assemble pastel on a 10- or 12-inch flat round or square plate. In Step 2, spread 1/3 cup sauce (70g) into a roughly 7-inch square in the center of the plate. Lay four slices of bread on top of sauce, forming a single solid layer. Repeat layering process with sauce and bread. Cover top layer of bread and all sides evenly with remaining sauce, and refrigerate.\nThe quantities of pickled jalapeño, red pepper strips, and media crema are about one 7-ounce can of La Costeña sliced jalapeño, one 7-ounce can of La Costeña pimiento morrón, and one 7.6-ounce can of Nestlé media crema (respectively). You may be able to find these products in the Latin section of your supermarket.\nMedia crema, a thickened cream with 20% to 25% fat, is a staple in Mexican grocery stores. The Nestlé version of media crema is sometimes labeled “table cream” and is acceptable to use in this recipe; you can find it in well-stocked supermarkets as well as online. However, other products labeled “table cream,” such as Cacique Crema Mexicana Table Cream, have a thinner consistency and a tangy, slightly fermented flavor; they will not work in pastel de atún.\nCanned red pepper (pimiento morrón) is a bit harder to find than the other ingredients, but you can substitute with an equal weight of store-bought or homemade roasted red peppers, cut into 1/4-inch-wide strips.\nFor the pickled jalapeños, you can use an equal weight of thinner-sliced, nacho-style pickled jalapeños or whole pickled jalapeños that have been stemmed and cut into 1/2-inch-wide rounds.\nMake-Ahead and Storage\nPastel de atún can be prepared ahead of time and refrigerated in an airtight container for up to 1 week. While leftovers are excellent, it will become more dense over time.\nTuna\nThe Latest\nMexican\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pastel-de-atn-mexican-tuna-cake.webp?"
}