{
  "url": "https://www.seriouseats.com/mexican-key-lime-pie-ice-pops-recipe-8676413",
  "image_url": "https://www.seriouseats.com/thmb/p8_NcMBY0vXBvbPzuEawcv16I1w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-bolis-de-pay-de-limon-mexican-key-lime-pie-ice-pops-recipe-Amanda-Suarez-final-hero-1996ec860e5c474d84265725e6ac80eb.jpg",
  "tags": [
    "Condensed Milk",
    "The Latest",
    "Mexican",
    "Popsicles",
    "Milk"
  ],
  "title": "Bolis de Pay de Limón (Mexican Key Lime Pie Ice Pops)",
  "full_text": "Bolis de Pay de Limón (Mexican Key Lime Pie Ice Pops)\nClose\nJump to recipe\nPrep\n25 mins\nCook\n0 mins\nFreezing Time\n4 hrs\nTotal\n4 hrs 25 mins\nServes\n10 servings\nMakes\n10 bolis (see note)\nCook Mode\n(Keep screen awake)\nIngredients\n14\nounces\nwhole milk\n(1 3/4 cups; 395g)\nOne 14-ounce (\n397\ng\n) can\nsweetened condensed milk\n6 3/4\nounces\nplain full-fat\ncream cheese\n(about 3/4 cup; 190g)\n5 2/3\nounces\nsugar\n(about 3/4 cup; 160g)\n1/2\nteaspoon\nvanilla extract\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt, use half as much by volume\n1/2\ncup\n(120ml) fresh\nkey lime juice\n(about 8 to 12 key limes) plus 1 tablespoon (5g) grated zest, divided (see note)\n34\ngalletas Marías\n(204g), divided (see note)\nDirections\nIn a countertop blender, process whole milk, condensed milk, cream cheese, sugar, vanilla, and salt until smooth, about 15 seconds. Add lime juice and immediately blend until thoroughly combined, about 10 seconds.\nSerious Eats / Amanda Suarez\nAdd zest and 4 cookies (24g; see note), and pulse to incorporate zest and break cookies up into large crumbs, about 2 1-second pulses.\nSerious Eats / Amanda Suarez\nUsing your hands, break up 3 cookies (18g) into large pieces and add to one boli bag. Slowly pour in key lime mixture until the bag is about half full (roughly 4 ounces; 115g), then gently squeeze the bottom of the bag to wet the cookies. Pinch the top of the bag close and tie it off with a knot (make sure to leave space between the mixture and the knot as the mixture will expand as it freezes). Repeat with remaining key lime pie mixture and cookies.\nSerious Eats / Amanda Suarez\nFreeze until solid, at least 4 hours. To serve, trim one corner from the bottom of the bag and enjoy immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nBlender, 3- by 10-inch bolis bags\nNotes\nThe key lime mixture can also be frozen in popsicle molds and will yield approximately 14 3-ounce popsicles (you can also make a half recipe to yield less popsicles). To freeze in a popsicle mold, break up cookies into large pieces and add to molds (depending on the size of your molds, I’d recommend reducing the amount of cookies used). Divide key lime mixture evenly between molds, then use a skewer or cake tester to combine mixture with cookies. Freeze until solid, at least 4 hours. To unmold, follow your popsicle mold's instructions.\nIf you’re not able to find good-quality key limes, Persian limes work just fine. Persian limes have a bit more punch than fresh key limes, so dial the zest back to about 1 packed teaspoon (just under half a Persian lime). It will take about four Persian limes to yield a  1/2 cup of juice.\nGalletas Marías are crisp, basic vanilla cookies that can be found in many Latin supermarkets. If you can’t get your hands on them, any crisp vanilla cookie (like vanilla wafers) will work; just be sure to substitute by equal weight. I have a suspicion that substituting graham crackers would work and might incidentally transport me back to my childhood—I’ve always loved graham cracker crumb crusts. But for the purposes of this recipe, I stuck with the tried-and-true galleta María for a more traditional boli flavor profile.\nMake-Ahead and Storage\nKey lime pie bolis can be kept frozen for up to 1 month.\nCondensed Milk\nThe Latest\nMexican\nPopsicles\nMilk",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bolis-de-pay-de-limn-mexican-key-lime-pie-ice-pops.webp?"
}