{
  "url": "https://www.seriouseats.com/meyer-lemon-layer-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/tSe5oKNODk1R8H0nlpvpDIJQeUk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121218-127677-Meyer-Lemon-Cake-PRIMARY-ef05ca8ce797413e84ab97c1a06e0b58.jpg",
  "tags": [
    "Layer Cake",
    "Lemon",
    "Custards, Mousses & Puddings",
    "Summer Desserts"
  ],
  "title": "Meyer Lemon Cake Recipe",
  "full_text": "Meyer Lemon Cake Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n40 mins\nActive\n60 mins\nCooling Time\n70 mins\nTotal\n2 hrs 30 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nBaking spray\n1 3/4\ncups\n(about\n12 1/4\nounces\n)\ngranulated sugar\n2\ntablespoons\ngrated\nzest\nplus\n1/4\ncup\njuice\nfrom about\n3\nMeyer lemons\n2 1/4\ncups\n(about\n9\nounces\n)\ncake flour\n2\nteaspoons\nbaking powder\n1\nteaspoon\nbaking soda\n1\nteaspoon\nsalt\n3/4\ncup\nmilk\n, at room temperature\n1\nteaspoon\npure\nvanilla extract\n4\nlarge\neggs\n, separated and at room temperature\n8\nounces\n(\n2\nsticks\n)\nunsalted butter\n, at room temperature\nFor the Meyer Lemon Curd:\n3/4\ncup\n(about\n5 1/4\nounces\n)\ngranulated sugar\n3\ntablespoons\ngrated\nzest\nplus\n1/2\ncup\njuice\nfrom\n4 to 5\nMeyer lemons\n2\nteaspoons\ncornstarch\n6\nlarge\neggs\n, at room temperature\n2\nlarge\negg yolks\n, at room temperature\n1/4\nteaspoon\nsalt\n2\nounces\n(\n1/2\nstick\n)\nunsalted butter,\ncut into small pieces\n2\ntablespoons\nconfectioners' sugar\nDirections\nFor the Cake:\nLightly coat two 9-inch round cake pans with baking spray. Line bottoms with parchment paper rounds and coat once again with baking spray. Adjust oven rack to middle position and preheat oven to 350°F.\nPulse 1 1/2 cups sugar and zest in food processor until no zest strands remain and sugar is damp and yellow. Alternatively, rub the zest into the sugar with fingertips.\nWhisk flour, baking powder, baking soda, and salt together in medium bowl; reserve. Combine milk, lemon juice, and vanilla in glass measuring cup; reserve.\nIn large bowl, whip egg whites with whisk attachment on medium speed until soft peaks form, about 2 minutes. Gradually add remaining 1/4 cup sugar and continue whipping until stiff peaks form, 1 to 2 minutes longer. If you used the stand mixer bowl, transfer whites to separate bowl.\nBeat butter and lemon sugar with paddle attachment on medium speed until light and fluffy, about 2 minutes. Add egg yolks, one at a time, beating well after each addition. Add flour mixture in three additions, alternating with milk mixture. Fold in egg whites and divide batter equally between prepared pans.\nBake until tester inserted in center of cakes comes out clean, 20 to 25 minutes. Transfer cakes to cooling racks and cool 10 minutes in pans. Turn cakes out directly onto racks, peel off and discard parchment, then invert so the tops are facing up. Cool completely, about 1 hour.\nFor the Meyer Lemon Curd:\nPulse the zest and sugar in food processor until no zest strands remain and sugar is damp and yellow. Alternatively, rub the zest into the sugar with fingertips.\nWhisk the lemon sugar, cornstarch, eggs, egg yolks, and salt together in a medium heavy-bottomed saucepan. Add juice and cook over medium-low heat, whisking constantly, until thickened and the consistency of pudding, 8 to 10 minutes. Once mixture reaches the boil, continue cooking and whisking for 2 minutes longer.\nStrain curd into medium bowl. Add butter and stir until completely incorporated. Place a piece of plastic wrap directly on the surface of the custard and refrigerate until completely chilled. Alternatively, place bowl in ice bath and stir constantly until custard is completely cooled, about 10 minutes.\nTo Assemble:\nWith a serrated knife, cut each cake in half to create 4 equal layers. Place one layer on a serving dish or cake stand and spread with one third (about 1/2 cup) of cooled curd. Repeat with remaining cake layers and curd.\nSift confectioners’ sugar over cake. Serve.\nSpecial equipment\nTwo 9-inch round cake pans, parchment paper, food processor (optional), electric mixer, two cooling racks, fine-mesh strainer, medium heavy-bottomed saucepan, serrated knife\nLayer Cake\nLemon\nCustards, Mousses & Puddings\nSummer Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/meyer-lemon-cake-recipe.webp?"
}