{
  "url": "https://www.seriouseats.com/microwave-rendered-chicken-fat-5202412",
  "image_url": "https://www.seriouseats.com/thmb/pL9Q0ECFQbl0jyrlIyWuLK04XEo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7-16-2021-chicken-skin-45--seriouseats-31da07f188be435697c50210c305968c.jpg",
  "tags": [
    "Poultry Fats",
    "Condiments & Sauces",
    "The Latest"
  ],
  "title": "Microwave-Rendered Chicken Fat",
  "full_text": "Microwave-Rendered Chicken Fat\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nTotal\n30 mins\nServes\n4\nto 8 servings\nMakes\n1\nto 5 tablespoons\nCook Mode\n(Keep screen awake)\nIngredients\n1/2 to 4 1/2\nounces\n(\n25-125\ng\n)\nchicken skin\n, cut into 1-inch strips (see note)\nDirections\nPlace chicken skin in high-sided microwave-safe container, such as a bowl, spreading it out as evenly as possible in the bottom of the container. Set microwave power setting to 30% of full power and cook for 25 minutes, flipping mass of cooked chicken skin once halfway through cooking (optional, see note).\nSho Spaeth\nUsing oven mitts, carefully remove vessel from microwave and pour rendered fat into a clean heatproof container (discard crispy chicken crackling, or reserve for another use; see note). Rendered fat can be used immediately or can be set aside to cool to room temperature, then covered and stored in the refrigerator.\nYup, it's chicken fat.\nSho Spaeth\nSpecial Equipment\nMicrowave oven.\nNotes\nA whole chicken breast can have anywhere from 0.5 ounces to 1.5 ounces (25g-50g) of chicken skin, depending on the weight of the bird and the way it processed. This recipe was tested with a range of chicken skin weights, and the method\nshould\nbe applicable to larger amounts of chicken skin with slight variations in cook time, but that has not been tested thoroughly.\nThe more finely cut up the chicken skin is, the more efficient the fat rendering will be. However, the real benefit to finely cutting up the chicken skin is that the chicken skin chip that results from renderings finely cut up skin is more enjoyable to eat.\nThe same goes for flipping the puck that the chicken skin becomes after the initial rendering. For a more fully crispy chicken skin chip, flip the puck of chicken skin over about halfway through the rendering process. And, as with anything cooked/dehydrated in hot liquid fat, if you plan on eating the chicken skin chip, salt it immediately after removing it from the fat.\nMake-Ahead and Storage\nRendered chicken fat will keep in the refrigerator for up to 2 weeks in an airtight container, and up to 6 months in the freezer.\nPoultry Fats\nCondiments & Sauces\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/microwave-rendered-chicken-fat.webp?"
}