{
  "url": "https://www.seriouseats.com/midwestern-chicken-and-noodles-recipe-11698424",
  "image_url": "https://www.seriouseats.com/thmb/u73cHB-tEN_ReGIxo0yKfJzagHU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250317SEA-MidwesternChickenandNoodles-TwoBites-15-796c5d7418b9439e8eca0dc684e830f0.jpg",
  "tags": [
    "Comfort Food",
    "The Latest",
    "Chicken Mains",
    "Midwestern"
  ],
  "title": "Midwestern Chicken and Noodles",
  "full_text": "Midwestern Chicken and Noodles\nClose\nJump to recipe\nPrep\n35 mins\nCook\n60 mins\nResting Time:\n30 mins\nTotal\n2 hrs 5 mins\nServes\n8\nto 12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Noodles:\n9\nounces\nall-purpose flour\n(\n255\ng\n;\n2\ncups\n), plus more for dusting\n8\nyolks\nfrom\n8\nlarge\neggs\n(\n6.5\nounces\n;\n180\ng\n;)\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\nor up to\n2\ntablespoons\nwater\nFor the Chicken and Gravy:\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n3\nbone-in split\nchicken breasts\n, skin removed (about\n1\npound\n;\n454\ng\neach)\n4\ntablespoons\n(\n60\ng\n)\nbutter\n4\ntablespoons\n(\n32\ng\n)\nall-purpose flour\n4\ncups\n(\n945\nml\n)\nhomemade chicken stock\nor store-bought low-sodium chicken broth\n1\ncup\n(\n240\nml\n)\nwater\n2\nteaspoons\nfreshly\nground black pepper\n2\nteaspoons\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/2\ncup\n(\n120\nml\n)\nheavy whipping cream\nFor the Mashed Potatoes:\n1\ndouble\nrecipe\nof\nKenji’s\nultra fluffy mashed potatoes\nor at least\n6\ncups\n(about\n1.5\nkg\n) of warmed\nmashed potatoes\nof your choice\nDirections\nFor the Noodles:\nOn a clean, dry work surface, pile flour into a large mound. Make a well in the center of mound and pour in egg yolks. Add salt and beat with a fork, gradually incorporating more flour from the mound until a sticky dough forms.\nSerious Eats / Two Bites\nUsing a bench scraper, fold and press remaining flour into the dough until a dry, crumbly dough forms. Add water, 1 teaspoon at a time and kneading after each addition, until dough comes together into a tight, smooth ball (you may need up to 2 tablespoons). At this stage, dough will feel quite firm and not very pliable. Wrap dough tightly in plastic wrap and let rest at room temperature for at least 30 minutes or up to 4 hours.\nSerious Eats / Two Bites\nAfter the rest, divide dough into 2 equal pieces. Set 1 piece of dough on a lightly floured work surface and keep the other piece covered to prevent drying. Using a rolling pin, roll dough out to a 12-inch round. Cut round in half to form two semicircles, then cut each semicircle crosswise into 1/4 -wide strips. Toss cut noodles with a small amount of flour to prevent sticking and set aside until ready to use.\nSerious Eats / Two Bites\nFor the Chicken and Gravy\n: In a large Dutch oven, heat oil over medium-high heat until shimmering. Season chicken generously with salt and pepper on both sides. Add chicken, breast-side down, and cook without moving until chicken is deeply browned and releases easily from pan, about 7 minutes. Flip chicken and cook until the underside of breasts is also deeply browned, adjusting heat as needed to avoid scorching, about 5 minutes. Transfer chicken to plate and set aside.\nSerious Eats / Two Bites\nAdd butter to now-empty Dutch oven and heat until melted and foaming subsides, about 30 seconds. Add flour and stir until fully incorporated and raw flour smell has cooked off, about 30 seconds longer. While whisking constantly to avoid lumps, slowly add chicken broth and water in a thin stream. Bring gravy to a boil, then return chicken and any juices to pot and lower heat to a gentle simmer. Cook, flipping chicken halfway through cooking, until the thickest part of the chicken breast reads 150°F (65°C) with an instant-read thermometer, 20 to 25 minutes. Remove pot from heat. Using tongs, transfer chicken from gravy to a large heat-proof bowl.\nSerious Eats / Two Bites\nUsing 2 forks, shred chicken and discard bones. Return pot to medium-high heat and add noodles. Simmer, stirring occasionally to prevent clumping, until noodles are tender, 10 to 15 minutes.\nSerious Eats / Two Bites\nReturn chicken to pot, stir to combine, and remove from heat. Thin with up to 1/2 cup (120 ml) additional broth, if needed, to achieve a thick, velvety gravy that coats the chicken and noodles. Stir in cream and season to taste with salt and pepper. To serve, spoon a generous portion of chicken, noodles, and gravy over plates of mashed potatoes.\nSerious Eats / Two Bites\nSpecial Equipment\nBench scraper, large Dutch oven, instant-read thermometer, rolling pin\nMake-Ahead and Storage\nLeftover chicken and noodles can be refrigerated in an airtight container for up to 4 days. Reheat in a Dutch oven over medium heat on the stovetop, stirring occasionally, until warmed through. Thin with additional water, if needed, to restore the thick, gravy-like texture.\nComfort Food\nThe Latest\nChicken Mains\nMidwestern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/midwestern-chicken-and-noodles.webp?"
}