{
  "url": "https://www.seriouseats.com/midwestern-breaded-pork-tenderloin-sandwich-recipe-8778098",
  "image_url": "https://www.seriouseats.com/thmb/tEQC0nTuze42La5NpNK94txu4Og=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250121-MidwesternBreadedPorkTenderloinSandwich-TwoBites-10-edf58bf8155b4addaf1ae97299c17daa.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Pork",
    "Midwestern",
    "Frying"
  ],
  "title": "Indiana Breaded Pork Tenderloin Sandwich",
  "full_text": "Indiana Breaded Pork Tenderloin Sandwich\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nBrining Time:\n60 mins\nTotal\n100 mins\nServes\n4\nMakes\n4 sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n1 1/4 to 1 1/2 pound\npork tenderloin\n2\ntablespoons\nplus\n2\nteaspoons\n(\n24\ng\n)\nDiamond Crystal salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(\n12\ng\n)\ngranulated sugar\n2\nfull-size sleeves\nsaltine crackers\n(\n230\ng\n)\n1\ncup\nall-purpose flour\n(\n4.5\nounces\n;\n120\ng\n)\n1\ncup\n(\n240\nml\n)\nwhole milk\n2\nlarge\neggs\n1\ntablespoon\nfreshly\nground black pepper\n1\ntablespoon\npaprika\n1/2\nteaspoon\ncayenne\n1/2\nteaspoon\nMSG\n(optional)\n1\nquart\npeanut oil\n, or other neutral oil with a smoke point over 425°F such as soybean or sunflower oil\n1-2\ntablespoons\nbutter\n4\npotato rolls\nor other soft, squishy burger\nbuns\nMustard, pickle chips, and sliced onion\nor\nsliced tomato, shredded lettuce, and mayonnaise\n,\nfor\nserving\nDirections\nCut pork loin crosswise into 4 evenly sized fillets, about 6 ounces per piece for a 1 1/2-pound tenderloin. (It’s OK if the sizes are slightly different. The differences will be negligible once the meat is pounded.)\nSerious Eats / Two Bites\nWorking with 1 fillet at a time, hold it flat on a cutting board with the palm of your non-dominant hand. Using a sharp chef's, boning, or fillet knife, slice the pork horizontally about 2/3 through cut side, taking care not to cut all the way through; try to do this in as few strokes as possible so the meat is smooth and not sawed. Open butterflied fillet like a book and place flat between 2 sheets of parchment paper or plastic wrap on cutting board. Using a meat mallet, rolling pin, or another blunt heavy tool, pound to even thickness of about 1/4 inch. Repeat with all fillets and transfer to a gallon-size zipper-lock bag.\nSerious Eats / Two Bites\nIn a medium bowl, whisk salt, sugar, and 1 cup room temperature water until salt and sugar are completely dissolved. Pour brine over fillets in bag. Seal the bag, pressing out as much air as possible and ensuring that fillets are submerged, and refrigerate for at least 1 hour or up to 4 hours.\nSerious Eats / Two Bites\nOnce pork is brined, in a food processor, pulse saltine crackers until crumbs resemble a coarse flour. (You should end up with about 2 cups of crumbs.) Transfer cracker crumbs to a shallow dish such as a pie plate. Spread all-purpose flour in second shallow dish. In a third shallow dish, use a fork to beat milk with eggs.\nSerious Eats / Two Bites\nIn a small bowl, combine pepper, paprika, cayenne, and MSG, if using. Divide spice blend into 3 roughly equal parts and add to the cracker crumbs, flour, and egg wash, and whisk to combine.\nSerious Eats / Two Bites\nSet a wire rack in a rimmed baking sheet and set aside. Remove each pork piece from brine and pat dry with paper towels. Working with 1 cutlet at a time, dredge cutlets thoroughly in flour, shaking off excess, then coat with egg wash, allowing excess to drip back into dish to ensure very thin coating, and coat evenly with cracker crumbs, pressing on crumbs to adhere. Place breaded cutlets in single layer on prepared wire rack set over baking sheet; refrigerate cutlets on rack for at least 30 minutes or up to 1 hour to set the crust.\nSerious Eats / Two Bites\nWhen ready to cook, adjust oven rack to middle position and preheat the oven to 150°F (65℃) (or “keep warm,” if yours doesn’t go that low). Set a clean wire rack in a clean rimmed baking sheet; set aside.\nIn a 12-inch cast iron skillet, add oil and heat over medium-high until oil registers 425°F (220℃). Carefully lay 2 prepared cutlets, without overlapping, into skillet. Cook, adjusting heat as needed to maintain oil temperature around 375°F (190℃), until cutlets are golden brown and register an internal temperature of at least 145°F (62℃), about 2 minutes. Transfer cutlets to the prepared wire rack and hold warm in the oven while you cook the remaining cutlets.\nSerious Eats / Two Bites\nOnce cooked, in a separate large stainless steel or cast iron skillet, melt 1 tablespoon butter over medium-high heat. Once melted, add 2 split buns, cut sides down, and toast until golden and crisp along edges, 3 to 5 minutes. Repeat with remaining buns, adding more butter if needed.\nSerious Eats / Two Bites\nTo assemble the sandwich\n, place one cutlet on bottom bun and top with either mustard, pickles, and sliced onion, in that order, or lettuce, tomato, and mayonnaise. Repeat with remaining sandwiches. Serve.\nSerious Eats / Two Bites\nSpecial Equipment\nMeat mallet, rolling pin, or another blunt heavy tool; gallon-size zipper-lock bag, 12-inch cast iron skillet, Large stainless steel or cast iron skillet\nMake Ahead and Storage\nThe sandwiches are best eaten right away.\nSandwiches\nThe Latest\nPork\nMidwestern\nFrying"
}