{
  "url": "https://www.seriouseats.com/mie-goreng-indonesian-fried-noodles-recipe-8655193",
  "image_url": "https://www.seriouseats.com/thmb/EBVoa5UV0hvfM7q3TjIhIg_mo7U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240526-SEA-MieGoreng-MelatiCitrawireja-HERO-9e61008f8d5e4701858a3a91c3e1d224.jpg",
  "tags": [
    "Noodles",
    "The Latest",
    "Stir-Fry Noodles"
  ],
  "title": "Mie Goreng",
  "full_text": "Mie Goreng\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nTotal\n15 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\n(\n170\ng\n) thin dried\nChinese wheat noodles\nor\n12\nounces\n(\n350\ng\n)\nfresh noodles\n(see notes)\n2\ntablespoons\n(\n45\nml\n)\nkecap manis\n, plus more as needed\n1\ntablespoon\n(\n15\nml\n)\nlight soy sauce\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1\nsmall\nshallot\n(\n1\nounce\n;\n30\ng\n), minced\n3\nmedium\ncloves\n(\n15\ng\n)\ngarlic\n, minced\n1\nmedium\ncarrot\n(\n3\nounces\n;\n85\ng\n), peeled and cut diagonally into 1/8-inch slices\n1/2\nsmall\nyellow onion\n(\n2\nounces\n;\n60\ng\n), halved and thinly sliced crosswise\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use half as much by volume\n1/2\nteaspoon\nwhite pepper\n1 1/2\ncups\nshredded\ngreen cabbage\n(about\n4\nounces\n;\n120\ng\n) from\n1\nsmall head\n1\nscallion\n, ends trimmed and thinly sliced, green and white parts (\n1/2\nounce\n;\n15\ng\n)\nFor Serving:\nFried shallots\n,\nhomemade\nor store-bought\nSambal oelek\n, optional\nShrimp crackers\n, optional\nDirections\nBring a medium pot of water to boil. Add the noodles and cook for 1 minute less than package directions; the noodles should retain a slight chew and not be fully cooked. Using a colander, drain immediately and rinse with cold running water to stop the cooking process. Shake the colander well, allowing any excess water to drip off.\nSerious Eats / Melati Citrawireja\nIn a large bowl, toss noodles with 2 tablespoons kecap manis along with soy sauce to evenly coat.\nSerious Eats / Melati Citrawireja\nIn a large wok or nonstick skillet, heat oil over medium heat until shimmering. Add the shallot and garlic, and cook, stirring constantly, until fragrant, 15 to 30 seconds.\nSerious Eats / Melati Citrawireja\nIncrease heat to medium-high and add the carrot, onion, salt, and pepper. Stir frequently, and cook until onion is translucent, about 3 minutes. Add the cabbage, and stir-fry until tender, 2 to 4 minutes.\nSerious Eats / Melati Citrawireja\nAdd seasoned noodles and cook, tossing frequently, until heated through, 2 to 3 minutes. Taste and add 1 tablespoon kecap manis, if desired. Add scallions and stir through.\nSerious Eats / Melati Citrawireja\nFor Serving:\nDivide noodles among 2 plates and sprinkle with fried shallots. Serve hot with acar timun, sambal, and shrimp crackers, if desired.\nSerious Eats / Melati Citrawireja\nSpecial Equipment\nLarge wok or skillet\nNotes\nI use Chinese wheat noodles to make mie goreng but you can use egg noodles or even the noodles from instant noodle packages. You can find fresh noodles in the refrigerated sections at Asian markets.\nThin wonton noodles, Hong Kongstyle pan-fried noodles (chow mein), and lo mein\nall work great! If par-cooked, simply rinse with cold water to loosen the strands and remove any clumps. Dried Japanese noodles called chuka soba or Chinese chow mein noodles are available at most mainstream supermarkets. Ramen noodles work as well. Gluten-free rice noodles work too, and this dish is called bihun goreng.\nDon’t overcrowd your pan while cooking. The ingredients won’t cook evenly and you won’t achieve the “wok hei” so sought after in stir-fried dishes. If you only have a small wok or pan, divide the ingredients in half and make one serving at a time.\nIf you have\nbumbu dasar putih\n(Indonesian white spice paste), substitute the shallot and garlic with 2 tablespoons of this paste.\nMake-Ahead and Storage\nMie goreng can be refrigerated in an airtight container for up to 2 days.\nNoodles\nThe Latest\nStir-Fry Noodles"
}