{
  "url": "https://www.seriouseats.com/migas-tex-mex-scrambled-eggs-tortilla-recipe",
  "image_url": null,
  "tags": [
    "Scrambled Eggs",
    "Southwestern & Tex Mex",
    "Breakfast & Brunch",
    "Quick Breakfast",
    "Quick Dinners"
  ],
  "title": "Migas With Scrambled Eggs, Tortilla Chips, & Chiles",
  "full_text": "Migas With Scrambled Eggs, Tortilla Chips, & Chiles\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n30 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nlarge\neggs\n, beaten\nKosher salt\n2\nplum tomatoes\n, diced\nVegetable\n,\ncanola\n, or\npeanut oil\n, for frying\n16\ncorn tortillas\n, 8 cut into 1 1/2– by 3/4-inch strips (see notes), 8 left whole and\nwarmed in a dry hot skillet just before serving\n1\nmedium\nPoblano pepper\n, stemmed, seeded, and finely chopped\n2\nserrano chiles\nor\n1\njalapeño\n, stemmed and finely chopped\n1\nmedium\nyellow onion\n, finely chopped\nFreshly ground black pepper\nMexican hot sauce\n, for serving\nRefried beans\nand\nsliced avocado\n, for serving\nDirections\nIn a large bowl, whisk eggs with 2 generous pinches of salt and set aside. In a medium bowl, toss tomato with a generous pinch of salt, then transfer tomatoes to a strainer and set over bowl to drain.\nSerious Eats / Vicky Wasik\nIn a medium saucepan, heat about 2 inches of oil to 350°F (180°C). Add tortilla strips and cook, agitating and flipping them constantly with a wire mesh spider, until bubbles slow to a trickle and chips are pale golden brown, about 2 minutes. Transfer to a paper towel–lined plate, season with salt, and set aside (see note).\nSerious Eats / Vicky Wasik\nHeat 3 tablespoons (45ml) oil in a large cast iron or nonstick skillet over medium heat until shimmering. Add Poblano, serrano or jalapeño, and onion and cook, stirring, until fully softened but not browned, about 5 minutes.\nSerious Eats / Vicky Wasik\nLower heat to medium-low, add eggs, and cook, stirring constantly, until curds are just starting to form throughout, about 3 minutes.\nSerious Eats / Vicky Wasik\nAdd 3/4 of the tortilla chips and continue to cook eggs until they are still soft but nearly cooked, about 5 minutes longer. Add tomato and remaining tortilla chips and cook until eggs are softly scrambled and just cooked through, about 2 minutes. Season with salt and pepper. Transfer immediately to a bowl to halt cooking. Serve right away on top of warmed whole tortillas with hot sauce, refried beans, and avocado.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nWhisk,\nlarge cast iron skillet\nor large nonstick skillet,\ninstant-read thermometer\n, wire mesh spider\nNotes\nTo save time, you can also make this recipe with store-bought tortilla chips instead of frying your own.\nRead More\nBreakfast Burrito With Scrambled Egg, Chorizo, and Refried Beans\nScrambled Eggs\nSouthwestern & Tex Mex\nBreakfast & Brunch\nQuick Breakfast\nQuick Dinners"
}