{
  "url": "https://www.seriouseats.com/millionaires-shortbread-recipe-8709817",
  "image_url": "https://www.seriouseats.com/thmb/27dAg3MtiATWm4q66R6wcI8DNOc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240910-SEA-MillionairesShortbread-AmandaSuarez-hero-6e6073a8deb64b4faacd6d68c755599a.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Chocolate",
    "British",
    "Dessert Bars"
  ],
  "title": "Millionaire's Shortbread",
  "full_text": "Millionaire's Shortbread\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nChilling and Cooling Time\n70 mins\nTotal\n2 hrs 10 mins\nServes\n24 slices\nMakes\n1 9- by 13-inch tray\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Shortbread:\nNonstick\ncooking spray\n170\ng\nall-purpose flour\n(6 ounces; 1 1/3 cups)\n75\ng\nrice flour\nor cornstarch (2 3/4 ounces; 2/3 cup)\n56\ng\ngolden caster, caster, or\nsuperfine sugar\n(2 ounces; about 1/4 cup plus 2 teaspoons)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n150\ng\nunsalted butter\n(5 1/4 ounces; 11 tablespoons), melted\nFor the Butterscotch:\n170\ng\nunsalted butter\n(6 ounces; 12 tablespoons)\n450\ng\ndark brown sugar\n(about 15 3/4 ounces; about 2 cups plus 2 tablespoons)\n1 1/2\ncups\n(355ml)\nheavy cream\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Topping:\n198\ng\ndark chocolate\n(7 ounces; about 1 1/4 cups), between 64 and 70% cacao, coarsely chopped\n1\ntablespoon\n(14g)\nunsalted butter\nFlaky\nsea salt\n, to garnish\nDirections\nFor the Shortbread:\nAdjust oven rack to middle position and preheat oven to 350ºF (175ºC). Line a 9- by 13-inch rimmed baking sheet with an 11- by 17-inch piece of parchment crosswise so the parchment overhangs the rim of the baking sheet by at least 2 inches. (If using pre-cut parchment, you may have to layer two pieces to create the overhang.) Using nonstick cooking spray, grease parchment and baking sheet; set aside.\nSerious Eats / Amanda Suarez\nIn a large bowl, whisk together all-purpose flour, rice flour or cornstarch, sugar, and salt. Pour melted butter into flour mixture and, using a rubber spatula or dough scraper, incorporate butter into dry ingredients, gently stirring and pressing to combine, until a cohesive dough just forms and no dry bits remain, about 1 minute. (Be careful not to overwork the dough.)\nSerious Eats / Amanda Suarez\nScrape dough into the prepared baking sheet and, using an offset spatula or the flat bottom of a glass or measuring cup, press dough into an even layer. Bake until fragrant and light golden, about 30 minutes. Remove shortbread from oven and set on wire rack to cool to room temperature, about 30 minutes.\nSerious Eats / Amanda Suarez\nFor the Butterscotch:\nIn a 6-quart pot, melt butter over medium heat. Whisk in brown sugar and salt cook, stirring occasionally, until sugar has melted and begins to bubble, about 5 minutes. Add heavy cream (it will bubble and sputter) and whisk until a loose sauce forms. Bring to a boil over high heat and cook, stirring occasionally, until sauce is thick, shiny, and registers 235ºF (113ºC) on an instant-read thermometer. Remove from heat and allow butterscotch to slightly cool, about 5 minutes. (It should no longer be scorching hot and still be warm enough to pour.)\nSerious Eats / Amanda Suarez\nCarefully pour butterscotch over cooled shortbread. Allow butterscotch to sit until warm room temperature, another 30 minutes, then refrigerate uncovered until just set, about 1 hour. Transfer baking sheet to freezer while you prepare the chocolate topping, at least 10 minutes and up to 1 hour.\nSerious Eats / Amanda Suarez\nFor the Topping:\nIn a medium heat-proof mixing bowl, combine dark chocolate and butter. Set it over a saucepan of simmering water, making sure the bottom of the bowl doesn't touch the water, and heat, stirring occasionally, until chocolate and butter have melted and mixture is homogenous, about 3 minutes. Remove bowl and set on a heatproof work surface. (Alternatively:\nIn a medium microwave-safe bowl, heat dark chocolate and butter on medium-low power, stopping and using a heat-proof flexible spatula to stir every 30 seconds, until completely melted, about 3 minutes.)\nSerious Eats / Amanda Suarez\nRemove shortbread from freezer and pour chocolate over shortbread, using an offset spatula to evenly coat butterscotch. Refrigerate until set, about 30 minutes.\nSerious Eats / Amanda Suarez\nLift parchment overhang to gently remove millionaire’s shortbread from rimmed baking sheet and transfer to a cutting board. Using a sharp knife, cut bars into squares, rectangles, or desired shape. Serve cold or at room temperature.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9- by 13-inch rimmed baking sheet, parchment paper, whisk, offset spatula, 6-quart pot or saucepan, instant-read thermometer, microwave-safe bowl\nMake-Ahead and Storage\nMillionaire’s shortbread can be made and refrigerated, wrapped in plastic, up to 3 days in advance.\nPortioned bars can be refrigerated in an airtight container for up to 5 days or frozen for 1 month.\nDesserts\nThe Latest\nChocolate\nBritish\nDessert Bars"
}