{
  "url": "https://www.seriouseats.com/mille-feuille-recipe-8729243",
  "image_url": "https://www.seriouseats.com/thmb/12zF3960xugqNn8XE-kWw7RCm_8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241016-MilleFeuille-AmandaSuarez-12-b16546e5fe2a47d39b875665ed7528ba.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "French",
    "Cakes"
  ],
  "title": "Mille-Feuille",
  "full_text": "Mille-Feuille\nClose\nJump to recipe\nPrep\n60 mins\nCook\n100 mins\nChilling Time\n3 hrs 30 mins\nTotal\n6 hrs 10 mins\nServes\n12\nMakes\n1 10- by 12-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pastry Cream:\n6\ncup\ns (1.4L)\nwhole milk\n1\nvanilla bean\n, split and scraped (see notes)\n340\ng\ngranulated sugar\n(12 ounces; about 1 1/2 cup plus 2 tablespoons)\n90\ng\ncornstarch\n(3 ounces; 6 tablespoons)\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nYolks\nfrom\n12\nlarge\neggs, cold (about 7 1/2 ounces; 210g)\n90\ng\nunsalted butter\n(3 ounces; 6 tablespoons), cut into 1/2-inch cubes\nFor the Puff Pastry:\nThree 14 1/2- by 9 1/2-inch sheets puff pastry from three 14-\nounce\npackages frozen\npuff pastry\n, thawed, preferably all-butter (such as Dufour)\n2\npounds\n(906g) dried\nbeans\nor pie weights, for baking\nConfectioners sugar\n, for dusting\nDirections\nFor the Pastry Cream:\nIn a 6-quart pot, combine milk and scraped vanilla bean along with its seeds. Bring to a bare simmer over medium heat. Remove from heat, cover to prevent evaporation, and let steep for 30 minutes.\nSerious Eats / Vicky Wasik\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nIn a medium heatproof mixing bowl set on top of a dampened towel (this serves as a stable base), stir together sugar, cornstarch, and salt. Whisk in egg yolks until mixture is pale yellow, smooth, and fluffy, about 1 minute.\nSerious Eats / Vicky Wasik\nUncover infused milk and remove vanilla bean. While whisking continuously, slowly pour milk into egg yolk mixture in a thin stream, until all of it has been added.\nReturn mixture to the same pot. Cook over medium heat, whisking constantly until pastry cream begins to thicken, about 7 minutes. Once it thickens, continue to whisk, pausing every few seconds to check for bubbles, about 1 minute. Once bubbling, continue whisking for 1 minute.\nOff-heat, whisk in butter until melted and thoroughly combined. Using a fine-mesh strainer, strain pastry cream into a large heatproof bowl. Immediately place plastic wrap directly on surface of the cream to prevent a skin from forming. Transfer bowl to prepared ice bath to chill for 30 minutes, then refrigerate until cold, about 2 hours.\nFor the Puff Pastry:\nAdjust oven rack to middle position and preheat oven to 400ºF (205ºC). Line three 13- by 18-inch rimmed baking sheets with parchment; set aside. On a lightly floured surface, roll one 14-ounce sheet of puff pastry into a rough 13- by 18-inch rectangle about 1/8-inch thick. Gently roll dough onto rolling pin and transfer to a prepared baking sheet. Using a fork, prick pastry all over. Lightly cover dough with plastic wrap and refrigerate for at least 30 minutes or up to 24 hours. Repeat with remaining puff pastry.\nSerious Eats / Amanda Suarez\nRemove plastic wrap from puff pastry and cover dough with a sheet of parchment paper. Top with another 13- by 18-inch rimmed baking sheet. Set a piece of parchment paper inside the rimmed baking sheet on top and cover evenly with 2 pounds dried beans. Bake until pastry begins to rise, about 15 minutes; open oven and, using oven mitts, press down on baking sheets to deflate puff pastry if necessary. Bake for another 10 minutes. Using oven mitts, carefully remove top baking sheet; set aside. Return puff pastry to oven and continue baking until golden brown, 5 to 7 minutes. Remove pastry from oven, set aside to cool completely, and repeat with remaining puff pastry.\nTo Assemble:\nUsing a serrated knife, trim each layer of puff pastry to a 10- by 12- inch rectangle. Place one sheet of puff pastry onto a large cutting board. Remove chilled pastry cream from fridge and whisk until smooth. Fit a\npiping bag\nwith desired tip, and using a flexible spatula, scrape pastry cream into piping bag.\nSerious Eats / Amanda Suarez\nHold the piping bag perpendicular to the puff pastry, with the piping tip 1/4- to 1/2-inch above its surface. Apply steady pressure and slowly pipe a small dollop of pastry cream onto puff pastry. Release your grip, then slowly lift piping bag to create a dollop shaped like a Hershey kiss; repeat until puff pastry is evenly covered with pastry cream. (Alternatively, use an offset spatula to evenly spread a 1/2-inch layer of pastry cream across puff pastry.)\nSerious Eats / Amanda Suarez\nGently place second sheet of puff pastry on top of pastry cream dollops. Repeat piping on top of second layer, then top with third sheet of puff pastry, gently pressing to adhere, making sure pastry cream doesn’t ooze out the sides. Refrigerate until pastry cream firms up slightly, at least 1 hour or up to 12.\nSerious Eats / Amanda Suarez\nTo Serve:\nUsing a fine-mesh strainer, dust confectioners sugar over surface of pastry. Using a serrated knife, slice cake into 12 pieces and serve. (For cleaner cuts, run knife under warm water and dry knife with a clean kitchen towel before portioning each slice.)\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFine-mesh strainer, two 13- by 18-inch rimmed baking sheet, serrated knife, piping bag, piping tip\nNotes\nCut vanilla bean in half lengthwise. Using tip of paring knife, scrape out seeds. 1 tablespoon vanilla extract or 1 1/2 teaspoons vanilla paste can be substituted for the vanilla bean.\nMake-Ahead and Storage\nPastry cream can be made up to 1 day in advance and refrigerated in an airtight container.\nMille-feuille can be assembled, lightly wrapped in plastic, and refrigerated up to 12 hours in advance; the pastry may soften as it sits.\nDesserts\nThe Latest\nFrench\nCakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mille-feuille.webp?"
}