{
  "url": "https://www.seriouseats.com/milwaukee-dill-pickles-cucmber-recipe",
  "image_url": "https://www.seriouseats.com/thmb/OF3gS44selVdmySUeGnsdC4rCBA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__08__20170808-preservation-acid-pickling-vicky-wasik-12-36b34285a2844a0082596e3cc6754c23.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "Pickling",
    "Stovetop",
    "Cucumbers"
  ],
  "title": "Milwaukee Dill Refrigerator Pickles Recipe",
  "full_text": "Milwaukee Dill Refrigerator Pickles Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n5 mins\nActive\n30 mins\nStanding and Pickling Time\n504 hrs 15 mins\nTotal\n504 hrs 45 mins\nServes\n25 servings\nMakes\n2 jars\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cold-Water Soak:\nAbout\n25\nsmall\n\"number one\" cucumbers\n(about\n2\npounds\n/\n1\nkg\n; see note)\n1\ncup\npickling\nor other\npure salt\n(about\n8 3/4\nounces\n/\n250\ng\n; see note)\nFor the Pickling Spice Mix and Brine:\n4\ntablespoons\nwhole mustard seeds\n, divided\n1\ntablespoon\nwhole\nallspice\n1\ntablespoon\nwhole juniper berries\n1\ntablespoon\nground turmeric\n2\nteaspoons\ncoriander seeds\n5\nwhole\ncloves\n1\nteaspoon\nground ginger\n2\nbay leaves\n, divided\n1\nsmall\n(2-inch)\ncinnamon stick\n, broken into pieces\n1\nwhole\nstar anise\n, broken into pieces (optional)\n1 1/2\ncups\ndistilled white vinegar\nat 5% acidity (\n355\nml\n)\n2\ntablespoons\npickling\nor other\npure salt\n(about\n1\nounce\n/\n30\ng\n; see note)\n1\ntablespoon\nsugar\n(optional)\n1/4\ncup\nthinly sliced white onion\n(from about\n1/4\nmedium\nonion\n)\n4\nmedium\ncloves garlic\n2\nlarge tufts\ndill weed\n, flowers removed and reserved, or\nbaby dill\n(see note)\nDirections\nFor the Cold-Water Soak:\nIn a large bowl, combine 1 gallon (4 liters) cold water with 1 cup salt, stirring to dissolve the salt. Meanwhile, wash cucumbers, then trim off the flower-end (opposite of the stem) using a paring knife. Place cucumbers in cold saltwater bath. Let stand while you prepare the brine.\nFor the Pickling Spice Mix and Brine:\nIn a small bowl, stir together 2 tablespoons mustard seeds with allspice, juniper, turmeric, coriander, cloves, ground ginger, bay leaves, cinnamon, and star anise, if using. Measure out 1 tablespoon pickling spice blend and wrap in either a cheesecloth sachet or metal tea strainer. Reserve remaining pickling spice for a future batch.\nIn a medium stainless-steel saucepan, combine vinegar with 2 cups (475ml) water, 2 tablespoons salt, and sugar, if using (sugar rounds out the sharp vinegar flavor, but is optional and a matter of personal preference). Add spice-mix sachet and set over medium heat, cover, and bring to about 115°F (46°F) (just warm enough to dissolve the salt and sugar and infuse the brine with spice flavor). Remove from heat and let stand 15 minutes, then remove and discard spice sachet. Let cool to room temperature.\nWash 2 (1-quart) glass canning jars with warm soapy water and rinse well. Divide the sliced onion, garlic, dill, and remaining 2 tablespoons mustard seeds between the two jars, pressing firmly into the bottom.\nDrain cucumbers. Pack each jar with cucumbers, making sure the cucumbers do not rise above the shoulder of the jar (the curve just under the opening). Pickles should be packed firmly enough that they don't move around at all when the jar is shaken.\nPour cooled brine into each jar, making sure cucumbers are completely covered by the brine.\nClose jars and transfer to refrigerator. Pickles will be ready after 3 weeks, and will keep refrigerated for up to 2 months.\nSpecial Equipment\n1-quart glass canning jars, cheesecloth or tea strainer\nNotes\nTable salt usually has additives in it that can interfere with the formation of a good pickle, so look for \"pure\" salts or pickling salts that are additive-free.\nThe size of pickling cucumbers is rated by number. This recipe calls for small \"number one\" cucumbers; feel free to cut larger cucumbers into spears. It's better to buy extra pickles than to run short, since you will need to pack the jar tightly; you may not need all of them.\nOlder dill weed, which usually has flowers on it, is best for pickling, but feathery young dill will also work.\nRead More\nPickle Science: How to Master the Preserving Power of Acids\nLacto-Fermented Dill Pickles\nThe Science of Lactic Acid Fermentation: Pickles, Kraut, Kimchi, and More\nSnacks & Appetizers\nVegetarian Snacks & Appetizers\nPickling\nStovetop\nCucumbers"
}