{
  "url": "https://www.seriouseats.com/miso-butterscotch-pecan-cookies-recipe-11736166",
  "image_url": "https://www.seriouseats.com/thmb/r0rssOQl7nKPQqp6PBNMdPGaEig=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250515-SEA-MisoButterscotchCookies-MaureenCelestine-Beauty3-36-76e21e5c86b240f19c629703e691a508.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Recipes",
    "Desserts"
  ],
  "title": "These Butterscotch-Pecan Cookies Are Irresistible, Thanks to This Unexpected Ingredient",
  "full_text": "These Butterscotch-Pecan Cookies Are Irresistible, Thanks to This Unexpected Ingredient\nClose\nJump to recipe\nPrep\n20 mins\nCook\n50 mins\nChilling Time\n60 mins\nTotal\n2 hrs 10 mins\nServes\n12\nto 24\nMakes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n150\ng\npecan halves\n(\n5 1/4\nounces\n;\n1 1/4\ncup\n)\n225\ng\nunsalted butter\n(\n8\nounces\n;\n16\ntablespoons\n)\n200\ng\nwhite or\nlightly toasted\nsugar\n(\n7\nounces\n;\n1\ncup\n)\n215\ng\ndark or light\nbrown sugar (\n7 1/2\nounces\n;\n1\ncup\nlightly packed)\n2\nlarge\neggs,\ncold from the fridge\n2\nteaspoons\n(\n10\nml\n)\nvanilla extract\n70\ng\nwhite\nmiso paste\n(\n2 1/2\nounces\n;\n1/4\ncup\n)\n225\ng\nall-purpose flour\n(8\nounces\n; about\n1 3/4\ncups\n)\n225\ng\nspelt flour\n(\n8\nounces\n; about\n1 3/4\ncups\n)\n1\nteaspoon\nbaking soda\n1/2\nteaspoon\nbaking powder\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n180\ng\nbutterscotch chips\n(\n8\no\nunces\n; about\n1\ncup\n), plus\n45\ng\n(2\nounces\n; about\n1/4\ncup\n) to finish\nFlaky\nsea salt,\nsuch as\nMaldon,\nto finish\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Arrange pecans on a rimmed baking sheet and toast, stirring every 5 minutes, until well toasted and mahogany brown, 10 to 15 minutes. Let cool completely, then roughly chop.\nSerious Eats / Maureen Celestine\nWhile pecans bake, set up an ice bath, then melt butter in a stainless steel saucier or 10-inch skillet over medium heat, stirring frequently with a\nsilicone or other heat-resistant spatula\n. Cook butter, swirling frequently and using the spatula to scrape up any brown bits until golden-brown, 3 to 7 minutes. Remove from heat, pour immediately into the bowl of a stand mixer and set bowl in ice bath; allow butter to cool to 62°F and begin to solidify, stirring occasionally, about 15 minutes.\nSerious Eats / Maureen Celestine\nAdd both sugars to cooled browned butter in bowl of stand mixer. Using the paddle attachment, mix together butter and sugar on low for 30 seconds to incorporate, then increase speed to medium and cream until mixture is light, fluffy, and pale, about 5 minutes, stopping halfway through to scrape down sides of bowl with a spatula.\nSerious Eats / Maureen Celestine\nWith mixer running, add cold eggs, vanilla, and miso and beat just until incorporated. In a large bowl, thoroughly whisk together both flours, baking soda, baking powder, and salt. Add to bowl of stand mixer and mix on low speed until a stiff dough forms. Add pecans and butterscotch chips and mix on low speed 10 seconds longer or until incorporated. Wrap dough tightly in plastic wrap and transfer to fridge. Chill dough for at least one hour and up to 24 hours.\nSerious Eats / Maureen Celestine\nWhen ready to bake, line 2 rimmed baking sheets with parchment paper, adjust oven rack to middle position, and preheat oven to 350°F (180°C). Remove dough from fridge and divide the dough into four portions. Return all but one portion of dough to the fridge and shape one portion of the dough into six 2-ounce (55 g) balls (roughly the size of a golf ball). Place the 6 dough balls at least 2 inches apart on 1 lined rimmed sheet. With the heel of your hand, slightly flatten dough balls into about 1/2-inch thick, 2 1/2-inch wide pucks. If desired for visual effect, press 2 to 3 additional butterscotch chips into the top of each cookie. Sprinkle flaky sea salt over cookies. Bake until edges are just starting to turn golden brown, 12 to 14 minutes. While cookies are baking, prepare the other lined baking sheet with 6 more portioned cookies.\nSerious Eats / Maureen Celestine\nRemove baking sheet from oven. For perfectly circular cookies, immediately invert a round plastic quart container (or any glass/bowl with a roughly 4- to 5-inch diameter) over the cookies and swirl it rapidly around each cookie in turn-–the goal is a “wax on,” Karate Kid–style movement that will gently bump the soft edges of the warm cookies against the wall of the container. Let cookies cool on sheet for 5 minutes, then transfer cookies to a wire rack to cool completely.\nSerious Eats / Maureen Celestine\nOnce each pan has cooled to the touch, repeat portioning, shaping, and baking cookies in batches of 6 per sheet for a total of about 24 cookies, 4 batches total.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nStainless steel saucier or 10-inch skillet, heat-proof spatula, stand mixer with paddle attachment, 2 rimmed baking sheets, parchment, round glass or plastic quart container or any glass/bowl with a roughly 4- to -5-inch diameter, wire rack\nMake-Ahead and Storage\nCookies can be stored at room temperature in an airtight container for up to 10 days.\nCookies\nThe Latest\nRecipes\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/these-butterscotch-pecan-cookies-are-irresistible-thanks-to-this-unexpected-ingredient.webp?"
}