{
  "url": "https://www.seriouseats.com/miso-dip-pork-walnuts-vegetables-recipe",
  "image_url": "https://www.seriouseats.com/thmb/9MC_pT2r0Ud6iZg8oESbXo655y8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160719-miso-walnut-dip-vicky-wasik-11-4febb538f41441da8ba0e3114b654595.jpg",
  "tags": [
    "Dips",
    "Japanese",
    "Walnuts",
    "Pork",
    "Condiments & Sauces"
  ],
  "title": "Miso, Pork, and Walnut Dip for Vegetables Recipe",
  "full_text": "Miso, Pork, and Walnut Dip for Vegetables Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n6\nto 8 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\nwalnuts\n(\n1\nounce\n;\n30\ng\n), toasted\n1/2\ncup\ndark miso\n(\n4 1/2\nounces\n;\n130\ng\n), such as aka, hatcho, or mugi (see note)\n2\ntablespoons\n(\n30\nml\n)\nmirin\n(see note)\n1\nteaspoon\n(\n4\ng\n)\nsugar\n2\ntablespoons\n(\n30\nml\n)\nhomemade\nor instant\ndashi\n(see note)\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n1/4\ncup\nminced yellow onion\n(\n1 3/4\nounces\n;\n50\ng\n), from about\n1/4\nmedium\nonion\n1/4\ncup\nground pork\n(\n1 3/4\nounces\n;\n50\ng\n)\nDirections\nUsing a mortar and pestle or food processor, crush walnuts until fine and crumbly (some small chunks are okay).\nIn a small bowl, stir together miso, mirin or sake, sugar (see note), and dashi. Set aside.\nIn a small saucepan, heat oil over medium heat until shimmering. Add onion and cook, stirring, until softened and translucent, about 3 minutes. Add pork and cook, breaking it up into small bits with a spoon, until browned, about 6 minutes. Stir in walnuts.\nStir in miso mixture and cook, stirring, until reduced to a thick paste, about 3 minutes; lower heat as necessary to prevent scorching.\nScrape miso dip into a bowl, then serve with raw or cooked seasonal vegetables. The dip will keep up to 1 week in an airtight container in the refrigerator.\nNotes\nMost supermarkets will carry red (\naka\n) miso, but if you have access to a Japanese specialty market, try out some soybean (\nhatcho\n) or barley (\nmugi\n) miso, as these offer unique flavors to the dish. The former is made only with soybeans, as opposed to standard miso, which is typically made with a mix of soy and wheat or other grains. (Think of it as the difference between tamari and shoyu.) If you prefer, you can use 2 tablespoons (30ml) of sake along with 1 additional teaspoon (4g) of sugar in place of the mirin in this recipe. If using powdered\ndashi\n, reconstitute it according to the package instructions before adding it to the recipe.\nSpecial Equipment\nMortar and pestle or food processor\nThis Recipe Appears In\nBored With Ranch? Use Miso, Walnuts, and Pork to Make a Flavorful Veggie Dip\nDips\nJapanese\nWalnuts\nPork\nCondiments & Sauces"
}