{
  "url": "https://www.seriouseats.com/miso-chicken-paitan-ramen",
  "image_url": "https://www.seriouseats.com/thmb/2wkOy_jiv-XSL2kJaYpMy5b_wwk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-SoupsandStewsMPP-MisoToriPaitanRamen-FredHardy-ba831cd42b6140d48b90f4ce1afa3ede.jpg",
  "tags": [
    "Ramen",
    "Noodles",
    "Japanese",
    "Chicken",
    "Comfort Food"
  ],
  "title": "Miso Tori Paitan Ramen (Creamy Chicken Broth Ramen)",
  "full_text": "Miso Tori Paitan Ramen (Creamy Chicken Broth Ramen)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n20 mins\nTotal\n35 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Gyofun:\n3\ndried red chiles\n, such as\nárbol\n,\nThai bird\n,\nBangladeshi\n, or\nKashmiri\n, stemmed (optional)\n5\ng\n(about\n1\nsmall handful\n)\nkatsuobushi shavings\n(\nJapanese smoked, dried skipjack tuna\n)\nFor the Miso Tare:\n1\ntablespoon\n(\n15\nml\n)\nshoyu tare\n(from the\nchintan shoyu ramen recipe\n)\n2\ntablespoons\n(\n30\nml\n)\nred miso paste\n2\nfresh red Thai bird chiles\n, stemmed and thinly sliced crosswise (optional)\nTo Serve:\n4\ncups\n(about\n950\nml\n)\nchicken paitan broth\n2\nservings\nramen noodles\n, either store-bought or\nhomemade\n4\nteaspoons\n(\n20\nml\n)\naroma oil\n(from the\nchintan shoyu ramen recipe\n)\nTo Garnish:\nSliced braised\npork belly\n(from the\nchintan shoyu ramen recipe\n, warmed through and seared with a torch if desired);\nmarinated egg\n(shelled and halved); and sheets of\ntoasted nori\n(all optional)\n2\ntablespoons\nfinely diced white onion\n2\nscallions\n, sliced crosswise as thinly as possible\nLime wedges\nDirections\nFor the\nGyofun\n:\nPlace dried chiles (if using) and katsuobushi in a pan and set over medium heat. Toast until fragrant. Using a spice grinder or mortar and pestle, grind toasted chiles and katsuobushi to a fine powder. Set aside.\nFor the Miso\nTare\n:\nIn a small bowl, stir together shoyu tare with miso paste and sliced fresh chiles (if using) until thoroughly combined. Set aside.\nTo Assemble the Ramen Bowls:\nBring paitan broth to a boil. Bring a separate large pot of unsalted water to a boil.\nAdd one ladleful of boiling water to each serving bowl to warm the bowls. Place noodles in pot of boiling water, stirring vigorously to prevent clumping, and cook as directed on packaging or as directed in recipe.\nMeanwhile, empty serving bowls of warming water. Place half of miso tare mixture and half of aroma oil in each bowl. Top each with 1 1/2 cups (350ml) boiling paitan broth. Using an immersion blender placed directly in each bowl, pulse the mixture 2 to 3 times, until broth is mixed and somewhat frothy. (Before beginning to assemble the bowls, it's a good idea to fill one with an equivalent volume of water and check that the liquid won't spill over when blended; see note for more info.) Alternatively, you can use a whisk to blend the broth, tare, and aroma oil in each bowl.\nStrain cooked noodles, shaking off as much excess water as possible, and add a portion to each bowl of hot broth. Using chopsticks, lift noodles up out of the bowl and fold them over, back into the broth. Garnish with any desired toppings, such as pork belly, a halved egg, and/or nori sheets. Garnish with diced white onion and sliced scallions. Add 1 teaspoon chile gyofun (or more, if you like) to each bowl. Serve immediately, with lime wedges alongside.\nSpecial equipment\nImmersion blender\n, noodle basket or\nfine-mesh strainer\n,\nspice grinder\nor\nmortar and pestle\nNotes\nTo ensure that blending the broth in the bowl does not lead to spills or other mishaps, we suggest that you do an initial test run, using water, in the serving bowl of your choice. Add 1 1/2 cups (350ml) water to the bowl and pulse the blender. If water spills out of the bowl, you will need a bigger bowl or a less powerful blender, or you will need to use a whisk.\nMake-Ahead and Storage\nThe chile\ngyofun\ncan be stored in a sealed, airtight container for up to 1 week. The miso\ntare\ncan be stored in a sealed container in the refrigerator for up to 1 week.\nThis Recipe Appears In\nLove Tonkotsu? Meet Tori Paitan Ramen, Its Creamy, Chicken-y Cousin\nRamen\nNoodles\nJapanese\nChicken\nComfort Food"
}