{
  "url": "https://www.seriouseats.com/mississippi-pot-roast-recipe-8774586",
  "image_url": "https://www.seriouseats.com/thmb/xvis9m2E2vRjvY-xcPlXETqhUps=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241223-SEA-MississippiRoast-FredHardy-Hero2-34-ad9392ae06f04368b8b949c8e292f05b.jpg",
  "tags": [
    "Beef",
    "The Latest",
    "Braised & Stewed Beef",
    "Stovetop Beef",
    "Braised & Stewed Vegetables"
  ],
  "title": "Mississippi Pot Roast",
  "full_text": "Mississippi Pot Roast\nClose\nJump to recipe\nPrep\n30 mins\nCook\n3 hrs 25 mins\nTotal\n3 hrs 55 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n3-pound\n(1360g) boneless\nchuck roast\n, excess fat trimmed\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\nground black pepper\n2\ntablespoons\n(\n30\nml\n)\ncanola oil\n4\ncups\n(\n946\nml\n)\nunsalted chicken stock\nTwo 1/4-ounce packets unflavored\ngelatin\n(\n16\ng\n; about\n5 1/2\nteaspoons\n)\n5\nmedium\ncloves garlic\n(\n25\ng\n), smashed and peeled\n1\nsmall bunch\nfresh dill\n(\n14\ng\n), with 1 tablespoon (2g) chopped dill reserved for garnish\n6\nmedium jarred\npepperoncini\nsalad\npepper\ns (\n3 1/2\nounces\n;\n100\ng\n), rinsed, plus 1 tablespoon (15ml) liquid from jar, divided\n1/2\ncup\n(120ml)\nwhole buttermilk\nDirections\nAdjust oven rack to lowest position, and preheat oven to 300°F (150°C). Place chuck roast, flat side down, on a cutting board; cut in half horizontally to create 2 steaks. Season all over with salt and black pepper. In a large Dutch oven, heat oil over medium-high heat until shimmering. Working with one piece at a time, sear chuck roast steaks until deeply browned on both sides, 5 to 8 minutes per side, reducing heat as needed to prevent overbrowning. Transfer chuck roast to a 9- by 13-inch rimmed baking sheet. Remove Dutch oven from heat, and carefully pour drippings into a small heatproof bowl to cool; discard.\nSerious Eats / Fred HArdy\nWhile chuck roast browns, pour stock into a large bowl, and sprinkle with gelatin. Let stand until fully hydrated, about 10 minutes.\nSerious Eats / Fred HArdy\nAdd gelatin mixture, garlic, and dill to Dutch oven. Return chuck roast steaks and any accumulated juices to Dutch oven. Top roast with pepperoncini peppers. Bring to a simmer over medium-high heat. Cover, leaving the lid slightly cracked open (about 1/2-inch), and braise in oven until roast is fork-tender, 2 hours 45 minutes to 3 hours. Carefully transfer roast to a work surface; using 2 forks, shred into large pieces, discarding any big pieces of fat.\nSerious Eats / Fred HArdy\nPlace Dutch oven with liquid over medium heat, and bring to a simmer. Cook, stirring often, until slightly reduced, about 6 minutes. Remove from heat, and stir in pepperoncini liquid.\nSerious Eats / Fred HArdy\nIn a small bowl, whisk buttermilk and 1/2 cup hot braising liquid from Dutch oven until well combined. Whisk buttermilk mixture into remaining braising liquid in Dutch oven. Return shredded roast to Dutch oven, and stir to combine. Garnish with chopped dill.\nSerious Eats / Fred HArdy\nSpecial Equipment\nLarge Dutch oven\nMake-Ahead and Storage\nThe Mississippi roast can be stored in an airtight container and refrigerated for up to 4 days.To reheat, scrape off any solidified fat, then slowly reheat in a 300ºF (148ºC) oven or gently simmer over low heat until warmed through.\nLeftover meat and braising liquid can be frozen in an airtight container for up to 3 months. Thaw overnight in fridge.\nBeef\nThe Latest\nBraised & Stewed Beef\nStovetop Beef\nBraised & Stewed Vegetables"
}