{
  "url": "https://www.seriouseats.com/mississippi-mud-pie-recipe-8744387",
  "image_url": "https://www.seriouseats.com/thmb/3vFed-WBeeWY4BJKDcWQQmtdzNc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241112-MississippiMudPie-MorganHuntGlaze-03-7bebbf3cd1e54be384e5136c149191e7.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Pies",
    "Chocolate"
  ],
  "title": "Mississippi Mud Pie",
  "full_text": "Mississippi Mud Pie\nClose\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nCooling TIme\n4 hrs 20 mins\nTotal\n5 hrs 15 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n20\ncream-filled chocolate\nsandwich cookies\n(8 ounces; 226g), such as Oreos, roughly broken into pieces\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n5 tablespoons\n(70\ng)\nunsalted butter,\nmelted\nFor the Brownie Layer:\n100\ng\nbittersweet chocolate\nbetween 64 and 70% cacao (3 1/2 ounces), coarsely chopped (about 2/3 cup)\n1/4\ncup\n(56g)\nunsalted butter,\ncut into 1/2-inch pieces\n1/4\ncup\n(60ml)\nvegetable oil\n2\nlarge\neggs, at room temperature\n100\ng\ng\nranulated sugar\n(3 1/2 ounces; 1/2 cup)\n2\nteaspoons\nvanilla extract\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n45\ng\nall-purpose flour\n(1 2/3 ounce; 1/3 cup)\n13\ng\n(3 tablespoons) Dutch-process\ncocoa powder\nFor the Chocolate Pudding:\n170\ng\nbittersweet chocolate\nbetween 64 and 70% cacao (6 ounces), chopped (1 cup)\n23\ng\n(2 tablespoons)\ndark brown sugar\n1\nteaspoon\nground instant\nespresso,\noptional (see notes)\n1/8\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt, use half as much by volume\n2\nlarge\negg yolks\n1\nteaspoon\nvanilla extract\n1\ncup (240ml)\nheavy cream\nFor the Whipped Cream Topping:\n1\ncup (240ml)\nheavy cream\n3\ntablespoons (18g)\nconfectioners' sugar\n1/2\nteaspoon\nvanilla extract\nToasted\nchopped\npecans\n, for garnishing, optional\nDirections\nFor the Crust:\nAdjust oven rack to middle position and preheat oven to 350ºF (175ºC). In a food processor, process cookie pieces and salt until fine crumbs form, about 30 seconds. Add melted butter to cookie mixture and pulse until crumbs begin to clump together, about 4 pulses. Transfer mixture to 9-inch pie plate. Using your fingers, press mixture into bottom and up the sides of the pie plate, then compress firmly using a flat-bottomed drinking glass or measuring cup. Keep pressing until the crumbs form a compact, even layer across the bottom of the baking dish. Wash and dry food processor bowl; set aside.\nSerious Eats / Morgan Hunt Glaze\nBake until just set, 10 to 12 minutes. Crust may puff slightly while baking; if necessary, gently press down with a flat-bottomed drinking glass or measuring cup immediately after baking. Let cool slightly on a wire rack, about 10 minutes.\nSerious Eats / Morgan Hunt Glaze\nFor the Brownie Layer:\nFill a small saucepan with 1 inch water and bring to a simmer over medium heat. In a heat-proof bowl large enough to nest in the saucepan without touching the water, combine chocolate, butter, and oil. Set bowl over the saucepan and cook, stirring occasionally, until melted and smooth, about 2 minutes. (Alternatively, place chocolate, butter, and oil in a large microwave-safe bowl. Microwave chocolate mixture on medium power in 30-second intervals, stirring thoroughly between intervals, until melted and smooth, 2 minutes total.) Remove from heat and let stand until slightly cooled, about 10 minutes.\nSerious Eats / Morgan Hunt Glaze\nIn a second large bowl, beat eggs, sugar, vanilla, and salt with a hand mixer on medium-high speed until pale yellow and tripled in volume, about 5 minutes. (Alternatively, in the bowl of a stand mixer fitted with the whisk attachment, beat eggs, sugar, vanilla, and salt on medium-high speed until pale yellow and tripled in volume, 3 to 5 minutes.) Using a flexible spatula, fold 1/3 egg mixture into slightly cooled chocolate mixture. Gently fold in remaining egg mixture in 2 batches until no streaks remain.\nSerious Eats / Morgan Hunt Glaze\nUsing a fine-mesh sieve, sift flour and cocoa powder into chocolate mixture. Using a flexible spatula, fold dry ingredients into chocolate until just combined. Scrape batter into cooled crust, using a flexible or offset spatula to spread it into an even layer. Bake until a toothpick inserted in the center comes out with several moist crumbs attached, about 18 minutes. Let cool on a wire rack for 1 hour, then refrigerate until completely cool, about 1 hour.\nSerious Eats / Morgan Hunt Glaze\nFor the Chocolate Pudding:\nIn the now-clean food processor bowl, process chocolate, brown sugar, espresso granules (if using), and salt until finely ground, about 20 seconds. Add yolks and vanilla extract; pulse until thoroughly combined and chocolate mixture begins to clump together, about 5 pulses.\nSerious Eats / Morgan Hunt Glaze\nIn a small saucepan, bring cream to a boil over medium heat, stirring constantly. With food processor running, slowly and carefully pour hot heavy cream through chute until chocolate mixture is melted and smooth, about 35 seconds, stopping to scrape down sides as needed. Pour pudding over brownie layer and gently press plastic wrap against surface of pudding. Refrigerate until completely chilled and set, at least 2 hours or up to 2 days.\nSerious Eats / Morgan Hunt Glaze\nFor the Whipped Cream:\nIn a large bowl, whip cream, sugar, and vanilla together using a hand mixer on medium speed until mixture holds medium-stiff peaks, 1 to 2 minutes. (Alternatively, in the bowl of a stand mixer fitted with the whisk attachment, whip cream, sugar, and vanilla together on medium speed until mixture holds medium-stiff peaks, about 1 to 3 minutes.) Using a flexible or offset spatula, spread whipped cream over chocolate pudding layer and garnish with chopped pecans.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nFood processor, 9-inch pie plate, hand mixer or stand mixer, fine-mesh sieve, plastic wrap, flexible or offset spatula\nNotes\nWhile we love the rich flavor espresso powder adds to the pudding and the way it intensifies the chocolate, it can be omitted in a pinch if you don't have it on hand.\nMake-Ahead and Storage\nThe crust can be baked, then cooled, covered, and refrigerated up to 3 days ahead.\nThe brownie layer can be assembled and baked through step 5 and refrigerated, covered, for up to 2 days.\nThe finished pie can be prepared through step 7 and refrigerated, covered, for up to 2 days. Top with the whipped cream and pecans right before serving.\nDesserts\nThe Latest\nPies\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mississippi-mud-pie.webp?"
}