{
  "url": "https://www.seriouseats.com/mission-style-burrito-carne-asada",
  "image_url": "https://www.seriouseats.com/thmb/lOdEqFZsV3LOzX5Pc2Y6XCJuvTs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201002-mission-style-burrito-jillian-atkinson-2-6841455590ed4c3981529b232166643a.jpg",
  "tags": [
    "American",
    "Skirt Steaks",
    "Beef Mains"
  ],
  "title": "Mission-Style Carne Asada Burrito Recipe",
  "full_text": "Mission-Style Carne Asada Burrito Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n5 hrs\nActive\n3 hrs\nTotal\n5 hrs 25 mins\nServes\n6\nMakes\n6 burritos\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Carne Asada:\n1/2\ncup\n(\n120\nml\n) fresh\norange juice\n(from about\n3\nwhole\nnavel oranges\n)\n1/2\nloosely packed cup\n(\n1.4\nounces\n;\n40\ng\n) finely chopped\ncilantro leaves\nand\ntender stems\n4\nmedium\ngarlic cloves\n, minced\n2\ntablespoons\n(\n30\nml\n) fresh\nlime juice\n(from\n1\nwhole\nlime\n)\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n2\nteaspoons\nwhole cumin seeds\n, toasted and ground (see note)\n2\nteaspoons\ndried oregano\n, preferably Mexican\n1 1/2\nteaspoons\nchipotle powder\n(see note)\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\nuse half as much by volume or the same weight\n1 1/2\npounds\n(\n680\ng\n)\nskirt steak\n, trimmed and cut with the grain into roughly 5-inch lengths\nFor the Beans:\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n1\nmedium\n(\n6\n-\nounce\n;\n180\ng\n)\nyellow onion\n, diced\n3\nmedium cloves\ngarlic\n, minced\n2\nteaspoons\nwhole cumin seeds\n, toasted and ground (see note)\n2\ndried bay leaves\n2\ncups\n(\n14\nounces\n;\n400\ng\n)\ndry pinto beans\n6\ncups\nhomemade chicken stock\nor store-bought,\nlow-sodium broth\nKosher salt\nFor the Rice:\n2\ntablespoons\n(\n30\nml\n)\nneutral oil\n, such as\nsunflower\n,\ncanola\n, or\nvegetable\n1 1/4\ncups\n(\n8.8\nounces\n;\n250\ng\n)\nlong grain rice\n, rinsed and drained\n1\nmedium\n(\n6\n-\nounce\n;\n180\ng\n)\nyellow onion\n, finely diced\n3\nmedium cloves\ngarlic\n, minced\n2\ntablespoons\ntomato paste\n2 1/4\ncups\n(\n530\nml\n)\nhomemade chicken stock\nor store-bought,\nlow-sodium broth\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\nTo Cook Carne Asada and Assemble Burritos:\nNeutral oil\n, such as\ncanola\n,\nvegetable\n, or\nsunflower\n, for greasing the skillet\nSix\n12- to 13-inch\nflour tortillas\n1\npound\n(\n455\ng\n)\nshredded Monterey Jack cheese\n1\nrecipe\nguacamole\n1\nrecipe\npico de gallo\n, drained of excess liquid\nSour cream\n, as needed\nDirections\nFor the Carne Asada Marinade:\nIn a 1-gallon zipper-lock bag, combine orange juice, cilantro, garlic, lime juice, olive oil, cumin, oregano, chipotle powder, and salt. Seal bag and lightly shake to thoroughly combine ingredients.\nOpen bag, add steak, then reseal the bag, pressing out excess air. Marinate in refrigerator for at least 3 and up to 8 hours, turning bag once halfway through.\nMeanwhile, for the Beans:\nIn a medium pot or Dutch oven, heat olive oil over medium-high heat until shimmering. Add onion and cook, stirring, until softened and just starting to brown, about 6 minutes. Stir in garlic, cumin, and bay leaves and cook until fragrant, about 30 seconds.\nAdd beans, chicken stock, and a large pinch of salt and bring to a boil over high heat. Reduce to a bare simmer, cover, and cook until beans are just tender, about 2 hours 30 minutes; add water at any point to keep beans covered.\nRemove lid and continue cooking, stirring occasionally, until beans are very soft and creamy, about 45 minutes longer; top up with water as needed to keep beans just covered. Once beans are fully softened, allow liquid to reduce into a rich, creamy broth. Season with salt, if needed. Discard the bay leaves. Leave covered until ready to serve, or transfer to an airtight container and refrigerate until ready to use; reheat before using.\nFor the Rice:\nIn a medium pot or Dutch oven, heat olive oil over medium-high heat until shimmering. Add rice and cook, stirring constantly, until very lightly toasted, about 2 minutes. Stir in onion and garlic and cook, stirring, until onion is just starting to soften and lightly brown, about 4 minutes. Stir in tomato paste and cook until slightly darkened, about 1 minute.\nAdd chicken stock and bring to boil. Reduce heat to bare simmer, cover, and cook for 15 minutes without disturbing. Remove from heat and let stand, covered, for 10 minutes. Uncover rice and gently fluff with a fork. Cover and keep warm until ready to use.\nTo Cook Carne Asada and Assemble Burritos:\nRemove skirt steak from marinade and blot dry.\nLight one chimney full of charcoal\n. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate. (For how to cook using a skillet, see note.)\nPlace steak directly over the hot side of the grill. If using a gas grill, cover; if using a charcoal grill, leave open. Cook, turning occasionally, until steak is well charred on outside and center registers 120°F (50°C) on an instant-read thermometer, 5 to 10 minutes total.\nTransfer skirt steak to a cutting board and allow to rest for 5 minutes. Slice thinly against the grain into 1/2-inch-thick slices, then cross-cut the slices into 1/2-inch cubes.\nWorking 1 tortilla at a time and using a pastry brush, lightly brush tortilla all over on one side with water. In a dry nonstick pan, warm tortilla, wet side down, over medium heat until warmed on first side and excess water has cooked off. Brush top side with water, then flip tortilla, add a generous sprinkle of cheese all over, and cook until cheese begins to melt. Transfer tortilla to a clean work surface.\nBeing careful not to overfill, spread an even layer of rice on top of tortilla, leaving at least 2 inches of border on either side and at least 3 inches of border above and below. Spoon beans on top of rice, followed by additional cheese, then the carne asada, guacamole, pico de gallo, and sour cream. Fold the tortilla sides in over the filling. Then roll the bottom flap of tortilla up over the filling, holding the sides tight as you roll. Continue rolling until the burrito is sealed. Wrap in foil for a tighter hold. Repeat with remaining tortillas and fillings, wiping out skillet between uses. Serve right away.\nSpecial Equipment\n12-inch\nnonstick skillet\n, medium pot or\nDutch oven\n,\ngrill\nor\nlarge cast iron skillet\nNotes\nTo toast cumin seeds, place in a small dry skillet, set over medium heat, and cook, tossing frequently, until fragrant.\nFor slightly spicier effect, increase chipotle powder to 2 teaspoons.\nTo cook the steak in a skillet, lightly grease a large cast iron skillet and heat over high heat until just starting to smoke. Working in batches if necessary and re-greasing the skillet between batches, cook skirt steak, flipping every 30 seconds, until well browned on both sides and the steaks register 120°F (50°C) on an instant-read thermometer, 5 to 10 minutes.\nMake-Ahead and Storage\nThe beans can be made up to three days in advance and refrigerated in an airtight container; rewarm gently before using, loosening with a small amount of water, if needed.\nRead More\nBurrito Styles Everyone Should Know\nGrilled Skirt Steak Fajitas\nBreakfast Burrito With Scrambled Egg, Chorizo, and Refried Beans\nMexican-Style Flour Tortillas\nAmerican\nSkirt Steaks\nBeef Mains"
}