{
  "url": "https://www.seriouseats.com/mixed-berry-trifle-recipe-6824132",
  "image_url": "https://www.seriouseats.com/thmb/tQrC9kkHydEX_IhIlODEFwX89UM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221205-Trifle-AmandaSuarez-hero-02-396176f5d69f447a96429af3e17ceeb0.JPG",
  "tags": [
    "Custards, Mousses & Puddings",
    "The Latest",
    "Fruit",
    "British"
  ],
  "title": "Mixed Berry Trifle",
  "full_text": "Mixed Berry Trifle\nClose\nJump to recipe\nPrep\n60 mins\nCook\n30 mins\nChilling Time:\n3 hrs\nTotal\n4 hrs 30 mins\nServes\n10\nto 12 servings\nMakes\n1 large trifle\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Jelly:\n3/4\ncup\n(150g) caster sugar (a.k.a. superfine sugar) or\ngranulated sugar\n, plus more to taste\n2\ntablespoons\n(30ml)\nfresh lemon juice\nfrom 1 lemon\n1\npound\n(450g)\nmixed berries\n, such as strawberries (halved if large), blueberries, raspberries, and/or pitted cherries, washed (see note)\nTwo 1/4-ounce envelopes\nunflavored gelatin\n(about 5 teaspoons;\n14\ng\n)\nFor Assembling the Trifle:\n1/2\nof an\n8-inch\ngenoise sponge cake\n, cut into 2- by 1-inch rectangles (see note)\n3 to 4\ntablespoons\ndry sherry\n(45ml to 60ml), optional\n12\nounces\n(about 350g)\nmixed berries\n, such as strawberries (halved if large), blueberries, raspberries, and/or pitted cherries, washed, plus extra for garnish if desired\nOne\nrecipe\ncrème légère\n1 1/2\ncups\n(350ml)\nheavy cream\n2\ntablespoons\n(25g) caster sugar (a.k.a. superfine sugar) or\ngranulated sugar,\nor to taste, optional\nSprinkles or\ntoasted sliced almonds\n, optional\nDirections\nPlace a 2-quart glass trifle bowl in refrigerator to chill.\nSerious Eats / Amanda Suarez\nTo Make the Jelly:\nIn a 3-quart saucepan, combine sugar, lemon juice, and 1 1/2 cups (350ml) water (see note) and heat over medium heat until sugar is completely dissolved. Add berries and bring to a boil. Reduce heat to maintain a simmer and cook, skimming any foam that accumulates on the surface, until berries are tender and have released their water, about 10 minutes (skimming off foam produces a clear jelly).\nSerious Eats / Amanda Suarez\nMeanwhile, in a small bowl, whisk together gelatin and 3 1/2 tablespoons (50ml) water. Set aside to let gelatin bloom.\nSerious Eats / Amanda Suarez\nStrain berry mixture through a fine-mesh strainer set over a medium heatproof bowl, pressing gently on berries to extract as much poaching liquid as possible. Transfer poached berries to a medium bowl and set aside. Pour poaching liquid into a 1-quart measuring cup and add enough additional cold water to reach 2 1/4 cups (550ml). Taste and adjust with sugar if needed.\nSerious Eats / Amanda Suarez\nPour 1/2 cup (120ml) of poaching liquid into now-empty saucepan and heat over low heat until steaming. Remove from heat and whisk in prepared gelatin mixture until homogenous and no gelatin lumps remain.\nSerious Eats / Amanda Suarez\nWhisk gelatin mixture into remaining poaching liquid, then transfer liquid to a medium bowl. Place bowl in an ice bath and chill, stirring occasionally, until jelly is slightly thickened and temperature reaches 60°F (16°C), 20 to 30 minutes.\nSerious Eats / Amanda Suarez\nTo Assemble the Trifle:\nRemove trifle bowl from refrigerator and set on work surface. Line bottom of bowl with genoise sponge cake, top with reserved poached berries, and drizzle with sherry (if using). Pour cooled jelly on top and return bowl to refrigerator until jelly is set, about 2 hours.\nSerious Eats / Amanda Suarez\nArrange fresh berries in an even layer on top of jelly (if desired, you can place the berries around the inside perimeter of the bowl in a decorative pattern, then fill the middle space with the remaining berries). Spread crème légère evenly over berries.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment, whisk heavy cream and sugar (if using) on medium-high speed until soft peaks form. The whipped cream should be spoonable and not stiff. (Alternatively, in a medium mixing bowl, whisk heavy cream by hand until soft peaks form).\nSerious Eats / Amanda Suarez\nSpoon whipped cream on top of crème légère and place trifle in refrigerator until cold, about 30 minutes. If desired, top whipped cream with additional berries, toasted almonds, or sprinkles. To serve, scoop generous portions into individual bowls and serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n2-quart glass trifle bowl, 3-quart saucepan, 1-quart measuring cup, stand mixer (optional)\nNotes\nFor the fruit, I highly recommend using what’s in season. Berries and stone fruit work best. If available, you can use a combination of berries, such as strawberries (halved if large), blueberries, and/or raspberries. For stone fruit, you can use pitted cherries; if using larger stone fruit, it’s best to keep the fruit in larger pieces: ripe peaches, nectarines, and plums should be pitted and cut into 2 to 3-inch cubes. Taste the fruit and add sugar if it needs sweetening.\nFor the poaching liquid, you can change this up to suit the fruit. For a berry trifle, a lot of flavor comes from the berries, so I recommend using water. Stone fruit, however, work well with a stronger poaching liquid like wine or tea. For example, poaching pears with the peel of one lemon, white wine and cardamom, or star anise and red wine, or poaching peaches in lemon verbena tea will result in a vibrant and flavourful jelly. If you are adding spices, like cinnamon sticks, cardamom pods or star anise, make sure to strain out and discard any aromatics before making the jelly.\nYou can use store-bought pound cake or ladyfingers in place of the genoise sponge cake. If using shop-bought pound cake, you will need around 3 1/2 to 5 1/4 ounces (about 100g to150g) pound cake. If using ladyfingers, you will need around 12 ladyfingers to fully line the bottom of the trifle bowl.\nMake-Ahead and Storage\nTrifle can be assembled 24 hours in advance with the whipped cream, or up to 48 hours in advance without the whipped cream (which can be added following Step 12).\nCustards, Mousses & Puddings\nThe Latest\nFruit\nBritish"
}