{
  "url": "https://www.seriouseats.com/mocha-tres-leches-cake-recipe-11705224",
  "image_url": "https://www.seriouseats.com/thmb/GXEwS0Io5r58dffVH3hg9umfNEU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250325-Mocha-Tres-Leches-Qi-Ai-hero-horizontal-angled-sliceonplate1-d28a688059d14c8faf44ba703b91475f.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Chocolate",
    "Desserts"
  ],
  "title": "Mocha Tres Leches Cake",
  "full_text": "Mocha Tres Leches Cake\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nCooling and Chilling Time:\n3 hrs\nTotal\n3 hrs 50 mins\nServes\n15\nMakes\n1 9- by 13-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n1/2\ncup\n(\n120\nml\n)\nvegetable oil\n, plus more for greasing\n10 1/4\nounces\nall-purpose flour\n(\n290\ng\n;\n2 1/4\ncups\n)\n1\ntablespoon\nbaking powder\n(\n1/2\nounce\n;\n15\ng\n)\n1 1/2\nounces\nDutch-process cocoa powder\n(\n40\ng\n;\n1/2\ncup\n)\n1/2\ncup\n(\n120\nml\n)\nwhole milk\n2\ntablespoons\n(\n10\ng\n)\ninstant espresso powder\n6\nlarge\neggs\n, separated (\n350\ng\n)\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n10 1/2\nounces\ngranulated sugar\n(\n300\ng\n;\n1 1/2\ncups\n)\nFor the Soaking Liquid:\n1\ncup\n(\n240\nml\n)\nheavy cream\nOne\n12-ounce can\nevaporated milk\nOne\n14-ounce can\nsweetened condensed milk\n2\nteaspoons\ninstant espresso powder\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nTo Assemble:\n1 1/2\ncups\n(\n355\nml\n)\nheavy cream\n2 1/2\ntablespoons\nconfectioners’ sugar\n(\n1 1/4\nounces\n;\n35\ng\n)\n4 1/2\nteaspoons\nDutch-process cocoa powder\n, divided\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\nground cinnamon\nDirections\nFor the Cake:\nAdjust oven rack to middle position and preheat to 325°F (160°C). Lightly grease a 9- by 13-inch baking pan with vegetable oil.\nSerious Eats / Qi Ai\nUsing a fine-mesh sieve, sift flour, baking powder, and cocoa powder into a medium bowl; set aside. In a small bowl, combine milk and instant espresso powder. Whisk until espresso powder is dissolved, then stir in vegetable oil. Set aside.\nSerious Eats / Qi Ai\nIn the bowl of a stand mixer fitted with the whisk attachment, combine egg whites and salt. Whip on medium speed until egg whites begin to froth, about 1 minute. Then, with mixer continuing to run at medium speed, slowly and steadily pour in sugar. Continue to whisk until meringue is glossy and reaches stiff peaks, about 8 minutes. Add yolks and beat until just combined\nSerious Eats / Qi Ai\nWith the stand mixer running on low, sprinkle in about 1/3 of the flour mixture, then drizzle in 1/3 of the milk and coffee mixture. Repeat with remaining flour and milk, and mix, using a flexible spatula to scrape the bowl and beaters as needed, until batter is well combined, 3 to 5 minutes. Using a flexible spatula, scrape the batter into the prepared pan and bake until a toothpick or cake tester inserted comes out clean and cake springs back when gently touched, 30 to 35 minutes. Set the pan on a wire rack and cool completely, about 1 hour. (Clean mixer bowl and set aside.)\nSerious Eats / Qi Ai\nFor the Soaking Liquid\n: In a medium bowl, combine heavy cream, evaporated milk, sweetened condensed milk, instant espresso powder, and salt, and whisk until espresso powder has dissolved, about 1 minute.\nSerious Eats / Qi Ai\nRun an offset spatula or butter knife around edges of cake to loosen. Invert cake onto a cutting board. Using a serrated knife, carefully remove top of cake to level it; set scraps aside for snacking or another use. Return the cake to the pan and, using a skewer or fork, poke holes across surface of cake. Pour half of the soaking liquid all over the cake. Let liquid fully absorb, about 5 minutes, then pour remaining liquid over cake. Loosely cover baking pan with plastic wrap and refrigerate until fully chilled, at least 2 hours and up to 24 hours.\nSerious Eats / Qi Ai\nTo Assemble:\nIn the now-clean bowl of a stand mixer fitted with the whisk attachment, combine heavy cream, confectioners’ sugar, 1 1/2 teaspoons cocoa powder, and salt. Beat on medium-high speed until medium-stiff peaks form, 2 to 4 minutes. Using a flexible or offset spatula, spread whipped cream over cake to cover.\nSerious Eats / Qi Ai\nUsing a fine-mesh sieve, sift remaining 3 tablespoons cocoa powder and cinnamon mixture over whipped cream. Slice and serve.\nSerious Eats / Qi Ai\nSpecial Equipment:\n9- by 13-inch baking pan, fine-mesh sieve, stand mixer, flexible spatula, toothpick or cake tester, offset spatula or butter knife\nMake-Ahead and Storage:\nOnce baked and cooled (through step 4), the cake can be tightly wrapped in plastic and refrigerated for up to 1 week or frozen for up to 3 months.\nThe cake should be served within 24 hours of soaking.\nCakes\nThe Latest\nChocolate\nDesserts"
}