{
  "url": "https://www.seriouseats.com/mocha-mascarpone-icebox-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/a2sCYMIFBp6JcIFtRoXLlEujNCo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190429-tates-chocolate-chip-cookie-ice-box-cake-vicky-wasik-21-ad903dc8a2d24e4e85f1592606e27ca8.jpg",
  "tags": [
    "Icebox Cake",
    "Summer Desserts",
    "American",
    "Chocolate",
    "Desserts"
  ],
  "title": "Mocha Mascarpone Icebox Cake Recipe",
  "full_text": "Mocha Mascarpone Icebox Cake Recipe\nClose\nJump to recipe\nPrep\n55 mins\nCook\n60 mins\nActive\n60 mins\nChilling and Standing Time\n6 hrs 5 mins\nTotal\n8 hrs\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookie Layers:\n1\nbatch\nunbaked\nTate's-style chocolate chip cookie dough\nFor the Filling:\n16\nounces\nmascarpone\n(about\n2\ncups\n;\n455\ng\n), cold\n16\nounces\nheavy cream\n(about\n2\ncups\n;\n455\ng\n), cold\n3\nounces\nbrown sugar\n(about\n1/3\ncup\n, firmly packed;\n85\ng\n)\n2\nounces\nbittersweet liqueur\n(about\n1/4\ncup\n;\n55\ng\n), such as\ncrème de cacao\nor\nKahlúa\n(see notes)\n1\nounce\nhigh-fat Dutch cocoa powder\n(about\n1/3\ncup\n;\n30\ng\n), sifted;\nsee our recommended Dutch cocoas here\n1 1/2\nteaspoons\ninstant espresso powder\n, plus more to taste\n1/4\nounce\nvanilla extract\n(about\n1 1/2\nteaspoons\n;\n7\ng\n), plus more to taste;\nsee our recommended vanilla extracts here\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for\ntable salt\n, use about half as much by volume or the same weight\nTo Serve:\nOne\n3-ounce\nchocolate bar\n6\nounces\nheavy cream\n(about\n3/4\ncup\n;\n170\ng\n)\nDirections\nFor the Cookie Layers:\nAdjust oven rack to middle position and preheat oven to 350°F (180°C). Portion raw cookie dough according to the recipe.\nTo bake cookies, line a half-sheet pan with parchment paper and trace two 8-inch circles on top, then flip the paper upside down. Arrange 7 portions of cookie dough within each circle, creating a daisy-like pattern. Bake until cookies have spread to fill each circle and turned thin and golden brown, with an even color from edge to center, about 20 minutes. While cookies are still hot, use a knife to gently nudge the soft dough within the bounds of the outlined circles, or trim as needed; reserve any trimmed scraps.\nSerious Eats / Vicky Wasik\nRepeat the baking process for a total of 5 cookie sheets. The remaining dough can then be baked as individual cookies, or frozen according to the directions in the original recipe to bake at a later time.\nFor the Filling:\nIn the bowl of a stand mixer fitted with a whisk attachment, combine mascarpone, heavy cream, brown sugar, liqueur, Dutch cocoa powder, instant espresso powder, vanilla extract, and salt. Mix on low speed until relatively homogeneous, then increase to medium and whip until mixture is thick enough to hold soft peaks. Taste (preferably using a cookie scrap reserved from trimming) and adjust seasoning as needed with additional salt, espresso powder, or vanilla to taste. Resume whipping on medium speed and continue whipping until cream is thick and stiff, like a frosting. Using your reserved cookie scraps, taste filling and add more salt, espresso powder, or other flavors to taste, if desired.\nTo Assemble:\nThis recipe requires an 8- by 4-inch nonreactive, loose-bottom aluminum pan; I use\nLloyd Pans' 8\"x4\" cheesecake pan\n. The recipe can also be adapted to a nonreactive springform pan of varying dimensions, although this will require individual adjustments along the way.\nPlace about 6 ounces (170g) of the whipped filling in the loose-bottom pan and spread it around the sides in an even layer, using an offset spatula. Nestle 1 prepared cookie sheet into the bottom of the pan, pressing gently to ensure it lies flat. (Don't worry if it happens to break or crack.) Top with about 7 1/4 ounces (205g) of prepared filling and spread into an even layer. Repeat with remaining cookies and cream, using up all the remaining cream so that the last cookie has no topping. Cover cake with foil and refrigerate for at least 6 hours and preferably no longer than 18 hours; chilling beyond this point may cause the cookie layer along the bottom to soften too much to be handled with ease.\nSerious Eats / Vicky Wasik\nTo Serve:\nJust before serving, make a few chocolate curls by running a stick peeler down the long edge of a chocolate bar, with a sheet of wax or parchment paper placed underneath to catch the curls. This works best with milk chocolate at about 70°F (21°C); the chocolate may be too brittle at cooler temperatures and tacky when warmer. Dark chocolate can also be shaved using the same technique, but this tends to work best when the chocolate is a few degrees warmer, as it can be quite brittle for shaving even at 70°F. Whip the heavy cream until it can hold medium-soft peaks.\nLet the chilled icebox cake stand at room temperature a few minutes to soften the exterior layer of cream. This will take about 5 minutes at roughly 70°F (21°C), or less time in warmer weather. In cooler months, it may help to briefly wrap the pan in a kitchen towel soaked in hot tap water.\nWhen ready to unmold, place the pan on a large can of tomatoes or a similarly sized object (something tall enough to lift the icebox cake at least 4 inches from the counter, and wide enough to form a stable base). With both hands on the sides of the pan, pull downward to drop the outer ring away from the bottom.\nSerious Eats / Vicky Wasik\nSlide an offset spatula or a wide, flat cookie spatula under the icebox cake, wiggle to loosen it from the pan, then slide your hand under and transfer the cake to a serving plate.\nSerious Eats / Vicky Wasik\nTop with whipped cream and chocolate curls. Cut into wedges using a large chef's knife, rinsing the blade clean under hot running water between slices. Serve immediately.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nServing and Storage Tips:\nThe exact shelf life of this cake will vary with how long it was refrigerated after assembly and before serving, as well as according to personal preference, as the cookies will begin to soften and disintegrate over time. Some may find this messy state of affairs wonderfully soft, while others may consider it mush. Likewise, when the cake is served as soon as possible, the cookies will remain quite toothsome and crisp; for some, this provides the perfect textural contrast, while for others, they may seem too hard.\nSpecial Equipment\nHalf-sheet pan\n,\nstand mixer\n, flexible spatula,\n8- by 4-inch loose-bottom pan\nor similar springform pan,\noffset spatula\nNotes\nWhile bittersweet liqueurs, such as crème de cacao or Kahlúa, will perfectly match the mocha profile of the cream, virtually any liqueur or spirit can be used to add a dash of contrasting or complementary flavor, so let your cravings (and your liquor cabinet) be your guide. A liqueur like triple sec or crème de menthe can add a hint of something fun and new, while a bourbon, rum, or\namaro\nmay blend more seamlessly with the chocolate and cream. Those who abstain from alcohol can simply increase the cream by 2 ounces (about 1/4 cup; 55g) instead.\nMake-Ahead and Storage\nStacked together on a wide, flat plate and wrapped tightly in plastic, the prepared cookie rounds can be kept at cool room temperature for up to 1 week. I prefer to serve the assembled cake within 18 hours, though it can be kept refrigerated for up to a few days; just remember that, as noted in the final step of the recipe, its texture will change over time, which may or may not be appealing.\nRead More\nTate's Style Thin and Crispy Chocolate Chip Cookies\nIcebox Cake\nSummer Desserts\nAmerican\nChocolate\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mocha-mascarpone-icebox-cake-recipe.webp?"
}