{
  "url": "https://www.seriouseats.com/mock-batch-homemade-keebler-soft-batch-cookie-copycat-recipe",
  "image_url": "https://www.seriouseats.com/thmb/e_0dBZtaKoJ5jQi0A-4gZimqm-0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__09__20110927MockBatch610-53063950c30749df9f697cdea6a4ba8f.jpg",
  "tags": [
    "Cookies",
    "North American",
    "Baking",
    "Chocolate"
  ],
  "title": "Mock Batches (Soft Batch Cookie Copy Cat) Recipe",
  "full_text": "Mock Batches (Soft Batch Cookie Copy Cat) Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n10 mins\nActive\n10 mins\nResting Time\n24 hrs\nTotal\n24 hrs 35 mins\nMakes\n24 small cookies\nCook Mode\n(Keep screen awake)\nIngredients\n5 1/2\nounces\nall purpose flour\n3/4\nounce\ncornstarch\n1/4\nounce\npowdered milk\n1 3/4\nounce\nmilk chocolate\n, chopped\n2\nounces\nneutral flavored oil\nlike safflower or peanut\n2\nounces\ndark corn syrup\n1 1/2\nounces\nbrown sugar\n1/4\ntsp\nbaking soda\n1\negg yolk\n1/2\nounce\nvanilla extract\nOrange gel paste food coloring\n(optional)\n1\nounce\nsemi-sweet mini chips\n, plus\n24\nextra for decorating\nDirections\nPreheat the oven to 350°F (175°C) and have two parchment-lined rimmed baking sheets at the ready. Sift together the flour, cornstarch, and powdered milk with a fine-mesh strainer into a bowl. Set aside.\nIn a medium bowl melt the milk chocolate, either in a microwave or over a water bath, and stir until it has cooled to body temperature. It's important the chocolate is not hot before proceeding to the next step. Once the chocolate has cooled, use a rubber spatula to stir in the oil, corn syrup, brown sugar, baking soda, egg yolk and vanilla extract. If you wish to use dye for a Soft Batch color match, use a toothpick to add just a little to the dough & stir it in with the spatula. Stir in the dry ingredients all at once with a spatula, then fold in the mini-chips (reserve 24 chips for garnish).\nUse a #60 ice cream scoop to divide the dough into about 24 equal portions. If you don't have a scoop, each portion should be approximately 1 heaping tablespoon—just take care, Soft Batch cookies are really quite small. If you'd like especially authentic cookies, roll each portion of dough between your hands and into a perfect sphere. The dough is soft, so its shape will relax slightly after you place it on the cookie sheet. Place 12 on each cookie sheet, spaced evenly. Garnish each with one mini chip, placed somewhere off center.\nBake for approximately 6 minutes or until the dough has puffed but not fully set. You may need to experiment to find the perfect time, but the important part is to take them out of the oven when the edges appear fully baked, but the center still seems puffed and damp. Do not overbake.\nCool the cookies directly on the tray for 10 minutes, then transfer to an airtight container while still slightly warm. Place a sheet of parchment or wax paper between each layer, as the cookies will readily fuse together if touching. Close the lid of the container and age the cookies for at least 24 hours. The cookies will stay soft and delicious at room temperature for up to two weeks.\nSpecial Equipment\nDigital scale\n,\nrimmed baking sheets\n, #60 ice cream scoop\nMake-Ahead and Storage\nStore in an airtight container at room temperature for up to 2 weeks.\nRead More\nBetter Batches (Soft Batch Cookie Upgrade) Recipe\nE.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies Recipe\nHomemade Oreo Cookies Recipe\nThe Food Lab's Chocolate Chip Cookies Recipe\nQuick and Easy Chocolate Chip Cookies Recipe\nCookies\nNorth American\nBaking\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mock-batches-soft-batch-cookie-copy-cat-recipe.webp?"
}