{
  "url": "https://www.seriouseats.com/mole-negro-recipe-11739614",
  "image_url": "https://www.seriouseats.com/thmb/XWVtYtjoDvw_kHYnF56_2RHJNAg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250521-SEA-MoleNegro-LorenaMasso-32-e0c5a8212f6f4f8ebc6916f304e1b911.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Mexican",
    "Chicken",
    "Recipes by World Cuisine"
  ],
  "title": "How to Make Mole Negro: Mexico’s Smokiest, Boldest Sauce",
  "full_text": "How to Make Mole Negro: Mexico’s Smokiest, Boldest Sauce\nClose\nJump to recipe\nPrep\n30 mins\nCook\n75 mins\nTotal\n105 mins\nServes\n16\nto 20\nMakes\n8 cups\nCook Mode\n(Keep screen awake)\nIngredients\n5\ntomatillos\n, husks removed, and halved (\n14\nounces\n;\n389\ng\n)\n3\nplum tomatoes\n, quartered (\n9\nounces\n;\n262\ng\n)\n1\nwhite onion\n, peeled and halved (\n8\nounces\n;\n224\ng\n)\n1\nripe\nplantain\n, peeled and halved (\n7\nounces\n;\n198\ng\n)\n5\ncloves\ngarlic\n, peeled\n8\ncups\n(\n2\nL\n)\nhomemade chicken stock\nor store-bought low-sodium chicken broth, divided\n6\npasilla negro chiles\n(\n58\ng\n), stems and seeds removed\n4\nancho chiles\n(\n40\ng\n), stems and seeds removed\n3\nmulato chiles\n(\n21\ng\n), stems and seeds removed\n3\nguajillo chiles\n(\n13\ng\n), stems and seeds removed\n2\nmorita chiles\n(\n4\ng\n), stems and seeds removed\n1\ncup\nlard\n(\n7\nounces\n;\n200\ng\n)\n1/4\ncup\nraw\nalmonds\n(\n40\ng\n)\n1/4\ncup\nunsalted\npeanuts\n(\n40\ng\n)\n1/4\ncup\nraw\npecans\n(\n30\ng\n)\n1\nteaspoon\nroasted\nsesame seeds\n, plus more for serving\n2\ncorn tortillas\n, quartered (\n60\ng\n)\n3\nslices\n(\n35\ng\n)\nbolillo or white bread\n1/4\n(\n50\ng\n)\ncup\npitted\nprunes\n, about\n7\n1/4\ncup\nraisins\n(\n35\ng\n)\n1\n(3-inch)\nstick\ncanela\n(Ceylon cinnamon) or\n1\n(1-inch)\npiece\ncassia cinnamon\n(\n4\ng\n)\n3\nwhole cloves\n3\nwhole\nallspice berries\n1\nteaspoon\nblack\npeppercorns\n1\nteaspoon\ncumin seeds\n1\nteaspoon\ndried thyme\n1\nteaspoon\ndried Mexican\noregano\n1\nteaspoon\nanise\nseeds\n1\ndried\nhoja santa leaf\n, optional (see notes)\n1\nd\nried avocado leaf\n, optional\n100\ng\n(about\n3.5\nounces\n)\nMexican drinking chocolate\n(such as Moctezuma or Ibarra), roughly chopped\nSugar\nto taste\nKosher salt\nto taste\nDirections\nAdjust oven rack to upper-middle position and preheat broiler to high. Place tomatillos, tomatoes, onion, plantain, and garlic on an aluminum foil–lined baking sheet, cut side down. Broil until charred and blistered on one side, 4 to 8 minutes. Transfer to blender. Add 1 cup chicken stock and blend, starting on low and increasing to high, until completely smooth, about 1 minute. Transfer to a large pot or Dutch oven.\nSerious Eats / Lorena Masso\nOn the now-empty foil-lined rimmed baking sheet, add pasilla, guajillo, ancho, mulato, and morita chiles. Broil until darkened, about 1 minute. Transfer to blender. Blend, starting on low and increasing to high until completely smooth. Add stock if necessary to thin out the mixture and scrape down sides of blender jar as needed. Add to puréed vegetables in large pot or Dutch oven.\nSerious Eats / Lorena Masso\nIn a large skillet, add lard and heat over medium-high heat until melted and shimmering. Add almonds, pecans, and peanuts, continuously stirring until lightly toasted and aromatic, about 3 minutes. Using a large slotted spoon, transfer solids to blender, leaving lard in skillet. Add toasted sesame seeds to blender with nuts.\nSerious Eats / Lorena Masso\nIn the remaining lard in skillet, add tortillas and bread. Fry over medium-high heat, flipping occasionally, until golden brown, about 2 minutes. Add prunes, raisins, and cinnamon. Keep frying until raisins and prunes slightly darken, about 2 minutes longer. Using a slotted spoon, transfer solids to blender, leaving lard in skillet.\nSerious Eats / Lorena Masso\nPour all but 2 tablespoons lard into the pot with puréed vegetables and chiles.\nSerious Eats / Lorena Masso\nTo the skillet, add cloves, anise seeds, allspice, black peppercorns, cumin, thyme, and oregano, and fry over medium-high heat until fragrant, about 1 minute. Transfer spices and all remaining lard from skillet to blender with bread and dried fruit. Add 2 cups chicken stock and blend on high speed until smooth, about 1 minute. Transfer to large pot with other puréed ingredients.\nSerious Eats / Lorena Masso\nAdd 4 cups of chicken stock to pot and stir to combine all ingredients until homogenous. Add hoja santa and avocado leaf, if using, and bring to a simmer over medium heat. Reduce heat to low and gently simmer, covered, stirring frequently, until flavors meld and mixture thickens further, 30 minutes.\nSerious Eats / Lorena Masso\nUse tongs and a slotted spoon to remove hoja santa and avocado leaf, if using. Add chocolate and stir until completely melted, about 5 minutes. Mole should be smooth and thick enough to coat the back of a spoon. If too gritty, blend further with an immersion blender, keeping the mole in the pot, or blend in batches in the traditional blender. If too thick, thin with water or chicken stock. Season to taste with salt and sugar. Serve with poached chicken, tortillas, and/or Mexican rice.\nSerious Eats / Lorena Masso\nSerious Eats / Lorena Masso\nSpecial Equipment\nBlender, Dutch oven or large pot, spider skimmer or large slotted spoon, tongs, traditional blender, immersion blender\nNotes\nI love adding dried hoja santa and avocado leaves for their herbal, licorice flavor, though they can be omitted if unavailable. These two leaves can be found in the spice section of most Mexican grocery stores.\nMake-Ahead and Storage\nLeftover mole can be refrigerated in an airtight container for up to 5 days or frozen for up to 4 months. If the mole separates when stored, briefly blend in a blender to recombine before reheating.\nThe Latest\nRecipes\nMexican\nChicken\nRecipes by World Cuisine"
}