{
  "url": "https://www.seriouseats.com/molokhia-recipe-egyptian-jute-mallow-soup-8627832",
  "image_url": "https://www.seriouseats.com/thmb/Y8YAbyT5bpgc8May3c3X-dkPIl8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240405-SEA-Molokhia-KevinWhite-14-405db3f90b1c4367a8ecac6e77beca96.jpg",
  "tags": [
    "Egyptian",
    "The Latest",
    "Soups"
  ],
  "title": "Molokhia (Egyptian Jute Mallow Soup)",
  "full_text": "Molokhia (Egyptian Jute Mallow Soup)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nPickling Time\n60 mins\nTotal\n95 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pickled Onions:\n1\ntablespoon\n(\n15\nml\n)\ndistilled white vinegar\n3\ntablespoons\n(\n45\nml\n) fresh\nlemon juice\nfrom\n1\nlarge\nlemon\n1\nmedium\nred onion\n(about\n8\nounces\n;\n226\ng\n), thinly sliced\nFor the Molokhia:\n2 to 2 1/2\ncups\n(\n240 to 360\nml\n)\nhomemade\nchicken stock\nor store-bought\nlow-sodium chicken broth\n, see notes\n14\nounces\n(\n400\ng\n) frozen minced\nmolokhia\n, fully defrosted (see notes)\n2\ntablespoons\n(\n7\ng\n) minced fresh\ncilantro\nleaves and tender stems, optional\n1\nmedium clove\ngarlic\n, minced (about\n1\nteaspoon\n)\n1\nmedium\ntomato\n(\n4\nounces\n;\n113\ng\n), grated, optional\nKosher salt\nFreshly ground black pepper\nFor The Tasha:\n6\nmedium cloves\ngarlic\n(\n30\ng\n), minced\n1 1/2\nteaspoons\ncoriander seeds\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use a\npinch\n2\ntablespoons\nghee\n(about\n1\nounce\n;\n28\ng\n)\nTo Serve (Optional)\nWarmed\npita\nVermicelli rice\nDirections\nFor the Pickled Onions\n: In a medium bowl, pour distilled white vinegar and lemon juice over thinly sliced onions. Set aside for at least an hour.\nSerious Eats / Kevin White\nFor the Molokhia:\nIn a 4-quart Dutch oven, heat chicken stock over low heat until just beginning to bubble, about 3 minutes, then reduce heat. Add thawed molokhia to warm broth, whisking until fully incorporated. Add cilantro, if using, and garlic, whisking well to incorporate. Bring molokhia to a gentle simmer, uncovered, over low heat and cook until edges begin to bubble, 5 to 7 minutes.  (Be careful not to let the soup boil.) If soup is too thick for your liking, add 1/2 cup chicken stock. If you prefer your molokhia soup less slimy, add the grated tomato.\nSerious Eats / Kevin White\nFor the Tasha\n: While the soup is cooking, in a mortar and pestle, pound garlic, coriander, and salt until smooth. In a small nonstick skillet, heat 2 tablespoons ghee over medium heat until shimmering. Add garlic and coriander paste and cook, stirring constantly to prevent burning, until fragrant and garlic is crispy and golden, about 1 1/2 minutes. Immediately add tasha to hot molokhia. (To catch any remaining bits of garlic and coriander, add a ladle of soup to the skillet, swirl, then add liquid back to the soup pot.) Remove from heat and season to taste.\nSerious Eats / Kevin White\nServe molokhia in individual soup bowls and garnish with pickled red onions with hot pita bread, vermicelli rice, roast chicken, and/or kabab halla, if desired.\nSerious Eats / Kevin White\nSpecial Equipment\n4-quart Dutch oven, mortar and pestle, whisk, nonstick skillet\nNotes\nFrozen minced molokhia can be found at Middle Eastern grocery stores.\nIf you are using fresh or frozen whole molokhia leaves, use a blender, immersion blender, or food processor to blend leaves (thawed first, if frozen) with 1 cup (240ml) warm broth until smooth. Add blended molokhia to the rest of the warm broth and proceed with recipe.\nMake-Ahead and Storage\nThe garlic and coriander paste can be frozen in an ice cube tray (top each cube with some olive oil), transferred to an airtight container or freezer bag, and stored in the freezer for up to 3 months. Use a cube or two each time you make molokhia soup.\nThe pickled onions can be made up to 2 days ahead.\nEgyptian\nThe Latest\nSoups"
}