{
  "url": "https://www.seriouseats.com/monkey-bread-recipe-11750031",
  "image_url": "https://www.seriouseats.com/thmb/ZLnmouA--dhVrtsSdIHb3bu8oYA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250606-SEA-MonkeyBread-QiAi-HERO-436c72075ecf427f9a90804d7fb77b93.jpg",
  "tags": [
    "Bread",
    "The Latest",
    "Recipes",
    "Snacks & Appetizers",
    "Breakfast & Brunch"
  ],
  "title": "This Homemade Monkey Bread Is Fluffy, Gooey, and Downright Delicious",
  "full_text": "This Homemade Monkey Bread Is Fluffy, Gooey, and Downright Delicious\nClose\nJump to recipe\nPrep\n45 mins\nCook\n40 mins\nTotal\n85 mins\nServes\n6\nto 8\nMakes\n1 8-inch round loaf\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\nNonstick spray\n240\nml\n(\n1\ncup\n)\nwhole milk\n, warmed to 100°F (38°C)\n60\nml\n(\n1/4\ncup\n)\nwater\n, warmed to 100°F (38°C)\n50\ng\ngranulated sugar\n(\n1 3/4\nounces\n;\n1/4\ncup\n)\n7\ng\n(\n2 1/4\nteaspoons\n)\nactive dry yeast\n42\ng\nunsalted butter\n(\n1 1/2\nounces\n;\n3\ntablespoons\n), melted\n7\ng\n(\n1 1/2\nteaspoons\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1\nlarge\negg\n, at room temperature or the same weight\n545\ng\nall-purpose flour\n(\n19 1/4\nounces\n;\n4 1/4\ncups\n)\nTo Assemble:\n265\ng\ngranulated sugar\n(\n9 1/3\nounces\n;\n1 1/3\ncups\n)\n6\ng\n(\n2 1/2\nteaspoons\n)\nground cinnamon\n113\ng\nunsalted butter\n(\n4\nounces\n;\n8\ntablespoons\n), melted\nFor the Brown Sugar Drizzle:\n113\ng\nunsalted butter\n(\n4\nounces\n; 8\ntablespoons\n)\n150\ng\nlight brown sugar\n(\n5 1/4\nounces\n; about\n3/4\ncup\n)\nDirections\nFor the Dough:\nUsing nonstick spray, generously grease a large mixing bowl and a 12-cup Bundt pan.\nSerious Eats / Qi Ai\nIn the bowl of a stand mixer fitted with the dough hook attachment or in a traditional bowl if kneading by hand, whisk milk, water, granulated sugar, and yeast to combine. Let sit until foamy, 4 to 5 minutes.\nSerious Eats / Qi Ai\nAdd melted butter, salt, egg, and half of the flour. See notes if kneading by hand. If using a stand mixer, add remaining flour and mix on low speed until no dry spots remain, 30 to 60 seconds. Increase speed to medium and mix, pausing to scrape down bottom and sides of the bowl with a flexible spatula or dough scraper as needed, until dough is elastic but still slightly sticky, 6 to 8 minutes.\nSerious Eats / Qi Ai\nUsing a dough scraper, scrape dough into greased bowl. Cover with greased plastic wrap and let sit at warm room temperature (75 to 80°F; 24 to 27°C) until doubled in size, 1 to 1 1/2 hours.\nSerious Eats / Qi Ai\nTo Assemble:\nIn a small bowl, whisk granulated sugar and ground cinnamon to combine.\nSerious Eats / Qi Ai\nPunch dough down. Tip dough onto unfloured countertop and pat into a rectangle approximately 14 by 8 inches in size. Using a sharp greased chef's knife, cut 6 strips of dough lengthwise and 8 strips of dough crosswise to create 48 portions of dough; each should weigh about 20 g (about 3/4 ounces). (See notes.)\nSerious Eats / Qi Ai\nWorking with one portion of dough at a time, shape by cupping the dough portion in your hand and rolling it in a circular motion until a tight ball forms. Dip each ball in melted butter and toss with cinnamon sugar to evenly coat. Because the butter can cause the cinnamon sugar to clump. I recommend scooping some of the cinnamon sugar into a separate bowl and using that—rather than the primary bowl—for rolling, and adding more cinnamon sugar as needed. Place ball in prepared Bundt pan. Repeat with remaining dough.\nSerious Eats / Qi Ai\nStretch greased plastic wrap across top of Bundt pan, cover, and let rise at warm room temperature (75 to 80°F; 24 to 27°C) until puffy and dough reaches top of the pan, 45 minutes to 1 hour.\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). When positioning the oven rack, make sure there isn't another rack directly above your loaf pan, or the bread will wrap itself around the rack as it bakes.\nFor the Brown Sugar Drizzle:\nIn a medium saucepan, melt butter over medium-low heat. Add brown sugar, whisking until fully dissolved and mixture resembles a thick syrup. (Do not boil.) Pour over monkey bread, distributing drizzle evenly across surface of dough. Tilt pan from side to side and tap gently on countertop, allowing syrup to sink down sides of pan and into cracks and open spots.\nSerious Eats/ Qi Ai\nBake until dough has risen 1/2 to 1 inch above pan, is deeply golden brown, and registers 200°F (93°) on an instant-read thermometer, 40 to 50 minutes. Let stand until just cool enough to touch, about 5 minutes. Top Bundt pan with a rimmed serving plate, then, using gloved hands or two kitchen towels, flip pan to carefully invert monkey bread onto plate. Using a serving spoon or rolling pin, gently tap top of pan to release loaf, scraping any additional syrup onto the bread. Let sit until just warm, 20 to 30 minutes. Serve warm.\nSerious Eats/ Qi Ai\nOptional Decorative Glaze\nIn a small bowl, whisk 50 g (1 3/4 ounces; 1/2 cup) confectioners' sugar, 2 to 3 teaspoons whole milk, and 1/2 teaspoon vanilla extract until smooth. Pipe or drizzle over cooled loaf.\nSpecial Equipment\n12-cup Bundt pan, stand mixer, bench scraper, whisk, rimmed serving plate\nNotes\nTo knead dough by hand:\nAfter whisking together melted butter, salt, and half of the flour, use a bench scraper to work in remaining flour until a sticky, lumpy dough forms.\nTurn out onto lightly floured countertop. Knead 8 to 10 minutes, or until dough is smooth, elastic, and just slightly sticky, 8 to 10 minutes.\nCutting the dough into squares ensures the correct number of balls and keeps them roughly the same size. Each strip should be roughly 1 1/2 inches wide, but don’t worry about being perfectly precise—some variation in size is fine.\nMake-Ahead and Storage\nMonkey bread tastes best on the day it is made. Leftover monkey bread can be stored in an airtight container or wrapped tightly in plastic wrap and kept at room temperature for up to 1 day.\nBread\nThe Latest\nRecipes\nSnacks & Appetizers\nBreakfast & Brunch",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-homemade-monkey-bread-is-fluffy-gooey-and-downright-delicious.webp?"
}