{
  "url": "https://www.seriouseats.com/montreal-smoked-meat-recipe",
  "image_url": "https://www.seriouseats.com/thmb/B0ds7Bxkb0eaB-nYjohFhNmF42A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240301-SEA-MontrealSmokedMeat-VyTran-hero-033f7f3419264171a5f8beb75b5e1fd0.jpg",
  "tags": [
    "Smoked Beef",
    "Canadian",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Grilled Beef"
  ],
  "title": "Montreal Smoked Meat Sandwich",
  "full_text": "Montreal Smoked Meat Sandwich\nClose\nJump to recipe\nPrep\n45 mins\nCook\n8 hrs\nActive\n60 mins\nCuring, Soaking, and Resting Total Time\n178 hrs\nTotal\n186 hrs 45 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor Curing the Brisket:\n3/4\ncup\n(\n108\ng\n) Diamond Crystal\nkosher salt;\nfor\ntable salt\n, use half as much by volume or the same weight\n3\ntablespoons\n(\n21\ng\n) freshly\nground black pepper\n3\ntablespoons\n(\n18\ng\n)\nground coriander\n1\ntablespoons\npink salt\n(\n22\ng\n), such as Prague Powder #1\n1\ntablespoons\n(\n13\ng\n)\nsugar\n1\nteaspoon\nground bay leaf\n(see notes)\n1\nteaspoon\nground clove\nOne\n10-12 pound\nwhole brisket\n(\n4.5 to 5.4\nkg\n), fat cap trimmed to 1/4 inch\nFor the Spice Rub\n3\ntablespoons\n(\n27\ng\n)\ncoarsely ground black pepper\n1\ntablespoons\n(\n6\ng\n)\nground coriander\n1\ntablespoons\n(\n7\ng\n)\npaprika\n1\ntablespoon\n(\n10\ng\n)\ngarlic powder\n1\ntablespoon\n(\n10\ng\n)\nonion powder\n1\nteaspoon\ndill weed\n1\nteaspoon\nground mustard\n1\nteaspoon\ncelery seed\n1\nteaspoon\ncrushed red pepper\nDirections\nFor Curing the Brisket:\nIn a small bowl, mix together the salt, black pepper, coriander, pink salt, sugar, bay leaf, and clove. Coat the entire brisket with the cure and place in a 2-gallon extra-large resealable plastic bag or transfer to a sheet tray and cover. Transfer to refrigerator and let cure for 7 days, flipping the brisket once every day.\nSerious Eats / Vy Tran\nRemove the brisket from bag and wash off as much of the salt mixture as possible under cold running water. Place brisket in a large container or roasting pan, add enough cold water to cover, and let soak for 2 hours, replacing water every 30 minutes. Fill with fresh water and soak the brisket overnight. Remove from water, rinse again, and pat dry with paper towels.\nSerious Eats / Vy Tran\nFor the Spice Rub:\nIn a small bowl, mix together black pepper, coriander, paprika, garlic powder, onion powder, dill weed, mustard, celery seed, and crushed red pepper. Coat the entire brisket with the rub right before setting up smoker or grill.\nSerious Eats / Vy Tran\nIf Using a Smoker:\nHeat and maintain the smoker temperature between 225 to 275°F (105 to 135℃) following manufacturer’s guidelines and tips (see notes). Nestle 3 to 4 (3-inch) wood chunks into coals or heat source. Set cooking grate in place and clean and oil the cooking grate.\nSerious Eats\nWhen wood is ignited and producing smoke, set brisket on cooking grate, fat side up, and smoke until an instant-read thermometer registers 170℉ (75℃) when inserted into thickest part of the brisket, 6 to 10 hours.\nSerious Eats\nRemove the brisket from the smoker and wrap tightly with a double layer of aluminum foil, making sure the foil is airtight. Return the foil-wrapped brisket to the cooking grate, fat side up, and continue to cook until meat registers 195 to 200℉ (95℃), 3 to 6 hours. Skip to Step 12.\nSerious Eats\nIf Using a Charcoal Grill:\nOpen bottom vent of charcoal grill completely. Arrange 54 charcoal briquettes in a 2-briquette-wide C shape around perimeter of grill, overlapping the briquettes slightly so they are touching and leaving an 8-inch gap between the ends of the C. Place second layer of 54 briquettes, also 2-briquettes wide, on top of the first. The arrangement should be 2 briquettes wide by 2 high.\nSerious Eats / Vy Tran\nEvenly space 5 (3-inch) wood chunks along the length of the C. Place a disposable aluminum pan on the grate, centered in the C, running lengthwise into gap of the C. Pour 6 cups of water into the pan.\nSerious Eats /Vy Tran\nLight chimney starter filled 1/4 of the way (pile briquettes on 1 side of chimney to help ignite). Once coals are partially covered with ash, use tongs if necessary to pour and pile the lit coals at 1 end of the C, making sure lit coals do not touch the other end of the C.\nSerious Eats / Vy Tran\nSet the cooking grate in place, then clean and oil grate. Place brisket, fat side down, directly over the watering pan, with the point end facing the gap in C. Cover the grill, position lid vent over the gap in C, and open the vent halfway. Cook, undisturbed, until the meat registers 170℉ (75℃), 4 to 6 hours.\nSerious Eats / Vy Tran\nRemove the brisket from the grill and wrap tightly with a double layer of aluminum foil, making sure the foil is airtight. Remove the cooking grate and, starting at the still-unlit end of the C, pour about 1/2 chimney (3 quarts) of unlit briquettes about halfway around the perimeter of the grill, over the gap in C and spent coals. Carefully pour 4 cups water into the disposable pan. Return the grilling grate.\nSerious Eats / Vy Tran\nReturn the foil-wrapped brisket to the grilling grate centered above the water pan, fat side down. Cover grill and continue to cook until meat registers 195 to 200℉ , 2 to 4 hours.\nFor Serving:\nTransfer the foil-wrapped brisket to an empty insulated cooler, fat side up. Close cooler and let rest for 2 to 3 hours.\nSerious Eats / Vy Tran\nTransfer the smoked brisket to a carving board. Using a sharp slicing knife, cut against grain 1/4-inch-thick slices (some shredding and scraps may occur). For serving as a sandwich, layer the sliced meat onto rye bread, then top with yellow mustard. Close sandwich and serve.\nSerious Eats / Vy Tran\nSpecial Equipment\n2-gallon zip-top bag or a large container\n, such as a roasting pan or\nbaking dish\n, for curing the brisket, large container or\nroasting pan\nfor soaking the brisket,\nsmoker\nor\ncharcoal grill\n; 3-inch wood chunks, such as oak or hickory, for smoking; aluminum foil; one (13- by 9-inch) disposable aluminum pan if using a charcoal grill;\ninsulated cooler\nNotes\nGround bay leaves can be purchase as a dried spice, or you can grind your own dried bay leaves using a spice grinder at home.\nIf using a charcoal smoker, nestle unlit charcoal briquettes into lit briquettes with one additional 3-inch wood chunk as needed to maintain cooking temperature between 225 to 275℉. If using a pellet smoker, do not add wood chunks, instead follow manufacturer’s instructions for using pellets.\nType of fire:\nIndirect\nGrill heat:\nLow\nMake-Ahead and Storage\nThe cooked brisket can be refrigerated in an airtight container for up to 2 weeks.\nSmoked Beef\nCanadian\nDairy-free Mains\nGluten-free Mains\nGrilled Beef"
}