{
  "url": "https://www.seriouseats.com/monte-cristo-recipe-8584235",
  "image_url": null,
  "tags": [
    "Ham",
    "The Latest",
    "Sandwiches"
  ],
  "title": "Monte Cristo",
  "full_text": "Monte Cristo\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nTotal\n25 mins\nServes\n2 sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Batter:\n1/2\ncup\nall-purpose flour\n(\n2 1/4\nounces\n;\n64\ng\n)\n1\nteaspoon\nbaking powder\n1/8\nteaspoon\nkosher salt\n; for\ntable salt\n, use a\npinch\n1/8\nteaspoon\nground nutmeg\n1/2\ncup\n(\n118\nml\n)\nwhole milk\n1\nlarge\negg\nFor the Sandwiches:\n1\ntablespoon\n(\n15\ng\n)\nmayonnaise\n, divided\n4\nslices\nhearty white sandwich bread\n2\nteaspoons\n(\n10\ng\n)\nDijon mustard\n, divided\n4\nounces\n(\n113\ng\n) shredded\nGruyère\nor\nSwiss cheese\n(about\n1\ncup\n), divided\n6\nounces\n(\n170\ng\n)\nthinly sliced ham\n(about\n12\nslices\n), divided\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\nPowdered sugar\nfor serving, optional\nRaspberry preserves\nfor serving, optional\nDirections\nFor the batter:\nIn a shallow baking dish or pie plate, whisk flour, baking powder, salt, and nutmeg until combined. In a small bowl, whisk milk and egg until combined. Whisk milk mixture into the flour mixture until a smooth batter is formed. Batter should be thick enough to coat the back of a spoon; set aside until ready to use.\nSerious Eats / Victor Protasio\nFor the Sandwiches:\nPlace 4 slices of bread on a clean work surface. Spread 2 slices with mayonnaise and 2 slices with mustard. Set aside.\nSerious Eats / Victor Protasio\nLayer 1/4 cup (about 1 ounce) of the cheese on each mayonnaise-coated bread slice, top with the ham, divided evenly between the 2 slices. Top with the remaining cheese (1/4 cup per sandwich). Close each sandwich with the remaining bread slices, mustard side down. Press firmly to adhere.\nSerious Eats / Victor Protasio\nWorking with 1 sandwich at a time, use a fish spatula and hands to dip and turn the sandwich in the prepared batter to coat evenly. Transfer the sandwich to a large plate and repeat with remaining sandwich.\nSerious Eats / Victor Protasio\nIn a large nonstick skillet, melt butter over medium heat, swirling to coat the pan evenly, until foaming. Carefully transfer the sandwiches to the skillet and cook until golden brown on bottom, 3 to 4 minutes. Using 2 spatulas, carefully flip the sandwiches. Set a cast-iron skillet or Dutch oven directly on the sandwiches to press them. Continue to cook until the bottom side is golden brown, 3 to 4 minutes.\nSerious Eats / Victor Protasio\nTransfer sandwiches to a clean wire rack set in a rimmed baking sheet and let cool for 5 minutes. Cut sandwiches in half and dust with powdered sugar, if using. Serve with raspberry jam on the side, if using.\nSerious Eats / Victor Protasio\nSpecial Equipment\nDutch oven, fish spatula\nNotes\nFor less mess and for ease of handling, cut sandwich into halves or quarters before dredging.\nUsing two large fish spatulas to flip the sandwich (over/under) carefully in the hot oil is the most seamless way to do it.\nMake-Ahead and Storage\nOnce the sandwiches are dredged, they should be prepared immediately. Batter and sandwiches, however, can be prepared ahead of time separately.\nHam\nThe Latest\nSandwiches"
}