{
  "url": "https://www.seriouseats.com/moong-dal-recipe-8744764",
  "image_url": "https://www.seriouseats.com/thmb/TNC8y_wAh8_qgnOBRvIJw-0Ut3c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241031-SEA-MoongDal-KanikaJatinSharma-Hero1-32-342336772b894c2a8f664b8260c3f96f.jpg",
  "tags": [
    "Mung Beans",
    "The Latest",
    "Indian",
    "Vegetarian"
  ],
  "title": "Moong Dal",
  "full_text": "Moong Dal\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nSoaking Time\n2 hrs\nTotal\n2 hrs 45 mins\nServes\n4\nMakes\n6 cups\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dal:\n1 cup whole\ndried mung beans\n(7 ounces;\n200\ng\n); see notes\n1\nteaspoon\nground turmeric\n1\ntablespoon\nDiamond Crystal\nkosher salt\n, plus more as needed; for table salt, use half as much by volume\nFor the Masala:\n2\ntablespoons\n(30ml)\nvegetable oil\n1/4\nteaspoon\nasafoetida\n1\nteaspoon\ncumin seeds\n1\nteaspoon\nblack\nmustard seeds\nOne\n2-inch piece\nginger\n, peeled and minced\n5\nmedium\ncloves\ngarlic\n(25g), peeled and minced\n1\nsmall green\nchile\n, such as serrano, stemmed, seeded, and chopped\n1\nmedium\nyellow onion\n(8 ounces; 226g), chopped\n2\ntablespoons\nground coriander\n1\ntablespoon\nground red\nchile\npowder, preferably Kashmiri\n2\nmedium\nripe\nplum tomatoes\n, cut into 1-inch pieces\n1 1/2\nteaspoons\nfresh\nlime juice\nfrom 1 large lime, plus more as needed\nTo Serve:\nCilantro leaves\n1 tablespoon\nghee\n(about\n3/4\nounce\n; 18g)\nCooked white rice\n, such as basmati or jasmine (optional)\nRoti\n(optional)\nDirections\nPlace mung beans in a large bowl and cover by 2 inches cool water. Using your hands, vigorously swish mung beans until water turns cloudy, taking care to remove any stones or grit, about 30 seconds. Using a fine-mesh strainer, drain mung beans, discarding cloudy water. Repeat until water runs clear, 3 or 4 more times.  Return mung beans to a bowl and add enough cool water to cover by 3 inches; soak at room temperature at least 2 hours and up to 12.\nSerious Eats / Kanika and Jatin Sharma\nUsing a fine-mesh strainer, drain mung beans. In a medium pot or Dutch oven, combine mung beans, 6 cups (1.4L) water, ground turmeric, and salt. Bring to a boil over high heat. Reduce heat to medium and simmer until beans have cracked open slightly, about 30 minutes. (They should not be mushy.)\nSerious Eats / Kanika and Jatin Sharma\nFor the Masala:\nIn a medium saucepan heat oil over medium heat until shimmering. Add asafoetida, cumin seeds, and mustard seeds. Cook, allowing the seeds to sizzle and pop, about 10 seconds, then add ginger and garlic. Cook, stirring frequently, until fragrant, 1 minute. Add green chile and onion and cook, stirring frequently, until translucent and beginning to soften, 3 to 4 minutes. Add coriander and chile powder, and cook, stirring frequently, until fragrant, 1 to 2 minutes. Add tomatoes and cook until softened and broken down, 3 to 4 minutes.\nSerious Eats / Kanika and Jatin Sharma\nTransfer masala to cooked mung beans and stir to combine. Bring to a simmer and season to taste with salt and lime juice as needed. Remove from heat, then stir in cilantro and 1 tablespoon ghee. Serve immediately with white rice, roti, or as an accompaniment to any Indian meal.\nSerious Eats / Kanika and Jatin Sharma\nNotes\nWhole dried mung beans are available online and at many South Asian grocery stores.\nMake-Ahead and Storage\nMoong dal can be refrigerated in an airtight container for up to 3 days. Moong dal can be frozen in an airtight container for up to 3 months; to thaw, place in fridge overnight. Reheat gently on the stovetop or in the microwave.\nMung Beans\nThe Latest\nIndian\nVegetarian"
}