{
  "url": "https://www.seriouseats.com/moravian-sugar-cake-recipe-8703484",
  "image_url": "https://www.seriouseats.com/thmb/OlfrOQmP18C_uC6vTAd2NNPP3tQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240827-SEA-MoravianSugarCake-LorenaMasso-hero-05834b7fe06445bcb2abe2ae15d72347.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Baking",
    "Desserts"
  ],
  "title": "Moravian Sugar Cake",
  "full_text": "Moravian Sugar Cake\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nProofing Time\n3 hrs\nTotal\n4 hrs 5 mins\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Mashed Potatoes:\n1 medium\nrusset potato\n(about 8 ounces;\n226\ng\n), peeled and cut into 1-inch pieces\nFor the Dough:\n42g\nunsalted butter\n, melted (\n1 1/2\nounces\n; 3 tablespoons)\n224\ng\nall-purpose flour\n(8 ounces; 1 3/4 cups)\n6\ng\n(2 teaspoons)\ninstant yeast\n, see notes\n67g\ngranulated sugar\n(\n2 1/3\nounce\ns; 1/3 cup)\n1/4\ncup\n(60ml) lukewarm\nwater\n1/4\ncup\nmashed potatoes\n(2 ounces; 60g), from above (see notes)\n1\nlarge\negg\n, at room temperature\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nNonstick\ncooking spray\nFor the Topping:\n132g\nlight brown sugar\n(about\n4 3/4\nounces\n; 2/3 cup)\n6\ng\n(2 teaspoons)\nground cinnamon\n70g\nunsalted butter\n(about\n2 1/2\nounces\n; 5 tablespoons), melted in a spouted measuring cup\nDirections\nPlace cut potato in a medium saucepan and cover with cold water. Set saucepan over medium-high heat and bring to a boil, then reduce heat to a gentle simmer. Cook until potatoes are tender, about 20 minutes. Using a colander, drain potatoes. Set a ricer over now-empty pot and pass potatoes through; set aside. (See notes.)\nSerious Eats / Lorena Masso\nButter an 8- by 8-inch square aluminum baking pan and a large bowl.\nSerious Eats / Lorena Masso\nFor the Dough:\nIn a medium bowl, whisk flour and yeast to combine; set aside.\nSerious Eats / Lorena Masso\nIn the bowl of a stand mixer, whisk sugar, water, potatoes, butter, egg, and salt to combine. Add flour and yeast mixture and, using a bench scraper, bring ingredients together and gently knead until a lumpy paste forms, about 10 seconds.\nSerious Eats / Lorena Masso\nIn a stand mixer fitted with dough hook attachment, mix dough on medium speed, scraping down sides of bowl as needed, until a sticky dough forms, about 5 minutes. (The dough will cling to the hook and sides of the bowl and resemble a soft, stretchy cake batter.) See notes below for instructions for making the dough by hand.\nSerious Eats / Lorena Masso\nUsing nonstick cooking spray, grease bench scraper. Use greased bench scraper to turn dough out into prepared bowl. Cover tightly with plastic wrap and allow dough to rise at room temperature until doubled in size, 1 1/2 to 2 hours.\nSerious Eats / Lorena Masso\nUsing a greased bench scraper or greased hands, transfer dough to prepared baking pan. Gently press dough into prepared pan. Grease a piece of plastic wrap large enough to cover the baking pan; cover with plastic wrap, greased side down, and allow dough to rise until puffy and doubled in size, 45 minutes to 1 hour.\nSerious Eats / Lorena Masso\nAdjust oven rack to middle position and preheat oven to 375°F (190°C).\nFor the Topping:\nIn a small bowl, whisk brown sugar and cinnamon to combine. Dip fingertips in melted butter and make 25 to 30 deep indentations in the dough. Fill each indentation with a generous pinch of the sugar mixture, then press down gently with your index finger. Sprinkle dough with remaining sugar mixture. Drizzle thin rows of melted butter in a criss-cross pattern over dough, avoiding large pools or puddles as much as possible.\nSerious Eats / Lorena Masso\nBake in preheated oven until dough is a deep golden brown with crisp corners,  27 to 30 minutes. Remove cake from oven and let sit in pan on a wire rack until just cool enough to remove, about 20 minutes. Run a butter knife or an offset spatula around the edges of the pan and turn cake out onto wire rack and let cool until just slightly warm, about 30 minutes. Use a serrated knife to slice into squares. Serve warm.\nSerious Eats / Lorena Masso\nSpecial Equipment\nMedium saucepan, ricer, 8- by 8-inch aluminum baking pan, stand mixer, bench scraper, wire rack, butter knife or offset spatula\nNotes\nTo use instant mashed potatoes, prepare them according to directions on box. Measure out 1/4 cup mashed potatoes (2 ounces; 60g) and proceed with recipe.\nIf using a potato masher, place potato in a medium bowl and mash with a potato masher until smooth. (Pass potato through a fine-mesh sieve to smooth out lumps if necessary.)\nTo use active dry yeast:\nAdd water to the bowl of a stand mixer. Sprinkle yeast, along with a pinch of granulated sugar and let sit until bubbly, 5 to 10 minutes. Whisk in sugar, potatoes, butter, egg, and salt. Add flour and proceed with recipe as written.\nTo make the dough by hand:\nIn a medium bowl, whisk flour and yeast to combine. In a large bowl, whisk sugar, water, potatoes, butter, egg, and salt to combine. Add flour and yeast mixture and use a bench scraper to combine. Use scraper to spread dough up sides of bowl, then bring back together in the middle. Repeat until a sticky, stretchy dough forms, about 5 minutes. Tip dough into clean, buttered bowl to rise.\nThe cake will fall apart if you remove it immediately after baking, but will stick to the pan if completely cool. To remove, flip upside-down onto a plate, then onto a wire rack.\nMake-Ahead and Storage\nMoravian sugar cake is best on the day it is made. Wrap leftover cake tightly in plastic wrap and store at room temperature for up to 1 day.\nCakes\nThe Latest\nBaking\nDesserts"
}