{
  "url": "https://www.seriouseats.com/moresqueta-mexican-braised-pork-and-rice-recipe-8718127",
  "image_url": "https://www.seriouseats.com/thmb/eaxxug2rrimLlogPyM9YE4z5C90=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240924-SEA-Morisqueta-Lorena-Masso-Hero2-16-d3c3269520d74e4080e20549ff231ebe.jpg",
  "tags": [
    "Pork",
    "The Latest",
    "Mexican",
    "White Rice"
  ],
  "title": "Morisqueta (Rice Smothered With Pork Ribs and Salsa)",
  "full_text": "Morisqueta (Rice Smothered With Pork Ribs and Salsa)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n75 mins\nRefrigeration Time\n4 hrs\nTotal\n6 hrs 15 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Ribs:\n2\npounds\n(905g)\npork sparerib\nchunks or use one 2 1/2 pound-rack pork spareribs, membrane removed, halved crosswise and cut into 1-bone sections (see notes)\nKosher\nsalt\nand\nfreshly\nground black pepper\nFor the Salsa:\n1\n/2\nlarge\nwhite onion,\npeeled (5 ounces; 142g)\n4\nplum tomatoes\n,\nhalved\n(450g)\n2\njalapeño chiles,\ns\ntemmed and halved\n5\nmedium\ncloves garlic\n(25g)\n1\nteaspoon\nchicken bouillon powder\n1\nteaspoon black\npeppercorns\n1/2\nteaspoon\ncumin seeds\nKosh\ner\nsalt\nFor Serving:\n1\nrecipe\ncooked white rice\n1\nrecipe\nPerfect\nFrijoles Refritos\nCr\nem\na\nCotija\nch\neese\nThinly\nsliced\nscallions\n, optional\nDirections\nFor the Ribs:\nGenerously season pork with kosher salt and pepper. Set meat on a large plate or on a wire rack set in a rimmed baking sheet and refrigerate, uncovered, for at least 4 hours or up to 12 hours.\nSerious Eats / Lorena Masso\nIn a large stockpot or Dutch oven, bring two quarts of water to a boil over high heat. Place a parchment-lined steamer basket above the water. Spread the ribs in an even layer in the steamer. Steam, covered, checking and maintaining water at a simmer and topping off with more water as needed, about every 20 minutes, until the ribs are tender when pierced with a paring knife or fork, but not spoon tender, 60 to 90 minutes. Set the meat aside to cool.\nOnce cool enough to handle, using a fork, wiggle and push the bones out of the ribs. Use your fingers to feel for any remaining small bits of bone in the pork and use kitchen shears to trim them out if needed. (If preferred, you can leave the bones in the ribs.)\nSerious Eats / Lorena Masso\nFor the Salsa:\nMeanwhile, adjust the oven rack to upper position, 6 to 8 inches away from the broiler, and preheat broiler. Line a rimmed baking sheet with aluminum foil or parchment paper and spread the onion, tomatoes, jalapeños, and garlic in an even layer. Broil until deeply charred, about 7 minutes, then flip all the ingredients and broil until charred on second side, 3 minutes longer.\nSerious Eats / Lorena Masso\nIn a blender, blend the charred onion, tomatoes, jalapeños, garlic, chicken bouillon powder, black peppercorns, and cumin seeds on high speed until smooth, stopping to scrape down sides of blender jar as needed, about 1 minute. Season to taste with salt.\nSerious Eats / Lorena Masso\nFor Serving:\nIn a 12-inch sauté pan or stainless-steel or nonstick skillet, add oil and deboned pork and cook over medium-low heat, stirring occasionally until browned and crisped all over, 6 to 8 minutes. Add the prepared sauce and stir to completely coat the meat and cook until sauce is warmed through and clings to the ribs, 3 to 5 minutes.\nSerious Eats / Lorena Masso\nTo assemble, add rice to the bottom of individual serving bowls. Top it with the prepared beans, the ribs with their sauce, crema, cotija, and scallions. Drizzle a couple additional spoonfuls of the rib sauce onto each plate.\nSerious Eats / Lorena Masso\nSpecial Equipment\nLarge stockpot or Dutch oven, steamer basket, parchment paper, 12-inch sauté pan or stainless-steel skillet\nNotes\nYou can find cut ribs labeled trocitos de costilla at many Latin grocers, or labeled as spareribs for stew at many Asian grocers. But if you can’t find the ribs precut, you can purchase one roughly 2 1/2-pound rack of spareribs and have your butcher cut them for you, or cut them yourself at home (though you’ll need a sharp cleaver for that). Or, if you don’t feel like dealing with bones at all, you can use boneless country-style ribs.\nMake-Ahead and Storage\nThe ribs can be steamed up to 3 days in advance and stored in an airtight container in the refrigerator.\nThe salsa can be blended and refrigerated in an airtight container for up to 2 days before continuing with step 6.\nLeftovers can be stored in an airtight container for up to 3 days. Reheat the ribs with the sauce in a skillet until warmed through before serving.\nPork\nThe Latest\nMexican\nWhite Rice",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/morisqueta-rice-smothered-with-pork-ribs-and-salsa.webp?"
}