{
  "url": "https://www.seriouseats.com/more-ultimateest-perfect-sliders-recipe",
  "image_url": "https://www.seriouseats.com/thmb/1sVDaCPnRMnZZkb2brxBeQXJ_NQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241107-SEA-UltimatePerfectSlider-TwoBites-Hero2-28-ff581dec818b43f1be7b4ec5f761814b.jpg",
  "tags": [
    "Burgers",
    "American",
    "Stovetop Beef",
    "Ground Beef"
  ],
  "title": "(More) Ultimate(est) Perfect Sliders Recipe",
  "full_text": "(More) Ultimate(est) Perfect Sliders Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n20 mins\nTotal\n45 mins\nServes\n8 sliders\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\nvegetable oil\n2\nlarge\nonions\n, split in half from pole to pole and sliced thinly from pole to pole (about\n2\ncups\n)\nKosher salt\n(see notes)\n1\npound\nfreshly\nground beef\n, divided into eight 2-ounce portions\nFreshly ground black pepper\n(see notes)\n8\nsmall\nhamburger buns\n4\nslices\nAmerican cheese\n, split in half\n16\ndill pickle\nslices\nMustard\n,\nketchup\n, and\nmayonnaise\n, as desired\nDirections\nHeat vegetable oil in 10-inch cast iron or nonstick skillet over medium-high heat until shimmering. Add half of onions and pinch of salt and cook, stirring frequently, until light golden brown, about 3 minutes. Add 2 tablespoons water and continue to cook, stirring frequently, until onions are deep brown and thin layer of browned onion juice coats bottom of pan, about 4 minutes longer. Remove pan from heat and transfer onions to a small bowl. Add raw onions to cooked onions and toss thoroughly to combine.\nSerious Eats / Two Bites\nReturn skillet to heat and place 4 beef balls evenly over surface. Using wide, flat spatula, smash balls into circles approximately 4 inches wide and 1/4-inch thick. Reduce heat to low. Season with salt and pepper (or seasoned salt, if desired, see notes). Divide half of onion mixture evenly on top of each patty and press into meat with bottom of spatula. Cook for 1 minute. Carefully flip patties so that onions are in contact with skillet.\nSerious Eats / Two Bites\nPlace bottom buns upside down on top of patties and top with top buns. Place clean folded kitchen towel on top of burgers so that all burgers are covered and towel drapes over edges of pan (be careful to keep pan away from direct flame). Continue to cook until burgers are cooked through and buns are fully softened with steam, about 2 minutes.\nSerious Eats / Two Bites\nRemove towel. Remove top and bottom buns from burgers. Place 1/2 slice cheese on top of each patty and return top bun to burgers. Cover with kitchen towel and continue to cook until cheese is fully melted, about 1 minute longer. Meanwhile, place 2 pickle slices and condiments as desired on bottom bun. Lift towel. Transfer burgers, onions, cheese, and top buns to bottom buns. Serve and repeat steps 2 through 4 with remaining burgers.\nSerious Eats / Two Bites\nSpecial Equipment\nClean kitchen towel\nNotes\nIf you like seasoned salt (like\nLawry's\n), you can replace the salt and pepper with it.\nRead More\nThe Ultimate Sliders\nThe In-N-Out/Telway/White Manna Ultimate Animal-Style Slider Mashup\nThe Blue Label Burger Blend\nBurger Recipes\nBurgers\nAmerican\nStovetop Beef\nGround Beef",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/more-ultimateest-perfect-sliders-recipe.webp?"
}