{
  "url": "https://www.seriouseats.com/mornay-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/E7LNA7R-lOMkxXy62GCgrDV5ECk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__09__20160901-bechamel-sauce-vicky-wasik-11-cdb54a7a215542a9bea561d384e67bc1.jpg",
  "tags": [
    "Condiments & Sauces",
    "French",
    "Stovetop",
    "Dairy Milk"
  ],
  "title": "Classic Mornay Sauce (Cheesy White Sauce) Recipe",
  "full_text": "Classic Mornay Sauce (Cheesy White Sauce) Recipe\nClose\nJump to recipe\nCook\n10 mins\nActive\n5 mins\nTotal\n10 mins\nServes\n8 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ntablespoons\nunsalted butter\n(\n3/4\nounce\n;\n20\ng\n)\n1 1/2\ntablespoons\n(\n12\ng\n)\nall-purpose flour\n1\ncup\n(\n240\nml\n)\nwhole milk\nKosher salt\nand freshly ground black pepper\nFreshly grated nutmeg\n, to taste (optional)\n2\nounces\n(\n55\ng\n) finely grated\nSwiss\nor\nGruyère cheese\nDirections\nIn a small saucepan, melt butter over medium-high heat (do not allow it to brown). Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added.\nHeat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until sauce is thick enough to coat the back of a wooden spoon, about 3 minutes.\nSeason with salt and pepper. Add nutmeg to taste, if using. If any lumps form, simply whisk thoroughly to remove them and smooth out sauce, or use an\nimmersion blender\nor\ncountertop blender\nif lumps are particularly large or tough. Working in 2 or 3 additions, whisk in cheese, incorporating each addition just as the one before it is on the verge of fully melting; make sure to keep the heat low after the cheese goes in, as too much heat can cause the sauce to break. Remove from heat.\nUse sauce right away, or press a piece of plastic wrap over surface of sauce to prevent a skin from forming and keep warm until ready to use. Sauce can be cooled and stored in a sealed container in the refrigerator for several days. Reheat very gently on the stovetop or in the microwave before use.\nSpecial Equipment\nWhisk\nMake-Ahead and Storage\nThe finished sauce can be used right away, or cooled and stored in a sealed container in the refrigerator for several days. Reheat very gently on the stovetop or in the microwave before use.\nRead More\nMornay and Mushroom Duxelles Burger With Crispy Shallots Recipe\nClassic Baked Macaroni and Cheese Casserole With Cheddar and Gruyère\nCondiments & Sauces\nFrench\nStovetop\nDairy Milk",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/classic-mornay-sauce-cheesy-white-sauce-recipe.webp?"
}