{
  "url": "https://www.seriouseats.com/mornay-mushroom-burger-recipe",
  "image_url": "https://www.seriouseats.com/thmb/dBZhBXwi-Mztig37keLbiC4y-Ts=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__20140730-burger-toppings-week-mornay-mushroom-burger-vicky-wasik-1-943d7d77bfe34a4c971b7df921e905be.jpg",
  "tags": [
    "Burgers",
    "Grilled Beef",
    "Stovetop Beef",
    "Ground Beef",
    "Mushrooms"
  ],
  "title": "Mornay and Mushroom Duxelles Burger With Crispy Shallots Recipe",
  "full_text": "Mornay and Mushroom Duxelles Burger With Crispy Shallots Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nActive\n40 mins\nResting Time\n5 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nmedium\nshallots\n, roughly chopped\n20\nounces\ncremini mushrooms\n, roughly chopped\n4 1/2\ntablespoons\nunsalted butter\n, divided\n1\ntablespoon\nloosely packed\nfresh marjoram leaves\n, finely chopped\nKosher salt\nand freshly ground black pepper\n1 1/2\ntablespoons\nall-purpose flour\n1\ncup\nmilk\n3/4\ncup\ngrated Gruyère cheese\n(about\n4\nounces\n)\n1 1/2\npounds\nfreshly\nground beef chuck\n, preferably about 80 percent lean, formed into\n4\n(4 1/2 inch wide)\npatties\n4\nonion rolls\n, split and toasted\n1\nrecipe\nFried Shallots\nDirections\nIn a food processor, process shallots until minced, then scrape into a small bowl. Add mushrooms and process until minced, scraping down sides as necessary. Heat 3 tablespoons butter in a medium pot over medium-high heat until foaming. Add shallots and cook, stirring, until tender, about 3 minutes. Add mushrooms and cook, stirring, until water has released and evaporated, about 3 minutes. Continue to cook mushrooms, scraping up browned bits from bottom frequently, until darkened and fragrant, about 8 minutes. Stir in marjoram, season with salt and pepper and cook mushroom duxelles for 1 minute longer. Set aside.\nIn a small saucepan, heat remaining 1 1/2 tablespoons butter with flour over medium-high heat until butter has melted and formed a paste with flour. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisk in milk until smooth and cook, whisking, until sauce comes to a simmer and begins to thicken slightly. Lower heat to low and cook, stirring, until sauce is thick enough to coat back of a wooden spoon, about 3 minutes. Whisk in cheese until smooth, moving saucepan on and off heat to keep it hot enough to melt cheese but not so hot that it bubbles rapidly. Season Mornay sauce with salt and pepper and set aside.\nSeason patties generously with salt and pepper. Cook to desired doneness on a hot grill or in a skillet on the stovetop, 125°'F for medium rare or 135°'F for medium. Transfer to a plate and allow to rest for 5 minutes.\nRewarm mushroom duxelles and Mornay sauce if necessary. Spread mushroom on bottom bun halves, top with patties, then spoon sauce on top. Sprinkle fried shallots all over, close hamburgers, and serve immediately.\nSpecial equipment\nFood processor\nThis Recipe Appears In\nBurger Toppings Week: Insane Mornay and Mushroom Duxelles Burger\nBurgers\nGrilled Beef\nStovetop Beef\nGround Beef\nMushrooms",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mornay-and-mushroom-duxelles-burger-with-crispy-shallots-recipe.webp?"
}