{
  "url": "https://www.seriouseats.com/moroccan-phyllo-cake-with-almonds-mhanncha-recipe",
  "image_url": "https://www.seriouseats.com/thmb/dQCAvuLYVAz5MXybW6oc62fXtS8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__04__20130425-wakeandbake-moroccansnakecake-6fc0f4b39021499abca8947227f0e5db.JPG",
  "tags": [
    "Pastries",
    "Moroccan",
    "Almonds",
    "Desserts"
  ],
  "title": "Moroccan Almond Phyllo Pastries (A Take On M'hanncha) Recipe",
  "full_text": "Moroccan Almond Phyllo Pastries (A Take On M'hanncha) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n40 mins\nChilling and Cooling Time\n50 mins\nTotal\n110 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1 1/2\ncups\nraw almonds\n1/2\ncup\nconfectioners' sugar\n1/2\nteaspoon\ncinnamon\n1/4\nteaspoon\ncardamom\n1\nlarge\negg yolk\n1/2\nteaspoon\nvanilla\n6\ntablespoons\nbutter\n, melted\nFor Assembly:\n12\n(12- by 17-inch) sheets\nphyllo dough\n8\ntablespoons\n(\n1\nstick\n)\nbutter\n, melted\nConfectioners' sugar\n, for dusting\nDirections\nFor filling\n: In the bowl of a food processor, combine almonds and confectioners' sugar and pulse until a coarse meal. Add cinnamon, cardamom, egg yolk, vanilla, and butter and pulse until mixture is a paste. It doesn't have to be completely smooth though the almonds should be ground very fine. Cover paste with plastic wrap and refrigerate for 30 minutes.\nAdjust oven rack to middle position and preheat oven to 350°F. Line a baking sheet with parchment paper.\nLay one sheet of phyllo on prepared baking sheet. Brush with butter then fold in half lengthwise, creating a 6- by 8 1/2-inch rectangle. Brush top of rectangle with more butter, then lay a second sheet of phyllo on top, placing it so that the long edge on the one side is aligned (new sheet of phyllo should hang off the other edge). Brush the aligned-half of the top sheet of phyllo with more butter and fold over to match the 6- by 8 1/2-inch rectangle formed by the first. You should end up with a stack of phyllo that is four sheets thick. Repeat with two more pieces of phyllo to produce a 6- by 8 1/2-inch stack of phyllo 8 layers thick.\nRepeat step 3 with remaining 8 sheets phyllo dough, forming three rectangles of 8 layers each total.\nDivide almond filling into three equal parts. Roll one part into a 8 1/2-inch log. Lay log alongside phyllo then roll up, jelly roll style, to form a rope. Curl rope into a tight coil and brush with butter.\nRepeat steps 3 and 4 twice more, creating two more coils. Bake coils until golden, about 40 minutes. Let cool completely then dust with confectioners' sugar. Serve warm or at room temperature.\nSpecial equipment\nFood processor, pastry brush, baking sheet, parchment paper\nThis Recipe Appears In\nWake and Bake: Moroccan Almond Phyllo Pastries\nPastries\nMoroccan\nAlmonds\nDesserts"
}