{
  "url": "https://www.seriouseats.com/moroccan-kefta-recipe-7109915",
  "image_url": "https://www.seriouseats.com/thmb/SfNubcPduTW8NFxZZkhmBpOcdko=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230301-DuPree-Kefta-and-Bell-Pepper-Briouats-01-67183b78c9e348a29330cf1c34fd0d46.JPG",
  "tags": [
    "The Latest",
    "Snacks & Appetizers",
    "North African",
    "Ground Beef",
    "Hors D'Oeuvres"
  ],
  "title": "Moroccan Kefta and Bell Pepper Briouats (Ground Meat and Bell Pepper Pastries)",
  "full_text": "Moroccan Kefta and Bell Pepper Briouats (Ground Meat and Bell Pepper Pastries)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nCooling Time\n30 mins\nTotal\n90 mins\nServes\n8 servings\nMakes\n16 pieces\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1\nlarge\nyellow onion\n(\n9\nounces\n;\n250\ng\n), finely chopped (\n1 1/2\ncups\nchopped)\n1/2\ncup\n(\n2 1/2\nounces\n;\n70\ng\n)\nfinely chopped red bell pepper\n(from\n1\nsmall\n7-ounce/200 g pepper)\n1/2\ncup\n(\n2 1/2\nounces\n;\n70\ng\n)\nfinely chopped green bell pepper\n(from\n1\nsmall\n7-ounce/200 g pepper)\n2\ntablespoons\n(\n10\ng\n) finely chopped\nfresh flat-leaf parsley\n1\nteaspoon\nground\npaprika\n1\nteaspoon\nground cumin\n1\nteaspoon\nground coriander\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n, or more to taste; for table salt use half as much by volume\n1/4\nteaspoon\nground cayenne pepper\n, if desired\n6\nounces\n(\n170\ng\n)\nground beef\n(15 to 20% fat)\nTo Assemble and Cook:\n16\nsheets\nfilo pastry\n(\n8\nounces\n,\n227\ng\n)\n1\ncup\n(\n240\nml\n) frying oil such as canola or\nsunflower oil\nFor the Sauce and to Serve:\n3\ntablespoons\n(\n45\nml\n)\nmayonnaise\n2\ntablespoons\n(\n30\nml\n)\nharissa paste\n1\ntablespoon\n(\n15\nml\n)\nwater\nDirections\nFor the Filling:\nIn a large saucepan, heat olive oil over medium heat until shimmering. Add the onions, cover, and cook, stirring often, until onions are soft and translucent, 8 to 10 minutes. Uncover and cook, stirring occasionally, until all the liquid evaporates, 3 to 5 minutes longer.\nAdd red and green bell peppers, parsley, paprika, ground cumin, ground coriander, salt, and cayenne (if using) and cook, stirring often, until peppers are soft, 8 to 10 minutes.\nAdd ground beef and cook over medium heat, breaking up the meat with a wooden spoon,   until no longer pink and all the liquid has evaporated, 3 to 5  minutes. Transfer to a bowl, then adjust seasoning, adding more salt if necessary. Cool filling to room temperature, about 30 minutes; alternatively, transfer filling to an airtight container and refrigerate for up to 2 days. Once filling has cooled to room temperature, strain the filling if you notice a large amount of pooled oil (this may not be necessary, unless the meat had a very high fat percentage).\nMeanwhile, for the Sauce:\nWhisk together mayonnaise, harissa, and water in a small bowl until smooth and creamy. Set aside or refrigerate in an airtight container for up to 2 days.\nTo Assemble and Cook:\nUnroll the filo pastry sheets and, using a sharp knife, pizza wheel, or scissors, cut them into 6- by 11-inch strips. Cover filo strips with a damp towel until ready to use to prevent them from drying out.\nPlace one filo strip on a clean work surface, with the short side facing you. Fold it in half like a book, bringing the left edge to meet the right edge, to create a strip that is 3-by-11 inches. Place a heaping tablespoon of filling (about 20g) about 1 inch from the bottom of the strip towards the right side. Fold the left bottom corner of the filo strip over filling to tightly enclose and form a triangle. Continue folding the triangle, flipping right and then left until you reach the end of the strip. Use a sharp knife or scissors to trim any excess filo pastry. Place folded briouats seam-side down on a tray and cover loosely until ready to fry. Repeat with remaining filo strips and filling.\nSerious Eats / Greg Dupree\nIn a Dutch oven or high-sided skillet, heat oil over medium-high heat until oil reaches 350°F (180°C) on an instant-read thermometer. Working in batches, carefully transfer briouats to the oil, placing them folded side down. Fry briouats until the underside is golden, then flip the briouats over and continue frying until both sides are golden and crisp, about 2 to 3 minutes in total. Use a slotted spoon or tongs to transfer briouats to a paper towel-lined plate. Repeat until all the briouats are fried.\nServe briouats immediately with sauce.\nMake-Ahead and Storage\nThe premade filling will keep for up to 2 days refrigerated.\nThe Latest\nSnacks & Appetizers\nNorth African\nGround Beef\nHors D'Oeuvres"
}