{
  "url": "https://www.seriouseats.com/moroccan-mint-tea-granita-recipe-11744521",
  "image_url": "https://www.seriouseats.com/thmb/FPx326kYlnxoYKadK_kGBAwxDOw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250529-SEA-MoroccanMintTeaGranita-JatinSharma-HERO-d8afd5744ed141a296934b1a1181657d.jpg",
  "tags": [
    "Summer Desserts",
    "The Latest",
    "Recipes",
    "Desserts",
    "Summer"
  ],
  "title": "This 3-Ingredient Granita Is My Ultimate Summer Refresher",
  "full_text": "This 3-Ingredient Granita Is My Ultimate Summer Refresher\nClose\nJump to recipe\nCook\n15 mins\nCooling and Freezing Time:\n3 hrs 25 mins\nTotal\n3 hrs 40 mins\nCook Mode\n(Keep screen awake)\nIngredients\n3\ncups\n(\n720\nml\n)\nwater\n2\ntablespoons\nloose-leaf gunpowder\ngreen tea\n(see notes)\n6\ntablespoons\ngranulated sugar\n1\nlarge bunch\nfresh mint\n(about\n10\nsprigs\n), leaves roughly chopped (about\n1\npacked\ncup\n), plus more leaves for garnish, if desired\n2\nteaspoons\norange\nblossom water, or more to taste (optional)\nDirections\nIn a medium saucepan, bring water to a boil over medium-high heat. Add gunpowder green tea, chopped mint, and sugar, reduce heat to low, and let simmer for 1 minute. Turn off heat and let steep for 15 minutes.\nSerious Eats/ Jatin Sharma\nStrain tea through a fine-mesh strainer set over a heatproof container or large spoutd liquid measuring cup or jug, discarding tea leaves and mint.\nSerious Eats/ Jatin Sharma\nAllow tea to cool to room temperature, about 1 hour. (To speed this up, place container in a larger bowl filled with ice water for about 25 minutes.)\nSerious Eats/ Jatin Sharma\nOnce cooled, add orange blossom water, if using. Adjust with more to taste, if desired.\nSerious Eats/ Jatin Sharma\nPour tea into a shallow, freezer-safe 8-by-8-inch baking pan. Freeze until firm, about 1 hour. Use a fork to scrape the mixture, breaking up any ice crystals. Return to freezer and repeat freezing and scraping process every 30 minutes for about 2 to 3 hours(5 to 7 freezing intervals) total, or until the granita is fully frozen into fluffy crystals.\nSerious Eats/ Jatin Sharma\nSpoon into serving glasses or bowls and garnish with fresh mint, if desired. Serve immediately,\nSerious Eats/ Jatin Sharma\nSpecial Equipment\nMedium saucepan, fine-mesh strainer, 8-by-8-inch baking pan\nNotes\nYou can easily source gunpowder green tea online through retailers such as Amazon and the Tea Spot, or find it at tea shops and well-stocked grocery stores,.\nMake-Ahead and Storage\nThe granita can be frozen and stored for up to 4 months.\nSummer Desserts\nThe Latest\nRecipes\nDesserts\nSummer"
}