{
  "url": "https://www.seriouseats.com/msakhan-recipe-5219618",
  "image_url": "https://www.seriouseats.com/thmb/EW6j4ry5rLgY0vadAMeqlQsK0Js=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-msakhan-vicky-wasik-36-8583aa93caa4496c81497db85c96a905.jpg",
  "tags": [
    "Chicken",
    "Onions",
    "Middle Eastern",
    "The Latest"
  ],
  "title": "Msakhan (Palestinian Flatbreads With Onion, Sumac, and Spiced Roast Chicken)",
  "full_text": "Msakhan (Palestinian Flatbreads With Onion, Sumac, and Spiced Roast Chicken)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nTotal\n75 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n4\nskin-on, bone-in chicken legs\nand/or\nbreasts\n(about\n2 1/4\npounds\n;\n1\nkg\n)\n1 1/2\ntablespoons\n(\n22\nml\n)\nextra-virgin olive oil\n1\nteaspoon\nsumac\n3/4\nteaspoon\nground allspice\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\nground cumin\nKosher salt\nFor the Onions:\n6\ntablespoons\n(\n90\nml\n)\nextra-virgin olive oil\n5\nmedium\nyellow onions\n(\n2 1/2\npounds\n;\n1.1\nkg\n), cut into 1/4-inch dice\n1 3/4\nteaspoons\n(\n7.5\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use about half as much by volume or the same weight\n1\ntablespoon\n(\n10\ng\n)\nsumac\n1 1/2\nteaspoons\n(\n6\ng\n) ground\nground cumin\n1/2\nteaspoon\nground cinnamon\n1/2\nteaspoon\nground black pepper\n1/4\ncup\n(\n60\nml\n)\nhomemade chicken stock\nor\nlow-sodium store-bought broth\n, or\nwater\nTo Serve:\nFour\n8-inch\ntaboon breads\nor good-quality\npita\nor\nnaan\n(see note)\nSumac\n, for sprinkling\n1/2\ncup\n(\n2 1/2\nounces\n;\n70\ng\n)\npine nuts\nand/or\nslivered almonds, toasted\n(see note)\nDirections\nFor the chicken:\nAdjust oven rack to middle position and preheat oven to 450°F (230°C). Line a rimmed baking sheet with parchment. In a small bowl, stir together the olive oil, sumac, allspice, black pepper, and cumin. Arrange chicken, skin side up, on prepared baking sheet and season all over with salt. Rub all over with spiced oil, pushing some under the skin. Roast chicken until an instant-read thermometer inserted into the thickest part registers 150°F (66°C) for the breast, about 25 minutes, or 175°F (80°C) for the legs, about 30 minutes. Let chicken rest 15 minutes, reserving any accumulated juices for the onions.\nSerious Eats / Vicky Wasik\nMeanwhile, for the onions:\nIn a medium Dutch oven or large skillet or sauté pan set over medium-low heat, stir together the olive oil, onions, and salt, and cook, stirring occasionally, until the onions have softened completely and are turning golden around some edges, about 30 minutes; adjust heat as needed to either speed up or slow down the rate of cooking so that it's gentle but active.\nSerious Eats / Vicky Wasik\nStir in the sumac, cumin, cinnamon, black pepper, and chicken broth, along with any reserved chicken juices, and cook, stirring often, until onions have cooked down to a jammy and glazed consistency, about 10 minutes longer. Remove from the heat and set aside.\nSerious Eats / Vicky Wasik\nTo serve:\nTurn on broiler and position top rack about 4 to 6 inches from broiler element. Line a rimmed baking sheet with parchment. Working with one flatbread at a time, moisten the edges of each flatbread by dipping it into the oily glaze on the surface of the onion mixture and rotating it around. Set the flatbread on the prepared baking sheet.\nSerious Eats / Vicky Wasik\nSpoon about a quarter of the onion mixture onto the flatbread and spread it around in an even layer, leaving a thin border around the edge (similar to pizza). Sprinkle all over with sumac and toasted pine nuts. Repeat with remaining flatbreads, onions, sumac, and pine nuts, stacking them one on top of the other (this keeps them moist, especially as you start to broil them).\nSerious Eats / Vicky Wasik\nIf chicken has cooled too much, insert it under the broiler just long enough to rewarm and re-crisp the skin. Working with one or two flat breads at a time, arrange in a single layer on a baking sheet and broil until the flatbread's edges have browned in spots, 1 to 4 minutes (keep a close eye on them as broiler strength can vary quite a bit). Transfer each flatbread to a plate, top with a whole piece of chicken, and serve.\nSerious Eats / Vicky Wasik\nNotes\nTaboon bread is best for this dish, but a sturdy flatbread, like homemade or store-bought pocketless pita or naan will do in a pinch.\nTo toast pine nuts: Toss nuts with 1 tablespoon olive oil, place on a microwave-safe plate, and microwave at 1 minute intervals, stirring in between, until golden brown and toasty, about 3 minutes total; alternatively, toast by tossing the nuts with 1 tablespoon olive oil and cooking over medium-low heat in a skillet, stirring constantly, until toasted, about 5 minutes total.\nMake-Ahead and Storage\nThe prepared onion mixture can be refrigerated for up to 3 days in an airtight container, then reheated just before assembly.\nChicken\nOnions\nMiddle Eastern\nThe Latest"
}