{
  "url": "https://www.seriouseats.com/muhammara-recipe-11725275",
  "image_url": "https://www.seriouseats.com/thmb/FfF33le55U8qUqxZDwTBJmCFuBo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250429-SEA-Muhammara-MelatiCitrawireja-11-e3d35d59591742cfa6d9100d99cb7eac.jpg",
  "tags": [
    "Dips",
    "The Latest",
    "Recipes",
    "Bell Peppers",
    "Middle Eastern"
  ],
  "title": "Muhammara: The Bold Middle Eastern Spread You'll Want on Everything",
  "full_text": "Muhammara: The Bold Middle Eastern Spread You'll Want on Everything\nClose\nJump to recipe\nPrep\n45 mins\nRefrigeration Time:\n60 mins\nTotal\n105 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n4\nounces\n;\n113\ng\n), plus\n2\ntablespoons\n(\n3/4\nounce\n;\n21\ng\n) unroasted\nwalnuts\n, divided\n1/2\ncup\npanko\nbreadcrumbs (\n1.5\nounces\n;\n43\ng\n)\n2\npounds\n(\n907\ng\n)\nred bell peppers\n, seeded and chopped\n1\nsmall\nyellow onion\n(\n6\nounces\n;\n170\ng), chopped\n1/3\ncup\n(\n80\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n1/4\ncup\nplus\n1\nteaspoon\nMiddle Eastern jarred mild red pepper paste\nor spread (\n2 1/2\nounces\n;\n71\ng\n) (see notes)\n1/4\ncup\n(\n60\nml\n)\npomegranate molasses\n(see notes)\n2\nteaspoons\n(\n10\nml\n)\nfresh lemon juice\n2 3/4\nteaspoons\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n1 1/2\nteaspoons\nground coriander\n1 1/2\nteaspoons\nground cumin\n1\nteaspoon\nground\nAleppo pepper\n(see notes)\n1/2\nteaspoon\nground allspice\n1/4\nteaspoon\nblack pepper\n2\ntablespoons\npomegranate seeds\n(\n1\nounce\n;\n28\ng\n), optional\nMint\nsprig\nor\n5 to 7\npicked\nmint\nleaves\nfor garnish, optional\nPita bread\nfor serving\nDirections\nIn the bowl of a food processor, process 1 cup walnuts until very finely chopped (do not process into a paste), about 30 seconds. Transfer to a large bowl and set aside.\nSerious Eats / Melati Citrawireja\nAdd panko to the now-empty food processor bowl and process until fine, about 45 seconds. Transfer to the same bowl with the walnuts; set aside.\nSerious Eats / Melati Citrawireja\nLine a fine-mesh strainer with cheesecloth and place it over a separate large bowl. Process peppers until very finely chopped, scraping sides of bowl as needed, about 1 1/2 minutes. Transfer to prepared strainer. Process onions in now-empty food processor bowl until fine, scraping sides of bowl as needed, about 1 minute. Add onions to strainer with processed peppers. Allow mixture to strain, occasionally pressing it with a rubber spatula and discarding liquid as it accumulates, until mixture is thickened and most of liquid has drained, about 30 minutes. Once strained, wrap the cheesecloth around the mixture and squeeze firmly over strainer until only a light stream of liquid is released.\nSerious Eats / Melati Citrawireja\nTransfer drained pepper-onion mixture to bowl with walnuts. Add olive oil, red pepper paste, pomegranate molasses, lemon juice, salt, coriander, cumin, Aleppo pepper, allspice, and black pepper. Mix well to combine. Cover and refrigerate for at least 1 hour to allow the flavors to meld.\nSerious Eats / Melati Citrawireja\nTransfer muhammara to a serving dish and drizzle generously with olive oil. Cut the remaining 2 tablespoons walnuts in half lengthwise. Top muhammara decoratively with walnuts and pomegranate seeds, if using. Garnish with a mint sprig or leaves for decoration, if using. Serve with pita.\nSerious Eats / Melati Citrawireja\nSpecial Equipment\nKitchen scale, food processor, fine-mesh strainer, cheesecloth, rubber spatula\nNotes\nThis recipe can easily be doubled or halved. Process bell peppers and onions in two batches if doubling muhammara.\nFor the best results, use pure pomegranate molasses without added sugar. Pomegranate molasses is available at Middle Eastern and Iranian grocery stores and is increasingly stocked in American supermarkets. If you can't source pomegranate molasses, try\nmaking your own\n.\nRed pepper paste, also often labeled as jarred mild pepper spread, can be found in Middle Eastern, Turkish, and Greek grocery stores, and is also often available in many American grocery stores.\nGround Aleppo pepper can be found in Middle Eastern grocery stores. If unavailable, substitute 1 teaspoon Aleppo pepper with 3/4 teaspoon sweet paprika and 1/8 teaspoon cayenne.\nMake-Ahead and Storage\nMuhammara can be refrigerated in an air-tight container for up to 1 week.\nDips\nThe Latest\nRecipes\nBell Peppers\nMiddle Eastern"
}