{
  "url": "https://www.seriouseats.com/mumallaengi-muchim-marinated-dried-radish-banchan",
  "image_url": "https://www.seriouseats.com/thmb/U2Xjep1CD6DpPmkd-tSmFjuekI0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201015-banchan-thanksgiving-dried-radish-cucumber-vicky-wasik-9b-a178e685b80e4daaa078cdadf5e1c1d9.jpg",
  "tags": [
    "Radishes",
    "Korean",
    "Vegetarian Snacks & Appetizers",
    "No-Cook",
    "Snacks & Appetizers"
  ],
  "title": "Mumallaengi-Muchim (Korean Marinated Dried Radish Banchan) Recipe",
  "full_text": "Mumallaengi-Muchim (Korean Marinated Dried Radish Banchan) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nActive\n10 mins\nDrain\n35 mins\nTotal\n50 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nPersian cucumbers\n(about\n5 1/2\nounces\n;\n160\ng\n), sliced into 1/2-inch-thick rounds (see notes)\n1\nteaspoon\n(\n4\ng\n)\nkosher salt\n; if using table salt, use half as much by volume\n1 1/2\nounces\n(\n1 1/3\ncups\n;\n40\ng\n)\ndried Korean radish\n(see notes)\n1/2\nsmall\nonion\n(about\n3 1/2\nounces\n;\n100\ng\n), sliced into 1/2-inch-thick pieces\n2\ntablespoons\n(\n16\ng\n)\ngochugaru (Korean chile flakes)\n3\ntablespoons\n(\n45\nml\n)\ntoasted sesame oil\n3\ntablespoons\n(\n60\ng\n)\ngochujang\n2\ntablespoons\n(\n30\nml\n)\ncider vinegar\n2\ntablespoons\n(\n30\nml\n)\nhoney\n1\ntablespoon\n(\n15\nml)\nfish sauce\n2\ngarlic cloves\n(\n10\ng\n), finely chopped\n1\nteaspoon\n(\n4\ng\n)\nfreshly ground black pepper\n1/4\ncup\n(\n32\ng\n)\ntoasted sesame seeds\n, plus extra for sprinkling\nDirections\nIn a medium bowl, toss cucumbers with salt and, using clean hands, massage cucumbers until they are well coated and just begin to release liquid, about 30 seconds. Transfer cucumbers to a colander; wipe out bowl. Cut a round of parchment paper large enough to cover surface of cucumbers and place over cucumbers. Place a weight on top of parchment to press down on cucumbers (canned goods, a cast iron skillet, a mixing bowl filled with water, or a\nChef's Press\nall make good weights). Set aside to drain for 30 minutes. After 30 minutes, transfer cucumbers to a paper towel-lined plate and blot dry. Set aside.\nMeanwhile, combine dried radish and 2 cups (475ml) cold water in now-empty bowl. In a separate small bowl, combine sliced onion and 1 cup (240ml) cold water. Soak radish and onion for 20 minutes. After 20 minutes, drain radish and onion, and squeeze out as much water from the radish as possible; discard soaking water. Wipe out both bowls and combine cucumbers, radish, and onion in medium bowl. Add gochugaru and gently massage chile flakes into the vegetables, until they are well-coated and stained bright red, about 30 seconds. Set aside.\nIn now-empty small bowl, whisk together sesame oil, gochujang, vinegar, honey, fish sauce, garlic, and black pepper until well-combined but not fully emulsified. Stir in sesame seeds.\nAdd dressing to vegetables and, using clean hands, toss to combine, massaging dressing into vegetables until they are well coated all over, about 30 seconds. If serving right away, divide between small individual serving bowls, sprinkle with additional sesame seeds, and serve. If making in advance, this banchan can be refrigerated in an airtight container for up to 3 days; bring to cool room temperature before serving. The dressing can also be made in advance and refrigerated in an airtight container for up to 5 days.\nNotes\nPersian cucumbers are less watery and more flavorful than English cucumbers, but the English variety are an acceptable substitute.\nDried Korean radish strips (무말랭이, or mumallaengi) are made by dehydrating French fry-sized pieces of moo or daikon radish. You can purchase dried radish at Korean markets, such as HMart, or online. If you own a dehydrator, you can also dry radishes yourself; cut peeled moo or daikon radish into 2 1/2- by 1/2-inch batons and dehydrate until fully dried. Store in an airtight container at room temperature until ready to use.\nMake-Ahead and Storage\nThe marinated radish banchan can be refrigerated in an airtight container for up to 3 days. The dressing can be made in advance and refrigerated in an airtight container for up to 5 days.\nThis Recipe Appears In\nCelebrate the Sides With a Korean-American Banchan Thanksgiving\nRadishes\nKorean\nVegetarian Snacks & Appetizers\nNo-Cook\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mumallaengi-muchim-korean-marinated-dried-radish-banchan-recipe.webp?"
}