{
  "url": "https://www.seriouseats.com/mushroom-pot-pie-recipe-8721453",
  "image_url": "https://www.seriouseats.com/thmb/2QN1lKTw5CKsgJrBDB7XkMroFDI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240919-SEA-EasyishMushroomPotPie-VictorProtasio-Hero2-29-56e3befb3ea54813b6bbda71e6242b7f.jpg",
  "tags": [
    "The Latest",
    "Winter Mains",
    "Vegetarian Mains",
    "Fall Mains",
    "Thanksgiving Dinner"
  ],
  "title": "Mushroom Pot Pie",
  "full_text": "Mushroom Pot Pie\nClose\nJump to recipe\nPrep\n20 mins\nCook\n65 mins\nRest Time:\n5 mins\nTotal\n90 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(680g) mixed fresh\nmushrooms\n, such as cremini, portobello, shiitake\n3\ntablespoons\n(45 ml)\nneutral oil\nsuch as vegetable or canola oil\n2 1/2 cups (\n600\nml\n)\nwater\n1/2\nounce\ndried porcini\nmushrooms\n(1/2 cup; 14g), rinsed and drained\n1/4 cup\nunsalted butter\n(2 ounces;\n56\ng\n)\n1 cup\nfrozen pearl onions\n(5 ounces;\n140\ng\n), thawed\n2\nlarge\ncarrots\n(12 ounces; 340g total), peeled and cut into 1/2-inch pieces (about 2 cups cut)\n1\nmedium\nparsnip\n(5 ounces;140g) peeled and cut into 1/2-inch pieces (about 1\ncup\ncut)\n1\ntablespoon\nfresh thyme leaves\n1\ntablespoon\nwhite\nmiso\n2\nteaspoons\ndried oregano\n2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1\nteaspoon\nfreshly\nground black pepper\n1/4 cup (\n30\ng\n)\nall-purpose flour\n, plus more for dusting\n1 1/2 cups (\n360\nml\n)\nwhole milk\nOne\n9 1/2 x 9-inch\nsheet\nfrozen\npuff pastry\n, thawed (such as Pepperidge Farm or Dufour)\n1\nlarge\negg\nbeaten with 1 teaspoon water\nDirections\nAdjust oven racks to upper-middle and lower-middle positions and preheat oven to 425°F (220℃). If using shiitake mushrooms, remove and discard stems; for portobello and cremini mushrooms remove and reserve stems, discarding any woody stems. Cut shiitake and portobello mushrooms into 1/2-inch pieces. Halve cremini mushrooms or quarter if larger than 1 1/2 inches wide.\nSerious Eats / Victor Protasio\nIn a medium bowl, toss mushrooms with oil until coated. Evenly divide between 2 large rimmed baking sheets and spread into an even layer. Roast mushrooms, rotating pans top to bottom halfway through, until lightly browned, about 20 minutes.\nSerious Eats / Victor Protasio\nMeanwhile, in a medium saucepan over medium-high heat, bring 2 1/2 cups water, porcini mushrooms, and reserved cremini and portobello mushroom stems to a boil; reduce heat to medium, simmer mushrooms, stirring occasionally, until mushrooms are softened, 3 to 5 minutes. Pour mushroom mixture into a blender. Secure lid on blender, and remove center piece to allow steam to escape. Place a clean towel over opening, then process until smooth, 1 to 2 minutes; set aside.\nSerious Eats / Victor Protasio\nIn a 10-inch cast iron skillet, melt butter over medium heat, add onions and cook, stirring occasionally, until translucent, 3 to 4 minutes. Add carrots and parsnips and cook, stirring occasionally, until carrots and parsnips are beginning to soften, about 5 minutes. Stir in thyme, miso, oregano, salt, and pepper and cook, stirring occasionally, until fragrant, about 1 minute. Sprinkle flour over vegetable mixture and cook, stirring constantly, until flour is lightly toasted, about 2 minutes.\nSerious Eats / Victor Protasio\nGradually stir in blended mushroom mixture and milk until combined. Bring to a simmer over medium heat, then continue to simmer, stirring occasionally, until slightly thickened, about 2 minutes. Remove from heat and stir in roasted mushrooms; set aside.\nSerious Eats / Victor Protasio\nWorking on a lightly floured work surface, roll puff pastry sheet into an 11-inch square. Carefully place on top of hot mushroom filling; fold excess dough underneath itself and crimp as desired just below rim of skillet so it's flush with the skillet's edge. Using a pastry brush, lightly brush dough with egg wash.\nUsing a paring knife, lightly score the entire surface of the pastry in a diagonal crosshatch pattern. Make sure not to cut all the way through the dough. Cut five 1/4-inch wide steam vents into the dough, spread out evenly over the pie.\nSerious Eats / Victor Protasio\nPlace skillet on a large rimmed baking sheet. Bake at 425°F (220℃) on the lower-middle rack until pastry is puffed and golden and sauce is bubbly, about 25 minutes. Let cool for 5 minutes before serving.\nSerious Eats / Victor Protasio\nRamekin Variation for Individual Pot Pies\nServes:\n6 (serving size: 1 ramekin)\nPrep:\n20 min. Cook 55 min. Rest 5 min. Total 1 hour, 20 min.\nDirections:\nPrepare steps 1-4 as directed.\n5. Divide filling evenly between six (8-ounce) ramekins (about 3/4 cup each); set aside. Working on a lightly floured work surface, roll out puff pastry sheet into a 12-inch square. Cut six 5-inch circles. Place each pastry circle on top of hot mushroom filling in ramekins; fold excess dough under itself and crimp as desired just below rim of ramekin. Using a pastry brush, lightly brush top of each pastry with egg wash. Using a paring knife, lightly score top of pastry in a crosshatch pattern. Using the tip of the paring knife, cut three 1/4-inch holes on top to allow steam escape while baking.\n6. Place ramekins on a large rimmed baking sheet. Bake at 425°F in lower third until pastry is puffed and golden and sauce is bubbly, 15 to 20 minutes. Let sit for 5 minutes before serving.\nSpecial Equipment\nMedium saucepan, 2 large rimmed baking sheets, medium bowl, blender, 10-inch cast iron skillet, rolling pin, paring knife; for individual servings: 6 ramekins\nMake-Ahead and Storage\nThe filling can be prepared through step 4 up to 3 days ahead. Store in an airtight non-reactive container in the refrigerator and bring to room temperature before heating through and topping with crust. If the mixture is too thick, add water, one tablespoon at a time, to loosen.\nStore leftover pot pie in an airtight container in the refrigerator for up to 3 days. Reheat in the oven at 400°F(200°C) until filling is bubbly and heated through and top is crispy. (For a crispier topping, you can store the pastry \"lid\" separately from the filling, then reheat filling before topping with pastry and continue to warm until top is re-crisped.)\nThe Latest\nWinter Mains\nVegetarian Mains\nFall Mains\nThanksgiving Dinner",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mushroom-pot-pie.webp?"
}