{
  "url": "https://www.seriouseats.com/mushroom-sundried-tomato-farrotto-recipe-8772336",
  "image_url": "https://www.seriouseats.com/thmb/8wDDF9e-XJVlQrAu7jaE2diCCi8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250103-SEA-FarottoMushroomandSundriedTomato-AmandaSuarez-22-e7fd43c9dbf34f46ae71c405d9df9ad8.jpg",
  "tags": [
    "Rice & Grain Mains",
    "The Latest",
    "Mains"
  ],
  "title": "Mushroom and Sun-Dried Tomato Farotto",
  "full_text": "Mushroom and Sun-Dried Tomato Farotto\nClose\nJump to recipe\nPrep\n20 mins\nCook\n45 mins\nTotal\n65 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\n3/4 ounce (\n21\ng\n) dried\nporcini mushrooms\n1 cup\n(237\nml)\nboiling\nwater\n3\ntablespoons\nchopped sun-dried tomatoes packed in oil (about 2 ounces; 56g), plus 3 tablespoons (45ml)\noil from jar\n, divided\n12\nounces\n(340g) mixed\nmushrooms,\nsuch as cremini, white button, portobello, oyster, shiitake, and/or maitake, cleaned (see notes)\nKosh\ner\nsalt\n1\ntablespoon (15ml)\nextra virgin olive oil\n1/2\nyellow onion\n(4 ounces\n; 113\ng),\nfinely minced\n2\nmedium\ncloves garlic,\nfinely minced or grated on a Microplane\n1\nteaspoon minced\nfresh thyme leaves\n1 1/2 cups\npearled farro (\n10 ounces;\n280\ng)\n1/2 cup\n(120\nml)\ndry white wine\n1 1/2\nquarts\n(1.4L) hot homemade\nchicken\nor\nvegetable stock\nor low-sodium store-bought\nchicken broth,\nplus more as needed\n1/2 cup finely grated P\narmigiano-Reggiano cheese\n(1 ounce\n; 28\ng)\n4 tablespoons (\n60\ng)\ncold\nunsalted butter,\ncubed\n2\ntablespoons\nminced fresh\nchives\n2 teaspoons (\n10\nml\n)\nsherry vinegar\nDirections\nIn a medium heatproof bowl, combine dried porcini mushrooms and boiling water and let sit until softened, about 15 minutes. In a fine mesh strainer set over another heatproof bowl, drain mushrooms, pressing on mushrooms to extract as much liquid as possible. Reserve mushroom liquid; finely chop rehydrated porcini mushrooms.\nSerious Eats / Amanda Suarez\nWhile dried mushrooms steep, cut the fresh mushrooms based on the variety used: Stem and halve portobello mushrooms and cut into 1/2-inch pieces. Trim white button or cremini mushrooms and slice thin. Tear trimmed oyster mushrooms into about 1/2-inch pieces. Stem shiitake mushrooms and slice thin. Cut trimmed maitake (hen-of-the-woods) mushrooms into about 1/2-pieces.\nSerious Eats / Amanda Suarez\nSet serving plates in a very low oven or other warm location to keep warm until serving time. In a 3- or 5-quart saucier or medium Dutch oven, heat reserved sun-dried tomato oil over medium heat until shimmering. Add fresh mushrooms and 1/2 teaspoon salt and cook, stirring frequently, until moisture released by mushrooms evaporates, pan is dry, and mushrooms are beginning to brown, 5 to 8 minutes. Add 1 tablespoon oil, onion, and minced porcini mushrooms and continue to cook until onion is softened but not browned, about 5 minutes. Add sun-dried tomatoes, garlic, and thyme and stir until fragrant, about 30 seconds.\nSerious Eats / Amanda Suarez\nIncrease heat to medium-high, add farro, and continue to cook, stirring constantly, until farro is evenly coated in oil, lightly toasted, and aromatic, 2 to 3 minutes.\nSerious Eats / Amanda Suarez\nAdd white wine and cook until wine is almost completely evaporated, about 30 seconds. Add the reserved porcini soaking liquid and season lightly with salt. Cook, stirring constantly with a rubber spatula or wooden spoon, until liquid is mostly absorbed, 1 to 2 minutes. Continue to cook, adding stock in 1/2-cup increments while stirring constantly, until farro is almost fully softened but still retains a noticeable al dente bite in the center, 15 to 35 minutes. Add enough stock so that there is enough liquid in the pot for the farro to flow when you stir it. Remove from heat.\nSerious Eats / Amanda Suarez\nAdd cheese and butter and stir or toss vigorously until cheese and butter are fully melted and emulsified and a creamy, satiny glaze coats each grain. Add chives and vinegar and toss to combine. Keep in mind that the farrotto will tighten up in the time it takes to plate and serve it, so adjust with more stock (or hot water, if you run out of stock) as needed to achieve a free-flowing consistency, leaving it looser than you think it should be. Season with additional salt to taste, if needed.\nSerious Eats / Amanda Suarez\nSpoon farrotto onto warmed plates (plates are more standard than bowls for risotto), shaking gently to spread out over each plate in an even layer. Serve right away.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n3- or 5-quart saucier or medium Dutch oven\nNotes\nThis recipe is flexible: You can use a single variety of mushroom or any combination of the mushroom varieties listed.\nRice & Grain Mains\nThe Latest\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mushroom-and-sun-dried-tomato-farotto.webp?"
}