{
  "url": "https://www.seriouseats.com/mushroom-pasta-creamy",
  "image_url": "https://www.seriouseats.com/thmb/xZAbHDXVF9lmcVQ5aMkt3ZCSRvk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20210204-funghi-pasta-vicky-wasik-17-55074a9a66864d14afecf8cbd4445597.jpg",
  "tags": [
    "Italian",
    "Stovetop Pasta",
    "Chanterelle Mushrooms",
    "Cremini & Button Mushrooms",
    "Maitake Mushrooms"
  ],
  "title": "Pasta ai Funghi (Creamy Pasta With Mushrooms)",
  "full_text": "Pasta ai Funghi (Creamy Pasta With Mushrooms)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n30 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n240\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n(see note)\n1 1/2\nteaspoons\n(\n4\ng\n) powdered\ngelatin\n, such as Knox\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1 1/2\npounds\n(\n675\ng\n) mixed\nmushrooms\n(such as\nshiitake\n,\noyster\n,\nmaitake, beech\n,\ncremini\n, and\nchanterelles\n), cleaned, trimmed, and thinly sliced or torn by hand (see note)\nKosher salt\nand freshly\nground black pepper\n3\nmedium\nshallots\n, finely minced (about\n3/4\ncup\n;\n120\ng\n)\n2\nmedium\n(\n10\ng\n)\ngarlic cloves\n, minced\n2\ntablespoons\n(\n4\ng\n) chopped\nfresh thyme leaves\n1/2\ncup\n(\n120\nml\n)\ndry white wine\nor\n1/4\ncup\n(\n60\nml\n)\ndry sherry\n1\nteaspoon\n(\n5\nml\n)\nfish sauce\n(optional)\n1\npound\n(\n450\ng\n)\nshort dried pasta\n(such as\ncasarecce\nor\ngemelli\n) or\nlong\nfresh egg-dough pasta\n(such as\ntagliatelle\nor\nfettuccine\n)\n6\ntablespoons\nunsalted butter\n(\n3\nounces\n;\n85\ng\n)\n3\nounces\ngrated\nParmigiano-Reggiano\n(\n1\ncup\n;\n85\ng\n)\n1/4\ncup\n(\n10\ng\n) chopped\nfresh flat-leaf parsley leaves\nDirections\nPour stock into a small bowl or liquid measuring cup and evenly sprinkle gelatin over surface of stock. Set aside.\nIn a large 12-inch cast iron or stainless steel skillet, heat oil over medium-high heat until shimmering. Add mushrooms, season with salt and pepper, and cook, stirring frequently with a wooden spoon, until moisture has evaporated and mushrooms are deeply browned, 12 to 15 minutes.\nAdd shallots, garlic, and thyme and cook, stirring constantly, until fragrant and shallots are softened, 30 seconds to 1 minute. Add wine or sherry, and cook, swirling pan and scraping up any stuck-on bits with a wooden spoon, until wine is reduced by half, about 30 seconds.\nAdd chicken stock mixture, season lightly with salt, and bring to a simmer. Reduce heat to medium-low, add fish sauce (if using), and cook, stirring occasionally, until mushroom mixture is thickened to a saucy consistency, about 5 minutes. Turn off heat.\nMeanwhile, in a pot of salted boiling water, cook pasta. If using dry pasta, cook until just shy of al dente (1 to 2 minutes less than the package directs). If using fresh pasta, cook until noodles are barely cooked through. Using either a spider skimmer (for short pasta) or tongs (for long fresh pasta), transfer pasta to pan with mushrooms along with 3/4 cup (180ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 2 cups (475ml) pasta cooking water.\nHeat sauce and pasta over high and cook, stirring and tossing rapidly, until pasta is al dente (fresh pasta will never be truly al dente) and sauce is thickened and coats noodles, 1 to 2 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed. At this point, the sauce should coat the pasta but still be loose enough to pool around the edges of the pan. Add butter, and stir and toss rapidly to melt and emulsify into the sauce. Remove from heat, add 3/4 of grated cheese and all of the parsley, and stir rapidly to incorporate. Season with salt to taste. Serve immediately, passing remaining grated cheese at the table.\nSpecial Equipment\nLarge\ncast iron\nor\nstainless steel skillet\n,\nspider skimmer\nNotes\nRemove the stems of hard-stemmed mushrooms, like shiitakes, before using; tender-stemmed mushrooms, like oyster, can be used with the stem on. Firmer mushrooms like shiitakes are best sliced, whereas more tender mushrooms can be easily torn into bite-size pieces by hand.\nMake-Ahead and Storage\nThis pasta is at its best when enjoyed immediately, especially when made with fresh pasta. If using dried pasta, it does keep well for leftovers, however, and can be refrigerated in an airtight container for up to 3 days.\nRead More\nPenne Boscaiola (Woodsman-Style Pasta With Mushrooms and Bacon)\nSkillet Pasta With Mushrooms, Pancetta, and Wilted Greens\nCrispy Baked Pasta With Mushrooms, Sausage, and Parmesan Cream Sauce\nThe Comprehensive Mushroom Shopping Guide\nHow to Clean and Prepare Mushrooms\nItalian\nStovetop Pasta\nChanterelle Mushrooms\nCremini & Button Mushrooms\nMaitake Mushrooms",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pasta-ai-funghi-creamy-pasta-with-mushrooms.webp?"
}