{
  "url": "https://www.seriouseats.com/mushy-peas-recipe-11721683",
  "image_url": "https://www.seriouseats.com/thmb/g0-N-zSToZXRGcpUM_ajff-nM6I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250423-SEA-MushyPeas-VictorProtasio-Beauty-28-34e1e18c8d4e42bb98fa718f45fc4364.jpg",
  "tags": [
    "Peas",
    "The Latest",
    "Recipes",
    "Vegetarian",
    "British"
  ],
  "title": "This 5-Ingredient Side Dish Is a British Classic",
  "full_text": "This 5-Ingredient Side Dish Is a British Classic\nClose\nJump to recipe\nPrep\n5 mins\nCook\n32 mins\nSoak Time:\n8 hrs\nTotal\n8 hrs 37 mins\nCook Mode\n(Keep screen awake)\nIngredients\n2\nteaspoons\nbaking soda\n2\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume\n7\nounces\ndried marrowfat peas\n(\n200\ng\n;\n1\ncup\n), see notes\n20\nounces\n(\n590\nml\n;\n2 1/2\ncups\n)\nwater\n, plus more as needed\n2\n(1-inch) fresh\nmint\nleaves\n, finely chopped (optional)\nDirections\nIn a large bowl, combine baking soda and 1 teaspoon salt. Add peas; add enough water to cover peas by 3 inches, and stir to combine. Cover with a plate, kitchen towel, or plastic wrap, and let sit at room temperature for at least 8 hours and up to 12 hours.\nSerious Eats / Victor Protasio\nUsing a fine-mesh sieve, drain and rinse peas. In a 4-quart saucepan, combine peas and 2 1/2 cups water. Bring to a boil over high. Reduce heat to medium-low; cover and gently simmer, stirring occasionally, until peas are soft and beginning to get mushy, 30 minutes to 1 hour, adding more water, about 2 tablespoons at a time, as needed if mixture appears dry.\nSerious Eats / Victor Protasio\nUncover saucepan. Using the back of a spoon or a potato masher, mash peas until starting to become smooth. Continue cooking and mashing over medium-low until all peas are smashed and mushy and consistency appears thick, 2 to 3 minutes. Stir in remaining 1 teaspoon salt. Add fresh mint (if using); serve hot.\nSerious Eats / Victor Protasio\nSpecial Equipment\nFine-mesh sieve, 4-quart saucepan, spoon or potato masher\nNotes\nMarrowfat peas are picked once they are fully mature and have dried out on the vine. They can be purchased online or at specialty food stores. Some marrowfat peas may come with a packet of baking soda for soaking. You can use that to soak the peas, along with 1 teaspoon Diamond Crystal kosher salt, if desired. (If using table salt, use half as much by volume.)\nMake-Ahead and Storage\nOnce cooled, the mushy peas can be refrigerated in an airtight container for up to 4 days. They will continue to thicken as they sit. To reheat the peas, add water, 1 teaspoon at a time, until it reaches your desired consistency, then microwave until warmed through.\nOnce cooled, mushy peas can be frozen in an airtight container for up to 3 months. Thaw overnight in refrigerator.\nPeas\nThe Latest\nRecipes\nVegetarian\nBritish"
}