{
  "url": "https://www.seriouseats.com/mustardy-deviled-eggs",
  "image_url": "https://www.seriouseats.com/thmb/nz-tTAsjGCGZUoPcPp7yxqQwimQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190524-wursthall-deviled-eggs-beauty2-edit-5308a1761adf47edaab2b77804c9a650.jpg",
  "tags": [
    "Deviled Eggs",
    "Gluten-free Snacks & Appetizers"
  ],
  "title": "Mustardy Deviled Eggs From Wursthall Recipe",
  "full_text": "Mustardy Deviled Eggs From Wursthall Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nChilling Time\n15 mins\nTotal\n50 mins\nServes\n16 deviled egg halves\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Eggs and Filling:\n12\nlarge\neggs\n, not too fresh (see note)\n45\ng\n(about\n3\ntablespoons\n)\nmayonnaise\n, preferably\nhomemade\n45\ng\n(about\n3\ntablespoons\n)\nDijon mustard\n45\ng\n(about\n3\ntablespoons\n)\nliquid from a jar of pickled cherry peppers\n(see note)\n20\ng\n(about\n1\ntablespoon\n)\nwhite wine vinegar\n60\ng\n(about\n4\ntablespoons\n)\nextra-virgin olive oil\nKosher salt\n, to taste\nTo Finish:\nPickled mustard seeds\nAleppo\nor\nKorean chile flakes\n(\ngochugaru\n); see note\nExtra-virgin olive oil\nCrunchy sea salt\n, such as Maldon\nFresh dill fronds\nDirections\nFor the Eggs and Filling:\nFill a large pot with 1 inch of water. Place steamer insert inside, cover, and bring to a boil over high heat. Add eggs to steamer basket, cover, and continue cooking over high heat for 12 minutes. Meanwhile, add 1 tray of ice cubes to a large bowl and fill with water. Remove eggs and immediately place in bowl of ice water and allow to cool for at least 15 minutes before peeling under cool running water. Slice each egg in half lengthwise.\nPlace all yolks in the bowl of a food processor. Select 16 of the best-looking egg white halves, rinse in cold water to clean out any excess yolk, and set aside; reserve remaining 8 whites for another use. Add mayonnaise, mustard, cherry pepper liquid, and vinegar to food processor and process until smooth, scraping down sides of bowl as necessary.\nWith the machine running, slowly drizzle in olive oil in a thin, steady stream. Season mixture to taste with salt. Transfer to a zipper-lock bag or a piping bag fitted with a piping tip. Filling and egg white halves can be stored in the refrigerator up to overnight before eggs are filled and served.\nTo Finish:\nIf using a zipper-lock bag to pipe, cut off a corner of the bag. Pipe filling mixture into egg white halves, overstuffing each one. Top with pickled mustard seeds, a squirt of olive oil, chile flakes, sea salt, and dill fronds. Serve immediately.\nSpecial Equipment\nFood processor\n, piping bag and piping tip (optional)\nNotes\nYou can use a few dashes of your favorite hot sauce in place of the liquid from the pickled cherry peppers, if you prefer.\nAleppo or Korean chile flakes can be found at specialty spice shops or a well-stocked supermarket.\nMake-Ahead and Storage\nThe filling and egg white halves can be stored in the refrigerator up to overnight before the eggs are filled and served.\nRead More\nGreat Deviled Eggs Recipe\nCaesar Deviled Eggs Recipe\nDeconstructed Deviled Eggs With Mayonnaise, Anchovies, and Capers Recipe\nEverything Bagel Deviled Eggs (Smoked Salmon, Sesame and Caraway Seeds, and Dried Onion) Recipe\nDeviled Eggs\nGluten-free Snacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mustardy-deviled-eggs-from-wursthall-recipe.webp?"
}