{
  "url": "https://www.seriouseats.com/nacho-style-baked-potatoes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/_pqQIMTTnYdt24f24bc5BYM13Oc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__10__20170928-nacho-style-baked-potatoes-all-four-morgan-eisenberg-5e7bf59e234240318a5c97b3cac22636.jpg",
  "tags": [
    "Potatoes",
    "Vegetarian Sides",
    "Cheese"
  ],
  "title": "Nacho-Style Baked Potatoes Recipe",
  "full_text": "Nacho-Style Baked Potatoes Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n30 mins\nResting Time\n5 mins\nTotal\n45 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\n(12-ounce; 340 g\n) potatoes, preferably\nrussets\nCanola, vegetable, or\nolive oil\n, for rubbing\n1/3\ncup\nsour cream\n(\n80\nml\n), plus more for topping, if desired\n1/4\nteaspoon\nground cumin\n1/4\nteaspoon\nchili powder\n1\ncup\nrefried beans\nKosher salt\nand freshly ground black pepper, to taste\n1 1/2\ncups\ncheese sauce\n1\ncup\npico de gallo\n1/2\nripe\nHass avocado\n, halved, pitted, flesh scooped from skin, and cubed\nDirections\nIf Using Only the Oven (see notes):\nPreheat oven to 375°F (190°C). Using a fork or paring knife, puncture potatoes in several spots. Rub each potato with a light coating of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until a fork can easily be inserted into the center of each potato, about 1 hour. If setting potatoes directly on oven rack, set a sheet of foil on the rack below to catch any oil drips.\nIf Using the Microwave and Oven (see note):\nPreheat oven to 450°F (230°C). Using a fork or paring knife, puncture potatoes in several spots. Microwave potatoes for 5 minutes. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until a fork can easily be inserted into the center of each potato, about 20 minutes. If setting potatoes directly on oven rack, set a sheet of foil on the rack below to catch any oil drips.\nLet potatoes rest 5 minutes. Slice each open lengthwise and carefully scoop flesh into a mixing bowl. Mash the potato flesh with the sour cream, cumin, and chili powder. Gently stir in the refried beans until well-combined.\nScoop mashed potatoes back into skins. (You can refill each skin, making 4 smaller potatoes, or use all the mashed potato to refill only half the skins, making 2 overstuffed potatoes.) Using your hands, reshape each stuffed potato back into a classic baked-potato shape. Pour over the cheese sauce, then top with pico de gallo, avocado, and sour cream, as desired. Serve immediately.\nSpecial Equipment\nBaking sheet,\nbaking rack\nNotes\nBaking the potatoes in the oven produces only marginally better results, but takes longer. The microwave speeds things up.\nPotatoes\nVegetarian Sides\nCheese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nacho-style-baked-potatoes-recipe.webp?"
}