{
  "url": "https://www.seriouseats.com/nam-prik-pao-thai-chile-jam-5208927",
  "image_url": "https://www.seriouseats.com/thmb/YRBw7qiGN7jI5RRCE0UsQvSPv_U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210928-nam-prik-pao-thai-chile-jam-vicky-wasik-20-65abb24737024264932b1930b863f04f.jpg",
  "tags": [
    "Thai",
    "Condiments & Sauces",
    "Stovetop",
    "The Latest"
  ],
  "title": "Nam Prik Pao (Thai Chile Jam)",
  "full_text": "Nam Prik Pao (Thai Chile Jam)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nCooling Time\n25 mins\nTotal\n60 mins\nServes\n40 servings\nMakes\n2 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4\nounces\n(\n50\ng\n) dried spur\nchiles\n, stemmed (see note)\n7\nounces\n(\n200\ng\n)\nshallots\n, cut into 1-inch pieces (about\n10\nsmall\nshallots\n)\n3 1/2\nounces\n(\n100\ng\n)\ngarlic cloves\n, unpeeled (about\n20\nmedium\ncloves\nfrom\n2\nheads\nof\ngarlic\n)\n1/4\ncup\n(\n30\ng\n)\ndried shrimp\n, medium or large size, roughly chopped if large\n1/4\ncup\n(\n60\nml\n)\ntamarind\npaste, plus extra as needed\n2 3/4\nounces\n(\n80\ng\n)\npalm sugar\n, finely chopped (about\n3\ntablespoons\n; see note), plus extra as needed\n3\ntablespoons\nplus\n1\nteaspoon\n(\n50\nml\n)\nfish sauce\n, plus extra as needed\n1\nteaspoon\n(\n5\ng\n) fermented\nshrimp paste\n, such as\nTra Chang\n(optional)\n3/4\ncup\n(\n180\nml\n) neutral\noil\n, such as vegetable or safflower, divided\nDirections\nAdjust oven rack to 6 inches below broiler element and preheat broiler on high. Line a rimmed baking sheet with aluminum foil. Spread dried chiles in an even layer on baking sheet and broil, keeping an eye on them at all times to make sure they don’t burn, until chiles are charred in some spots, 30 seconds to 1 minute. Broilers vary in strength so cooking times will as well; be sure to check frequently. Flip chiles over and continue to broil on second side until charred in spots, 15 to 30 seconds. Transfer chiles to a plate and set aside to cool.\nVicky Wasik\nArrange shallots and garlic in an even layer on now-empty baking sheet and broil until shallots are charred in some spots, 3 to 5 minutes. Using a spatula, flip garlic and shallots and continue to broil until charred in spots on second side, about 3 minutes longer. Transfer baking sheet to a heatproof surface and allow garlic and shallots to cool slightly. Once garlic is cool enough to handle, peel cloves; discard skins. Set aside.\nVicky Wasik\nWorking in batches, transfer charred chiles to a spice grinder and grind into a fine powder; transfer ground chiles to the bowl of a food processor and set aside. Add dried shrimp to spice grinder and grind until broken down and fluffy, 15 to 30 seconds. Transfer to food processor bowl with ground chiles.\nVicky Wasik\nAdd shallots, garlic, tamarind, palm sugar, fish sauce, and shrimp paste (if using) to food processor bowl. With processor running, add oil 1 tablespoon (15ml) at a time until a fine paste forms (you won’t need to add all of the oil to achieve a smooth consistency), 1 to 2 minutes. Stop processor to scrape down sides of bowl with a rubber spatula as needed. Alternatively, place all ingredients except oil in an immersion blender jar or another tall-sided container that just fits the head of your immersion blender. Add 3 tablespoons (45ml) oil, and blend, adding more oil, 1 tablespoon (15ml) at a time, until a fine paste forms.\nVicky Wasik\nTransfer paste and remaining oil to a 3-quart saucier or wok. Set over medium heat and cook, stirring constantly with a rubber spatula, until paste turns deep dark red and reduces to a thick, jammy consistency, 12 to 15 minutes. Taste for seasoning and add more tamarind, palm sugar, or fish sauce as needed. If adding more palm sugar, continue to cook until sugar is fully dissolved, about 1 minute. When tasting, spread the nam prik pao on a cracker or piece of bread, rather than just on its own, to get a better gauge for seasoning. Transfer to an airtight container (do not cover) and set aside to cool. Once cooled to room temperature, nam prik pao can be used or covered and refrigerated for future use.\nVicky Wasik\nSpecial Equipment\nSpice grinder\n,\nfood processor\nor\nimmersion blender\n, 3-quart\nsaucier\nor\nwok\n.\nNotes\nDried spur chiles are a type of Thai chile known as prik cheefa haeng; they have a fruity, mild flavor, and are prized for the color they impart to curry pastes. They can be hard to come by in the US, but are sometimes available online. Alternatively, you can substitute puya or guajillo chiles, which are available at Central American markets or online.\nPalm sugar can be found in Southeast Asian markets, as well as some nationwide supermarkets like H Mart, and also online. If you can’t find palm sugar, for this recipe you can substitute with an equal amount of light brown sugar.\nMake-Ahead and Storage\nNam prik pao can be refrigerated in an airtight container for up to 6 months.\nThai\nCondiments & Sauces\nStovetop\nThe Latest"
}