{
  "url": "https://www.seriouseats.com/nam-phrig-noom-northern-thai-pounded-roasted-chili-dip-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Om9H_n3YleUf6mJqQVSqFFPKcEc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140707-small-house-thai-cooking-school-tam-ma-khua-6-9732bdf05a784ffbb33a342a7dff5ca7.jpg",
  "tags": [
    "Thai",
    "Dairy-free",
    "Gluten-free",
    "Roasted Vegetables",
    "Garlic"
  ],
  "title": "Nam Phrig Noom (Northern Thai Pounded Roasted Chili Dip) Recipe",
  "full_text": "Nam Phrig Noom (Northern Thai Pounded Roasted Chili Dip) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nSteaming Time\n10 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\nhot green chiles\n, such as\nAnaheim\nor\nChinese long green capsicum\n4\nwhole very small\nshallots\n(about\n1 inch\nin diameter), unpeeled (see note)\n5\nmedium\ncloves garlic\n, unpeeled\n2\ntablespoons\nThai shrimp paste\nor fish sauce\n1/3\ncup\nroughly chopped cilantro\n, including the stems\nKosher salt\n2\nteaspoons\njuice\nfrom\n1\nlime\nBoiled eggs\n,\nsliced cucumbers\n,\nfried pork rinds\n,\nsteamed green\nor\nlong beans\n, and/or\nsteamed pumpkin\nto serve\nDirections\nPreheat a broiler to high heat and adjust rack to 3 inches below heating element. The goal is to get it as close as possible while still allowing a cast iron skillet to be placed underneath. Preheat cast iron skillet on a burner over high heat until lightly smoking, about 5 minutes.\nPlace chilies, shallots, and garlic in skillet and place under the broiler. Broil, turning vegetables every few minutes, until darkly charred on all surfaces, about 10 minutes total. Some vegetables may cook faster than others; remove each vegetable as it cooks and transfer to a medium bowl. When all vegetables are cooked, cover bowl tightly with foil and allow to steam for 10 minutes.\nIf using shrimp paste, smear shrimp paste on a piece of heavy-duty aluminum foil. Place under the broiler and broil until aromatic, about 30 seconds. Remove from oven and set aside. (If using fish sauce, skip to next step.)\nCarefully peel chilies, garlic, and shallots and discard skins. Transfer to a large mortar and pestle. Add cilantro leaves and stems and shrimp paste (if using fish sauce, do not add until next step). Add a heavy pinch of salt. Pound until a rough, spoonable paste is formed, about 5 minutes.\nStir in lime juice and fish sauce (if using). Season to taste with more salt if desired. Serve with steamed or raw vegetables, boiled eggs, and fried pork rinds. Leftover nam phrig noom can be stored in an airtight container in the refrigerator for up to 1 week.\nSpecial equipment\nMortar and pestle\n,\ncast iron skillet\nThis Recipe Appears In\nRecipes From Chiang Mai: Nam Phrig Noom (Pounded Roasted Chili Dip)\nFour Essential Northern Thai Dishes to Make Right Now\nThai\nDairy-free\nGluten-free\nRoasted Vegetables\nGarlic"
}