{
  "url": "https://www.seriouseats.com/nam-prik-ong-thai-pork-tomato-chile-dip",
  "image_url": "https://www.seriouseats.com/thmb/A8wajJvGs-6Obz00xEepQonUseY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201002-nam-prik-ong-derek-lucci-c59798d53272440ea15c1cdf0b196af8.jpg",
  "tags": [
    "Dips",
    "Thai",
    "Pork",
    "Chile Pepper",
    "Tomato"
  ],
  "title": "Nam Prik Ong (Thai Pork-and-Tomato Chile Dip) Recipe",
  "full_text": "Nam Prik Ong (Thai Pork-and-Tomato Chile Dip) Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n40 mins\nActive\n40 mins\nCooling Time\n15 mins\nTotal\n85 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Paste:\n10 to 15\ndried\nspur chiles\n(\n15\ng\n) (see notes )\n2\nwhole\nplum tomatoes\n(about\n100\ng\n)\n1\ndisc\n(\n15\ng\n)\ntua nao\n(optional, see notes)\n1\nstalk\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced into rounds (about\n10\ng\nsliced\nlemongrass\n)\n10\nsmall\ngarlic cloves\n(\n30\ng\n)\n5\nsmall\nshallots\n(\n80\ng\n)\n2\nteaspoons\n(\n20\ng\n)\nThai shrimp paste\nFor the Seasoning Sauce:\n1/2\ncup\n(\n120\nml\n)\nwater\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n1\ntablespoon\n(\n15\ng\n)\nThai fermented soybean paste\n2\nteaspoons\n(\n10\nm\nl)\nThai thin soy sauce\nor\nlight soy sauce\nPinch\nsugar\nFor the Pork:\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n1\npound\n(\n450\ng\n)\nground pork\n8\nounces\n(\n1 1/2\ncups\n;\n225\ng\n)\ncherry tomatoes\nFor Serving:\nAssorted\nraw vegetables\nsuch as\ncucumbers\n,\ngreen cabbage\n,\nlettuce\n,\nThai eggplant\n,\nlong beans\n, and more, cut for dipping\nAssorted\nsteamed\nor\nblanched vegetables\nsuch as\nwinter squash\n,\nokra\n, and more, cut for dipping (optional)\nHard-boiled eggs\n, halved (optional)\nUnflavored pork rinds\n(optional)\nCooked jasmine\nor\nsticky rice\nDirections\nFor the Paste:\nPlace spur chiles in a dry wok or carbon steel or cast iron skillet, and toast over medium-low heat, turning occasionally, until chiles are fragrant and turn a deeper shade of dark red, 4 to 5 minutes. Remove from heat and transfer chiles to a plate to cool slightly; wipe out wok or skillet and return to stovetop. Once cool enough to handle, remove stems from chiles and transfer to a granite mortar and pestle; set plate and mortar and pestle aside.\nMeanwhile, place plum tomatoes in now-empty wok or skillet, and cook over medium-high heat, turning occasionally, until charred all over, about 5 minutes. Transfer tomatoes to now-empty plate and set aside to cool.\nIf using tua nao, use tongs to grab disc and hold about 2 inches above low flame on a gas burner. Flip disc every 5 seconds until tua nao is toasted to a hazelnut brown color, with little leopard spots all over on both sides, 2 to 3 minutes. Alternatively, you can toast tua nao under an electric or gas broiler, turning very frequently, or by using a culinary torch. Transfer tua nao to plate with tomatoes to cool; set aside.\nPound chiles in mortar and pestle to a coarse powder, 3 to 5 minutes. Add lemongrass and pound fine, 3 to 5 minutes. Add garlic and shallots and pound to a coarse paste with a few large pieces remaining, 3 to 5 minutes. Add shrimp paste and tua nao (if using) and pound until well-incorporated. Add charred plum tomatoes and gently pound until broken down and incorporated into paste, about 2 minutes. Transfer paste to a small bowl and set aside.\nFor the Seasoning Sauce:\nIn a small bowl, stir together water, fish sauce, soybean paste, soy sauce, and sugar until well-combined and sugar is dissolved. Set aside.\nFor the Pork:\nIn a wok or 3-quart saucier, heat oil over medium-high heat until shimmering. Add the chile-tomato paste and cook, stirring frequently, until paste is aromatic and turns dark red, about 3 minutes. Add the pork, stir to combine, and cook, using a wok spatula or wooden spoon to break meat up and scrape up any bits that stick to the bottom of the pan, until cooked through, about 4 minutes.\nAdd cherry tomatoes, stir to combine, and continue to cook until tomatoes begin to burst, 3 to 5 minutes. You can coax the tomatoes into bursting by pressing down on them with a wok spatula or wooden spoon, and you can decide whether to lightly crush all of them or leave some whole for juicy pops of tomato flavor in the finished dip. Stir in seasoning sauce and bring to a boil over high heat. Cook, stirring frequently, until liquid is reduced to a saucy consistency and oil begins to separate from emulsion, about 8 minutes. Remove from heat and allow to cool to room temperature, at which point nam prik ong can be served or refrigerated in an airtight container for up to 1 week, or frozen for up to 1 month.\nFor Serving:\nTransfer nam prik ong to a serving bowl and serve with assorted raw and steamed vegetables, hard-boiled eggs (if using), pork rinds (if using), and rice.\nSpecial equipment\nWok\n, or\nlarge carbon steel\nor\ncast iron skillet\n,\nmortar and pestle\nNotes\nDried spur chilies are a type of Thai chile known as prik cheefa haeng; they have a fruity, mild flavor, and are prized for the color they impart to curry pastes. They can be hard to come by in the US, but are sometimes available online. Alternatively, you can substitute puya or guajillo chiles, which are available at Central American markets.\nTua nao are dried fermented soybean cakes that provide an important savory quality to nam prik ong and many dishes found in Northern Thailand. To make tua nao, soybeans are cooked and left out to ferment before being ground into a paste, often through a meat grinder. The paste is portioned and pressed into circles using a piece of equipment similar to a tortilla press. The circles are then sun-dried and packaged for sale. To use tua nao discs, cooks blister them over charcoal grills or the flame of a gas burner before processing them into pastes, like the one in this recipe. Tua nao is often used as a vegetarian or vegan substitute for shrimp paste. It can be a difficult ingredient to source in the US—even in Bangkok it isn’t always readily available—and nam prik ong can be made without it.\nMake-Ahead and Storage\nNam prik ong can be refrigerated in an airtight container for up to 1 week, and frozen for up to 1 month. Bring to room temperature before serving.\nDips\nThai\nPork\nChile Pepper\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nam-prik-ong-thai-pork-and-tomato-chile-dip-recipe.webp?"
}