{
  "url": "https://www.seriouseats.com/nasi-lemak-malaysian-coconut-rice-recipe-7197924",
  "image_url": "https://www.seriouseats.com/thmb/jurw_XoUko0sLM17lhIWseKvsyM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230309-NasiLemak-MichelleYip-Option1-8d0b9468c998495f91ef4ff6d3b5ab6b.jpg",
  "tags": [
    "The Latest",
    "White Rice",
    "Southeast Asian",
    "Rice & Grain Mains",
    "Coconut Milk & Cream"
  ],
  "title": "Nasi Lemak (Malaysian Coconut Rice)",
  "full_text": "Nasi Lemak (Malaysian Coconut Rice)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nTotal\n65 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\ncups\njasmine rice\n(\n1\npound\n2\nounces\n,\n500\ng\n)\n7\nounces\n(\n200\nml\n)\ncoconut milk\n, preferably from a carton variety (see notes)\n2\npandan\nleaves\n, cut crosswise into 2-inch pieces\nOne\n1-inch knob\n(\n25\ng\n)\nfresh peeled ginger\n, julienned\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n, plus more to taste; for\ntable salt\nuse half as much by volume or the same weight\nTo Serve (optional):\nSambal tumis\nFried ikan bilis\n(\ndried anchovies\n) (see notes)\nSliced hard-boiled eggs\nFried peanuts\nSliced cucumbers\nFresh or frozen\nbanana leaf\nDirections\nSet up a tiered steamer (see notes), filling the bottom section with about 3 inches of water. Bring to a boil over high heat. Line the steamer tier with cheesecloth.\nSerious Eats / Michelle Yip\nMeanwhile, place the rice in a strainer and rinse the grains under running water until the water is almost clear. Drain rice, then transfer to a 10-inch nonstick skillet and add the coconut milk, 7 ounces (200ml) water, pandan leaves, ginger, and salt. Cook on medium heat, stirring continuously, until it thickens like rice pudding, 8-10 minutes.\nSerious Eats / Michelle Yip\nTransfer the rice mixture to the cheesecloth-lined steamer tier and spread it in a roughly even layer. Set steamer tier over bottom section of boiling water, cover, and steam over medium heat until the grains are fully cooked, about 45 minutes; start checking rice doneness after 35 minutes of steaming. Once the rice reaches your preferred texture, turn off the heat and leave it to continue steaming, covered, until the steaming stops. The rice should be just cooked, with separate grains and a rich flavor of coconut.\nSerious Eats / Michelle Yip\nServe with sambal tumis and other nasi lemak accompaniments, depending on your preference (note that it's typical to leave the pandan leaves in the nasi lemak, as it's understood they will be removed at the table by the diner; do not eat them). If desired, nasi lemak can be served on a banana leaf, which will contribute its own fragrance to the dish as the rice and toppings are eaten.\nSerious Eats / Michelle Yip\nSpecial Equipment\nTiered steamer (see notes), cheesecloth\nNotes\nIf you don’t have a tiered stovetop steamer, you can use a large pot with a steamer insert, or a wok with a bamboo steamer.\nThis recipe was tested with boxed coconut milk, which comes in a variety of sizes. If using canned, stir the coconut cream and coconut milk together before measuring.\nIkan bilis can be found at any good Asian grocery store, especially those specializing in Southeast Asian imports. Ask for ‘dried anchovies’—every Southeast Asian country has their own name for it. They are sometimes sold already cleaned and gutted, but those will be more expensive; if yours aren't cleaned, you'll need to prep them by removing the heads, then splitting the fish lengthways so you can gut and debone it. The bigger varieties tend to be quite salty, so seek out the smaller varieties. Ikan bilis are usually sold in their uncooked dried form, so you'll likely have to fry themyourself: for 50g cleaned ikan bilis, heat up 1 tablespoon neutral cooking oil in a skillet over medium heat, then fry the ikan bilis, turning occasionally, until golden brown (about 3-5 minutes). Remove and drain on a paper towel–lined sheet tray. Do not salt, they will be plenty salty.\nMake-Ahead and Storage\nBecause of the fatty nature of coconut milk, the cooked rice will not last for longer than 1-2 days in the fridge. Freezing is not recommended as the fat in the rice will split when thawed and result in oily rice.\nThe Latest\nWhite Rice\nSoutheast Asian\nRice & Grain Mains\nCoconut Milk & Cream"
}