{
  "url": "https://www.seriouseats.com/nasi-goreng-recipe",
  "image_url": null,
  "tags": [
    "Indonesian",
    "Dairy-free Mains",
    "Stir-Fry",
    "White Rice",
    "Mains"
  ],
  "title": "Nasi Goreng (Indonesian Fried Rice)",
  "full_text": "Nasi Goreng (Indonesian Fried Rice)\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n25 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spice Paste:\n2\nsmall\nshallots\n(\n2\nounces\n;\n55\ng\n), roughly chopped\n3\nmedium cloves\ngarlic\n1\nlarge\nfresh\nchile\n, such as\nFresno\nor\nHolland\n, stemmed and seeded, or\n1\nteaspoon\nsambal oelek\n, such as Huy Fong (see note)\n1/2\nteaspoon\nterasi (\nIndonesian shrimp paste\n), optional (see note)\nFor the Nasi Goreng:\n4\ncups\ncold\ncooked jasmine rice\n(\n21\nounces\n;\n600\ng\n) or other medium- to long-grain rice (see note)\n2\ntablespoons\n(\n30\nml\n) neutral oil, such as canola or\nsunflower oil\n2\ntablespoons\n(\n30\nml\n)\nkecap manis\n(see note), plus more for drizzling\n2\nteaspoons\n(\n10\nml\n)\nsoy sauce\nKosher salt\nGround white pepper\nTo Serve:\n2\nlarge\nfried eggs\n, cooked sunny-side up or over easy\nSliced cucumbers\n(optional)\nSliced tomatoes\n(optional)\nFried shallots\n(optional)\nDirections\nFor the Spice Paste:\nAdd half the shallots to a mortar and grind with pestle until a coarse purée forms. Add remaining shallots, followed by garlic, chile, and terasi (if using), grinding with pestle until each ingredient is mostly incorporated before adding the next. The final paste should resemble thick oatmeal in texture. Alternatively, combine all spice paste ingredients in a small food processor and process until they form a paste.\nSerious Eats / Qi Ai\nFor the Nasi Goreng:\nIf using day-old rice, transfer rice to a bowl and break rice up with your hands into individual grains.\nSerious Eats / Qi Ai\nHeat oil in a large wok or skillet over high heat until shimmering. Add spice paste and cook, stirring constantly and scraping bottom of wok or pan to prevent paste from burning, until a pungent smell permeates your kitchen and paste turns a few shades darker, 2 to 3 minutes. Reduce heat to medium at any time if paste appears to be browning too quickly.\nSerious Eats / Qi Ai\nAdd rice to wok and stir to coat with spice paste. Add kecap manis and soy sauce. Stir and cook until rice is evenly colored and hot throughout. Season with salt and white pepper.\nSerious Eats / Qi Ai\nDivide rice between two plates and top each plate of rice with a fried egg. Garnish with cucumber and tomato slices and shower with fried shallots, if you like. Serve immediately with kecap manis alongside for drizzling.\nSerious Eats / Qi Ai\nSpecial Equipment\nMortar and pestle\n, large\nwok\nor\nskillet\nNotes\nTerasi is an Indonesian shrimp paste that can be found in well-stocked Asian markets or online. We recommend purchasing handy single-serving packets. If you can't find terasi, you may substitute belacan (Malaysian or Singaporean shrimp paste) or Thai shrimp paste, or simply omit it altogether.\nSambal oelek is an Indonesian chile paste, traditionally made with nothing more than hot red chiles and salt. You can find it at Asian markets or in the \"international\" aisle of some supermarkets.\nFor best results, use rice that has been refrigerated for at least 12 hours and up to 3 days. If using freshly cooked rice, spread rice on a tray and allow to cool for 5 minutes before using.\nKecap manis is Indonesian sweet soy sauce, typically made by combining soy sauce with palm sugar. We recommend Cap Bango kecap manis, but you may also find ABC and Conimex brands available online or in Asian markets. For more information, read our\nkecap manis explainer\n.\nRead More\nMie Goreng (Indonesian Fried Noodles) Recipe\nGado Gado (Indonesian Salad With Peanut Sauce) Recipe\nSambal Oelek Recipe\nA Collection of Our Favorite Fried Rice Recipes\nIndonesian Cuisine Guides\nIndonesian\nDairy-free Mains\nStir-Fry\nWhite Rice\nMains"
}