{
  "url": "https://www.seriouseats.com/natto-japanese-fermented-soybeans-recipe-7376348",
  "image_url": "https://www.seriouseats.com/thmb/5tq4s51XldNh0LTAAuUbcfgWMVY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230407-SEA-Natto-LorenaMasso-10-5b754e0b7ab24136b86859d5cf984913.jpg",
  "tags": [
    "Japanese",
    "The Latest",
    "Beans",
    "Fermentation",
    "Soybeans"
  ],
  "title": "Natto (Japanese Fermented Soybeans)",
  "full_text": "Natto (Japanese Fermented Soybeans)\nClose\nJump to recipe\nPrep\n12 hrs\nCook\n3 hrs\nFermentation Time\n36 hrs\nTotal\n51 hrs\nMakes\n4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\ndried soybeans\n(\n10 1/2\nounces\n;\n300\ng\n)\nHalf\nof\n1/8 teaspoon\nnatto starter spores\n, such as\nNattomoto\nDirections\nPlace dry beans into a large pot. Cover the beans with water and soak for at least 8 and up to 12 hours.\nSerious Eats / Lorena Masso\nIf Cooking On the Stovetop\n: Rinse soaked beans thoroughly, then return to pot. Cover beans with at least 1 inch of fresh water and bring to a boil over high heat. Reduce heat to maintain a steady simmer and cook until beans are completely tender but still whole, about 4 hours (see notes). Meanwhile, pour boiling water into a large, heatproof mixing bowl, making sure boiling water touches most of the inner surface to sanitize it, then drain. Drain beans and transfer to the large mixing bowl. Discard the cooking liquid.\nSerious Eats / Lorena Masso\nIf Using a Pressure Cooker\n: Rinse soaked beans thoroughly in 3 changes of fresh water. Cover beans with at least 1 inch of fresh water. Seal the pressure cooker lid. Bring to high pressure and cook for 10 minutes. Allow pressure to release naturally. The beans should be completely tender but still whole (see notes). Meanwhile, pour boiling water into a large, heatproof mixing bowl, making sure boiling water touches most of the inner surface to sanitize it, then drain. Drain beans and transfer to the large mixing bowl. Discard the cooking liquid.\nSerious Eats / Lorena Masso\nMeanwhile, boil a stainless steel teaspoon, a stainless steel soup spoon, and a small metal bowl in water for 5 minutes; transfer sterilized utensils to a clean work surface. Pour boiling water into the containers you will use to ferment the soybeans, then drain. In the sterilized small bowl and using the sterilized teaspoon, mix the natto starter spores with 1 tablespoon of water and immediately add to the hot soybeans (the soybeans must be hot, as this bacteria is activated by the heat). Using the sterilized soup spoon, mix soybeans very thoroughly to ensure the starter is evenly distributed throughout.\nSerious Eats / Lorena Masso\nDivide beans into the sanitized wide airtight containers (each container of beans should have a layer of beans no more than 2cm deep). Cover with cheesecloth and seal with the lid.\nSerious Eats / Lorena Masso\nSet the containers in a warm place; you can use a yogurt maker, a proofing drawer, or a turned-off oven with the oven light on; the important thing is that your beans are in an environment of about 100ºF (38ºC). Let stand, rotating the container positions after about 12 hours and checking every hour starting around the 20th hour, until the beans are covered all over in a thin white film and smell cheesy and nutty, 20 to 24 hours; see notes for more on what to do if your soybeans don't look and smell like this.\nSerious Eats / Lorena Masso\nTransfer containers to the fridge and allow beans to continue to ferment for 12 hours. The natto is now ready to eat.\nSerious Eats / Lorena Masso\nSpecial Equipment\nWide, airtight, nonreactive containers (such as glass baking dishes)\nNotes\nIf you prefer beans with a little more chew, this recipe will work if you boil them a little less. This is your natto, make it as you like!\nNatto can ferment unevenly, especially if the starter wasn't mixed in thoroughly, or the fermentation temperature was uneven. If you still see white film on most but not all of the natto, you can give it a good stir, then continue with the recipe by transferring natto to the fridge to finish.\nIf your beans fail to turn white, and don’t emit any scent at the end of 20-24 hours, it’s likely you did not add enough starter, or that the setup was not warm enough. I recommend starting over from scratch.\nIf you over-ferment the beans, they will become stiff and hard to mix (albeit, still edible).\nMake-Ahead and Storage\nNatto will keep for 2-3 weeks in the fridge, but will get more pungent with time. I once rediscovered a jar of Michiko’s natto that had been sitting in the fridge for over a month and it almost knocked me off of my feet.\nJapanese\nThe Latest\nBeans\nFermentation\nSoybeans",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/natto-japanese-fermented-soybeans.webp?"
}