{
  "url": "https://www.seriouseats.com/nduja-pizza-5211591",
  "image_url": "https://www.seriouseats.com/thmb/G2rcQcOg0gKjrWzBcE4OW2xqpxc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211115-OONI-PIZZA-NDUJA-ANDREW-JANJIGIAN-32-cdd758783bc241a3b13046f2b978333d.jpg",
  "tags": [
    "Pizza",
    "Italian",
    "Pork",
    "The Latest"
  ],
  "title": "Outdoor Pizza Oven 'Nduja Pizza",
  "full_text": "Outdoor Pizza Oven 'Nduja Pizza\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nProof\n60 mins\nTotal\n95 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\nfor\noutdoor pizza oven pizza dough\n1\n(\n28-ounce\n;\n795 g\n)\ncan whole peeled tomatoes\n, drained, juices reserved\n24\nfresh basil leaves\n2\nounces\n(\n60\ng\n) finely grated\nParmesan cheese\n12\nounces\n(\n340\ng\n)\nfresh mozzarella\n, torn into 3/4-inch pieces and patted dry\n2\nounces\n(\n1/4\ncup\n;\n60\ng\n)\n'nduja\n(see note)\nExtra-virgin olive oil\n, for drizzling\n2\ntablespoons\nchopped\nfresh parsley leaves\n, for garnish (optional)\nDirections\nRemove dough from refrigerator and allow to rest in proofing containers, covered, at room temperature for 1 to 2 hours before baking. Dough temperature should reach 60˚F (15.5°C) before stretching and baking; exact timing will depend upon ambient temperature.\nMelissa Rivard\nUsing a countertop or immersion blender, process tomatoes until a coarse but evenly blended sauce forms, about 10 seconds. Transfer to a 2-cup liquid measuring cup; if needed, add reserved tomato liquid to yield 2 cups (475ml) sauce. Season to taste with salt and pepper and set aside.\nMelissa Rivard\nPreheat pizza oven to 800°F (425°C). When ready to bake, coat one dough ball generously on both sides with flour and place on well-floured surface, seam side down. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough into a 10- or 12-inch circle (final dimension depends upon the size of your oven) about 1/4-inch thick by draping over knuckles and gently stretching. Transfer to floured wooden or perforated metal pizza peel.\nMelissa Rivard\nWorking quickly, scatter 6 basil leaves over pizza, leaving outer 1/2-inch rim untopped. Spread an even layer of tomato sauce over pizza. Sprinkle with Parmesan, followed by mozzarella. Dollop ‘nduja in 2 teaspoon amounts over sauce. Drizzle with olive oil.\nMelissa Rivard\nTransfer pizza to oven and bake, rotating pie regularly with a metal peel for even cooking, until rim is lightly charred and bottom is crisp, 90 to 180 seconds total. Retrieve pizza with a metal peel and transfer to a cutting board. Sprinkle with parsley (if using), slice, and serve immediately.\nMelissa Rivard\nRepeat steps 5 through 7 for remaining pizzas.\nSpecial Equipment\nHigh-temperature outdoor pizza oven\n,\nimmersion blender\n,\nwooden or perforated metal pizza peel\n, metal pizza peel.\nNotes\n'Nduja is a spicy spreadable pork salume that originates from the southern Italian region of Calabria. In the US, it can be purchased at specialty shops that carry salumi/charcuterie, Italian markets, or online from producers like\nTempesta Artisan Salumi\n. Look for 'nduja made with just four ingredients: pork, Calabrian chilies, salt, and lactic acid.\nMake-Ahead and Storage\nTomato sauce can be made in advance and refrigerated in an airtight container for up to 3 days.\nPizza\nItalian\nPork\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/outdoor-pizza-oven-nduja-pizza.webp?"
}