{
  "url": "https://www.seriouseats.com/nem-chua-vietnamese-cured-pork",
  "image_url": "https://www.seriouseats.com/thmb/EI77hH-kUWdZgXkV2zJSlD3asRg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__09__20200903-nem-chua-jenny-dorsey-10-7d7f4c27f9f844e0b32da52c636a8828.jpg",
  "tags": [
    "Sausages",
    "Vietnamese",
    "No-Cook",
    "Pork",
    "Snacks & Appetizers"
  ],
  "title": "Nem Chua (Vietnamese Cured Pork With Garlic and Chiles) Recipe",
  "full_text": "Nem Chua (Vietnamese Cured Pork With Garlic and Chiles) Recipe\nClose\nJump to recipe\nPrep\n60 mins\nActive\n60 mins\nChilling Time\n25 hrs\nTotal\n26 hrs\nServes\n16 squares\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n)\nboneless pork loin\nor\ntenderloin\n(see note)\n1\nteaspoon\nwhole black peppercorns\n(see note)\n1\nteaspoon\nwhole white peppercorns\n1\n(\n4\n-\nounce\n;\n110\ng\n)\npackage\ncooked pork skin\n, rinsed, drained, roughly chopped (see note)\n7\nmedium cloves\nminced fresh garlic\n(\n25\ng\n), plus thinly sliced garlic cloves for garnish\n4\nred bird's eye chiles\n(\n5\ng\n), stemmed and minced, plus\nthinly sliced chile rounds\nfor garnish\n2\ntablespoons\nsugar\n(\n30\ng\n)\n1\nteaspoon\n(\n4\ng\n)\nDiamond crystal kosher salt\n(for table salt, use half as much by volume or use the same weight)\n1\npacket\n(\n70\ng\n)\nnam powder\n(including smaller packet of salts inside the main packet), such as Lobo\nDirections\nLine a baking sheet with parchment paper. Using a sharp knife, trim pork loin of as much fat as possible; measure out 1.3 pounds (590g) trimmed meat and reserve any extra for another use (such as a stir fry or ground pork). Cut trimmed pork into roughly 2-inch chunks and arrange on a single layer on the prepared baking sheet. Freeze until very firm but not frozen solid, 15-20 minutes.\nIf Using a Meat Grinder:\nPlace meat grinder parts in freezer to chill for 1-2 hours before processing. Using the second-smallest grinding die, grind pork into a clean work bowl. Switch to the finest die and grind pork once more into a medium-large mixing bowl.\nIf Using a Food Processor:\nWorking in batches to avoid filling the processor more than halfway per batch, pulse processor until pork is finely ground, about 2 minutes. Transfer pork to a medium-large mixing bowl.\nUsing a spice grinder, grind black and white peppercorns to a fine powder. Add ground peppercorns to pork, along with prepared pork skin, minced garlic, minced chiles, sugar, and salt. Using a clean gloved hand or clean spatula, mix well.\nAdd curing packet (be sure to also add the contents of the smaller packet inside the main packet). Using a gloved hand, thoroughly mix all ingredients together by grabbing handfuls of the mixture, squishing it in your palm, and repeating until the entire mixture has taken on a sticky, paste-like consistency, about 5 minutes.\nTo Make Square-Shaped Nem Chua:\nLine an 8-inch square baking dish with plastic wrap. Add nem chua mixture to pan, and, using a spatula, smooth into an even layer. Set 1 slice of raw garlic and 1 chopped round of bird's eye chile into the surface approximately every 2 inches (you want these garnishes to top each square when you cut the nem chua). Cover nem chua with plastic wrap, pressing it firmly against the surface, and refrigerate at least 24 hours and up to 1 week before cutting and eating.\nFor Sausage-Shaped Nem Chua:\nSet a 12- by 12-inch square of plastic wrap on a work surface. Spoon 2 ounces (55g) nem chua mixture onto center of plastic wrap. Fold plastic wrap over nem chua mixture, then use your hands to form into a smooth log about 6 inches long and 1 1/4 inches thick.\nPeel back plastic and add alternating slices of raw garlic and chiles along the entire length of the log. Carefully fold the plastic wrap back over the nem chua log, then roll once more to form an even cylinder shape. Make sure to squeeze gently as you do this, to remove as much air from the mixture as possible. Twist the ends of the plastic wrap in opposite directions to form a tightly wound cylinder of even thickness.\nRepeat with remaining nem chua mixture, then refrigerate nem chua logs for at least 24 hours and up to 1 week before slicing into oblong rounds and eating.\nSpecial Equipment\nFood processor\nor\nmeat grinder\n;\nspice grinder\n;\n8-inch square baking dish\n(optional; for square nem chua only)\nNotes\nYou ultimately need 1.3 pounds (590g) trimmed lean pork for this recipe. Getting this final weight is essential because the pork is mixed with a packaged curing product scaled to that weight. Since the quality of the meat and freshness of the grind is very important for food-safety reasons, we strongly advise buying larger pieces of pork and trimming and grinding them yourself. Different cuts, though, will require different amounts of fat to be trimmed away: pork loin, for instance, often has a fat cap that will need to be removed, whereas tenderloin is usually more lean. Two pounds of meat is a safe starting point to guarantee a final yield of 1.3 pounds, but you may end up with extra depending on the specific cut you buy.\nIf a milder peppercorn flavor is desired, soak peppercorns in water for 15 minutes, then drain and dry thoroughly before grinding.\nBased on our recipe testing, packages of Vietnamese prepared pork skin can sometimes be difficult to find, and we have not located an online source yet. If you can't find it, you can leave it out and proceed with the recipe as written. Alternatively, you can make your own by purchasing 4 ounces (110g) raw pork skin (sometimes sold as rind) from a local butcher; boil until the skin can easily be pierced by a knife, about 45 minutes, then drain and transfer to refrigerator to chill. Once cold, slice rind into hair-like strands using a sharp knife, then roughly chop into shorter lengths. It is now ready to be used in the recipe.\nMake-Ahead and Storage\nCured nem chua can be kept refrigerated for up to 1 week.\nRead More\nHow to Use and Care for a Meat Grinder\nNem Lụi Huế (Huế Lemongrass Pork Skewers)\nSausages\nVietnamese\nNo-Cook\nPork\nSnacks & Appetizers"
}