{
  "url": "https://www.seriouseats.com/nem-lui-hue-lemongrass-pork-skewers-5205563",
  "image_url": "https://www.seriouseats.com/thmb/_S04Pl5DhvWoOobuzqiZ-TCo-4s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/NemluiHue-25-b84404d901184acba29d51089a52703c.jpg",
  "tags": [
    "Vietnamese",
    "Pork Shoulder",
    "Grilled Pork",
    "Pork Mains"
  ],
  "title": "Nem Lụi Huế (Huế Lemongrass Pork Skewers)",
  "full_text": "Nem Lụi Huế (Huế Lemongrass Pork Skewers)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n40 mins\nTotal\n100 mins\nServes\n4 as an appetizer\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork Peanut Dipping Sauce:\n1\ntablespoon\n(\n15\nml\n)\nvegetable\nor other\nneutral oil\n1\nmedium\nshallot\n(\n20\ng\n), roughly chopped (\n20\ng\n)\n2\ncloves\ngarlic\n(\n8\ng\n), roughly chopped\n2\nounces\n(\n55\ng\n)\nground pork\n(see note)\n2\nounces\n(\n60\ng\n)\nwhole grain soybean sauce\n(\ntương hột\n), such as\nSuper Q Tương Hột\nor\nCholimex\n2\nounces\n(\n60\ng\n)\nsmooth peanut butter\n1/2\ncup\n(\n120\nml\n)\nmilk\n, plus more as needed\n4\nounces\n(\n115\ng\n)\nVietnamese pork pâté\n, such as\nFlower Brand\n2\ntablespoons\n(\n25\ng\n)\nsugar\n, plus more to taste\n1\ntablespoon\n(\n15\nml\n)\ndistilled white vinegar\n1/2\nteaspoon\nfish sauce\n, plus more to taste\n1/8\nteaspoon\nfreshly\nground black pepper\n2\nfresh Thai chiles\n, stemmed and thinly sliced\nFor the Nem Lụi Huế:\n1/2\nteaspoon\nbaking powder\n2\nounces\n(\n55\ng\n)\npork back fat\n, cut into 1/4-inch dice (see note)\n8\nounces\n(\n225\ng\n)\nground pork\n(see note)\n6 1/2\nounces\n(\n185\ng\n)\nVietnamese pork paste\n, such as\nTay Ho\nand\nPhu Huong\n2\ntablespoons\n(\n25\ng\n)\nsugar\n1 1/2\ntablespoons\n(\n20\nml\n)\nfish sauce\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for\ntable salt\n, use half as much by volume\n1/2\nteaspoon\nfreshly\nground black pepper\n2\nmedium\nshallots\n(\n40\ng\n), finely chopped\n4\ncloves\n(\n16\ng\n)\ngarlic\n, finely minced\n1\nounce\n(\n30\ng\n) cooked and shredded\npork skin\n, roughly chopped (optional, see note)\n16\nlemongrass\nstalks\n, bottoms trimmed to 6-inch lengths and lightly crushed with the blunt side of a knife\nVegetable\nor other\nneutral oil\n, for greasing and brushing\nPickled carrots\n, for serving,\ncarot chua\n(see note)\nPickled papaya\nfor serving,\ndu du chua\n(see note)\nTo Serve as Rice Paper Platter:\n2\nounces\n(\n55\ng\n)\nVietnamese rice vermicelli noodles\n8\nounces\n(\n225\ng\n) fresh skinned and cored\npineapple\n, sliced lengthwise into 3-inch long and 1/4-inch-thick pieces\n2\nPersian cucumbers\n, thinly sliced lengthwise into 1/4-inch-thick pieces\n1\nsmall\ngreen mango\n, peeled, pitted, and sliced lengthwise into 3-inch long and 1/4-inch-thick pieces (see note)\n2\nsmall\nstar fruit\n, sliced crosswise into 1/4-inch-thick pieces (optional; see note)\n2\nsmall\ngreen bananas\n, peeled and thinly sliced lengthwise into 1/8-inch-thick pieces (optional; see note)\n1\nhead\nbutter lettuce\n, leaves picked and washed\n1\nbunch\nrau ram\n(\nVietnamese coriander\n), leaves picked\n1\nbunch\nperilla\n, leaves picked\n1\nbunch\nmint\n, leaves picked\nRice papers\n, round or square\nDirections\nIn a small saucepan, heat oil over medium-high heat until shimmering. Add shallots and garlic and cook, stirring frequently, until softened, about 2 minutes. Add ground pork and cook, stirring to break up the meat, until browned, about 3 minutes.\nVy Tran\nReduce heat to medium-low and add whole grain soybean sauce and peanut butter. Whisk in milk and pâté until smooth. Bring to a simmer and cook, stirring frequently to prevent burning, until thickened slightly, about 3 minutes.\nVy Tran\nWhisk in sugar, vinegar, fish sauce, and pepper. Cook until slightly thicker than gravy, about 2 minutes. Season to taste with additional sugar or fish sauce, if desired. If it's too thick, whisk in 1 tablespoon of milk at a time until it reaches a desirable consistency. Remove from heat.\nVy Tran\nTransfer mixture to a food processor bowl and process until smooth. Using a flexible spatula, scrape sauce into a serving bowl. Stir in chiles and set aside until ready to serve.\nVy Tran\nFor the Nem Lụi Huế:\nIn a small bowl, stir together baking powder with 1 1/2 teaspoons (7ml) water; set aside. In a small saucepan, bring 2 cups (475ml) water to a boil over medium-high heat. Add pork fat and simmer to render out some of the excess fat, about 4 minutes. Drain pork fat, and transfer to a large bowl.\nVy Tran\nAdd ground pork, pork paste, sugar, fish sauce, salt, pepper, and reserved baking powder mixture to bowl with pork fat. Using clean hands, knead pork mixture until well combined, 2 to 3 minutes. Add shallots, garlic, and chopped pork skin (if using), and knead until well combined, about 1 minute. Cover and refrigerate pork mixture for at least 2 and up to 8 hours.\nVy Tran\nLine a rimmed baking sheet with parchment. Divide pork mixture into 16 even portions, approximately 1 ounce (30g) each. Coat gloved or ungloved palms lightly with vegetable oil. Roll each portion of pork mixture into a 3-inch log around base of each lemongrass skewer and place on prepared baking sheet.\nVy Tran\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate.\nBrush skewers with oil. Grill skewers over indirect heat, turning every 2 minutes, until cooked through, about 8 minutes.\nVy Tran\nMove skewers over direct heat and cook, flipping occasionally, until charred on both sides, about 1 minute. Serve warm with pork peanut dipping sauce and pickled vegetables.\nVy Tran\nTo Serve as Rice Paper Platter for Rolls:\nIn a 3-quart saucepan, bring 6 cups water to a boil over high heat. Cook vermicelli noodles until softened, 2 to 3 minutes. Drain and rinse with cold water. Shake off the excess water and set aside.\nVy Tran\nFill a large bowl with warm water and set on table with a platter full of grilled nem lui hue, the pork peanut dipping sauce, pickled vegetables, cooked vermicelli noodles, pineapple, cucumber, green mango, star fruit, green bananas, lettuce leaves, rau ram, perilla leaves, mint leaves, and rice paper.\nVy Tran\nTo serve, dip one sheet of rice paper in the warm water, making sure rice paper is completely wet before shaking off excess water. Lay rice paper on a serving plate and let it sit until completely pliable, about 30 seconds. Arrange any combination of lettuce, herbs, cucumber, pineapple, green mango, green banana, star fruit, and vermicelli noodles over rice paper near the end closest to you.\nVy Tran\nRemove one nem lui from its lemongrass skewer and place it on top of roll fillings. Starting with the nearest edge, carefully lift rice paper over filling, fold in the sides, then roll tightly. Serve with pork peanut dipping sauce and pickled vegetables.\nVy Tran\nSpecial Equipment\nFood processor.\nNotes\nTo prevent the meat from drying out when grilled, use ground pork that is at least twenty to twenty-five percent fat. This can be achieved by incorporating a small amount of firm pork fat (preferably from the back) with meat from a pork shoulder (butt). If you cannot find pork fat, use 10 ounces of finely ground pork belly to replace both the 2 ounces pork fat and 8 ounces pork butt in the nem lụi Huế .\nPackages of pork skin can be found in the frozen section of some Asian grocery stores, though they can sometimes be hard to find. If you can't find it, you can leave the skin out and proceed with the recipe as written. Alternatively, you can make your own by purchasing 4 ounces (110g) raw pork skin (sometimes sold as rind) from a local butcher; boil until the skin can easily be pierced by a knife, about 45 minutes, then drain and transfer to refrigerator to chill. Once cold, slice rind into hair-like strands using a sharp knife, then roughly chop into shorter lengths.\nFor the pickled carrot and papaya, use the recipe\nhere\n, but replace daikon with green papaya.\nGreen mango, star fruit, and green bananas are found at Asian grocery stores or specialty produce stores, though they are seasonal and can sometimes be challenging to find.\nMake-Ahead and Storage\nNem lụi can be formed and stored in the fridge, uncooked, for up to 1 day before grilling. The dipping sauce can be made the day before. Reheat it over the stove and thin it out with 1-2 tablespoons of milk if the consistency is too thick.\nVietnamese\nPork Shoulder\nGrilled Pork\nPork Mains"
}