{
  "url": "https://www.seriouseats.com/new-york-style-pizza",
  "image_url": "https://www.seriouseats.com/thmb/TAmlHDAkMwaIdgkkjNr8wwyik70=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20101029-pizza-lab-primary-44ffa36fd2414f06abf5f16c11f14f1c.jpg",
  "tags": [
    "Pizza",
    "Italian-American"
  ],
  "title": "New York-Style Pizza",
  "full_text": "New York-Style Pizza\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n30 mins\nRising Time\n26 hrs\nTotal\n26 hrs 55 mins\nServes\n4\nto 6 servings\nMakes\n3 pies\nCook Mode\n(Keep screen awake)\nIngredients\n22 1/2\nounces\nbread flour\n, plus more for dusting (\n638\ng\n; about\n4 1/2\ncups\n)\n0.5\nounce\ngranulated sugar\n(\n15\ng\n; about\n1 1/2\ntablespoons\n)\n0.35\nounce\nkosher salt\n(\n10\ng\n; about\n1\ntablespoon\n)\n0.35\nounce\ninstant yeast\n(\n10\ng\n; about\n2\nteaspoons\n)\n15\nounces\nlukewarm\nwater\n(\n415\ng\n; about\n1 3/4\ncups\n) (see notes)\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n1\nbatch\nNew York style pizza sauce\n1\npound\ngrated\nfull-fat dry mozzarella cheese\n(\n454\ng\n; about\n4\ncups\n), placed in freezer for at least 15 minutes\nDirections\nCombine flour, sugar, salt, and yeast in bowl of food processor. Pulse 3 to 4 times to incorporate. Add water and olive oil. Run food processor until mixture forms ball that rides around the bowl above the blade, about 15 seconds. Continue processing 15 seconds longer.\nTransfer dough ball to lightly floured surface and knead once or twice by hand until smooth ball is formed. It should pass the\nwindowpane test\n. Divide dough into three even portions and place each in a covered quart-sized deli container or in a zipper-lock freezer bag. Place in refrigerator and allow to rise at least 1 day, and up to 5.\nAt least two hours before baking, remove dough from refrigerator and shape into balls by gathering dough towards bottom and pinching shut. Flour well and place each dough ball in a separate medium mixing bowl. Cover tightly with plastic wrap and allow to rise at warm room temperature until roughly doubled in volume.\nOne hour before baking, adjust oven rack with pizza stone to middle position and preheat oven to 500°F (260°C). Turn single dough ball out onto lightly floured surface. Gently press out dough into rough 8-inch circle, leaving outer inch higher than the rest. Gently stretch dough by draping over knuckles to form a 12- to 14-inch circle about 1/4-inch thick. Transfer to pizza peel.\nSpread approximately 2/3 cup sauce evenly over surface of crust, leaving 1/2- to 1-inch border along edge. Evenly spread 1/3 of cheese over sauce. Slide pizza onto baking stone and bake until cheese is melted with some browned spots and crust is golden brown and puffed, 12 to 15 minutes. Transfer to cutting board, slice, and serve immediately. Repeat with remaining two dough balls, remaining sauce, and remaining cheese.\nSpecial Equipment\nFood processor\n,\npizza peel\nNotes\nUsing a food processor ensures that your dough is properly developed without over-oxidizing, which can affect flavor. To scale up, make dough in separate batches in food processor. Do not try to process more than one batch at a time. When adding lukewarm water to the dry ingredients, use the temperature zone recommended by the manufacturer of your yeast.\nRead More\nAwesome Pizza Without An Oven (Skillet Pizza)\nDetroit-Style Pan Pizza\nExtra-Crispy Bar-Style Tortilla Pizza\n11 Essential Tips for Better Pizza\nPizza\nItalian-American",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/new-york-style-pizza.webp?"
}