{
  "url": "https://www.seriouseats.com/new-england-clam-chowder-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rcDf1jsK3-TuKOC2YFgYV51nJN4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__01__20130109-clam-chowder-36-369325ec69764006ac16d54450ba1222.jpg",
  "tags": [
    "Seafood Mains",
    "Clams",
    "Braised & Stewed Seafood",
    "Soups",
    "Christmas Dinners"
  ],
  "title": "New England Clam Chowder",
  "full_text": "New England Clam Chowder\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n30 mins\nTotal\n50 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\nsalt pork\nor\nbacon\n, cut into 1/2-inch cubes\n2\ntablespoons\nbutter\n1\nmedium\nonion\n, finely chopped (about\n1\ncup\n)\n2\nstalks\ncelery\n, finely chopped (about\n1\ncup\n)\n1\ncup\nwater\nor\nclam juice\n2 1/2\npounds\nlive\ncherrystone\nor\nlittleneck clams\n(see notes)\n1\nquart\nwhole milk\n1 1/2\npounds\nrusset\nor\nYukon Gold potatoes\n, peeled and cut into 1/2-inch cubes\n2\nbay leaves\nKosher salt\nand freshly\nground black pepper\n1\ncup\nheavy cream\nOyster crackers\n, for serving\nDirections\nCombine salt pork and 1/4 cup water in a heavy-bottomed stock pot or Dutch oven over medium heat, stirring occasionally, until water has evaporated and pork has begun to brown and crisp in spots, about 8 minutes.\nSerious Eats / J. Kenji Lopez-Alt\nAdd butter, onion, and celery. Continue to cook, stirring occasionally, until onions are softened but not browned, about 4 minutes longer. Add clam juice or water and stir to combine.\nSerious Eats / J. Kenji Lopez-Alt\nAdd clams or quohogs and increase heat to high. Cover and cook, opening lid to stir occasionally, until clams begin to open, about 3 minutes. As clams open, remove them with tongs and transfer to a large bowl, keeping as many juices in the pot as possible and keeping the lid shut as much as possible. After 8 minutes, discard any clams that have not yet begun to open.\nSerious Eats / J. Kenji Lopez-Alt\nAdd milk, potatoes, bay leaves, and a pinch of salt and pepper to the pot. Bring to a boil, reduce to a bare simmer, and cook, stirring occasionally, until potatoes are tender and starting to break down, about 15 minutes.\nSerious Eats / J. Kenji Lopez-Alt\nMeanwhile, remove meat from inside the clams and roughly chop it. Discard empty shells. Transfer chopped clams and as much juice as possible to a fine-mesh strainer set over a large bowl. Let clams drain, then transfer chopped clams to a separate bowl. Set both bowls aside.\nSerious Eats / J. Kenji Lopez-Alt\nOnce potatoes are tender, pour the entire mixture through the fine-mesh strainer into the bowl with the clam juice rapping the strainer with the back of a knife or a honing steel to get the liquids to pass through. Transfer strained solids to the bowl with the chopped clams. You should end up with a white, semi-broken broth in the bowl underneath, and the chopped clams, potatoes, salt pork, and aromatics in the separate bowl.\nSerious Eats / J. Kenji Lopez-Alt\nTransfer liquid to a blender and blend on high speed until smooth and emulsified, about 2 minutes. Return liquid and solids back to Dutch oven. Add heavy cream and stir to combine. Reheat until simmering. Season well with salt and pepper. Serve immediately with oyster crackers.\nSerious Eats / J. Kenji Lopez-Alt\nSpecial Equipment\nDutch oven\n,\nblender\nNotes\nFor best results, use live clams. If live clams are unavailable, skip steps 2 and 4. In step 6, add 1 pound chopped canned or frozen clams to chowder before heating through to serve.\nRead More\nSerious Entertaining: A New England Seafood Dinner\nSeafood Mains\nClams\nBraised & Stewed Seafood\nSoups\nChristmas Dinners"
}