{
  "url": "https://www.seriouseats.com/new-jersey-crumb-buns-recipe-8707010",
  "image_url": "https://www.seriouseats.com/thmb/2xvCRWyxrXMWoBgHfB2gVC_BRBc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240903-SEA-DebbieWee-NJCrumbBuns-Hero3-29-d20a65c1bc2846308faf0e094b8062ef.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Breakfast & Brunch",
    "Baking",
    "American Cuisines"
  ],
  "title": "New Jersey Crumb Buns",
  "full_text": "New Jersey Crumb Buns\nClose\nJump to recipe\nPrep\n75 mins\nCook\n30 mins\nCooling Time\n2 hrs\nTotal\n3 hrs 45 mins\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\nCooking spray\n2\ncups\nall-purpose flour\n(\n9\nounces\n;\n256\ng)\n1/4\ncup\ngranulated sugar\n(\n1 3/4\nounces\n;\n50\ng\n)\n1 1/2\nteaspoons\ninstant or rapid-rise yeast\n3/4\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt, use half as much by volume\n1\nteaspoon\ngrated lemon zest,\noptional\n1/2\ncup\n(\n120\nml)\nwarm\nwhole milk\n(110-120°F)\n1\nlarge\negg\n3\ntablespoons\nunsalted butter,\ncut into 3 pieces, softened (\n42\ng\n)\nFor the Crumb Topping:\n3\nsticks\nunsalted butter,\nsoftened (\n24\ntablespoons\n;\n339\ng\n)\n1 1/2\ncups\npacked\nlight or dark brown sugar\n(11 1/4\nounces\n;\n320\ng\n)\n1 1/2\ncups\ngranulated sugar\n(\n10 1/2\nounces\n;\n300\ng\n)\n1\ntablespoon\nground cinnamon\n3 1/2\ncups\nall-purpose flour\n(\n15 3/4\nounces\n;\n455\ng\n)\nConfectioners’ sugar\nfor dusting\nDirections\nFor the Cake:\nGrease a 13-by-9-inch metal baking pan with cooking spray.\nIn the bowl of a stand mixer fitted with the dough hook attachment, whisk together flour, sugar, yeast, salt, and lemon zest, if using. In a liquid measuring cup, whisk together warm milk and egg.\nSerious Eats / Debbie Wee\nStart mixer on low speed and slowly pour in milk mixture in steady stream. Mix, scraping down sides and bottom of bowl as needed, until dough is uniform and no dry flour remains, 2 to 3 minutes.\nSerious Eats / Debbie Wee\nIncrease mixer speed to medium. With mixer running, add softened butter 1 piece at a time, mixing to incorporate after each addition. Continue to knead until dough is stretchy and webby, about 8 minutes longer (dough will be soft and sticky).\nSerious Eats / Debbie Wee\nUsing a greased dough scraper or rubber spatula, transfer dough to prepared baking pan. Lightly grease your hands and press and stretch dough into an even layer to fill the edges of pan. Cover pan tightly with a kitchen towel or greased plastic wrap and let dough rise at room temperature until slightly puffy, 45 minutes to 1 hour.\nSerious Eats / Debbie Wee\nFor the Crumb Topping:\nMeanwhile, adjust oven rack to middle position and preheat oven to 350°F (275°C). Clean and dry stand mixer bowl and fit stand mixer with paddle attachment. In mixer bowl, combine softened butter, brown sugar, granulated sugar,\nand cinnamon. Cream together on medium-high speed until light and fluffy, about 5 minutes. Stop mixer and using a rubber spatula, scrape down sides of bowl. Start mixer on medium-low speed and add flour, a few tablespoons at a time, until incorporated and mixture forms clumps with the texture of soft cookie dough. Scrape dough from paddle, cover bowl, and let sit at room temperature for at least 10 minutes.\nSerious Eats / Debbie Wee\nWhen dough is ready, remove plastic wrap. If dough has shrunk away from sides of pan, gently stretch it back into edges. Use your hands to squeeze and compress crumb topping into large chunks, then break into 1/2- to 1-inch pieces and scatter evenly over dough in pan. (It will seem like way too much, but it’s not!) Using flat hands, gently press crumb layer into surface of cake.\nSerious Eats / Debbie Wee\nBake until crumb topping begins to turn light golden brown and wooden skewer inserted in center of cake comes out clean, 25 to 30 minutes. Transfer baking pan to wire rack and let cake cool completely, about 2 hours. Cut cake into squares and dust heavily with confectioners’ sugar right before serving.\nSerious Eats / Debbie Wee\nSpecial Equipment\nInstant-read thermometer, 9-by-13-inch metal baking pan, stand mixer, dough scraper, whisk, rubber spatula, wire rack, chef’s knife\nNotes\nThe longer the cake bakes, the crispier the crumbs will be on top. The cake layer is quite thin and doesn’t take long to bake through, so err on the shorter end of the baking time for the softest crumbs.\nMake-Ahead and Storage\nYou can wrap the pan tightly in plastic wrap to store the crumb buns at room temperature for up to 3 days. Dust with confectioners’ sugar just before serving.\nCakes\nThe Latest\nBreakfast & Brunch\nBaking\nAmerican Cuisines",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/new-jersey-crumb-buns.webp?"
}