{
  "url": "https://www.seriouseats.com/new-jersey-trenton-mustard-pizza-recipe-11707079",
  "image_url": "https://www.seriouseats.com/thmb/Bkfc9x9qQw5jlS21xKTVY2W04to=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250326-SEA-NJMustardPizza-TwoBites-Beauty2-35-16d5070279864dc6b64822101d714f24.jpg",
  "tags": [
    "Pizza",
    "The Latest",
    "Vegetarian"
  ],
  "title": "NJ-Style Mustard Pie",
  "full_text": "NJ-Style Mustard Pie\nClose\nJump to recipe\nPrep\n30 mins\nCook\n45 mins\nTotal\n75 mins\nServes\n3\nto 6\nMakes\n3 pizzas\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n14-ounce\n)\ncan\nwhole peeled tomatoes in their juices\n(\n397\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1 1/2\nteaspoons\nsugar\nKosher salt\n2 1/2\ntablespoons\n(\n38\ng\n)\nDijon mustard\n2 1/2\ntablespoons\n(\n38\ng\n)\nspicy brown mustard\n12\nounces\n(\n340\ng\n)\nwhole milk, low-moisture mozzarella\n, grated fresh (about\n3\ncups\n)\nOne recipe\nNY Style Pizza Dough\n(this will yield dough for\n3\npizzas\n) or\n2\npounds\nstore-bought pizza dough\n(see notes)\nDirections\nSet oven rack to lower-third position and place a pizza stone or baking steel on it; preheat oven to 500°F (260°C) or as high as your oven will go. Wait at least 30 minutes before baking.\nIn a food processor, combine tomatoes, olive oil, and sugar and process until mostly smooth with only small chunks remaining. Season to taste with salt. Transfer to a bowl and set aside.\nSerious Eats / Two Bites\nIn a small bowl, stir together Dijon and spicy brown mustards and set aside until ready to use. If mixture is too thick, stir in a drop or two of water to loosen slightly for easier spreading.\nSerious Eats / Two Bites\nSet one ball of dough on a well-floured work surface and, using your fingers, press down repeatedly to dock the dough and flatten slightly. Then, using the base of your palm, press the dough into a slightly larger circle roughly 7 inches wide. Next, stretch dough into a 12-inch circle either by draping the dough over your hands and using your knuckles to evenly stretch the dough, or by quickly tossing it back and forth between your hands, rotating the dough to maintain an even circle (this second method is the most effective but also takes the most practice). Lay the dough on a lightly floured pizza peel.\nSerious Eats / Two Bites\nDollop 1/3 of the mustard mixture onto the center of the dough, then use the back of a spoon to spread the mustard all over the dough, leaving a 1-inch border. Top with 1/3 of the cheese, staying within the border of the mustard.\nSerious Eats / Two Bites\nUsing a large spoon, drizzle 2 1/4 ounces (64g), about ⅓ cup, of sauce over the pie. Carefully, but confidently, slide the dough off the peel onto the pizza stone. Cook until the crust is thoroughly browned and the cheese is melted, 12 to 15 minutes.\nSerious Eats / Two Bites\nUsing the peel, transfer pizza to a clean work surface and immediately slice. Repeat with the remaining dough balls and topping ingredients.\nSerious Eats / Two Bites\nNotes\nIf using the linked recipe, prepare it including the instructed 2-hour rest in step 2, then proceed with the dough in this recipe as instructed. If using store-bought dough, each dough ball should be about 9 to 10 ounces (255 to 285 grams); this means that for 3 pizzas you’ll need about 2 pounds of store-bought dough. Most store-bought doughs (both fresh and frozen) are fully proofed, but if not, follow package instructions to prepare for baking.\nSpecial Equipment\nPizza stone or baking steel, pizza peel, food processor\nMake-Ahead and Storage\nThe sauce can be refrigerated in an airtight container for up to 5 days.\nPizza\nThe Latest\nVegetarian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nj-style-mustard-pie.webp?"
}