{
  "url": "https://www.seriouseats.com/new-orleans-style-red-beans-rice-recipe",
  "image_url": null,
  "tags": [
    "Braised & Stewed Beans",
    "Soul Food & Southern",
    "Cannellini & Kidney Beans",
    "Beans Mains",
    "Beans Sides"
  ],
  "title": "New Orleans–Style Red Beans and Rice",
  "full_text": "New Orleans–Style Red Beans and Rice\nJump to recipe\nCook\n3 hrs 5 mins\nActive\n30 mins\nSoaking Time\n8 hrs\nTotal\n11 hrs 5 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nred kidney beans\nKosher salt\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\nor\nlard\n1\npound\n(about\n450\ng\n) cooked\nandouille sausage\n, cut into 1/2-inch disks\n1\nlarge\nonion\n, finely chopped (about\n12\nounces\n;\n340\ng\n)\n1\ngreen bell pepper\n, stemmed, seeded, and finely chopped (about\n8\nounces\n;\n225\ng\n)\n4\nribs\ncelery\n, finely chopped (about\n8\nounces\n;\n225\ng\n)\n4\nmedium cloves\ngarlic\n, minced\n1/2\nteaspoon\nto\n1\ntablespoon\n(\n3 to 15\ng\n) ground\ncayenne pepper\n(depending on how hot you like it)\n1\nteaspoon\n(about\n4\ng\n) ground\nsage\nFreshly\nground black pepper\n1\nsmoked ham hock\n(optional)\n8\nounces\n(\n225\ng\n)\npickled pork\nshoulder or\nrind\n(optional; see note)\n4\nsprigs\nfresh thyme\n3\nbay leaves\nHot sauce\n, such as Crystal or Frank's, to taste\nCider vinegar\n, to taste (optional; see note)\nCooked white rice\n, for serving\nDirections\nPlace beans in a large bowl and cover with 6 cups (1.5L) cold water. Add 2 tablespoons (30g) kosher salt and stir until dissolved. Set aside at room temperature for 8 to 16 hours. Drain and rinse.\nSerious Eats / Liz Voltz\nIn a large Dutch oven, heat oil or lard over medium-high heat until shimmering. Add andouille and cook, stirring, until lightly browned, about 5 minutes. Add onion, bell pepper, and celery. Season with salt and cook, stirring, until vegetables have softened and are just starting to brown around the edges, about 8 minutes. Add garlic and cook, stirring, until fragrant, about 45 seconds. Add cayenne pepper, sage, and a generous 10 to 12 grinds of fresh black pepper. Cook, stirring, until fragrant, about 30 seconds. Add beans, along with enough water to cover by about 2 inches (roughly 6 to 8 cups), ham hock (if using), pickled pork (if using), thyme, and bay leaves. Bring to a boil and reduce to a bare simmer. Cover and cook until beans are completely tender, 1 1/2 to 2 1/2 hours. (Older beans can take longer.)\nSerious Eats / Liz Voltz\nSerious Eats / Liz Voltz\nRemove lid and continue to cook, stirring occasionally, until liquid has thickened and turned creamy, about 20 minutes. If the pot starts to look dry before the stew turns creamy, add a cup of water and continue simmering. Repeat as necessary until desired level of creaminess is achieved. Discard bay leaves and thyme stems. Season to taste with hot sauce, a few teaspoons of cider vinegar (if using), and more salt and pepper. For best texture, let cool and refrigerate overnight. Reheat the next day, adding a little water to loosen to desired consistency. Serve red beans over steamed white rice.\nSerious Eats / Liz Voltz\nSpecial Equipment\nDutch oven\nNotes\nPickled pork can be difficult to find, and the beans can easily be made without it. If you're omitting the pickled pork, a small splash of cider vinegar can help brighten up the flavor of the beans, but is not completely necessary. Add it to suit your own taste.\nRead More\nRed Beans and Rice With Smoked Turkey\nHoppin' John\nArroz con Gandules (Puerto Rican Rice With Pigeon Peas)\nJamaican Rice and Peas\nCuban Black Beans and Rice\nColombian-Style Beans and Rice\nGallopinto (Nicaraguan Rice and Beans)\nHardcore Feijoada\nBraised & Stewed Beans\nSoul Food & Southern\nCannellini & Kidney Beans\nBeans Mains\nBeans Sides"
}