{
  "url": "https://www.seriouseats.com/nidi-di-rondine-lasagna-recipe-8787141",
  "image_url": "https://www.seriouseats.com/thmb/QtJcMcmQLq0AjIG8vTdhD2_NM9I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250206-NididiRondine-AmandaSuarez-13-e79cf980f630417b9c5d6474fde1d872.jpg",
  "tags": [
    "Lasagna",
    "The Latest",
    "Italian",
    "Pastas"
  ],
  "title": "Nidi di Rondine (Rolled Lasagna)",
  "full_text": "Nidi di Rondine (Rolled Lasagna)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nRefrigeration Time:\n60 mins\nTotal\n2 hrs\nServes\n4\nto 5\nMakes\n15 lasagna wheels\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Besciamella:\n3\ntablespoons\nunsalted butter\n(\n1 1/2\nounces\n;\n40\ng\n)\n3\ntablespoons\n(\n24\ng\n)\nall-purpose flour\n2\ncups\n(\n480\nml\n)\nwhole milk\nKosher salt and freshly ground black pepper\nPinch\nfreshly\ngrated nutmeg\n(optional)\nFor the Assembly:\n1\npound\n(\n450\ng\n) store-bought or homemade fresh\nlasagna noodles\n(if homemade, follow the recipe and instructions\nhere\nthrough step 10), cut into 6- by 12-inch rectangles\nVegetable oil\n, for greasing pan and pasta\n8\nounces\n(\n227\ng\n)\nfontina\n, rinds trimmed and cut into 1/4-inch pieces\n1\ncup\nfinely grated\nParmigiano-Reggiano\n(\n4\nounces\n;\n112\ng\n), divided, plus more for garnish\n8\nounces\n(\n227\ng\n)\nprosciutto\ncotto, torn into into 2-inch pieces\nDirections\nFor the Besciamella:\nIn a small saucepan, melt butter over medium-high heat. Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream until fully combined. Sauce will initially become very thick, then get very thin once all the milk is added.\nSerious Eats / Amanda Suarez\nHeat, stirring constantly, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook until sauce is just thick enough to coat the back of a spoon, about 3 minutes. Season with salt and pepper. Whisk in nutmeg, if using. If any lumps form, simply whisk thoroughly or use a handheld blender. Press a piece of plastic wrap over the surface of the sauce to prevent a skin from forming and keep warm until ready to use.\nSerious Eats / Amanda Suarez\nTo Cook Pasta:\nPrepare an ice bath and line a baking sheet with parchment. In a pot of salted boiling water and working in batches, cook pasta until just shy of al dente, about 1 minute for fresh pasta. Using a spider skimmer or mesh strainer, transfer immediately to ice bath to cool. Drain pasta well, then brush each sheet, one at a time, lightly on both sides with vegetable oil to prevent sticking. Lay them on prepared baking sheet, adding layers of parchment between the layers of pasta to prevent sticking.\nSerious Eats / Amanda Suarez\nTo Make the Rosette:\nOn a clean work surface, lay one pasta sheet with a short side facing you. Spread 1/4 cup of the besciamella in a thin layer evenly on top of pasta sheet, then sprinkle with about 2 tablespoons grated Parmigiano and pieces of prosciutto and fontina. Starting at the bottom, roll up the layered pasta like a jelly roll. Transfer to a sheet pan seam-side down.\nSerious Eats / Amanda Suarez\nRepeat the process with the remaining pasta sheets, cheese, and sauces to make a total of 5 rolls. Cover loosely with plastic wrap and refrigerate the rolls until chilled, at least 1 hour or up to 12 hours. Cover remaining besciamella with plastic wrap flush against surface and set aside.\nSerious Eats / Amanda Suarez\nTo Assemble and Bake:\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Grease a 6- by 9-inch baking dish or 2-quart round casserole with oil. Gently slice each roll in thirds crosswise to make 15 pinwheels.\nSerious Eats / Amanda Suarez\nSpread the remaining besciamella on the bottom of the baking dish. Arrange lasagna rolls cut-side up, then sprinkle the remaining Parmigiano on top. Bake, rotating baking dish halfway through, until golden brown, 30 to 35 minutes.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nDutch oven, 6- by 9-inch baking dish or 2-quart round casserole, baking sheet, parchment, spider strainer or mesh strainer\nNotes\nIf you can’t find prosciutto cotto, you can substitute American-style ham steak, just make sure to use a lighter hand while seasoning both the besciamella and pasta cooking water with salt, as American ham steak is generally saltier than Italian prosciutto cotto.\nMake Ahead and Storage\nStore leftover baked rosettes in an airtight container for up to three days. Cover with foil and reheat in the oven at 375°F (190°C) until warmed through, removing the foil for the last 5 minutes, about 30 minutes total.\nLasagna\nThe Latest\nItalian\nPastas"
}