{
  "url": "https://www.seriouseats.com/nigerian-eba-5270376",
  "image_url": "https://www.seriouseats.com/thmb/Yuy4kFnMrFevjzU-popJw5MDtZ4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220425-Eba-Maureen-Celestine-16-Step3-1-8cbf0f408804485e9a14a158a32b06c3.JPG",
  "tags": [
    "Nigerian",
    "Sides",
    "Vegetables",
    "The Latest"
  ],
  "title": "Nigerian Eba",
  "full_text": "Nigerian Eba\nClose\nJump to recipe\nPrep\n5 mins\nCook\n0 mins\nStanding Time\n10 mins\nTotal\n15 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ncups\n(\n750\nml\n) boiling\nwater\n2\ncups\n(\n250\ng\n;\n8.8\nounces\n)\nwhite\nor\nyellow garri\n(see note)\nDirections\nPour boiling water into a large heatproof bowl. Evenly sprinkle garri all over the surface and let stand until water is absorbed, no dry garri remains, and mixture has thickened, about 5 minutes.\nSerious Eats / Maureen Celestine\nUsing a wooden spoon or sturdy silicone spatula, stir mixture until a cohesive dough forms; the dough should be dense and somewhat heavy, yet slightly sticky and easy to scoop (see note below for troubleshooting).\nSerious Eats / Maureen Celestine\nTo serve, scoop 1/2cup (115g) portions onto individual plates or bowls. Serve eba immediately with Nigerian soups or stews, such as egusi. (Alternatively, to make  quenelles, scoop 1/2 cup portions of eba into a small bowl that has been wetted with water. Gently rock bowl side-to-side until a smooth, oblong shape forms; transfer to a plate or bowl. Repeat with remaining dough).\nSerious Eats / Maureen Celestine\nNotes\nGarri can be purchased in Nigerian or West African stores, and online from websites like\nMychopchop\nand\nOsiAfrik\n. Yellow, white, and Ijebu (longer fermented garri with drier, crunchier grains and a more sour flavor that is generally favored for soaking garri) varieties are commonly available. Despite the differences in color and flavor, all types of garri can be used to make eba.\nThe type of garri used can greatly affect the resulting dough, due to variations in how different types of garri are fermented and processed. If your dough is too soft and wet (e.g., it will not form a cohesive mass), stir in additional garri in 1 tablespoon (15g) increments to reach desired consistency. If the dough is too hard, stiff, or dry (e.g., crumbly with uneven wet and dry patches), stir in boiling water, 1 tablespoon (15ml) at a time, to achieve desired consistency.\nMake-Ahead and Storage\nEba is so easy to make, and tricky enough to reheat, that it's best made as needed. That said, it can be prepared shortly in advance and held. To do so, after Step 2, roughly divide the dough in half. Wrap each half tightly in plastic wrap, forming a circular mound. Repeat with the remaining dough. Transfer to an insulated container to keep warm for up to 2 hours; unwrap before serving.\nRead More\nNigerian Beef Stew\nNigerian Stewed Greens\nNigerian Peanut Stew\nNigerian\nSides\nVegetables\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nigerian-eba.webp?"
}