{
  "url": "https://www.seriouseats.com/nigerian-jollof-rice-recipe-6741471",
  "image_url": "https://www.seriouseats.com/thmb/UG-tX_LRPOZszzorA_-hFZdmwLg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220908-nigerian-jollof-rice-maureen-celestine-hero-no-spoon-29f44ba966324fff8149c05d0ecca7b7.JPG",
  "tags": [
    "Nigerian",
    "White Rice",
    "The Latest"
  ],
  "title": "Nigerian Jollof Rice",
  "full_text": "Nigerian Jollof Rice\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nTotal\n90 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Stew Base:\n1\npound\n(475g)\nplum tomatoes\n(about 3 medium tomatoes), cored and roughly chopped\n2\nmedium\n(7-ounce; 200g)\nred bell peppers\nor 2 red shepherd peppers (see note), stemmed, seeded, and roughly chopped\n1\nmedium\n(8-ounce; 225g)\nred onion\n, roughly chopped\n1/4\nof a Scotch bonnet or\nhabanero pepper\n, stemmed and seeded\n1 1/2\ncups\n(355ml)\nNigerian stock\nFor the Jollof Rice:\n1/4\ncup\n(60ml) peanut, vegetable, or other\nneutral oil\n, divided\n1\nmedium\n(8-ounce; 225g)\nred onion\n, thinly sliced, divided\n3\ndried bay leaves\n2\nteaspoons\nCaribbean/Jamaican-style curry powder\n(see note), plus more if needed\n2\nteaspoons\ndried thyme\nKosher\nor sea salt and freshly ground black or white pepper\n2\ntablespoons\n(30g)\ntomato paste\n3\nteaspoons\n(12g)\nunsalted butter\n, divided (see note)\n1 1/2\ncups\n(355ml)\nNigerian stock\n2\ncups\n(400g) converted long-grain rice or Golden Sella\nbasmati\n, rinsed\n1\nplum tomato\n(4-ounces; 120g), halved then sliced thinly crosswise into half-moons\nDirections\nFor the Stew Base:\nIn a blender jar, combine tomatoes, red pepper, onion, Scotch bonnet or habanero, and stock. Blend until a smooth puree forms, about 2 minutes. This will yield just shy of 5 cups (1.18L).\nSerious Eats / Maureen Celestine\nTransfer the stew base to a 3-quart saucier or saucepan, cover partially with a lid to contain splatter, and bring to a boil over medium-high heat. Reduce the heat to medium-low and cook, stirring and scraping the bottom occasionally, until reduced by half (roughly about 2 1/2 cups; 590ml), about 30 minutes. Remove from heat and set aside.\nSerious Eats / Maureen Celestine\nFor the Jollof Rice:\nIn a 4- or 5-quart pot or Dutch oven, heat 2 tablespoons (30ml) oil over medium heat until shimmering. Add half the sliced onion along with the bay leaves, curry powder, dried thyme, a large pinch of salt, and a large pinch of black or white pepper. Cook, stirring, until the mixture is fragrant and the onion softens slightly, about 3 minutes.\nSerious Eats / Maureen Celestine\nStir in tomato paste and 2 teaspoons (8g) butter. Cook, stirring continuously, until the tomato paste darkens, about 3 minutes. Stir in reserved stew base, cover partially with the lid to prevent splattering, and cook at a gentle simmer over medium-low heat until reduced by half, about 15 minutes.\nSerious Eats / Maureen Celestine\nStir in stock and bring to a boil over high heat. Season with salt and pepper; if the curry flavor is lacking, you can add more to taste (the curry powder should come through pleasantly but not be overpowering, though this is a question of personal taste).\nSerious Eats / Maureen Celestine\nStir in rice until evenly coated in sauce. Cover the pot with a double piece of foil or parchment paper, crimped down around the edges to seal, then top with lid (this will trap steam to lock in the flavor and aid cooking). Reduce the heat to the lowest possible and cook for 20 minutes, then uncover pot and gently stir rice to redistribute. Cover again and continue to cook until rice is just cooked through but still retains a firm bite and the liquid is mostly absorbed, about 15 minutes longer. If rice is undercooked and/or still wet, cover and cook 5 minutes longer.\nSerious Eats / Maureen Celestine\nStir in sliced tomato along with the remaining sliced onion and the remaining 1 teaspoon (4g) butter until butter is fully melted.\nSerious Eats / Maureen Celestine\nRemove from the heat, cover, and let stand 10 minutes. Serve.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nBlender\n, 3-quart\nsaucier\nor\nsaucepan\n, 4- or 5-quart pot or\nDutch oven\nNotes\nRed shepherd peppers are sweet, long, thin-skinned Italian peppers, similar to\nNigerian tatashe peppers\n. They have great flavor and bring a deep red color to Jollof rice. If you can't find them, red bell peppers can be used instead.\nLion curry powder is my favorite brand. If you can’t find it, Ducros is an acceptable substitute, as are Jamaican or West Indian curry powders.\n3 teaspoons butter is the same as 1 tablespoon, so to evenly divide the butter into 3 teaspoons, first cut off a 1-tablespoon piece using the markings on the wrapper for guidance, then divide into equal thirds.\nThis recipe works best with converted long-grain rice (also known as parboiled rice), including converted styles of basmati (such as Golden Sella).\nMake-Ahead and Storage\nThe stew base can be prepared in advance and refrigerated for a week in an airtight container, or frozen for up to 3 months.\nJollof rice keeps well—in fact many people love leftover jollof. Thaw leftovers overnight in the fridge, then warm on the stove top over gentle heat, or in the microwave.\nRead More\nNigerian Fried Rice Recipe\nDodo (Nigerian Plantains) Recipe\nMoin Moin Recipe (Nigerian Steamed Bean Cake) Recipe\nCreole-Style Red Jambalaya With Chicken, Sausage, and Shrimp Recipe\nDirty Rice Recipe\nNigerian\nWhite Rice\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nigerian-jollof-rice.webp?"
}