{
  "url": "https://www.seriouseats.com/nigerian-beef-suya",
  "image_url": "https://www.seriouseats.com/thmb/3UFS8-r5ayxHlEC7_DF2HzQ7D-Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201015-Suya-sho-spaeth-1-78c58be723c944068b3f85c8ff4f9d23.jpg",
  "tags": [
    "Recipes by World Cuisine",
    "West African",
    "Flank Steaks",
    "Beef Mains",
    "Quick Dinners"
  ],
  "title": "Nigerian Beef Suya (Spiced Grilled Skewers) Recipe",
  "full_text": "Nigerian Beef Suya (Spiced Grilled Skewers) Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nActive\n2 hrs\nMarinating Time\n30 mins\nTotal\n95 mins\nServes\n12 skewers\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Yajin Kuli:\n1/2\ncup\n(spooned)\nroasted groundnut\n/\npeanut butter powder\n(\n40\ng\n) (see note)\n1\ntablespoon\n(\n5\ng\n)\nground ginger\n1\ntablespoon\n(\n8\ng\n)\nsweet paprika\n1\ntablespoon\n(\n10\ng\n)\nonion powder\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; if using\ntable salt\n, use half as much by volume\n1\nteaspoon\n(\n4\ng\n)\ngarlic powder\n1\nteaspoon\ncayenne pepper\n1/2\nteaspoon\nground grains of selim\nor\ngrains of paradise\n(optional; see note)\n1/2\nteaspoon\nground (African) cubeb pepper\n(see note)\n1/4\nteaspoon\nground cloves\nFor the Suya:\n1\npound\n(\n450\ng\n)\nbeef flank\nor\nsirloin steak\n(see note)\n3\ntablespoons\n(\n45\nml\n)\npeanut oil\n, or\nneutral-flavored oil\n, such as\ncanola\nFor Serving:\nRed onions\n, thinly sliced\nTomatoes\nLimes\n, halved\nCrisp lettuce\nCoriander leaves\nDirections\nFor the Yajin Kuli:\nIn a small mixing bowl, combine groundnut/peanut butter powder, ground ginger, sweet paprika, onion powder, kosher salt, garlic powder, cayenne pepper powder, ground grains of selim (if desired), cubeb pepper, and ground cloves. Whisk to mix thoroughly, about 30 seconds. Set aside.\nFor the Suya:\nWrap beef tightly in plastic wrap and place on a plate or small baking sheet and set in the freezer until the beef is partially frozen and firm to the touch, 15 to 30 minutes. Using a sharp chef's knife or slicing knife, slice beef against the grain into 2-inch-long, 1-inch-wide, and 1/8-inch-thick strips. (The easiest and most efficient way to do this is to start by portioning the beef into 2-inch-wide by 1-inch-thick pieces, and then slicing those pieces crosswise into 1/8-inch-thick strips.)\nPlace sliced beef in large mixing bowl and drizzle peanut oil over it. Sprinkle 1/2 cup of yajin kuli over the beef and carefully toss and massage spice rub into beef until it is evenly coated. Cover, place in refrigerator, and allow beef to marinate for at least 30 minutes and up to 8 hours.\nWorking with one piece of beef at a time, thread beef onto skewers, piercing each piece through twice to secure it, then bunching meat tightly together like an accordion. Continue threading beef onto skewer, making sure it's bunched tightly together, leaving no parts of the skewer exposed except for a 2-inch handle at the bottom and the pointy tip at the top. Repeat skewering process with remaining beef.\nIf Using Skewer-Specific Grill Setup:\nSet up grill for skewers,\nmaking sure to adjust distance between bricks to the length of your skewers.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly in the channel between bricks.\nPlace skewers directly over the hot coals, balancing them on top of the bricks, with the handles overhanging the bricks closest to you, and the tips balancing on the farther wall of bricks. Cook, turning frequently, until beef is lightly charred and a piece of beef looks cooked through when removed and cut in half, about 8 minutes. If flare-ups occur, move the skewers around as needed to get them away from the flames. Transfer to serving platter and let rest 2 to 3 minutes (see note).\nIf Using Conventional Charcoal or Gas Grill:\nLight 1 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate.\nPlace skewers on grate and cook over direct heat, turning once, until charred on both sides and a piece of beef looks cooked through when removed and cut in half, about 8 minutes. Transfer to serving platter and let rest 2 to 3 minutes (see note).\nFor Serving:\nServe with reserved yajin kuli, thinly sliced red onions, tomatoes, lime halves, crisp lettuce, and coriander leaves and tender stems.\nSpecial Equipment\nCharcoal\nor\ngas\ngrill,\nbamboo skewers\nNotes\nIf you can only find raw peanut powder, toast it in a dry pan on medium to low heat for 5 to 6 minutes, stirring constantly and making sure you're stirring to the bottom of the pan, until it goes from beige to brown. Remove from heat and spread on a plate/baking sheet to cool. Once cool, you can pass it through a fine sieve to get rid of any clumps.\nIf you can't find peanut powder, you can use the same amount of unsweetened peanut butter.\nIf you don't have the grains of selim, grains of paradise, or cubeb pepper, they can be replaced by using ground black pepper.\nIn Nigeria, the cooked suya is left to rest for a few hours and then reheated on the grill later, which intensifies the flavors.\nMake-Ahead and Storage\nThe yajin kuli spice blend can be made far in advance. Stored in an airtight container, it will keep in the refrigerator or freezer for up to 6 months.\nThe skewers can be grilled in advance, as well. Well-wrapped, the skewers will keep in the refrigerator for up to 8 hours. Reheat them on a grill before serving.\nRead More\nHow to Stock a Nigerian Store\nCambodian Grilled Lemongrass Beef Skewers Recipe\nRecipes by World Cuisine\nWest African\nFlank Steaks\nBeef Mains\nQuick Dinners"
}