{
  "url": "https://www.seriouseats.com/nigerian-masa-fermented-rice-cake-balls-recipe-6755252",
  "image_url": "https://www.seriouseats.com/thmb/wL-iTNLR9XNPMFsb465i98uSvR0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221108-NigerianMasaMaureen-Celestine-2700-d06fd5ea0a9f4486af4bd555e5810aec.JPG",
  "tags": [
    "Nigerian",
    "The Latest",
    "Stovetop",
    "Yeast Breads"
  ],
  "title": "Nigerian Masa (Fermented Rice Cake Balls)",
  "full_text": "Nigerian Masa (Fermented Rice Cake Balls)\nClose\nJump to recipe\nPrep\n6 hrs 15 mins\nCook\n15 mins\nFermenting Time\n2 hrs\nTotal\n8 hrs 30 mins\nServes\n4 servings\nMakes\n16\nto 18 masa\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n200\ng\n)\nuncooked tuwo rice\nor\nThai jasmine rice\n(see note)\nFiltered water\n1/4\ncup\n(\n50\ng\n)\ncooked white rice\n1/2\nsmall\nred\nor\nwhite onion\n(\n30\ng\n), roughly chopped (optional)\n2\ntablespoons\n(\n30\ng\n)\nfull-fat plain yogurt\n2\ntablespoons\n(\n30\ng\n)\ngranulated sugar\n, divided\n1 1/2\nteaspoons\n(\n5\ng\n)\ninstant yeast\n1 1/2\nteaspoons\n(\n5\ng\n) Diamond Crystal\nkosher salt\n; if using\ntable salt\n, use half as much by volume or the same weight\n1/2\nteaspoon\n(\n2\ng\n)\nbaking powder\nPeanut\nor\nvegetable oil\n, for greasing\nDirections\nIn a medium bowl, cover rice with room temperature water. Using your hands, vigorously swish rice until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain rice, discarding the cloudy soaking water. Return drained rice to medium bowl and cover by at least 2 inches of filtered room temperature water. Cover bowl with plastic wrap and let soak at room temperature for at least 6 hours and up to 12 hours. The rice will whiten, almost double in volume, soften (breaking or crumbling when rubbed), and may have a light, sweet aroma.\nSerious Eats / Maureen Celestine\nSet a fine mesh strainer over a medium bowl. Pour rice and soaking water into strainer and drain well; discard soaking water. In a high-powered blender jar, combine soaked rice, cooked rice, onion (if using), yogurt, 1 tablespoon sugar, yeast, salt, and 1/4 cup filtered room temperature water. Blend until a smooth, thick, and creamy batter forms, about 30 seconds.\nSerious Eats / Maureen Celestine\nPour rice batter into a large bowl and cover bowl with plastic wrap. To make sweet masa, ferment batter at warm room temperature (about 75°F/24°C) until puffy and domed on top with a sweet rice aroma, about 2 hours. If you desire a pronounced sour flavor, continue to ferment for 6 hours longer or overnight; the batter will rise and collapse (you will see a ring on the inside of the bowl showing the level of the batter before it collapsed) with a yeasty, beer-like aroma. For both short and long ferments, the starch from the rice may settle as it stands, creating a thin, watery layer on top, and a thicker layer at the bottom. If the consistency of the batter is too thin (slightly thicker than water), whisk in 1 tablespoon of all-purpose flour or rice flour at a time until the batter has the consistency of heavy cream.\nSerious Eats / Maureen Celestine\nUncover bowl and whisk in baking powder and remaining sugar until fully incorporated and to aerate the batter, 2 to 3 minutes. (Whisking the batter at this stage does not remove air, rather it ensures that the consistency of the batter is uniform.) Whisk in 2 tablespoons of filtered room temperature water and set aside.\nSerious Eats / Maureen Celestine\nUsing a pastry brush, grease each well of the aebleskiver pan with oil (which should pool slightly in each well). Set pan over medium heat and heat until oil is shimmering. Add 2 tablespoons of batter to each well; there should be about 1/8-inch space at the top of each. As the batter cooks, the bottom firms up and forms a soft shell while the top will become dotted with bubbles. Cook until the edges begin to dry and form a cooked rim about 1/8-inch thick (the center will still be liquid), about 1 minute. Using a chopstick, skewer, or spoon, flip masa as they are ready, and cook for 1 to 2 minutes. (Flipping the masa while the center is liquid prevents the masa from having large holes.) Continue to cook, flipping about 3 to 4 times, until crunchy and deep golden brown all over, 4 to 5 minutes longer. Transfer masa to a serving plate or bowl and partially cover to keep warm.\nSerious Eats / Maureen\nRe-grease each well and repeat with remaining batter, reducing heat as needed if at risk of scorching. Allow masa to cool for 5 to 10 minutes. Serve warm with\nyaji and suya\nfor a savory take or drizzle with honey and serve with fresh fruit alongside for a sweet version.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nFine-mesh strainer, high-powered blender, whisk, nonstick aebleskiver pan, pastry brush, chopstick or skewer\nNotes\nTuwo rice, also known as masa or sinasir rice, is similar to Thai jasmine rice, so I recommend using Thai jasmine if you can’t find it. Long-grain converted rice can also be used.\nThe recipe can be halved (if you have a small blender) or doubled.\nMake-Ahead and Storage\nDrained soaked rice can be refrigerated in an airtight container for up to 3 days.\nThe blended rice mixture in Step 3 can be prepared ahead of time without the yeast and refrigerated in an airtight container for up to 1 week. When you’re ready to continue with the recipe, stir in the yeast and proceed to Step 4.\nMasa batter can be refrigerated in an airtight container for up to 3 days. It may thin and sour over time. To thicken, whisk in all-purpose flour or rice flour, 1 tablespoon at a time, until the batter has the consistency of heavy cream.\nCooked masa can be stored in an airtight container for up to 7 days at room temperature. To reheat, cover with a damp paper towel and reheat in the microwave until hot and soft, about 30 seconds to 1 minute.\nNigerian\nThe Latest\nStovetop\nYeast Breads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nigerian-masa-fermented-rice-cake-balls.webp?"
}