{
  "url": "https://www.seriouseats.com/nigerian-lafun-recipe-6834099",
  "image_url": "https://www.seriouseats.com/thmb/t99ghZ_grhAAs9ZCbO2FxDdcDnc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221130NigerianLafunMaureenCelestine18of21_1-53c60d7e9c164792932231c175d3a52e.JPG",
  "tags": [
    "Nigerian",
    "The Latest",
    "Sides"
  ],
  "title": "Nigerian Lafun",
  "full_text": "Nigerian Lafun\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\ncups\n(\n8.8\nounces\n;\n250\ng\n)\nlafun flour\n(see note)\n4\ncups\n(\n960\nml\n)\nboiling water\n, divided, plus more as needed\nDirections\nUsing a fine mesh strainer, sift lafun flour into a 3-quart saucier or saucepan; discard any fibrous matter left in the strainer. Add 2 cups (480ml) boiling water and, using a wooden spoon, stir until well combined and a rough dough has formed, about 2 minutes.\nSerious Eats / Maureen Celestine\nSet saucepan over medium-low heat, and cook, stirring and scraping bottom in a circular motion, until no lumps remain, 1 to 2 minutes. Add 1 cup (240ml) boiling water and stir until dough changes from creamy and opaque to more translucent, 5 to 10 minutes.\nSerious Eats / Maureen Celestine\nReduce heat to low. Spread dough roughly across bottom of saucepan, poke 3 or 4 1-inch-wide holes in it with a wooden spoon, and pour remaining 1 cup (240ml) boiling water on top of dough. Immediately cover and cook until most, if not all, of the water is absorbed, about 3 minutes.\nSerious Eats / Maureen Celestine\nUncover and continue to cook, stirring constantly, until lafun is soft yet firm, smooth, and stretchy, about 3 minutes (it should not be runny or sticky). If it’s too loose, add sifted lafun flour, 1/4 cup at a time, until lafun is desired consistency. If it’s too firm, add boiling water, 1 tablespoon at a time, until lafun is desired consistency.\nSerious Eats / Maureen Celestine\nTo serve, dip a spoon into water and scoop 1/2 cup portions onto individual plates or bowls. Serve lafun immediately with Nigerian soups like\negusi\n.\nSerious Eats / Maureen Celestine\nSpecial Equipment\n3-quart\nsaucier\nor\nsaucepan\nNotes\nYou can find\nlafun\nflour in Nigerian or West African stores, and online from websites like\nMychopchop\nand\nOsiAfrik\n. You can substitute white amala flour, cassava flour, and cassava fufu flour but the finished lafun may differ in texture and consistency.\nMake-Ahead and Storage\nWrapped tightly in plastic and stored in an airtight container, lafun can be refrigerated for up to 5 days. Lafun, like most Nigerian swallows, is rarely frozen since the texture changes when reheated.\nTo reheat, transfer lafun to a medium pot, pour in 1/2 cup warm water, cover, and set over low heat for 3 minutes. Uncover and continue to cook, stirring, until soft and warmed through, about 4 minutes.\nNigerian\nThe Latest\nSides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nigerian-lafun.webp?"
}