{
  "url": "https://www.seriouseats.com/nigerian-egusi-soup-5271598",
  "image_url": "https://www.seriouseats.com/thmb/hx4DAscKBee9L2v3heNWiAL50wc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220425-Egusi-Maureen-Celestine-26-hero-1-608f079ef8ae4b8b840e61e44ecb766a.JPG",
  "tags": [
    "Beef",
    "The Latest",
    "Nigerian"
  ],
  "title": "Nigerian Egusi Soup",
  "full_text": "Nigerian Egusi Soup\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs\nTotal\n2 hrs 15 mins\nServes\n6 servings\nMakes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beef and Stock:\n1 pound (\n450\ng\n) bone-in or\nboneless beef chuck roast\n, cut into 2-inch pieces\n1 medium\nred onion\n(about 6 ounces;\n175\ng\n), thinly sliced\n2\ntablespoons\nground crayfish\n(see notes)\n2 teaspoons (\n6\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for table salt use half as much by volume or the same weight\n1/2\nteaspoon\nNigerian red dry pepper\nFor the Egusi Soup:\n1 medium\nred onion\n(about 6 ounces;\n175\ng\n), roughly chopped\n1/2\nfresh\nhabanero\nor Scotch bonnet pepper, stemmed (optional)\n2 cups (10 ounces;\n300\ng\n)\nground egusi seeds\n(see notes)\n3/4 cup\nunrefined red palm oil\n(5 1/4 ounces;\n150\ng\n), such as Obiji\nKosher salt\nand Nigerian red dry pepper\n1\nteaspoon\nground crayfish\n(see notes)\n3 1/2 ounces (\n100\ng\n) fresh pumpkin leaves, amaranth greens, or\nkale\n, rinsed and finely chopped (see note)\n3 1/2 ounces (\n100\ng\n) fresh waterleaf or\nspinach\n, rinsed and finely chopped (see note)\n1\ntablespoon finely chopped\nfresh or dried bitter leaf or\nfresh\ndandelion greens\n(see notes)\nDirections\nFor the Stock:\nIn a medium pot, combine beef, onion, crayfish, salt, red pepper, and 6 1/2 cups water and bring to a boil. Lower heat to maintain a simmer and cook until the stock is slightly reduced and the beef is mostly tender, about 45 minutes (the beef will tenderize further when cooked in the soup). Using a slotted spoon, remove beef and transfer to a medium heatproof bowl; set aside. Reserve stock (you should have about 5 1/2 cups).\nSerious Eats / Maureen Celestine\nFor the Egusi Soup:\nIn a food processor or countertop blender, process onion, habanero pepper (if using), and 1/4 cup water until smooth. Scrape into a medium bowl and stir in ground egusi seeds. Add water, 1 tablespoon at a time, until a thick, creamy paste has formed (paste should be viscous and hold its shape). Set aside.\nSerious Eats / Maureen Celestine\nIn a 4-quart saucepan, heat oil over low heat for 1 minute. Slowly add all of the reserved stock, along with crayfish, and bring to a gentle simmer. Add paste, 1 heaped teaspoon at a time, to stock. Cover and cook, stirring and gently scraping the bottom of the pot occasionally, until all paste is firm and crumbly, about 25 minutes (patches of orange-red palm oil may bubble on top or around sides).\nSerious Eats / Maureen Celestine\nAdd reserved beef and stir gently to break up the cooked paste into curds (stirring more or less affects the size of the curds). Season with salt and pepper to taste. Continue to cook until beef is heated through and tender, and some orange-red palm oil pools on top, about 10 minutes.\nSerious Eats / Maureen Celestine\nMound pumpkin leaves and waterleaf on top of soup without stirring, then cover and let steam until greens are wilted, about 2 minutes. Stir in wilted greens. Add bitter leaf and cook until soft, about 8 minutes.\nSerious Eats / Maureen Celestine\nDivide soup among warmed bowls and serve hot or at room temperature with\neba\n,\nlafun\n,\ndodo\n, or\ncooked white rice\n.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nFood processor\nor\ncountertop blender\nNotes\nGround crayfish is made from small prawns that are often sun-dried and smoked.\nYou can find ground egusi seeds in many West African stores and\nonline\n.\nYou will find pumpkin leaves, also known as ugwu or ugu, in Nigerian and West African stores. Curly kale and collard greens are acceptable substitutes.\nYou will find waterleaf in Nigerian and West African stores. If unavailable, substitute with spinach.\nYou will find bitter leaf in Nigerian and West African stores. It can be purchased fresh, dried, or frozen. Most versions are washed and shredded, which tones down the bitterness. Other bitter greens, like dandelion, are a good substitute.\nTo make a creamier egusi, in Step 2, add an additional 1/2 cup water to the blender, along with the ground egusi seeds. In Step 3, stir all of the paste into the soup at once, then proceed as directed.\nYou can make egusi soup without the greens. If desired, simply omit the pumpkin leaves, waterleaf, and bitter leaf in Step 5, and proceed to serve.\nThe soup thickens as it stands. Some people prefer to eat it on the day it’s made, while others prefer it the day after.\nMake-Ahead and Storage\nThe simmered beef and stock can be refrigerated in separate airtight containers for up to 4 days, or frozen for up to 3 months (thaw before using).\nEgusi soup can be refrigerated in an airtight container for up to 3 days or frozen for up to 1 month.\nRead More\nNigerian Food 101: Recipes to Get You Started\nNigerian Beef Stew Recipe\nNigerian Pepper Soup Recipe\nBeef\nThe Latest\nNigerian"
}