{
  "url": "https://www.seriouseats.com/nigerian-pepper-soup-5323040",
  "image_url": "https://www.seriouseats.com/thmb/93j0_6zLPZiwj22ac-ZYcDGOi9s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220425-peppersoup-Maureen-Celestine-23-hero-01-9e718e54b58b4b19af8b6f7011ca7b16.JPG",
  "tags": [
    "Nigerian",
    "Soups",
    "Whole Chicken",
    "The Latest"
  ],
  "title": "Nigerian Pepper Soup",
  "full_text": "Nigerian Pepper Soup\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nTotal\n90 mins\nServes\n4\nto 6 servings\nMakes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spice Mix (See Note):\n8\nurheri pods\n(\ngrains of Selim\n), seeded\n6\nerhe seeds\n(\ncalabash nutmeg\n), shelled\n2\ngbafilo seeds\n, shelled and roughly chopped\n2\numilo seeds\n, shelled and roughly chopped\n1/2\nteaspoon\nalligator pepper\n(\ngrains of paradise\n)\n1/2\nteaspoon\nuziza seeds\nFor the Pepper Soup:\n1\nsmall\nchicken\n(about\n2\npounds\n;\n905\ng\n), cut into 2-inch pieces (see note)\n2\nquarts\n(\n1.9\nL\n)\ncold water\n2\nteaspoons\nground crayfish\n(see note)\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for table salt, use half as much by volume or the same weight\n1/2\nteaspoon\nNigerian red dry pepper\nor\ncayenne pepper\n, plus more to taste\n6\nfresh\nlemongrass leaves\n, divided (see note)\n1\nlarge\n(or\n2\nsmall\n)\nfresh makrut lime leaves\n2 to 3\nsprigs\nfresh scent leaf\n, finely chopped, for garnish (see note)\nBoiled yam\n,\nplantain\n,\nwhite sweet potatoes\n, or\ncooked white rice\n, for serving\nUnrefined West African red palm oil\n, for serving\nDirections\nFor the Spice Mix:\nIn a small stainless steel or cast iron skillet, combine urheri, erhe, gbafilo, umilo, alligator pepper, and uziza. Over medium-low heat, toast spices, stirring and swirling frequently, until fragrant, about 5 minutes. Let cool to room temperature, about 10 minutes. Transfer spices to a spice grinder and grind until a crumbly, coarse powder forms, 2 to 3 minutes. Empty into a small bowl; set aside.\nSerious Eats / Maureen Celestine\nFor the Pepper Soup:\nIn a large stockpot, combine chicken, water, ground crayfish, salt, cayenne pepper, half of the lemongrass, and prepared spice mix. Bring to a boil over high heat, then reduce heat to maintain a simmer. Simmer until chicken is cooked through and tender, but not falling off the bone, about 45 minutes (the time may vary depending on how the meat was cut).\nSerious Eats / Maureen Celestine\nAdd lime leaves and remaining lemongrass. Season with salt and cayenne pepper to taste. Let stand to allow flavors to develop, about 10 minutes.\nSerious Eats / Maureen Celestine\nTo serve, divide chicken between warmed soup bowls. Ladle broth on top, garnish with scent leaf, and serve with or alongside boiled yams, plantains, white sweet potatoes, or rice, and a small bowl of palm oil for dipping.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nStainless steel\nor\ncast iron\nskillet,\nstockpot\nMake-Ahead and Storage\nThe spice mix can be stored in an airtight container at cool room temperature for up to 6 months. Store away from light and heat.\nPepper soup can be refrigerated in an airtight container for up to 1 week, or frozen for up to 2 months.\nNotes\nIndividual spices and pre-made pepper soup spice mix can be purchased in Nigerian and West African stores, and online from websites like\nEkaterra\n,\nMychopchop\n, and\nOsiAfrik\n.\nI prefer bone-in, skin-on chicken for its richer flavor. Cutting the chicken into bite-size pieces through the bone requires a heavy-duty cleaver. If you are unable to cut up the chicken yourself and you can’t find a butcher to do it for you, substitute with 1 1/2 pounds (680g) boneless, skin-on chicken thighs, cut into bite-size pieces, and 1/2 pound (225g) chicken wings, separated into drumettes and flats.\nYou can substitute ground crayfish with an equal volume of dried prawns or shrimp, which are available in Chinese or Asian markets.\nThis recipe is ideally made with the leaves of the lemongrass plant, which are more flavorful and aromatic than lemongrass stalks. If you can’t find them, substitute with 2 stalks of lemongrass. To prepare, discard the outer layer, smash the stalk under the flat side of a knife, and cut crosswise into 3 equal lengths.\nScent leaf is a Nigerian herb, which is available fresh or\ndried\n. If you can't find it, feel free to substitute with cinnamon basil or other clove-flavored varieties of basil.\nRead More\nHow to Stock a Nigerian Store\nNigerian Food 101: Recipes to Get You Started\nNigerian Peanut Stew Recipe\nNigerian Egusi Soup Recipe\nEfo Riro Recipe (Nigerian Stewed Greens) Recipe\nNigerian Jollof Rice Recipe\nNigerian\nSoups\nWhole Chicken\nThe Latest"
}