{
  "url": "https://www.seriouseats.com/nigerian-fried-rice-recipe-6503713",
  "image_url": "https://www.seriouseats.com/thmb/SIgX6c88ymaYgdVv0sILN2UBwmk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220908-nigerian-fried-rice-maureen-celestine-Hero-896bf29d24dc4f349bbaf41c4df042e0.JPG",
  "tags": [
    "Nigerian",
    "White Rice",
    "The Latest"
  ],
  "title": "Nigerian Fried Rice",
  "full_text": "Nigerian Fried Rice\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nTotal\n60 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nconverted rice\n(\n13 1/4\nounces\n;\n375\ng\n), such as\nUncle Ben's\nOriginal or\ngolden sella basmati\n3 1/2\ncups\n(\n825\nml\n)\nNigerian-style stock\n, divided, plus more as needed\n2\ntablespoons\n(\n30\nml\n)\nvirgin coconut oil\nor\nvegetable oil\n1\nmedium\ncarrot\n(\n2 3/4\nounces\n;\n75\ng\n), cut into 1/4-inch dice\n1\nsmall\nred\nor\nwhite onion\n(\n2 1/4\nounces\n;\n60\ng\n), cut into 1/4-inch dice\n1 1/2\nounces\n(\n45\ng\n)\ngreen beans\n, stem ends trimmed and cut into 1/4-inch-thick rounds\nKosher salt\n2\nscallions\n, ends trimmed, white and green parts separated, and each thinly sliced crosswise, divided\n1/2\nlarge\nred bell pepper\n(\n2 3/4\nounces\n;\n75\ng\n), stemmed, seeded, and cut into 1/4-inch dice\n1/2\nmedium\ngreen bell pepper\n(\n2 1/4\nounces\n;\n60\ng\n), stemmed, seeded, cut into 1/4-inch dice, divided\n1/4\ncup\n(\n60\ng\n) drained canned\nwhole kernel sweet corn\n2\nteaspoons\nNigerian-style curry powder\n(see note)\n1\nteaspoon\ndried thyme\n1/4\nteaspoon\nfreshly ground black pepper\n, plus more to taste\n2\ndried bay leaves\n1/2\ncup\n(\n120\nml\n)\nfull-fat coconut milk\nDirections\nIn a large bowl, cover rice by 2 inches of cool water. Using your hands, vigorously swish rice until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. Refill the bowl with cool water, and repeat rinsing and draining process until rinsing water runs clear. Transfer drained rice to a small bowl.\nSerious Eats / Maureen Celestine\nAdd 2 1/2 cups stock to a medium pot and bring to a boil over high heat. Stir in drained rice. Return to a boil, then reduce heat to a very gentle simmer. Cover and cook until stock is absorbed and rice is half cooked, about 10 minutes. Transfer rice to a rimmed baking sheet, spread into an even layer, and let cool for 10 to 15 minutes. Using a fork, fluff rice to separate grains and set aside.\nSerious Eats / Maureen Celestine\nIn a sauté pan, heat oil over medium heat until shimmering. Add carrots, onion, and green beans, season with salt, and cook until vegetables are coated in oil and shiny, about 2 minutes.\nSerious Eats / Maureen Celestine\nAdd sliced scallion whites, red bell pepper, half of the green pepper, and corn. Cook vegetables until slightly softened, about 2 minutes. Stir in curry powder, thyme, black pepper, and bay leaves.\nSerious Eats / Maureen Celestine\nAdd half-cooked rice and stir gently to combine. Add coconut milk and remaining 1 cup stock. Return to a boil, then reduce heat to a simmer. Cover and cook until rice is cooked through, about 12 minutes. Season with salt and pepper to taste. If rice is too dry and grains are not soft or cooked through, add stock in 1/4 cup increments, and continue to cook, covered, until rice is soft and cooked through.\nSerious Eats / Maureen Celestine\nStir in sliced scallion greens and remaining green bell pepper, cover, and cook until pepper brightens and softens slightly, about 2 minutes. Serve immediately.\nSerious Eats / Maureen Celestine\nNotes\nIf you prefer not to use coconut milk, replace it with an equal volume of stock. On the other hand, if you desire a pronounced coconut flavor, you can replace half of the stock with coconut milk.\nLion curry powder\nis my favorite brand. If you can’t find it,\nDucros\nis an acceptable substitute, as are Jamaican or West Indian curry powders.\nMake-Ahead and Storage\nFried rice can be refrigerated in an airtight container for up to 3 days. You can reheat rice in a microwave or on the stovetop. To reheat on the stove, place rice in a pot. For every cup of rice, drizzle a tablespoon or two of water over the top. Set the pot over low heat and stir until the rice is warmed through.\nNigerian\nWhite Rice\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nigerian-fried-rice.webp?"
}