{
  "url": "https://www.seriouseats.com/no-bake-fudgy-chocolate-squares-recipe-11720096",
  "image_url": "https://www.seriouseats.com/thmb/lzCcXBC2cO9XBaccq9dDa4CslXo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250421-SEA-NoBakeFudgyChocolateSquares-MorganGlaze-Beauty1-2d3be09670754d099c965bc3888efcaf.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Recipes",
    "Chocolate",
    "No-Cook Desserts"
  ],
  "title": "This No-Bake Chocolate Dessert Combines the Best of Brownies, Fudge, and Mousse",
  "full_text": "This No-Bake Chocolate Dessert Combines the Best of Brownies, Fudge, and Mousse\nClose\nJump to recipe\nPrep\n20 mins\nCook\n5 mins\nChilling Time:\n105 mins\nTotal\n2 hrs 10 mins\nServes\n18\nCook Mode\n(Keep screen awake)\nIngredients\nCooking spray\n1\n(\n9\n-\nounce\n;\n255\ng\n)\npackage\nchocolate wafer cookies\n(about\n72\ncookies\n), such as Dewey’s, Oreos, or Goya Chocolate Maria Cookies (see notes)\n8\nounces\nunsalted butter\n(\n226\ng\n;\n2\nsticks\n), cut into 1 tablespoon pieces, divided\n1/2\nounce\ngranulated sugar\n(\n13\ng\n;\n1\ntablespoon\n)\n3/4\nteaspoon\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume\n12\nounces\nchopped bittersweet chocolate\n(\n340\ng\n;\n2 1/2\ncups\n), 70% cacao, divided\n1\n(14-ounce)\ncan\nsweetened condensed milk\n2\nteaspoons\ninstant\nespresso powder\n2\nteaspoons\nvanilla extract\nFlaky sea salt\n, to garnish\nDirections\nLightly spray an 8- by 8-inch baking pan with cooking spray. Line bottom and sides with parchment paper, leaving a 2-inch overhang on 2 sides. Lightly spray parchment with cooking spray; set aside.\nSerious Eats / Morgan Hunt Glaze\nIn a food processor, pulse cookies until finely ground, stopping to scrape down sides of bowl as needed, about 15 pulses. In a small microwave-safe bowl, microwave 8 tablespoons butter on high, stirring occasionally, until melted, about 1 minute. Using a flexible spatula, stir melted butter, sugar, and 1/4 teaspoon salt into ground cookies. Transfer to prepared baking pan. Using a flat-bottomed drinking glass or measuring cup, firmly press crumbs to form a compact, even layer across the bottom of the pan. Freeze, uncovered, until firm, about 15 minutes.\nSerious Eats / Morgan Hunt Glaze\nIn a large microwave-safe bowl, combine 2 cups chocolate and 4 tablespoons of the butter; microwave on high, stirring every 30 seconds, until melted and smooth, about 2 minutes. Stir in sweetened condensed milk, instant espresso, vanilla, and remaining 1/2 teaspoon salt. Pour mixture into chilled crust; using an offset spatula, spread into an even layer. Refrigerate, uncovered, until set, about 1 hour.\nSerious Eats / Morgan Hunt Glaze\nIn a medium microwave-safe bowl, combine remaining 1/2 cup chocolate and remaining 4 tablespoons butter. Microwave on high, stirring occasionally, until melted, about 1 minute. Stir until completely combined. Pour over chilled chocolate layer, and using an offset spatula, spread into an even layer. Refrigerate, uncovered, until set, about 30 minutes. Sprinkle with flaky sea salt. Lift parchment to remove bars from pan, and transfer to a cutting board. Using a sharp knife, cut into 36 squares. (For cleaner cuts, run knife under warm water, then dry knife with a clean kitchen towel before each slice.)\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\n8- by 8-inch baking pan, parchment paper, food processor, flat-bottomed drinking glass or measuring cup, microwave-safe bowl, offset spatula\nNotes\nOreo wafers can be purchased online or at specialty grocery stores.\nMake-Ahead and Storage\nThe chocolate squares can be refrigerated in an airtight container for up to 1 week.\nThe chocolate squares can be tightly wrapped and frozen for up to 1 month. Let sit in refrigerator overnight to thaw.\nDesserts\nThe Latest\nRecipes\nChocolate\nNo-Cook Desserts"
}