{
  "url": "https://www.seriouseats.com/no-bake-cheesecake-with-freeze-dried-fruit",
  "image_url": null,
  "tags": [
    "Cakes",
    "No-Cook Desserts",
    "Strawberry",
    "Pies",
    "Easter Desserts"
  ],
  "title": "No-Bake Cheesecake With Freeze-Dried Fruit Recipe",
  "full_text": "No-Bake Cheesecake With Freeze-Dried Fruit Recipe\nJump to recipe\nPrep\n10 mins\nActive\n20 mins\nChilling Time\n6 hrs\nTotal\n6 hrs 10 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n8 3/4\nounces\ngraham cracker\nor\nBiscoff crumbs\n, store bought or\nhomemade\n(about\n2\ncups\n;\n250\ng\n)\n2 1/2\nounces\nunsalted butter\n, melted but cool (about\n5\ntablespoons\n;\n70\ng\n)\nKosher salt\nFor the Filling:\n5 1/4\nounces\nsugar\n(about\n3/4\ncup\n;\n150\ng\n)\n2 1/2\nounces\nfreeze-dried strawberries\n, such as Mother Earth or Karen’s Naturals; for other fruits, see note (about\n3\ncups\n;\n70\ng\n)\n16\nounces\nplain, full-fat cream cheese\n, such as Philadelphia (\ntwo\n8-ounce packages\n;\n455\ng\n), see note\n1 1/2\nounces\nfresh juice from 1 lemon\n(\n3\ntablespoons\n;\n45\ng\n)\n1/4\nteaspoon\nChinese five-spice powder\n; for spicing other fruits, see note\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for\ntable salt\n, use about half as much by volume\n14\nounces\nheavy cream\n(about\n1 3/4\ncups\n;\n395\ng\n)\nTo Serve:\n12\nounces\nfresh fruit\n(about\n2\ncups\n;\n340\ng\n), washed and dried\nDirections\nFor the Crust:\nCombine cookie crumbs and melted butter in a small bowl, then stir in a pinch of salt to taste. Sprinkle into a 9-inch tart pan or pie plate, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup; this will naturally push the crumbs up the sides of the pan. Keep pressing until the crumbs are in a compact, even layer across the bottom and sides of the pan. Refrigerate until needed (wrapped in plastic, this can be done a day or two in advance).\nSerious Eats / Vicky Wasik\nFor the Filling:\nIn the bowl of a food processor, grind sugar and freeze-dried fruit until powdery and fine, about 1 minute. Combine the cream cheese, strawberry-sugar, lemon juice, five-spice powder, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix at low speed to form a thick paste, then increase to medium speed and beat until soft and smooth. Scrape the bowl and beater with a flexible spatula, then switch to the whisk attachment. Add the cream, mix on low speed to combine, then increase to high and whip until the mixture can hold stiff peaks, 3 to 5 minutes depending on the horsepower of the mixer.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nScrape into the prepared crust and spread into an even layer, using the back of a spoon to sculpt the filling into swoops and swirls. Cover with plastic and refrigerate until the filling is firm and cold, about 6 hours, or to an internal temperature of 40°F (4°C).\nSerious Eats / Vicky Wasik\nTo Serve:\nTop with fresh fruit and cut into wedges with a hot chef’s knife (rinse it under hot running water between each slice). Carefully slide a pie server under the crust, making sure it reaches all the way to the tip of the wedge (the first slice will the most difficult and messy to remove). Wrapped in plastic, leftovers can be refrigerated keep up to one week.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n,\nstand mixer\n,\nflexible spatula\n, 9-inch\npie plate\nNotes\nThis recipe works well with an equal weight of any freeze-dried fruit, but their volume will vary by type, and some fruits (such as raspberry) will benefit from sifting before use. For\nblueberry cheesecake\n, replace the five-spice powder with an equal amount of coriander. For\ncherry cheesecake\n, replace the five-spice powder with an equal amount of almond extract. For\nmango cheesecake\n, replace the five-spice powder with 1/8 teaspoon cardamom. For\nbanana cheesecake\n, replace the five-spice powder with 1/8 teaspoon ground cloves. For\ncranberry cheesecake\n, replace the five-spice powder with 1/8 teaspoon ground cloves and 1/8 teaspoon ground cinnamon, and use an equal amount of orange juice in place of lemon. With any version, an equal weight of Oreo wafers, gingersnaps, or other cookies can be used in place of the grahams.\nDue to variations in formula, not all brands of cream cheese perform equally well in this recipe. For best results, use Philadelphia cream cheese.\nRead More\nNo-Bake Greek Yogurt Cheesecake\nCaramelized Orange Cheesecake\nFruity No-Churn Ice Cream\nCakes\nNo-Cook Desserts\nStrawberry\nPies\nEaster Desserts"
}