{
  "url": "https://www.seriouseats.com/no-bake-mango-icebox-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/w_O1Os_HJjF7dAp384KYWor7bHg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120508-127677-LTE-Mango-Icebox-PRIMARY-1c83f82d0a694d2daf286b40076d1141.jpg",
  "tags": [
    "Cakes",
    "Icebox Cake",
    "Mango"
  ],
  "title": "Mango Icebox Cake Recipe",
  "full_text": "Mango Icebox Cake Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n10 mins\nActive\n60 mins\nCooling and Chilling Time\n4 hrs 10 mins\nTotal\n5 hrs\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n1\n(.25-ounce) package\nunflavored\ngelatin\n1 1/2\nteaspoons\nground\ncardamom\n1/2\ncup\nwater\n3\nmedium\n-sized, ripe but firm\nmangos\n, peeled and cut into 1/4-inch dice\n1\nteaspoon\nlime juice\n1 1/4\ncups\n(about\n8 3/4\nounces\n)\ngranulated sugar\n2\ntablespoons\nlight corn syrup\n4\nlarge\negg whites\n, at room temperature\n3/4\nteaspoon\nsalt\n1\nvanilla bean\n, seeds scraped out\n1 1/2\ncups\n(about\n12\nounces\n)\nmascarpone cheese\n1/2\ncup\nsweetened condensed milk\n44\nsavoiardi Italian\nladyfingers\nfrom\n2\n(\n7-ounce) packages\n(see note)\nFor the Topping:\n2\nmedium\n-sized, ripe but firm\nmangos\n2\nteaspoons\nlime juice\nDirections\nFor the Cake:\nCombine gelatin, cardamom, and 1/4 cup water in small bowl and allow to soften, about 5 minutes. Microwave 45 seconds and allow to cool to room temperature, 5 to 7 minutes.\nMeanwhile, pulse 1 cup diced mango, 1/4 cup sugar, and lime juice in food processor until completely puréed. Reserve.\nStir remaining 1 cup sugar, remaining 1/4 cup water, and corn syrup in heavy-bottomed medium saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 238°F on candy thermometer, about 5 minutes.\nWhile syrup boils, with electric mixer fitted with whisk attachment, whip egg whites, vanilla bean seeds, and salt with whisk attachment on medium speed until soft peaks form, about 2 minutes.\nWhen syrup reaches temperature, with mixer running on medium-high speed, slowly and carefully pour into egg whites. Beat until outside of bowl is cool to the touch and whites are thick and glossy, about 7 minutes. Add gelatin mixture and beat just to combine.\nWhisk mascarpone, sweetened condensed milk, and pureed mango mixture together in large bowl. Mix in 1/3 of meringue. With rubber spatula, fold in remaining meringue. Fold in remaining 2 cups mango.\nTo Assemble:\nLine bottom of 9-inch springform pan with parchment paper round. Reserve 24 of the best looking ladyfingers and, with serrated knife, gently cut each into 3 1/4 inches long. Break remaining 20 cookies into 1/2-inch pieces.\nCover bottom of pan with half of the cookie pieces. Scrape half the mango mixture (about 4 1/2 cups) into pan over cookies. With rubber spatula, spread out over cookies, leaving a 1-inch gap between mixture and edge of pan. Tuck the 24 whole ladyfingers into the gap vertically; this will help keep them standing up straight. Once finished, spread the mango filling all the way to touch the cookies.\nTop filling with remaining half of cookie pieces, pressing gently in with fingertips. Spread remaining half of mango mixture over cookies, smoothing top.\nPeel mangos and discard skin. Peel mango flesh into thin strips and place in bowl. Toss with lime juice, then, wrap strips into flower-like rolls and arrange on top of cake.\nCover loosely with plastic wrap and refrigerate until set, at least 4 hours.\nRelease cake from springform mold and, leaving it on parchment round, gently slide onto a serving plate or cake stand. Slice and serve chilled.\nSpecial equipment\nmicrowave, food processor, heavy-bottomed medium saucepan, electric mixer, candy thermometer, rubber spatula, 9-inch round springform pan, parchment paper, serrated knife, ruler, vegetable peeler, plastic wrap\nThis Recipe Appears In\nLet Them Eat: Mango Icebox Cake\nCakes\nIcebox Cake\nMango",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/mango-icebox-cake-recipe.webp?"
}