{
  "url": "https://www.seriouseats.com/no-bake-cookie-chocolate-peanut-butter-oats-recipe",
  "image_url": null,
  "tags": [
    "Cookies",
    "No-Cook Desserts",
    "Chocolate",
    "Peanut Butter",
    "Oats"
  ],
  "title": "No-Bake Cookies With Chocolate, Peanut Butter, and Chewy Oats Recipe",
  "full_text": "No-Bake Cookies With Chocolate, Peanut Butter, and Chewy Oats Recipe\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n15 mins\nCooling Time\n25 mins\nTotal\n50 mins\nServes\n15 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n7\nounces\nplain\nor\nlightly toasted\nsugar\n(about\n1\ncup\n;\n200\ng\n)\n6\nounces\nmilk\n(about\n3/4\ncup\n;\n170\ng\n); any percentage will do\n1/2\nounce\nDutched cocoa powder\n(about\n2\ntablespoons\n;\n15\ng\n), such as Cacao Barry Extra Brute\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n; for\ntable salt\n, use about half as much by volume or use the same weight\n1\nounce\ndark chocolate\n, about 72% (about\n2\ntablespoons\n;\n30\ng\n), melted\n4\nounces\ncreamy peanut butter\n(shy\n1/2\ncup\n;\n110\ng\n); commercial styles work best\n1\nteaspoon\nvanilla extract\n2\nounces\ninstant oatmeal\n(shy\n2/3\ncup\n;\n55\ng\n); see notes\n1\nounce\nold-fashioned rolled oats\n(heaping\n1/4\ncup\n); see notes\nDirections\nWhisk sugar, milk, cocoa, and salt together in a 3-quart stainless steel saucier. Bring to a boil over medium heat (this should take about 5 minutes), then clip-on a digital thermometer and continue cooking until mixture is bubbly, thick, and exactly 230°F (110°C), about 6 minutes longer. For best results, avoid handheld thermometers, which may not perform well due to unsteady placement during long-term projects such as candy.\nSerious Eats / Vicky Wasik\nOff heat, whisk in melted chocolate, peanut butter, and vanilla extract. Using a flexible, heat-resistant spatula, fold in both types of oats. Stir just until mixture begins to thicken, then drop onto a parchment-lined half sheet pan, using a pair of metal spoons. Cool until cookies are firm and dry to the touch, about 25 minutes, and transfer to an airtight container. Store about 2 weeks at room temperature or up to 1 month in the fridge.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel saucier\n,\nwhisk\n,\nclip-on digital thermometer\n,\nheat-safe flexible spatula\n,\nhalf sheet pan\nNotes\nI love these cookies best with a blend of instant and old-fashioned oats, but it's fine to use just one or the other. Instant oats will produce a more homogeneous, cookie-like texture, while rolled oats will give them a heartier chew. You'll still be using a total of 3 ounces (85g) either way, but the volume will differ. For instant oats, use about 3/4 cup; for old-fashioned rolled oats (not thick-cut), use about 1 cup.\nRead More\nNo-Bake Super-Chewy Chocolate Chip Peanut Butter Oat Bars\nNo-Bake Crispy Corn Flake Chocolate Peanut Butter Bars\nCookies\nNo-Cook Desserts\nChocolate\nPeanut Butter\nOats"
}