{
  "url": "https://www.seriouseats.com/no-bake-cheesecake-recipe",
  "image_url": null,
  "tags": [
    "Cheesecakes",
    "No-Cook Desserts"
  ],
  "title": "Easy No-Bake Cheesecake Recipe",
  "full_text": "Easy No-Bake Cheesecake Recipe\nJump to recipe\nPrep\n20 mins\nActive\n15 mins\nChilling Time\n6 hrs\nTotal\n6 hrs 20 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n8 3/4\nounces\ngraham cracker\nor\nBiscoff crumbs\n(see note), store-bought or\nhomemade\n(about\n2\ncups\n;\n250\ng\n)\n2 1/2\nounces\nunsalted butter\n, melted (about\n5\ntablespoons\n;\n70\ng\n)\nKosher salt\n, to taste\nFor the Filling:\n16\nounces\nplain, full-fat\ncream cheese\n, (\n2\n(8-ounce) packages\n;\n455\ng\n) (preferably Philadelphia brand; see note)\n5 1/4\nounces\nsugar\n(about\n3/4\ncup\n;\n150\ng\n)\n3/4\nounce\nfresh juice\nfrom\n1\nlemon\n(about\n4 1/2\nteaspoons\n;\n20\ng\n)\n1/4\nteaspoon\nvanilla extract\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n12\nounces\nheavy cream\n(about\n1 1/2\ncups\n;\n340\ng\n)\nTo Serve:\n12\nounces\nfresh fruit\n(about\n2\ncups\n;\n340\ng\n), washed and dried\nDirections\nFor the Crust:\nCombine cookie crumbs and melted butter in a small bowl, then stir in a pinch of salt to taste. Sprinkle into a 9-inch tart pan or pie plate, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup; this will naturally push the crumbs up the sides of the pan. Keep pressing until the crumbs are in a compact, even layer across the bottom and sides of the pan. Refrigerate until needed. (The crust can be made and held for a day or two if wrapped in plastic.)\nFor the Filling:\nCombine cream cheese, sugar, lemon juice, vanilla, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix at low speed to form a thick paste, then increase to medium speed until soft and smooth.\nScrape bowl and beater with a flexible spatula, then switch to the whisk attachment and pour in cream. Mix at low speed to combine, then increase to high and whip until the mixture can hold stiff peaks, 3 to 5 minutes depending on the horsepower of your mixer.\nScrape filling into prepared crust and spread into an even layer, using the back of a spoon to sculpt filling into swoops and swirls. Cover with plastic and refrigerate until the filling is firm and cold, about 6 hours or to an internal temperature of 40°F (4°C).\nTo Serve:\nTop with fresh fruit and cut into wedges with a hot\nchef’s knife\n, rinsing the knife under hot running water between slices. Carefully slide a pie server under the crust, making sure it reaches all the way to the tip of the wedge (the first slice will be the most difficult and messy to remove).\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n, 9-inch\npie plate\nor tart pan\nNotes\nThis recipe works great with your favorite graham cracker, but after much experimenting, I've found that the stronger spices and deep caramel flavor of Biscoff cookies taste even better in a no-bake crust. You can pick up a package of Biscoff at the store, or\nmake your own\nif you don't mind firing up the oven.\nDue to variations in formulae, not all brands of cream cheese perform equally well in this recipe. For best results, use Philadelphia cream cheese.\nMake-Ahead and Storage\nTo make this cheesecake partially ahead of time, assemble the crust up to a couple of days in advance, wrap tightly in plastic, and refrigerate until it's needed. Once filled, the cheesecake is best served within 36 hours, but can be tightly wrapped and refrigerated for up to a week.\nRead More\nNo-Bake Cheesecake With Freeze-Dried Fruit\nNo-Bake Chocolate Cheesecake\nNo-Bake Greek Yogurt Cheesecake\nNo-Bake Chocolate-Nutella \"Cheesecake\" Verrines\nCheesecakes\nNo-Cook Desserts"
}