{
  "url": "https://www.seriouseats.com/no-churn-chocolate-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5xYw_aZdoESCyubye95EMGREdoM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190430-chocolate-no-churn-ice-cream-vicky-wasik-15-8d5646b8593341ad86e9a6dafd7ba690.jpg",
  "tags": [
    "Ice Cream",
    "Chocolate"
  ],
  "title": "No-Churn Chocolate Ice Cream Recipe",
  "full_text": "No-Churn Chocolate Ice Cream Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n10 mins\nActive\n30 mins\nFreeze\n6 hrs\nTotal\n6 hrs 30 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n7\nounces\nheavy cream\n(about\n3/4\ncup\nplus\n2\ntablespoons\n;\n200\ng\n)\n1\nounce\nbest-quality\nDutch or natural cocoa powder\n, not low-fat (about\n1/3\ncup\n, spooned;\n28\ng\n); see notes\n1\nounce\ncomplementary spirits or liqueur, such as\ncrème de cacao\n,\ndark rum\n, or\nKahlúa\n(about\n2\ntablespoons\n;\n38\ng\n)\n1/4\nounce\nvanilla extract\n(about\n1 1/2\nteaspoons\n;\n7\ng\n)\n1 1/4\nteaspoons\ninstant espresso powder\n3\nlarge\neggs\n(about\n5 1/2\nounces\n;\n155\ng\n)\n4\nounces\nlight\nor\ndark brown sugar\n(about\n1/2\ncup\n;\n115\ng\n)\n1/4\nteaspoon\n(\n1\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use about half as much by volume or the same weight\nDirections\nIn the bowl of a stand mixer fitted with a whisk attachment, whip cream, cocoa powder, crème de cacao (or other booze), vanilla extract, and espresso powder until the mixture is thick enough to hold stiff peaks. The time required for this step will vary depending on the power of a given mixer, so keep a close eye on the process. Transfer to a large nonreactive container, such as a 2-quart baking dish, then cover and refrigerate until step 2 is complete. (This container will later be used to hold the ice cream.) Rinse the bowl and whisk, then wipe dry.\nFill a large pot with a few inches of water. Bring to a boil, then lower heat to maintain a simmer for a steady supply of steam. Crumple a long strip of foil into a thick ring and place ring into the water; this will act as a \"booster seat\" later in the process to keep the bowl from touching the water or the pot directly.\nPlace eggs, brown sugar, and salt in the stand mixer bowl and stir with a flexible spatula to combine. Set bowl onto the foil ring, so that it touches neither the water nor the pot, and cook, stirring and scraping constantly, until the egg mixture has warmed to 160°F (71°C), about 5 minutes. This step should not take significantly longer than 5 minutes; major delays simply indicate insufficient heat/lack of steam, so adjust the heat accordingly.\nTransfer bowl to a stand mixer fitted with a whisk attachment and whip on high speed until the mixture is foamy, more than quadrupled in size, and thick enough to briefly mound up like soft-serve ice cream when dropped from the whisk, roughly 5 to 8 minutes depending on the horsepower of the mixer.\nFold the prepared cocoa/whipped cream into the egg mixture in stages, working gently to incorporate it as thoroughly as possible without deflating or over-mixing the base. Scrape into the now-chilled container, cover tightly with plastic wrap pressed directly against the surface of the ice cream, and freeze until firm enough to scoop. The time required for this will vary depending on the size and material of the container, as well as your freezer setting, but expect this to take 6 to 8 hours.\nTo serve, warm a spoon or\nice cream scoop\nin a glass of hot water and shake dry before use. Scoop the ice cream, rinsing and rewarming the spoon as needed. Well wrapped in plastic to protect it from odor absorption, the ice cream will keep for up to 1 month in the freezer.\nSpecial equipment\nStand mixer\n,\ndigital thermometer\nNotes\nThe flavor of this ice cream hinges on cocoa powder, so it's important to use rich, flavorful brands made with at least 20% cocoa butter. Those commonly found in supermarkets tend to be both low-fat and high-starch, producing an ice cream that's lean, bland, and starchy. See our guides to the best Dutch cocoas for dessert and the best natural cocoa powders for more information on what to look for when shopping, as well as our favorite brands.\nMake-Ahead and Storage\nWell wrapped in plastic, or in an airtight container, the ice cream will keep for about 1 month in the freezer.\nThis Recipe Appears In\nHow to Make Creamy Chocolate Ice Cream Without an Ice Cream Machine\nIce Cream\nChocolate",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/no-churn-chocolate-ice-cream-recipe.webp?"
}