{
  "url": "https://www.seriouseats.com/no-churn-fruit-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ab_Q2EQjcts89_OSphZXj6wdwpE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190523-no-churn-blueberry-ice-cream-vicky-wasik-12-e3b2056ccd0c49509c5bc97054579821.jpg",
  "tags": [
    "Gluten-free Desserts",
    "Stovetop",
    "Egg Whites",
    "Fruit",
    "Blueberry"
  ],
  "title": "Fruity No-Churn Ice Cream Recipe",
  "full_text": "Fruity No-Churn Ice Cream Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n30 mins\nFreezing Time\n7 hrs\nTotal\n7 hrs 35 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n5\nounces\negg white\n(about\n2/3\ncup\n;\n140\ng\n)\n5 3/4\nounces\nsugar\n(about\n3/4\ncup\n;\n165\ng\n)\nHeaping\n1/4\nteaspoon\n(\n1.5\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; for\ntable salt\n, use about half as much by volume or the same weight\nShy\n1/2\nteaspoon\n(\n2\ng\n)\ncream of tartar\n, or\n3/8\nounce\nlemon juice\n(\n1\nshy\ntablespoon\n;\n11\ng\n)\n12\nounces\nheavy cream\n(about\n1 1/2\ncups\n;\n340\ng\n)\nUp to\n2 1/4\nounces\nfreeze-dried blueberries\n, ground to a fine powder (\n60\ng\n; volume will vary by brand and type); for other fruits, see note\n1/8\nteaspoon\ncoriander\n, plus more to taste; for pairing suggestions for other fruits, see note\n1/2\nounce\ncomplementary spirit\n, such as\nSmith & Cross Jamaica Rum\nor\nlimoncello\n(about\n1\ntablespoon\n;\n15\ng\n); for pairing suggestions for other fruits, see note\nDirections\nFill large pot with a few inches of water. Bring to a boil, then lower heat to maintain simmer for steady supply of steam. Crumple long strip of foil into a thick ring and place ring into the water; this will act as \"booster seat\" later in the process to keep the bowl from touching the water or the pot directly.\nCombine egg whites, sugar, salt, and cream of tartar or lemon juice in bowl of stand mixer. Place stand mixer bowl over water bath so it sits on foil ring; bowl should not touch the water or bottom or sides of the pot. Cook, stirring and scraping continuously with flexible spatula, until egg white mixture reaches 165°F (74°C). This should take no more than 5 minutes in stainless steel stand mixer bowl; if it takes substantially longer, this simply means heat is too low. If mixture cooks too fast, or scrambles despite constant stirring, this indicates that water has come to a boil or that water or pot is able to touch bowl.\nWhen mixture reaches 165°F (74°C), transfer bowl to stand mixer fitted with whisk attachment and whip at high speed until meringue is glossy, stiff, and thick, about 5 minutes, although the time this takes will vary depending on the power of a given stand mixer.\nOnce meringue is thick and stiff, whip heavy cream, freeze-dried blueberries, coriander, and rum or limoncello (or other fruit/spice/spirit combo) until mixture is thick and stiff as well. This can be done by hand in a separate bowl, or on stand mixer in the original stand mixer bowl if meringue is transferred to another container (no need to wash the bowl or whisk attachment between uses). For the purposes of making ice cream, this step cannot be done in a food processor or blender, which will not provide adequate aeration.\nUsing an open\nballoon whisk\nor flexible spatula, gently combine whipped cream and meringue, working carefully but thoroughly to ensure mixture is well combined but not deflated. Taste and season with additional salt and/or spice as needed.\nScrape ice cream into large nonreactive container, such as a 2-quart baking dish, and cover with layer of plastic wrap pressed directly against surface of ice cream. To protect ice cream from freezer odors, cover again with sheet of foil, or lid if container has one. Freeze until firm enough to scoop. The freezing time required will vary depending on size and material of container, but expect this to take between 6 and 8 hours. Once ice cream is cold, scoop and serve in chilled dishes.\nSpecial Equipment\nStand mixer\n,\ndigital thermometer\n, 8-inch square cake pan, offset spatula, flexible spatula, aluminum foil (optional)\nNotes\nThis recipe will work equally well with other types of freeze-dried fruit, although some may require sifting to remove pesky seeds.\nMost supermarkets will carry the basics (strawberry, banana, blueberry, et cetera), but shop online and you'll find everything from tangerine to black raspberry, and even dragon fruit.\nIf you're using another fruit, the type of spice and spirit or liqueur may need to be adjusted. For example, strawberry pairs well with Chinese five-spice powder and St-Germain, mango works well with cardamom and tequila, and banana is intensified by ground cloves and dark rum. Some fruits need no spice but can benefit from other aromatic pairings, such as amaretto with cherry or vanilla with tangerine. Let your own intuition and cravings be your guide, or consult a book like\nThe Flavor Thesaurus\nfor more ideas on flavor pairings.\nMake-Ahead and Storage\nWith a layer of plastic wrap pressed directly against the surface of the ice cream, plus a secondary lid or layer of foil, the ice cream will keep up to 3 weeks in the freezer.\nRead More\nUse Freeze-Dried Fruit for the Most Vibrant, Flavorful No-Churn Ice Cream\nNo-Churn Vanilla Ice Cream\nNo-Churn Mascarpone Ice Cream\nNo-Churn Chocolate Ice Cream\nGluten-free Desserts\nStovetop\nEgg Whites\nFruit\nBlueberry",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fruity-no-churn-ice-cream-recipe.webp?"
}