{
  "url": "https://www.seriouseats.com/no-churn-vanilla-ice-cream-pie",
  "image_url": "https://www.seriouseats.com/thmb/8VeBdyAR_nO7GQ9AuNYj265Opp8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190501-ice-cream-pie-vicky-wasik-18-5d40f3cf10194b95a89ba42743f1d4e9.jpg",
  "tags": [
    "Gluten-free Desserts",
    "Stovetop",
    "Egg Whites",
    "Heavy Cream",
    "Ice Cream"
  ],
  "title": "No-Churn Vanilla Ice Cream Pie",
  "full_text": "No-Churn Vanilla Ice Cream Pie\nClose\nJump to recipe\nCook\n30 mins\nActive\nAbout 35 mins\nCooling Time\n8 hrs\nTotal\n8 hrs 30 mins\nServes\n8\nto 10 servings\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n7\nounces\ncookie crumbs\n, homemade or store-bought, traditional or gluten-free, see note (about\n1 2/3\ncup\n;\n195\ng\n)\n4\nounces\nunsalted butter\n, melted (about\n1/2\ncup\n;\n113\ng\n)\nPinch\nsalt\nFor the Filling:\n6\nounces\negg whites\n(from about\n6\nlarge\neggs\n;\n170\ng\n)\n8\nounces\nplain or\nlightly toasted\nsugar\n(about\n1\ncup\nplus\n2\ntablespoons\n;\n225\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight, or more to taste\n1/2\nounce\nlemon juice\n(about\n1\ntablespoon\n;\n15\ng\n), or\n1/2\nteaspoon\ncream of tartar\n16\nounces\nheavy cream\n(about\n2\ncups\n;\n455\ng\n)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n), or other extracts to taste\nRainbow\nor\nchocolate sprinkles\n, to taste\nDirections\nFor the Crust:\nCombine the cookie crumbs with melted butter and a pinch of salt in a medium bowl, folding with a flexible spatula until the crumbs are fully moistened. Scrape into a 9-inch pie plate, then compress into an even layer with a flat-bottomed drinking glass or measuring cup, or by hand. Keep pressing until the crumbs are in a compact, even layer across the bottom and sides of the pan. Refrigerate until needed. (The crust can be made and held for a day or two if wrapped in plastic.)\nFor the Filling:\nFill a large pot with a few inches of water. Bring to a boil, then lower heat to maintain a simmer for a steady supply of steam. Crumple a long strip of foil into a thick ring and place ring into the water; this will act as a \"booster seat\" later in the process to keep the bowl from touching the water or the pot directly.\nCombine egg whites, sugar, salt, and lemon juice or cream of tartar in the bowl of a stand mixer. Place bowl over the water bath so it sits on the foil ring (the bowl should not touch the water or the bottom or sides of the pot). Cook, stirring and scraping continuously with a flexible spatula, until egg white mixture reaches 172°F (77°C). This should take about 8 to 10 minutes in a stainless steel stand mixer bowl; if it takes substantially longer, it simply means the heat is too low. If the mixture cooks too fast, or scrambles despite constant stirring, this indicates that the water has come to a boil, or that the water or pot is able to touch the bowl.\nWhen the mixture reaches 172°F, transfer bowl to a stand mixer fitted with a whisk attachment and whip at high speed until meringue is glossy, stiff, and thick, about 5 minutes, although the timing will vary depending on the power of a given stand mixer.\nOnce meringue is thick and stiff, whip the heavy cream and vanilla until thick and stiff, as well. This can be done by hand in a separate bowl, or in the original stand mixer bowl if the meringue is transferred to another container (no need to wash the bowl or whisk.)\nWith an open balloon whisk or flexible spatula, gently combine the whipped cream and meringue, working carefully but thoroughly to ensure the mixture is well combined, but not deflated. Taste and season with additional salt and/or extract as needed. If you like, gently fold in chocolate or rainbow sprinkles to taste (about 1/3 cup if using the long, skinny \"jimmy\" style), working briefly to avoid overmixing the \"ice cream.\"\nScrape the mixture into the prepared crust and form it into a mound with the spatula, sculpting swoops and swirls as desired. Wrap thoroughly but loosely in plastic, to avoid crushing the ice cream, and freeze 8 to 12 hours, or until a thermometer inserted into the ice cream registers 0°F (-18°C). Carefully wrapped to avoid odor absorption in the freezer, the pie can be held for up to one week.\nTo serve, garnish the pie with additional sprinkles and slice into wedges with a chef's knife, warmed in hot water, wiping the blade clean between each slice. Thanks to its exceptionally light and airy texture, the no-churn ice cream filling is slow to melt, so it holds up better than ice cream outside the freezer, making it less messy to serve than one might expect.\nNotes\nThis crust works well with almost any crunchy cookie crumbs, such as store-bought or\nhomemade Oreos\n(wafer only), store-bought or\nhomemade Biscoff\n, and store-bought or homemade graham crackers (there's a recipe in my cookbook,\nBraveTart: Iconic American Desserts\n). Gluten-free cookie styles will work here as well.\nSpecial Equipment\nStand mixer\n,\ndigital thermometer\n,\nflexible spatula\nMake-Ahead and Storage\nWrapped loosely but thoroughly in plastic, the prepared pie can be held in the freezer for up to one week.\nThis Recipe Appears In\nThis Fluffy No-Churn Ice Cream Pie Is the Perfect Summer Treat\nGluten-free Desserts\nStovetop\nEgg Whites\nHeavy Cream\nIce Cream"
}