{
  "url": "https://www.seriouseats.com/no-holds-barred-lasagna-bolognese-pasta-italian-homemade-ricotta",
  "image_url": "https://www.seriouseats.com/thmb/KaNjJSuVrEL6_y0iOhe_VsGmDwc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__lasanga-bolognese-f8c8a8171acc4b368d0ad8b8902df7fb.jpg",
  "tags": [
    "Baked Pasta",
    "Italian",
    "Tomato Sauces",
    "Pasta Mains",
    "Winter Mains"
  ],
  "title": "All-Day Meat Lasagna",
  "full_text": "All-Day Meat Lasagna\nClose\nJump to recipe\nPrep\n20 mins\nCook\n4 hrs 50 mins\nActive\n2 hrs\nTotal\n5 hrs 10 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Ragù Bolognese:\n2\ntablespoons\nextra-virgin olive oil\n4\ntablespoons\nbutter\n2/3\npound\nground lamb\n(or\n85/15 ground beef\n)\n2/3\npound\nground pork\n2/3\npound\nground veal\n4\nounces\nchicken livers\n, finely chopped (optional)\n1\nlarge\nonion\n, finely chopped (about\n1 1/2\ncups\n)\n2\nlarge\ncarrots\n, peeled, and cut into 1/4-inch dice (about\n1\ncup\n)\n3\nlarge\nribs celery\n, peeled, and cut into 1/4-inch dice (about\n1\ncup\n)\n4\ncloves\ngarlic\n, finely minced, or grated on a microplane grater\n1/2\ncup\nfresh\nsage leaves\n, finely chopped\nLarge pinch\nred pepper flakes\n(optional)\n1\n(28-ounce) can\ncrushed Italian plum tomatoes\n, preferably D.O.P. San Marzano\n1 1/2\ncups\ndry red wine\n(white works fine as well)\n1 1/2\ncups\nwhole milk\n2\ncups\nhomemade chicken\nor\nveal stock\n(or\n2\ncups\nlow-sodium canned chicken broth\n)\n2\nbay leaves\n1\ntablespoon\nVietnamese\nor\nThai fish sauce\n1/2\ncup\nheavy cream\nSalt\nand freshly\nground black pepper\n1/2\ncup\nminced basil\nor\nparsley\n(or a mix of both)\nFor the Ricotta Mixture:\n3\ncups\nwhole-milk ricotta\n(see note)\nSalt\nand freshly\nground black pepper\n2\nlarge\neggs\n1/4\ncup\nminced basil\nor\nparsley\n(or a mix of both)\nFor the Besciamella:\n2\ntablespoons\nbutter\n2\ntablespoons\nflour\n2\ncloves\ngarlic\n, finely minced, or grated on a microplane grater\n2\ncups\nwhole milk\n1/2\npound\nlow-moisture whole milk mozzarella cheese\n, grated\n1/4\nteaspoon\nfreshly grated\nnutmeg\nSalt\nand freshly\nground black pepper\nTo assemble:\nFifteen\n4- by 8-inch sheets\nfresh rolled pasta\n, or\n15\npieces\nno-boil lasagna noodles\nfrom\n1\npackage\n(see note)\n4\nounces\nparmesan\n, preferably\nParmigiano-Reggiano\n, grated on a microplane grater (about\n2\ncups\n)\n2\ntablespoons\nminced basil\nor\nparsley\n(or a mix of both)\nDirections\nFor the Ragù Bolognese\n: Heat butter and olive oil in large Dutch Oven over high heat, stirring occasionally, until butter has stopped foaming. Add lamb, pork, veal, and chicken livers, and cook, breaking up meat with wooden spoon, until no longer pink, 7-10 minutes. Remove from heat, transfer meat to strainer set in large bowl, allow to drain, then transfer drained liquid back to Dutch oven. Add onions, carrots, celery, garlic, sage, and red pepper flakes, and set over medium heat. Cook, stirring frequently, until vegetables are softened, but not browned, about 10 minutes.\nReturn meat to pan, add tomatoes, wine, milk, stock, and bay leaves, and bring to a simmer over high heat. Reduce heat to low, partially cover, and simmer 2 1/2 to 3 hours, stirring occasionally, until liquid is slightly below level of meat, about 2 quarts of sauce total (you may need to add excess stock while cooking if your burner is cooking it too hot). A layer of fat may form on top during cooking, but do not skim it off. After cooking, remove bay leaves, add fish sauce and heavy cream and simmer until fat is emulsified, about 5 minutes. Season to taste with salt and black pepper. Remove from heat and allow to cool at room temperature for 30 minutes. Stir in parsley and basil. Bolognese will keep for up to 1 week in fridge, and will improve with time. Reheat until warm before using in lasagna.\nWhile the ragù is simmering, make the ricotta mixture. Place ricotta in bowl of food processor or stand mixer fitted with whisk attachment and process/mix until smooth. Season to taste with salt and pepper. Add two eggs and minced herbs, and process/mix until incoroporated. Set aside at room temperature until ready to use.\nMake the Besciamella\n: Heat butter in medium saucepan over medium-high heat until foaming subsides, stirring occasionally, about 1 minute. Add flour and stir with whisk until light blond in color and slightly nutty aroma develops, about 1 minute. Add garlic, and stir to combine. Whisking constantly, add milk in steady stream until fully incorporated. Bring to a simmer (mixture should thicken). Remove heat, add cheese and nutmeg, and whisk until fully melted. Whisking constantly, return to a simmer, remove from heat, and season to taste with salt and pepper. Set aside until ready to use.\nAdjust oven racks to lower middle and lowest positions and preheat oven to 375°F (190°C). If using no-boil lasagna noodles, place them in 13- by 9-inch baking dish and cover with hot tap water (or boiled water) and allow to soak for 10 minutes, changing water once during soaking time. Drain in single layer on clean kitchen towels, or paper towels. Cover with second kitchen towel or paper towels and pat dry.\nTo Assemble:\nAdd 1/6th of meat ragù (about 1 1/3 cups) to the bottom of baking dish and drizzle with 1/2 cup besciamella. Place 3 sheets of fresh rolled pasta or 3 no-boil noodles on top of sauce (noodles will not quite touch each other; this is okay). Top with 1/6 of meat sauce, 1/2 cup besciamella, 1/3 cup parmesan, and another layer of pasta. Spread 1/2 of ricotta mixture on top of pasta with rubber spatula, top with 1/6 of meat sauce, 1/3 cup parmesan, and a third layer of pasta. Top with 1/6 of meat sauce, 1/2 cup besciamella, 1/3 cup parmesan, and a forth layer of pasta. Spread remaining 1/2 of ricotta mixture on top of noodles with rubber spatula, top with 1/6 of meat sauce, 1/3 cup parmesan, and the fifth and final layer of pasta. Cover with remaining 1/6 of meat sauce, remaining besciamella (about 1 cup), and remaining 2/3 cup parmesan. Baking dish should be very full at this point.\nPlace foil-lined rimmed baking sheet on lower rack to catch drips, then place lasagna on upper rack and bake until edges are starting to crisp, and top is a bubbly, golden brown, about 45 minutes, rotating halfway through baking. Remove from oven and allow to cool at room temperature for 10 minutes. Sprinkle with herbs, and serve.\nSpecial Equipment\nDutch oven\n,\n13- by 9-inch baking dish\nNotes\nWe recommend\nmaking a triple batch of our 30-minute fresh ricotta recipe\nto perfect this no-holds-barred lasagna. If making ricotta from scratch is not practical, we recommend\npurchasing a high-quality ricotta\nwith no gums or stabilizers that lists only milk, salt, and either an acid or a starter culture on the label. Our favorite nationally available store brand is Calabro. If you cannot source good ricotta either, we suggest using store-bought whole milk cottage cheese in its place.\nThis recipe can also be adapted to make filled cannelloni. First, boil dry cannelloni noodles per their instructions. Once cool enough to handle, fill them with the ricotta mixture. Alternatively, you can simply soak no-boil lasagna noodles in 4 or 5 changes of really hot water until they soften up and\nroll them up around the ricotta mixture\n. Smother the filled cannelloni with ragù, then the besciamella, top with more mozzarella, and dust with parmesan. Bake at 350°F (175°C) until bubbly, and you're done.\nRead More\nThe Best Slow-Cooked Bolognese Sauce\nPressure Cooker Ragù Bolognese\nLasagna Napoletana (Lasagna With Sausage, Smoked Cheese, and Meatballs)\nUltra-Creamy Spinach and Mushroom Lasagna\nBaked Pasta\nItalian\nTomato Sauces\nPasta Mains\nWinter Mains"
}