{
  "url": "https://www.seriouseats.com/no-knead-carrot-focaccia-recipe-11728498",
  "image_url": "https://www.seriouseats.com/thmb/VQoX359bDGKb-4uTX3pOHyc6cUs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250505-SEA-NoKneadCarrotFocaccia-JenCausey-hero-5d0937e529e4411ab4dee12ec39c9655.jpg",
  "tags": [
    "Bread",
    "The Latest",
    "Recipes"
  ],
  "title": "This Crispy, Spicy Focaccia Is Wildly Delicious",
  "full_text": "This Crispy, Spicy Focaccia Is Wildly Delicious\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nProofing and Cooling Time:\n12 hrs 15 mins\nTotal\n13 hrs\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n500\ng\nbread flour\n(\n17 1/2\nounces\n; about\n3 1/2\ncups\n)\n7\ng\nDiamond Crystal kosher salt\n(\n1/4\nounce\n;\n2 1/2\nteaspoons\n); for table salt, use half the amount by volume\n7\ng\n(\n1/4\nounce\n)\ninstant yeast\n420\ng\n(\n1 3/4\ncups\n) lukewarm pure, unsweetened\ncarrot juice\n(100°F to 105°F), (see notes)\n74\ng\n(\n1/4\ncup\n)\ngochujang\n90\nml\n(\n6\ntablespoons\n)\nextra-virgin olive oil\n, divided\n64\ng\nthinly sliced\nscallions\n(\n2 1/4\nounces\n; about\n4\nscallions\n)\nFor the Toppings:\n4\nounces\n(\n113\ng\n)\ncarrots\n, peeled and trimmed\n1\nteaspoon\nplus\n1/4\ncup\nolive oil\n(\n5\nml\nplus\n60\nml\n), divided\n1\nteaspoon\n(\n6\ng\n)\nDiamond Crystal kosher salt\n, divided; for table salt use half as much by volume\n1\nteaspoon\ngrated\nfresh ginger\n, from\n1\n(1-inch) peeled\npiece\n2\ntablespoons\nthinly sliced\nscallions\n(from\n1\nscallion\n), plus more for garnish\n3\nmedium\ngarlic cloves\n, minced\n1\ntablespoon\n(\n15\nml\n)\ntoasted sesame oil\nDirections\nFor the Dough:\nIn a large bowl, whisk together flour, salt, and yeast until well combined. Add carrot juice, gochujang, and 1 tablespoon oil; stir until well combined and no dry pockets of flour remain. Cover bowl tightly with plastic wrap and refrigerate until puffed, bubbly, and doubled in size, at least 10 hours or up to 24 hours. Uncover and, using greased hands, fold scallion slices into dough until evenly distributed. Set aside.\nSerious Eats / Jen Causey\nGenerously oil bottom and sides of a 9- by 13-inch metal baking pan with 3 tablespoons oil. Using greased hands, shape dough into a rough ball and place seam-side down in prepared pan. Loosely cover pan with plastic wrap or kitchen towel and let stand at room temperature for 30 minutes. Uncover and gently stretch and press dough to mostly fill pan using greased hands. Loosely cover again and let stand until dough is very soft, puffed, jiggly, and bubbly, 2 to 3 hours.\nSerious Eats / Jen Causey\nFor the Toppings:\nMeanwhile, using a Y-peeler, peel carrots lengthwise into about 1 cup of thin ribbons. Reserve any extra carrot for another use. In a medium microwave-safe bowl, toss carrot ribbons, 1 teaspoon oil, and 1/2 teaspoon salt together. Cover and microwave on high until slightly softened, 1 minute. Carefully uncover and set aside to cool.\nSerious Eats / Jen Causey\nIn a small saucepan, heat remaining 1/4 cup oil until hot and shimmering, 3 to 4 minutes. Carefully stir in ginger and cook, stirring constantly for 15 seconds. (Ginger may cause oil to pop slightly when initially stirred in.) Add scallion and garlic and cook, stirring constantly for 20 seconds. Pour oil mixture into a small heatproof bowl; stir in sesame oil and remaining 1/2 teaspoon salt. Set aside, uncovered, until ready to use.\nOne hour before baking, adjust oven rack to lower-middle position and place baking stone or steel on it. Preheat oven to 450°F (230°C). Drizzle dough with remaining 2 tablespoons oil. Using your fingertips, gently press and stretch dough to evenly fill all corners of the pan. Lift up one edge of the dough to let air bubbles underneath escape and repeat, moving around the dough until there are no large air bubbles left underneath and the dough is evenly spread around the pan. Arrange carrots in coils and ribbons over top of dough, overlapping as needed. Dimple focaccia in about 1- to 1 1/2-inch increments, pressing carrots into dough deeply.\nSerious Eats / Jen Causey\nBake, positioning pan on top of baking stone, until focaccia is puffed, golden brown on both top and bottom and crisp when you lift it with a thin spatula, about 25 minutes. Let cool in pan for 5 minutes. Using a thin metal spatula, remove bread from pan and transfer to a wire rack set in a rimmed baking sheet. Generously brush top and sides of bread with prepared scallion oil. Let sit to cool at least 15 minutes before cutting and serving. Serve warm or at room temperature and garnish with more scallions, if desired.\nSerious Eats / Jen Causey\nSpecial Equipment\n9- x 13-inch metal baking pan, Y-shaped vegetable peeler, small saucepan, pastry brush, baking stone or steel\nNotes\nYou can use store-bought bottled carrot juice or fresh carrot juice for this recipe. If using store-bought make sure to purchase an unsweetened variety.\nMake-Ahead and Storage\nFocaccia is best enjoyed while still warm, but leftover focaccia can be stored in a paper bag at room temperature for up to 2 days. Reheat in a 300°F (150°C) oven for about 10 minutes before serving.\nBread\nThe Latest\nRecipes"
}