{
  "url": "https://www.seriouseats.com/no-waste-tacos-de-carnitas-with-salsa-verde-recipe",
  "image_url": null,
  "tags": [
    "Tacos",
    "Mexican",
    "Braised & Stewed Pork",
    "Pork Shoulder",
    "Pork Mains"
  ],
  "title": "No-Waste Tacos de Carnitas With Salsa Verde",
  "full_text": "No-Waste Tacos de Carnitas With Salsa Verde\nJump to recipe\nPrep\n25 mins\nCook\n4 hrs\nActive\n45 mins\nDraining Time\n10 mins\nTotal\n4 hrs 35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\nonions\n, divided\n1/2\ncup\n(\n8\ng\n) chopped\nfresh cilantro leaves\nand tender stems\n3\npounds\nboneless\npork shoulder\n, cut into 2-inch cubes\n1\ntablespoon\n(\n8\ng\n)\nkosher salt\n, plus more to taste; for table salt, use half of the volume or an equal amount by weight\n1\nmedium\norange\n6\ncloves\ngarlic\n, halved, divided\n2\nbay leaves\n1\ncinnamon stick\n, broken into three or four pieces\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n6\nmedium\ntomatillos\n(about\n1 1/2\npounds\n,\n0.7\nkg\n), husks removed and halved\n2\njalapeño peppers\n, stem removed and halved lengthwise\n24\ncorn tortillas\n1\ncup\n(\n150\ng\n) crumbled\nqueso fresco\n3\nlimes\n, cut into wedges\nDirections\nAdjust oven rack to middle position and preheat oven to 275°F (135°C). Cut one onion into fine dice and combine with cilantro. Refrigerate until needed. Split remaining onion into quarters. Set aside. Season pork with 1 tablespoon salt and place in a 9- by 13-inch glass baking dish. The pork should fill the dish with no extra space. Split orange into quarters and squeeze juice over pork. Nestle squeezed orange pieces into dish. Add 2 onion quarters, 4 cloves garlic, bay leaves, and cinnamon stick to dish. Nestle everything into an even layer. Pour vegetable oil over surface. Cover dish tightly with aluminum foil and place in oven. Cook until pork is fork tender, about 3 1/2 hours.\nSerious Eats / Mariel De La Cruz\nSet large fine-mesh strainer over a 1-quart liquid measuring cup or bowl. Using tongs, remove and discard orange peel, onion, garlic, cinnamon stick, and bay leaves. Transfer pork, rendered fat, and cooking liquid to strainer. Let drain for 10 minutes. Transfer pork back to baking dish. You should end up with about 1/2 cup cooking liquid and 1/2 cup fat. Using a flat spoon or fat separator, skim fat from surface and add back to pork. Shred pork into large chunks with fingers or two forks. Season to taste with salt. Refrigerate until ready to serve. Transfer remaining cooking liquid to medium saucepan.\nSerious Eats / Mariel De La Cruz\nAdd tomatillos, remaining 2 onion quarters, remaining 2 garlic cloves, and jalapeños to saucepan with strained pork liquid. Add water until it is about 1 inch below the top of the vegetables. Bring to a boil over high heat, reduce to a simmer, and cook until all vegetables are completely tender, about 10 minutes. Blend salsa with immersion blender or in a countertop blender until smooth. Season to taste with salt. Allow to cool and refrigerate until ready to use.\nSerious Eats / Mariel De La Cruz\nTo serve: Preheat broiler to high with oven rack 4 inches below heating element. Broil pork until brown and crisp on surface, about 6 minutes. Remove pork, stir with a spoon to expose new bits to heat, and broil again until crisp, 6 more minutes. Tent with foil to keep warm.\nSerious Eats / Mariel De La Cruz\nMeanwhile, heat tortillas. Preheat an 8-inch cast iron skillet over medium-high heat until hot. Working one tortilla at a time, dip tortilla in bowl filled with water. Transfer to hot skillet and cook until water evaporates from first side and tortilla is browned in spots, about 30 seconds. Flip and cook until dry, about 15 seconds longer. Transfer tortilla to a tortilla warmer, or wrap in a clean dish towel. Repeat with remaining tortillas.\nSerious Eats / Mariel De La Cruz\nTo eat, stack two tortillas on top of each other. Add two to three tablespoons carnitas mixture to center. Top with salsa verde, chopped onions and cilantro, and queso fresco. Serve with lime wedges.\nSerious Eats / Mariel De La Cruz\nSpecial Equipment\n9- by 13-inch glass baking dish\n, large\nfine-mesh strainer\n, medium\nsaucepan\n, fat separator (optional),\nimmersion\nor\ncountertop blender\nNotes\nCarnitas can be prepared through step 3 up to three days in advance. Pork can be crisped up straight from the refrigerator. You can lower the heat in your salsa verde by removing the seeds from the jalapeños, or omitting them entirely before simmering.\nRead More\nSous Vide Carnitas for Tacos (Crispy Mexican-Style Pulled Pork) Recipe\nTacos de Castacán Con Queso (Yucatecan Pork Belly and Cheese Tacos) Recipe\nTacos de Canasta (Basket Tacos for a Party or Potluck) Recipe\nCharred Salsa Verde Recipe\nThese 4 Mexican Braises Will Jump-Start Your Fall\nTacos\nMexican\nBraised & Stewed Pork\nPork Shoulder\nPork Mains"
}