{
  "url": "https://www.seriouseats.com/oatmeal-raisin-cookies-recipe-8759166",
  "image_url": "https://www.seriouseats.com/thmb/69Ewk0PbM5TOujiRV1CCm6wLXZM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241007-SEA-OatmealRaisinCookies-FredHardy-Hero-94-70645ebdd8c540488081305b4cfc6e19.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Baking",
    "Desserts"
  ],
  "title": "Oatmeal Raisin Cookies",
  "full_text": "Oatmeal Raisin Cookies\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nChilling and Cooling Time\n3 hrs\nTotal\n4 hrs\nServes\n14\nMakes\n14 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n226g\nunsalted butter\n(\n8\nounces\n; 2 sticks)\n1\nteaspoon\nground cinnamon\n1/4\nteaspoon\nnutmeg\n212\ng\nrolled oats\n(7 1/2 ounces; 2 1/2 cups)\n170g\nall-purpose flour\n(6 ounces;\n1 1/3\ncups\n)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nbaking powder\n213\ng\ndark brown sugar\n(7 1/2 ounces; 1 cup)\n50\ng\ngranulated sugar\n(1 3/4 ounces; 1/4 cup)\n2\nteaspoons\nvanilla extract\n2\nlarge\neggs\n143g\nraisins\n(5 ounces;\n1\ncup\n)\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175ºC). In a small saucepan, melt butter over medium heat. Cook, stirring often, until butter solids turn golden brown and smell nutty, 6 to 8 minutes. Immediately remove saucepan from heat, pour butter and toasted bits into a large heatproof bowl, and stir in cinnamon and nutmeg. Set aside to cool slightly, about 10 minutes.\nSerious Eats / Fred Hardy\nMeanwhile, spread oats in an even layer on a 13- by 18-inch rimmed baking sheet. Bake, stirring occasionally, until oats are toasted and golden, 10 to 15 minutes. Turn oven off. Remove from oven and let cool on baking sheet for 10 minutes.\nSerious Eats / Fred Hardy\nIn a medium bowl, whisk together flour, salt, baking soda, and baking powder. Whisk dark brown sugar, granulated sugar, and vanilla into butter mixture until smooth, then whisk in eggs, one at a time, until mixture is thick, smooth, and shiny. Add flour mixture to butter mixture and, using a rubber spatula, fold together until mostly combined. Fold in raisins and toasted oats until evenly distributed and no streaks of flour remain. Cover and refrigerate until firm enough to scoop, about 1 hour. Using a 2-ounce (#16) cookie scoop or 1/4 cup measuring cup, scoop cookies onto a parchment-lined rimmed baking sheet. (Each portion should weigh about 2 1/2 ounces or 72g.) Refrigerate until firm, about 1 hour.\nSerious Eats / Fred Hardy\nWhen ready to bake, adjust oven rack to middle position and preheat oven to 350°F (175ºC) and line two 13- by 18-inch rimmed baking sheets with parchment. Set portioned dough onto prepared baking sheets, spacing dough at least 2 inches apart. Using your hands or a flat-bottomed measuring cup, gently press down on cookie dough to flatten into 1-inch tall discs (about 1 1/2 inches in diameter).\nSerious Eats / Fred Hardy\nBake, one baking sheet at a time, until edges are golden and centers are still soft and pale, 12 to 14 minutes. Immediately after removing baking sheet from oven, bang pan on counter. For neater cookies, swirl a 4 1/2-inch ring cutter or small bowl around each cookie to help shape into a tidy circle. Let cool on baking sheet for 15 minutes, then transfer to a wire rack to cool completely, about 45 minutes.\nSerious Eats / Fred Hardy\nSpecial Equipment\nSmall saucepan, whisk, large heatproof bowl, two 13- by 18-inch rimmed baking sheets, rubber spatula, 2-ounce (#16) cookie scoop or 1/4 cup measuring cup, 4 1/2-inch ring cutter (optional)\nVariations\nDried chopped apricots, cherries, cranberries, can be substituted for raisins. You can add up to 1 cup additional mix-ins of your choice, such as chopped chocolate or nuts, if desired.\nNotes\nIf your dried fruit feels very dried out, you can rehydrate it by soaking in hot water (or the alcohol of your choice, such as rum or bourbon) for up to 10 minutes. Drain through a fine-mesh sieve and dab dry with a paper towel before using.\nIf you prefer smaller cookies, you can portion them with a 2 tablespoon scoop and bake them for 8 to 10 minutes instead of 12 to 14 minutes.\nMake-Ahead and Storage\nOnce cooled, baked cookies can be stored in an airtight container at room temperature for up to 5 days.\nPortioned cookie dough can be frozen for up to 3 months. To freeze cookie dough, place portioned dough on a parchment-lined baking sheet and freeze until firm. Once frozen, transfer to a zip-top bag and freeze. Bake from frozen until edges are golden and centers are soft and pale, about 15 minutes.\nCookies\nThe Latest\nBaking\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/oatmeal-raisin-cookies.webp?"
}