{
  "url": "https://www.seriouseats.com/obe-ata-nigerian-red-pepper-sauce",
  "image_url": "https://www.seriouseats.com/thmb/zO5qobwKewdVMul9U2vxXL3Tupc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200224-obe-ata-vicky-wasik-23-48ef3dfb1176452f99d4a0c6fbed3e16.jpg",
  "tags": [
    "African",
    "West African",
    "Chicken",
    "Bell Peppers",
    "Tomato"
  ],
  "title": "Obe Ata (Nigerian Red Pepper Sauce) Recipe",
  "full_text": "Obe Ata (Nigerian Red Pepper Sauce) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs\nActive\n2 hrs\nTotal\n2 hrs 20 mins\nServes\n32\nto 34 servings\nMakes\n2 liters\nCook Mode\n(Keep screen awake)\nIngredients\n8\nred bell\npeppers\n(about\n4 1/2\npounds\n;\n2\nkg\n), stemmed, cored, and cut into roughly 1/2-inch dice\n9\ntablespoons\n(\n135\nml\n)\nred palm oil\n, divided\nKosher salt\n12\nmedium\ncloves garlic\n(about\n1\nhead\n), roughly chopped\n6\nlarge\nplum tomatoes\n(about\n1 3/4\npounds\n;\n800\ng\n), cored and quartered\n4\nFresno chile peppers\n(about\n2\nounces\n;\n55\ng\n), stemmed, seeded, and cut into roughly 1/2-inch dice (see notes)\n4\nhabanero\nor\nScotch bonnet peppers\n(about\n1\nounce\n;\n30\ng\n), stemmed, seeded, and cut into roughly 1/2-inch dice (see notes)\n2\nlarge\nred onions\n(about\n1 3/4\npounds\n;\n800\ng\n), peeled and cut into roughly 1/2-inch dice\nOne\n2-inch segment\npeeled\nfresh ginger\n(about\n3/4\nounce\n;\n20\ng\n), roughly chopped\n1\nquart\n(\n1\nL\n)\nhomemade chicken stock\nor store-bought,\nlow-sodium broth\n, or\nvegetable stock\n9\ntablespoons\n(\n135\nml\n)\ncanola\nor other neutral\noil\n1/2\nteaspoon\nNigerian curry powder\n, such as Lion's Brand, or more to taste (optional, see notes)\nGround Cameroon pepper\n, to taste (see notes)\n4\npounds\n(\n1.8\nkg\n)\ncooked bone-in chicken\n(optional)\nTorn fresh basil leaves\n, for garnish (optional)\nDirections\nPreheat oven to 400°F (200°C) and set oven racks in the top- and bottom-third positions. Line two rimmed baking sheets with parchment paper.\nIn a large bowl, toss red bell peppers with 2 tablespoons (30ml) palm oil. Season with salt. Transfer in an even layer to one of the rimmed baking sheets. In the same large bowl, toss garlic, tomato, Fresno chile, habanero, onion, and ginger with 4 tablespoons (60ml) palm oil. Season with salt. Transfer in an even layer to the other rimmed baking sheet.\nRoast the vegetables, stirring and rotating baking sheets once or twice during cooking, until all are tender, some of their juices have cooked off, and they are charred in spots, about 45 minutes for the red bell peppers and 30 minutes for the tomatoes, chiles, and onions.\nScrape all of the roasted vegetables into a blender jar and blend until either a chunky or smooth purée forms (the consistency of your obe ata is up to you; we like a smoother sauce for when it is used for stews and a chunkier one when it is used as a dip or condiment).\nTransfer vegetable purée to a Dutch oven. Stir in chicken stock, remaining 3 tablespoons (45ml) palm oil, canola oil, curry powder, and Cameroon pepper. Bring to a simmer. Season lightly with salt, then simmer until sauce is reduced to a good stew-like thickness that can coat pieces of meat well, about 1 hour. If desired, season with additional curry powder and/or Cameroon pepper to meet your desired flavor and spice level.\nIf serving with chicken, add cooked chicken to the Dutch oven and simmer until chicken is warmed through, about 15 minutes. Serve with warm rice and garnish with torn basil leaves, if desired.\nAlternatively, you can continue to cook down the sauce until it thickens to a dip-like consistency, about 3 hours; the oils will break from the sauce in this time and fry the vegetable purée, deepening its flavor further.\nSpecial Equipment\nDutch oven\n,\nblender\nNotes\nIf you are unable to find Fresno chiles, you can substitute that amount with another mild red chiles. The number of hot chile peppers called for here doesn't make a very spicy sauce, so feel free to add as many more as you wish based on your own tolerance for spiciness.\nIf you can't find Lion's brand curry powder, you can substitute another curry powder of your choosing (note that it will taste different), or leave it out if you don't want to add those spice flavors to this dish.\nGround Cameroon pepper is a hot and smoky dried pepper powder. If you can't find it, you can substitute ground chipotle powder, or freshly ground black pepper.\nMake-Ahead and Storage\nObe ata can be kept in an airtight container in the refrigerator for up to five days and in the freezer for up to three months.\nAfrican\nWest African\nChicken\nBell Peppers\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/obe-ata-nigerian-red-pepper-sauce-recipe.webp?"
}