{
  "url": "https://www.seriouseats.com/oeufs-mayonnaise-french-eggs-with-mayo-8715910",
  "image_url": "https://www.seriouseats.com/thmb/D5MribACcHikbbLRMDnpA9qDxiQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240920-OeufsMayo-AmandaSuarez-09-516357f8b9834f36b473488db2af832b.jpg",
  "tags": [
    "Boiled Eggs",
    "The Latest",
    "French",
    "Snacks & Appetizers",
    "Easter"
  ],
  "title": "Oeufs Mayonnaise (French Boiled Eggs With Homemade Mayonnaise)",
  "full_text": "Oeufs Mayonnaise (French Boiled Eggs With Homemade Mayonnaise)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nTotal\n20 mins\nServes\n2\nto 4\nMakes\n8 pieces\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\neggs\n1\nlarge\negg yolk\n, at room temperature\n1\ntablespoon\n(15ml)\nDijon mustard\n1\ntablespoon\n(15ml) white or red\nwine vinegar\nor lemon juice from 1/2 a fresh lemon\n1\nmedium\nclove garlic, finely minced\nKosher\nsalt and freshly ground black pepper\n1\ncup\n(235ml)\nextra-virgin olive oil\n, or an equal-parts combination of olive oil and a neutral oil like vegetable\nMinced fresh\nchives\nor other herb like flat-leaf parsley, tarragon, or chervil, for garnish (optional)\nDirections\nBring 3 quarts (2.8L) water to a boil in a large pot and prepare an ice bath. Carefully lower eggs into pot and continue to boil for 30 seconds. Cover tightly, reduce heat to low (water should maintain a bare simmer), and continue cooking for 9 minutes for jammy yolks or 11 minutes for hard-cooked yolks. Immediately transfer eggs to ice water and allow to cool, then shell and halve.\nSerious Eats / Qi Ai\nMeanwhile, in a large mixing bowl, whisk together egg yolk, mustard, vinegar (or lemon juice), garlic, and a large pinch of salt and fresh black pepper. While whisking constantly and briskly, begin gradually dripping in oil. When 1/4 cup of oil has been added, start adding the oil in a slow, steady drizzle while continuing to whisk constantly; stop adding oil if too much accumulates in the bowl, only starting again after the excess has been whisked in. Season mayonnaise to taste with additional salt, if needed. Dollop some mayonnaise onto serving plates, set the halved eggs on the mayo dollops (this will keep them from sliding around too much), and dollop additional mayo on top. Garnish with herbs, if desired, and serve right away.\nSerious Eats / Amanda Suarez\nMake-Ahead and Storage\nShell-on hard-boiled eggs can be stored in the refrigerator for up to 5 days. Once the shell is removed, they can be refrigerated for up to 1 day. The mayonnaise can be refrigerated in an airtight container for up to 4 days.\nBoiled Eggs\nThe Latest\nFrench\nSnacks & Appetizers\nEaster"
}