{
  "url": "https://www.seriouseats.com/ohio-shredded-chicken-sandwiches-recipe-8782664",
  "image_url": "https://www.seriouseats.com/thmb/Vtx-5hxCRy-QFfw6V9e6jfe-PGk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250127-SEA-OhioShreddedChickenSandwiches-DeliStudios-hero-dd21cd65d85845c786796d8fb81dd62d.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Chicken",
    "Midwestern"
  ],
  "title": "Ohio Shredded Chicken Sandwich",
  "full_text": "Ohio Shredded Chicken Sandwich\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nTotal\n55 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(905\ng\n) boneless, skinless\nchicken thighs\n1/2\nteaspoon\nDiamond Crystal kosher salt,\nplus more to taste; for table salt, use half as much by volume or the same weight\n3\ntablespoons\n(\n60\ng\n)\nunsalted butter, divided\n1 1/2\ncups\n(\n360\nml)\nhomemade\nchicken stock\nor store-bought low-sodium\nchicken broth\n3/4\ncup\n(\n180\nml)\nwhole milk\n(see notes)\n1\nmedium\nyellow onion\n(8\nounces;\n225\ng\n), diced\n1\nstalk\n(\n2\no\nunces)\ncelery,\nany leaves included, diced, (about\n1/2\ncup\ndiced)\n1\nclove\ngarlic, minced\n2\nteaspoons\nfreshly\nground black pepper\n3\ntablespoons\nall-purpose flour\n1\ntablespoon\n(\n15\nml\n) pickled\nbanana pepper brine,\nplus pickled banana peppers slices for serving\n4\nburger buns\n,\ntoasted,\nfor serving\nDirections\nPat chicken thighs dry with paper towels then lightly season all over with salt. In a large skillet or Dutch oven, melt 1 tablespoon butter over medium-high heat. Working in batches, add chicken and cook until browned on both sides, 3 to 4 minutes per side.\nReturn all chicken to skillet or Dutch oven and add chicken stock, bring to a simmer, and scrape the bottom of pan with a wooden spoon to loosen any browned bits. Lower heat to medium-low and simmer until chicken registers 175°F (80℃), 5 to 7 minutes. Use tongs to transfer chicken to a cutting board to cool.\nStrain the cooking liquid through a fine-mesh strainer into a heatproof measuring cup or medium bowl. Stir in milk; set aside.\nSerious Eats / Deli Studios\nIn the now-empty pan, melt remaining 2 tablespoons butter over medium heat. Add onion and celery and cook, stirring occasionally, until softened and translucent, 5 to 7 minutes. Add garlic, black pepper, and salt and cook until aromatic, about 1 minute. Sprinkle flour over the vegetables and stir to coat. Cook until toasted and no dry flour remains, 1 to 2 minutes.\nSerious Eats / Deli Studios\nGradually pour in the reserved stock and milk mixture, whisking constantly. Bring to a boil, then reduce heat to maintain a simmer and cook, stirring often, until gravy thickens enough to coat the back of a spoon, about 5 minutes.\nSerious Eats / Deli Studios\nUsing an immersion blender (or carefully transferring to a standard blender), purée the sauce until smooth. Taste and adjust seasoning with salt and pepper as needed. If using a blender, return sauce to pot.\nSerious Eats / Deli Studios\nUsing 2 forks, shred chicken finely, then return to pot with sauce. Simmer until mixture resembles a thick gravy and a line drawn by a spoon holds its shape for a few seconds, 7 to 10 minutes. Remove from heat, stir in reserved banana pepper brine, and let cool for 15 minutes. (It will thicken further as it cools.)\nSerious Eats / Deli Studios\nFor serving sandwiches:\nFor each sandwich, pile about 1/2 cup shredded chicken mixture onto a bottom bun. Add pickled banana peppers. Top with the remaining bun and serve warm.\nSerious Eats / Deli Studios\nSpecial Equipment\nLarge skillet or Dutch oven, fine-mesh strainer, tongs, immersion or standard blender\nNotes\nInstead of using milk, you can substitute with half-and-half or cream for a richer texture and flavor.\nMake-Ahead and Storage\nThe cooked chicken and the sauce can be prepared ahead (through step 7, omitting the banana pepper brine), cooled, and refrigerated in an airtight container for up to 4 days. Reheat in a skillet over low heat until hot, then remove from heat and add the banana pepper brine. Let mixture cool for 15 minutes, and assemble and serve the sandwiches.\nSandwiches\nThe Latest\nChicken\nMidwestern"
}