{
  "url": "https://www.seriouseats.com/oi-sobagi-stuffed-cucumber-kimchi-5197083",
  "image_url": "https://www.seriouseats.com/thmb/AaK6uzpngOqldkJ1OspxE2U7iYI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210715-oi-sobagi-stuffed-cucumber-kimchi-vicky-wasik-seriouseats-30-3fe8f7c932444cdd988a958810059949.jpg",
  "tags": [
    "Korean",
    "Vegetable Sides",
    "No-Cook",
    "Cucumbers",
    "No-Cook Salads"
  ],
  "title": "Oi-Sobagi (Korean Stuffed Cucumber Kimchi)",
  "full_text": "Oi-Sobagi (Korean Stuffed Cucumber Kimchi)\nClose\nJump to recipe\nPrep\n15 mins\nDraining Time\n30 mins\nTotal\n45 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/4\npounds\n(\n1\nkg\n) kirby or pickling\ncucumbers\n(see notes)\n1\ntablespoon\n(\n12\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or an equal amount by weight\n4\nounces\n(\n115\ng\n)\ndaikon radish\n, peeled and cut into 1/8-inch-thick matchsticks (about\n1\ncup\n;\n100\ng\n)\n1\nmedium\ncarrot\n(\n4\nounces\n;\n115\ng\n), peeled and cut into 1/8-inch-thick matchsticks (about\n1\ncup\n;\n100\ng\n)\n1\nsmall\nAsian pear\n(about\n6\nounces\n;\n170\ng\n), peeled, cored, and cut into 1/8-inch-thick matchsticks (about\n1\ncup\n;\n100\ng\n)\n2\nounces\n(\n55\ng\n)\ngarlic chives\n, cut into 2-inch pieces (about\n1\ncup\n)\n3\nmedium\nscallions\n(\n50\ng\n), root end trimmed and discarded, halved lengthwise, and cut crosswise into 2-inch pieces\n3\nmedium\ngarlic cloves\n(\n15\ng\n), finely chopped\n1\ntablespoon\n(\n20\ng\n)\nsaeujeot\n(Korean salted shrimp), drained of brine\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n1/2\ncup\n(\n55\ng\n) coarse ground gochugaru (Korean\nchile powder\n)\nDirections\nUsing a sharp knife, trim and discard both ends of the cucumbers. If using long cucumbers (about 10 inches), halve crosswise; for smaller kirby cucumbers, leave whole. Working with one piece of cucumber at a time, halve lengthwise, stopping 1/2 inch from the base to keep cucumber intact. Rotate cucumber 90 degrees and repeat cut, producing a quartered cucumber held together at one end. Repeat with remaining cucumbers.\nSerious Eats / Vicky Wasik\nSet a colander inside a large bowl. Sprinkle cucumbers evenly with salt, seasoning the cut-open interiors as well as the skins. Arrange in colander, cut-side down, and set aside until cucumbers are softened, pliable, and have released a good amount of water into bowl, about 30 minutes. Drain, reserving 1/4 cup (60ml) of the salty cucumber liquid left in bowl; discard remaining liquid, and wipe out bowl.\nSerious Eats / Vicky Wasik\nIn now-empty bowl, combine daikon, carrot, Asian pear, garlic chives, scallions, garlic, saeujeot, and fish sauce. Using clean hands, gently mix until thoroughly combined. Set aside until vegetables release moisture and look wet on surface, about 1 minute.\nSerious Eats / Vicky Wasik\nAdd gochugaru and gently mix until gochugaru is thoroughly incorporated and begins to absorb liquid released by vegetables, about 1 minute.\nSerious Eats / Vicky Wasik\nWorking with one cucumber at a time, gently squeeze cucumber to release any residual excess moisture. Hold cucumber by un-cut end in your non-dominant hand and, using other hand, pick up approximately 1/3 cup (70g) of the vegetable mixture and gently stuff into cavity, taking care to keep cucumber intact. Transfer to a serving platter or container that can comfortably fit cucumbers in a single layer. Repeat stuffing process with remaining cucumbers. Top oi-sobagi with any leftover filling and reserved cucumber liquid. Serve immediately, or cover and refrigerate for up to 1 week.\nSerious Eats / Vicky Wasik\nNotes\nThis recipe works best with small, thick-skinned, firm kirby or pickling cucumbers. Persian or English cucumbers can be substituted, but they won't stay as crisp. Make sure to use unwaxed cucumbers.\nMake-Ahead and Storage\nOi-sobagi can be made in advance and refrigerated in an airtight container for up to 1 week. Serve cold or at cool room temperature.\nKorean\nVegetable Sides\nNo-Cook\nCucumbers\nNo-Cook Salads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/oi-sobagi-korean-stuffed-cucumber-kimchi.webp?"
}