{
  "url": "https://www.seriouseats.com/okonomiyaki-japanese-pancake-cabbage-recipe",
  "image_url": "https://www.seriouseats.com/thmb/s4xBtrzOlvyFS22puQlctlFfjUY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__04__20160415-okonomiyaki-39-edf9c389b7db404fa55b6e18cdf9e9bd.jpg",
  "tags": [
    "Pancakes",
    "Japanese",
    "Cabbage",
    "Snacks & Appetizers"
  ],
  "title": "Osaka-Style Okonomiyaki (Japanese Cabbage Pancake) Recipe",
  "full_text": "Osaka-Style Okonomiyaki (Japanese Cabbage Pancake) Recipe\nClose\nJump to recipe\nActive\n30 mins\nTotal\n30 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2 small head\ncabbage\n, finely shredded (about 4 packed cups; 14 ounces;\n400\ng\n)\n3\nscallions\n, thinly sliced, dark green parts reserved separately\n2\nounces\n(50g)\nbeni-shoga\n(\nJapanese pickled red ginger\n), divided (see notes)\n1/2 ounce (\n15\ng\n)\nkatsuobush\ni, divided (see notes)\n1/4 pound (\n120\ng\n)\nyamaimo\n, peeled and grated on the smallest holes of a box grater (optional; see notes)\n2\nlarge\neggs\n1/2\ncup\n(120ml) cold water or\ndashi\n(or use cold water with 2 teaspoons Hondashi; see notes)\n3/4 cup\nall-purpose flour\n(3 3/4 ounces;\n110\ng\n)\n8 to 10\nthin slices\nuncured pork belly\n(optional; see notes)\n2\ntablespoons\n(30ml)\nvegetable oil\n(if not using pork belly)\nAo-nori, okonomiyaki sauce, and\nKewpie mayonnaise\n, for serving (see notes)\nDirections\nCombine cabbage, scallion whites and half of greens, half of beni-shoga, 3/4 of katsuobushi, yamaimo, eggs, and water (or dashi) in a large bowl. Sprinkle with flour. Stir with a fork and beat heavily until a thick batter with plenty of bubbles forms. Set aside.\nSerious Eats / J. Kenji López-Alt\nIf using pork belly, cover the bottom of a 10-inch nonstick skillet with pork belly and set over medium heat. Add okonomiyaki mixture and spread into an even layer with a fork. If not using pork belly, heat vegetable oil in skillet over medium heat until shimmering. Add okonomiyaki mixture and spread into an even layer with a fork.\nSerious Eats / J. Kenji López-Alt\nCover and cook, shaking pan occasionally, until bottom layer is crisp and well browned, about 10 minutes, lowering heat as necessary if cabbage threatens to burn.\nTo flip, drain off any excess fat, then, working over a sink and holding the lid tightly against pan with a pot holder, flip entire pan and lid over so that okonomiyaki transfers to pan lid. Remove pan, then carefully slide okonomiyaki off lid and back into pan, browned side up.\nSerious Eats / J. Kenji López-Alt\nReturn to heat, cover, and continue to cook, shaking gently, until both sides are browned and okonomiyaki is not runny but still custardy and tender in the center, about 8 minutes longer. Transfer to a serving platter, pork side up.\nDrizzle with okonomiyaki sauce and mayonnaise; sprinkle with ao-nori, remaining beni-shoga, remaining katsuobushi, and remaining scallion greens; and serve immediately off of a communal plate.\nSpecial Equipment\n10-inch\nnonstick skillet\nNotes\nThis is a simple base recipe. You can add other ingredients, such as diced shrimp, thinly sliced Chinese sausage, corn kernels, or other vegetables (shred or chop other vegetables) as desired. Try to keep the total weight of additional ingredients to under 1/2 pound (225g).\nThis recipe requires a few specialty ingredients. Beni-shoga is red pickled ginger; it can be omitted or replaced with the regular, finely chopped pickled ginger you serve with sushi. Katsuobushi is dried, smoked, and shaved bonito; it comes in both large and thin shavings. The large shavings are typically used for making dashi. Look for the finely shaved version. (It can also be omitted.) Yamaimo is Japanese mountain yam, a long root vegetable with thin, light brown skin and a slippery internal texture. (It can be omitted.) Hondashi is granulated dashi powder. (Water can be used in its place.)\nBacon can be used instead of uncured pork belly, but it will make the okonomiyaki much more difficult to flip. If using bacon, carefully run a flexible rubber spatula under the edges of the okonomiyaki and shake it to loosen it before attempting to flip. Pork can also be entirely omitted.\nAo-nori is powdered green sea laver. (It can be replaced with finely shredded nori.) Okonomiyaki sauce is a sweet and savory sauce. (It can be replaced with Bull-Dog sauce or equal parts Worcestershire sauce and ketchup seasoned with soy sauce.) Kewpie mayonnaise is a Japanese-style sweet mayonnaise. (It can be replaced with regular mayonnaise.) All ingredients can easily be found in a Japanese specialty market.\nPancakes\nJapanese\nCabbage\nSnacks & Appetizers"
}