{
  "url": "https://www.seriouseats.com/old-fashioned-latkes-chanukah-hanukah-potato-pancakes",
  "image_url": null,
  "tags": [
    "Hanukkah",
    "Vegetarian Mains",
    "Vegetarian Sides",
    "Fried Potatoes",
    "Russet Potatoes"
  ],
  "title": "Old-Fashioned Latkes",
  "full_text": "Old-Fashioned Latkes\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nActive\n60 mins\nTotal\n55 mins\nServes\n16 latkes\nCook Mode\n(Keep screen awake)\nIngredients\n4 1/2\npounds\n(\n2\nkg\n)\nrusset potatoes\n(about\n7\nmedium-large\n)\n5\ncups\ndiced onion\n4\nlarge\neggs\n1 1/4\ncups\nmatzo meal\n(more or less as needed)\n2\ntablespoons\n(\n24\ng\n)\nkosher salt\n, to taste\nCanola\nor\npeanut oil\n, for frying\nApplesauce\nand\nsour cream\n, for serving\nDirections\nShred potatoes with the grating disk of a\nfood processor\n. After every 2 or 3 potatoes, wrap shreds in cheesecloth that has been folded over twice. Tie corners around the handle of a wooden spoon and twist bundle until water flows out. Collect water in a bowl and squeeze all potatoes until dry. Transfer potatoes to a large mixing bowl along with diced onion.\nSerious Eats / Vicky Wasik\nLet drained potato water sit, undisturbed, until a pool of brown water forms on top of a slurry of pale potato starch. Carefully drain off water, then mix starch into potato and onion mixture with your hands. Mix in eggs, one at a time, alternating with 1/4-cup additions of matzo meal, until latke mix can be formed into patties that just stick together in your hands. Add salt incrementally.\nSerious Eats / Vicky Wasik\nHeat 1/2 inch oil in a cast iron skillet over medium-high heat until a shred of potato immediately bubbles when added to pan. Form a small amount of latke mix into a disk and fry on both sides until golden brown to test for seasoning. Taste and add more salt as needed.\nSerious Eats / Vicky Wasik\nForm latke mix into patties about 4 inches wide and 1 inch thick in the center. Slide into pan, cooking no more than four at a time. Fry until a golden-brown crust forms on bottom, then flip with a slotted spatula and fork until same color is achieved on other side. Flip as needed to get a firm, darker-than-golden crust on both sides.\nSerious Eats / Vicky Wasik\nTransfer to a sheet pan lined with paper towels to cool for 2 minutes, then serve with applesauce and sour cream at the table.\nSpecial Equipment\nLarge cast iron skillet\n,\nfood processor\n,\nhalf-sheet pan\n,\ncheesecloth\nMake-Ahead and Storage\nIf you need to make them ahead of serving time, fried latkes can be drained, then held in a 200°F (95°C) oven, with the door slightly ajar, for no more than two hours.\nNotes\nThese ingredient amounts aren't law; depending on the moisture content of your potatoes, you may need more or less binder, or a different balance of eggs and matzo meal. What's important is that the latke patties don't fall apart in your hands, or they certainly will in the pan. Start with a little egg and matzo meal, then add only as much as you need.\nHanukkah\nVegetarian Mains\nVegetarian Sides\nFried Potatoes\nRusset Potatoes"
}