{
  "url": "https://www.seriouseats.com/olive-oil-cake-roasted-grapes-chocolate-ganahce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/7dA64CruEzav7PjNxhMG3LFK-kI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__20140514-olive-oil-cake-with-grapes-slice-primary-aa917537530945a79621d19616f49c11.jpg",
  "tags": [
    "Cakes",
    "Chocolate",
    "Olive Oil"
  ],
  "title": "Olive Oil Cake With Roasted Grapes and Ganache Recipe",
  "full_text": "Olive Oil Cake With Roasted Grapes and Ganache Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs\nActive\n60 mins\nCooling Time\n80 mins\nTotal\n3 hrs 35 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Roasted Grapes:\n2\ncups\nseedless purple grapes\n, stemmed\n1\nteaspoon\nolive oil\nFor the Cake:\n1/2\ncup\nplus\n2\ntablespoons\nstone-ground cornmeal\n1/2\ncup\nall-purpose flour\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nsalt\n4\nlarge\neggs\n, lightly beaten\n3/4\ncup\nsugar\n1\ntablespoon\nzest\nand\n1/4\ncup\nfresh\njuice\nfrom about\n1\nmedium\norange\n1/2\ncup\nextra virgin olive oil\nFor the Ganache:\n5\nounces\nbittersweet chocolate\n1/2\ncup\nheavy cream\n2\ntablespoons\ngranulated sugar\n2\ntablespoons\nwater\nDirections\nRoast the grapes\n: Adjust oven rack to middle position and preheat oven to 325°F (165°C). Place grapes on baking sheet and toss with olive oil. Roast until soft and shriveled, about 1 hour. Let cool completely.\nMake the cake\n: Grease cake pan with oil or butter. Increase oven temperature to 350°F (175°C). In a small bowl, whisk together cornmeal, flour, baking powder, and salt; set aside.\nIn a large bowl, whisk together eggs and sugar until lightened in color, about 3 minutes. Whisk in orange zest, followed by olive oil and orange juice. Add dry ingredients to the bowl and whisk until no clumps are left. Stir in roasted grapes.\nPour batter into prepared pan and smooth top, tapping pan to make sure grapes are evenly distributed. Bake until a cake tester inserted into the middle of the cake comes out clean, 50 minutes to 1 hour. If top is starting to get too brown, cover with foil and continue baking.\nLet cake cool for 15 minutes then release from springform pan to continue to cool. Meanwhile, make the ganache.\nMake the ganache\n: Place cream, sugar, and water in a medium saucepan over medium heat. When cream comes to a boil, take off heat and add in chocolate, stirring until chocolate is completely dissolved and mixture is smooth.\nPlace cooled cake on a cake rack set over a baking sheet or other large dish. Pour glaze over the cake (there will be overflow) and smooth over top and sides using an offset spatula. Transfer cake to refrigerator and chill until glaze is set, about 20 minutes. Keep cake in refrigerator, loosely covered with plastic wrap, if not eating right away.\nSpecial Equipment\nbaking sheet, 9-inch springform pan, mixing bowls, whisk, saucepan, off-set spatula\nCakes\nChocolate\nOlive Oil",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/olive-oil-cake-with-roasted-grapes-and-ganache-recipe.webp?"
}