{
  "url": "https://www.seriouseats.com/onde-onde-malaysian-sweet-palm-sugar-dumplings-8548738",
  "image_url": "https://www.seriouseats.com/thmb/r89Ypme55_tkGrRFgC-60RwYeX8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-OndeOnde-MichelleYip-hero-5a14e10b8e81419e8b10a3d04b5ae579.jpg",
  "tags": [
    "Malaysian",
    "The Latest",
    "Southeast Asian",
    "Desserts"
  ],
  "title": "Onde-Onde (Malaysian Sweet Palm-Sugar Dumplings)",
  "full_text": "Onde-Onde (Malaysian Sweet Palm-Sugar Dumplings)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n20 mins\nCooling Time\n5 mins\nTotal\n60 mins\nMakes\n40 1-inch dumplings\nCook Mode\n(Keep screen awake)\nIngredients\n3 1/2\nounces\n(\n100\ng\n) finely\nshredded\nunsweetened desiccated\ncoconut\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1\nmedium\nJapanese or Hannah\nsweet potato\n(do not use orange sweet potatoes or yams)\n3/4\nounce\n(\n20\ng\n)\npandan leaves\n(\n5 or 6\nleaves\n), cut into 1-inch pieces\n8 3/4\nounces\n(\n250\ng\n) glutinous\nrice flour\n5 1/4\nounces\n(\n150\ng\n)\npalm sugar\n, preferably Malaysian gula melaka\nDirections\nIn a large microwave-safe bowl, stir together desiccated coconut, kosher salt, and 1/4 cup (60ml) water. Microwave on high power for 1 minute. Fluff the rehydrated coconut flakes with a fork, then set aside.\nSerious Eats / Michelle Yip\nUsing a fork, prick skin of sweet potato all over. Place sweet potato on microwave-safe plate and microwave on high for 5 minutes. Sweet potato is ready when it can be pierced easily with a paring knife; if it isn't ready, continue to microwave in 30-second increments until soft. Let stand until cool enough to handle. Peel the sweet potato and measure 3 1/2 ounces (100g) and mash it with a fork; reserve remaining sweet potato for another use.\nSerious Eats / Michelle Yip\nIn a blender or food processor, combine pandan leaf pieces and 1 cup (240ml) water. Blend or process until the leaves are as pulverized as your machine allows, 1 to 2 minutes. Strain pandan juice through a fine-mesh strainer set over a medium bowl; discard pulp.\nSerious Eats / Michelle Yip\nIn a medium mixing bowl, combine mashed sweet potato and rice flour, using your fingers to break up any sweet potato chunks (like working butter into pie dough). Add pandan juice and work mixture into a dough. If needed, add water to the dough, 1 tablespoon at a time, until it becomes the texture of wet sand (it might still be a little crumbly but you should be able to squeeze the dough together into a cohesive whole).\nSerious Eats / Michelle Yip\nUsing your palms, roll dough into 1-inch balls and arrange them on a baking sheet. While you work, keep both the bowl and the baking sheet covered with damp kitchen towels to prevent the dough and dough balls from drying out.\nSerious Eats / Michelle Yip\nOn a cutting board and using a sharp knife, very thinly slice palm sugar into shavings, then transfer to a bowl and break up any lumps with your fingers as finely as possible (if using gula melaka, this should be easy as it tends to be quite moist; if using a more dry and firm palm sugar, you may want to try grating it finely instead of using a knife).\nSerious Eats / Michelle Yip\nMake a deep indentation in 1 dough ball with your thumb. Lightly pack about 1 teaspoon of shaved palm sugar into the indentation, then pinch the dough so that it completely covers the filling. Gently roll the dough back into a smooth ball, then return it to the baking sheet and cover with a damp kitchen towel. Continue filling and rolling the balls until all of the palm sugar is used up, making sure to keep all the dough balls covered with a damp kitchen towel to prevent drying out.\nSerious Eats / Michelle Yip\nIn a large saucepan, boil about 3 inches of water over high heat. Working with about a dozen at a time, transfer the balls to the boiling water. Cook until they float, about 2 minutes. Using a wire skimmer, lift the onde-onde from the water, gently shake to rid of excess water, and transfer to the bowl of coconut. Roll in coconut until completely coated, then transfer to serving plate. Repeat with remaining dough balls. Serve immediately.\nSerious Eats / Michelle Yip\nSpecial Equipment\nMicrowave, blender or food processor, wire skimmer/spider\nNotes\nThe recipe can easily be scaled up or down as required.\nIf you don’t have a microwave oven, use a bamboo steamer and wok combo or a tiered steamer to steam the desiccated coconut and sweet potato. Boil water in the wok or bottom tier of the steamer over high heat, then place the steamer basket over the boiling water. The desiccated coconut will take about 1 minute, and the sweet potato will take 20 to 30 minutes.\nStep 7 is the most time-consuming part, so get some pals together or put a TV show on. Everything else goes by quite quickly.\nMake-Ahead and Storage\nOnde-onde, like many other kuih, is best eaten immediately once cooked as it does not keep well.\nTo freeze onde-onde, set uncooked dumplings on a 9- by 13- inch baking sheet lined with parchment paper and transfer to freezer. Once frozen, dumplings may be consolidated into a zip-top bag.\nTo cook from frozen: In a large saucepan, boil about 3 inches of water over high heat. Working with about a dozen at a time, drop the filled balls into the boiling water. Cook until they float and the sugar in the center has melted, about 6 minutes. Using a wire skimmer, lift the onde-onde and gently shake off excess water, then transfer to the bowl of coconut. Roll in coconut until completely coated, then transfer to serving plate. Repeat with remaining dough balls. Serve immediately.\nMalaysian\nThe Latest\nSoutheast Asian\nDesserts"
}