{
  "url": "https://www.seriouseats.com/one-bowl-gluten-free-chocolate-cake-recipe",
  "image_url": null,
  "tags": [
    "Cakes",
    "Gluten-free Desserts",
    "Layer Cake",
    "Chocolate"
  ],
  "title": "Gluten-Free Tuesday: One Bowl Chocolate Cake Recipe",
  "full_text": "Gluten-Free Tuesday: One Bowl Chocolate Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n35 mins\nCooling Time\n45 mins\nTotal\n95 mins\nServes\n8\nto 10 servings\nMakes\n1 cake\nCook Mode\n(Keep screen awake)\nIngredients\nOne Bowl Classic Chocolate Cake Dry Ingredients:\n2\ncups\ngranulated sugar\n1\ncup\nwhite rice flour\n1/2\ncup\ncornstarch\n1/4\ncup\nsweet rice flour\n1\ncup\nunsweetened cocoa powder\n1 1/2\nteaspoons\nbaking powder\n1 1/2\nteaspoons\nbaking soda\n1\nteaspoon\nsalt\n1\nteaspoon\nxanthan gum\nOne Bowl Classic Chocolate Cake Wet Ingredients:\n2\nlarge\neggs\n1\ncup\nmilk\n1/2\ncup\nvegetable oil\n2\nteaspoons\nvanilla extract\n1\ncup\nwarm\nwater\n(warm from the tap is fine)\nBasic Chocolate Buttercream Ingredients:\n4\ncups\n(\n1\npound\n)\npowdered sugar\n3/4\ncup\nDutch process cocoa powder\n1/2\nteaspoon\nsalt\n1\ncup\nbutter\n2\nteaspoons\nvanilla extract\n1/3\ncup\nmilk\nDirections\nFor the cake:\nPreheat oven to 350°F. Grease two 8-inch round cake pans with nonstick cooking spray.\nIn a large mixing bowl, whisk together the dry ingredients. For this cake, I used natural cocoa powder. Happily, dutch-processed cocoa powder works just as well. Use whichever you love. A cake made with dutch-processed cocoa powder will be darker than one made with natural cocoa powder. This step is important because of the xanthan gum present. You want the xanthan gum to be evenly distributed throughout the dry ingredients before you add the wet ingredients. This will prevent the xanthan gum from clumping.\nAdd wet ingredients. Mix until a smooth batter forms. You want the batter to be thoroughly mixed. No pockets of dry ingredients should remain. The final batter will have a slightly thick consistency.\nDivide batter evenly between the prepared pans. I spray my pans with non-stick gluten-free cooking spray. You could also grease them with vegetable shortening and dust the pans with cocoa powder. It's up to you!\nBake for bake for 30 to 35 minutes. A toothpick inserted into the center of the cakes should come out clean.\nOnce the cakes come out of the oven, allow them to cool in the pan for about 5 minutes and then turn them out onto a wire rack to cool. This allows steam to escape from the cake and prevents a gummy cake. The cake might sink just a little in the center as it cools. This is normal and allows for more icing! Mmmm....more icing. Where was I?\nOnce cake is cool, ice as desired.\nFor the Chocolate Buttercream:\nIn a medium mixing bowl, whisk together powdered sugar, cocoa powder and salt. Set aside.\nIn a large mixing bowl, cream butter until light and fluffy. About 30 seconds. (Use high speed on a handheld or stand mixer.)\nAdd powdered sugar and cream together for 10 seconds. Icing will be very thick.\nPour milk and vanilla extract evenly over the icing.\nBlend, on low speed, for 45 seconds or until smooth and creamy. If the icing is still stiff, add a bit more milk.\nUse as desired.\nCakes\nGluten-free Desserts\nLayer Cake\nChocolate"
}