{
  "url": "https://www.seriouseats.com/one-skillet-lemon-chicken-recipe-8739370",
  "image_url": "https://www.seriouseats.com/thmb/32jSN6iigPUrGq1iPJymu0HNXrs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241101-SEA-OneSkilletLemonChicken-MorganHuntGlaze-Hero2-10-109b1c056c1247f9b676698b408529d0.jpg",
  "tags": [
    "Chicken Mains",
    "The Latest",
    "Chicken Breast"
  ],
  "title": "Easy Skillet Lemon Chicken",
  "full_text": "Easy Skillet Lemon Chicken\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nTotal\n30 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\nlemons\n(4 ounces each;/113g), divided\n1/4\ncup\n(60ml) extra-virgin\nolive oil,\ndivided\n2\nteaspoons\nfreshly ground\nblack pepper\n1\ntablespoon\nfresh thyme leaves\n, plus 2 sprigs, divided, plus more for garnish\n2 1/2\nteaspoons\nDiamond Crystal\nkosher salt;\nfor table salt use half as much by volume\n4\nboneless skin-on\nchicken breasts\nor\nairline chicken breasts\n(10 to 12 ounces each; 285 to 360g)\n1\ntablespoon\n(15g) white\nmiso paste\n(see notes)\n3\nmedium\n(15g)\ngarlic cloves,\nthinly sliced\n1 dry chile de arbol or\npinch\nof red\npepper flakes\n(optional)\n3/4\ncup\n(180ml)\nhomemade\nor store-bought\nchicken broth\n5\ntablespoons\n(71g) unsalted\nbutter, c\nut into 5 pieces and chilled\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F ( 205℃). Zest lemons to yield 4 teaspoons zest. Juice 1 zested lemon to yield 2 tablespoons of juice (save any remaining lemon juice for another use); set aside. Halve remaining lemon crosswise and set aside. Place zest in a small bowl and add 3 tablespoons oil, black pepper, and 1 tablespoon thyme leaves; stir until well-combined.\nSerious Eats / Morgan Hunt Glaze\nPat chicken dry with paper towels, then gently loosen chicken skin on top of each breast without tearing. Rub lemon zest–oil mixture under skin and all over each chicken breast. Season chicken generously with salt and pepper.\nSerious Eats / Morgan Hunt Glaze\nIn a 12-inch stainless steel or enameled cast-iron skillet, heat remaining 1 tablespoon oil and add lemon halves, cut sides down, over medium heat and cook, undisturbed, until edges begin to brown, 2 to 4 minutes. Transfer lemon halves to a plate and set aside. Heat remaining oil in skillet over medium-high heat until just smoking and carefully lay chicken breasts skin side down to skillet. Cook without moving until skin is golden brown and crisp, 6 to 7 minutes. Carefully flip chicken breasts skin side up, and nestle reserved seared lemon halves to skillet alongside the chicken, cut side down.\nSerious Eats / Morgan Hunt Glaze\nTransfer skillet to oven and roast until a thermometer inserted into the thickest part of the chicken registers 155°F (68℃), 12 to 15 minutes. Transfer chicken breasts to a cutting board and let rest while preparing the pan sauce. Do not wipe out pan.\nSerious Eats / Morgan Hunt Glaze\nUsing tongs or a kitchen towel to handle, carefully juice the caramelized lemon halves (they will be very hot from the oven still) into a small bowl to yield 2 tablespoons juice. Whisk in fresh lemon juice and miso until smooth. Set aside.\nSerious Eats / Morgan Hunt Glaze\nTaking care if handle is still hot, return skillet with any remaining fat and browned bits to stovetop over medium-high heat and add garlic, chile, if using, and 2 thyme sprigs. Cook, stirring constantly, until garlic is softened and fragrant, about 1 minute. Add chicken broth and bring to a boil over medium-high; cook, stirring occasionally, until reduced by half, about 5 minutes. Stir in reserved lemon-miso mixture. Whisk in butter a few pieces at a time and cook at a boil until just emulsified, about 30 seconds. Remove from heat and set aside. Remove chile, if using.\nSerious Eats / Morgan Hunt Glaze\nIf desired, slice chicken on a sharp bias and transfer to individual serving plates. Serve sauce with chicken.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\n12-inch stainless steel or enameled cast-iron skillet\nNotes\nTo debone chicken breasts, slide your knife between the breastbone and the tenderloin, making sure to slice as close to the bone as possible. Work your knife as deeply along the bone as you can, pulling up on the meat with your other hand.\nIf you don't have white miso paste, you can use any other type of miso paste. Though the sauce will be slightly less flavorful and have a bit less body, the miso paste can also be omitted. Note that you may need to season to taste with additional salt if you omit the miso.\nMake-Ahead and Storage\nThe raw chicken can be rubbed with the lemon-zest oil mixture and seasoned with salt and pepper and refrigerated uncovered up to 24 hours ahead of cooking.\nThis chicken and sauce is best enjoyed right away, but the chicken and sauce can be refrigerated separately in airtight containers for up to 2 days. Reheat the chicken in a 350℉ (175℃) oven until just warmed through. Gently reheat sauce in a saucepan over low heat on the stovetop, whisking constantly.\nChicken Mains\nThe Latest\nChicken Breast",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-skillet-lemon-chicken.webp?"
}