{
  "url": "https://www.seriouseats.com/orecchiette-with-broccoli-and-toasted-hazelnuts-recipe-7507873",
  "image_url": "https://www.seriouseats.com/thmb/6FUEq6wujR1UuafRYAhmP0kuC0Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230530-SEA-Broccoliorecchiette-AmandaSuarez-16-a005aec0dcd1443f9dce2c4f1a7f7019.jpg",
  "tags": [
    "Pastas",
    "The Latest",
    "Vegetarian",
    "Vegetarian Mains",
    "Broccoli"
  ],
  "title": "Orecchiette With Broccoli and Toasted Hazelnuts",
  "full_text": "Orecchiette With Broccoli and Toasted Hazelnuts\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n1 1/2\npounds\n(\n680\ng\n)\nbroccoli\n(about\n2\nlarge\nheads\n), florets cut into roughly 1-inch pieces, thick stems\nreserved for another use\nKosher salt\n2\nmedium\ncloves garlic\n, minced\nPinch\nred pepper flakes\n1\ncup\n(\n237\nml\n)\nheavy cream\n1/2\nteaspoon\nturmeric powder\n1\npound\n(\n454\ng\n) orecchiette\npasta\n1/2\ncup\nfinely grated\nParmigiano-Reggiano\n(\n1\nounce\n;\n28\ng\n), plus more for serving\n1/2\ncup\ntoasted\nblanched\nhazelnuts\n(\n2 1/2\nounces\n;\n70\ng\n), coarsely chopped\nDirections\nIn a medium Dutch oven or large sauté pan, heat oil over high heat until just smoking. Add half the broccoli, season lightly with salt, and cook, stirring occasionally, until well browned on at least one side, about 5 minutes. Lower heat to medium-low, stir in remaining broccoli, and season lightly with salt. Stir in garlic and red pepper flakes and cook until garlic is fragrant, about 30 seconds.\nSerious Eats / Amanda Suarez\nAdd heavy cream along with 1 cup (240ml) water and the turmeric, bring to a simmer over medium-high heat. Cover and cook until broccoli is very tender, about 10 minutes. Remove from heat.\nSerious Eats / Amanda Suarez\nMeanwhile, bring a large pot of salted water to a boil. Add orecchiette and cook until just shy of al dente (1 to 2 minutes fewer than package directions). Drain pasta, reserving 1/2 cup (120ml) pasta water.\nSerious Eats / Amanda Suarez\nAdd orecchiette to pasta sauce and cook over medium-high heat, stirring constantly, until pasta is al dente and sauce is thickened and coats noodles, but is still liquid enough to pool in the bottom of the pot, about 2 minutes. Add more water, in 1/4 cup (60ml) increments as needed, to achieve desired consistency (keep in mind, it will thicken even more once cheese is stirred in).\nSerious Eats / Amanda Suarez\nRemove from heat, add Parmigiano-Reggiano, and stir vigorously to incorporate. Season with salt to taste. Divide between warmed serving bowls, topping each portion with toasted hazelnuts and additional grated cheese. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nDutch oven\nNotes\nBlanched hazelnuts have had their skins removed. Hazelnut skins can lend dishes an unpleasant bitter flavor. If you can’t find blanched nuts, you can toast the hazelnuts in an oven preheated to 325ºF (160ºC) for several minutes, then wrap the nuts in a kitchen towel and rub them together until the skins come off.\nPastas\nThe Latest\nVegetarian\nVegetarian Mains\nBroccoli"
}