{
  "url": "https://www.seriouseats.com/orecchiette-con-le-cime-di-rapa",
  "image_url": "https://www.seriouseats.com/thmb/SUKecRVb2-JHFoH-P4iWPOEU6Zc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210226-cime-di-rapa-sasha-marx-16-c1f0977cd5e84df982eb7d936aa8a82a.jpg",
  "tags": [
    "Pasta Mains",
    "Pastas",
    "Italian",
    "Stovetop Pasta",
    "Quick Dinners"
  ],
  "title": "Orecchiette con le Cime di Rapa (Apulian Orecchiette With Broccoli Rabe) Recipe",
  "full_text": "Orecchiette con le Cime di Rapa (Apulian Orecchiette With Broccoli Rabe) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n65 mins\nActive\n30 mins\nCooling Time\n10 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Breadcrumbs:\n4\nounces\n(\n115\ng\n)\nrustic bread\n, cut into 3/4- to 1-inch pieces\n1\ngarlic\nclove\n(\n5\ng\n), minced\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\nFor the Pasta:\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n4\nanchovy\nfillets\n(\n5\ng\n)\n3\ngarlic\ncloves\n(\n15\ng\n), minced\n1/2\nteaspoon\nred pepper flakes\n12\nounces\n(\n340\ng\n)\ndried orecchiette\n1\npound\n(\n450\ng\n)\nbroccoli rabe\n(rapini), leaves and florets picked from stalks, stalks discarded or reserved for another use (see note)\nDirections\nFor the Toasted Breadcrumbs:\nIf using fresh or lightly stale bread, adjust oven rack to middle position, and preheat oven to 325°F (165°C). (If using fully stale and dried bread, skip baking step.) Arrange bread in single layer on rimmed baking sheet, and bake until completely dried, 20 to 30 minutes. Remove from oven, and allow to cool to room temperature, about 5 minutes. Transfer bread to food processor bowl (set aside but don't clean rimmed baking sheet), and pulse until reduced to small crumbs, taking care not to over-process into a fine powder, 8 to 10 pulses.\nCombine breadcrumbs, garlic, and 2 tablespoons (30ml) oil in a large skillet, and cook over medium-low heat, stirring and tossing occasionally, until crisp and golden brown, 8 to 10 minutes. Season with salt and pepper to taste. Transfer toasted breadcrumbs to reserved rimmed baking sheet, spread into an even layer, and set aside to cool to room temperature. Wipe out skillet.\nSerious Eats / Sasha Marx\nFor the Pasta:\nBring a large pot of salted water to a boil over high heat. Meanwhile, combine 1/4 cup (60ml) oil, anchovies, and garlic in now-empty skillet. Cook over medium-low heat, stirring and breaking up anchovies occasionally with a wooden spoon, until anchovies have dissolved and garlic has softened and is just beginning to turn lightly golden, about 5 minutes. Add red pepper flakes and continue to cook, stirring, until fragrant, about 30 seconds. Remove skillet from heat.\nSerious Eats / Sasha Marx\nAdd broccoli rabe to boiling water and cook, stirring frequently to keep submerged, until floret stems are barely tender and leaves have softened, about 1 minute. Using a spider skimmer, fine-mesh strainer, or large slotted spoon, drain rabe while keeping boiling water in the pot; transfer rabe to a plate and set aside.\nSerious Eats / Sasha Marx\nAdd orecchiette to boiling water and cook, stirring frequently for first 30 seconds to prevent pasta from sticking. Once pasta has cooked for 5 minutes, transfer 1 cup (240ml) of pasta cooking water to skillet; continue cooking pasta. Return skillet to high heat and bring to a boil, swirling pan and stirring constantly until cooking water emulsifies with olive oil-anchovy mixture, 1 to 2 minutes. Reduce heat to low while pasta finishes cooking to prevent liquid from over-reducing.\nSerious Eats / Sasha Marx\nMeanwhile, continue cooking pasta until it is softened on the exterior, but well shy of al dente and still uncooked in the center (about 3 minutes less than the package directions). Using a spider skimmer, transfer pasta to skillet along with reserved broccoli rabe. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 2 cups (475ml) pasta cooking water.\nSerious Eats / Sasha Marx\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is thickened and coats noodles, 2 to 3 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed. At this point, the sauce should just pool around the edges of the pan; it will continue to tighten up in the time it takes to plate and serve, so make sure it's a little looser than the ideal serving consistency. Season with salt to taste.\nSerious Eats / Sasha Marx\nRemove from heat, divide pasta between individual serving bowls, drizzle generously with olive oil, sprinkle with breadcrumbs, and serve right away.\nSpecial Equipment\nFood processor\n,\nlarge skillet\n,\nfine-mesh strainer\nor\nspider skimmer\nNotes\nIn Italy, toasted breadcrumbs are traditionally made with pangrattato—breadcrumbs made by processing stale bread. This recipe is written with instructions for making breadcrumbs from fresh or stale bread. We used a rustic sourdough loaf during recipe testing, but most types of crusty white bread will work fine.\nThis dish is best made with just the delicate leaves and florets of broccoli rabe; the fibrous stalks are discarded. If you don’t want to discard the stalks, you can use them for another purpose: Trim the ends, cut the stalks into 1 to 2 inch lengths and roast or sauté them with other vegetables. Or thinly slice them, sauté in olive oil, and fold them into omelettes or scrambled eggs. They can also be turned into a slightly bitter but delicious purée: Cook stalks in salted boiling water until tender, then blend with olive oil, lemon juice, and salt until smooth. The purée can be used as-is or mixed with ricotta as a pasta sauce of its own.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately. Leftover toasted breadcrumbs can be stored in an airtight container at room temperature for up to 1 week.\nRead More\nPasta chi Vruoccoli Arriminati (Sicilian Pasta With Cauliflower and Toasted Breadcrumbs)\nOrecchiette con Salsiccia e Cime di Rapa (Orecchiette With Sausage and Broccoli Rabe)\nPasta Alla Zozzona (Rigatoni With Sausage, Guanciale, and Egg Yolks)\nPasta Mains\nPastas\nItalian\nStovetop Pasta\nQuick Dinners",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/orecchiette-con-le-cime-di-rapa-apulian-orecchiette-with-broccoli-rabe-recipe.webp?"
}