{
  "url": "https://www.seriouseats.com/outdoor-pizza-oven-burst-cherry-tomato-pizza-5211774",
  "image_url": "https://www.seriouseats.com/thmb/RWpdPywBHPpOGdVZJx94qHaqABY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211115-OONI-PIZZA-BURSTTOMS-ANDREW-JANJIGIAN-36-7cabeaab30af44108b541f144c0a19de.jpg",
  "tags": [
    "Pizza",
    "Italian",
    "Tomato",
    "The Latest"
  ],
  "title": "Outdoor Pizza Oven Burst Cherry Tomato, Shallot, and Herb Pizza",
  "full_text": "Outdoor Pizza Oven Burst Cherry Tomato, Shallot, and Herb Pizza\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nRising Time\n60 mins\nTotal\n105 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\npizza dough for an outdoor pizza oven\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n2\nmedium\nshallots\n(\n40\ng\n), thinly sliced crosswise into rings\n4\nmedium\ngarlic cloves\n(\n20\ng\n), thinly sliced\n1/2\nteaspoon\nred pepper flakes\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt, use half as much by volume\n2\npints\n(\n1 1/2\npounds\n;\n675\ng\n)\ncherry tomatoes\n, halved if large\n6\nsprigs\nfresh thyme\n3\nsprigs\nfresh rosemary\n2\nounces\n(\n60\ng\n) finely grated\nparmesan cheese\n12\nounces\n(\n340\ng\n)\nfresh mozzarella\n, torn into 3/4-inch pieces and patted dry\n2\ntablespoons chopped\nfresh parsley leaves\nand tender stems\nDirections\nRemove dough from refrigerator and allow to rest in proofing containers, covered, at room temperature for 1 to 2 hours before baking. Dough temperature should reach 60°F (15.5°C) before stretching and baking; exact timing will depend upon ambient temperature.\nSerious Eats / Melissa Rivard\nHeat pizza oven to 800°F (425°C). While oven heats, in a 10-inch stainless steel, cast iron, or carbon steel skillet, combine oil, shallots, garlic, and red pepper flakes and toss to combine. Set skillet in pizza oven and cook, stirring frequently, until shallots are softened, 2 to 4 minutes. Add tomatoes, thyme, rosemary, and 1/4 cup (60ml) water to skillet and toss to combine. Return to oven and cook, stirring frequently, until tomatoes burst and are lightly charred on edges, 5 to 7 minutes. Transfer mixture to a medium bowl and set aside to cool slightly (sauce will thicken as it cools). Remove and discard herb sprigs.\nSerious Eats / Melissa Rivard\nWhen ready to bake, coat one dough ball generously on both sides with flour and place on well-floured surface, seam side down. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough into a 10- or 12-inch circle (final dimension depends upon the size of your oven) about 1/4-inch thick by draping over knuckles and gently stretching. Transfer to floured wooden or perforated metal pizza peel.\nSerious Eats / Melissa Rivard\nWorking quickly, spread an even layer of tomato sauce over pizza, leaving outer 1/2-inch rim untopped. Spread Parmesan evenly over sauce, followed by mozzarella.\nSerious Eats / Melissa Rivard\nTransfer pizza to oven and bake, rotating pie regularly with a metal peel for even cooking, until rim is lightly charred and bottom is crisp, 90 to 180 seconds total. Retrieve pizza with a metal peel and transfer to a cutting board. Sprinkle with parsley, slice, and serve immediately.\nSerious Eats / Melissa Rivard\nRepeat steps 3 through 5 for remaining pizzas.\nSpecial Equipment\nHigh-temperature outdoor pizza oven\n,\nimmersion blender\n,\nwooden or perforated metal pizza peel\n, metal pizza peel.\nNotes\nBe careful not to over reduce the sauce in the skillet; it should remain “saucy” before it goes onto the pizza.\nMake-Ahead and Storage\nThe pizzas are best enjoyed immediately. Because the sauce is made in the pizza oven as it heats up for baking the pies, there's no real advantage to making it in advance. That said, it\ncan\nbe made in advance, and refrigerated in an airtight container for up to 3 days. Bring to room temperature before using.\nPizza\nItalian\nTomato\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/outdoor-pizza-oven-burst-cherry-tomato-shallot-and-herb-pizza.webp?"
}