{
  "url": "https://www.seriouseats.com/oxtail-marmalade-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rDdXDeA8d6ompJEFc8o1bcdk2XE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__08__20120806-nasty-bits-oxtail-marmalade-bread-92766bb5718a4c5392f7703c04063d36.jpg",
  "tags": [
    "Oxtail"
  ],
  "title": "Oxtail Marmalade Recipe",
  "full_text": "Oxtail Marmalade Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 hrs 15 mins\nActive\n2 hrs\nCooling Time\n5 mins\nTotal\n5 hrs 30 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\npounds\noxtail\n, trimmed of fat\n6\ncups\ndry red wine\n1\nhead\ngarlic\n, halved crosswise\n1/2\nbunch\nfresh thyme\nor oregano\n1\ntablespoon\nblack peppercorns\n8\ntablespoons\n(\n1\nstick\n)\nunsalted butter\n3\ntablespoons\nall-purpose flour\n1 1/2\npounds\ncarrots\n, peeled, trimmed, and cut into 1/4-inch cubes (about\n4\ncups\n)\n1\npound\nshallots\nor onions, peeled and finely diced\nKosher salt\nand freshly ground black pepper\n1/3\ncup\ngranulated sugar\n1/3\ncup\nbrown sugar\n1\ncup\nred wine vinegar\nToasted\nrounds of\nbread\nfor serving with the oxtail marmalade\nDirections\nPlace the oxtail, 4 cups of the red wine, garlic, thyme, and peppercorns in a large pot or sauté pan. Add water to cover by 1/2 inch. Bring the mixture to a boil, reduce the heat, and simmer until meat is falling off bones, about 3 hours.\nTransfer the oxtail to a bowl; when cool enough to handle, remove the meat from the bones and cut it roughly into small cubes, about 1/2-inch. Refrigerate the meat until it's ready to use.\nStrain the oxtail stock into a large skillet, discarding the solids. Bring the liquid to a boil over high heat; reduce the heat to medium and simmer until the mixture is reduced to 3 cups, about 1 hour.\nWhile the stock reduces, combine 3 tablespoons of the butter with the flour until it forms a paste. Over medium heat, whisk the paste, 1 tablespoon at a time, into the reduced liquid. Cook until the mixture thickens slightly, about 3 minutes. Remove from heat and set aside.\nIn a separate large skillet, melt the remaining 5 tablespoons butter over medium heat. Add the carrots, shallots, and a pinch of salt and cook until slightly softened, about 15 minutes. Stir in the sugars, the remaining red wine, the vinegar, the 1 1/2 teaspoons salt, and the pepper. Cook over medium-high heat stirring frequently until the liquid has completely evaporated, about 45 minutes.\nStir in the oxtail meat and thickened oxtail stock. Season to taste with salt and pepper. Set aside or transfer the marmalade to an airtight container and refrigerate overnight. Before serving, reheat in a saucepan over medium heat until warmed through, and served with toasted rounds of bread.\nSpecial equipment\n4 quart saute pan\nThis Recipe Appears In\nThe Nasty Bits: Oxtail Marmalade\nOxtail"
}