{
  "url": "https://www.seriouseats.com/oyster-stuffing-recipe-8749912",
  "image_url": null,
  "tags": [
    "Oysters",
    "Thanksgiving Side Dishes",
    "Seafood",
    "Thanksgiving",
    "Thanksgiving Stuffings"
  ],
  "title": "Oyster Stuffing",
  "full_text": "Oyster Stuffing\nJump to recipe\nPrep\n15 mins\nCook\n110 mins\nSoaking and Cooling Time\n10 mins\nTotal\n2 hrs 15 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2 pounds soft Italian or\nFrench bread\n(\n24\nounces\n; about 2 loaves), cut into 3/4-inch dice, about 4 quarts\n1 stick\nunsalted butter\n(4 ounces;\n113\ng\n), plus more for greasing dish\n1 pound (\n454\ng\n)\nsweet Italian sausage\n, removed from casing\n1 large yellow\nonion\n, finely chopped (\n300\ng\n; about 2 cups)\n2 large ribs\ncelery\n, finely chopped (\n120\ng\n; about 1 cup)\n1 small\nfennel bulb\n, finely chopped (\n180\ng\n; about 1 cup)\n2 medium\ncloves garlic\n(\n10\ng\n), minced\n1\nteaspoon\nminced\nfresh thyme\nleaves\n2 1/2\ncups\n(600ml) homemade\nchicken stock\nor low-sodium broth, divided\n3\nlarge\neggs\n2\ntablespoons\nminced\nfresh tarragon\n1/4 cup minced\nflat-leaf parsley leaves\n(about 1/4 ounce;\n8\ng\n), divided\n2 cups raw\noysters\nand their liquor (470ml; about\n32\nmedium\nor 20 large oysters), oysters chopped (see notes)\nKosher salt\nand freshly ground black pepper\nDirections\nAdjust oven racks to lower-middle and upper-middle positions. Preheat oven to 275°F (135ºC). Spread bread evenly over 2 rimmed baking sheets. Stagger sheets on oven racks and bake until bread is completely dried, about 45 minutes total, rotating sheets and stirring bread cubes several times during baking. Remove from oven and allow to cool, about 15 minutes. Adjust rack to middle position and increase oven temperature to 350°F (175ºC).\nWhile bread cools, melt butter in a large Dutch oven over medium-high heat until foaming subsides, without allowing butter to brown, about 3 minutes. Add sausage and, using a stiff whisk or potato masher, break sausage up into fine pieces (largest pieces should be no bigger than 1/4 inch). Cook, stirring frequently, until only a few bits of pink remain, about 5 minutes. Add onion, celery, fennel, garlic, and thyme and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add 2 cups chicken stock.\nIn a medium bowl, whisk remaining 1/2 cup chicken stock, eggs, tarragon, and 3 tablespoons parsley in a medium bowl until homogeneous. Stirring constantly with a wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes, oysters, and oyster liquor and fold gently until evenly mixed. Season lightly with salt and pepper.\nLet stand, stirring occasionally, until bread has absorbed liquid, 5 to 10 minutes. Transfer stuffing to a buttered 9- by 13-inch rectangular baking dish (or 10- by 14-inch oval dish) Bake until browned on top and an instant read-thermometer reads 150°F (65ºC) when inserted into center of dish, about 45 to 50 minutes. Remove from oven, let cool for 5 minutes, sprinkle with remaining parsley, and serve.\nSpecial Equipment\nTwo rimmed baking sheets, stiff wire whisk or potato masher, 9- by 13-inch rectangular baking dish (or 10- by 14-inch oval dish), instant-read thermometer\nNotes\nYou can shuck your own fresh oysters (see the video above for instructions), ask your fishmonger to do it, or buy containers of raw shucked oysters. Our tests showed that the stuffing tastes just as good with pre-shucked oysters as with freshly shucked. The easiest way to chop the oysters is to snip them in a container using kitchen shears; that way you don't lose their juices to the cutting board.\nMake-Ahead and Storage\nThe bread can be dried and, once cooled, stored in an airtight container or zip-top bag at room temperature.\nThe onion, celery, fennel, and garlic can be chopped up to 2 days in advance and refrigerated in an airtight container.\nThe stuffing can be prepared through step 3 and refrigerated up to 1 day in advance. Transfer mixture to buttered dish, cover tightly with plastic wrap, and refrigerate. Remove stuffing from refrigerator 30 minutes before baking.\nThe stuffing can be baked, and, once cooled, covered with foil or plastic wrap and refrigerated for up to 3 days. Reheat in a 350ºF (175ºC) oven, covered with foil, until warmed through. Uncover during the last few minutes of cooking to re-crisp the top.\nOysters\nThanksgiving Side Dishes\nSeafood\nThanksgiving\nThanksgiving Stuffings"
}