{
  "url": "https://www.seriouseats.com/oysters-rockefeller",
  "image_url": "https://www.seriouseats.com/thmb/x9AihfFKuGHqe-0knmlHsrFaZLY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181115-oysters-rockefeller-vicky-wasik-26-d0d9dc7a970441c58cf5455a3a204475.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "New Years",
    "Fall Snacks & Appetizers",
    "Christmas Appetizers",
    "American"
  ],
  "title": "Oysters Rockefeller Recipe",
  "full_text": "Oysters Rockefeller Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n35 mins\nMarinating Time\n30 mins\nTotal\n55 mins\nServes\n24 oysters\nCook Mode\n(Keep screen awake)\nIngredients\n8\ntablespoons\n(\n4\nounces\n;\n115\ng\n)\nunsalted butter\n, softened and divided\n2\nlarge\nshallots\n(\n4\nounces\n;\n115\ng\n), thinly sliced\n2\ncelery\nribs\n(\n3 1/2\nounces\n;\n100\ng\n), thinly sliced, plus\n1/4\ncup\n(\n1/4\nounce\n;\n6\ng\n)\ncelery leaves\n, divided\n1/2\nfennel\nbulb\n(\n3 1/2\nounces\n;\n100\ng\n), cored and thinly sliced, fronds reserved\n4\nmedium\ngarlic cloves\n, thinly sliced\n3\nscallions\n(\n2\nounces\n;\n60\ng\n), white and green parts divided and thinly sliced\nKosher salt\n1\ntablespoon\n(\n15\nml\n)\nabsinthe\n(optional, see notes)\n3\ncups\n(\n1 1/2\nounces\n;\n40\ng\n)\nfresh parsley leaves\n1/2\ncup\n(\n1\nounce\n;\n30\ng\n)\npanko bread crumbs\nRock (ice cream) salt\n(see notes)\n24\nfresh oysters\n,\nscrubbed\nLemon wedges\n, for serving\nDirections\nIn a medium (3-quart) saucepan, heat 4 tablespoons butter over medium heat until foaming. Add shallots, sliced celery ribs, fennel bulb, garlic, scallion whites, and a generous pinch of salt. Cook, stirring occasionally, until vegetables are soft, have released all their liquid, and liquid has evaporated, about 10 minutes. Off heat, stir in absinthe. Transfer mixture to food processor bowl.\nSerious Eats / Vicky Wasik\nProcess vegetables, scraping down sides of food processor bowl as needed, into a coarse paste, about 30 seconds. Stop processor and add parsley, celery leaves, fennel fronds, and scallion greens to food processor bowl. Continue processing until herbs are broken down and well-combined with vegetable mixture, about 30 seconds. With food processor still running, gradually add remaining 4 tablespoons butter, making sure butter is emulsified into paste before adding more. Stop processor and add panko bread crumbs. Pulse mixture until bread crumbs are fully incorporated. Season to taste with salt, erring on the side of less salt, since the oysters are briny. Transfer mixture to disposable pastry bag or small mixing bowl, and set aside. If using a mixing bowl, cover with plastic wrap, pressing plastic against surface of the paste to prevent skin from forming. If not serving immediately, mixture can be stored in refrigerator for up to 1 day; let sit at room temperature to soften before using, about 30 minutes.\nSerious Eats / Vicky Wasik\nAdjust oven rack to 6 inches below the broiler element and preheat the broiler on high. Line rimmed baking sheet with an even 1/2-inch layer of rock salt.\nShuck oysters\nand arrange them on prepared baking sheet. Pipe or spoon butter topping over oysters, and then use an offset spatula or butter knife to smooth topping and fully cover each oyster.\nSerious Eats / Vicky Wasik\nBroil oysters, checking them frequently, until topping begins to brown and oysters are warmed through, 4 to 6 minutes. Serve immediately, passing lemon wedges at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel saucier\n,\nfood processor\n,\nrimmed baking sheet\nNotes\nAbsinthe is the original booze of choice for making oysters Rockefeller, but you can substitute other anise-flavored liqueurs, such as Pernod or Herbsaint. You can also leave alcohol out entirely.\nIf you don't have rock salt, don't fret. A scrunched-up piece of aluminum foil can also hold the oysters in place on the baking sheet during the broiling step. For serving, mix a couple lightly beaten egg whites with kosher salt to form a wet paste that you can perch the finished oysters on.\nMake-Ahead and Storage\nTopping can be refrigerated overnight. Always keep plastic pressed directly against the surface of the topping when storing it, to avoid allowing a skin to form. Let topping sit at room temperature for 30 minutes to fully soften before using it.\nRead More\nOysters Oaxacafeller Recipe\nHors D'Oeuvres\nNew Years\nFall Snacks & Appetizers\nChristmas Appetizers\nAmerican"
}