{
  "url": "https://www.seriouseats.com/ozoni-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/tWsIzSsosU__dp4EL19GBw_mnTE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__12__20191217-ozoni-japanese-new-years-soup-vicky-wasik-6-88780b7109f04a68a2a46a23a6d80598.jpg",
  "tags": [
    "Soups",
    "Japanese",
    "Stovetop",
    "Chicken Thighs",
    "Vegetables"
  ],
  "title": "Ozoni With Mochi, Chicken, and Vegetables (Japanese New Year's Soup)",
  "full_text": "Ozoni With Mochi, Chicken, and Vegetables (Japanese New Year's Soup)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nActive\n2 hrs\nChilling Time\n60 mins\nTotal\n2 hrs 5 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nboneless, skinless chicken thighs\n(about\n6 ounces; 170 g\neach), cut into 3/4-inch pieces\n2\ntablespoons\n(\n30\nml\n) dry\nsake\n1\nteaspoon\nkosher salt\n, plus more as needed\n1\nounce\n(\n30\ng\n) sliced or whole\ndried shiitake mushrooms\n1/3\nounce\n(\n10\ng\n)\nkombu\n(about\n2\n(\n6- by 2-inch\n) pieces)\n2\nquarts\n(\n2\nliters\n) warm\nwhite\nor\nbrown\nchicken stock,\nlow-sodium chicken broth\n, or water (see note)\n1\n(\n4-ounce; 115 g) bunch\nspinach\n, washed well\n1\n(\n3 1/2 ounce; 100 g\n) piece\nburdock root\n, peeled, julienned, and held in water acidulated with lemon juice\n1\n(\n3 1/2 ounce; 100 g\n)\nlotus root\n, peeled, sliced crosswise about 2mm thick, and held in water acidulated with lemon juice (optional)\n1\nlarge (\n4 1/2 ounces; 125 g\n)\ncarrot\n, peeled and sliced into 1/16-inch (1.5mm) thick rounds (cut with a channel knife to look like flowers, if desired)\n1\nsmall (\n4 1/2 ounces; 125 g\n)\ndaikon\n, peeled and sliced into 1/16-inch (1.5mm) thick rounds (cut with a channel knife to look like flowers, if desired)\nLarge\npinch\nbonito flakes\n(katsuobushi)\n2\nteaspoons\n(\n10\nml\n)\nlight\n(usukuchi) or dark (koikuchi) Japanese\nsoy sauce\n, plus more as needed\n8\nslices\nnaruto kamaboko\n(Japanese white fish cake with pink swirl), each about 2mm thick\n3\nrectangular\npieces\nof\nkiri mochi\n, each split into\n4\npieces\nalong scored lines (see note)\n8\nsprigs\nmitsuba\n(Japanese parsley; optional)\nThinly sliced\nscallions\n, for garnish\nZest of half a\nfresh yuzu, Meyer lemon, or regular\nlemon\nDirections\nIn a small bowl, stir together chicken, sake, and 1 teaspoon kosher salt. Refrigerate for 1 hour.\nIn a 3-quart saucepan, cover shiitake mushrooms and kombu with the warm stock or water. Let stand 30 minutes.\nSerious Eats / Vicky Wasik\nMeanwhile, bring a medium pot of water to a rolling boil and set up an ice bath. Add spinach and boil until tender, about 30 seconds. Using a slotted spoon or strainer, transfer spinach to ice bath to chill. Remove from ice bath, squeeze out excess water, then roughly chop. Set aside.\nReturn water to a boil, add burdock root, and cook until just tender, about 2 minutes. Transfer burdock to ice bath, then remove from ice bath and set aside in a small bowl. Add lotus root, if using, to the boiling water and cook until crisp-tender, about 2 minutes. Shock in ice bath, then transfer to another small bowl and set aside.\nAdd carrot and daikon to boiling water and cook until just tender, about 1 minute. Shock in ice bath, then drain and reserve in a small bowl.\nSet pot with shiitake mushrooms and kombu over medium heat and bring to a gentle simmer. Remove kombu (you can save it for another use). Add bonito flakes and allow to simmer for 5 minutes. Remove from heat and let stand 5 minutes. Strain broth through fine-mesh strainer into a heatproof container. Rinse out saucepan, then return strained broth to saucepan.\nSerious Eats / Vicky Wasik\nAdd soy sauce to broth, then taste, adding more if desired; you can also season with some salt if you want more sodium without a stronger soy flavor.\nReturn broth to a gentle simmer. Drain chicken of excess liquid, then add to broth and cook for 2 minutes. Add sliced fish cake and cook for 1 minute longer. Reduce heat to the barest simmer to keep warm.\nHeat a medium cast iron skillet over medium-high heat for 2 minutes. Add dry mochi pieces to skillet and cook, turning every 30 seconds, until puffed and golden on both sides; adjust heat as needed to develop a nice color on the mochi without burning it.\nSerious Eats / Vicky Wasik\nDivide mochi among 4 serving bowls. Arrange burdock root, lotus, spinach, carrot, daikon, chicken, and fish cake in each bowl. Ladle hot broth into each bowl. Garnish with mitsuba, scallions, and citrus zest. Serve.\nSpecial Equipment\nFine-mesh strainer\n,\n3-quart saucepan\n,\ncast iron skillet\nNotes\nChicken stock isn't traditional in ozoni, but it was an aspect of Maiko Kyogoku's family recipe we found added a lot of depth. Feel free to use water instead. If you do use chicken stock, you can use any you happen to have on hand, though we particularly like making a very simple and clean version of it for this soup with just the chicken parts, onions, and garlic while omitting carrot, celery, and herbs.\nKiri mochi are sold as hard, dried blocks wrapped in plastic packaging; they are often scored along one surface, making it possible to split each block into four pieces.\nMake-Ahead and Storage\nThe broth base (all the way through seasoning with soy sauce) can be made up to three days in advance; keep refrigerated and return to a simmer before cooking chicken and fish cake. The blanched vegetables can all be blanched up to one day in advance and kept refrigerated until ready to use.\nRead More\nHomemade Yakimochi (Grilled Mochi With Soy Sauce & Nori) Recipe\nSoups\nJapanese\nStovetop\nChicken Thighs\nVegetables",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ozoni-with-mochi-chicken-and-vegetables-japanese-new-years-soup.webp?"
}