{
  "url": "https://www.seriouseats.com/pachola-smash-burger-recipe-11752060",
  "image_url": "https://www.seriouseats.com/thmb/INR6LakwD3EzpomAjKwZXdHpF6c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250609-SEA-PacholaSmashBurger-LarisaNiedle-15-15fc4f505b0b47d3a6c48acb32070b5f.jpg",
  "tags": [
    "Burgers",
    "The Latest",
    "Recipes",
    "Mains",
    "Ground Beef"
  ],
  "title": "This 10-Minute Mexican-Inspired Smash Burger Is Even Better Than Taco Night",
  "full_text": "This 10-Minute Mexican-Inspired Smash Burger Is Even Better Than Taco Night\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nTotal\n20 mins\nServes\n2\nMakes\n2 burgers\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nloosely packed fresh\ncilantro leaves\n1\ntablespoon\n(\n15\nml\n)\nlime juice\n, from one lime\n1\nteaspoon\n(\n5\nml\n)\nvegetable oil\n, divided\n8\nounces\n(\n220\ng\n)\nground beef\n, divided into\n4\n(2-ounce; 55 g)\nballs\nKosher salt and freshly ground black pepper\n1/4\nteaspoon\nground cumin\n, divided\n1/4\nteaspoon\ndried Mexican oregano\n, divided\n1/4\n(\n30\ng\n)\nsmall\nwhite onion\n, very thinly sliced or finely shaved on a mandoline\n2\nserranos\n(\n14\ng\n), very thinly sliced or finely shaved on a mandoline\n2\nslices\nwhite melting cheese\n, such as Monterey Jack\n2\nbrioche hamburger buns\n, buttered and toasted\nDirections\nIn a small bowl, combine cilantro with lime juice. Set aside.\nSerious Eats/ Niedle Creative\nAdd 1/2 teaspoon oil to a 12-inch stainless steel, carbon steel, or cast iron skillet and spread over entire surface with a paper towel. Set skillet over medium heat and allow to preheat for 5 minutes. Increase heat to high and heat until skillet is smoking, about 1 minute. Place two beef balls in pan and smash down with a stiff metal spatula. Smashed patties should be slightly wider than burger bun. Season with salt, pepper, 1/8 teaspoon ground cumin, and 1/8 teaspoon oregano. Immediately add all of chile slices, followed by all of the onion slices, dividing them evenly between both patties. Use a spatula to press topping firmly into meat.\nSerious Eats/ Niedle Creative\nCook until bottom of patties turn brown and crispy, about 1 minute. Using the back side of a stiff metal spatula, scrape patties from pan, making sure to get all of the browned bits then working with 1 patty at a time, slide spatula under patty, and secure toppings with a second spatula, and flip. Repeat with second patty.\nSerious Eats/ Niedle Creative\nCook until chiles and onions soften and burgers are cooked through, about 30 seconds.\nSerious Eats/ Niedle Creative\nDivide dressed cilantro leaves onto the base of both buns. Transfer 1 cooked patty with onions and chiles to cilantro leaves on each bun base.\nSerious Eats/ Niedle Creative\nWipe skillet clean with paper towels and set skillet over high heat, add remaining 1/2 teaspoon oil, and heat until just smoking. Place remaining 2 beef balls in skillet and smash down with a stiff metal spatula. Smashed patties should be slightly wider than burger bun. Season with salt, pepper, remaining 1/8 teaspoon ground cumin and remaining 1/8 teaspoon oregano.\nSerious Eats/ Niedle Creative\nCook until bottom of patties turns brown and crispy, about 1 minute. Using the back side of a stiff metal spatula, scrape patties from pan, making sure to get all of the browned bits. Flip patties and top each patty with 1 slice of cheese. Cook until bottoms are browned and cheese is melted, about 30 seconds. Transfer to top of other cooked patties. Close each assembled burger with bun top and serve.\nSerious Eats/ Niedle Creative\nSpecial Equipment\nLarge stainless steel, cast iron skillet, or carbon steel skillet, stiff thin metal spatula, mandoline (optional)\nMake-Ahead and Storage\nThese burgers are best eaten right away.\nBurgers\nThe Latest\nRecipes\nMains\nGround Beef",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-10-minute-mexican-inspired-smash-burger-is-even-better-than-taco-night.webp?"
}