{
  "url": "https://www.seriouseats.com/pad-thai-recipe-11680356",
  "image_url": "https://www.seriouseats.com/thmb/gLZ3ZlKXVTGpgspZvvS8Afnw2TA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250214-SEA-PadThai-AmandaSuarez-hero-4251c730d61a40ba935f2d43153d6862.jpg",
  "tags": [
    "Noodle Mains",
    "The Latest",
    "Thai",
    "Stir-Fry Noodles"
  ],
  "title": "Pad Thai",
  "full_text": "Pad Thai\nClose\nJump to recipe\nCook\n40 mins\nTotal\n40 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Rice Noodles:\n4\nounces\n(\n113\ng\n)\ndried medium rice noodles\nFor the Pork:\n4\nounces\n(\n112\ng)\npork shoulder\n, sliced very thinly into roughly 1- by 1 1/2-inch pieces (1/2 cup) (see notes)\n2\nteaspoons\n(\n10\nml\n)\nfish sauce\nPinch\nof\ngranulated sugar\nFor the Sauce:\n2\ntablespoons\n(\n40\ng)\npalm sugar\n2\ntablespoons\n(\n35\ng\n)\ntamarind concentrate\n(see notes)\n2\ntablespoons\nplus\n1\nteaspoon\n(\n35\nml\n)\nfish sauce\nFor the Stir-Fry:\n2\ntablespoons\nplus\n1\nteaspoon\n(\n35\nml)\nneutral\noil\nsuch as\ncanola oil\nMarinated\npork,\nfrom above\n70\ng\npressed tofu\n, cut into 1- by 1/2- by 1/4-inch pieces (\n1/2\ncup)\n2\npacked\ntablespoons\n(25\ng\n)\nsweet preserved radish\n2\ntablespoons\n(\n10\ng\n) small or medium\ndried shrimp\n1\nsmall\nAsian\nshallot\n(\n20\ng\n), cut into 1/4-inch dice\n1\nlarge\negg\nRehydrated\nrice noodles,\nfrom above\nSauce\n, from above\n1\ntablespoon\nplus\n2\nteaspoons\n(\n25\ng\n)\nwater,\nplus more as needed\n1 1/2\nounces\n(\n40\ng\n)\nChinese flat garlic chives,\ncut into 1 1/2–inch pieces (1 cup), divided\n2\ncups\n(\n80\ng\n)\nmung bean sprouts\n, divided\n3\ntablespoons\n(\n25\ng\n) crushed unsalted\ndry-roasted peanuts\n, plus more for serving\nLime\nwedges,\nfor serving\nThai\nchile powder\n, for serving\nFish sauce\n, for serving\nDirections\nFor the Rice Noodles:\nIn a medium bowl, cover noodles with slightly warm water (about 110°F; 43°C). Allow noodles to hydrate until pliable, about 30 minutes.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Pork:\nIn a mixing bowl, stir together pork, fish sauce, and sugar until well combined.\nSerious Eats / Amanda Suarez\nFor the Sauce:\nIn a small saucepan, combine palm sugar and tamarind and set over low heat, stirring until sugar is dissolved (if sugar is slow to dissolve, add 1 tablespoon water). Remove from the heat and stir in fish sauce until well combined.\nSerious Eats / Amanda Suarez\nFor the Stir-Fry:\nHeat a wok or large carbon steel or cast iron skillet over high heat until lightly smoking. Add oil and swirl to coat the surface. Immediately add pork and, using a wok spatula or large spoon, stir until about halfway cooked, about 20 seconds.\nSerious Eats / Amanda Suarez\nAdd tofu, sweet preserved radish, dried shrimp, and shallot and continue to stir rapidly until aromatic and heated through, about 40 seconds. Push everything to one side of wok.\nSerious Eats / Amanda Suarez\nCrack egg into now-empty side of the wok, and using wok spatula or large spoon, break yolk and briefly stir to distribute yolk, then cook without stirring until egg is mostly set (you want to avoid scrambling the egg as it sets). Once set, fold the aromatic mixture over the egg, flipping and scraping with the spoon or wok spatula to ensure nothing sticks. Stir until everything is well combined and egg is broken up into smaller pieces.\nSerious Eats / Amanda Suarez\nAdd rehydrated noodles, then pour sauce around edges of wok followed by 1 tablespoon plus 2 teaspoons water. Continue stirring until sauce is absorbed, about 2 minutes.\nSerious Eats / Amanda Suarez\nAdd a 1/4 cup Chinese flat garlic chives and 1/4 cup mung bean sprouts and continue stirring until wilted, about 30 seconds.\nSerious Eats / Amanda Suarez\nTurn off heat and add remaining Chinese flat garlic chives and mung bean sprouts, along with peanuts and stir to combine. Serve immediately with additional crushed peanuts, sugar, lime wedges, Thai chile powder, and fish sauce on the side.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nLarge carbon steel wok or large carbon steel or cast iron skillet, wok spatula or large spoon\nNotes\nYou can buy boneless pork shoulder and slice it very thinly yourself; par-freezing helps for thinner slices. You want roughly 1/8 inch–thick slices that are about 1x1.5 inches in size. You can also buy pre-sliced pork as it is sold in Asian markets for hot pot instead.\nLook for\ntamarind concentrate\nfrom a Thai brand; Indian and other South Asian brands of tamarind concentrate or tamarind paste are not a good substitute here. Alternatively, you can buy a block of tamarind pulp and prepare it as follows: Remove any seeds, then soak the pulp in an equal volume of boiling water; let stand until softened, then squeeze by hand until tamarind and water are fully blended.\nMake-Ahead and Storage\nThe noodles can be rehydrated and stored in a zip-top bag in the refrigerator up to 2 days in advance.\nThe sauce can be made up to 2 weeks in advance and refrigerated.\nThe pork can be marinated up to 1 day in advance and stored in an airtight container in the refrigerator.\nPad Thai is best served immediately, but leftovers can safely be stored for up to 3 days in an airtight container in the refrigerator.\nNoodle Mains\nThe Latest\nThai\nStir-Fry Noodles",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pad-thai.webp?"
}