{
  "url": "https://www.seriouseats.com/pad-see-ew-recipe-8784741",
  "image_url": "https://www.seriouseats.com/thmb/J68G_HWPrdHgT27zUPpbQMP4aO4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250129-PadSeeEw-AmandaSuarez-hero-7d38247b78b94efb9c31d3ce21b4c16e.jpg",
  "tags": [
    "Stir-Fry Noodles",
    "The Latest",
    "Noodle Mains",
    "Thai"
  ],
  "title": "Pad See Ew (Thai Stir-Fried Noodles)",
  "full_text": "Pad See Ew (Thai Stir-Fried Noodles)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nTotal\n45 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chile Vinegar:\n1\ncup\n(240\nml)\ndistilled\nwhite vinegar\nPinch\nkosher\nsalt\n4\nfresh\nred chiles,\nsuch as Holland, Fresno, or Cayenne (2 1/2 ounces; 70g), stemmed and thinly sliced crosswise (see notes)\nFor the Noodles:\n20\nounces\n(568g) fresh\nrice noodle\nsheets\nor 8\nounces\n(226g) dried wide rice noodles (see notes)\n2\ntablespoons\n(30\nml\n) Thai black\nsoy sauce\n2\ntablespoons\n(\n30\nml)\nneutr\nal oil\nsuch as vegetable or canola oil\nFor the Marinated Pork:\n8\nounces\n(\n225\ng)\npork shoulder,\nsliced very thinly into roughly 1- by 1 1/2-inch pieces (see notes)\n1\nteaspoon\n(5ml)\nThai oyster sauce\n1 t\neaspoon\n(5\nml)\nThai thin\nsoy sauce\n1/2\nteaspoon\n(3g)\ngranulated sugar\nPinch\nof\nground\nwhite pepper\n1\nteaspoon\n(\n5\nml\n)\nsesame oil\n1/2\nteaspoon\n(\n2\ng)\nbaking soda\nSmall\npinch\nkosher salt\n1\nteaspoon (5g)\ncornstarch\n1\nteaspoon (5ml) Shaoxing\nwine\nFor the Stir-Fry Sauce:\n3\ntablespoons (45ml) Thai\noyster sauce\n3\ntablespoons\nplus\n1\nteaspoon\n(50\nml)\nTha\ni thin soy sauce\n1\ntablespoon\n(15ml) Thai black\nsoy sauce\n1\nteaspoon\ngranulated\nwhite sugar\n1/4\nteaspoon\nground\nwhite pepper\nFor Par-Cooking and the Stir Fry:\n8 1/2\nounces\n(240\ng)\nChinese broccoli,\nsliced on a bias into 1-inch pieces (4 cups)\n8\nounces\n(\n225\ng)\nmarinated pork\nfrom above\n4\ntablespoons\n(60\nml)\nneutral oil\nsuch as vegetable or canola oil, divided\n10\ncloves\ngarlic\n(50\ng\n), smashed and roughly chopped, divided\nPrepared\nrice noodles\nfrom above\n1/2\ncup\n(120ml)\nstir fry sauce\nfrom above, divided\n4\nlarge\neggs, divided\nDirections\nFor the Chile Vinegar:\nIn a small saucepan, bring vinegar and salt to a boil over high heat. Remove from heat and add chiles. Let steep for at least 30 minutes or up to 1 day (vinegar will be best after 1 day). Store in an airtight container.\nSerious Eats / Amanda Suarez\nIf Using Fresh Noodle Sheets:\nMeanwhile, cut fresh noodle sheets into 1 1/2–inch wide strips and place in a mixing bowl; toss noodles with Thai black soy sauce and oil until evenly coated and no longer sticky. Divide into four even portions and set aside.\nSerious Eats / Amanda Suarez\nIf Using Dried Noodles:\nIn a large heatproof bowl, cover noodles with 1 quart boiling water. Allow noodles to hydrate until pliable, 15 to 20 minutes. Drain thoroughly and rinse three times with cold water to remove excess starch. Return drained noodles to bowl and toss with Thai black soy sauce and oil until evenly coated and no longer sticky. Divide into four even portions and set aside.\nSerious Eats / Amanda Suarez\n3. For the Marinated Pork:\nIn a medium mixing bowl, combine pork, oyster sauce, thin soy sauce, sugar, white pepper, sesame oil, baking soda, salt, and Shaoxing wine. Mix thoroughly by hand until evenly coated. Marinate for 30 minutes at room temperature.\nSerious Eats / Amanda Suarez\nFor the Stir-Fry Sauce:\nIn a separate medium mixing bowl, whisk together oyster sauce, thin soy sauce, black soy sauce, sugar, and white pepper until well combined. Set aside.\nSerious Eats / Amanda Suarez\nTo Par-Cook Broccoli and Pork:\nIn a large saucepan or 4-quart Dutch oven of boiling water,. blanch broccoli until crisp-tender, about 20 seconds; then, using a spider or strainer, immediately run under cold water to stop the cooking process (if you have a noodle basket, you can use it to blanch, strain, and chill all in once go). Squeeze out excess water, divide broccoli into four equal portions, and set aside.\nSerious Eats / Amanda Suarez\nReturn the water to a boil, then add the marinated pork. Cook, using chopsticks to separate the pieces, until just cooked through and no pink remains, about 1 minute. Drain, rinse under cold water, then drain thoroughly and divide into four equal portions; set aside.\nSerious Eats / Amanda Suarez\nTo Stir-Fry (in 4 Batches):\nHeat a wok or large carbon-steel or stainless-steel skillet over high heat until lightly smoking, about 3 minutes. Add 1 tablespoon oil and swirl to coat surface. Add 1/4 of garlic (12g), lower heat to low, and cook, stirring with a large spoon or wok spatula, until slightly browned and fragrant, about 20 seconds.\nSerious Eats / Amanda Suarez\nIncrease heat to high and add one portion (142g) of noodles, and cook, stirring carefully to avoid breaking them, slightly charred, about 1 minute. Add 2 tablespoons (30g) of sauce and stir well.\nSerious Eats / Amanda Suarez\nAdd one portion of blanched broccoli and stir-fry for 30 seconds. Add one portion of pork and stir-fry for another 30 seconds. Push everything to one side of the wok.\nSerious Eats / Amanda Suarez\nCrack 1 egg into the empty side of the wok, crack yolk then allow it to set before moving it. Avoid scrambling the egg. Once set, fold the noodles over the egg, flipping and scraping with the spoon or wok spatula to ensure nothing sticks. Stir until everything is well combined and egg is broken up into smaller pieces. Adjust seasoning with white and black pepper to taste.\nSerious Eats / Amanda Suarez\nTransfer pad see ew to a serving plate and serve immediately with Thai chili flakes, chile vinegar, additional sugar, and fish sauce on the side. Wipe wok or skillet clean and repeat with remaining 3 servings of the stir-fry; alternatively, save all of the prepped ingredients by refrigerating them separately in airtight containers and cook the remaining batches whenever you desire (up to 2 days).\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWok or large carbon-steel or stainless-steel skillet; large saucepan or 4-quart Dutch oven; small saucepan\nNotes\nThis recipe is best when prepared with fresh rice noodles, which come in sheets that can be cut by hand. Dry rice noodles are a good substitute if you can't find fresh, though the widest ones are not typically as wide as the fresh can be cut, and they have a chewier, more firm texture.\nA Holland chile and Fresno chile will have a similar mild heat level that is balanced with a sweet finish, while a fresh Cayenne chile will be spicier. A jalapeño chile may also be substituted in this recipe, though it will deliver less sweetness.\nMake-Ahead and Storage\nThe stir-fry sauce can be made and refrigerated in an airtight container for up to 2 weeks.\nThe chile-vinegar can be refrigerated in an airtight container for up to 3 weeks.\nThe meat and broccoli can be cooked up to two days in advance and stored in the fridge in an airtight container.\nStir-Fry Noodles\nThe Latest\nNoodle Mains\nThai",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pad-see-ew-thai-stir-fried-noodles.webp?"
}