{
  "url": "https://www.seriouseats.com/pambazo-mexican-chorizo-potato-sandwich-recipe-8602681",
  "image_url": "https://www.seriouseats.com/thmb/BPEON1Ct7wNBA7rRHV4lBuGgGps=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240304-SEA-Pambazo-Lorena-Masso-28-aa0abb8c8a384c968dc3045471dbd876.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Mexican",
    "Sausages",
    "Pork"
  ],
  "title": "Pambazo (Mexican Chorizo and Potato Sandwich)",
  "full_text": "Pambazo (Mexican Chorizo and Potato Sandwich)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nTotal\n55 mins\nServes\n2\nMakes\n2 Sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Slaw:\n2\ncups\nfinely shredded green\ncabbage\n(about\n4\nounces\n;\n115\ng\n)\n2\nscallions\n, trimmed and thinly sliced crosswise\n1/4\ncup\nfresh\ncilantro\nleaves and tender stems, chopped\n1/4\ncup\n(\n60\nml\n)\njocoque\n, plus extra if needed (see notes)\n1\nserrano\npepper\n, stemmed and thinly sliced\nKosher salt\nFor the Salsa:\n2\ntablespoons\n(\n30\nml\n) neutral cooking\noil\nsuch as canola or vegetable oil\n1/4\nmedium\nyellow onion\n(\n4\nounces\n;\n115\ng\n), peeled and trimmed\n2\nguajillo\nchiles\n, stemmed and seeded\n3\nmedium\ncloves garlic\n(\n15\ng\n), peeled and lightly smashed\n1\n(7.75-ounce) can\nMexican hot\ntomato sauce\n(\n220\ng\n; see notes)\nFor the Sandwich:\n1\nlarge\nrusset potato\n(about\n12\nounces\n;\n340\ng\n), peeled, quartered lengthwise, and cut into 1/2-inch thick pieces\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; if using table salt, use half as much by volume or the same weight\n1/2\npound\n(\n227\ng\n) homemade Mexican\nchorizo\nor store-bought (see notes)\n2\ntablespoons\nvegetable oil\n2\ntelera\nor bolillo\nrolls\n4\nounces\n(\n115\ng\n) q\nueso fresco\n, thinly sliced into slabs\nDirections\nFor the Slaw:\nIn a medium bowl, toss together cabbage, scallions, cilantro, jocoque, and serrano until well combined. Season with salt to taste. Set aside until ready to serve or cover and refrigerate for up to 2 days.\nSerious Eats / Lorena Masso\nFor the Salsa:\nIn a small saucepan, cook oil, onion, guajillo chiles, and garlic over low heat, stirring occasionally, until the chiles and garlic soften, adjusting heat as needed to avoid burning, about 10 minutes. If oil begins to sizzle, briefly remove from heat. Using a slotted spoon or tongs, remove chile, onion, and garlic from oil. Stir tomato sauce into oil, then transfer to a medium bowl; Set aside.\nSerious Eats / Lorena Masso\nFor the Sandwich:\nAdjust oven rack to middle position and heat oven to 250℉. Transfer rolls directly to oven rack and toast rolls until the exterior is lightly toasted.\nSerious Eats / Lorena Masso\nIn a separate medium saucepan, add potato, salt, and enough cold tap water to cover potato pieces by 1 inch. Bring to a boil over high heat, then reduce heat to medium and simmer potato, adjusting heat as needed, until a knife meets little resistance when inserted into a potato piece, about 10 minutes. Drain and set aside.\nSerious Eats / Lorena Masso\nHeat an empty 10-inch cast-iron skillet over medium heat for 3 minutes. Add chorizo and cook, breaking up meat with a wooden spoon, until well browned, 6 to 8 minutes. Transfer cooked chorizo to a medium bowl; set aside.\nSerious Eats / Lorena Masso\nAdd the oil to the now-empty skillet and heat over medium-high heat until shimmering. Add potato pieces and cook without stirring until crisp and browned on bottom, about 4 minutes. Flip potato pieces and continue to cook until crisp and browned on second side, about 4 minutes. Transfer to bowl with chorizo and toss to combine, and cover to keep warm.\nSerious Eats / Lorena Masso\nHeat the now-empty skillet over medium-high heat. Halve the toasted rolls. Working with 1 roll at a time, dunk only the crusty exterior of each half into the reserved salsa. Place both halves, salsa side down, in the skillet and cook, pressing down with a spatula and sliding the bread pieces around for even browning, until lightly charred, about 30 seconds. Transfer to a plate, charred-side down, and repeat with the second roll.\nSerious Eats / Lorena Masso\nOn each roll bottom, layer half of the queso fresco, then top with half of the chorizo and potato mixture and half of the slaw. Close sandwiches and serve immediately.\nSerious Eats / Lorena Masso\nSpecial Equipment\nSmall saucepan, 10-inch cast iron skillet\nNotes\nJocoque is a Mexican dairy product with the texture of crema but a flavor closer to cheese or yogurt. If you can't find jocoque, any Mexican crema or plain yogurt will work in its place.\nMexican chorizo sold in plastic tubes at the supermarket tends to be a gummy, fatty paste that’s difficult to crisp. For best results, look for chorizo from the butcher or deli counter at a Mexican grocery store or make your own.\nMexican hot tomato sauce is available at most well-stocked food stores. My preferred sauce is El Pato Tomato Sauce (Mexican Hot Style), which comes in a yellow can.\nMake-Ahead and Storage\nThe slaw, salsa, and parboiled potatoes can be made ahead, stored separately, and refrigerated for up to 2 days. If using slaw made in advance, drain before using.\nSandwiches\nThe Latest\nMexican\nSausages\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pambazo-mexican-chorizo-and-potato-sandwich.webp?"
}