{
  "url": "https://www.seriouseats.com/pan-roasted-quail-with-plums-recipe-8745896",
  "image_url": "https://www.seriouseats.com/thmb/JFXtE6AegeOERlWIGQLQlgmBTis=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20180802-quail-plum-sauce-vicky-wasik-883a16b0c84d4fb591ccfa82a9a3001b.jpg",
  "tags": [
    "Other Meat & Poultry",
    "Fall",
    "Plum"
  ],
  "title": "Pan-Roasted Quail With Plums",
  "full_text": "Pan-Roasted Quail With Plums\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nwhole\nquail\n,\ndeboned or spatchcocked\nKosher salt\n2\ntablespoons\n(30ml)\nvegetable oil\nOne\nmedium\nshallot\n(1 1/2 ounces; 40g), minced (about 1/4 cup)\n2\nsprigs\nfresh thyme\n4\nsmall Italian plums\n(about\n8\nounces\n), pitted and diced\n1\ncup\n(235ml) water or quail stock or\nhomemade chicken stock\nor store-bought\nlow-sodium chicken broth\n(see note)\n1\ntablespoon\n(15ml)\nhoney\n, plus more as needed\n2\ntablespoons\n(30g)\nunsalted butter\nMinced flat-leaf parsley\n, for garnish (optional)\nDirections\nSeason quail all over with salt. In a large cast iron skillet, heat oil over medium-high heat until shimmering. Add quail. If quail are spatchcocked, cook them skin side down until well browned, about 5 minutes, then flip and cook other side until desired doneness is reached (quail can be served from medium-rare to well done, as desired; they are too small to accurately use a thermometer, so feel free to cut into the meat to check doneness). If using deboned quail, cook on both sides, turning frequently, until browned on both sides and desired doneness is reach, about 4 minutes per side for medium.\nSerious Eats / Vicky Wasik\nTransfer quail to a plate or wire rack set over a rimmed baking sheet to rest.\nAdd shallot and thyme to skillet and cook, stirring, until shallot is softened, about 3 minutes. Add plums and cook, stirring, until starting to look pulpy, about 4 minutes.\nSerious Eats / Vicky Wasik\nAdd water or stock to pan, bring to a simmer, then cook until liquid has reduced and plums have broken down to form a thick sauce. Add any juices that have collected below quail. Season with salt.\nAdd honey to sauce, stirring to combine; taste, then add more honey as desired to balance the tartness of the plums (this will depend on the plums you have). Stir in butter until melted. Remove from heat. Discard thyme sprigs.\nSerious Eats / Vicky Wasik\nSpoon sauce onto serving plates, arrange quail on top, and serve. You can garnish with minced parsley, if desired.\nSpecial Equipment\n12-inch\ncast iron skillet\n,\nrimmed baking sheet,\ncooling rack\nNotes\nWater will work just fine for this recipe, but you'll get additional depth of flavor if you use stock. If you deboned your quail yourself, you will have leftover bones which you can use to make a quick stock, simply by combining the bones with diced aromatics (any combination of carrot, shallot or onion, garlic, celery, and herbs like parsley or thyme) in a saucepan and adding just enough water to cover, then simmering it all together for 30 minutes or so. Chicken stock, homemade or store-bought works well too.\nRead More\nHow to Debone and Spatchcock Quail\nGrilled-Pork Sandwiches With Grilled-Plum Chutney and Cabbage Slaw Recipe\nPeking Duck with Mandarin Pancakes & Plum Sauce Recipe\nOther Meat & Poultry\nFall\nPlum",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pan-roasted-quail-with-plums.webp?"
}