{
  "url": "https://www.seriouseats.com/pan-fried-rice-noodles-recipe",
  "image_url": "https://www.seriouseats.com/thmb/jKZvVHwV4WHg46Mopw9ISUS8I28=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__050214-taiwaneats-panfriednoodles-finished-863d2d2d9dd24f52b47bc67dc37adab4.jpg",
  "tags": [
    "Stir-Fry Noodles",
    "East Asian",
    "Rice Noodles",
    "Pork Shoulder",
    "Noodle Mains"
  ],
  "title": "Taiwanese Pan-Fried Rice Noodles Recipe",
  "full_text": "Taiwanese Pan-Fried Rice Noodles Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n20 mins\nMarinating Time\n20 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\nboneless pork shoulder\n, cut into thin 2-inch strips\n1/2\nteaspoon\ncornstarch\n1/4\ncup\nplus\n1\nteaspoon\nsoy sauce\n(or more to taste)\n1\nteaspoon\nsesame oil\n6 to 8\ndried shiitake mushrooms\n1/2\npound\nvery thin\ndried rice noodles\n(see notes)\n3\ntablespoons\nvegetable or\npeanut oil\n1\nlarge\ncarrot\n, julienned (about\n1\ncup\n)\n1\ncup\nbamboo shoots\nfrom\n1\n(15-ounce) can\n, rinsed and julienned\n2\ncups\npork stock\n(or substitute with chicken or vegetable stock or low-sodium broth), warmed\n1/4\nteaspoon ground\nwhite pepper\n(or more to taste)\nKosher salt\n2\ntablespoons\nblack vinegar\n(or more to taste; see notes)\n2 to 3\nscallions\n, white and light green parts only, thinly sliced\nDirections\nCombine pork, cornstarch, 1 teaspoon soy sauce, and sesame oil in a medium bowl and mix thoroughly. Cover and chill for at least 20 minutes, or up to overnight.\nMeanwhile, cover dried shiitake mushrooms with warm water and let stand until soft throughout, about 20 minutes. Squeeze excess water out of mushrooms and trim off their stems. Slice thinly and set aside. (The soaking liquid may be reserved for making soups, stocks, or braises.)\nCook rice noodles according to the instructions on the package. Drain and set aside.\nAdd 1 tablespoon vegetable oil to a large wok or skillet and heat over high heat until shimmering. Add pork and cook, stirring, until no longer pink, about 2 minutes. Remove from pan and set aside.\nAdd remaining 2 tablespoons oil to same wok or skillet and heat over high heat until shimmering. Add mushrooms, carrots, and bamboo shoots, along with a pinch of salt. Cook, stirring occasionally, for 1 minute. Return pork to the pan.\nPour in warm stock and remaining 1/4 cup of soy sauce and bring to a boil. Add rice noodles and stir to combine. Stir in white pepper, season with salt, and cook, stirring frequently, until stock is mostly absorbed, about 2 minutes. If desired, add extra soy sauce, salt, or white pepper to taste. Remove from heat and sprinkle in black vinegar; toss to combine. Garnish with scallions and serve immediately.\nSpecial Equipment\nLarge skillet\nor\nwok\nNotes\nLook for black vinegar and Taiwanese rice noodles, often labeled \"Hsinchu rice noodles,\" in Asian groceries. Otherwise, use the thinnest type of dried Asian rice noodle you can find.\nRead More\nThe Serious Eats Guide to Shopping for Asian Noodles\nSingapore Rice Noodles\nStir-Fried Lo Mein Noodles With Pork and Vegetables\nStir-Fried Lo Mein With Charred Cabbage, Shiitake, and Chives\nStir-Fry Noodles\nEast Asian\nRice Noodles\nPork Shoulder\nNoodle Mains"
}