{
  "url": "https://www.seriouseats.com/pan-seared-foie-gras-spiced-citrus-puree-orange-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/fTwamcK-Doqv4_w3Y_GCiLlntRo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121213-seared-foie-food-lab-16-e9ba8e93076e4ed6ae8e97c5c716efc4.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Stovetop",
    "Duck",
    "Christmas Appetizers"
  ],
  "title": "How to Pan Sear Foie Gras",
  "full_text": "How to Pan Sear Foie Gras\nClose\nJump to recipe\nPrep\n5 mins\nCook\n70 mins\nActive\n10 mins\nResting Time\n5 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Orange Purée:\n1\nwhole\norange\n, scrubbed clean\n1\nstick\ncinnamon\n1\nstar anise\n3\ncups\nsugar\n3\ncups\nwater\nKosher salt\nFor the Foie Gras:\n4\nslabs\nfresh grade \"A\" foie gras\n, each 1/2-inch thick, lightly scored in a hashmark pattern on one side (\n6 to 8\nounces\ntotal, see notes)\nFreshly ground\nblack pepper\n1\ntablespoon\nfinely sliced\nchives\nCoarse sea salt\nsuch as Maldon or fleur de sel\n1\ntablespoon\nfinely diced\ncandied orange peel\nDirections\nFor the Orange Purée:\nUse the tip of a sharp knife to cut several slits in the skin of the orange.\nCombine cinnamon, star anise, sugar, and water in a small saucepan and bring to a boil over medium-high heat, stirring until sugar is dissolved. Reduce heat to the lowest setting. Add orange to pot. Place a clean kitchen towel or a paper towel over the top of the pot, pushing it down until it is in contact with the liquid to keep the orange moist on all sides. Cook until orange is completely tender, about 1 hour. Discard cinnamon and star anise.\nTransfer orange to the jar of a blender and add a cup of cooking syrup. Blend on high speed until completely smooth, adding more syrup as necessary to reach a nice gel-like consistency. Season with a pinch of salt and press through a fine-mesh strainer. Set aside. Reserve orange syrup for another use (see notes).\nFor the Foie Gras\n: Lay a double layer of paper towels on top of a plate or cutting board and set aside. Season foie gras liberally on all sides with salt and pepper. Heat a small skillet over high heat for at least 3 minutes. Place foie gras in skillet scored-side-down. It should immediately start smoking, sizzling, and rendering fat. If it doesn't, remove and allow the pan to preheat for another 1 to 2 minutes. Once all 4 pieces of foie are in skillet, cook, swirling pan gently every few seconds, until deeply browned and crisp on first side, about 30 seconds. Use a thin metal spatula to flip foie gras onto second side and cook for 30 second longer. Transfer to paper towel-lined plate and let rest for 1 minute.\nSerious Eats / J. Kenji López-Alt\nSpoon some orange purée onto 4 individual serving plates and place 1 slice of foie gras on each. Top with chives, coarse sea salt, and candied orange peel. Serve immediately with lightly dressed greens.\nSpecial Equipment\nBlender\n,\nfine-mesh strainer\nNotes\nFresh foie gras can be ordered online. I prefer the grade \"A\" lobes from\nBella Bella Gourmet\n, who sells foie produced by\nLa Belle Farms\n, a small-scale poultry farm in Ferndale, New York.\nA lobe of foie gras weighs about one and a half pounds and is enough for at least 10 to 12 servings.\nMake-Ahead and Storage\nAny uncooked foie gras can be stored in a vacuum-sealed bag and frozen for several months.\nExcess sauce can be stored in a sealed container in the refrigerator for up to one month. Serve extra sauce with charcuterie, cheese, or roast duck or pork.\nExcess spiced orange syrup can be used to flavor soda water and stored in the fridge for up to two weeks.\nRead More\nPan-Seared Foie Gras With Fig Mostarda and Fresh Figs\nFoie Gras Torchon Recipe\nSerious Entertaining: A Blowout Christmas Dinner\nThe Physiology of Foie: Why Foie Gras is Not Unethical\nThe Ethics of Foie Gras: New Fire for an Old Debate\nHors D'Oeuvres\nStovetop\nDuck\nChristmas Appetizers"
}