{
  "url": "https://www.seriouseats.com/pan-fried-vegetable-dumplings-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Rq-x2Ovz77l6NqdfHeUcm54mjcg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__03__20140228-vegan-dumpling-17-16aa4da3d650435ea2f3aeb1eb95c6cd.jpg",
  "tags": [
    "Chinese",
    "Japanese",
    "Dairy-free Snacks & Appetizers",
    "Vegan Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers"
  ],
  "title": "Pan-Fried Vegetable Dumplings Recipe",
  "full_text": "Pan-Fried Vegetable Dumplings Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nActive\n60 mins\nTotal\n40 mins\nServes\n24 dumplings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1/2\ncup\nfinely diced\ncarrot\n1/2\ncup\nfinely diced five spice tofu\n1/2\ncup\nfinely diced seitan\n1/4\nounce\ndried wood ear mushrooms\n, rehydrated and finely diced (about\n1/4\ncup\n)\n1\ncup\nfinely diced cabbage\n2\ntablespoons\nminced garlic\n1\ntablespoon\nminced\nscallion whites\n1/2\nteaspoon\nsugar\n2\nteaspoons\nsesame oil\n2\nteaspoons\nsoy sauce\n1/2\nteaspoon\nwhite pepper powder\n1/4\nteaspoon\nsalt\n2\nteaspoons\ncornstarch\n24\npackaged\ndumpling skins\n(keep tightly wrapped until ready to use)\n1\ntablespoon\nvegetable oil\nFor the Dipping Sauce:\n1\nteaspoon\nsesame oil\n4\nteaspoons\nlight soy sauce\n2\nteaspoons\nrice vinegar\n1\nscallion\n, sliced\nDirections\nFor the Dumplings:\nCombine carrots, tofu, seitan, mushroom, cabbage, garlic, scallion, sugar, sesame oil, soy sauce, white pepper, salt, and cornstarch in a large bowl and mix well. Filling can be made up to 2 hours in advance. Stir well just before using.\nPrepare a dumpling wrapping station with a small bowl of water, your skins, your filling with a spoon, and a large parchment-lined plate or tray to hold finished dumplings. To begin wrapping the dumpling, place a little less than a tablespoon of the filling in the middle of the wrapper. Dip one finger in the water and wet half of the outer edges of the dumpling. Fold the wrapper in half and pinch the center together. Starting from the center, start pleating each side. Make 2 to 3 pleats on each side of the dumpling, pinching tightly shut. Place on plate. Repeat with remaining dumplings, making sure they don't touch each other on the plate.\nSerious Eats / Shao Z.\nSerious Eats / Shao Z.\nTo pan-fry the dumpling, heat 1 tablespoon of oil on medium-high heat in a large non-stick pan with a lid. When the oil is shimmering, add the dumplings, trying to avoid letting them touch each other. Pan-fry, swirling gently, until the bottoms of the dumplings are golden, about 2 minutes. Holding the lid of the pan in one hand, pour 1/4 cup of water into the pan. Cover the pan with the lid and steam the dumplings for 2 minutes. After 2 minutes, remove the lid. Most of the water should have evaporated. If there’s a little water remaining in the pan, it’s ok. Continue pan-frying the dumplings, swirling occasionally, until the bottoms are crispy again and any remaining water is gone. When the dumplings are done, transfer onto layers of paper towel to blot off excess oil.\nSerious Eats / Shao Z.\nFor the Sauce:\nCombine sesame oil, soy sauce, vinegar, and scallion in a small bowl. Serve with dumplings immediately.\nRead More\nThe Best Gyoza (Japanese Pork and Cabbage Dumplings)\nHar Gow (Crystal Skin Shrimp Dumplings)\nSheng Jian Bao (Pan-Fried Pork Soup Dumplings)\nChinese\nJapanese\nDairy-free Snacks & Appetizers\nVegan Snacks & Appetizers\nVegetarian Snacks & Appetizers"
}