{
  "url": "https://www.seriouseats.com/pan-fried-taiwanese-leek-buns-shui-jian-bao",
  "image_url": "https://www.seriouseats.com/thmb/wjNyVTDG-UwBWloBzkezYcywi00=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__03__20150304-dried-shrimp-leek-bun-pete-lee-8394c9c3ea7f4b13b206573f4480b410.jpg",
  "tags": [
    "Snacks & Appetizers",
    "East Asian",
    "Stovetop",
    "Leeks"
  ],
  "title": "Pan-Fried Leek Buns (Shui Jian Bao) Recipe",
  "full_text": "Pan-Fried Leek Buns (Shui Jian Bao) Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n45 mins\nResting and Soaking Time\n35 mins\nTotal\n105 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n1\ncup\nall-purpose flour\n, plus more for dusting\n1/4\nteaspoon\nsalt\n1\ntablespoon\nvegetable or\npeanut oil\n1/3\ncup\nwater\nFor the Filling:\n1\ntablespoon\ndried baby shrimp\n4 to 6\nlarge\nleeks\n, white and light green parts only, or 1 large bunch whole Chinese chives or leeks\n2\ntablespoons\nvegetable or\npeanut oil\n1/2\nteaspoon\nsalt\n, plus more to taste\n1/4\npound\ndried mung bean starch noodles\n(bean thread noodles)\n1\nteaspoon\nsesame oil\n1/4\nteaspoon ground\nwhite pepper\n, plus more to taste\nTo Cook:\n2\ntablespoons\nvegetable or\npeanut oil\n1/2\ncup\nwater\nDirections\nFor the Crust:\nCombine the flour and salt in a large bowl. Stir in the oil and enough of the water so that the dough just comes together in a ball. Turn the dough onto a floured surface and knead until the surface is smooth, 6 to 8 minutes. Cover with plastic and set aside to rest for 20 to 30 minutes.\nFor the Filling:\nIn a small bowl, soak the dried shrimp in about [1/4] cup water for at least 5 minutes, until slightly softened. Drain and chop finely. Finely chop the leeks.\nHeat the vegetable oil in a large skillet or wok over medium-high heat. Once hot, add the soaked shrimp and cook, stirring, until fragrant, about 30 seconds. Add the leeks along with the salt and cook, stirring occasionally, until softened and the juices have mostly evaporated, 8 to 10 minutes. You should have about 1 cup of the leek mixture.\nCook the noodles according to the package instructions. Drain well. Once cool enough to handle, transfer to a cutting board and coarsely chop. You should have about 1 cup chopped noodles.\nIn a bowl, combine the cooked leek mixture and the noodles. Stir in the sesame oil and white pepper and taste for seasoning, adding extra salt and white pepper as desired.\nTo form the buns, divide the dough into 8 equal-sized pieces. Roll out each one on a slightly floured surface to a round about 4 inches in diameter. Place about 1 tablespoon filling in the center of each round. Carefully bring the edges of the dough to the center of the bun to seal it shut over the filling. Make sure there are no gaps or holes. Place the buns sealed-side down on a lightly floured surface as each one is finished.\nTo Cook:\nHeat the oil in a large skillet with a tight fitting lid over medium-high heat. Once hot, arrange as many buns as will fit in a single layer in the pan so that the bottoms retain full contact with the pan (you may need to work in batches). Cook until the bottoms are just golden brown, 2 to 3 minutes. Add the water and immediately cover the pan. Steam until the dough on the tops of the buns has turned translucent rather than opaque white, about 8 minutes. If there is still liquid remaining in the pan, uncover and continue to cook until it evaporates and buns are crisp. Serve immediately.\nThis Recipe Appears In\nBeyond Pork: Fill These Taiwanese Pan-Fried Miniature Buns With Leeks and Dried Baby Shrimp\nSnacks & Appetizers\nEast Asian\nStovetop\nLeeks",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pan-fried-leek-buns-shui-jian-bao-recipe.webp?"
}