{
  "url": "https://www.seriouseats.com/pancakes-bourbon-maple-sauce-toasted-pecans-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uhEJo0B7WPd5w4uKQaevvYbdPQg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__02__20140212-283174-dinner-tonight-pancakes-bourbon-maple-sauce-pecans-2-7f5f71a6489a4f739dc58d0fe5101aad.jpg",
  "tags": [
    "Pancakes",
    "Pecans"
  ],
  "title": "Pancakes With Bourbon Maple Sauce and Toasted Pecans Recipe",
  "full_text": "Pancakes With Bourbon Maple Sauce and Toasted Pecans Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n20 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Bourbon Maple Sauce:\n1\ncup\nmaple syrup\n1/2\ncup\nbourbon\n(I used Bulleit)\n2\ntablespoons\nbutter\nFor the Pancakes:\n2\ncups\n(\n10\nounces\n)\nall-purpose flour\n1 1/2\ntablespoons\nsugar\n1\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1\nteaspoon\nsalt\n2\neggs\n6\ntablespoons\nmelted\nbutter\n, divided\n2\ncups\n(\n16\nounces\n)\nbuttermilk\n1\nteaspoon\nvanilla extract\nDirections\nFor the Bourbon Maple Sauce:\nHeat maple syrup and Bourbon in a medium-sized saucepan over medium-high until boiling. Reduce heat to very low to maintain a slow simmer. Let this simmer while you prepare everything else.\nFor the pancakes:\nMeanwhile, stir together flour, sugar, baking powder, baking soda, and salt in a large bowl until combined. In a second bowl, add eggs and whisk until frothy. Whisking constantly, slowly drizzle in 4 tablespoons melted butter. Whisk in buttermilk and vanilla.\nHeat a griddle or large cast-iron skillet over medium heat. Toast the pecans, stirring often, until aromatic and just starting to brown, about 5 minutes. Set aside.\nSet a wire rack on a rimmed baking sheet, place in the oven, and set oven to 200°F. Pour wet ingredients on top of dry and stir until the mixture just comes together. Do not overmix. Brush the griddle with 1 tablespoon of remaining butter. Scoop a 1/4-cup of batter and pour on the griddle. Add as many scoops as will comfortable fit on griddle without touching. Cook until edges set and bubbles start to break the surface, 1 1/2 to 2 minutes. Carefully flip with a thin spatula and cook until golden brown on the bottom, about 2 minutes. Transfer cooked pancakes to the oven, and repeat until all pancakes are cooked, adding more butter if necessary.\nRemove the sauce from the heat, and whisk in the 2 tablespoons of butter until sauce is smooth.\nServe pancakes with the toasted pecans and sauce.\nPancakes\nPecans"
}