{
  "url": "https://www.seriouseats.com/panchphoran-green-beans-11733249",
  "image_url": "https://www.seriouseats.com/thmb/PgwLSCiQ6EjIqeIpldTFspk8u_g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250508-Panchphoran-Green-Beans-Qi-Ai-hero-angled-horizontal-02-05f6398ec2204c848ac0e9f0910f8d4e.jpg",
  "tags": [
    "Recipes",
    "The Latest",
    "Recipes",
    "Sides",
    "Vegetable Sides"
  ],
  "title": "These 10-Minute Bengali-Spiced Green Beans Are Bold, Crunchy, and Delicious",
  "full_text": "These 10-Minute Bengali-Spiced Green Beans Are Bold, Crunchy, and Delicious\nClose\nJump to recipe\nCook\n10 mins\nTotal\n10 mins\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Panchphoran (Bengali Spice Blend):\n2\ntablespoons\nbrown or black\nmustard seeds\n, plus more for testing oil\n2\ntablespoons\ncumin seeds\n2\ntablespoons\nfenugreek seeds\n2\ntablespoons\nNigella seeds\n2\ntablespoons\nfennel seeds\n2\ntablespoons\nwhite\nsesame seeds\n(optional)\nFor the Green Beans:\n2\ntablespoons\n(\n30\nml\n) neutral oil such vegetable, avocado, or grapeseed, or\nmustard seed oil\n2\ntablespoons\npanchphoran blend\nfrom recipe above\n1\nteaspoon\nground turmeric\n1/2\nteaspoon\nKashmiri chile powder\n12\nounces\n(\n340\ng\n)\ngreen bean\ns, preferably haricots verts, trimmed and cut in half crosswise (see notes)\n1/4\ncup\n(\n60\nml\n)\nwater\n1 1/2\nteaspoons\nDiamond kosher salt\n; for table salt, use half as much by volume, plus more to taste\n1\ntablespoon\nlemon\nor lime\njuice\n(optional)\n2\ntablespoons\nminced fresh\ncilantro\nleaves and tender stems\nChapati\n, naan, or white rice for serving\nDirections\nFor the Bengali Spice Blend:\nIn a glass or metal bowl or jar, add all ingredients and toss to combine. (Seed mixture can be stored at room temperature in an airtight container for up to 4 months.)\nSerious Eats / Qi Ai\nFor the Green Beans:\nHave a splatter screen or lid handy. In a large stainless steel skillet, heat oil over medium heat until just smoking, about 2 1/2 minutes. Reduce heat to low and test the oil with one mustard seed. If it pops right away, the oil is ready; if not, return heat to medium-high for 1 additional minute and retest. When oil is ready, turn off heat then immediately add 2 tablespoons Bengali spice blend to hot oil, cover with mesh screen or lid and let spices pop (15 seconds), shaking the skillet occasionally to prevent spices from burning or sticking.\nSerious Eats / Qi Ai\nAs soon as the popping slows, add turmeric and Kashmiri chile. Stir briskly then immediately add green beans to skillet. Toss beans to coat in spiced oil, then turn heat to low and cook for 2 minutes.\nSerious Eats / Qi Ai\nAdd water and salt and stir to combine. Increase heat to medium, cover, and cook until beans are tender-crisp and remain bright green, 4 to 8 minutes. Note that spices should taste cooked and coat the beans, but not be overly darkened. Water should be mostly evaporated and spiced-oil should cling to the beans. If beans remain watery, continue to cook uncovered over medium heat until water is mostly evaporated, about 1 minute. Remove green beans from heat and season to taste with salt.\nSerious Eats / Qi Ai\nTo serve, mix beans with lemon or lime juice, if using, and garnish with with chopped cilantro.\nSerious Eats / Qi Ai\nSpecial Equipment\nStainless steel skillet with mesh screen or lid\nMake-Ahead and Storage\nThe spice blend can be stored in an airtight container at room temperature for up to 4 months.\nLeftover green beans can be refrigerated in a tightly sealed container for up to 4 days.\nRecipes\nThe Latest\nRecipes\nSides\nVegetable Sides"
}