{
  "url": "https://www.seriouseats.com/pancit-bihon-5196328",
  "image_url": null,
  "tags": [
    "Filipino",
    "Chicken Thighs",
    "Rice Noodles",
    "The Latest",
    "Stovetop Noodles"
  ],
  "title": "Pancit Bihon (Filipino Rice Noodles)",
  "full_text": "Pancit Bihon (Filipino Rice Noodles)\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nCooling Time\n10 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n1 3/4\npounds\n(\n795\ng\n) bone-in, skin-on\nchicken thighs\nFor the Pancit Noodles:\n1\ntablespoon\n(\n15\nml\n)\ncanola oil\n7\nmedium\ngarlic cloves\n, minced\n1/2\nmedium\nred onion\n(about\n4\nounces\n;\n115\ng\n), finely diced\n2\nmedium\ncarrots\n(about\n6\nounces\n;\n170\ng\n), peeled and grated on large holes of box grater\n4\nounces\n(\n115\ng\n)\nsnow peas\n, stem ends trimmed and strings removed\n8\nounces\n(\n225\ng\n) rice\nvermicelli noodles\n(see notes)\n2\ntablespoons\nplus\n2\nteaspoons\n(\n40\nml\n)\noyster sauce\n2\ntablespoons\n(\n30\nml\n)\nsoy sauce\n, preferably Filipino brands such as Silver Swan or Datu Puti\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1\nscallion\n, ends trimmed and sliced thinly on a bias, for garnish\nCalamansi halves\n, for serving (see notes)\nDirections\nFor the Chicken:\nFill a 4-quart saucepan halfway with water. Bring to a boil over high heat. Add chicken thighs, return to a boil, partially cover with lid, then lower heat to maintain a simmer. Cook, until chicken is tender and falling away from the bone, about 40 minutes.\nSerious Eats / Rezel Kealoha\nUsing tongs, transfer chicken thighs to a rimmed baking sheet or platter and set aside until cool enough to handle, about 10 minutes. Strain remaining liquid through a fine-mesh strainer set over a large heatproof bowl; set aside (you should have about 1 1/2 quarts; 1.4L). Once chicken is cool, finely shred chicken using two forks; discard skin and bones. Set aside.\nSerious Eats / Rezel Kealoha\nFor the Pancit Noodles:\nIn a wok, heat oil over high heat until shimmering. Add garlic and onion and cook, stirring frequently, until softened and light brown in color, about 2 minutes.\nSerious Eats / Rezel Kealoha\nAdd carrots and snow peas and cook, stirring frequently, until vegetables have brightened in color and are crisp-tender, about 2 minutes. Scrape stir-fried vegetables into a medium heatproof bowl; set aside.\nSerious Eats / Rezel Kealoha\nAdd 1 quart (1L) of the reserved broth to the wok and bring to a boil over high heat. Add rice noodles, stirring to ensure that noodles are wet. Cook, stirring frequently, until noodles soften and turn translucent, about 3 minutes; if noodles appear dry, add more stock in 1/4 cup (60ml) increments.\nSerious Eats / Rezel Kealoha\nReturn stir-fried vegetables to wok along with shredded chicken and mix well. Lower heat to maintain a simmer. Add oyster sauce, soy sauce, and fish sauce, and stir until sauces are fully incorporated and noodles are coated in a saucy glaze.\nSerious Eats / Rezel Kealoha\nGarnish with scallion. Serve immediately with calamansi halves (or serve with a small dish of citrus juice alongside; see note).\nSpecial Equipment\nWok\n,\n4-quart saucepan\nNotes\nRice vermicelli noodles can be found in Asian markets, specialty grocery stores, and online. I recommend the brand, Excellent, which contains rice flour, cornstarch, and water.\nCalamansi is difficult to source fresh in the US, but occasionally Filipino groceries located in California or Florida will have them. If you can't find fresh calamansi, you can serve the pancit with a small dish of either calamansi juice (we prefer frozen, as it has a better flavor than bottled options), or a mixture of one part freshly squeezed lemon juice to one-half part freshly squeezed lime juice to one-quarter part granulated sugar (by volume).\nMake-Ahead and Storage\nThe chicken can be prepared in advance and refrigerated for up to 5 days.\nPancit bihon can be refrigerated in an airtight container for up to 5 days.\nRead More\nPancit Palabok (Filipino Noodles & Seafood Sauce) Recipe\nTaiwanese Pan-Fried Rice Noodles Recipe\nSingapore Rice Noodles Recipe\nStir-Fried Chow Mein With Four Vegetables Recipe\nFilipino\nChicken Thighs\nRice Noodles\nThe Latest\nStovetop Noodles"
}