{
  "url": "https://www.seriouseats.com/pandesal-filipino-rolls-recipe-5189763",
  "image_url": "https://www.seriouseats.com/thmb/7kr-XVmqA779335Unu85HBAMsz8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210617-pandesal-vicky-wasik-seriouseats-seriouseats-21-8d33fc988da34901b763a1d1f3ce6a4b.jpg",
  "tags": [
    "Yeast Breads",
    "Breakfast & Brunch",
    "Filipino",
    "Bread",
    "The Latest"
  ],
  "title": "Pandesal (Filipino Rolls)",
  "full_text": "Pandesal (Filipino Rolls)\nClose\nJump to recipe\nPrep\n40 mins\nCook\n20 mins\nProofing Time\n2 hrs 30 mins\nTotal\n3 hrs 30 mins\nServes\n16 rolls\nCook Mode\n(Keep screen awake)\nIngredients\n555\ng\n(19 1/2 ounces; about 4 1/4 cups)\nall-purpose flour\n, such as Gold Medal\n115\ng\n(4 ounces; 1/2 cup)\nsugar\n8\ng\n(2 1/4 teaspoons)\ninstant yeast\n, such as SAF\n5\ng\n(1 1/2 teaspoons) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n225\ng\n(8 ounces; 1 cup)\nwhole milk\n60\ng\n(2 ounces; 1/4 cup)\nvegetable oil\n2\nlarge\neggs\n(100g)\n1\nlarge\negg yolk\n(15g)\n60\ng\n(2 ounces; 1/2 cup)\nplain breadcrumbs\nDirections\nIn the bowl of a stand mixer fitted with a dough hook, combine flour, sugar, yeast, and salt. Mix on low speed until well combined. Add milk, oil, eggs and egg yolk, and mix until a shaggy dough forms, about 2 minutes. Increase speed to medium and continue to mix until dough is smooth and pulls away from the sides of the bowl (it will remain attached to bottom of bowl and be sticky), about 10 minutes.\nSerious Eats / Vicky Wasik\nUsing a bowl scraper, transfer dough to a lightly oiled large bowl, cover loosely with plastic wrap, and let sit at warm room temperature (75°F/24°C) until roughly doubled in size, about 1 1/2 hours.\nSerious Eats / Vicky Wasik\nLine a rimmed baking sheet with parchment paper. Fill a wide shallow bowl with breadcrumbs. Turn dough onto a clean, floured surface, but do not deflate. Divide into 16 equal portions (2 1/3 ounces; 65g each). Working with one portion at a time, cup dough beneath your palm and work it in quick circular motions to form a smooth ball. Transfer portion to bowl with breadcrumbs, roll to evenly coat with breadcrumbs on all sides, and transfer to prepared baking sheet. Repeat with remaining portions of dough, spacing each about 1 inch apart on prepared baking sheet. Cover loosely with plastic wrap, and allow to rise at warm room temperature (75°F/24°C) until almost doubled in size, about 1 hour. (Alternatively, cover tightly with plastic wrap, and refrigerate overnight until puffy and soft, between 10 and 12 hours).\nSerious Eats / Vicky Wasik\nThirty minutes before baking, adjust oven rack to middle position and preheat to 350°F (180°C). Bake pandesal until puffed and golden brown, about 20 minutes.\nSerious Eats / Vicky Wasik\nTransfer to a serving platter, and serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nbowl scraper\n,\nrimmed baking sheet\nMake-Ahead and Storage\nBaked pandesal can be stored in an airtight container for up to 4 days at room temperature. To reheat pandesal, preheat oven to 350°F (177°C). Transfer pandesal to a baking sheet and reheat until hot, about 5 minutes.\nYeast Breads\nBreakfast & Brunch\nFilipino\nBread\nThe Latest"
}