{
  "url": "https://www.seriouseats.com/pandan-khanom-chan-layered-rice-sweets-recipe",
  "image_url": "https://www.seriouseats.com/thmb/2P_if2z0I-Yhj33rJsAKDKj4OdQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20101101khanomchan-b3b9bdb8cb71482aadb803b4607ee175.jpg",
  "tags": [
    "Desserts"
  ],
  "title": "Pandan Khanom Chan (Layered Rice Sweets) Recipe",
  "full_text": "Pandan Khanom Chan (Layered Rice Sweets) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 35 mins\nActive\n30 mins\nChilling Time\n12 hrs\nTotal\n14 hrs 45 mins\nCook Mode\n(Keep screen awake)\nIngredients\n10\npandan\nleaves\n, chopped, or\n2-3\ntablespoons\nnatural pandan extract\n4\ncups\nwater\n, divided\n3\ncups\nsugar\n2 1/2\nteaspoons\nkosher salt\n, divided\n1\ncup\ncoconut milk\n4\ncups\n(\n1\npound\n)\nglutinous rice flour\n, divided\nDirections\nPlace pandan leaves and 2 cups water in blender and blend on high until water is deep green and pandan is pulverized, about 2 minutes. Strain into saucepan, making sure to remove all pulp. Add remaining two cups water. If using extract, just combine with water in saucepan. Add sugar and 2 teaspoons salt. Bring to a simmer until sugar is dissolved, then remove from heat.\nDivide rice flour equally into two large bowls, adding last 1/2 teaspoon salt to one. In other bowl, pour in coconut milk and 2 1/4 cups pandan syrup. Add remaining syrup to bowl with salt. Whisk both mixtures until no flour is visible and lumps are smoothed out.\nPour coconut milk batter into baking pan and place in steamer. (I use a wok with some ramekins to prop up whatever vessel I'm steaming in, covered tightly with aluminum foil.) Steam until gel is mostly set and a skin forms, about 45 minutes, then slowly add second batter evenly across the pan. Steam until both gels set, another 1 3/4 hours.\nChill in refrigerator overnight. The next day, cut into small squares or thin slices and serve. Keep remainder covered in pan and refrigerated.\nSpecial equipment\nsteaming rig, 9 by 9\" baking pan, blender\nThis Recipe Appears In\nSpice Hunting: Pandan\nDesserts"
}