{
  "url": "https://www.seriouseats.com/pani-puri-recipe-11693199",
  "image_url": "https://www.seriouseats.com/thmb/_QQMhmRiMixN5PBy_6s4GRCd4tQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250307-PaniPuri-KanikaandJatinSharma-23-8d36bdf201864c0691b1c529ac05e6fe.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Indian",
    "Frying"
  ],
  "title": "Pani Puri",
  "full_text": "Pani Puri\nClose\nJump to recipe\nPrep\n60 mins\nCook\n30 mins\nSoaking Time:\n8 hrs\nTotal\n9 hrs 30 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sweet-Tart Spiced Water:\n4\nounces\n(\n113\ng\n)\nseeded tamarind pulp\n2\ncups\n(\n480\nml\n)\nhot water\n4\nounces\n(\n113\ng\n)\njaggery or dark brown sugar\n1/2\nteaspoon\nDiamond Crystal Kosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nground cumin\n1/4\nteaspoon\nground\nKashmiri red chile powder\nFor the Spicy Herb Water:\n2\ncups\n(\n480\nml\n)\nwater\n2\npacked\ncups\nmint\nleaves (\n4\nounces\n;\n113\ng\n)\n1\ncup\ncilantro\nleaves and tender stems (\n2\nounces\n;\n57\ng\n)\n1\n(1-inch)\npiece\nfresh\nginger\n, peeled and thinly sliced\n2 to 3\ngreen Thai or Indian\nchiles\n, stem ends removed\n1\nteaspoon\nground cumin\n1\nteaspoon\nDiamond Crystal Kosher salt\n; for table salt, use half as much by volume\n2\nteaspoons\nchaat masala\nor store-bought pani puri masala\n1\nteaspoon\nsugar\n(optional)\nFor the Spiced Potatoes:\n2\nRusset potatoes\n(\n1\npound\ntotal;\n453\ng\n), peeled and cut into 2-inch pieces\n1\nteaspoon\nDiamond Kosher salt\n; for table salt, use half as much by volume\n2\nteaspoons\nground cumin\n3/4\nteaspoon\nground Kashmiri red chile\npowder (optional)\nFor the Beans:\n1\ncup\ndried green mung beans\n(about\n202\ng\n) or\n1 1/2\n(15-ounce)\ncans\nchickpeas\n, drained (\n22\nounces\n;\n624\ng\n)\n3/4\nteaspoon\nDiamond Crystal Kosher salt\n; for table salt, use half as much by volume\nFor Serving:\n4\ndozen\nstore-bought pani puri puffs\n(plus 1 dozen extra in case needed)\n1/2\nsmall\nwhite\nonion\n(\n3\nounces\n;\n85\ng\n), minced\n1\ncup\npicked cilantro leave\ns (\n2\nounces\n;\n57\ng\n), minced (optional)\n1\npacket\n(\n200\ng\n) plain or spiced\nbundi\n(deep fried chickpea paste balls), optional\n1\npacket\n(\n200\ng\n) homemade or store-bought\nsev\nor bhujia (deep fried chickpea paste threads), optional\nDirections\nFor the Sweet-Tart Spiced Water:\nIn a large metal or glass bowl, cover tamarind with hot water. Soak for at least 2 and up to 4 hours.\nSerious Eats / Amanda Suarez\nUsing your hands, press tamarind in the water to separate pulp. Set a fine-mesh strainer over a large bowl. Pour tamarind-water mixture through it, pushing and pressing on the pulp until all the water and pulp has passed through; discard seeds, skins, and fibres. Stir jaggery or brown sugar, salt, cumin, and red chile powder into tamarind water until well combined. Set aside until ready to serve, stirring occasionally to ensure all sugar and salt has fully dissolved.\nSerious Eats / Kanika and Jatin Sharma\nFor the Spicy Herb Water:\nIn a blender jar, add 1 cup water, mint, cilantro, ginger, chiles, cumin, and salt and blend on high power until smooth, about 1 minute.\nSerious Eats / Kanika and Jatin Sharma\nAdd additional 1 cup water and blend for 30 seconds on high to ensure no lumps of ginger or chiles remain.\nSerious Eats / Kanika and Jatin Sharma\nSet a clean fine-mesh strainer over a bowl, then strain blended puree through it, pressing on pulp to extract as much as possible; discard solids. Stir in chaat or pani puri masala. Season with salt to taste. The liquid should be spicy and minty. If it tastes too hot for your liking, stir in sugar; set aside until ready to serve.\nSerious Eats / Kanika and Jatin Sharma\nFor the Spiced Potatoes:\nIn a medium saucepan, add potatoes, 1 teaspoon salt, and enough cold water to cover by 1-inch. Bring to a boil over high heat, then reduce heat to a vigorous simmer over medium heat and cook until potatoes are tender, 12 to 15 minutes. Drain potatoes, transfer to a bowl, and let cool for 10 minutes. Mash potatoes roughly or cut them into 1/4-inch chunks. Stir in salt, cumin, and red chile powder, if using, until well combined. Transfer spiced potatoes to a serving bowl.\nSerious Eats / Kanika and Jatin Sharma\nFor the Beans:\nIf using mung beans, pick through to remove any hard bits of debris, then rinse beans well. Soak mung beans in 2 cups (480 ml) of warm water, covered and at room temperature, for at least 8 and up to 12 hours.\nDrain and rinse mung beans well and cover again with 2 cups warm water. Set aside until beans have softened, about 4 hours. Check if mung beans have softened by pressing one bean between thumb and forefinger. If it breaks easily, it is ready to cook, if not, continue to soak for an additional hour and check again. Drain and rinse mung beans.\nSerious Eats / Amanda Suarez\nIn a large saucepan, cover softened mung beans with 2 1/2 cups water. Bring to a boil over medium heat, then reduce heat to low and cook mung beans, uncovered, until beans are fully softened and break apart very easily when pressed, about 15 minutes. Drain and rinse beans and transfer to a serving bowl. Season with salt.\nSerious Eats / Amanda Suarez\nIf using canned chickpeas, drain and rinse chickpeas before placing them in a mixing bowl. Using a potato masher or fork, mash chickpeas roughly. Stir in salt; transfer to serving bowl and set aside until ready to serve.\nSerious Eats / Kanika and Jatin Sharma\nTo Serve:\nTransfer the prepared sweet-tart spiced water, spicy herb water, spiced potatoes, prepared mung beans or chickpeas, onion, cilantro, bundi, sev or bhujia, and puris to separate plates and vessels on a serving table. Include plates, 2 teaspoons and 1 soup spoon per guest.\nSerious Eats / Kanika and Jatin Sharma\nTo Prepare 1 Pani Puri:\nThe puri (puffed shell) has a thinner and crispier side; holding it on a plate, punch a roughly 1-inch hole into this thin side with your index finger, allowing the shards of puri to fall into the ball. Stuff the puri with potato mash and/or bean filling, then spoon sweet-tart spiced water and/or spicy mint water over top. Sprinkle with onion, cilantro, bundi (if using), and sev or bhujia (if using). Enjoy.\nSerious Eats / Kanika and Jatin Sharma\nSpecial Equipment\nFine-mesh strainer, blender, medium saucepan, potato masher or fork, large saucepan (if preparing mungbeans)\nNotes\nThis recipe can be easily doubled.\nMake sure you have extra puris on hand in case a few are accidentally broken.\nBundi (deep fried chickpea paste balls) and sev (deep fried chickpea paste threads) are snacks that can be purchased at most South Asian grocery stores. They offer a crunchy counterpoint to the soft potato and mung bean fillings.\nMake Ahead and Storage\nThe green mung beans can be soaked up to 2 days before cooking. The cooked mung beans can be cooled and refrigerated in an airtight container for up to 2 days before serving.\nThe potatoes can be boiled and refrigerated up to 1 day before serving. Mash and season just before serving.\nThe two spiced waters can be prepared and refrigerated in airtight containers up to 1 day before serving.\nMake sure to purchase puris no more than 2 days before serving to ensure they are fresh.\nSnacks & Appetizers\nThe Latest\nIndian\nFrying"
}