{
  "url": "https://www.seriouseats.com/pantrucas-chilean-noodle-soup-recipe-7975918",
  "image_url": "https://www.seriouseats.com/thmb/6mJul4H4Sb0g5StV3u1f_8MDIZQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230927-SEA-Pantrucas-EstudioComo-hero-31555818603647ff8c1cf8e9efc1651b.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Noodles",
    "Short Ribs",
    "Comfort Food"
  ],
  "title": "Pantrucas (Chilean Noodle Soup)",
  "full_text": "Pantrucas (Chilean Noodle Soup)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n2 hrs 5 mins\nCooling and Resting Time\n40 mins\nTotal\n3 hrs 5 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beef Broth:\n2\npounds\n(\n900\ng\n) bone-in\nbeef short ribs\n, cut into single-bone sections, or cross-cut beef shanks (osso buco)\n2\nmedium\ncarrots\n(about\n8\nounces\n;\n225\ng\n) , cut into 2-inch pieces\n2\nmedium\ncelery ribs\nwith leaves (about\n5\nounces\n;\n150\ng\n), cut into 2-inch pieces\n2\nmedium\ncloves garlic\n(\n10\ng\n), smashed\n1\nmedium\nwhite or\nyellow onion\n(about\n8\nounces\n;\n225\ng\n), quartered\n2/3\nred bell pepper\n, cut into chunks\n15\nwhole\nblack\npeppercorns\n1\nbay leaf\n5\ngrams\nsalt\n2 1/2\nquarts\n(\n2.3\nL\n) cold\nwater\nFor the Pantrucas Dough:\n10\nounces\n(\n285\ng\n)\nall-purpose flour\n, sifted, plus more for dusting\n1\nteaspoon\n(\n5\ng\n)\nkosher salt\n; for table salt use half as much by volume or the same weight\n3/4\ncup\n(\n177\nml\n) lukewarm\nwater\nFor the Soup:\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n1\nmedium\ncarrot\n(about\n4\nounces\n;\n170\ng\n), julienned\n1\nmedium\ncelery rib\n(about\n2 1/2\nounces\n;\n75\ng\n), finely diced\n1\nmedium\nclove garlic\n(\n5\ng\n), minced\n1\nmedium\nwhite or\nyellow onion\n(about\n8\nounces\n;\n225\ng\n), finely chopped\n1/3\nred bell pepper\n, julienned\n1\ntablespoon\ndried oregano\n, preferably Chilean or good quality Italian\n1\nteaspoon\nChilean ají de color or sweet\npaprika\n1/2\nteaspoon\nground cumin\n1\nteaspoon\n(\n5\ng\n)\nkosher salt\n; for table salt use half as much by volume or the same weight\nFreshly\nground black pepper\n1\npound\n(\n455\ng\n) waxy potatoes (such as red potatoes or\nnew potatoes\n), peeled and cut into 1-inch pieces\n1\ncup\nfrozen peas\nFor Serving:\n2\nlarge\nlarge eggs\n, beaten\n1\ncup\n(lightly packed) finely chopped\ncilantro leaves\nand tender stems\nChilean merken, a pinch per portion, or\ncrushed red pepper flakes\nor a few drops hot sauce\nDirections\nFor the Beef Broth:\nIn a large stockpot, combine short ribs, carrots, celery, garlic, onion, bell pepper, peppercorns, bay leaf, and salt. Cover with water and bring to a boil over high heat. Adjust heat to medium-low and simmer, partially covered, adjusting heat as needed to maintain simmer, until short rib meat is tender and can be pierced easily with a fork, 60 to 90 minutes. (If meat takes longer than 1 hour to cook, and excessive evaporation occurs, add more water as needed.)\nSerious Eats / Estudio Como\nUsing tongs, transfer meat to cutting board and let rest until cool enough to handle, about 10 minutes. Strain broth through a fine-mesh strainer set over a large empty pot. Discard cooked vegetables. Skim excess fat from surface of the broth. Pick meat from bones, discarding excess membrane and fat, and dice meat into bite-sized pieces; set aside.\nSerious Eats / Estudio Como\nFor the Pantrucas Dough:\nMeanwhile, line a baking sheet with a clean, lightly floured kitchen towel.\nSerious Eats / Estudio Como\nIn a medium bowl, whisk together flour and salt. With a wooden spoon, stir in lukewarm water until combined and some lumps form. Knead dough in work bowl into a rough ball that separates from the bowl. Transfer dough to a floured working surface and knead until smooth and soft, 2 to 3 minutes. If dough feels too wet, dust lightly with flour as needed. Wrap dough in plastic wrap and rest for at least 30 minutes or up to 4 hours.\nSerious Eats / Estudio Como\nCut rested dough into 3 equal sized pieces. Working with 1 piece of dough at a time (rewrap remaining dough), dust both sides lightly with flour, place cut side down on clean work surface, and press into a 3-inch square.\nSerious Eats / Estudio Como\nUsing a rolling pin, roll into a 6-inch square. Dust both sides of dough lightly with flour. Starting at center of square, roll dough away from you in 1 motion. Return rolling pin to center of dough and roll toward you in 1 motion. Repeat rolling steps until dough sticks to work surface and measures roughly 12 inches long.\nSerious Eats / Estudio Como\nRelease dough from counter (if sticking) and lightly dust both sides of dough with flour. Roll dough out, frequently lifting to release from work surface, until it measures roughly 20 inches long and 6 inches wide. Dough should be comparable in thickness to lasagne sheets, or 1/32 to 1/16 inch thick (1 to 1 1/2mm).\nSerious Eats / Estudio Como\nUsing a knife or a pasta wheel cutter, cut dough sheet into 1 to 1 1/2-inch squares or diamonds.Transfer to prepared sheet and cover with a clean cloth. Repeat rolling and cutting with remaining dough pieces, lightly dusting with flour between each layer of cut dough pieces to avoid sticking.\nSerious Eats / Estudio Como\nFor the Soup Base:\nIn a large Dutch oven or stockpot, heat oil over medium-high heat until shimmering. Add carrot, celery, garlic, onions, and bell pepper and cook, stirring occasionally, until vegetables are softened, 6 to 8 minutes. Add oregano, Chilean ají de color, cumin, salt, and freshly ground pepper to taste, and cook, stirring constantly, until fragrant, about 30 seconds. Pour the reserved strained broth into the soup base.\nSerious Eats / Estudio Como\nAdd potatoes and diced beef and bring to a boil over high heat. Reduce heat to medium-low and simmer, adjusting heat as needed and stirring occasionally, until potatoes are almost cooked through but still meet slight resistance when poked with a paring knife, about 10 minutes.\nSerious Eats / Estudio Como\nAdd peas and return to a boil over medium-high heat. Gently stir in pantrucas, making sure they do not stick together, and return to a boil. Cook, stirring occasionally, until pantrucas are just tender, about 2 minutes. Add more water if needed to thin soup.\nSerious Eats / Estudio Como\nFor Serving:\nPour beaten eggs into hot soup while stirring it into the broth with a fork. (Pour and stir slowly to produce thin distinct egg ribbons, or pour and stir quickly for the egg to fully emulsify in soup and thicken broth.) Simmer until egg is cooked and broth turns slightly opaque, about 1 minute, Season with salt to taste. Portion into preheated individual soup bowls. Top each bowl with cilantro and a pinch of merken. Serve.\nSerious Eats / Estudio Como\nSpecial Equipment\nLarge stock pot, fine-mesh strainer, large Dutch oven or second stock pot, rolling pin, wheel pasta cutter\nNotes\nFor a vegan version,\nsubstitute homemade or store-bought vegetable stock, omit beef, double amount of peas, and omit the beaten eggs.\nMake-Ahead and Storage\nThe cooked beef broth can be refrigerated in an airtight container for up to 2 days or frozen for up to 1 month. Store cooked beef separately and cut beef before adding to the soup.\nThe wrapped pantruca dough can be refrigerated for up to 48 hours. Bring to room temperature before rolling out and cutting the dough.\nCut, raw pantrucas can be frozen: Spread them in a single layer on a parchment-lined baking sheet and freeze until solid, then transfer frozen pantrucas to freezer bags and store frozen. Cook from frozen, adding 1 minute to cooking time.\nSoups\nThe Latest\nNoodles\nShort Ribs\nComfort Food"
}