{
  "url": "https://www.seriouseats.com/pappardelle-with-duck-ragu-from-robertas",
  "image_url": "https://www.seriouseats.com/thmb/j6ruNQ0vJaoBuLFzgJxcGQa71DY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__02__20140215-ctb-robertas-papardelle-duck-ragu-1a431df32d074b2384b3e7b54eb73705.jpg",
  "tags": [
    "Pasta Mains",
    "Stovetop Pasta",
    "Duck",
    "Duck Mains"
  ],
  "title": "Pappardelle With Duck Ragu From 'Roberta's'",
  "full_text": "Pappardelle With Duck Ragu From 'Roberta's'\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs 25 mins\nActive\n90 mins\nDry-Brining and Resting Time\n8 hrs 45 mins\nTotal\n11 hrs 40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nRagu:\n4\ngarlic\ncloves\n, peeled\n4\nsprigs\nthyme\n68\ng\n(\n1/2\ncup\n)\nkosher salt\n, plus more as needed\nFreshly ground black pepper\n4\n(\n400 g; 14-ounce\n)\nduck legs\nSome good\nolive oil\n1\nmedium\nonion\n, finely chopped\n3\ncelery\nribs\n, finely chopped\n2\nmedium\ncarrots\n, finely chopped\n340\ng\n(\n1 1/2\ncups\n)\ndry white wine\n1\n(\n794 g; 28-ounce) can\nwhole San Marzano tomatoes\n35\ng\n(1 1/4\nounces\n)\n80 to 90 percent dark chocolate\n, finely grated\nPasta:\n300\ng\n(\n2\ncups\nplus\n3 1/2\ntablespoons\n)\nTipo 00 flour\n6\nlarge\negg yolks\n60\ng\n(\n1/4\ncup\n) room-temperature\nwater\nAll-purpose flour\n, for rolling the dough\nA\npinch\nof\nchile flakes\nA\nchunk\nof Piave Vecchio cheese or\nParmigiano\nA handful of\nparsley leaves\n, chopped\nDirections\nTo cure the duck:\nIn a big bowl, mix the garlic cloves and thyme sprigs with the salt and 5 or 6 coarse grinds of black pepper. In a shallow glass container or on a sheet pan, spread half of the mixture in a thin layer. Put the duck legs on the salt mixture, and cover them with the remaining mixture. Seal the container or cover the pan tightly with plastic wrap and refrigerate it overnight—at least 8 hours and up to 12.\nTo make the ragu:\nRemove the duck legs from the salt, rinse them, pat them dry, and let them come to room temperature.\nCoat a big heavy-bottomed pot or a Dutch oven with olive oil and set it over medium-high heat. In batches, brown the duck legs well on each side, 3 to 5 minutes per side, and then remove them from the pot and set them aside. Pour off all but 2 tablespoons of fat. Lower the heat just a little and add the onion, celery, and carrots to the pot. Let them soften for a few minutes, and then add the wine and give everything a stir. Add the tomatoes—juice and all—and stir. Break the tomatoes up a little with a wooden spoon. Return the duck legs, with their juices, to the pot, cover, and let everything simmer for 2 hours or more. The duck is done when the meat easily comes off the bone when it’s prodded with a fork.\nTurn off the heat, remove the duck legs from the pot, and let them sit until they’re cool enough to handle. Then shred the meat, keeping about half the skin and fat and discarding the rest along with the bones. Return the meat, fat, and skin (try the skin first; some people don’t like the texture. If you don’t, don’t add it) to the pot and set it over medium-low heat. Add the dark chocolate to the pot and stir. Check the seasoning and adjust if necessary.\nTo make the pasta:\nSift the flour (this is particularly key if the flour’s been sitting around a while or if it’s been humid). On a work surface or in a big metal bowl, mound your sifted flour and make a well in the center.\nPut the egg yolks and a splash of the water in the well. With your hands, break up the egg yolks and begin incorporating the flour into them a little at a time (if you’re using a bowl, put a kitchen towel under the bowl so it doesn’t spin around while you mix). Take your time. Work the mixture with your fingers and gradually pull in more flour from underneath and around it, adding more water if the dough seems dry.\nWhen the dough starts to come together into a mass, transfer it to a dry surface and begin kneading it. Push it, pull it, and push it back down again. Put the palms of your hands into it. Work the dough firmly until it’s one cohesive, smooth mass, about 10 minutes. Wrap it in a damp kitchen towel and let it rest at room temperature for half an hour. If you’re not using it immediately, wrap it in plastic wrap, refrigerate it, and use it within 12 hours.\nAttach your pasta machine to the edge of a clean, long work surface. Divide the dough into 2 baseball-size balls. Flatten them slightly with your hand and dust them lightly with flour. Set the pasta machine to the widest setting and feed one ball of dough into it four or five times in a row. Adjust the setting to the next widest and feed the dough through three or four times. If the pasta cracks along the side, fold the cracked edge over and feed the sheet through the machine again to smooth it out. Adjust the machine to the thinnest possible setting and feed the dough through. The resulting sheet of pasta should be about 1/16 inch thick—just short of being translucent. Repeat with the remaining ball of dough.\nLay the rolled sheets of pasta on a floured surface and use a pizza cutter or a very sharp knife to cut them into ribbons 1 to 1 1/2 inches wide. If you’re using the pasta right away, cover it with a damp kitchen towel until you’re ready to drop it in the pot. If you’re not using it right away, lightly dust it with flour, layer it between pieces of parchment paper on a sheet pan, cover it tightly with plastic wrap, and refrigerate for up to 8 hours.\nTo finish:\nPut a large pot of heavily salted water on to boil, and put three or four shallow bowls for serving in a 200°F oven to warm.\nCoat a large saute pan with olive oil, add a big pinch of chili flakes, and set it over medium-low heat. Put the pappardelle in the boiling water and cook for 2 minutes. Use tongs to transfer it from the pot to the saute pan, and add a big splash of pasta water. Toss the pasta around a little and check the seasoning. Divide the pasta among the warmed shallow bowls and spoon ragu over each portion (there will be leftover ragu). Garnish with a few shavings of the cheese and a little parsley, and serve.\nPasta Mains\nStovetop Pasta\nDuck\nDuck Mains"
}