{
  "url": "https://www.seriouseats.com/papris-crispy-indian-wheat-chips-recipe-6747953",
  "image_url": "https://www.seriouseats.com/thmb/4Fy9-0M2QsBI7gbI8kLVfDVudlU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20170921-chaat-vicky-wasik-papri-dough-SEA-833bcddbabc14c188654f7dae4d1447d.jpg",
  "tags": [
    "Indian",
    "Snacks & Appetizers",
    "Vegetarian Snacks & Appetizers",
    "South Asian",
    "Vegetarian"
  ],
  "title": "Papris (Crispy Wheat Chips for Chaat and More)",
  "full_text": "Papris (Crispy Wheat Chips for Chaat and More)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nResting Time\n60 mins\nTotal\n80 mins\nServes\n3\nto 4 servings\nMakes\n20\nto 30 crisps, depending on thickness\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n260\ng\n)\natta flour\n(\nIndian wheat flour\n) or\nwhole wheat flour\n1\nteaspoon\n(\n4\ng\n)\nbaking powder\n1 1/2\nteaspoons\n(\n7\ng\n)\nkosher salt\n1\nteaspoon\n(\n5\ng\n)\nnigella seeds\n1\ntablespoon\n(\n12\ng\n)\nvegetable oil\n1 1/2\nquarts\n(\n1.4\nL\n)\noil\nfor frying, such as\ncanola\n,\npeanut\n, or\nvegetable\nDirections\nIn a large bowl, whisk together flour, baking powder, salt, and nigella seeds. Add warm water, a little at a time, until a soft dough forms (it should be the consistency of Play-Doh). Knead in the bowl until mixture comes together into a smooth dough, about 5 minutes. Wrap dough in plastic wrap and let rest for at least 1 hour and up to 12 hours.\nSerious Eats / Vicky Wasik\nOn a lightly floured work surface, roll out dough until it is approximately 2 millimeters thick. (You can use the nigella seeds as your guide: The dough should be just barely thicker than the seeds themselves.) Using a fork, prick all over surface of dough. (Alternatively, if left un-pricked, the papris will puff up when fried, and can then be stuffed for sev puri chaat and panipuri.) Using a 1 1/2–inch round cookie cutter, cut rounds from dough and set aside on a floured surface. Any scraps can be gathered and re-rolled until you have no more dough left.\nSerious Eats / Vicky Wasik\nIn a large pot, wok, or Dutch oven, heat oil to 375°F (190°C). Working in batches of 6 to 8 pieces, fry papris, turning occasionally, until golden brown, about 2 minutes. Drain onto a paper towel–lined sheet tray and season with salt while still warm. Serve immediately or store in an airtight container.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRolling pin, large pot, wok, or Dutch oven, sheet tray (optionally with metal rack).\nNotes\nFrying oil can be reserved for another use. If docked (pricked all over), as this recipe calls for, the papris will fry into crisp chips. Alternatively, if left un-pricked, the papris will puff up when fried, and can then be stuffed for sev puri chaat and panipuri.\nMake-Ahead and Storage\nThe papris will stay crisp in an airtight container for up to 1 week.\nRead More\nPapri Chaat (Indian Street Snack With Potato, Chickpeas, and Chutneys) Recipe\nIndian\nSnacks & Appetizers\nVegetarian Snacks & Appetizers\nSouth Asian\nVegetarian"
}