{
  "url": "https://www.seriouseats.com/paris-brest-pate-a-choux-with-praline-creme-mousseline",
  "image_url": null,
  "tags": [
    "French",
    "Desserts",
    "The Latest"
  ],
  "title": "Paris–Brest (Pâte à Choux With Praline Crème Mousseline) Recipe",
  "full_text": "Paris–Brest (Pâte à Choux With Praline Crème Mousseline) Recipe\nJump to recipe\nPrep\n45 mins\nCook\n80 mins\nActive\n50 mins\nCooling Time\n45 mins\nTotal\n2 hrs 50 mins\nServes\n8 servings\nMakes\n1 nine-inch Paris–Brest (see note)\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Praline Paste:\n1 1/2\nounces\n(\n45\nml\n)\nwater\n2 1/2\nounces\n(\n6\ntablespoons\n;\n70\ng\n)\nsugar\n2\nounces\n(about\n3\ntablespoons\n;\n60\ng\n)\nlight corn syrup\n2\nounces\n(heaping\n1/3\ncup\n;\n60\ng\n) toasted\nblanched hazelnuts\n(see note)\n2\nounces\n(\n1/2\ncup\n;\n60\ng\n) toasted\nsliced almonds\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nbaking soda\nFor the Choux:\n1/2\nrecipe\nchoux pastry\n(made with a combination of milk and water, and the optional sugar),\ntransferred to a pastry bag\nfitted with a 1/2-inch round or star tip (see note)\n1\nlarge\negg\nwhisked with\n1\ntablespoon\nwater\n, for egg wash\nRaw sliced almonds\n, for decorating\nFor the Crème Mousseline:\n8\nounces\n(\n2\nsticks\n;\n225\ng\n)\nunsalted butter\n, softened to about 68°F (20°C)\n1\nrecipe\nvanilla pastry cream\n, at room temperature, about 68°F (20°C)\nFor Assembling the Paris–Brest:\nPowdered sugar\n, for dusting\nDirections\nFor the Praline Paste:\nLightly grease a rimmed baking sheet (quarter-size is ideal, but half-size will also work) and set aside. In a 2-quart stainless steel saucepan or saucier, combine water, sugar, corn syrup, hazelnuts, almonds, and salt. Cook over medium heat, stirring frequently with a heat-resistant spatula to ensure sugar dissolves and doesn't scorch, until mixture darkens to a tawny brown, and registers 320°F (160°C) on a clip-on digital thermometer, about 10 minutes.\nSerious Eats / Debbie Wee\nRemove from heat, then immediately stir in baking soda, folding with heat-resistant spatula until candy is evenly foamy, then pour onto prepared baking sheet. Let cool to room temperature, about 30 minutes, then proceed immediately to the next step (if praline is allowed to sit out for an extended period of time after cooling, it will turn tacky and soft).\nSerious Eats / Debbie Wee\nBreak praline into pieces and transfer to bowl of a food processor. Pulse several times to pulverize candy, then let food processor run continuously until praline transforms into a thick, peanut butter–like paste, about 3 minutes. Transfer paste to a small bowl, cover, and set aside.\nSerious Eats / Debbie Wee\nFor the Choux:\nAdjust oven rack to middle position and preheat to 375°F (190°C). Using a pen or pencil, trace an 8-inch circle in the center of a 12 by 18-inch sheet of parchment paper. Flip parchment over so that drawn ring is on underside and set in a rimmed baking sheet; set aside. Pipe a small amount of choux paste under each corner of parchment paper lining the baking sheet (the dough acts as a glue and keeps the paper in place as you pipe).\nSerious Eats / Debbie Wee\nHolding filled pastry bag at a 90° angle, apply steady downward pressure and slowly pipe first ring of choux along traced circle. To stop piping, cease applying pressure and swirl pastry tip away from piped ring. Pipe a second ring of choux just inside first ring, making sure that the two rings are touching one another. Pipe a third, final ring of choux on top of, and nestling in the groove between, the two piped rings. To smooth out surface of dough, dip a finger into cold water and gently pat down any bumps.\nSerious Eats / Debbie Wee\nUsing a pastry brush, gently brush a light layer of egg wash over surface of choux dough, being careful not to let excess egg wash drip down onto the parchment. Sprinkle sliced almonds in an even layer over top.\nSerious Eats / Debbie Wee\nBake until choux ring is puffed, deeply golden brown, and feels hollow when carefully lifted from parchment with a spatula, about 35 minutes. Turn off oven, partially open oven door, and let stand for 30 minutes to allow choux ring to dry and fully set. Remove from oven and let cool completely, about 15 minutes.\nSerious Eats / Debbie Wee\nFor the Crème Mousseline:\nMeanwhile, in bowl of a stand mixer fitted with a paddle attachment, beat softened butter on medium speed until fluffy and light, about 5 minutes. Scrape down bowl and beater with a flexible spatula. Add prepared praline paste and beat on medium speed until well combined, about 3 minutes.\nSerious Eats / Debbie Wee\nWith mixer running at medium speed, add pastry cream, a few tablespoons at a time, pausing to scrape down bowl and paddle as needed, until thoroughly incorporated, about 30 seconds.\nSerious Eats / Debbie Wee\nSwitch to whisk attachment and whip mixture on medium speed until crème mousseline is soft and airy, about 3 minutes (see notes). Transfer crème mousseline to a pastry bag fitted with a 3/4-inch star tip.\nSerious Eats / Debbie Wee\nTo Assemble the Paris–Brest:\nTransfer cooled choux ring to a large cutting board. Holding a serrated knife parallel to board, make a small cut from the outside and slide it all the way through so tip comes out inside the ring. Gently slice ring in half horizontally, using a sawing motion while simultaneously rotating choux ring, to yield a top and bottom half. Carefully lift off top half and place it next to bottom half.\nSerious Eats / Debbie Wee\nPipe crème mousseline in an even 2-inch-high layer onto cut side of bottom half of choux ring, making sure to apply steady pressure while piping. Place top half of choux ring over piped filling, and dust top evenly with powdered sugar. Slice into portions with serrated knife, and serve.\nSerious Eats / Debbie Wee\nSpecial Equipment\n2-quart stainless steel saucier\n,\nfood processor\n,\ndisposable pastry bags\n,\nstand mixer\nNotes\nTo make smaller choux rings, trace two 4-inch circles about three inches apart on a sheet of parchment paper. Pipe prepared choux paste along traced circles, as described in Step 10. In Step 12, bake for 30 minutes, then proceed as directed.\nIf you only have skin-on hazelnuts, you can remove skins by first toasting nuts in a 350°F (180°C) oven until fragrant, about 10 minutes, then transfer to a clean dish towel. Fold it over warm hazelnuts, then rub through the towel until their paper skins flake off.\nThis recipe uses a 1/2 recipe\nchoux pastry\n. To do this, you can either cut the ingredients in half and proceed with the recipe as directed, or make a whole recipe, using half for the Paris–Brest and the remaining half to make\néclairs\nor\nchoux au craquelin\n.\nTo adjust consistency (if crème mousseline is cold and dense, or conversely warm and too soft), consult our\nguide on German buttercream\nfor detailed instructions on how to troubleshoot.\nMake-Ahead and Storage\nParis–Brest is best consumed the day it’s made.\nPraline paste can be stored in an airtight container at room temperature for up to 1 week or in the refrigerator for up to 1 month. Stir well before using.\nTo store an unfilled choux ring, wrap tightly in plastic and place in a large zipper-lock bag; it can be kept frozen for up to 1 month. To refresh choux ring, preheat oven to 350°F (177°C). Transfer frozen choux ring to a half-sheet tray and reheat until crisp, about 5 minutes. Let cool at room temperature before slicing and filling.\nTo store crème mousseline, transfer to a large zipper-lock bag, press out air, and seal. Crème mousseline can be refrigerated up to 2 weeks and frozen up to several months. Bring to room temperature, approximately 68°F (20°C), then re-whip in stand mixer with whisk attachment before using.\nFrench\nDesserts\nThe Latest"
}