{
  "url": "https://www.seriouseats.com/parker-house-rolls-recipe-8733832",
  "image_url": "https://www.seriouseats.com/thmb/ypE9XBQcEWWHr6qLQkaVoIaEJrE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241002-SEA-ParkerHouseRolls-FredHardy-Hero1-01-0e5ad794e04b47bda91680b8761f43fe.jpg",
  "tags": [
    "Rolls & Buns",
    "The Latest",
    "Bread"
  ],
  "title": "Parker House Rolls",
  "full_text": "Parker House Rolls\nClose\nJump to recipe\nPrep\n45 mins\nCook\n20 mins\nProofing Time\n2 hrs 15 mins\nTotal\n3 hrs 20 mins\nServes\n15\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n19.125 ounces (542g;\n4 1/4\ncups\n)\nall-purpose flour\n, plus more for dusting surface\nOne 1/4-ounce package\ninstant yeast\n(\n2 1/4\nteaspoons;\n7g)\n1\ntablespoon\n(9g) Diamond Crystal\nkosher salt;\nfor table salt, use half as much by volume\n1 1/4 cup (\n290\nml)\nwhole milk\n, at room temperature\n1 3/4 ounces (50g;\n1/4\ncup\n)\ngranulated sugar\n1\nlarge\negg\nplus 1 large egg yolk\n4\ntablespoons\n(58g)\nunsalted butter,\nsoftened and cut into 4 pieces, plus 2 tablespoons (28g) melted butter\nCooking\ns\npray\nFor Finishing the Rolls:\n4\ntablespoons\n(58g)\nunsalted butter,\nmelted\n1\nlarge\negg\n1\nteaspoon (5ml)\ntap water\n1\nteaspoon\n(3g) flaky\nsea salt\n(such as Maldon)\nDirections\nFor the Dough:\nIn the bowl of a stand mixer, whisk together flour, yeast, and salt until combined. In medium bowl or 2-cup liquid measuring cup, whisk milk, sugar, egg, and egg yolk until combined. Set mixer bowl into stand mixer base and fit mixer with dough hook. On medium-low speed, slowly pour in the liquid mixture until dough comes together and no dry flour remains, about 2 minutes, scraping down bowl and dough hook frequently. Increase speed to medium and, with mixer running, add 4 tablespoons butter, 1 piece at a time, allowing each piece to incorporate before adding next, about 2 minutes total, scraping down bowl and dough hook as needed. Continue to knead on medium speed until dough is elastic, sticky, and pulls away cleanly from sides of bowl, about 10 minutes longer.\nSerious Eats / Fred Hardy\nTransfer dough to a lightly greased large bowl. Cover with plastic wrap or a kitchen towel and set aside to proof at room temperature until about doubled in size and, about 60 to 90 minutes. (Dough is properly proofed when it slowly springs back to its original shape when gently pressed with your knuckle).\nSerious Eats / Fred Hardy\nPunch down dough and turn dough out onto a lightly floured work surface. Divide dough into 15 even portions (about 2.25 ounces; 65g each). Working with 1 dough portion at a time, cup dough with your palm and roll against counter into a smooth, tight ball. Cover balls loosely with a clean towel or greased plastic wrap and let rest for 10 minutes.\nSerious Eats / Fred Hardy\nWorking with one dough ball at a time, gently stretch dough into a rough rectangular shape, about 2 inches wide by 5 inches long. Brush the top side with a generous layer of melted butter and fold dough in half over itself, stretching the top half slightly over the edge of the bottom half to create a square that measures roughly 2 inches x 2 inches. Transfer to a buttered 9- x 13-inch baking pan, flat side down. Repeat with remaining dough balls, arranging folded dough squares into pan in 3 rows of 5.\nSerious Eats / Fred Hardy\nCover pan with a kitchen towel or loosely with a piece of greased plastic wrap and proof at room temperature until rolls are puffed but not quite doubled in size, and dough springs back slowly with poked, about 45 minutes.\n6.\nFor Finishing the Rolls:\nWhile buns proof, adjust oven rack to middle position and preheat oven to 350°F (175℃). When ready to bake, in a small bowl, beat egg and water until smooth. Using a pastry brush, brush the tops of the rolls evenly with the egg wash. Bake until golden brown and an instant read thermometer inserted in center of rolls registers 190℉ (87℃), 20 to 30 minutes.\nSerious Eats / Fred Hardy\nImmediately brush hot rolls with reserved melted butter and sprinkle with flaky sea salt. Let cool slightly, about 20 minutes, before serving warm. Or let cool completely in pan on a wire rack, about 1 hour, to serve at room temperature.\nSerious Eats / Fred Hardy\nSpecial Equipment\nStand-mixer with dough hook, pastry brush, 9- x 13-inch baking dish\nMake-Ahead and Storage\nThe baked rolls can be stored covered at room temperature for 1 day. To refresh them before serving, wrap them in aluminum foil and heat them in a 350°F (175℃) oven until warmed through, about 15 minutes.\nRolls & Buns\nThe Latest\nBread",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/parker-house-rolls.webp?"
}