{
  "url": "https://www.seriouseats.com/pasta-e-fagioli-italian-bean-pasta-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/QXx_P7Ye97KJ0VwDuNqjQsexAuk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/pasta-e-fagioli-italian-bean-pasta-soup-recipe-photo-06-ebaa4a15e89246dcb274d500d037f5ed.JPG",
  "tags": [
    "Soups",
    "Italian",
    "Beans",
    "Pastas"
  ],
  "title": "Pasta e Fagioli (Italian Bean and Pasta Soup)",
  "full_text": "Pasta e Fagioli (Italian Bean and Pasta Soup)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n105 mins\nActive\n25 mins\nTotal\n110 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\ndried\nbeans, such as\ncranberry (borlotti) beans\nor cannellini beans, soaked overnight in salted water (see notes)\nKosher or sea salt\n6\ncloves\ngarlic\n, peeled\n1\nmedium\nonion\n, peeled and halved\n2\nmedium\ncarrots\n, peeled and halved crosswise\n2\nribs\ncelery\n, halved crosswise\n3\nlarge sprigs\nfresh sage\nand/or rosemary\n1/2\npound\n(\n227\ng\n)\nsmall pasta\n, such as ditalini or small shells\nExtra-virgin olive oil\n, for drizzling\nFreshly ground black pepper\nDirections\nIn a large pot, cover beans with lightly salted water by at least 2 inches. Add garlic, onion, carrots, celery, and rosemary or sage. Cover and bring to a boil over high heat. Reduce heat to a bare simmer and cook, covered, until beans are very tender and creamy with no graininess left, 45 to 90 minutes, depending on type of bean. Beans can also be cooked in a pressure cooker at low pressure for 25 minutes. Discard onions, garlic, carrots, celery, and herbs. Drain beans, reserving beans and liquid separately. You should have about 6 cups of cooked beans.\nSerious Eats / Fred Hardy\nMeasure out 3 cups of cooked beans, setting the remaining beans (approximately 3 cups) aside. In a blender jar, combine the 3 cups of beans with 4 cups bean-cooking water and blend until completely smooth. Return bean puree to pot and add reserved cooked beans.\nSerious Eats / Fred Hardy\nIn a small pot of salted boiling water, cook pasta until just short of al dente (about 3 minutes less than cooking time on package). Drain, then transfer to a bowl or container and drizzle with a small amount of olive oil, tossing to lightly coat.\nSerious Eats / Fred Hardy\nWhen ready to serve, bring to a simmer, thinning with additional bean-cooking water until soup reaches a lightly creamy consistency. Season with salt, if needed. Spoon in cooked pasta and simmer just until warmed through. Serve right away, drizzling fresh olive oil on top and a generous grinding of black pepper.\nSerious Eats / Fred Hardy\nSpecial Equipment\nBlender\nor\nimmersion blender\nNotes\nInstead of being soaked overnight, beans can also be prepared using the quick-soak method. Cover with water in a large pot, bring to a boil, remove from heat, and let rest for 1 hour. Drain and proceed with the recipe as directed.\nMake-Ahead and Storage\nSoup and pasta can be refrigerated separately for up to 3 days. Only combine as much pasta and soup as you plan to serve at any given time, as pasta left to stand in the soup any longer than necessary will expand and become mushy while sucking up the liquid.\nSoups\nItalian\nBeans\nPastas"
}