{
  "url": "https://www.seriouseats.com/pasta-alla-zozzona-rigatoni-with-sausage-and-egg-yolks",
  "image_url": null,
  "tags": [
    "Pastas",
    "Italian",
    "Stovetop Pasta",
    "Pancetta & Guanciale",
    "Sausages"
  ],
  "title": "Pasta Alla Zozzona (Rigatoni With Sausage, Guanciale, and Egg Yolks)",
  "full_text": "Pasta Alla Zozzona (Rigatoni With Sausage, Guanciale, and Egg Yolks)\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n25 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\negg yolks\n(\n45\ng\n)\n2\nounces\n(\n60\ng\n) finely grated\nPecorino Romano cheese\n, plus more for serving\nKosher salt\nand freshly ground black pepper\n4\nounces\n(\n115\ng\n)\nguanciale\n(cured pork jowl) or pancetta, cut into 1/4-inch-thick batons (see note)\n6\nounces\n(\n170\ng\n) sweet or\nhot Italian sausage\n(\n2\nlinks\n), removed from casing\n1\nsmall\nonion\n(about\n4 ounces; 115 g\n), finely chopped\nPinch\nred pepper flakes\n(optional)\n2\ncups\n(\n500\ng\n)\ntomato passata\n(see note)\n12\nounces\n(\n340\ng\n)\nrigatoni\nDirections\nIn a small bowl, beat egg yolks and Pecorino Romano together with a fork until they form a homogeneous thick paste, about 1 minute. Season with a few grindings of black pepper. Set aside.\nSerious Eats / Sasha Marx\nIn a large skillet, cook guanciale over medium-low heat, stirring occasionally, until fat has rendered and guanciale is golden brown and crisp, about 15 minutes. Remove from heat. Using slotted spoon, transfer guanciale to a plate. Set aside.\nSerious Eats / Sasha Marx\nUsing clean hands, add sausage to skillet by pinching off 3/4- to 1-inch pieces and arranging in a single layer in the pan. Alternatively, add sausage to skillet all at once, then break up into pieces with a wooden spoon, spreading them out evenly in the pan. Cook over medium heat, undisturbed, until bottom side is light golden brown, about 1 minute. Add onion, season lightly with salt, and, using a thin metal spatula, turn sausage pieces onto uncooked side. Continue to cook, stirring occasionally, until sausage is cooked through, onion is softened, and fat in the pan is clear and no longer cloudy, 5 to 7 minutes; lower heat at any point if sausage or onion threaten to scorch.\nSerious Eats / Sasha Marx\nAdd pepper flakes (if using) and bloom in rendered fat until aromatic, about 30 seconds. Add tomato passata, season lightly with salt, and bring to a simmer. Cook, stirring occasionally, until sauce has thickened slightly and fat has emulsified into sauce, about 10 minutes.\nSerious Eats / Sasha Marx\nMeanwhile, in a pot of lightly salted boiling water, cook pasta until softened on the exterior, but well shy of al dente, and still uncooked in the center (about 3 minutes less than the package directs). Using a spider skimmer, transfer pasta to sauce, along with 1/2 cup (120ml) pasta cooking water. Transfer an additional 1/4 cup (60ml) pasta cooking water to bowl with reserved egg yolk-Pecorino Romano paste, and stir with a rubber spatula until smooth and well-combined; set aside. Alternatively, if you don't have a spider skimmer, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 1/2 cups (355ml) pasta cooking water, before proceeding with above instructions.\nSerious Eats / Sasha Marx\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is thickened and coats noodles, about 2 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed.\nSerious Eats / Sasha Marx\nRemove skillet from heat, add cooked guanciale and egg yolk mixture, and stir and toss rapidly until fully incorporated and pasta is glossy, 15 to 30 seconds. Season with salt and pepper to taste. Serve immediately, passing more grated cheese at the table.\nSerious Eats / Sasha Marx\nSpecial Equipment\nLarge skillet\n,\nslotted spoon\n,\nspider skimmer\nNotes\nGuanciale can be found at specialty Italian markets or\nonline\n. If the guanciale you purchase has the skin/rind on, make sure to trim off and discard it when cutting into batons. As with bacon, guanciale and pancetta are both\neasier to slice and dice when slightly frozen\n; pop the guanciale in the freezer for 15 minutes before cutting. If using pancetta, try to use \"tesa\" slab pancetta that is usually firmer and more cured than rolled pancetta.\nJarred tomato passata can be found in the canned tomato aisle in supermarkets or Italian markets. If you can’t find passata, you can substitute with an equal amount by volume or weight of whole peeled tomatoes that have been either quickly blended with an immersion blender, passed through a food mill, or crushed by hand (hand-crushed tomatoes won't produce a sauce with the same smoothness as one made with passata).\nMake-Ahead and Storage\nThis dish is best enjoyed immediately. Leftovers can be refrigerated in an airtight container for up to 3 days.\nRead More\nAll About Tomato Passata\nGricia, Amatriciana, Carbonara: The Origins of Rome's Pasta Classics\nRagú Napoletano (Neapolitan-Style Italian Meat Sauce with Pork Beef and Sausage) Recipe\nMalloreddus Alla Campidanese (Sardinian Ridged Pasta With Saffron and Pork Ragù)\nPastas\nItalian\nStovetop Pasta\nPancetta & Guanciale\nSausages"
}