{
  "url": "https://www.seriouseats.com/pasta-e-ceci-pasta-with-chickpeas",
  "image_url": null,
  "tags": [
    "Chickpeas",
    "Pastas",
    "The Latest"
  ],
  "title": "Pasta e Ceci (Pasta With Chickpeas)",
  "full_text": "Pasta e Ceci (Pasta With Chickpeas)\nJump to recipe\nCook\n35 mins\nActive\n20 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, plus extra for drizzling\n4\nmedium\ngarlic cloves\n(\n20\ng\n), lightly crushed\n1\nsprig\nfresh rosemary\nKosher salt\n1/4\nteaspoon\nred pepper flakes\n2\ntablespoons\n(\n30\ng\n)\ntomato paste\n1/2\ncup\n(\n120\nml\n)\ndry white wine\n3\ncups\n(\n1\npound\n2\nounces\n;\n510\ng\n)\ncooked dry chickpeas\nor\n2\n(15-ounce; 425 g) cans\nlow-sodium chickpeas\n, drained and rinsed, divided (see note)\n4\ncups\n(\n950\nml)\nchickpea cooking liquid\n,\nhomemade\nchicken\nor\nvegetable\nstock\n, or\nstore-bought low-sodium chicken stock\n, divided (see note)\n1/4\nteaspoon\nfreshly ground black pepper\n8\nounces\n(\n225\ng\n)\nsmall tubular pasta\n, such as\nditalini\n2\nounces\n(\n55\ng\n) f\ninely grated Pecorino Romano cheese\n, plus extra for serving\nDirections\nIn a large Dutch oven, heat oil over medium heat until shimmering. Add garlic and rosemary, season lightly with salt, and cook, stirring frequently, until garlic softens and turns golden, about 5 minutes. Add pepper flakes and continue to cook, stirring constantly, until fragrant, about 30 seconds. Add tomato paste and cook until tomato paste is fragrant and turns dark brick red, about 1 minute.\nSerious Eats / Andrew Janjigian\nStir in wine, scraping up any browned bits with a wooden spoon. Bring to a simmer, and cook until wine has emulsified with olive oil and mixture is slightly reduced, about 2 minutes.\nSerious Eats / Andrew Janjigian\nIf using cooked dry chickpeas:\nStir in 1 cup (170g) chickpeas and 1 cup (240ml) chickpea cooking liquid. Using a potato masher or wooden spoon, mash chickpeas against the sides and bottom of the pot until completely broken down. Stir in the rest of the chickpeas and remaining 3 cups (710ml) cooking liquid (supplementing with stock or water as needed to reach 3 cups), and black pepper. Season with salt to taste. Proceed to Step 4.\nIf using canned chickpeas:\nRemove Dutch oven from heat; remove and discard rosemary sprig. Add 1 cup (170g) chickpeas and 1 cup (240ml) stock, and using an immersion blender, blend mixture until smooth, 1 to 2 minutes. (If you do not have a handheld immersion blender, transfer mixture to blender and blend until smooth, about 1 minute. Pour mixture back into Dutch oven.) Stir in remaining 2 cups (340ml) of chickpeas, 3 cups (710ml) stock, and black pepper. Season with salt to taste.\nSerious Eats / Andrew Janjigian\nBring chickpea mixture to a boil over medium-high heat. Stir in pasta and cook, stirring frequently, until pasta is just shy of al dente (1 to 2 minutes less than the package directs, as the pasta will continue to cook off-heat), and liquid is reduced to a consistency that falls between soupy and saucy. Adjust consistency as needed with additional water, stock, or chickpea cooking liquid, keeping in mind that liquid will tighten up as it cools due to starch from the chickpeas.\nSerious Eats / Andrew Janjigian\nRemove from heat, add cheese, and stir rapidly to incorporate. Season with salt to taste. Divide between individual serving bowls (for the dried chickpea version, look out for the garlic cloves and rosemary sprig; remove and discard them), and drizzle each serving with olive oil. Serve, passing extra grated cheese at the table.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nDutch oven\n,\nimmersion blender\nor\ncountertop blender\nNotes\nIf cooking dried chickpeas, you can follow our basic\nstovetop or oven methods for cooking beans\n, or\nif you have a pressure cooker\n, you can cook beans that way as well. If using cooked dried chickpeas, use reserved chickpea cooking liquid for the 4 cups (950ml) of liquid called for in this recipe; if you don't have a full 4 cups of leftover cooking liquid, supplement with homemade vegetable or chicken stock, store-bought low-sodium chicken, or water to reach that volume. The body provided by the chickpea cooking liquid is sufficient to thicken the soup, so there shouldn't be a need to blend any portion of the liquid and chickpeas.\nIf using canned chickpeas, use homemade or store-bought stock for the 4 cups of liquid, and follow the blending instructions as written. We don't recommend using the liquid from the chickpea cans for making this recipe; it produces an overly thick and gloppy texture. And because salinity levels vary so much across brands of canned beans and chickpeas, using the liquid makes it hard to control the seasoning of the dish.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately. Leftovers can be refrigerated in an airtight container for up to 2 days. Reheat gently on the stovetop, adding a splash of stock or water to loosen the sauce.\nRead More\nChicken Tagine with Pistachios, Dried Figs, and Chickpeas\nEverything You Can Do with a Can of Chickpeas\nChickpeas\nPastas\nThe Latest"
}