{
  "url": "https://www.seriouseats.com/pasta-butternut-squash-sage-brown-butter-recipe",
  "image_url": null,
  "tags": [
    "Pasta Mains",
    "Italian",
    "Pastas",
    "Sage",
    "Butternut Squash"
  ],
  "title": "Pasta With Butternut Squash and Sage Brown Butter",
  "full_text": "Pasta With Butternut Squash and Sage Brown Butter\nJump to recipe\nCook\n25 mins\nActive\n30 mins\nTotal\n25 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nextra-virgin olive oil\n(\n30\nml\n)\n1\npound\nbutternut squash\n, peeled, seeded, and cut into 1/2-inch cubes (\n450\ng\n; about\n1/2\nlarge\nsquash)\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\nunsalted butter\n(\n30\ng\n)\n1\nsmall\nshallot\n, finely minced (about\n1 ounce; 30 g\n)\n1\nhandful fresh\nsage leaves\n, finely minced (about\n1/2 ounce; 15 g\n)\n1\ntablespoon\njuice\nfrom\n1\nlemon\n(\n15\nml\n)\n1\npound\nsmall cupped, tubular, or ridged pasta such as orecchiette, penne,\nfarfalle\n, or rotini (\n450\ng\n)\n1\nounce\ngrated fresh\nParmigiano-Reggiano cheese\n(\n30\ng\n)\nDirections\nHeat olive oil in a large stainless steel or cast-iron skillet over high heat until very lightly smoking. Immediately add squash, season with salt and pepper, and cook, stirring and tossing occasionally, until well-browned and squash is tender, about 5 minutes. Add butter and shallot and continue cooking, stirring frequently, until butter is lightly browned and smells nutty, about 1 minute longer. Add sage and stir to combine (sage should crackle and let off a great aroma). Remove from heat and stir in lemon juice. Set aside.\nSerious Eats / J. Kenji López-Alt\nIn a medium saucepan, combine pasta with enough room temperature or hot water to cover by about 2 inches. Season with salt. Set over high heat and bring to a boil while stirring frequently. Cook, stirring frequently, until pasta is just shy of al dente, about 2 minutes less than the package directions. Drain pasta, reserving a couple cups of the starchy cooking liquid.\nAdd pasta to skillet with squash along with a splash of pasta water. Bring to a simmer over high heat and cook until the pasta is perfectly al dente, stirring and tossing constantly and adding a splash of water as needed to keep the sauce loose and shiny. Off heat, stir in Parmigiano-Reggiano. Adjust seasoning with salt and pepper and texture with more pasta water as needed. Serve immediately, top with more cheese at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge\nstainless steel skillet\nor\ncast-iron skillet\n, medium\nsaucepan\nRead More\nPumpkin Orzo with Sage\nButternut Squash and Sage Cream Sauce\nHomemade Butternut Squash and Blue Cheese Ravioli\nRoasted Spaghetti Squash\nPasta Mains\nItalian\nPastas\nSage\nButternut Squash"
}