{
  "url": "https://www.seriouseats.com/pasta-prosciutto-peas",
  "image_url": "https://www.seriouseats.com/thmb/p_HqkDLtVGK0SVclZKmF4TZ8E1Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210301-pasta-prosciutto-piselli-andrew-janjigian-14-5dd6183d4f7b4776b38ab091b9614db5.jpg",
  "tags": [
    "Creamy Pastas",
    "Peas",
    "Pastas",
    "The Latest"
  ],
  "title": "Pasta Prosciutto e Piselli (Creamy Pasta With Prosciutto Cotto and Peas)",
  "full_text": "Pasta Prosciutto e Piselli (Creamy Pasta With Prosciutto Cotto and Peas)\nClose\nJump to recipe\nCook\n30 mins\nActive\n15 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n1\nsmall (\n6-ounce; 170 g\n)\nyellow onion\n, finely chopped\nKosher salt and freshly ground black pepper\n1\n(8-ounce; 225g) piece\nof\nprosciutto cotto\n, cut into 1/4-inch dice (see note)\n2\nteaspoons\nminced\nfresh rosemary\nleaves\n2\nteaspoons\nminced\nfresh thyme\nleaves\n1/4\ncup\n(\n60\nml\n)\ndry white wine\n1 1/2\ncups\n(\n355\nml\n)\nheavy cream\n1/4\nteaspoon\nfreshly\nground nutmeg\n1 1/2\ncups\n(\n8\nounces\n;\n225\ng\n)\nfrozen peas\n, thawed (see note)\n12\nounces\n(\n340\ng\n)\ndried penne rigate\n2\nounces\n(\n55\ng\n) finely grated\nParmigiano-Reggiano\nDirections\nIn a large skillet, melt butter over medium heat. Add onion, season lightly with salt, and cook until softened but not brown, about 6 minutes. Stir in prosciutto cotto, rosemary, thyme, and 1/4 teaspoon pepper. Cook until prosciutto cotto is warmed through and herbs are fragrant, about 4 minutes.\nAdd wine and cook until reduced by half, about 2 minutes. Add cream and nutmeg, bring to a simmer, and cook, stirring occasionally, until sauce is slightly thickened, about 2 minutes. Reduce heat to low to keep sauce warm, or turn off heat while pasta cooks if your stove isn't capable of cooking below a simmer.\nMeanwhile, in a pot of salted water, cook pasta until just shy of al dente (about 2 minutes less than the package directs). Using a spider skimmer, transfer pasta to sauce, along with 1/2 cup (120ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water.\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is thickened so that it coats noodles and just pools around edges of the pan, about 2 minutes; add more pasta cooking water in 1/4-cup (60ml) increments as needed to achieve desired consistency.\nRemove from heat, add peas and grated cheese, and stir rapidly to incorporate and heat peas through. Season with salt and pepper to taste. Serve immediately.\nSpecial Equipment\nLarge skillet, spider skimmer\nNotes\nProsciutto cotto can be found at the deli counter of some well-stocked grocery stores, and at Italian specialty shops. Ask for a single 8-ounce piece of ham, measuring approximately 1/4 inch thick. You don't want thinly sliced ham for this recipe. If you can’t find prosciutto cotto, you can substitute American-style ham steak, just make sure to use a lighter hand while seasoning both the sauce and pasta cooking water with salt, as American ham steak is generally saltier than Italian prosciutto cotto.\nBecause they are picked and frozen at the height of freshness, frozen peas are a better year-round choice than fresh peas. However, if you are making this dish during the height of spring pea season, and have access to high quality fresh peas, you can absolutely substitute those for frozen. If using fresh peas, blanch them in the boiling pasta water pot until just cooked through, 1 to 2 minutes, before adding to the pasta in Step 5.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately. Leftovers can be refrigerated in an airtight container for up to 5 days. Reheat over medium heat on the stovetop with 1 to 2 tablespoons (15 to 30ml) water to loosen the sauce.\nCreamy Pastas\nPeas\nPastas\nThe Latest"
}