{
  "url": "https://www.seriouseats.com/pastel-de-choclo-chilean-corn-and-beef-casserole-recipe-8687911",
  "image_url": "https://www.seriouseats.com/thmb/aj5puid4qN-4tK2ILAjhgs8jl9g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240725-SEA-PASTELDECHOCLO-EstudioComo-Hero-01-0f463c3f81134bb0a1dbbd79fe1068ae.jpg",
  "tags": [
    "Beef Mains",
    "The Latest",
    "Corn",
    "South American"
  ],
  "title": "Pastel de Choclo (Chilean Corn and Beef Casserole)",
  "full_text": "Pastel de Choclo (Chilean Corn and Beef Casserole)\nClose\nJump to recipe\nCook\n2 hrs 45 mins\nCooling Time\n15 mins\nTotal\n3 hrs\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Poached Chicken:\n4\nboneless,\nskinless\nchicken thighs\n(about 5 ounces; 140g each)\n1 medium white or\nyellow onion\n(8 ounces;\n225\ng)\n, peeled and quartered\n1 medium\ncarrot\n(4 ounces;\n113\ng)\n, peeled and cut into 1-inch pieces\n2\nteaspoons\ndried oregano\n(Italian or Chilean variety)\n1\nteaspoon\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nwhole black\npeppercorns\n1\nmedium\nclove garlic,\nhalved\n1\nbay\nleaf\nFor the Beef and Onion Stew (Pino):\n1/2\nteaspoon\nbaking soda\n2\npounds\n(900g)\n80% lean ground beef\n(see notes)\n3\ntablespoons\n(45ml) neutra\nl oil\nsuch as canola or vegetable oil, divided\n2\nteaspoons\nkosher salt,\ndivided; for table salt, use half as much by volume\n2 medium\nyellow onions\n(16 ounces;\n453\ng\ntotal), finely diced\n2\nteaspoons\nsweet\npaprika\nor Chilean ají de color\n2\nteaspoons\nground cumin\n2\ntablespoons\nall purpose flour\n1\ncup\n(240ml) reserved poached chicken\nliquid\nfrom above\nFor the Corn and Basil Puree (Pastelera)\n10\ncups\nraw fresh sweet\ncorn kernels\nor frozen corn kernels, thawed (about 3 pounds kernels; 8 to 10 ears of corn)\n1 1/2\ncups\n(355ml)\nwhole milk\nor unsweetened plant-based milk, plus more if needed\n1/2\nounce\nbasil leaves\n(about 20 leaves)\n6\ntablespoons (85g)\nunsalted butter\n1\nteaspoon\nkosher salt\n; for table salt, use half as much by volume\n3\ntablespoons\n(24g)\ncornstarch\nmixed into a slurry with 2 tablespoons cold water\nFor Assembling\n2\nhard-boiled eggs\n,\nquartered\n8\nlarge\nblack olives\n2\nheaping\ntablespoons\nraisins (1 ounce; 30g)\n2\ntablespoons\ngranulated sugar, for sprinkling\nA few\npinches\nsweet\npaprika\nor Chilean ají de color, for sprinkling\n2\ntablespoons\n(30g)\nunsalted butter,\ncut into 1/4-inch cubes\nCooking\nspray\nor\nadditional\nsoftened butter, for greasing the baking dish\nDirections\nFor the Poached Chicken:\nIn a large saucepan, add 1 quart cold water, chicken, onion, carrot, dried oregano, black peppercorns, salt, garlic, and bay leaf and bring to a simmer over medium-high heat. Gently simmer, adjusting heat as needed, until chicken is tender and registers 175℉ (80℃) with a digital thermometer, 20 to 25 minutes.\nSerious Eats / Estudio Como\nUsing tongs, remove the chicken from the poaching liquid and transfer to a cutting board; set aside to cool. Using a fine-mesh strainer set over a large bowl, strain the poaching liquid. Discard the strained solids and reserve the poaching liquid.\nSerious Eats / Estudio Como\nFor the Beef Stew:\nIn a medium bowl, whisk to combine 1 tablespoon water with baking soda. Add the ground beef and mix to combine. Let sit for 15 minutes. In a large stainless-steel or cast iron skillet, heat 1 tablespoon oil over high heat until shimmering. Add half of the beef and cook, without stirring, until browned on the bottom, about 3 minutes. Sprinkle with 1 teaspoon salt and, using a wooden spoon, stir and break the beef into small pieces until the beef is no longer pink, about 3 minutes. Transfer to a large bowl. Repeat with the remaining ground beef and 1 teaspoon salt, draining off excess fat from the beef and from the skillet.\nSerious Eats / Estudio Como\nReturn the now-empty skillet to medium heat and heat the remaining 2 tablespoons oil until shimmering. Add the onions and cook, stirring frequently, until softened, 7 to 10 minutes. Stir in the cumin and paprika and cook, stirring constantly, until fragrant, about 30 seconds. Add flour and cook, stirring constantly, until no dry flour remains, about 30 seconds. Slowly whisk in 2 cups of the reserved strained poached chicken broth, scraping the bottom of the skillet to release any browned bits. Add the reserved browned beef and bring to a boil over medium-high heat. Reduce heat as needed to maintain a simmer and cook, stirring occasionally, until the mixture is thickened, about 10 minutes. Transfer to a bowl to let cool slightly before assembling.\nSerious Eats / Estudio Como\nFor the Corn and Basil Puree:\nUsing a high-powered blender, blend 1/2 of the corn with half of the milk and half of the basil leaves until all whole kernels are broken down and only small specs of whole basil remain. If the mixture is too thick for blending, add more milk, 1 tablespoon at a time, as needed until it fully blends. Transfer to a bowl. Repeat with the remaining corn, milk, and basil.\nIn a large dutch oven or heavy bottomed pot, cook the butter over medium-low heat, stirring and swirling skillet constantly with rubber spatula, until milk solids have turned a light golden brown and butter has a nutty aroma, 2 to 4 minutes. As soon as the butter is browned, add the corn puree and salt and cook over medium heat, stirring frequently and making sure to scrape along the bottom of the pot to prevent scorching, until the mixture is boiling, about 15 minutes.\nSerious Eats / Estudio Como\nOnce boiling, reduce heat to low and cook, stirring frequently, until the mixture is very thick and the corn is cooked through, 15 to 20 minutes. Monitor the pot closely and be careful while stirring, as the mixture will bubble and might splatter as it thickens.\nSerious Eats / Estudio Como\nQuickly stir the cornstarch and water slurry to recombine, then stir into the corn puree. Continue to cook until the mixture is further thickened, 1 to 2 minutes. Transfer to a large heatproof bowl.\nSerious Eats / Estudio Como\nFor Assembling:\nAdjust oven racks to middle position and preheat the oven at 400℉ (200℃). Line a rimmed baking sheet with aluminum foil; set aside. Spray a 9- by 13-inch baking dish with cooking spray. Cut each cooled chicken thigh in half; set aside.\nSerious Eats / Estudio Como\nTransfer the cooled beef stew to the bottom of the prepared baking dish and spread in an even layer. Arrange the chicken pieces, egg quarters, olives and raisins evenly spaced over the beef layer. Pour the corn puree on top and spread into an even layer, leaving about 1/2-inch space around the perimeter. Save or freeze any remaining amounts of the corn puree (see notes).\nSerious Eats / Estudio Como\nSprinkle the top of the casserole with the granulated sugar and paprika. Dot the butter pieces evenly on top.\nSerious Eats / Estudio Como\nPlace the prepared casserole on the foil-lined baking sheet and and bake until hot and bubbly throughout and well browned on top, 30 to 40 minutes. Let cool at room temperature for 15 minutes before serving.\nSerious Eats / Estudio Como\nSpecial Equipment\nLarge saucepan, large stainless-steel or cast iron skillet, blender, Dutch oven, 9- by 13-inch baking dish.\nNotes\n2 pounds of finely minced flat iron or top blade steak can be substituted for the ground beef. Omit the baking soda step and sear the beef in batches and proceed with recipe as directed, extending the cooking time by about 5 minutes.\nIt is possible that the corn mixture ends up being an amount too large to fit the oven dish or individual ramekins or bowls you choose to use. The amount is enough to fit in a large and deep casserole dish or up to 8 Chilean traditional clay bowls, which are wide and deep. If you have leftover corn puree, refrigerate or freeze it to use as a side dish. It also makes a great breakfast with two fried eggs on top.\nThe recipe can be made in individual ramekins or Chilean clay pots. Follow the recipe as written and distribute all the ingredients evenly among 6 to 8 individual heatproof ramekins, transfer to a baking sheet, and shorten baking time to 20 to 25 minutes.\nMake-Ahead and Storage\nThe beef pino\nand the chicken can be cooked and refrigerated separately for up to 3 days before assembling.\nThe corn puree can be made ahead and refrigerated for up to 3 days before assembling. Make sure to warm the puree before layering, thinning with milk as needed to return it to a spreadable texture.\nThe casserole can be assembled ahead or baked ahead and refrigerated for up to 4 days. Reheat on middle rack in oven 350℉(175℃) until heated through, bubbly, and the top is well carmelized, about 30 minutes. Cover with aluminum foil if topping becomes too brown.\nFreeze any leftovers or the whole dish for up to 3 months. If freezing is the plan, do not include hard boiled eggs as their texture becomes gummy.\nBeef Mains\nThe Latest\nCorn\nSouth American"
}