{
  "url": "https://www.seriouseats.com/pastillas-de-leche-5180201",
  "image_url": "https://www.seriouseats.com/thmb/NN8oATYg3gu3D8hHzpUSQIy836Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210423-Pastillas-de-Leche-Debbie-Wee-RAW-26-47559bf0fd754a0a9b74997e1c8e3988.jpg",
  "tags": [
    "Candy",
    "Filipino",
    "Southeast Asian",
    "Dairy Milk",
    "The Latest"
  ],
  "title": "Pastillas de Leche (Filipino Milk Candies)",
  "full_text": "Pastillas de Leche (Filipino Milk Candies)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n95 mins\nChilling Time\n90 mins\nTotal\n3 hrs 20 mins\nServes\n4 servings\nMakes\n16 two-inch pastillas de leche\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n470\nml\n)\nmilk\n, any fat percentage\n3\nfluid ounces\n(\n90\nml\n)\nheavy cream\n2\nounces\n(\n1/4\ncup\n;\n55\ng\n)\ngranulated sugar\n, plus extra for coating the pastillas\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n2\nounces\n(\n1/4\ncup\n;\n55\ng\n)\npowdered whole milk\nDirections\nIn a 10-inch stainless steel skillet, combine milk and heavy cream, and bring to a simmer over medium heat, stirring occasionally with a rubber spatula to prevent a skin from forming on the sides of the pan. Reduce heat to maintain a gentle simmer and cook, stirring and scraping frequently, until mixture is reduced by half, about 30 minutes.\nSerious Eats / Debbie Wee\nAdd sugar and salt, and stir to combine. Continue to cook, stirring frequently, until mixture has reduced to a viscous paste-like consistency (it is ready when you drag the spatula against the bottom of the pan and the milk mixture is slow to fill the space left behind), about 1 hour.\nSerious Eats / Debbie Wee\nTransfer to a heatproof medium bowl (you should have about 3/4 cup (6 ounces; 170g) of milk paste), add powdered milk, and stir until thoroughly combined. Continue stirring until no dry powder remains, and a sticky dough forms, about 30 seconds. Let cool to room temperature, about 30 minutes. Cover bowl with plastic wrap and refrigerate until chilled, at least 1 hour and up to 8 hours.\nSerious Eats / Debbie Wee\nLightly grease your hands with cooking spray, and transfer chilled dough to a clean cutting board. Using your hands, roll dough into a roughly 5-inch long cylinder. Using a paring knife or bench scraper, divide cylinder in half crosswise. Roll each piece into a 5-inch long cylinder. Divide each cylinder into 8 equal portions (1/2 ounce; 15g each). Using your hands, roll each portion between your palms into a 2-inch long cylinder. At this point, pastillas can be transferred to an airtight container and refrigerated for up to 1 week until ready to serve.\nSerious Eats / Debbie Wee\nWhen you are ready to serve, place 1/2 cup sugar (4 ounces; 115g) in a wide, shallow bowl. Add up to 4 pastillas at a time to the bowl and shake to coat pieces on all sides with sugar. Transfer sugar-coated pastillas to a serving plate, and repeat coating process with remaining pastillas. Serve.\nSerious Eats / Debbie Wee\nSpecial Equipment\n10-inch\nstainless steel skillet\nNotes\nIf desired, you can also shape pastillas into balls instead of cylinders.\nMake-Ahead and Storage\nUncoated pastillas can be refrigerated in an airtight container for up to 1 week. Roll in sugar before serving.\nRead More\nMilk Creams (Indian Cashew Sweets) Recipe\nHomemade Milk Duds Recipe\nSmoked Salt Caramels Recipe\nCandy\nFilipino\nSoutheast Asian\nDairy Milk\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pastillas-de-leche-filipino-milk-candies.webp?"
}