{
  "url": "https://www.seriouseats.com/pastsa-con-la-bottargal-spaghetti-with-bottarga",
  "image_url": "https://www.seriouseats.com/thmb/2hjhnsSBmg79qhn3F6pK0XpOEKM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20210222-Bottarga-sasha-marx-12-517b7217f38d42ab947587c2cd355679.jpg",
  "tags": [
    "Pasta Mains",
    "Italian",
    "Stovetop Pasta",
    "Spaghetti, Bucatini, & Linguine",
    "Fish"
  ],
  "title": "Pasta con la Bottarga (Pasta With Bottarga) Recipe",
  "full_text": "Pasta con la Bottarga (Pasta With Bottarga) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n10 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nounces\n(\n60\ng\n; about\n1\nwhole\nlobe)\nmullet bottarga\n(see note)\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n2\ngarlic\ncloves\n(\n10\ng\n), lightly crushed\n1/4 to 1/2\nteaspoon\nred pepper flakes\nKosher salt\n12\nounces\n(\n340\ng\n)\ndried long pasta\nsuch as spaghetti, spaghettoni, or linguine\n1\nloosely packed\ncup\n(\n1/2\nounce\n;\n15\ng\n)\nfresh parsley\nleaves and tender stems, finely chopped\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice\n, plus finely grated\nzest\nof\n1\nlemon\nDirections\nUsing a sharp knife, gently score bottarga lobe down its length to expose pellicle, or membrane. Using your hands, peel away pellicle and discard. Using a rasp grater (Microplane), finely grate all but 1/4 ounce (10g; about 2-inch piece) bottarga onto a plate or small rimmed baking sheet. Set aside grated bottarga, as well as the remaining small piece of bottarga and grater.\nSerious Eats / Sasha Marx\nIn a large skillet or straight-sided sauté pan, combine oil and garlic. Cook over medium heat, turning garlic cloves occasionally, until garlic is deep golden brown on all sides, about 5 minutes. Using tongs or a slotted spoon, remove garlic from skillet; reserve garlic for another use or discard. Add red pepper flakes and continue to cook, stirring constantly, until fragrant, about 30 seconds.\nSerious Eats / Sasha Marx\nRemove skillet from heat, add all of the grated bottarga (1 3/4 ounces; 50g), and stir until well-combined with olive oil; set aside.\nSerious Eats / Sasha Marx\nMeanwhile, in a wide-bottomed pot, combine 3 quarts (3L) of water and 1 tablespoon (12g) salt, and bring to a boil over high heat. Add pasta and cook, stirring frequently for first 30 seconds to prevent noodles from sticking. Cook pasta until al dente (start tasting noodles for doneness 2 minutes before suggested cooking time on package). Just before pasta is ready, transfer 1/2 cup (120ml) pasta cooking water to skillet with olive oil-bottarga mixture, and stir to combine with a rubber spatula.\nSerious Eats / Sasha Marx\nUsing tongs, transfer pasta to skillet (which remains off-heat), and reserve remaining pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water. Rapidly stir and toss pasta until sauce is emulsified, evenly coats noodles, and pools around edges of the skillet, 30 seconds to 1 minute, adding more pasta cooking water in 1/4 cup (60ml) increments as needed to adjust consistency of sauce.\nSerious Eats / Sasha Marx\nAdd parsley, lemon juice, and zest, and stir to combine. Season with salt to taste. Divide between individual serving bowls, grate remaining bottarga over top, and serve.\nSerious Eats / Sasha Marx\nSpecial Equipment\nRasp grater\n,\nlarge skillet\nor\nsauté pan\nNotes\nGrey mullet bottarga, or \"bottarga di muggine\" in Italian, is sold at some Italian specialty shops and online. It is sold as whole roe sac lobes, or already grated. As with hard cheeses, for optimal flavor we recommend buying whole pieces and grating it yourself. Make sure to peel off the pellicle, as instructed in the recipe, before grating or slicing bottarga for other uses. Leftover pieces of bottarga can be wrapped tightly in plastic and refrigerated for months (technically bottarga does not need to be refrigerated, if you can store it in cool, dark place, but unless you're lucky enough to have a cool cellar, we recommend stashing it in the fridge).\nMake-Ahead and Storage\nThis quick and easy dish is best enjoyed immediately.\nRead More\nBottarga: What It Is, How to Use It, and Whether It's Worth It\nCreamy Sea Urchin (Uni) Pasta\nPasta Burro e Alici (Pasta With Creamy Anchovy-Butter Sauce) Recipe\nJapanese Mentaiko Spaghetti (Pasta With Spicy Cod Roe and Butter Sauce)\nPasta Mains\nItalian\nStovetop Pasta\nSpaghetti, Bucatini, & Linguine\nFish"
}