{
  "url": "https://www.seriouseats.com/pasta-alla-gricia",
  "image_url": null,
  "tags": [
    "Pasta Mains",
    "Italian",
    "Pancetta & Guanciale",
    "Quick Dinners",
    "Valentine's Day"
  ],
  "title": "Pasta alla Gricia Recipe",
  "full_text": "Pasta alla Gricia Recipe\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n15 mins\nChilling Time\n15 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(\n225\ng\n) guanciale (\ncured pork jowl\n), in one piece\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\n12\nounces\n(\n340\ng\n)\nrigatoni\n2\nounces\n(\n60\ng\n) finely grated\nPecorino Romano cheese\n, plus more for serving\nDirections\nFreeze guanciale for at least 15 minutes, and up to 45 minutes (partially freezing the guanciale makes it easier to slice). Using a sharp chef's knife, cut into 1/4-inch-thick planks, then cut planks into 1/4-inch-thick batons (lardons).\nSerious Eats / Vicky Wasik\nIn a large 12-inch stainless steel skillet, heat oil over medium-low heat until shimmering. Add guanciale and cook, stirring occasionally, until fat has rendered and guanciale is golden brown and crisp, about 15 minutes. Using a slotted spoon, transfer guanciale to a plate; set aside. Reduce heat to low, and bloom about 1 teaspoon freshly ground black pepper in rendered guanciale fat until pepper foams and is aromatic, about 1 minute. Remove skillet from heat.\nSerious Eats / Vicky Wasik\nMeanwhile, in a Dutch oven or medium pot, bring 3 quarts of water and 2 teaspoons kosher salt to a boil over high heat. Set a colander inside a large heatproof bowl in the sink. Add rigatoni to water and cook, stirring frequently during the first minute to prevent pasta from sticking.\nOnce pasta has cooked for 4 minutes 30 seconds, transfer 2 cups (475ml) of starchy pasta water to skillet. Return skillet to high heat and bring to a boil, swirling to emulsify pasta water with guanciale fat.\nWhen pasta has cooked for a total of 5 minutes, drain in prepared colander, then transfer pasta to skillet (the pasta will be very undercooked at this point, but it will continue cooking in the skillet); reserve drained pasta water.\nCook rigatoni, swirling skillet constantly and gently stirring with a spoon or rubber spatula, to ensure even cooking and that the sauce remains emulsified, until pasta is al dente and sauce is thickened and reduced, 6 to 8 minutes; if sauce reduces too much before pasta has finished cooking, add more reserved pasta water to skillet in 1/4-cup increments. Add guanciale to skillet and carefully toss to combine.\nSerious Eats / Vicky Wasik\nRemove from heat, add half of the grated Pecorino Romano, and toss or stir rapidly to combine. Once cheese is fully emulsified in the sauce, add remaining Pecorino Romano, and toss or stir rapidly once more to combine. Adjust sauce consistency as needed with more pasta water. Season with salt and pepper, if needed. Serve right away, passing more cheese at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nChef's knife\n, Large\nstainless steel skillet\nMake-Ahead and Storage\nThis dish is best enjoyed immediately.\nPasta Mains\nItalian\nPancetta & Guanciale\nQuick Dinners\nValentine's Day"
}