{
  "url": "https://www.seriouseats.com/pasta-rich-hearty-mushroom-bolognese-recipe",
  "image_url": "https://www.seriouseats.com/thmb/592pxVHZZkXBr3I1yjfewY9FwLo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__02__20140206-mushroom-ragu-recipe-primary-2-ebf1a947632e4f319347a24a1df0f516.jpg",
  "tags": [
    "Dairy-free Mains",
    "Vegan Mains",
    "Vegetarian Mains",
    "Pastas",
    "Eggplant"
  ],
  "title": "Pasta With Rich and Hearty Mushroom Bolognese Recipe",
  "full_text": "Pasta With Rich and Hearty Mushroom Bolognese Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs\nActive\n45 mins\nCooling Time\n15 mins\nTotal\n2 hrs 20 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nmedium\neggplant\n1/2\ncup\nextra-virgin olive oil\n, divided, plus more for serving\nKosher salt\nand freshly ground black pepper\n1\nmedium\nonion\n, finely diced (about\n1\ncup\n)\n2\nmedium\ncarrots\n, finely diced (about\n1\ncup\n)\n2\nlarge\nribs celery\n, finely diced (about\n1\ncup\n)\n1/4\ncup\nfinely chopped fresh\nsage leaves\n1/4\ncup\nfinely chopped\nfresh parsley\nleaves\n1/4\ncup\nfinely\nchopped fresh basil leaves\n4\nmedium\ncloves garlic\n, minced\n2\ncups\ndry red wine\n3\nbay leaves\n1\npound\nbutton mushrooms\n, finely chopped (see notes)\n12\nounces\nshiitake mushrooms\n, stems discarded, caps finely chopped\n1/4\ncup\ntomato paste\n2\ntablespoons\nwhite or red\nmiso paste\n1\n(\n28-ounce) can\nwhole peeled tomatoes packed in juice\n, crushed roughly by hand or with a potato masher\n2\ntablespoons\nsoy sauce\n3/4\ncup\nalmond milk\n1\npound\nshort, tubular pasta like\npenne\nor rigatoni, or long wide pasta like pappardelle\nDirections\nAdjust oven rack to center position and preheat oven to 375°F (190°C). Lay eggplant on a large sheet of aluminum foil. Drizzle with 1 teaspoon oil and season with salt and pepper. Wrap loosely in foil and transfer to a rimmed baking sheet. Roast until eggplant is completely softened, 45 minutes to 1 hour.\nWhile eggplant roasts, prepare sauce. Heat 3 tablespoons olive oil in a large skillet over medium heat until simmering. Add onions, carrots, and celery and cook, stirring occasionally, until completely softened but not browned, about 10 minutes. Add sage, half of parsley, half of basil, and garlic, and cook, stirring frequently, until aromatic, about 2 minutes. Add red wine and bay leaves. Increase heat to medium-high and simmer until wine is reduced to nearly dry (you should be able to see the bottom of the pan easily), about 5 minutes. Transfer mixture to a large saucepan and wipe out skillet.\nSerious Eats / J. Kenji López-Alt\nAdd remaining oil to skillet and set over medium-high heat until shimmering. Add button mushrooms and shiitake and cook, stirring occasionally, until mushroom liquid completely evaporates and mushrooms are well-browned all over, about 20 minutes. Add tomato paste and miso and stir to combine. Pastes will leave a light residue on the bottom of the pan. This is ok.\nSerious Eats / J. Kenji López-Alt\nAdd canned tomatoes and cook, scraping up the browned bits on the bottom of the pan with a wooden spoon. Add mixture to pot with vegetables and reduced wine. Add soy sauce and almond milk.\nSerious Eats / J. Kenji López-Alt\nWhen eggplant is cooked, remove from oven and let rest until cool enough to handle. Slit skin of eggplant and scrape out softened flesh gently with a spoon. Chop eggplant flesh into a fine purée and add to pot with sauce. Stir sauce to combine, bring to a bare simmer, reduce heat to lowest setting, and cover with lid slightly ajar. Cook, stirring occasionally, until sauce is rich and thick and flavors have fully developed, about 1 hour. Season to taste with salt and pepper.\nTo serve, cook pasta according to package directions in salted water. Drain, reserving 1/2 cup of cooking liquid. Add pasta and cooking liquid to mushroom sauce. Add remaining chopped parsley and basil (reserving a little for garnish, if desired). Cook over high heat, stirring, until sauce is rich and thick and coats every piece of pasta. Transfer to a serving bowl or individual bowls, drizzle with more extra-virgin olive oil, and serve immediately.\nSpecial Equipment\nLarge skillet\n, large saucepan\nNotes\nTo chop button mushrooms in the food processor, roughly chop by hand, then pulse in food processor until chopped, about 8 short pulses. To chop by hand, start by breaking up the mushrooms with your fingers, crushing them and tearing apart the caps. Chop finely with a chef's knife.\nTo chop shiitake mushrooms, cut each cap lengthwise into 1/4-inch strips, then rotate 90° and cut into fine dice.\nRead More\nSunday Dinner: No-Holds-Barred Lasagna Bolognese\nThe Best Slow-Cooked Bolognese Sauce\nVegan Dan Dan Noodles\nThe Best Vegan Mapo Tofu\nDairy-free Mains\nVegan Mains\nVegetarian Mains\nPastas\nEggplant"
}