{
  "url": "https://www.seriouseats.com/pasta-crab-tomato-chilies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/_SdlfC-z3KNbg2zgCt_k5YoCIIs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__03__20130321-crab-and-pasta-recipe-4-560d0873393b4ead9328767cb2318a32.jpg",
  "tags": [
    "Pasta Mains",
    "Italian",
    "Stovetop Pasta",
    "Spaghetti, Bucatini, & Linguine",
    "Crab"
  ],
  "title": "Pasta With Crab, Tomato, and Chiles Recipe",
  "full_text": "Pasta With Crab, Tomato, and Chiles Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n30 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nunsalted butter\n3\ntablespoons\nextra-virgin olive oil\n, divided\n3\nmedium\ncloves garlic\n, minced (about\n1\ntablespoon\n)\n1/2\nteaspoon\nred pepper flakes\n1\n(\n28-ounce) can\nwhole peeled tomatoes\n, drained and roughly broken up by hand\n1/3\ncup\nheavy cream\n1/4\ncup\nvodka\nKosher salt\nand freshly ground black pepper\n2\nslices\nrustic bread\nor\n1\nEnglish\nmuffin\n, roughly torn\n2\ntablespoons\nminced\nfresh chives\n2\ntablespoons\nminced\nfresh parsley\n1\nsmall\nred hot chile\n, finely sliced\n1\npound\nfresh spaghetti\n, fettucini, or tagliatelle (dry pasta can also be used)\n1\npound\nlump or\njumbo lump fresh crab meat\nDirections\nHeat butter and 2 tablespoons olive oil in a medium saucepan over medium heat until melted and foaming subsides. Add garlic and red pepper flakes and cook, stirring constantly, until fragrant but not browned, about 1 minute. Add tomatoes and heavy cream. Bring to a boil, reduce to a simmer, and cook, stirring occasionally, until lightly reduced, about 10 minutes. Add vodka and simmer for 4 minutes longer.\nTransfer mixture to jar of blender and blend on high speed until completely smooth. Season to taste with salt and pepper and transfer 2 cups to a large saucepan. Reserve remaining sauce for another use.\nBring a large pot of salted water to a boil. Combine bread and remaining olive oil in the work bowl of a food processor. Process until fine crumbs are formed. Transfer to a medium skillet and cook over medium-high heat, stirring and tossing constantly until golden brown. Transfer to a small bowl. Season bread crumbs to taste with salt and pepper and add a pinch of parsley and chives. Toss to combine. Set aside.\nAdd crab and sliced chiles to saucepan with sauce and stir to combine. Cook spaghetti in boiling salted water just until it is barely cooked through, about 2 minutes (if using dry pasta, cook according to package directions). Drain pasta, reserving 1 cup of cooking liquid. Transfer pasta to saucepan with sauce and stir in remaining herbs. Heat over high heat until sauce is simmering and pasta is completely coated, adding reserved pasta water as necessary to thin sauce to desired consistency. Serve immediately, topping with bread crumbs.\nSpecial Equipment\nBlender\n,\nfood processor\nRead More\nShrimp Fra Diavolo (Shrimp and Pasta with Spicy Tomato Sauce)\nPenne alla Vodka\nPasta Mains\nItalian\nStovetop Pasta\nSpaghetti, Bucatini, & Linguine\nCrab"
}