{
  "url": "https://www.seriouseats.com/pasta-burro-e-alici",
  "image_url": "https://www.seriouseats.com/thmb/DB7KaZK-5u7mzBKIhe9-GBgvwA8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20210218-burro-e-alici-sasha-marx-11-d30e7f3153414346a24169785e1ffe41.jpg",
  "tags": [
    "Pasta Mains",
    "Italian",
    "Stovetop Pasta",
    "Spaghetti, Bucatini, & Linguine",
    "Anchovies"
  ],
  "title": "Pasta Burro e Alici (Pasta With Creamy Anchovy-Butter Sauce) Recipe",
  "full_text": "Pasta Burro e Alici (Pasta With Creamy Anchovy-Butter Sauce) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nActive\n20 mins\nCooling Time\n15 mins\nTotal\n70 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Toasted Breadcrumbs: (optional)\n8\nounces\n(\n225\ng\n) fresh, lightly-stale, or fully stale\nbread\n, cut into 3/4- to 1-inch pieces (see notes)\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\nFor the Pasta:\n4\nounces\n(\n8\ntablespoons\n;\n115\ng\n)\nunsalted butter\n, divided\n8 to 12\nanchovy\nfillets\n(\n30 to 50\ng\n) (see notes)\n12\nounces\n(\n340\ng\n)\ndried long pasta\nsuch as spaghetti, spaghettoni, or bucatini\n1\nteaspoon\n(\n5\nml\n)\nfresh lemon juice\n, plus finely grated\nzest\nof\n1\nlemon\n1/2\ncup\n(\n60\ng\n)\ntoasted breadcrumbs\n1\nloosely packed\ncup\n(\n1/2\nounce\n;\n15\ng\n)\nfresh parsley\nleaves and tender stems, finely chopped\nDirections\nFor the Toasted Breadcrumbs:\nIf using fresh or lightly stale bread, adjust oven rack to middle position, and preheat oven to 325°F (165°C). (If using fully stale and dried bread, skip baking step.) Arrange bread in single layer on rimmed baking sheet, and bake until completely dried, 20 to 30 minutes. Remove from oven, and allow to cool to room temperature, about 5 minutes. Transfer oven-dried or fully stale bread to food processor bowl (set aside but don't clean rimmed baking sheet), and pulse until reduced to small crumbs, taking care not to over-process into a fine powder, 8 to 10 pulses.\nCombine breadcrumbs and 1 tablespoon (15ml) oil in a large skillet, and cook over medium-low heat, stirring and tossing occasionally, until crisp and golden brown, 8 to 10 minutes. Season lightly with salt. Transfer toasted breadcrumbs to reserved rimmed baking sheet, spread into an even layer, and set aside to cool to room temperature. Once cool, set aside 1/2 cup (60g) toasted breadcrumbs for the pasta, and transfer remaining crumbs to an airtight container for future use; the extra breadcrumbs can be stored at room temperature for up to 2 weeks.\nFor the Pasta:\nIn a large skillet, melt 3 ounces (6 tablespoons; 85g) butter over medium-low heat. Add anchovies and cook, stirring and breaking up anchovies occasionally with a rubber spatula or wooden spoon, until anchovies have dissolved, about 4 minutes. Reduce heat on skillet to lowest possible setting, to just keep warm while you boil the pasta; if your burner can only be reduced to a simmer, then turn heat off entirely.\nMeanwhile, in a large Dutch oven or wide-bottomed pot, combine 3 quarts (3L) of water and 2 teaspoons (8g) salt, and bring to a boil over high heat. Add pasta and cook, stirring frequently for first 30 seconds to prevent noodles from sticking.\nOnce pasta has cooked for 5 minutes, transfer 1 cup (240ml) of pasta cooking water to skillet; continue cooking pasta. Return skillet to high heat and bring to a boil, swirling pan and stirring constantly until cooking water emulsifies with butter-anchovy mixture, 1 to 2 minutes. Reduce heat to low while pasta finishes cooking to prevent liquid from over-reducing.\nMeanwhile, continue cooking pasta until it is softened on the exterior, but well shy of al dente and still uncooked in the center (about 3 minutes less than the package directions). Using tongs, transfer pasta to skillet, and reserve remaining pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 2 cups (475ml) pasta cooking water.\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is slightly thickened and coats noodles with a creamy glaze, 2 to 3 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed. At this point, the sauce should be emulsified and loose enough to pool around the edges of the pan.\nRemove from heat, add remaining 2 tablespoons (30g) butter, lemon juice, and zest. Toss and stir rapidly to incorporate and emulsify butter into the sauce. Season with salt and pepper to taste. Divide between individual serving bowls, sprinkle with breadcrumbs and parsley, and serve.\nSpecial Equipment\nRimmed baking sheet\n,\nfood processor\n, large skillet\nNotes\nThis recipe can be easily scaled down if the people you share meals with don't share your love of anchovies. It's worth trying to bring them to the right side though.\nThe toasted breadcrumbs are optional, but highly recommended; they provide a nice crunchy texture and help balance the richness of the butter and salinity of the anchovies. In a pinch you can use breadcrumbs as suggested in the recipe, but if you have the time and bread on-hand, we recommend making toasted breadcrumbs from fresh or stale bread (we used sourdough bâtard during recipe testing, but most types of white bread will work fine); if you are taking the time to make your own breadcrumbs, you might as well make a big batch so you have some ready to go in your pantry for future use. If you already have extra toasted breadcrumbs from another recipe, such as\npasta c'anciouva e muddica atturrata\n, use them for this recipe! If you don't want to make your own breadcrumbs, you can substitute 1/2 cup (35g) panko breadcrumbs, and toast them with 2 teaspoons (10ml) extra-virgin olive oil as written in the recipe.\nBoth salt-packed and oil-packed anchovies will work for this recipe; use the best quality anchovies available to you. Adjust the amount of anchovies to suit your, and your dining companions', taste. Here are some general guidelines:\n8 anchovies:\nFor people who enjoy anchovies as a background umami can't-put-your-finger-on-it ingredient, but don't want the flavor front and center. Think: Caesar salad lovers.\n10 anchovies:\nFor those who enjoy dishes with unmistakable, but not overwhelming, anchovy flavor. They may not eat fillets straight from the jar, but they enjoy an assertive puttanesca.\n12 anchovies:\nFor the true chovy lovers. The folks who get gifted tins of Cantabrian anchovies as stocking stuffers. The gilda is their favorite pintxo.\nMake-Ahead and Storage\nThis dish is best made right before serving.\nPasta Mains\nItalian\nStovetop Pasta\nSpaghetti, Bucatini, & Linguine\nAnchovies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pasta-burro-e-alici-pasta-with-creamy-anchovy-butter-sauce-recipe.webp?"
}