{
  "url": "https://www.seriouseats.com/pasta-al-tonno-5135115",
  "image_url": "https://www.seriouseats.com/thmb/MbHzHtq3g3xxHjKlBrDPwXgtN_Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20210208-Spaghetti-al-Tonno-sasha-marx-10-a0d3b3bd2892470883baa1fe0d3e9b46.jpg",
  "tags": [
    "Italian",
    "Pastas",
    "Stovetop Pasta",
    "Spaghetti, Bucatini, & Linguine",
    "Canned Fish"
  ],
  "title": "Pasta al Tonno (Pasta With Tomatoes and Tuna)",
  "full_text": "Pasta al Tonno (Pasta With Tomatoes and Tuna)\nClose\nJump to recipe\nCook\n30 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n3\nmedium\ngarlic cloves\n(\n15\ng\n), lightly crushed\n1/4\nteaspoon\nred pepper flakes\nOne\n28-ounce\n(800 g)\ncan\nwhole peeled tomatoes\n, coarsely crushed by hand\nKosher salt\n1\nteaspoon\n(\n5\nml\n)\nfish sauce\n(optional)\n10\n1/2 ounces\n(\n300\ng\n)\nolive oil-packed tuna\n, drained and gently flaked into 2-inch pieces (see notes)\n12\nounces\n(\n340\ng\n)\ndried long pasta\nsuch as spaghetti, spaghettoni, bucatini, or linguine\n1\npacked cup\n(\n3/4\nounce\n;\n25\ng\n)\nflat-leaf parsley\nleaves and tender stems, finely chopped\nDirections\nIn a large skillet or straight-sided sauté pan, combine oil and garlic. Cook over medium heat, turning garlic cloves occasionally, until garlic is deep golden brown on all sides, about 5 minutes. Using tongs or a slotted spoon, remove garlic from skillet; discard garlic. Add red pepper flakes and continue to cook, stirring constantly, until fragrant, about 30 seconds.\nSerious Eats / Sasha Marx\nAdd tomatoes, season lightly with salt, and bring to a simmer. Cook, stirring occasionally, until oil is emulsified and sauce is thickened slightly, about 10 minutes. Reduce heat to medium-low, add fish sauce (if using) and tuna, and stir gently until just incorporated into sauce, taking care to keep pieces of tuna as intact as possible.\nSerious Eats / Sasha Marx\nMeanwhile, in a pot of salted boiling water, cook pasta until just shy of al dente (about 2 minutes less than the package directs). Using tongs, transfer pasta to sauce, along with 1/4 cup (60ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water.\nSerious Eats / Diana Chistruga\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is thickened and coats noodles, 1 to 2 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed to adjust consistency of sauce. Remove from heat, add parsley, and stir to combine. Season with salt to taste. Serve immediately.\nSerious Eats / Sasha Marx\nSpecial Equipment\nLarge skillet\nor\nstraight-sided sauté pan\nNotes\nOlive-oil packed tuna is sold in cans and jars of varying sizes. Two of our favorite widely available brands, Tonnino and Ortiz, sell tuna in 6.7- and 7.76-ounce (190 and 220g) jars, respectively, that yield a drained weight of approximately 5.3 ounces (150g) each. Two jars of tuna will yield the correct amount for this recipe, or you can use two to three 5-ounce (140g) cans (using a little less or a little more tuna than called for in the recipe won't make or break the dish).\nThis recipe will work with both \"regular\" and ventresca tuna. Ventresca, which comes from the fatty belly of the fish, is moister and more flavorful than other canned tuna, but also significantly more expensive.\nMake-Ahead and Storage\nThis pasta is at its best when enjoyed immediately, but it keeps well for next-day leftovers as well. It can be refrigerated in an airtight container for up to 2 days. For this pasta, leftovers are actually best enjoyed cold.\nItalian\nPastas\nStovetop Pasta\nSpaghetti, Bucatini, & Linguine\nCanned Fish"
}