{
  "url": "https://www.seriouseats.com/pasta-cacio-e-uovo-vegetarian-carbonara",
  "image_url": "https://www.seriouseats.com/thmb/DcuWjUSHVmga65Sha31s_ieFK8s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210309-Cas-e-Ova-pasta-sasha-marx-11-0d2b7d5cbe1146f893553541f191b7d4.jpg",
  "tags": [
    "Pastas",
    "Italian",
    "The Latest"
  ],
  "title": "Pasta Cacio e Uova (Neapolitan Pasta With Eggs and Cheese) Recipe",
  "full_text": "Pasta Cacio e Uova (Neapolitan Pasta With Eggs and Cheese) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n25 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\neggs\n(\n110\ng\n), plus\n1\nlarge\negg yolk\n(\n15\ng\n)\n2\nounces\n(\n60\ng\n)\nfinely grated Pecorino Romano\n2\nounces\n(\n60\ng\n)\nfinely grated Parmigiano-Reggiano\n1/4\nteaspoon\nfreshly ground black pepper\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n,\nextra-virgin olive oil\n, or\nlard\n(see note)\n2\nmedium\ngarlic cloves\n(\n10\ng\n), lightly crushed\nKosher salt\n12\nounces\n(\n340\ng\n)\ndried small tubular pasta\nsuch as\ntubetti\n,\nmezze maniche\n,\nmaccheroncini\n, or\nmezzi rigatoni\n(see note)\n1\nloosely packed\ncup\n(\n1/2\nounce\n;\n15\ng\n)\nfresh parsley leaves and tender stems\n, finely chopped (optional)\nDirections\nIn a large heatproof mixing bowl, whisk together whole eggs and yolk, Pecorino Romano, Parmigiano-Reggiano, and black pepper. Set aside.\nSerious Eats / Sasha Marx\nIn a large skillet, melt butter over medium heat. Add garlic and cook, stirring and turning cloves occasionally, until garlic begins to soften and turn pale golden, about 3 minutes. Turn off heat.\nSerious Eats / Sasha Marx\nMeanwhile, in a pot of salted boiling water, cook pasta until al dente. Right before pasta finishes cooking, remove garlic cloves from skillet and discard. Using a spider skimmer, transfer pasta to skillet; be sure not to drain boiling pasta cooking water, and reduce heat to a simmer.\nSerious Eats / Sasha Marx\nStir and toss pasta rapidly in skillet to evenly coat with butter, then transfer to bowl with egg and cheese mixture, using a rubber spatula to scrape all of the butter into the bowl. Add 3/4 cup (180ml) of reserved pasta cooking water to bowl, and stir to thoroughly combine.\nSerious Eats / Sasha Marx\nSet bowl over pot of simmering pasta cooking water (making sure bottom of bowl does not touch water) and cook, stirring and scraping down sides of bowl constantly with a rubber spatula, until sauce thickens to a creamy, silky consistency and leaves trails as you stir, about 1 minute, adding more pasta cooking water in 1 tablespoon (15ml) increments as needed to adjust consistency of the sauce.\nSerious Eats / Sasha Marx\nRemove bowl from heat, add parsley (if using), and stir to combine. Season with salt to taste. Divide between warmed serving bowls, and serve.\nSerious Eats / Sasha Marx\nSpecial Equipment\nLarge heatproof bowl\n,\nlarge skillet\n,\nspider skimmer\nNotes\nStrutto (lard) is the traditional fat used in many Neapolitan recipes such as cas' e ova and\nalla Genovese\n, but butter or olive oil works fine for this recipe as well, and keep the dish vegetarian. Lard lends the sauce meaty richness, while butter plays off the dairy flavor of the grated cheeses, and olive oil will give the sauce more grassy and peppery notes. Rendered lard is sold at some butcher shops as well as at Latin American markets. You can also render lard yourself from fatback or leaf lard (fat from the area around the kidneys), following the same technique used for\nrendering duck fat\n.\nTubetti are the traditional shape for cas' e ova, but other super-short tubular dried pasta shapes such as mezzi rigatoni and mezze maniche will work as well.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately.\nRead More\nVegan Carbonara Pasta\nPastas\nItalian\nThe Latest"
}