{
  "url": "https://www.seriouseats.com/pasta-chickpea-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/eqq78ptC7mrGEFFrTqanXrK0LME=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150206-chickpea-vegan-pasta-vicky-wasik-15-687d755ae1f544f8bd5eb26cbf21b3d9.jpg",
  "tags": [
    "Pasta Mains",
    "Vegan Mains",
    "Chickpeas"
  ],
  "title": "Pasta With Vegan Chickpea Sauce Recipe",
  "full_text": "Pasta With Vegan Chickpea Sauce Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 15 mins\nActive\n30 mins\nTotal\n2 hrs 20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\ndried chickpeas\n, soaked overnight in salted water (see notes)\n1\nlarge\nonion\n, split in half\n1\nhead\ngarlic\n,\n3\ncloves\nthinly sliced, the rest left unpeeled\n3\nsprigs\nrosemary\nKosher salt\nand freshly ground black pepper\n3\ntablespoons\nextra-virgin olive oil\n, plus more for drizzling\n1/2\nteaspoon\nred pepper flakes\n1\npound\nshort ruffled pasta, such as\nfarfalle\n1/4\ncup\nchopped parsley\n, plus more for garnish\nDirections\nPlace chickpeas in a large pot and cover with lightly salted water by at least 2 inches. Add unpeeled garlic, onion, and rosemary. Cover and bring to a boil over high heat. Reduce heat to a bare simmer and cook, topping up with water as necessary to keep beans submerged, until beans are very tender and creamy with no graininess left, about 2 hours. Beans can also be cooked in a pressure cooker at low pressure for 30 minutes. (See note if using canned beans.) Discard onions, garlic, and rosemary. Drain beans, reserving beans and liquid separately. You should have 4 cups drained chickpeas and at least 1 1/2 cups chickpea-cooking liquid.\nIn a medium saucepan, combine oil, garlic, and red pepper flakes and set over medium heat. Cook, stirring, until garlic is lightly golden, about 3 minutes. Add 3 cups chickpeas and chickpea-cooking liquid (or liquid from the cans) and bring to a simmer. Remove from heat and, using an immersion blender, blend to a smooth, saucy purée, adding more chickpea-cooking liquid (or water or vegetable broth) if too thick. Stir in remaining 1 cup chickpeas, crushing some lightly with a wooden spoon or potato masher but leaving them mostly whole. Season with salt and pepper.\nSerious Eats / Vicky Wasik\nIn a pot of salted boiling water, cook pasta until just short of al dente. Reserve 1 cup of pasta-cooking water, then drain pasta. Return pasta to pot and add chickpea sauce along with 1/4 cup of reserved pasta-cooking water. Set over medium heat and bring to a simmer, stirring until pasta is al dente and sauce has thickened just enough to coat pasta, about 3 minutes; add more reserved pasta-cooking water, 1 tablespoon at a time, if sauce becomes too thick. Remove from heat, stir in chopped parsley and drizzle in some fresh olive oil, stirring to blend. Season with salt and pepper. Spoon pasta and sauce into bowls, garnish with chopped parsley, and serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nImmersion blender\nNotes\nChickpeas can also be prepared using the quick soak method. Cover with water in a large pot, bring to a boil, remove from heat, and let rest for 1 hour. Drain and proceed with the recipe as directed.\nTo use canned beans, omit dried beans, onion, unpeeled garlic, and rosemary and skip step 1. Drain three 15-ounce cans of cooked chickpeas, reserving the liquid from the cans (supplement with water or vegetable broth if the liquid measures less than 1 1/2 cups). Continue with step 2 as directed.\nRead More\nPasta e Fagioli (Italian Bean and Pasta Soup)\nPasta With Beans and Greens\nPenne With Melted-Vegetable Sauce\nHow to Cook Dried Beans\nPasta Mains\nVegan Mains\nChickpeas"
}