{
  "url": "https://www.seriouseats.com/pasta-with-beans-and-greens",
  "image_url": "https://www.seriouseats.com/thmb/gyLzBm3TcsS581xfcEd8TbLzf2Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__04__20200225-beans-and-greens-pasta-vicky-wasik-18-a2842cb4762d4145b53cc83d59aca80f.jpg",
  "tags": [
    "Italian",
    "Cannellini & Kidney Beans",
    "Anchovies",
    "Kale",
    "Quick Dinners"
  ],
  "title": "Pasta With Beans and Greens Recipe",
  "full_text": "Pasta With Beans and Greens Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n20 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n4\nmedium\ngarlic cloves\n(\n20\ng\n), thinly sliced\n3\nanchovy\nfillets\n(\n5\ng\n) (optional; see note)\n1/2\nteaspoon\n(\n1\ng\n)\nred pepper flakes\n1/4\ncup\n(\n60\nml\n)\ndry white wine\n1\npound\n5\nounces\n(\n3\ncups\n;\n600\ng\n)\ncooked dry white beans\n(such as cannellini or Great Northern) or\n2\n(15-ounce; 425g) cans\nlow-sodium white beans, drained and rinsed (see note)\n1\ncup\n(\n240\nml\n) bean cooking liquid,\nhomemade\nor store-bought\nlow-sodium chicken stock\n, or\nvegetable stock\n(see note)\nKosher salt\n12\nounces\n(\n350\ng\n)\nshort tubular pasta\n, such as paccheri or rigatoni\n1\nbunch\n(\n8\nounces\n;\n225\ng\n)\nlacinato kale\n, tough stems removed, leaves cut into 2-inch pieces (see note)\n2 1/4\nounces\n(\n3/4\ncup\n;\n65\ng\n) grated\nPecorino Romano cheese\n, divided\nDirections\nIn a large straight-sided sauté pan or skillet, combine olive oil, garlic, and anchovies (if using). Cook over medium-low heat, stirring and breaking up anchovies occasionally with a wooden spoon, until anchovies have dissolved and garlic has softened and is just beginning to turn lightly golden, about 5 minutes. Add red pepper flakes and continue to cook, stirring, until fragrant, about 30 seconds. Increase heat to medium-high and add wine. Bring to a simmer and cook, swirling pan and scraping up any stuck-on bits with a wooden spoon, until wine has emulsified with olive oil and mixture is slightly reduced, about 30 seconds.\nSerious Eats / Vicky Wasik\nAdd beans and bean cooking liquid (if using cooked dry beans) or stock (if using canned beans), and, using a wooden spoon, crush roughly one-quarter of the beans against the sides and bottom of pan. Stir well, season lightly with salt, and bring to a simmer. Reduce heat to medium-low and cook, stirring occasionally, until bean mixture is thickened to a creamy, saucy consistency, 10 to 15 minutes.\nSerious Eats / Vicky Wasik\nMeanwhile, in a pot of salted boiling water, cook pasta until softened on the exterior, but well shy of al dente and still uncooked in the center (about 3 minutes less than the package directions). Right before the pasta reaches this level of doneness, add the kale to the pan with the beans. Using a spider skimmer or slotted spoon, transfer pasta to pan with beans and kale along with 1 cup (240ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 2 cups (475ml) pasta cooking water.\nSerious Eats / Vicky Wasik\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is thickened and coats noodles, 2 to 3 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed. At this point, the sauce should coat the pasta but still be loose enough to pool around the edges of the pan; because of the starch in the beans and pasta water, the sauce will continue to tighten up in the time it takes to plate and serve, so make sure it's a little looser than you would normally serve a sauce. Remove from heat, add 3/4 of grated cheese, and stir rapidly to incorporate. Season with salt to taste. Serve immediately, passing remaining grated cheese at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStraight-sided sauté pan or large\nskillet\n, spider skimmer\nNotes\nAnchovies add savory depth to the sauce, but if you would like to keep this dish vegetarian, you can omit them. If you do choose to leave out the anchovies, we strongly encourage you to use cooked dry white beans and their cooking liquid rather than canned beans and store-bought stock; the difference in flavor between the two is even more noticeable when you remove the umami boost of the anchovies.\nCooked dry white beans produce the best flavor for this dish. You can follow our\nbasic stovetop or oven methods\nfor cooking beans, or, if you have a\npressure cooker\n, you can cook beans that way as well. For the beans used in the photos for this recipe, I pressure-cooked 1 pound (450g) rinsed dried cannellini beans with 7 cups (1.7L) water, 3 garlic cloves (lightly smashed), 2 tablespoons (30ml) extra-virgin olive oil, and 1 1/2 teaspoons (6g) kosher salt on high pressure for 35 minutes, followed by a natural pressure release. While you don't have to soak beans if pressure-cooking, soaking can help some beans cook more evenly and consistently.\nUse chicken or vegetable stock only if using canned beans. Use reserved bean cooking liquid if using cooked dry beans.\nLacinato kale is also known as Tuscan, dinosaur, or black kale. You can also substitute other hearty, toothsome greens such as Swiss chard for the kale.\nMake-Ahead and Storage\nThis pasta is at its best when enjoyed immediately, but it does keep well for leftovers, too. It can be refrigerated in an airtight container for up to 3 days.\nRead More\nPasta e Ceci (Pasta With Chickpeas)\nPasta With Vegan Chickpea Sauce\nItalian\nCannellini & Kidney Beans\nAnchovies\nKale\nQuick Dinners",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pasta-with-beans-and-greens-recipe.webp?"
}