{
  "url": "https://www.seriouseats.com/pasta-alla-norcina-creamy-pasta-with-sausage",
  "image_url": "https://www.seriouseats.com/thmb/LGJaRiCaosUn6LnK-fRbrJXq-cM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210309-norcina-pasta-sasha-marx-20-1996bc45c3f5404998679f1dd96b7260.jpg",
  "tags": [
    "Sausages",
    "Sausages"
  ],
  "title": "Pasta alla Norcina (Creamy Pasta With Sausage) Recipe",
  "full_text": "Pasta alla Norcina (Creamy Pasta With Sausage) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n30 mins\nResting Time\n60 mins\nTotal\n90 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sausage Mixture:\n12\nounces\n(\n340\ng\n)\ncoarsely ground pork\n, chilled (see note)\n1\nlarge\ngarlic clove\n(\n8\ng\n), minced\n1 1/2\nteaspoons\n(\n6\ng\n)\nDiamond Crystal kosher salt\n; for table salt use half as much by volume or the same weight\n3/4\nteaspoon\n(\n2\ng\n)\nfreshly ground black pepper\nPinch\nfreshly grated nutmeg\n2\ntablespoons\n(\n30\nml\n)\ndry white wine\n, chilled\nFor the Pasta:\n1\nrecipe\nsausage mixture\n(from above) or\n12\nounces\n(\n340\ng\n)\nfresh pork sausage\n(\n4\nlinks\n), removed from casing (see note)\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1\nsmall\nyellow onion\n(about\n3 1/2\nounces\n;\n100\ng\n) finely chopped\n1/2\ncup\n(\n120\nml\n)\ndry white wine\n1\ncup\n(\n240\nml)\nheavy cream\nKosher salt\nand\nfreshly ground black pepper\n12\nounces\n(\n340\ng\n)\ndried, short, tubular pasta\nsuch as\npenne\nor\nrigatoni\nor\nlong fresh egg-dough pasta\nsuch as\ntagliatelle\nor\nfettuccine\n1 1/2\nounces\n(\n45\ng\n)\nfinely grated Pecorino Romano\n, plus extra for serving\nFreshly grated nutmeg\n, for serving\nFreshly shaved\nor\ngrated black truffle\n, for serving (optional; see note)\nDirections\nFor the Sausage Mix:\nIn a medium bowl, combine pork, garlic, salt, pepper, and nutmeg and stir with a wooden spoon to evenly distribute seasoning. Add 2 tablespoons (30ml) chilled wine and stir vigorously, working meat mixture against bottom and sides of bowl, until wine is incorporated and mixture becomes tacky and sticky, 1 to 2 minutes. Cover and refrigerate for at least 1 hour and up to 2 days.\nAlternatively, combine pork, garlic, salt, pepper, and nutmeg in bowl of a stand mixer fitted with the paddle attachment. Mix on low speed until seasonings are evenly incorporated, about 1 minute. Add wine, increase speed to medium, and mix until wine is incorporated and mixture becomes tacky and sticky, 1 to 2 minutes. Cover and refrigerate for at least 1 hour and up to 2 days.\nSerious Eats / Sasha Marx\nFor the Pasta:\nWhen ready to cook, remove sausage mixture from refrigerator and, using clean hands, form into four 1/2-inch-thick patties (don't worry about making them perfectly round as they will get broken up into smaller pieces; if using store-bought sausage, form uncased sausages into 1/2-inch-thick patties). In a large skillet or straight-sided sauté pan, heat oil over medium-high heat until shimmering. Add sausage patties and cook until bottom side is light golden brown, 3 to 5 minutes. Using a thin metal spatula, turn sausage patties onto uncooked side, leaving an open area in the center of the skillet. Add onion, lower heat to medium, and cook, using wooden spoon to break up sausage into 1/2- to 1-inch pieces, until sausage is just cooked through and onion is softened, about 2 minutes; lower heat at any point if sausage or onion threaten to scorch.\nSerious Eats / Sasha Marx\nIncrease heat to medium-high and add wine. Bring to a simmer and cook, swirling pan and scraping up any stuck-on bits with wooden spoon, until wine is reduced by roughly half, about 30 seconds.\nSerious Eats / Sasha Marx\nAdd cream, bring to a simmer, and cook, stirring frequently to keep cream from scorching on sides of the pan, until sauce is slightly thickened, 3 to 5 minutes. Season with salt and pepper to taste and reduce heat to lowest possible setting to keep sauce warm and prevent it from over-reducing.\nSerious Eats / Sasha Marx\nMeanwhile, in a pot of salted water, cook pasta until just shy of al dente (about 2 minutes less than the package directs). Using a spider skimmer, transfer pasta to sauce, along with 1/2 cup (120ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water.\nSerious Eats / Sasha Marx\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is thickened and coats noodles and pools around edges of the pan, about 2 minutes; add more pasta cooking water in 1/4-cup (60ml) increments as needed to achieve desired consistency.\nSerious Eats / Sasha Marx\nRemove from heat, add Pecorino Romano, and stir rapidly to incorporate. Divide between warmed serving bowls, top each portion with a grinding of black pepper, grated nutmeg, cheese, and truffle (if using). Serve immediately.\nSerious Eats / Sasha Marx\nSpecial Equipment\nLarge skillet\n,\nwooden spoon\n,\nmetal spatula\n,\nspider skimmer\nNotes\nCoarsely ground pork shoulder is ideal for this recipe, if your butcher counter takes requests. Keep the meat as cold as possible when preparing the sausage mix to prevent fat from breaking during cooking; only take the meat out of refrigeration when all of the other ingredients for the sausage are measured out and you are ready to mix.\nThe traditional Norcia-style sausage used for this pasta does not feature the fennel seed or red pepper flakes commonly added to \"Italian\" sausage here in the States. Therefore, this pasta is at its best when made with the homemade, shortcut sausage mixture outlined in this recipe. However, if you prefer to use store-bought sausages, you'll still end up with tasty results. Fresh Italian-style garlic sausage is ideal, but sweet Italian sausage will work fine.\nIn Umbria, this pasta is traditionally finished with shaved fresh black truffles when they are in season (fall and early winter), but it's also common to serve this dish without truffles when they're unavailable or out of season. It's delicious either way. If you are looking to go all-out with the truffle version, use fresh black truffles. We don't recommend using truffle oil, which isn't made from real truffles and has a synthetic aroma.\nMake-Ahead and Storage\nSausage mixture can be made in advance and refrigerated in a zipper-lock bag for up to 2 days, or frozen for up to 1 month. The pasta is best enjoyed immediately.\nRead More\nOrecchiette con Salsiccia e Cime di Rapa (Orecchiette With Sausage and Broccoli Rabe) Recipe\nCrispy Baked Pasta With Mushrooms, Sausage, and Parmesan Cream Sauce Recipe\nEasy Skillet Baked Ziti With Sausage and Ricotta Recipe\nPasta With Spicy 'Nduja-Tomato Sauce Recipe\nSausages\nSausages"
}