{
  "url": "https://www.seriouseats.com/pasta-alla-genovese-neapolitan-beef-ragu",
  "image_url": "https://www.seriouseats.com/thmb/0bH6EJBtolMsGxXs383rl2_tNsk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210303-pasta-genovese-sasha-marx-16-22028d0441ce4b8f8c59fd3f6c3bd8b1.jpg",
  "tags": [
    "Italian",
    "Beef Chuck"
  ],
  "title": "Pasta alla Genovese (Pasta With Neapolitan Beef and Onion Ragù)",
  "full_text": "Pasta alla Genovese (Pasta With Neapolitan Beef and Onion Ragù)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n3 hrs 15 mins\nActive\n30 mins\nResting Time\n45 mins\nTotal\n4 hrs 5 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n700\ng\n)\nboneless beef chuck roast\n, trimmed and cut into 4-by-3-inch pieces\nKosher salt\nand freshly ground black pepper\n1/4\ncup\n(\n60\ng\n;\n60\nml\n) lard or\nextra-virgin olive oil\n(see note)\n3 1/2\nounces\n(\n100\ng\n)\ncarrots\n, peeled and cut into small dice (\n2\nsmall\ncarrots\n)\n1\ncelery rib\n(\n75\ng\n), trimmed and cut into small dice\n3\npounds\n(\n1.4\nkg\n) yellow or\nred onions\n, thinly sliced, divided\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n1\ncup\n(\n240\nml\n)\ndry white wine\n, divided\n1\nbay leaf\n5\nounces\n(\n150\ng\n)\ncherry tomatoes\n(optional, see note)\n1\npound\n(\n450\ng\n)\nshort tubular dried pasta\nsuch as\nziti\n,\npaccheri\n, or\nrigatoni\n(see note)\n1\nloosely packed\ncup\n(\n1/2\nounce\n;\n15\ng\n)\nfresh parsley\nleaves and tender stems, finely chopped\nFinely grated\nPecorino Romano\nor\nParmigiano-Reggiano\n, for serving\nDirections\nSeason beef all over with salt and pepper; set aside and let sit for at least 45 minutes before cooking.\nSerious Eats / Sasha Marx\nMeanwhile, in a large Dutch oven, heat lard or olive oil over medium-high heat until shimmering. Add carrots and celery, and cook, stirring occasionally, until softened but not browned, about 5 minutes. Add roughly 1/3 of the onions (about 1 pound; 450g), season lightly with salt, and continue to cook, stirring occasionally, until onions are also softened but not browned, about 5 minutes.\nSerious Eats / Sasha Marx\nAdd tomato paste and 1/4 cup (60ml) wine. Use a wooden spoon to stir and scrape the bottom and sides of the pot to release any stuck-on bits, then spread onion mixture into an even layer covering bottom of the pot. Reduce heat to medium-low and add beef, nestling pieces into onion mixture in a single layer. Cover beef with remaining onions (about 2 pounds; 900g), add bay leaf, season lightly with salt, and cover pot with lid.\nSerious Eats / Sasha Marx\nCook, uncovering and stirring occasionally to ensure vegetables and beef aren't sticking to bottom of the pot, until onions are very soft and have released their moisture, about 1 hour. Adjust heat as needed to maintain a gentle, steady simmer, and try to keep a layer of onion mixture between beef and bottom of the pot.\nSerious Eats / Sasha Marx\nCrack lid slightly so that pot is not completely covered and continue to cook until beef is tender, offering little resistance when pressed with a wooden spoon or poked with a paring knife, about 1 hour and 30 minutes longer. Using tongs, remove beef and bay leaf; set beef aside to cool slightly and discard bay leaf.\nSerious Eats / Sasha Marx\nAdd remaining 3/4 cup (180ml) wine and cherry tomatoes (if using) to onion mixture and bring to a simmer over medium-low heat. Once beef is cool enough to handle, cut into 1 1/2-inch pieces and add back to the pot. Season with salt to taste and cook, stirring occasionally, until tomatoes begin to burst and mixture is reduced to a saucy braised ragù consistency, about 15 minutes. You can coax the beef pieces into breaking down slightly by prodding them with a wooden spoon, but don't overdo it; the goal is to have a mixture of distinct pieces of beef and some shredded bits that meld into the sauce.\nSerious Eats / Sasha Marx\nMeanwhile, in a pot of salted boiling water, cook pasta until just shy of al dente (1 to 2 minutes less than the package directs). Using a spider skimmer, transfer pasta to the sauce, along with 1/2 cup (120ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water.\nSerious Eats / Sasha Marx\nIncrease heat to high and cook, stirring rapidly, until pasta is al dente and sauce is thickened and coats noodles, 1 to 2 minutes, adding more pasta water in 1/4 cup (60ml) increments as needed. Remove from heat, add parsley, and stir rapidly to incorporate. Season with salt to taste. Serve immediately, passing grated cheese at the table.\nSerious Eats / Sasha Marx\nSpecial Equipment\nDutch oven\n,\nspider skimmer\nNotes\nStrutto (lard) is the traditional fat used for making Genovese ragù, but extra-virgin olive oil works fine for this recipe. Lard lends the ragù extra meaty richness, while olive oil will give the sauce more grassy and peppery notes. Rendered lard is sold at some butcher shops as well as at Latin American markets. You can also render lard yourself from fatback or leaf lard (fat from the area around the kidneys), following the same technique used for\nrendering duck fat\n.\nWhile this ragù is all about the onions and beef, adding a handful of fresh cherry tomatoes is accepted common practice, and provides a pop of freshness and bright acidity to balance the slow-cooked sweetness of the onions and carrots in the sauce.\nZiti and paccheri are traditional shapes from Gragnano, the dried pasta capital of Italy just outside Naples, and they're commonly paired with Genovese. The amount of sauce produced by this recipe is sufficient to dress up to 500 grams (1.1 pounds) of dried pasta, which is the weight of bags of pasta sold in Italy (50 grams more than the 1-pound bags and boxes used for the American market). So whether you've purchased a 1-pound or 500-gram bag of pasta, use the whole thing.\nMake-Ahead and Storage\nGenovese ragù can be made in advance, following recipe through Step 6, and refrigerated in an airtight container for up to 5 days or frozen for up to 3 months. Reheat gently over medium-low heat on stovetop, adding 1 to 2 tablespoons (15 to 30ml) of water as needed to loosen sauce. adding parsley and cheese.\nRead More\nBasic Ragù Bolognese\nThe Best Slow-Cooked Bolognese Sauce\nRagú Napoletano (Neapolitan-Style Italian Meat Sauce With Pork, Beef, and Sausage)\nPappardelle With Tuscan Pork\nCrepe Manicotti With Veal Ragù\nItalian\nBeef Chuck"
}