{
  "url": "https://www.seriouseats.com/patacones-con-hogao-colombian-style-fried-plantains-with-tomato-onion-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/RU1fZpZB8VEuqHthyfWEvum240c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120501-colombian-patacones-con-guiso-hogao-11-1b383d625b394eaa95289a90ae745a84.jpg",
  "tags": [
    "Colombian"
  ],
  "title": "Patacones Con Hogao (Colombian-Style Fried Plantains with Tomato-Onion Sauce)",
  "full_text": "Patacones Con Hogao (Colombian-Style Fried Plantains with Tomato-Onion Sauce)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n45 mins\nTotal\n50 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nripe\nroma tomatoes\n(about\n8\ntomatoes\n)\n2\ntablespoons\nolive oil\n1\nsmall\nonion\n, finely sliced\n2\nmedium\ncloves garlic\n, minced (optional)\nKosher salt\n2\nquarts\nvegetable oil\n4\ngreen plantains\n, peeled and cut into 1-inch segments\nChopped parsley\n(optional)\nDirections\nBring a large pot of water to a boil and cut a small X into the bottom of each tomato. Drop the tomatoes into the boiling water and cook until skins are loosened, about 30 seconds. Transfer to an ice bath. Peel and discard skins. Split each tomato into quarters and remove the seeds and pale inner core with a knife. Slice resulting tomato filets into thin slices.\nAdd tomatoes, olive oil, onion, and garlic to a large skillet. Season well with salt. Set over medium-high heat and bring to a simmer, stirring constantly. Reduce heat to low, cover, and allow sauce to cook, stirring occasionally, until all vegetables are completely tender, about 30 minutes. Remove lid for last 5 minutes of cooking.\nWhile sauce simmers, heat oil in a wok or Dutch oven until it registers 300°F on an instant read or deep-fry thermometer. Add plantains and cook, stirring occasionally, until cooked through, about 5 minutes. Transfer to a paper towel-lined plate.\nLine your cutting board with plastic wrap. Smash plantains under a plastic wrap-lined metal can or heavy skillet to roughly 1/8th to 1/4-inch thickness.\nHeat oil up to 350°F to 375°F and return plantains to pot. Cook, stirring and flipping occasionally until golden brown and crisp. Transfer to a paper towel-line plate and immediately season with salt.\nSeason sauce to taste with salt. Serve fried plantains topped with sauce and sprinkled with parsley.\nColombian"
}