{
  "url": "https://www.seriouseats.com/patatas-bravas-tapas-recipe",
  "image_url": null,
  "tags": [
    "Snacks & Appetizers",
    "Spanish",
    "Stovetop",
    "Russet Potatoes"
  ],
  "title": "Patatas Bravas",
  "full_text": "Patatas Bravas\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n25 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salsa Brava:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1\nsmall\nonion\n(\n5 ounces; 140 g\n), roughly chopped\n3\nmedium\ngarlic cloves\n(\n15\ng\n), roughly chopped\nKosher salt\n1\ntablespoon\n(\n10\ng\n) pimentón dulce (\nsweet smoked Spanish paprika\n)\n2\nteaspoons\n(\n6\ng\n)\npimentón picante\n(hot smoked Spanish paprika) (see note)\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n2\ntablespoons\n(\n15\ng\n)\nall-purpose flour\n1\ncup\n(\n240\nml\n) homemade\nchicken stock\nor store-bought low-sodium chicken broth\n2\nteaspoons\n(\n10\nml\n)\nsherry vinegar\nFor the Potatoes:\n2\npounds\n(\n900\ng\n)\nrusset potatoes\n, cut into 3/4- to 1-inch cubes\n2\ntablespoons\n(\n30\nml\n)\ndistilled white vinegar\nKosher salt and freshly ground black pepper\n3\ncups\n(\n710\nml\n) peanut or\ncanola oil\n, for frying\nFor Serving:\n1\ncup\n(\n240\nml\n)\nallioli\n, for serving\nDirections\nFor the Salsa Brava:\nIn a 3-quart saucepan, heat oil over medium heat until shimmering. Add onion and garlic, season lightly with salt, and cook, stirring frequently, until onion is softened and just beginning to brown on the edges, 5 to 7 minutes.\nVicky Wasik\nReduce heat to medium-low. Add sweet and hot pimentón, stir to combine, and cook until fragrant, about 30 seconds. Add tomato paste, and cook, stirring constantly, until tomato paste turns dark brick red, about 30 seconds. Add flour and cook, stirring constantly, until thoroughly combined and mixture begins to stick to bottom of saucepan, 30 seconds to 1 minute.\nVicky Wasik\nAdd stock, stir to combine, and bring to a boil over medium-high heat. Cook, stirring frequently with a heat-resistant spatula to prevent sticking and scorching, until mixture is thickened and coats the back of a spoon, 1 to 2 minutes. Transfer mixture to a countertop blender or immersion blender jar, along with sherry vinegar. Blend on high speed until completely smooth, about 1 minute. Season with salt to taste. Transfer to a bowl or airtight container (or a pastry bag or squeeze bottle if you prefer a precise drizzle), cover with plastic, pressing plastic wrap against the surface of the sauce to prevent a skin from forming, and set aside until ready to use. (Once sauce has cooled to room temperature, it can be refrigerated for up to 5 days.)\nVicky Wasik\nFor the Potatoes:\nPlace potatoes in a large saucepan or pot and cover with 2 quarts (1.9L) water. Add vinegar and 2 tablespoons salt and bring to a boil over high heat. Cook until potatoes are tender and offer little resistance when poked with a paring knife, about 7 minutes. Drain and set aside.\nVicky Wasik\nIn a 12-inch cast iron straight-sided sauté pan or large Dutch oven, heat oil to 350°F (175°C). Add potatoes in single layer and cook, shaking the pan and flipping the potatoes with a slotted spatula or tongs occasionally, until golden brown and crisp, 5 to 7 minutes. Remove from heat. Using slotted spoon or wire-mesh spider, transfer potatoes to a paper towel-lined bowl. Season to taste with salt and pepper.\nVicky Wasik\nFor Serving:\nTransfer potatoes to a large serving dish or divide between individual plates, drizzle with salsa brava and allioli, and serve, passing extra salsa brava and allioli at the table.\nVicky Wasik\nSpecial Equipment\n3-quart saucepan, countertop or immersion blender, 12-inch cast iron straight-sided sauté pan or large Dutch oven, spider skimmer\nNotes\nBoth sweet and hot pimentón can be found at specialty grocery stores such as Whole Foods, Spanish specialty shops, and online. If you prefer a more mild salsa brava, reduce the amount of hot pimentón to 1 teaspoon (3g).\nIf you would like to keep the dish vegetarian, use water or vegetable stock in place of chicken stock in the salsa brava.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately. The salsa brava and allioli can be made in advance and refrigerated in separate airtight containers for up to 5 days (the same applies if you end up with any left over sauces).\nSnacks & Appetizers\nSpanish\nStovetop\nRusset Potatoes"
}