{
  "url": "https://www.seriouseats.com/pate-brisee-recipe-8745262",
  "image_url": "https://www.seriouseats.com/thmb/D_l2wJUX3GDvhUeVUT9f8pOiMlw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241112-SEA-PateBrisee-DebbieWee-Hero1-44-9accff0f9cdb436188ae7e86670af43a.jpg",
  "tags": [
    "Pie Dough",
    "The Latest",
    "Desserts"
  ],
  "title": "Pâte Brisée (French All-Butter Dough)",
  "full_text": "Pâte Brisée (French All-Butter Dough)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n35 mins\nChilling, Freezing, and Cooling Time\n4 hrs\nTotal\n4 hrs 55 mins\nServes\n8\nMakes\n1 9-inch tart shell or six to eight 3-inch tartlet shells\nCook Mode\n(Keep screen awake)\nIngredients\n160\ng\nall-purpose flour\n(5 2/3 ounces; 1 1/4 cups), sifted, plus more for dusting\n1\nteaspoon\n(5g)\ngranulated sugar\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n113\ng\ncold\nunsalted butter\n(4 ounces; 8 tablespoons), cut into 1/2-inch cubes\n2\ntablespoons\n(30ml) ice-cold\nwater\nDirections\nIn a large mixing bowl, whisk flour, sugar, and salt to combine. Add butter to flour mixture and toss with fingers until butter pieces are thoroughly coated with flour mixture. Using your fingertips, pinch and flatten butter, then rub it between your fingertips until a sandy texture forms, 3 to 4 minutes. (It should resemble coarse breadcrumbs with some pea-size pieces still visible but no large chunks of butter remaining.)\nSerious Eats / Debbie Wee\nDrizzle water over flour mixture and use a bench or dough scraper to incorporate until large clumps form. Tip mixture out onto un-floured countertop and, using the heel of your hand, smear the mixture into the countertop away from you, then use a dough scraper to gather the dough back together. Repeat 2 to 3 times, until a shaggy dough forms, then use your hands to gently squeeze the dough together. Do not overwork; dough should hold together but still feel slightly crumbly, not wet or sticky.\nSerious Eats / Debbie Wee\nFlatten into a 6-inch disc. Wrap tightly in plastic wrap and refrigerate until firm, at least 1 hour, or up to 24 hours.\nSerious Eats / Debbie Wee\nUsing as much flour as needed, roll dough to 1/8-inch thickness and 10 inches wide, adding more flour to the rolling pin or surface as needed to prevent the dough from sticking. You should see streaks of butter in the rolled dough.\nSerious Eats / Debbie Wee\nGently transfer dough to 9-inch tart pan. Using lightly floured fingertips, press dough into the bottom edge and fluted sides of the pan; using a pastry brush, dust off any excess flour. Refrigerate until dough is firm to the touch, about 30 minutes.\nSerious Eats / Debbie Wee\nUsing a sharp paring knife, trim away excess dough from the edges so that the dough is level with the top of the pan. Refrigerate tart shell for at least 1 hour or up to 24 hours.\nSerious Eats / Debbie Wee\nUsing a fork, prick tart dough all over. Freeze tart shell for 30 minutes.\nSerious Eats / Debbie Wee\nTo Bake:\nAdjust oven rack to middle position and preheat oven to 400°F (205° C). Place a crumpled sheet of baking parchment inside the frozen shell and fill to the brim with dried beans, sugar, raw rice, or baking weights.\nSerious Eats / Debbie Wee\nBake crust until edges are firm and lightly golden brown, 23 to 27 minutes. (The bottom will still look \"doughy\" and light in color.) Remove tart crust from oven and carefully remove parchment and weights. Return crust to oven and bake until golden brown around the edges, 7 to 10 minutes. At this point, the crust can be used with fillings that require further baking. For a crust that will be used with uncooked fillings such as a mousse, continue baking until bottom and sides are deeply golden brown, about 5 to 7 minutes more. Transfer to a wire rack and allow tart to cool completely, 45 minutes to 1 hour, before filling or removing from tart pan.\nSerious Eats / Debbie Wee\nSpecial Equipment\nDough scraper, rolling pin, 9-inch tart pan with removable bottom, baking weights or beans\nNotes\nThis recipe can be doubled.\nFor sweet tarts:\nIncrease sugar to 2 teaspoons (10g). For additional flavor, you can also add 1 teaspoon vanilla paste. Whisk vanilla paste into ice water to incorporate it evenly into the dough.\nFor tartlet shells:\nBlind bake at 400° F (205° C) for 20 to 25 minutes, or until lightly golden brown around the edges. Remove parchment and weights and dock with a fork. At this point, the crust can be used with fillings that require further baking. For a crust that will be used with uncooked fillings such as a mousse, continue baking until deeply golden brown, about 8 to 10 minutes more.\nMake-Ahead and Storage\nDough can be tightly wrapped in plastic wrap and refrigerated for up to 24 hours. Allow to sit at room temperature for 15 minutes, or until soft enough to roll. Dough can be also wrapped first in a layer of plastic wrap and then a layer of aluminum foil and frozen for up to 1 month. Thaw in refrigerator, about 4 hours.\nLined and trimmed tart pan can be tightly wrapped in plastic wrap and refrigerated for up to 24 hours or tightly wrapped first in a layer of plastic wrap and then a layer of aluminum foil and frozen for up to 1 month. Bake from frozen.\nWrapped tightly in plastic wrap, baked tart shell will keep at room temperature for up to 1 day.\nTo freeze baked tart shell, wrap tightly in plastic wrap and aluminum foil and freeze for up to 1 month. Thaw at room temperature, about 1 hour.\nPie Dough\nThe Latest\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pte-brise-french-all-butter-dough.webp?"
}