{
  "url": "https://www.seriouseats.com/pate-sablee-recipe-8762473",
  "image_url": "https://www.seriouseats.com/thmb/HJ2o58Y1j9CxyYup1hN0yGFv8Oo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241217PateSable-AmandaSuarez-21-f40e7c1a17c645c68059721f2f833263.jpg",
  "tags": [
    "Pie Dough",
    "The Latest",
    "French",
    "Desserts"
  ],
  "title": "Pâte Sablée (Sandy Tart Dough)",
  "full_text": "Pâte Sablée (Sandy Tart Dough)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nChilling, Freezing, and Cooling Time\n3 hrs 30 mins\nTotal\n4 hrs 20 mins\nServes\n8\nMakes\n2 9-inch tarts\nCook Mode\n(Keep screen awake)\nIngredients\nNonstick\ncooking spray\n250g\nall-purpose flour\n(\n8 3/4\nounces\n; 2 cups), sifted, plus more for dusting\n125\ng\nconfectioners’ sugar\n(4 1/2 ounces; about 1 cup and 2 tablespoons), sifted\n50\ng\nblanched\nalmond flour\n(1 3/4 ounces; 1/2 cup), sifted (see notes)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n125g\nunsalted butter\n(\n4 1/2\nounces\n; 9 tablespoons), cold and cut into 1/2-inch cubes\n50\ng\nbeaten\negg\n(1 3/4 ounce; 3 tablespoons), from 1 large egg\nDirections\nLine the bottom of a 9-inch tart pan with parchment and, using nonstick spray, grease parchment and sides of pan. Dust lightly with flour, shaking out excess. (See notes.)\nSerious Eats / Amanda Suarez\nIn a large mixing bowl, whisk flour, confectioners’ sugar, almond flour, and salt to combine. Add butter to flour mixture and toss with fingers until butter pieces are thoroughly coated with flour mixture. Using your fingertips, pinch and flatten butter, then rub it between your fingertips until a sandy texture forms, 3 to 4 minutes.\nSerious Eats / Amanda Suarez\nMake a well in the center of the flour mixture about 2 to 3 inches wide. Pour beaten egg into the well and, using a fork, gradually incorporate flour into the egg until a dry, crumbly dough forms.\nSerious Eats / Amanda Suarez\nTip dough onto a large, clean, unfloured countertop. Using the heel of your hand, smear the dough away from you, then use your hands or dough scraper to gather it back into a mass. Repeat until a soft, slightly sticky dough forms, about 6 to 8 more times.\nSerious Eats / Amanda Suarez\nDivide dough into two portions, about 300g (10 1/2 ounces) each. Flatten each portion into a 7-inch disc and place it between two sheets of baking parchment. Using a rolling pin, roll each to a 11-inch circle about 1/8-inch or 3mm thick. Carefully transfer dough, still between parchment, onto a 13- by 18-inch rimmed baking sheet and refrigerate until cold to the touch, about 30 minutes.\nSerious Eats / Amanda Suarez\nCarefully peel away one side of the parchment and flip, dough side down, onto prepared pan. (The dough should be cold but malleable; if dough is completely firm, let sit at room temperature for 3 to 5 minutes until pliable.) Remove remaining parchment and use your fingertips to gently press dough into the bottom and fluted sides of the pan. Refrigerate until firm to the touch, about 30 minutes.\nSerious Eats / Amanda Suarez\nUsing a sharp paring knife, trim excess dough from edges so that it is level with the pan. Using a fork, prick bottom of tart dough all over. Refrigerate tart shell for at least 1 hour or up to 24 hours, then freeze tart shell for at least 30 minutes and up to 24 hours.\nSerious Eats / Amanda Suarez\nTo Bake:\nAdjust oven rack to middle position and preheat to 325ºF (165ºC). Bake until crust is firm and deep golden brown, 28 to 30 minutes. Transfer to a wire rack and let cool completely, 45 to 60 minutes, before filling or removing from tart pan.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9-inch tart pan with removable bottom, rolling pin, parchment, wire rack\nNotes\nAlmond flour can be substituted with the same amount of all-purpose flour, but the dough will be less flavorful and slightly more difficult to work with.\nThe chilled rolled dough should not be rock solid. If the dough is too cold it won't be malleable enough to press into the pan, but if it's too warm it will break. Ideally, you’re aiming for cold to the touch but still slightly malleable. This can take 15 to 35 minutes depending on your refrigerator.\nIf using a flat tart ring or pan, you can line the ring with a thin strip of parchment instead of using nonstick spray.\nThis recipe requires a medium egg (about 48 to 50g). To use a large egg, crack into a bowl, beat with a fork, then weigh out  50g.\nThis recipe can be doubled.\nFor tartlet shells:\nPrepare recipe through step 5. Using a 4-inch ring cutter, cut out 12 circles of dough. Use your fingertips to gently press 1 dough circle into bottom and fluted sides of tart shells. Transfer filled tart shells to a 9- by 13-inch baking tray and refrigerate until firm to the touch, about 30 minutes. Using a fork, prick bottom of tart dough all over. Refrigerate tartlet shells for at least 1 hour or up to 24 hours, then freeze tartlet shells for at least 30 minutes and up to 24 hours. Adjust oven rack to middle position and preheat to 325ºF (165ºC). Bake until edges are firm and crust is deep golden brown, 20 to 25 minutes. Transfer to a wire rack and let cool completely, 45 to 60 minutes, before filling or removing from tart pans.\nMake-Ahead and Storage\nDough can be rolled between sheets of parchment and refrigerated for up to 24 hours. When ready to use, let sit at room temperature until dough is malleable enough to drape into pan without cracking, about 10 minutes.\nLined and trimmed tart pan can be tightly wrapped in plastic wrap and refrigerated for up to 24 hours, or tightly wrapped in plastic wrap and aluminum foil and frozen for up to 1 month. Bake from frozen.\nTo freeze baked tart shell, wrap tightly in plastic wrap and aluminum foil and freeze for up to 1 month. Let sit at room temperature until thawed, 1 to 2 hours.\nWrapped tightly in plastic wrap, unfilled baked tart shells can be stored at room temperature for up to 1 day.\nPie Dough\nThe Latest\nFrench\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pte-sable-sandy-tart-dough.webp?"
}