{
  "url": "https://www.seriouseats.com/pate-sucree-tart-shell-recipe",
  "image_url": "https://www.seriouseats.com/thmb/NIi3fiT4dNojivRgIv69Supv-h4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2012__03__20201110-pate-sucree-vicky-wasik-1-3-cca642082aec46a5984f7e7a9a395f51.jpg",
  "tags": [
    "Pie Dough"
  ],
  "title": "Pâte Sucrée (Sweet Tart Dough) Recipe",
  "full_text": "Pâte Sucrée (Sweet Tart Dough) Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n70 mins\nActive\n30 mins\nChilling and Cooling Time\n3 hrs 30 mins\nTotal\n5 hrs 5 mins\nServes\n20\nto 24 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(\n2\nsticks\n;\n225\ng\n)\nunsalted butter\n, soft but cool, about 65°F (18°C), cut into 1-inch-thick slices\n6\nounces\n(\n3/4\ncup\n;\n170\ng\n)\ngranulated sugar\n1\nlarge\negg\n(1 3/4\nounces\n;\n50\ng\n)\n1\nlarge\negg yolk\n(\n3/4\nounce\n;\n20\ng\n)\n15\nounces\n(\n3\ncups\n;\n425\ng\n)\nall-purpose flour\n, such as Gold Medal, plus more for dusting\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use the same weight or half as much by volume\n1\nounce\n(\n2\ntablespoons\n;\n30\ng\n)\nheavy cream\n1/2\nounce\n(\n1\ntablespoon\n;\n15\ng\n)\nvanilla extract\nDirections\nIn the bowl of a stand mixer fitted with the paddle attachment, combine butter and sugar. Mix at low speed to moisten, then increase speed to medium-high and beat, pausing halfway through to scrape down the bowl and beater with a flexible spatula, until light and fluffy, about 5 minutes.\nWorking one at a time with the mixer at medium speed, add egg followed by egg yolk, allowing each to fully incorporate before adding the next and pausing to scrape down bowl and beater in between each addition, about 1 minute total.\nWith the mixer turned off, add flour and salt to bowl. Turn mixer to low speed and mix until dough is crumbly, about 30 seconds.\nWith the mixer still running at low speed, pour in cream and vanilla and continue to mix until dough comes together, about 15 seconds.\nScrape dough onto a lightly-floured work surface. Divide into 2 equal portions, about 16 ounces (455g) each, and shape into flat, round disks. Wrap each disk tightly in plastic wrap and refrigerate for at least 2 hours.\nWorking with one portion of dough at a time, set a dough disk on a generously floured work surface. Using a rolling pin and adding more flour as needed underneath and on top of the dough to prevent sticking, roll out to a 13-inch circle that’s about 1/8 inch thick.\nTo transfer to the tart pan, carefully roll dough around the rolling pin, then unroll over the pan. Dust off excess flour with a pastry brush. Press dough gently yet firmly into the corners and up the sides of the pan. With scissors or kitchen shears, trim off excess, leaving 1/4-inch overhang all around. Repeat with remaining dough. Refrigerate tart shells for at least 1 hour.\nAdjust oven rack to center position and preheat to 350°F (177°C). Remove one chilled tart shell from the refrigerator. Using a paring knife, trim dough overhang around the edge so that the dough is level with the top of the pan. Line tart shell with aluminum foil, fully covering bottom and sides, and fill to the brim with sugar.\nTransfer to a half sheet tray, then bake until fully set and golden brown around the edges, about 35 minutes. To remove foil with sugar, fold long sides of foil toward the middle, gather short sides, and use both hands to carefully transfer sugar to a heat-safe bowl. Let sugar cool to room temperature (it may be used for repeated blind bakings, eventually yielding\ntoasted sugar\n). If needed, continue baking tart shell a few minutes longer to brown on the bottom. Transfer finished tart shell to a wire rack and let cool completely before removing from pan or adding a filling. Repeat with remaining tart shell.\nPhotographs: Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n,\nrolling pin\n, one or two 9 1/2-inch tart pans with removable bottom.\nMake-Ahead and Storage\nThe tightly wrapped dough disks can be refrigerated for up to 24 hours before use. To store them for longer, the tightly wrapped dough disks can be frozen for up to 1 month; to defrost the dough, place a wrapped disk in the refrigerator at least 24 hours before rolling out (dough will still need to be refrigerated for at least 1 hour after rolling and shaping in the tart pan).\nWrapped tightly in plastic, baked tart shells will keep for 1 day at room temperature, or up to 1 month if frozen.\nPie Dough",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pte-sucre-sweet-tart-dough-recipe.webp?"
}