{
  "url": "https://www.seriouseats.com/pay-de-queso-mexican-cheese-pie-recipe-6829247",
  "image_url": "https://www.seriouseats.com/thmb/Rau5PUeGpGGw0pH2WwekXlp2LtM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221116-Pays-de-Queso-Amanda-Suarez-hedenote2-b9d4268e8e2b4dd28f77940582070513.JPG",
  "tags": [
    "Mexican",
    "Pies",
    "Cheese",
    "The Latest"
  ],
  "title": "Pay De Queso (Mexican Cheese Pie)",
  "full_text": "Pay De Queso (Mexican Cheese Pie)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n100 mins\nChilling Time\n6 hrs 15 mins\nTotal\n8 hrs 10 mins\nServes\n8\nto 12 servings\nMakes\n1 9-inch pie\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n7\nounces\n(\n33\ncookies\n;\n200\ng\n)\nMaria cookies\n, such as Goya (see note)\n4 1/2\nounces\nunsalted butter\n(\n9\ntablespoons\n;\n127\ng\n), melted and cooled\nKosher salt\nFor the Filling:\n6\nounces\nevaporated milk\n(\n2/3\ncup\n;\n170\ng\n)\n7\nounces\ncondensed milk\n(\n1/2\ncup\n;\n200\ng\n)\n2\nlarge\neggs\n(\n100\ng\n), brought to slightly cooler than room temperature\n1/4\nteaspoon\nvanilla extract\n4\nounces\n(\n115\ng\n)\nfull-fat cream cheese\n, softened to about 65°F/18°C\n2\nounces\n(\n60\ng\n)\nqueso fresco\n, brought to about 65°F/18°C (see note)\nDirections\nTo make the crust:\nPlace cookies in the bowl of a food processor fitted with a metal blade and pulse until broken down into fine, sandy crumbs, about 1 minute. Transfer crumbs to a medium bowl, add melted butter and a pinch of salt and, using a flexible spatula, mix until crumbs are fully moistened, about 30 seconds.\nSerious Eats / Amanda Suarez\nScrape crumb mixture into a 9-inch pie plate, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup; this will naturally push the crumbs up the sides of the pan. Continue pressing until the crumbs form a compact, even layer across the bottom and sides of the pan. Refrigerate the crust until firm, at least 15 minutes. (Once the crust is firm, you can wrap it in plastic and refrigerate for up to 2 days.)\nSerious Eats / Amanda Suarez\nTo make the filling:\nAdjust oven rack to lower-middle position and preheat the oven to 375°F (190°C). Meanwhile in a blender, combine evaporated milk, condensed milk, eggs, vanilla extract, cream cheese, and queso fresco. Blend on high speed until smooth but not aerated, about 30 seconds.\nSerious Eats / Amanda Suarez\nPlace chilled crust on a rimmed baking sheet, then pour filling into crust. Carefully transfer baking sheet with filled pie to the oven. Bake until the filling is lightly browned and set at the edges with a firm jiggle in the center, 40 to 45 minutes.\nSerious Eats / Amanda Suarez\nSet baking sheet with finished pie on a wire rack and let cool for 1 hour. Transfer pie to the refrigerator and chill until filling is firm, at least 6 hours or overnight.\nSerious Eats / Amanda Suarez\nWhen ready to serve, slice into wedges with a chef’s knife, carefully slide a pie server under the crust, making sure it reaches all the way to the tip of each wedge, and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nfood processor, blender, 9-inch pie plate\nNotes\nMaria cookies are vanilla wafer-like cookies. They can be found at Mexican supermarkets and at most major grocery stores.\nQueso fresco is a fresh, soft, and slightly tangy white Mexican cheese. It can be found at  Mexican supermarkets and at most major grocery stores.\nMake-Ahead and Storage\nWrapped in plastic, pay de queso can be refrigerated for up to 3 days.\nMexican\nPies\nCheese\nThe Latest"
}