{
  "url": "https://www.seriouseats.com/peach-upside-down-cake-recipe-8676669",
  "image_url": "https://www.seriouseats.com/thmb/nJfDtesnq5_imjwdQaNe6GOtHvw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-SEA-PeachUpsideDownCake-Glaze-beauty-18394-SEA-8ae70472f97048429264857abccf5706.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Peach"
  ],
  "title": "Easy Peach Upside Down Cake",
  "full_text": "Easy Peach Upside Down Cake\nClose\nJump to recipe\nCook\n60 mins\nCooling Time\n45 mins\nTotal\n105 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nCoo\nking\nspray\n13 tablespoons (\n183\ng\n)\nunsalted butter\n, divided\n5 ounces (141g)\nlight brown sugar\n(about\n2/3\ncup)\n1 pound (\n454\ng\n) ripe but firm\npeaches,\npeeled, halved, pitted, and cut into 3/4-inch wedges, or 12 ounces (340g) frozen sliced peaches, thawed and drained\n1 cup\ngranulated sugar\n(7 ounces;\n198\ng)\n2\nlarge\neggs\n7 1/2 ounces bleached\ncake flour (\n213g; about\n1 2/3\ncups\n), such as Swan’s Down\n2 teaspoons (\n8\ng)\nbaking powder\n1\nteaspoon\n(3g) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3/4\nteaspoon\nground\ncardamom\n, plus more for sprinkling, if desired\n3/4 cup (\n177\nml)\nwhole buttermilk\nWhipped cream\n(optional),\nfor serving\nDirections\nAdjust oven rack to middle position and heat oven to 350°F (175℃). Spray inside of a 9-inch round metal cake pan or cast-iron skillet with cooking spray; set aside. In a small saucepan, melt 10 tablespoons butter over medium-high heat. Continue to cook, stirring and swirling skillet constantly with rubber spatula, until butter is golden brown and has a nutty aroma, 3 to 8 minutes. Pour the brown butter into a large heatproof bowl; set aside. In the now empty saucepan, add the remaining 3 tablespoons butter and melt over medium heat. Once melted, add brown sugar and cook, stirring often, until sugar is melted and starts to bubble, 1 to 2 minutes. Pour the mixture into the prepared cake pan or skillet, and spread into an even layer to cover the bottom of the pan.\nSerious Eats / Morgan Glaze Hunt\nPat peach slices dry with paper towels. Starting around the outside edges of the cake pan, arrange peach slices flat side down, over brown sugar mixture in tight concentric circles, with concave sides of peach slices facing in. Fill in any gaps with remaining small peach slices; set aside.\nSerious Eats / Morgan Glaze Hunt\nWhisk the granulated sugar into the reserved brown butter in bowl until smooth. Add eggs and whisk until incorporated.\nSerious Eats / Morgan Glaze Hunt\nIn a medium bowl, whisk together flour, baking powder, salt, and cardamom. Add half of the flour mixture to the egg mixture, and fold until just combined. Add buttermilk, and stir until combined. Add remaining flour mixture, and fold until just combined. Pour batter over peaches in the prepared cake pan, and spread into an even layer to completely cover peaches.\nSerious Eats / Morgan Glaze Hunt\nBake until cake is deep golden brown and a wooden toothpick inserted into the center of cake comes out mostly clean, 40 to 50 minutes. Let cool slightly on a wire rack for 15 minutes. Place a serving plate over the cake, and carefully invert cake onto the plate. (If any peaches stick to pan, remove and position on top of the cake). Let cake cool for at least 30 minutes. Slice and serve warm or at room temperature with whipped cream and a sprinkle of cardamom, if desired.\nSerious Eats / Morgan Glaze Hunt\nSpecial Equipment\n9-inch round metal cake pan or cast-iron skillet\nMake-Ahead and Storage\nCover and store at room temperature for up to three days.\nCakes\nThe Latest\nPeach",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-peach-upside-down-cake.webp?"
}