{
  "url": "https://www.seriouseats.com/peach-crisp-recipe-7559621",
  "image_url": "https://www.seriouseats.com/thmb/yL1vxgH-tcQF2RIlswL33jky7Ks=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230713-SEA-PeachCrisp-AmandaSuarez-hero-2-b135660ff47e4b349837a4a4934ab915.jpg",
  "tags": [
    "The Latest",
    "Fruit",
    "Summer Desserts",
    "Desserts",
    "Summer"
  ],
  "title": "Peach Crisp",
  "full_text": "Peach Crisp\nClose\nJump to recipe\nPrep\n20 mins\nCook\n85 mins\nCooling and Macerating Time\n70 mins\nTotal\n2 hrs 55 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n4 1/2\npounds\nripe\npeaches\n(about\n15\nmedium\npeaches\n; see notes)\n3/4\ncup\nlight brown sugar\n(\n4 3/4\nounces\n;\n135\ng\n)\n3\ntablespoons\ntapioca starch\n(about\n1\nounce\n;\n28\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\nteaspoons\nvanilla paste\n(see notes)\nFor the Topping:\n1\ncup\nwhole wheat flour\n(\n4 1/2\nounces\n;\n130\ng\n)\n1/2\ncup\nlight brown sugar\n(\n3 1/4\nounces\n;\n93\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n10\ntablespoons\nunsalted butter\n(\n5\nounces\n;\n140\ng\n), cut into 1/2-inch cubes\n3/4\ncup\nrolled oats\n(\n2 3/4\nounce\n;\n75\ng\n)\n1/2\ncup\npecans\n, toasted and coarsely chopped (\n2\nounces\n;\n57\ng\n)\nVanilla ice cream\n, for serving (optional)\nDirections\nAdjust oven rack to middle position and preheat oven to 350ºF (175ºC). Bring a large pot of water to a boil over high heat. In a large bowl, set up an ice bath by filling it halfway with cold water and ice. Set aside.\nSerious Eats / Amanda Suarez\nFor the Filling:\nUsing a sharp paring knife, score small X at base of each peach; set aside. Using a slotted spoon or spider, lower peaches into boiling water and cook until the scored skin at the base of each peach begins to loosen and peel back, about 1 minute. (Firmer peaches may need up to 3 minutes.) Using a slotted spoon or spider, transfer peaches to the ice bath and let stand until cool enough to handle, about 5 minutes.\nSerious Eats / Amanda Suarez\nWorking with 1 peach at a time, start at scored X on the base of peach and use a paring knife to peel back and remove loosened skin from peach. Discard the skins and repeat with remaining peaches. Cut each peach in half through stem end and remove pit. Slice the peeled peach halves into 1/2-inch thick wedges (see notes).\nSerious Eats / Amanda Suarez\nIn a large bowl, whisk together the light brown sugar, tapioca starch, salt, and vanilla paste. Stir in peach slices and toss to coat. Let stand for 30 minutes.\nSerious Eats / Amanda Suarez\nFor the Topping:\nIn a food processor, pulse whole-wheat flour, light brown sugar, and salt until well-combined. Add oats and toasted pecans and pulse until pecans just start to break apart, 2 to 3 pulses. Add butter and pulse until mixture resembles a coarse meal with some pea-sized pieces (see notes).\nSerious Eats / Amanda Suarez\nTo Bake:\nScrape the macerated peaches and their juices into a 9- by 9-inch square baking dish and press into an even layer. Sprinkle topping evenly over the filling. Bake until the topping is golden brown and juices are bubbling, about 1 hour and 15 minutes. Let cool on wire rack for 30 minutes. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9- by 9- inch or 2-quart baking dish\nNotes\nIf your peaches aren't of the freestone variety, their pits may not release easily. If you can’t remove the pit easily, cut the flesh off the pit as close to the pit as you can (similar to how one removes the flesh on a mango), then slice the peach flesh. It’s okay if they aren’t perfect slices—the crisp will still be delicious!\nVanilla extract may be substituted for vanilla paste.\nTo make the crisp topping without a food processor: In a large bowl, whisk together the whole-wheat flour, light brown sugar, and salt. Add the butter to flour mixture and toss with fingers until butter pieces are thoroughly coated with flour mixture.With your fingertips, smash each cube flat and continue pressing and breaking up the butter until you have pea-sized pieces. Add the rolled oats and pecans to the flour mixture and toss until crumbly.\nMake-Ahead and Storage\nCover and store at room temperature for up to three days.\nThe Latest\nFruit\nSummer Desserts\nDesserts\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/peach-crisp.webp?"
}