{
  "url": "https://www.seriouseats.com/peanut-atole-hot-mexican-corn-drink-peanut-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Kvk8bXdVM1PPQtfxQfz6y6l3vvQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150202-mexican-atoles-drinks-vicky-wasik-23-a9ab4028fa7d47cf947f0460a9f952e2.jpg",
  "tags": [
    "Non-Alcoholic Drinks",
    "Mexican"
  ],
  "title": "Peanut Atole (Hot Mexican Corn Drink With Peanut Flavor) Recipe",
  "full_text": "Peanut Atole (Hot Mexican Corn Drink With Peanut Flavor) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\nnatural smooth peanut butter\n1\ncup\nmilk\n1/2\ncup\nmasa harina para tortillas\n3 1/4\ncups\nwater\n, plus more as needed (see note)\n3\ntablespoons\ndark brown sugar\nKosher salt\nDirections\nUsing a blender, combine peanut butter and milk and blend until thoroughly combined.\nIn a large saucepan, add masa and set over medium heat. Immediately add water in a slow, thin stream while whisking constantly to avoid lumps. Bring to a simmer and whisk in peanut-milk, brown sugar, and a generous pinch of salt.\nReturn to a simmer and lower heat to low, then simmer gently, whisking, for 3 minutes. Thin with additional water as needed to create a thick-yet-drinkable hot beverage (the exact consistency is a matter of personal taste, see note), reheating as necessary. Taste, adding more sugar or salt if desired. Froth with a whisk or immersion blender, ladle into mugs, and serve.\nNotes\nExactly how much water and sugar you add will determine the final consistency and sweetness of the drink. This recipe produces a fairly thick, rich drink that is mildly sweet. You can add more water and sugar if you want a thinner, sweeter version.\nSpecial Equipment\nBlender\nor\nimmersion blender\nRead More\nChampurrado (Mexican Hot Chocolate and Corn Drink)\nOrange Atole (Hot Mexican Corn Drink With Orange Zest)\nNon-Alcoholic Drinks\nMexican"
}