{
  "url": "https://www.seriouseats.com/peanut-butter-jelly-sandwich-cookie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/3lCelaRYh-zXQAnVDtxu-CmETJ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160428-peanut-butter-cookies-vicky-wasik-10-ade2e58196334ddc898553d73ebf4f24.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Peanut Butter"
  ],
  "title": "PB&J Sandwich Cookies Recipe",
  "full_text": "PB&J Sandwich Cookies Recipe\nClose\nJump to recipe\nPrep\n60 mins\nCook\n15 mins\nActive\n45 mins\nTotal\n75 mins\nMakes\n35 sandwich cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cookies:\n3 ounces unsalted butter (6 tablespoons; 85g), cool but firm, about 65°F\n3 ounces creamy peanut butter (1/3 cup; 85g), not reduced-fat or non-homogenized (see note)\n7 ounces sugar (1 cup; 200g)\n1/4 teaspoon baking soda\n1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight\n2 large egg whites, well beaten (about 1/4 cup; 2 1/4 ounces; 65g)\n9 ounces all-purpose flour (1 3/4 cups plus 1 tablespoon; 255g), plus more for dusting work surface\nFor the Filling:\nAbout 6 ounces peanut butter, creamy or crunchy (2/3 cup; 170g)\n5 ounces jam or jelly (140g; volume will vary)\nDirections\nFor the Cookies:\nCombine butter, peanut butter, sugar, baking soda, and salt in the bowl of a stand mixer fitted with a paddle attachment. Cream on medium speed until soft, about 5 minutes, then add egg whites in 4 or 5 additions. After incorporating, scrape bowl and beater with a flexible spatula; resume mixing on low and sprinkle in flour to form a soft dough. Divide in half and flatten into disks. If dough is too soft to roll, wrap in plastic and refrigerate until firm, about 30 minutes.\nSerious Eats / Vicky Wasik\nAdjust oven rack to middle position and preheat to 350°F (175°C). On a generously floured surface, roll a portion of dough into a 5-inch square. Sprinkle with more flour, flip onto the other side, then dust again and roll until about 1/8 inch thick. If necessary, loosen dough from work surface with an offset spatula, then cut into 2-inch rounds, or whatever shape you prefer. Use spatula to transfer to a parchment-lined half sheet pan, then gather scraps, re-roll, and cut again. Repeat with remaining dough. Bake cookies until pale gold around the very edges, about 12 minutes. Cool completely and store in an airtight container until ready to serve. (Wafers can be stored in this way for up to 3 weeks.)\nSerious Eats / Vicky Wasik\nFor the Filling:\nSpread a tablespoon of peanut butter over the bottom of half the cookies, top with a teaspoon of jam or jelly, then sandwich with remaining cookies. Serve immediately or store in an airtight container up to 24 hours.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nrolling pin\n, cookie cutters, large\noffset spatula\nNotes\nThis recipe works best with full-fat commercial peanut butter. Experiments with fresh-ground, \"lite,\" and natural-style peanut butters produced cookies that were unpleasantly dense or tough.\nMake-Ahead and Storage\nDisks of dough can be wrapped in plastic and refrigerated for 1 week. Baked wafers can be stored in an airtight container for up to 3 weeks at room temperature. Assembled sandwich cookies can be stored in an airtight container for up to 24 hours at room temperature.\nRead More\nTaste Test: Creamy Peanut Butters\nTaste Test: Crunchy No-Stir Peanut Butters\nPeanut Butter Pot de Crème with Red Wine Syrup Recipe\nPeanut Butter and Jelly: A Serious Eats Special Report\nE.L. Fudge-Style Chocolate and Vanilla Sandwich Cookies Recipe\nCrispy Lemon-Ginger Sandwich Cookies Recipe\nCookies\nBaking\nPeanut Butter"
}