{
  "url": "https://www.seriouseats.com/peanut-butter-pot-de-creme-with-red-wine-syrup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/1JBE_pe6agxwshCVogxrivPpupA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__10__20111015pbj-71af0f5495664c698bb9a6dc633c7f55.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "Peanut Butter"
  ],
  "title": "Peanut Butter Pot de Crème With Red Wine Syrup",
  "full_text": "Peanut Butter Pot de Crème With Red Wine Syrup\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n45 mins\nChilling Time\n4 hrs\nTotal\n5 hrs 5 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Peanut Custard:\n8\nounces\nmilk\n8\nounces\nheavy cream\n6\nounces\ncreamy peanut butter\n(standard or \"natural\" both work fine)\n1/3\nounce\ndark chocolate\n4\nounces\negg yolks\n(from\n8 to 12\neggs\n)\n4\nounces\nsugar\n1\nounce\nhoney\n1/2\nteaspoon\nsalt\n1 1/2\nteaspoons\nvanilla extract\nFor the Red Wine Syrup:\n7\nounces\nred wine\n3 1/2\nounces\nsugar\n1\npinch\nsalt\nDirections\nPreheat oven to 300°F (150°C) and prepare water bath: set a large pot of water on the stove to boil. When it comes to a boil, shut off heat and let it sit until needed. Arrange six 6-ounce ramekins in a 9- by 13-inch baking dish with tall sides. Have a large piece of aluminum foil standing by.\nMake the Peanut Butter Custard:\nIn a medium pot, combine milk, cream, peanut butter, and chocolate. Turn heat to medium and whisk periodically until hot and both peanut butter and chocolate have completely melted into the dairy.\nMeanwhile, combine egg yolks, sugar, honey, and salt in a large bowl, whisking to combine. When peanut butter mixture begins to steam and perhaps bubble, whisk a ladleful into the eggs. Temper in another two ladles of hot milk, whisking all the while.\nWhisk warm egg mixture into pot of milk and cream. Turn heat to medium-low and cook, using a flexible heat-resistant spatula to stir constantly, until mixture registers 140°F (60°C) on a digital thermometer. Strain through a fine-mesh strainer suspended over a medium bowl.\nPortion mixture evenly between ramekins (about 5 ounces each) then place them in pan. Fill pan about 3/4 full with prepared hot water. Cover whole thing over with foil and very carefully transfer to preheated oven.\nBake for 30 to 45 minutes, or until custards have a gentle set. If they appear liquid when jiggled, continue baking; see Notes. The custards will have a slight, Jello-like wiggle when they've cooked enough, and a skin that will not stick to your finger when lightly touched. Once baked, let custards cool to room temperature. Wrap in plastic and chill in refrigerator for 4 hours before serving.\nMake the Red Wine Syrup:\nIn a small sauce pot, bring red wine to a simmer on medium heat. Turn heat to medium-low and continue to simmer gently until red wine has reduced by half, about 10 minutes. Then add sugar and salt and simmer another 5 minutes, stirring occasionally with a rubber spatula, until sugar has fully dissolved. Cool syrup to room temperature and refrigerate until ready to serve.\nServe custards with syrup and\nshortbread cookies\n, if you like.\nSpecial Equipment\nKitchen scale\n,\ninstant-read thermometer\n,\nsilicone spatula\n,\nfine-mesh strainer\n, six 6-ounce ramekins,\n9- by 13-inch baking dish\nNotes\nAll measurements are given in weight, as volume measures can be very imprecise. I strongly recommend using a kitchen scale for all pastry projects.\nSometimes, based on hot spots in your oven, custards need to be rescued on a case-by-case basis; don't hesitate to remove ones that seem done, while letting others continue to bake.\nMake-Ahead and Storage\nThe custards have a terrific shelf-life and will keep, covered and refrigerated, for about 1 week.\nRead More\nCrème Brûlée\nChocolate Pot de Crème\nAtolillo (Simple Custard)\nRoasted-Buckwheat Custards (Soba-Cha Puddings)\nCustards, Mousses & Puddings\nPeanut Butter"
}