{
  "url": "https://www.seriouseats.com/pear-galette-recipe",
  "image_url": null,
  "tags": [
    "Pies",
    "Thanksgiving Desserts",
    "Baked Fruit",
    "Pear",
    "Fall Desserts"
  ],
  "title": "Simple Pear Galette With Vanilla",
  "full_text": "Simple Pear Galette With Vanilla\nJump to recipe\nPrep\n30 mins\nCook\n35 mins\nActive\n20 mins\nChilling and Cooling Time\n2 hrs 5 mins\nTotal\n3 hrs 10 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nbatch\nold-fashioned flaky pie dough\nFor the Filling:\n1\nvanilla bean\n, split and scraped\n1 1/4\nounces\nplain or\ntoasted\nsugar\n(about\n3\ntablespoons\n;\n35\ng\n)\n3/4\nounce\ntapioca starch\n(about\n3\ntablespoons\n;\n20\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/2\nteaspoon\nChinese five-spice powder\n1/4\nteaspoon\nground\ncardamom\n26\nounces\ncrisp, semi-tart\npears\n, such as\nBosc\nor Seckel (about\n3\nlarge\npears\n;\n735\ng\n)\n1/2\nounce\napple cider vinegar\n(\n1\ntablespoon\n;\n15\ng\n)\nFor the Egg Wash:\n1\nlarge\negg\n1\nlarge\negg yolk\n1/2\nounce\nheavy cream\n(\n1\ntablespoon\n;\n15\ng\n)\n1/8\nteaspoon\n(\n0.5\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or use the same weight\nDirections\nPrepare old-fashioned flaky pie dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 14-inch round. Transfer to a parchment-lined half-sheet pan, cover with plastic, and refrigerate to relax and chill dough at least 2 hours or up to 24.\nFor the Filling:\nAdjust oven rack to lower-middle position and preheat to 400°F (200°C). In a medium bowl, rub vanilla seeds into sugar, then whisk in tapioca starch, salt, Chinese five-spice powder, and cardamom. Reserve vanilla pod for another use.\nWash pears (no need to peel), then quarter, core, and cut into 1/4-inch slices. Measure 20 ounces of pears (about 3 heaping cups; 565g) into the bowl of spiced vanilla sugar, drizzle with apple cider vinegar, and toss until sugar has dissolved.\nSerious Eats / Vicky Wasik\nArrange pears over chilled dough in a roughly 10-inch ring, tiling the slices like dominoes. Drizzle any remaining liquid from filling over fruit. With a sharp knife, cut a series of slits in the border of dough, spacing them about 5 inches apart. Fold dough over pears, tugging gently so the edge of each segment tightly overlaps the one that came before. Refrigerate galette and prepare the egg wash.\nFor the Egg Wash:\nWhisk egg, egg yolk, cream, and salt in a small bowl. Brush over chilled dough in a thin, even layer (including under each flap). This will give the crust a glossy, golden sheen and help bind the pieces together.\nSerious Eats / Vicky Wasik\nBake until galette is golden brown around the edges and bubbling in the center, about 35 minutes. Let cool 5 minutes, then slice into wedges and serve warm, with dollops of whipped cream if desired.\nSpecial Equipment\nHalf-sheet pan\n,\nkitchen scale\nNotes\nResist the temptation to spice the fruit with cinnamon, which falls flat in this sweet and mellow galette.\nRead More\nApple and Pear Tarte Tatin Recipe\nPear-Cardamom Muffins Recipe\nGinger Caramel Apple Galette Recipe\nAutumnal Pear Recipes\nPies\nThanksgiving Desserts\nBaked Fruit\nPear\nFall Desserts"
}