{
  "url": "https://www.seriouseats.com/pear-almond-tart-recipe-8765294",
  "image_url": "https://www.seriouseats.com/thmb/m6Mbm_XWdHKvWxHDnk43-98zlbY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241220-SEA-PearTart-AmandaSuarez-06-47084471701c45dcb527ac8815991fd6.jpg",
  "tags": [
    "The Latest",
    "French",
    "Baking",
    "Desserts",
    "Fall Desserts"
  ],
  "title": "This Is the Pearfect Dessert I'm Bringing to All My Holiday Parties This Year",
  "full_text": "This Is the Pearfect Dessert I'm Bringing to All My Holiday Parties This Year\nClose\nJump to recipe\nPrep\n25 mins\nCook\n55 mins\nCooling Time\n80 mins\nTotal\n2 hrs 40 mins\nServes\n6\nto 8\nMakes\n1 9-inch tart\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\npâte brisée\nor store-bought\npie crust\n, blind-baked in a 9-inch tart shell according to directions (see notes)\nFor the Filling:\n113\ng\nblanched or natural\nalmond flour\n(4 ounces; 1 cup), see notes\n85\ng\nunsalted butter\n, room temperature (3 ounces; 6 tablespoons)\n100g\ngranulated sugar\n(about\n3 1/2\nounces\n; 1/2 cup)\n16g\nall-purpose flour\n(\n1/2\nounc\ne; 2 tablespoons)\n1\nlarge\negg\n1\ntablespoon\n(15ml)\nbrandy\n1 1/2\nteaspoons\nalmond extract\n1 1/2\nteaspoons\nvanilla extract\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2 firm but ripe medium\npears\n(about\n11 3/4\nounces\n; 330g), peeled, cored, and quartered\nHoney\n, for brushing (optional)\nDirections\nAdjust oven rack to middle position and preheat to 350ºF (175ºC). Add almond flour to a parchment-lined rimmed baking sheet and spread into a thin, even layer. Toast in oven, stirring every 3 minutes, until the almond flour is fragrant and light golden brown, about 10 minutes. Remove from oven and let cool to room temperature, about 20 minutes.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter and sugar on low speed to roughly incorporate. Increase to medium-high speed and beat until smooth and creamy, about 3 minutes, pausing to scrape down bowl and beater with a flexible spatula as needed. Add almond flour, all-purpose flour, egg, brandy (if using), almond extract, vanilla extract, and salt. Mix on medium-high speed until smooth, thick, and creamy, pausing to scrape down bowl and beater halfway through, about 2 minutes. Using a flexible spatula, scrape bowl and beater to ensure that no streaks of unmixed butter remain. (The filling can also be prepared in a large bowl with an electric hand mixer.)\nSerious Eats / Amanda Suarez\nScrape almond filling into blind-baked tart shell and, using an offset spatula, spread it evenly from edge to edge to cover the bottom of the tart. Set aside.\nUsing a sharp knife, slice each pear quarter lengthwise into 1/8-inch thick slices, stopping 1/4 inch before the stem end to keep slices attached. Repeat with remaining pears. Using your hands or an offset spatula, gently lift sliced pears and set them on top of the almond filling, flattening and fanning them out. Repeat with remaining pears.\nSerious Eats / Amanda Suarez\nBake until filling is a light golden brown and just firm to the touch, 40 to 45 minutes. (If the tart shell begins to darken too quickly, tent tart with foil and continue to bake.)\nSerious Eats / Amanda Suarez\nRemove from oven and, using a pastry brush, brush sliced pears with honey, if using. Let cool completely in the pan, about 1 hour.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nParchment, rimmed baking sheet, offset spatula, sharp knife, stand mixer or electric mixer, pastry brush\nNotes\nBlanched almond flour is also a solid beige color whereas natural almond flour appears speckled. Either variety will work well in this recipe; it all comes down to personal preference.\nIf using a\nstore-bought crust\n: Adjust oven rack to middle position and preheat to 375ºF (190ºC). Using a fork or sharp paring knife, prick bottom of dough all over. Line chilled pie shell with foil or parchment paper and fill with dried beans, uncooked rice, or baking weights. Set pie on a rimmed baking sheet and bake until edges begin to brown, about 15 minutes. Carefully remove weights and liner. Reduce heat to 350ºF (175ºC) and bake until crust is lightly golden brown, about 10 minutes. Remove tart shell from oven and let cool while you prepare the filling.\nMake-Ahead and Storage\nOnce cooled, the tart can be stored in an airtight container at room temperature for up to 3 days.\nThe Latest\nFrench\nBaking\nDesserts\nFall Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-is-the-pearfect-dessert-im-bringing-to-all-my-holiday-parties-this-year.webp?"
}