{
  "url": "https://www.seriouseats.com/pecan-pie-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/QC2ex7-IXSb6q-nNgXzHsK-F5-4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__10__20121031-pecan-pie-ice-cream-e0e8502d1bfb4393ae42d3af4212dbc5.jpg",
  "tags": [
    "Ice Cream",
    "American",
    "Pecans",
    "Thanksgiving Desserts",
    "Summer Desserts"
  ],
  "title": "Pecan Pie Ice Cream Recipe",
  "full_text": "Pecan Pie Ice Cream Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n60 mins\nChurning/Freezing Time\n11 hrs 30 mins\nTotal\n12 hrs 5 mins\nServes\n8\nto 10 servings\nMakes\n5 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nheavy cream\n1\ncup\nmilk\n1\nvanilla bean\n, split and scraped\n2\ncups\n(about\n8\nounces\n)\npecans\n, toasted and roughly chopped, divided\n6\nlarge\negg yolks\n3/4\ncup\ngranulated sugar\n1 1/4\nteaspoons\nkosher salt\n, divided\n1/2\ncup\nlight (clear)\ncorn syrup\n1/2\ncup\ndark brown sugar\n2\ntablespoons\nmolasses\n2\ntablespoons\nunsalted butter\n2\nteaspoons\nbourbon\nDirections\nFor Pecan-Vanilla Ice Cream:\nBring cream and milk to a simmer in a heavy saucepan over medium heat. Add vanilla and 4 ounces pecans, turn off heat, cover, and let steep for 1 to 2 hours.\nWhisk egg yolks and granulated sugar together in a mixing bowl until thoroughly combined. Pour dairy through a fine mesh strainer into yolk mixture, whisking constantly. Whisk to combine and return mixture to saucepan. Discard pecans and vanilla bean. Cook dairy mixture over medium heat, whisking frequently, until a custard forms on the back of a spoon but a swiped finger leaves a clean line. Strain custard into an airtight container (preferably wide and shallow), stir in 1/2 teaspoon salt, and chill overnight or at least 6 hours. The next day, churn in ice cream maker according to manufacturer's instructions. Chill in freezer until firm but not totally solid, 2 to 3 hours (see note).\nFor Bourbon Pecan Swirl:\nIn a small, heavy saucepan, combine corn syrup, brown sugar, molasses, butter, and remaining 3/4 teaspoon salt. Cook on low heat until all ingredients are combined and sugar is fully dissolved. Stir in remaining 4 ounces toasted pecans. Stir in bourbon and reduce heat to very low, keeping sauce just warm enough to stay mobile.\nUsing a large spoon or flexible spatula, quickly fold pecan swirl into ice cream, just enough to distribute without integrating swirl into base. Return to freezer to harden for 2 to 3 hours before serving. Pecan chunks may have settled to the bottom of the container, so scoop all the way to the bottom when serving.\nNotes\nLet the ice cream base firm up in the freezer for a few hours before adding the swirl, otherwise the swirl will integrate too much into the base and sink to the bottom of the container. When adding the swirl, fold it in just enough to distribute with a large spatula or spoon. Even with that precaution your pecans may sink towards the bottom of the container, so use one that's wide and shallow, and scoop deeply.\nSpecial Equipment\nIce cream maker\nThis Recipe Appears In\nHow to Add Rich, Nutty Depth to Any Ice Cream Recipe\nIce Cream\nAmerican\nPecans\nThanksgiving Desserts\nSummer Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pecan-pie-ice-cream-recipe.webp?"
}