{
  "url": "https://www.seriouseats.com/pecan-pie-bars-recipe",
  "image_url": "https://www.seriouseats.com/thmb/SLDpm2ttkyjL9qqIhBUWVfOJxiM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110412-entertaining-pecanpiecookies-94979289ed5f40fa9ec4add1355b02d8.jpg",
  "tags": [
    "Dessert Bars",
    "Pecans",
    "Fall Desserts"
  ],
  "title": "Pecan Pie Bars Recipe",
  "full_text": "Pecan Pie Bars Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n60 mins\nSetting Time\n2 hrs\nTotal\n2 hrs 50 mins\nServes\n36 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n2\ncups\nall-purpose flour\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nkosher salt\n3/4\ncup\nunsalted butter\n, at room temperature\n1\ncup\nsugar\n1\nlarge\negg\n1/2\nteaspoon\nvanilla\nFor Topping:\n1 1/2\ncups\nsugar\n1\ncup\nheavy cream\n6\ntablespoons\nunsalted butter\n, roughly cut into pieces\n1\nteaspoon\nvanilla\n1/2\nteaspoon\nsalt\n2\ncups\ntoasted, roughly chopped\npecans\nDirections\nPreheat oven to 375 °F. Line a 13 by 9 inch baking pan with foil. Grease foil with butter.\nIn a medium bowl, whisk together flour, baking powder, and salt.\nIn a large bowl, beat together butter and sugar until fluffy and light in color, about 4-5 minutes. Beat in egg, then vanilla. Beat in the flour mixture in two additions, scraping down the sides of the bowl each time.\nLightly flour your hands, then press dough evenly into the bottom of the greased baking pan. Let chill in refrigerator for 20 minutes.\nBake crust for until golden brown, 30 minutes. Take out crust, but keep oven on. Let crust cool completely. While crust is cooling, make filling.\nPlace sugar in a large heavy sauce pan over medium high heat. Let the sugar begin to melt. When you see that the bottom layer has turned brown and is caramelizing, start to mix with a spoon. Mix occasionally until sugar has completely melted into a golden caramel. Pour in heavy cream. The sugar is going to immediately steam and harden into a lump. Do not panic. Turn the heat down to medium and continuously stir caramel until it is completely melted again, about 5 minutes. Stir in butter, vanilla, and salt, and mix until butter has melted completely. Take caramel off the heat and stir in pecans.\nPour filling onto crust and bake for 15 minutes. Let bars rest so that the filling can continue to set, at least 2 hours. Use a sharp knife to cut into squares.\nDessert Bars\nPecans\nFall Desserts"
}