{
  "url": "https://www.seriouseats.com/pecan-tassies-recipe-8764663",
  "image_url": "https://www.seriouseats.com/thmb/MdSruUFD7RxjtPaT9NB-ONxjd44=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241218-SEA-PecanTassies-RobbieLozano-Hero1-36-0ecd8147e359491eab0a08f1bdb7a27c.jpg",
  "tags": [
    "The Latest",
    "Holidays & Seasons",
    "Thanksgiving Desserts",
    "Christmas Desserts",
    "Pecans"
  ],
  "title": "These Mini Southern Pies Will Be the Talk of Your Holiday Party",
  "full_text": "These Mini Southern Pies Will Be the Talk of Your Holiday Party\nClose\nJump to recipe\nPrep\n55 mins\nCook\n35 mins\nChill/Cool Time:\n55 mins\nTotal\n2 hrs 25 mins\nServes\n24\nMakes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n142\ng\nraw pecan halves\n(\n5\nounces\n; about\n1 1/4\ncups\n)\n106\ng\ndark brown sugar\n(\n3 3/4\nounces\n;\n1/2\ncup\n)\n70\ng\nmaple syrup\n(\n2 1/2\nounces\n; about\n1/4\ncup\n)\n28\ng\nunsalted butte\nr, melted (\n1\nounce\n;\n2\ntablespoons\n)\n1\ntablespoon\n(\n15\nml\n)\nbourbon\n1\nteaspoon\nvanilla extract\n1\nlarge egg\n1/2\nteaspoon\ngrated orange zest\nfrom\n1\nsmall orange\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Dough:\n113\ng\nunsalted butter\n(\n4\nounces\n;\n1\nstick\n), softened\n85\ng\ncream cheese\n(\n3\nounces\n;\n6\ntablespoons\n), softened\n128\ng\nall-purpose flour\n(\n4 1/2\nounces\n;\n1\ncup\n)\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175ºC). On a 13- by 18-inch rimmed baking sheet, spread pecan halves in a single layer. Select 24 perfect, unbroken pecan halves; transfer to a small bowl and set aside for topping. Bake remaining pecan halves in preheated oven until fragrant and toasted, 7 to 8 minutes. Let cool slightly, about 5 minutes.\nSerious Eats / Robby Lozano\nMeasure out 1/4 cup (about 32g) toasted pecans. Transfer to a food processor. Process until finely ground, 10 to 20 seconds. Set ground pecans aside for dough. Chop remaining pecans; set aside for filling.\nSerious Eats / Robby Lozano\nPrepare the Dough\n: In a large bowl, beat together softened butter and cream cheese with a flexible spatula until smooth and creamy. Add flour, salt, and reserved ground pecans. Stir together until a cohesive dough forms. Divide dough into 24 one-inch balls, about 14g or 1/2 ounce each.\nSerious Eats / Robby Lozano\nPress 1 dough ball into each cup of a nonstick 24-cup mini muffin pan.  Gently and evenly press dough into the bottom and up the sides of each cup. Transfer pan to freezer; chill until firmed, about 15 minutes.\nSerious Eats / Robby Lozano\nMeanwhile, prepare the filling:\nIn a medium bowl, whisk brown sugar, maple syrup, butter, bourbon, vanilla, egg, zest, and salt together until smooth.\nSerious Eats / Robby Lozano\nRemove muffin pan from freezer. Spoon about 1 teaspoon reserved chopped pecans into each cup. Pour 2 teaspoons filling into each cup. Top each cup with 1 reserved untoasted pecan half.\nSerious Eats / Robby Lozano\nBake until crust is lightly golden and filling is bubbling, 25 to 28 minutes. Let cool slightly, about 5 minutes. Invert tassies onto a wire rack, then turn them right-side-up, and let cool completely on wire rack, about 30 minutes.\nSerious Eats / Robby Lozano\nVariations\nYou can add 1/4 cup mini chocolate chips or chopped chocolate (1/2 teaspoon per tassie) along with the chopped pecans for chocolate-pecan tassies.\nYou can swap pecans for another nut or a mixture of nuts.\nSpecial Equipment\nRimmed baking sheet, food processor, flexible spatula, nonstick 24-cup mini muffin pan, medium bowl, wire rack\nMake Ahead and Storage\nDough can be prepared up to 1 day in advance and stored tightly wrapped in the refrigerator. Bring to room temperature before pressing into muffin pan (cold dough will result in cracked edges).\nPies can be stored in an airtight container for up to 5 days.\nThe Latest\nHolidays & Seasons\nThanksgiving Desserts\nChristmas Desserts\nPecans"
}