{
  "url": "https://www.seriouseats.com/pengat-pisang-malaysian-banana-coconut-soup-recipe-8600993",
  "image_url": "https://www.seriouseats.com/thmb/cSEdEIm-BABbEEeveg4mM0v5GPY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240227-SEA-PengatPisang-MichelleYip-00-e7a664f8356741918db61517cc579a4a.jpg",
  "tags": [
    "The Latest",
    "Dairy-free",
    "Desserts",
    "Banana",
    "Vegan"
  ],
  "title": "Pengat Pisang (Malaysian Banana Coconut Soup)",
  "full_text": "Pengat Pisang (Malaysian Banana Coconut Soup)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nCooling Time\n5 mins\nTotal\n30 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\ndried\nsago pearls\n(\n3 1/2\nounces\n;\n100\ng\n), see notes\n2 to 3\nlarge\nunder-ripe\nbananas\n(about\n12\nounces\n;\n340\ng\n), peeled and sliced into 2-inch pieces, see notes\n1/3\ncup\npalm sugar\n(\n2 3/4\nounces\n;\n78\ng\n)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\npandan leaves\n(\n9\ng\n), fresh or frozen (see notes)\n3\ncups\n(\n720\nml\n)\nwater\n, plus more for soaking the sago pearls\n1 2/3\ncups\n(\n400\nml\n)\nfresh\ncoconut milk\nor\n1\n(14.5 ounce) can\nfull-fat coconut milk, stirred or shaken well\nDirections\nIn a medium bowl, cover dried sago pearls with about 1 inch of cold or room-temperature water. (Using hot water will cause the sago pearls to expand too quickly.) Set aside.\nSerious Eats / Michelle Yip\nIn a medium saucepan, cover sliced bananas, palm sugar, salt, and pandan leaves with the 3 cups (720ml) water. Bring to a boil over high heat, then reduce heat to medium-low and continue cooking, stirring occasionally, until the bananas begin to soften, about 10 minutes.\nSerious Eats / Michelle Yip\nUsing a fine-mesh strainer, strain soaked sago pearls and add them to the saucepan. Using a wooden spoon or rubber spatula, gently stir, breaking up any lumps of sugar or sago as needed, until the sago is mostly translucent, about 2 minutes.\nSerious Eats / Michelle Yip\nAdd the coconut milk and cook, stirring, until bubbles begin to appear around the edges, about 2 minutes. Turn off the heat and allow pengat to sit until it has cooled slightly, about 5 minutes. Ladle into small bowls and serve.\nSerious Eats / Michelle Yip\nSpecial Equipment\nMedium saucepan, fine-mesh strainer, wooden spoon or rubber spatula\nNotes\nLook for sago pearls online or at Asian grocery stores; if you can’t find them, small pearl tapioca offers a similar chew and can be substituted.\nLook for slightly green bananas that are just beginning to yellow. If using ripe bananas instead of green bananas, reduce sugar to 1/4 cup (50g) to accommodate the increased sweetness of the bananas. Season to taste with additional sugar as needed.\nFresh and frozen pandan leaves can be found in well-stocked Asian grocery stores that specialize in Southeast Asian ingredients.\nMake-Ahead and Storage\nLeftovers can be stored in an airtight container and refrigerated for up to 3 days if using canned coconut milk or 1 day if using fresh coconut milk.\nTo reheat leftovers in the microwave or on the stove, stir in about 1/2 cup (120ml) water to loosen pengat before heating—or simply eat it cold for a different but equally delightful experience.\nThe Latest\nDairy-free\nDesserts\nBanana\nVegan",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pengat-pisang-malaysian-banana-coconut-soup.webp?"
}