{
  "url": "https://www.seriouseats.com/penne-pasta-arrabbiata-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KmG-6qyRzHsI_Pot7Vion4T66MU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160211-pasta-arrabiata-vicky-wasik-011-c6de80337920468886b7d6a8c0323544.jpg",
  "tags": [
    "Italian",
    "Vegetarian Mains",
    "Stovetop Pasta",
    "Pastas",
    "Tomato"
  ],
  "title": "Penne With Hot-as-You-Dare Arrabbiata Sauce Recipe",
  "full_text": "Penne With Hot-as-You-Dare Arrabbiata Sauce Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n15 mins\nTotal\n25 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1\npound\n(\n450\ng\n)\npenne pasta\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, plus more as desired\n1\nmedium\nclove garlic\n, crushed\nAs much\ncrushed red pepper\nas you dare (see note)\n1\n(28-ounce; 794 g) can\nwhole peeled tomatoes\n, crushed by hand (see note)\n2\nounces\n(\n60\ng\n) finely\ngrated Parmesan cheese\n, plus more for serving\nSmall handful minced\nflat-leaf parsley leaves\nDirections\nIn a medium saucepan of boiling salted water, cook penne until just short of al dente, about 1 minute less than the package recommends.\nMeanwhile, in a large skillet, combine oil, garlic, and pepper flakes. Cook over medium heat until garlic is very lightly golden, about 5 minutes. (Adjust heat as necessary to keep it gently sizzling.)\nSerious Eats / Vicky Wasik\nAdd tomatoes, stir to combine, and bring to a bare simmer. When pasta is ready, transfer it to sauce using a strainer or slotted spoon. (Alternatively, drain pasta through a colander, reserving 1 cup of cooking water. Add drained pasta to sauce.)\nSerious Eats / Vicky Wasik\nAdd about 1/4 cup pasta water to sauce and increase heat to bring pasta and sauce to a vigorous simmer. Cook, stirring and shaking the pan and adding more pasta water as necessary to keep sauce loose, until pasta is perfectly al dente, 1 to 2 minutes longer. (The pasta will cook more slowly in the sauce than it did in the water.)\nSerious Eats / Vicky Wasik\nContinue cooking pasta until sauce thickens and begins to coat noodles, then remove from heat and toss in cheese and parsley, stirring vigorously to incorporate. Stir in a drizzle of fresh olive oil, if desired. Season with salt and serve right away, passing more cheese at the table.\nNotes\nThe red pepper flakes are what makes this dish \"angry,\" but exactly how angry you want it to be is a personal choice. It's also important to note that different red pepper flakes have different levels of heat. Add as much, or as little, as you feel comfortable with. Feel free to substitute minced fresh red chiles instead of dried, if desired.\nWhen tomatoes are in peak season, you can switch from canned to fresh, using an equal quantity of diced fresh ripe tomatoes (cook just until they soften and begin to break down) or either\nraw tomato coulis\n,\nquick-cooked tomato coulis\n, or\nthe best fresh tomato sauce\n.\nRead More\nPenne alla Vodka\nBucatini all'Amatriciana\nPasta With Spicy 'Nduja-Tomato Sauce\nSicilian-Style Spaghetti Alla Carrettiera (Fresh Tomato and Garlic Sauce)\nShrimp Fra Diavolo (Shrimp and Pasta with Spicy Tomato Sauce\nItalian\nVegetarian Mains\nStovetop Pasta\nPastas\nTomato"
}