{
  "url": "https://www.seriouseats.com/pennsylvania-dutch-apple-pie-recipe-8399305",
  "image_url": "https://www.seriouseats.com/thmb/ksg5UWm_7r18FULO980vIOtkYuU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231108-SEA-DutchApplePie-AmandaSuarez-hero-58eb7a0b79e847c2a151cdf47dd386f8.jpg",
  "tags": [
    "Pies",
    "The Latest",
    "American",
    "Fall",
    "Apple"
  ],
  "title": "Pennsylvania Dutch Apple Pie",
  "full_text": "Pennsylvania Dutch Apple Pie\nClose\nJump to recipe\nPrep\n20 mins\nCook\n100 mins\nChilling and Cooling Time\n7 hrs\nTotal\n9 hrs\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n1\nhalf\nButtery Flaky Pie Crust\nrecipe\n(\ndough\nshaped through step 2)\nFor the Apple Filling:\n4\ntablespoons\n(\n57\ng\n)\nunsalted butter\n4\npounds\n(\n1.8\nkg\n)\napples\n, preferably a mixture of Golden Delicious and Granny Smith (about\n8 to 10\napples\n), peeled, quartered, cored, and sliced 1/2 inch thick (see notes)\n1/3\ncup\n(\n118\nml\n)\nmaple syrup\n1/3\ncup\n(\n79\nml\n)\napple cider\n1/4\ncup\n(\n59\nml\n)\nheavy cream\n2\ntablespoons\ncornstarch\n1/2\nteaspoon\nkosher salt\n; for table salt use half as much by volume\n1\nteaspoon\nground cinnamon\n1/2\ncup\nraisins\n(\n2 1/2\nounces\n;\n70\ng\n), optional\nFor the Topping:\n1\ncup\nall-purpose flour\n(\n4 1/2\nounces\n;\n128\ng\n)\n1/2\ncup\npacked light\nbrown sugar\n(\n3 3/4\nounces\n;\n106\ng\n)\n1\nteaspoon\nground cinnamon\n1/2\nteaspoon\nkosher salt\n; for table salt, use half as much by volume\n6\ntablespoons\n(\n85\ng\n)\nunsalted butter\n, melted and cooled slightly\nDirections\nFor the Crust:\nUsing your hands and rolling the dough's edges on the counter, shape into a 5-inch disk. Wrap tightly with plastic wrap and refrigerate until firm, about 30 minutes. Set the dough on a generously floured work surface and roll dough into a 12-inch circle. If the dough is too firm to roll at the start, let sit on the counter for 5 minutes before trying to roll again. Loosely roll dough around rolling pin and gently unroll it onto a 9-inch pie plate (preferably metal), letting excess dough hang over the edge. Ease dough into plate by gently lifting edge of dough with one hand while pressing into plate bottom with your other hand.\nSerious Eats / Amanda Suarez\nTrim overhang to 1/2 inch beyond the lip of the plate. Tuck overhang under itself; folded edge should be flush with edge of plate. Press the double layer of dough with your fingers to seal, then bend up at a 90-degree angle and flute by pressing thumb and index finger about 1/2-inch apart against outside edge of dough, then use index finger (or knuckle) of other hand to press into the dough to form a fluted edge. Repeat all the way around. Wrap dough-lined plate loosely in plastic and refrigerate until dough is firm, at least 2 hours or up to 24 hours.\nSerious Eats / Amanda Suarez\nFor the Apple Filling:\nAdjust oven rack to lowest position and heat oven to 375℉ (190℃). In a 12-inch stainless-steel or nonstick skillet, melt 2 tablespoons butter over medium-high heat until bubbling. Add half of apples, cover, and cook until the apples begin to release their juice, about 4 minutes. Uncover and continue to cook, stirring occasionally, until the apples are tender and golden brown, about 5 minutes. Transfer apples and their juices to a rimmed baking sheet. Repeat with remaining 2 tablespoon butter and remaining apples; transfer to sheet with cooked apples. Spread apples into an even layer and let cool to room temperature, about 30 minutes.\nSerious Eats / Amanda Suarez\nIn a large bowl, whisk maple syrup, cider, heavy cream, cornstarch, cinnamon, and salt together until smooth. Add cooled apples and any accumulated juices and toss to combine. Stir in raisins, if using.\nSerious Eats / Amanda Suarez\nFor the Topping:\nIn a bowl, whisk flour, sugar, cinnamon, and salt to combine. Drizzle in butter and stir until no dry spots remain and mixture forms clumps when pressed between fingers. Refrigerate until ready to use.\nSerious Eats / Amanda Suarez\nFor the Pie:\nPlace the dough-lined pie plate on a parchment paper–lined rimmed baking sheet. Transfer apple mixture to the prepared dough-lined plate. Press apples into an even layer (take care not to mound the apple mixture in center of plate). Pour any remaining liquid from bowl over the apples.\nSerious Eats / Amanda Suarez\nBreak topping (it will harden in the refrigerator) into pea-size crumbs and distribute evenly over the apple mixture. With clean, dry hands, pat topping lightly to adhere.\nSerious Eats / Amanda Suarez\nBake pie, rotating sheet halfway through baking, until the topping is golden brown, filling is bubbling, and a paring knife inserted in the center meets little resistance, 50 to 75 minutes. (If crumb topping darkens too quickly before the filling and bottom of pie are fully baked, cover top of pie loosely with aluminum foil and continue baking.) Let the pie cool on a wire rack for at least 4 hours or preferably overnight. Slice and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9-inch pie plate\n(preferably metal),\nrolling pin\n,\n12-inch stainless steel skillet or nonstick skillet\nNotes\nI prefer a mix of tart (e.g., Granny Smith) and sweet (e.g., Golden Delicious) apples; you can also use Empires or Cortlands as tart options and Fuji, Jonagolds, or Braeburns for sweet.\nMake-Ahead and Storage\nThe pie can be made ahead and held at room temperature for up to 2 days or refrigerated for up to 5 days.\nTo serve warm, heat the pie on the middle rack of oven at 325℉ (165℃) until warmed through, about 15 minutes.\nPies\nThe Latest\nAmerican\nFall\nApple",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pennsylvania-dutch-apple-pie.webp?"
}