{
  "url": "https://www.seriouseats.com/peperonata-bell-pepper-italian-recipe",
  "image_url": null,
  "tags": [
    "Bell Peppers",
    "Italian",
    "Vegetarian Sides",
    "Vegetable Sides"
  ],
  "title": "Peperonata (Sweet Bell Peppers With Olive Oil, Onion, and Tomatoes)",
  "full_text": "Peperonata (Sweet Bell Peppers With Olive Oil, Onion, and Tomatoes)\nJump to recipe\nCook\n95 mins\nActive\n90 mins\nTotal\n95 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\nextra-virgin olive oil\n, divided\n6\nmedium\ncloves\ngarlic\n, thinly sliced\n2\nmedium\nyellow onions\n, sliced 1/4 inch thick\n4\npounds\nred\n,\nyellow\n, and/or\norange\nbell peppers\n(about\n6\nlarge\nbell peppers\n), stemmed, seeded, and sliced lengthwise 1/2 inch thick\n1\ncup\npureed tomatoes\n(see notes)\n2\nsprigs\nbasil\nor oregano\nKosher salt\n1\ntablespoon\nwhite wine vinegar or\nred wine vinegar\nDirections\nIn a large pot or Dutch oven, heat 1/2 cup olive oil over medium heat until shimmering. Add garlic and cook, stirring, until just starting to turn golden, 3 to 4 minutes. Stir in onions, increase heat to medium-high, and cook for 2 minutes. Stir in peppers and cook, stirring occasionally, until starting to soften, about 20 minutes.\nSerious Eats / Vicky Wasik\nAdd tomato and basil or oregano sprigs and stir to combine. Bring to a gentle simmer, then lower heat to maintain simmer. Continue to cook, stirring occasionally, until peppers are very soft, about 1 hour. Stir in remaining 1/4 cup olive oil and season with salt. Stir in vinegar (see notes). Discard herb sprigs. Serve right away, or chill, then serve reheated, slightly chilled, or at room temperature.\nSerious Eats / Vicky Wasik\nNotes\nFor the pureed tomatoes, you can use a puree of fresh peeled and seeded tomatoes that have been briefly cooked to concentrate their flavor, or canned whole tomatoes that you've blended with their juices. (Canned tomatoes are often the better choice, since they are usually top-quality.) If you make this with beautiful, ripe summer bell peppers, they should provide enough sweetness to balance the small amount of vinegar. If your peppers are less sweet and the peperonata tastes a little too tart, add a tiny bit of sugar, a pinch at a time, until the flavor is balanced.\nBell Peppers\nItalian\nVegetarian Sides\nVegetable Sides"
}