{
  "url": "https://www.seriouseats.com/pepper-jelly-recipe-11753739",
  "image_url": "https://www.seriouseats.com/thmb/0AF2ODX30NoY8USsb_Bi_ZV3Q2U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250611-SEA-PepperJelly-MorganGlaze-HERO-f44e7988ff66450384045511526d40ba.jpg",
  "tags": [
    "Jams & Jellies",
    "The Latest",
    "Recipes",
    "Condiments & Sauces",
    "Soul Food & Southern"
  ],
  "title": "The Southern Condiment We Put on Almost Everything",
  "full_text": "The Southern Condiment We Put on Almost Everything\nClose\nJump to recipe\nPrep\n20 mins\nCook\n10 mins\nChilling and Cooling Time:\n12 hrs 30 mins\nTotal\n13 hrs\nServes\n48\nMakes\n6 cups\nCook Mode\n(Keep screen awake)\nIngredients\n5\nlarge\nred bell peppers\n(about\n29\nounces\n;\n822\ng\n), stemmed and seeded, divided\n3\nFresno\nchiles\n(about\n1 1/2\nounces;\n43\ng\n), stemmed and seeded, divided\n2\nlarge\ngreen bell peppers\n(about\n12\nounces\n;\n340\ng\n), stemmed, seeded, and finely chopped\n2\nmedium\njalapeño\nchiles (1 ounce; 28 g each), stemmed, seeded, and finely chopped\n1\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\n3\ncups\n(about\n21\nounces\n;\n595\ng\n)\ngranulated sugar\n1 3/4\ncup\n(\n420\nml\n)\napple cider vinegar\n1\n(1.75-ounce)\npackage\nlow-sugar powdered pectin\nsuch as Ball or Sure-Jell (see notes)\nDirections\nThoroughly wash 6 (1/2-pint-size) canning jars and their lids. If you plan to process the jelly for shelf-stable storage, sterilize the jars as described in our\ncanning guide\n.\nSerious Eats/ Morgan Hunt Glaze\nCoarsely chop 2 red bell peppers and 2 Fresno chiles, and place in bowl of a food processor. Pulse until very finely chopped, about 12 pulses, scraping down sides of bowl as needed. Transfer mixture to a large stockpot or Dutch oven. Using a knife, finely chop remaining 3 red bell peppers and the remaining Fresno chile; transfer to Dutch oven with peppers. Add green bell peppers, jalapeño chiles, and salt to Dutch oven.\nSerious Eats/ Morgan Hunt Glaze\nCook, covered, over medium heat until peppers are completely softened, about 8 minutes.\nSerious Eats/ Morgan Hunt Glaze\nUncover and simmer, stirring occasionally, until most of the liquid has evaporated, about 5 minutes. Stir in sugar and vinegar and bring mixture to a full boil over medium-high heat, then reduce to a simmer. Stir in pectin until dissolved, return heat to medium-high, and bring to a full rolling boil. As soon as mixture reaches a full boil, cook for 1 minute, then remove from heat. Let stand for 5 minutes. Using a metal spoon, carefully scrape any foam or scum from surface of jelly. Transfer jelly into prepared canning jars, leaving 1/4-inch space at the top. Using wet paper towels or a kitchen towel, wipe any jelly from the rims.\nSerious Eats/ Morgan Hunt Glaze\nFor short-term storage:\nLet jelly cool to room temperature, about 30 minutes. Screw on lids, and refrigerate until set, at least 12 hours. Jelly can be stored for up to 1 month in refrigerator. When ready to serve, stir jelly to distribute peppers evenly.\nSerious Eats/ Morgan Hunt Glaze\nFor long-term storage:\nWhile jelly is still hot, screw on tops until finger-tip tight (do not over-tighten). Place a canning rack in bottom of a large stockpot. Fill with water, and bring to a boil over high heat. Carefully lower jars into pot. Return water to boil over high; cover and boil for 10 minutes. Off-heat, let jars sit in water for 5 minutes. Using canning tongs, carefully remove jars from water. Jelly can be stored at room temperature for up to 1 year; refrigerate after opening and use within 3 weeks. When ready to serve, stir jelly to distribute peppers evenly.\nEquipment\n1/2-pint canning jars, lids, and rings, large stockpot or Dutch oven, deep stockpot (if canning), canning funnel (if canning), jar lifter (if canning)\nNotes\nThis recipe was developed using low-sugar pectin; do not substitute other types of pectin unless you know how to properly adjust the recipe. We recommend using either the low-sugar pectin from Ball or brand or Sure-Jell rather than other brands (the brand Pomona's, in particular, did not work like Ball or Sure-Jell in our tests).\nJelly served cold will have a firmer texture. Bring to room temperature if a looser texture is desired.\nMake-Ahead and Storage\nUnprocessed jelly can be refrigerated for 1 month.\nProcessed (heat-treated) jelly can be stored in a cool, dark place for up to 1 year. After opening, refrigerate and use within 3 weeks.\nWhen ready to serve, stir jelly to distribute peppers evenly.\nJams & Jellies\nThe Latest\nRecipes\nCondiments & Sauces\nSoul Food & Southern",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-southern-condiment-we-put-on-almost-everything.webp?"
}