{
  "url": "https://www.seriouseats.com/pequenes-chilean-onion-empanadas-recipe-7974069",
  "image_url": "https://www.seriouseats.com/thmb/wSQGqXsKjegQiJxZI6qyEO_nQKQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230926-Pequenes-EstudioComo-hero-64c0606409db41b39bc195d533f2dd79.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Savory",
    "Onions",
    "South American"
  ],
  "title": "Pequenes (Chilean Onion Empanadas)",
  "full_text": "Pequenes (Chilean Onion Empanadas)\nClose\nJump to recipe\nPrep\n40 mins\nCook\n45 mins\nCooling Time\n60 mins\nTotal\n2 hrs 25 mins\nServes\n6\nto 12\nMakes\n12 each\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pequenes Filling:\n1/4\ncup\nlard\n,\nvegetable shortening\n, or\nvegetable oil\n3 1/2\npounds\n(\n1.5\nkg\n)\nwhite\nor\nyellow onions\n(about\n7\nmedium\nonions\n), diced\n1\ntablespoon\nChilean aji de color\nor\nsweet paprika\n1/2\nteaspoon\nground cumin\n1\ntablespoon\n(\n9\ng\n)\nsalt\nDiamond Crystal\nkosher salt\n, plus more as needed; for table salt use half as much by volume or the same weight\n1 to 2\ntablespoons\n(\n15-30\nml\n)\nChilean hot sauce\nor\nsriracha\n(optional)\nFreshly ground black pepper\n1\ntablespoon\nall-purpose flour\n1\ncup\n(\n235\nml\n)\nbeef\nor\nvegetable broth\nFor the Empanada Dough:\n4\nounces\n(\n115\ng\n)\nunsalted butter\n4\nounces\n(\n115\ng\n)\nlard\nor\nvegetable shortening\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; if using table salt, use half as much by volume or the same weight\n2\npounds\n(\n905\ng\n)\nall-purpose flour\n, plus more for dusting\n1\nteaspoon\nbaking powder\n1 1/2\ncups\n(\n355\nml\n) hot\nwater\n(130 to 140°F/55 to 60°C), divided\n2\nlarge\neggs\n, at room temperature and lightly beaten, divided\n2\ntablespoons\n(\n30\nml\n)\nChilean\npisco\n(use\nPeruvian pisco\nor\nvodka\nif not available)\nTo Assemble:\n1/4\ncup\n(\n60\nml\n)\nmilk\n1\nlarge\negg yolk\nbeaten with\n2\ntablespoons\nmilk\nto form an egg wash\nDirections\nFor the Pequenes Filling:\nIn a large nonstick pan or medium Dutch oven, heat lard over medium heat until melted and shimmering. Add onions and cook, stirring occasionally, until soft and transparent, about 15 minutes.\nSerious Eats / Estudio Como\nAdd ají de color, cumin, salt, hot sauce (if using), and freshly ground black pepper to taste and cook, stirring constantly, until fragrant, about 30 seconds. Using a wooden spoon, add flour into onion mixture and cook stirring frequently until no lumps remain, about 2 minutes.Stir in broth and bring to a boil over high heat, then reduce heat to low and simmer, stirring occasionally, until reduced and onion mixture is almost dry, 10 to 20 minutes. Season with salt to taste.\nSerious Eats / Estudio Como\nTransfer onion mixture to bowl and let cool slightly, then refrigerate until chilled, about 30 minutes.\nSerious Eats / Amanda Estudio Como\nFor the Empanada Dough:\nIn a small saucepan, melt butter and shortening over medium heat until hot (130 to 140°/55 to 60°C).\nSerious Eats / Estudio Como\nIn a big mixing bowl, thoroughly whisk together flour, salt, and baking powder. Make a well in center of flour mixture and add half of the hot water, half of the melted hot fat mixture, and half of the eggs. Using a wooden spoon, stir vigorously until combined and small lumps form. Add remaining water, fat mixture, eggs, and pisco and stir vigorously until rough dough ball forms and separates from the bowl.\nSerious Eats / Estudio Como\nTransfer dough to a lightly floured work surface and knead by hand until smooth, and still warm, about 3 minutes.\nSerious Eats / Estudio Como\nWrap with with plastic wrap and let rest in a warm place for 15 minutes (see notes).\nSerious Eats / Estudio Como\nTo Assemble:\nBefore filling the pequenes, par-freeze onion filling until firm, 15 to 30 minutes (see notes). Adjust oven rack to middle position and preheat oven to 475°F (245°C).\nSerious Eats / Estudio Como\nCut dough into 12 equal pieces (4 1/2 ounces;125g each).\nSerious Eats / Estudio Como\nWorking with 1 piece of dough at a time (keep remaining dough pieces covered and warm), dust dough piece lightly with flour and roll into a ball on a lightly floured work surface. Using a rolling pin, roll into a 9 1/2-inch (24cm) round (1/16-inch thick). Do not worry if disc is not perfect; edges will be trimmed later.\nSerious Eats / Estudio Como\nPlace 3 tablespoons (about 3 ounces; 85g) cold onion filling in lower center half of dough round. Using pastry brush, lightly brush outer 1-inch edge of dough round with milk. Fold dough over filling (without stretching the dough), pressing gently on the border to seal the edges. It should look like a half moon. Don’t worry if some air is trapped inside, as empanadas will be pricked before baking.\nSerious Eats / Estudio Como\nUsing a pasta wheel or pizza cutter, trim excess dough to form a 3/4-inch (2cm) dough border. Lightly brush milk over sealed edge. Using your fingers, make 4 evenly spaced folds of the dough border inward towards the filling: 2 from the corners towards the sides of the empanada, and then 2 in the center. Folds should slightly overlap and form a V (as shown in the image). Using your index finger, press firmly in the corners where foldings meet. Repeat with remaining dough pieces and filling.\nSerious Eats / Estudio Como\nLine 2 rimmed baking sheets with parchment paper. Arrange the pequenes on the prepared sheets, spacing them at least 1 inch apart. Re-whisk egg wash to recombine and brush pequenes with egg wash. Using a toothpick or tip of paring knife, prick tops of pequenes for ventilation.\nSerious Eats / Estudio Como\nBake one sheet tray at a time, rotating once halfway through, until golden brown, 12 to 14 minutes. Transfer the baking sheet to a cooling rack and repeat with remaining baking sheet. Let the pequenes cool for 10 minutes before serving.\nSerious Eats / Estudio Como\nSpecial Equipment\nKitchen scale, rolling pin, pasta wheel cutter or pizza cutter, pastry brush, bench scraper\nNotes\nIt is common for pequenes to leak juices while baking. However, this can be avoided by keeping the filling very cold during assembly. Chilling the onion mixture in the freezer for 15 to 30 minutes before assembling ensures the pequenes will not leak. If filling becomes warm, chill in the freezer while assembling.\nIt is important to keep the empanada dough warm and malleable for easier shaping. To keep the dough warm, try my late Abuelita’s trick: keep the covered dough in a bowl on an inverted lid of a stockpot half full of simmering water.\nWhen shaping the pequenes, always fold the dough edge inward towards the body of the empanada. The inspiration behind this specific folding technique is to resemble the shape of the Chilean Pequen owl’s angular and pointy face, which is where the recipe name comes from.\nMake-Ahead and Storage\nThe onion filling can be refrigerated in an airtight container for up to 2 days or frozen for up to 2 months.\nSnacks & Appetizers\nThe Latest\nSavory\nOnions\nSouth American",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pequenes-chilean-onion-empanadas.webp?"
}