{
  "url": "https://www.seriouseats.com/perfect-egg-fried-rice",
  "image_url": null,
  "tags": [
    "White Rice",
    "Chinese",
    "Stir-Fry",
    "Scrambled Eggs",
    "Quick Dinners"
  ],
  "title": "Perfect Egg Fried Rice (On Whatever Gear You Have)",
  "full_text": "Perfect Egg Fried Rice (On Whatever Gear You Have)\nJump to recipe\nCook\n10 mins\nActive\n10 mins\nTotal\n10 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\nml\n)\nvegetable\nor other neutral\noil\n3\nlarge\neggs\n, thoroughly beaten\n1 1/2 to 2\ncups\n(about\n1\npound\n/\n450\ng\n)\ncooked rice\n(see note)\n2\nteaspoons\n(\n10\nml\n)\nlight soy sauce\n3\nscallions\n, thinly sliced crosswise\nDirections\nTo cook in a wok on a gas burner:\nPreheat a wok over high heat until lightly smoking. Add 1 tablespoon oil and swirl to coat. If cooking on a powerful outdoor wok burner, reduce heat to minimum. If using a standard Western burner, keep heat on high throughout cooking. Add eggs to center of wok and cook, swirling wok until eggs are puffy and lightly browned on the bottom, about 10 seconds on a powerful burner or 30 seconds on a standard burner. Flip eggs and lightly brown on second side. Push eggs up to the side of the wok.\nSerious Eats / Amanda Suarez\nAdd another tablespoon of oil to the wok and swirl to coat. Add rice to center of wok. Flip eggs on top of rice, then using a wok spatula, break the rice and eggs up, tossing and stirring as you break them. Stir-fry until rice starts to pop and jump on its own when you set the wok down, about 1 minute on a powerful burner or 2 to 3 minutes on a standard burner.\nSerious Eats / Amanda Suarez\nAdd remaining tablespoon of oil around the rim of the wok, then add the soy sauce to the same spot. Stir-fry until rice and eggs are evenly coated in the soy sauce (the rice should be more or less broken up into distinct grains without any large clumps). Add scallions. Remove from heat and toss to combine. Transfer to a serving platter and serve immediately.\nSerious Eats / Amanda Suarez\nTo cook in a skillet on an electric or induction burner:\nAdd 1 tablespoon oil to a large non-stick, carbon steel, or cast iron skillet and swirl to coat. Heat over high heat until oil is shimmering. Add eggs to center of pan and cook without moving until puffed and lightly browned on one side, about 30 seconds. Fold eggs into a loose omelet and push to the side of the pan.\nAdd remaining 2 tablespoons of oil to the pan and swirl to coat. Add rice to center of pan. Flip eggs on top of rice, then using a wooden spoon, break the rice and eggs up, tossing and stirring as you break them. Stir-fry until rice grains are loose and separated, 2 to 3 minutes.\nAdd soy sauce to the pan. Stir-fry until rice and eggs are evenly coated in the soy sauce (the rice should be more or less broken up into distinct grains without any large clumps). Add scallions. Remove from heat and toss to combine. Transfer to a serving platter and serve immediately.\nSpecial Equipment\nWok\n,\npowerful outdoor gas burner\n(optional)\nNotes\nFor the rice, it's important that it is relatively dry. If using fresh-cooked rice, spread the rice out into a thin layer on a rimmed baking sheet immediately after cooking and allow to steam-dry for at least 15 minutes. Alternatively, store rice in an uncovered container in the refrigerator overnight. Break large rice clumps up with your hands before beginning.\nMake-Ahead and Storage\nThe rice can be pre-cooked, cooled, and refrigerated in an airtight container overnight. The fried rice is best made right before serving.\nRead More\nQuick and Easy Pork Fried Rice With Corn and Shishito Peppers\nKimchi and Spam Fried Rice\nNasi Goreng (Indonesian Fried Rice)\nFried Rice With Chinese Sausage, Cabbage, and Torch Hei\nWhite Rice\nChinese\nStir-Fry\nScrambled Eggs\nQuick Dinners"
}