{
  "url": "https://www.seriouseats.com/perfect-stovetop-thai-jasmine-rice",
  "image_url": "https://www.seriouseats.com/thmb/kr-iYxa1tev9ngCNws4UwRgrefU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201020-thai-rice-derek-lucci-1-5fce969f8f344984aa07b9a73cb5a8e1.jpg",
  "tags": [
    "White Rice",
    "Thai",
    "Stovetop"
  ],
  "title": "Stovetop Thai Jasmine Rice (Khao Hom Mali) Recipe",
  "full_text": "Stovetop Thai Jasmine Rice (Khao Hom Mali) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n5 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n185\ng\n)\nThai jasmine rice\n(see note)\n1 1/4\ncups\n(\n300\nml\n)\nwater\nDirections\nPlace rice in a large bowl and cover by 2 inches with cool water. Using your hands, vigorously swish rice in the water until water turns cloudy, about 30 seconds. Using a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. Refill the bowl with cool water, and repeat rinsing and draining process. Transfer drained rice along with 1 1/4 cups (300ml) water to a saucepan with a tight-fitting lid; a glass lid will help you visually monitor progress of rice as it cooks.\nIf cooking rice in a saucepan with a glass lid, bring to a simmer, covered, over low heat, and cook until rice is tender and no water remains in saucepan, about 20 minutes. Alternatively, bring to a simmer, uncovered, over medium-high heat, then cover and reduce heat to low, and cook until rice is tender and no water remains in saucepan, about 20 minutes. Check for doneness by inserting a rubber spatula against the side of the pot and pushing the rice aside to see whether there’s any water left at the bottom of the saucepan. If the bottom is dry, but the rice still looks a bit wet, remove saucepan from heat and let rice rest, covered, until lingering moisture has been absorbed by rice, 5 to 10 minutes. Taste, and if you prefer a softer texture, sprinkle 2 tablespoons (30ml) water over rice, cover, and cook over low heat, checking occasionally to make sure rice at bottom of saucepan doesn't scorch, until it reaches preferred level of doneness, 5 to 10 minutes longer.\nOnce rice is cooked, fluff gently with a rubber spatula or fork to separate grains, and cover to keep warm until serving. Serve. Leftover rice can be refrigerated in an airtight container for up to 1 week.\nSpecial Equipment\nFine-mesh strainer\n,\nsaucepan with lid\nNotes\nWhen purchasing jasmine rice, look for jasmine rice from Thailand, which should be labeled hom mali rice; look out for \"new crop\" rice, too, which is fresher, fluffier, and more fragrant than rice that has been aged for a longer period of time. I regularly use Kirkland Signature Thai jasmine rice from Costco.\nMake-Ahead and Storage\nCooked jasmine rice is best enjoyed immediately, but leftovers can be refrigerated in an airtight container for up to 1 week. Reheat in the microwave, covered, until steaming hot.\nWhite Rice\nThai\nStovetop"
}