{
  "url": "https://www.seriouseats.com/perfect-meringue-cookies-recipe-8656492",
  "image_url": "https://www.seriouseats.com/thmb/zUFnyVat2HzeITdF5M4mOiFp8og=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240531-SEA-merginuecookies-AmandaSuarez-hero-e33cb925abc74e59af6505e169fd4079.jpg",
  "tags": [
    "The Latest",
    "French",
    "Gluten-free Desserts",
    "Baking",
    "Desserts"
  ],
  "title": "Bakery-Worthy Meringue Cookies",
  "full_text": "Bakery-Worthy Meringue Cookies\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs\nCooling Time\n60 mins\nTotal\n3 hrs 15 mins\nServes\n72 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\negg whites\n(\n105\ng\n), room temperature\n1/4\nteaspoon\ncream of tartar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ncup\ngranulated sugar\n(\n7\nounces\n;\n200\ng\n)\nDirections\nPreheat oven to 200ºF (93ºC). Line two rimmed baking sheets with parchment paper and set aside.\nFit a piping bag\nwith desired piping tip; set aside.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment or using a hand mixer and a large bowl, begin whipping egg whites at low speed until whites look wet and frothy, about 1 minute. With the mixer running, add cream of tartar and salt and mix until dissolved, about 10 seconds.\nSerious Eats / Amanda Suarez\nKeeping the mixer at low speed, slowly add 1/4 of the sugar in a steady stream. Increase speed to medium and slowly add remaining sugar. Continue mixing at medium speed until meringue is thick and glossy and holds firm peaks when you lift the whisk, about 10 minutes. (While you could speed the mixer up for a faster meringue, the meringue is more stable when mixed for a longer time at slower speeds, making it less likely to deflate. The exact mixing time will depend on your mixer and other variables, so keep mixing to reach firm peaks even if longer than the estimated 10 minutes.)\nSerious Eats / Amanda Suarez\nUsing a flexible spatula, gently scrape meringue into prepared piping bag. Pipe meringue onto prepared baking sheets.\nSerious Eats / Amanda Suarez\nBake meringues until dry, about 2 hours. When meringues are done, turn oven off, and allow meringues to gradually cool in the oven for 30 minutes. Slowly crack oven door open, using a wooden spoon to keep the oven door slightly ajar. Allow meringue to cool completely, about another 30 minutes.\nSerious Eats / Amanda Suarez\nNotes\nThis recipe can be doubled.\nSpecial Equipment\n2 rimmed baking sheets, parchment paper, piping bag, piping tip, stand mixer or hand mixer, flexible spatula\nMake-Ahead and Storage\nLeftover meringue cookies can be stored  in an airtight container, ideally with a silica packet for up to 5 days at room temperature but may soften as they sit.\nThe Latest\nFrench\nGluten-free Desserts\nBaking\nDesserts"
}