{
  "url": "https://www.seriouseats.com/perfect-prime-rib-with-red-wine-jus-recipe",
  "image_url": null,
  "tags": [
    "Roasted Beef",
    "Christmas",
    "Beef Mains",
    "Christmas Dinners",
    "Winter Mains"
  ],
  "title": "Perfect Prime Rib With Red Wine Jus Recipe",
  "full_text": "Perfect Prime Rib With Red Wine Jus Recipe\nJump to recipe\nPrep\n10 mins\nCook\n5 hrs 15 mins\nActive\n90 mins\nResting Time\n20 mins\nTotal\n5 hrs 45 mins\nServes\n3\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n2\npounds\n(\n900\ng\n) beef shins or\noxtail\n1\npound\n(\n450\ng\n)\nbeef\nor veal\nsoup bones\n1\nlarge\ncarrot\n, peeled and roughly chopped (about\n1 1/2\ncups\n)\n2\nribs\ncelery\n, roughly chopped (about\n1 1/2\ncups\n)\n1\nlarge\nonion\n, peeled and roughly chopped (about\n1 1/2\ncups\n)\n1\n(\n750\nml\n) bottle\ndry red wine\n2\nbay leaves\n4\nsprigs\nfresh thyme\n4\nparsley\nstems\n1\nquart\n(\n1\nL\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n1\nstanding\nrib roast\n(\nprime rib\n),\n3 to 12\npounds\n(\n1.3 to 5.4\nkg\n; see notes)\nKosher salt\nand freshly ground black pepper\n4\ntablespoons\n(\n58\ng\n)\nunsalted butter\nDirections\nAdjust oven rack to lower position and preheat oven to 250°F (120°C). Heat oil in a large Dutch oven over high heat until lightly smoking. Add beef shins or oxtail and soup bones. Cook, flipping and stirring pieces occasionally, until well browned on all surfaces, about 15 minutes. Using tongs, transfer beef to a large plate and set aside.\nAdd carrot, celery, and onion to pot and cook, stirring occasionally, until starting to lightly brown, about 8 minutes. Add wine, bay leaves, thyme, and parsley and cook, scraping up browned bits from bottom of pot. Bring to a boil and cook until reduced by half, about 10 minutes. Add chicken stock, bring to a boil, and cook until reduced by half, another 10 minutes.\nArrange beef shins/oxtail and bones in the bottom of a large roasting pan. Pour entire contents of Dutch oven on top of bones and spread vegetables around into an even layer. Place a V-rack on top, arranging meat and vegetables so that rack rests on bottom of pan.\nSeason rib roast generously with salt and pepper on all sides and place on rack with fat cap facing up. Place in oven and cook until center of roast registers 125°F (52°C) on an instant-read thermometer for medium-rare or 135°F (57°C) for medium, 4 to 5 hours.\nRemove roast from oven, transfer to a large plate, and tent loosely with aluminum foil. Place in a warm spot in the kitchen and allow to rest while you finish the jus. Meanwhile, increase oven temperature to highest possible setting, 500 to 550°F (260 to 290°C).\nUsing tongs, remove shins/oxtail from roasting pan and transfer to a medium saucepan. Pour remaining contents of pan through a fine-mesh strainer into saucepan. Discard strained vegetables and bones. (Reserve marrow, if you like, for spreading on bread or mixing back into jus.)\nUsing a ladle, skim excess fat off top of liquid and discard. Bring liquid to a boil, reduce to a simmer, and cook until shins/oxtail are completely tender, about 20 minutes. Transfer shins/oxtail to a serving plate and tent with foil to keep warm. Season jus to taste with salt and pepper (you may not need any salt). Stir in butter off heat. Keep warm.\nWipe out roasting pan and replace V-rack. Remove foil from prime rib and place on top of rack with fat cap facing up. Ten minutes before guests are ready to be served, place roast back in hot oven and cook until well browned and crisp on the exterior, 6 to 10 minutes. Remove from oven, carve, and serve immediately, serving shin/oxtail meat on the side and passing hot jus around the table.\nSpecial Equipment\nRoasting pan\nwith V-rack,\nDutch oven\n,\ninstant-read thermometer\n,\nfine-mesh strainers\nNotes\nThis recipe works for prime rib roasts of any size from two to six ribs. Plan on one pound of bone-in roast per guest. (Each rib adds one and a half to two pounds to the roast.) For best results, use a dry-aged prime-grade or grass-fed roast. Cooking time is identical regardless of the size of the roast.\nTo improve the crust, allow it to air-dry, uncovered, on a rack in the refrigerator overnight before roasting. Seasoning with salt up to a day in advance will help the seasoning penetrate the meat more deeply.\nRead More\nRoasted and Reverse Seared Prime Rib Recipe\nThe Food Lab: 13 Rules For Perfect Prime Rib\nThe Food Lab: How to Carve Prime Rib Like a Pro\nAsk The Food Lab: Do Bones Add Flavor to Meat?\nHow to Dry Age Beef\nThe Food Lab: How to Buy and Cook Prime Rib\nRoasted Beef\nChristmas\nBeef Mains\nChristmas Dinners\nWinter Mains"
}