{
  "url": "https://www.seriouseats.com/perfect-michelada-mexican-beer-cocktail-recipe",
  "image_url": null,
  "tags": [
    "Beer",
    "Mexican",
    "Cocktails",
    "Cinco de Mayo",
    "Memorial Day"
  ],
  "title": "The Best Michelada",
  "full_text": "The Best Michelada\nJump to recipe\nPrep\n5 mins\nActive\n5 mins\nTotal\n5 mins\nServes\n1 drink\nCook Mode\n(Keep screen awake)\nIngredients\nTajín or other\nchile-salt\nblend (optional; see note)\nKosher or\nsea salt\n2\nfluid\nounces\n(\n60\nml\n)\nfresh juice\nfrom\n2\nlimes\n(see note), half a juiced lime reserved for the rim\n2\nteaspoons\n(\n10\nml\n)\nhot sauce\n, preferably a\nMexican-style\nbrand like Tapatío (our favorite); see note\n1\nteaspoon\n(\n5\nml\n)\nWorcestershire sauce\n1\n(\n12-ounce; 355 ml) can\nor bottle light Mexican beer, such as Modelo, Pacífico, Tecate, Victoria, or\nCorona\n, well chilled\nDirections\nPour Tajín (or other chile-salt mixture) or salt into a small, shallow dish in an even layer. Rub a pint or pilsner glass's rim with the cut side of the reserved juiced lime half, then dip glass into the dish to create a salt rim.\nSerious Eats / Two Bites\nSet glass right side up and fill with lime juice, hot sauce, and Worcestershire sauce. Add a pinch or two of salt, fill glass with ice, and top with beer. Stir gently if you want to mix it up a bit. Serve with remaining beer, topping up as you drink.\nSerious Eats / Two Bites\nSpecial Equipment\nPint or pilsner glass\nNotes\nYou can either do a classic salt rim for this drink or rim the drink with a chile-salt mix, using a brand like Tajín.\nIf you want a less tart version of the drink, experiment with using less lime juice—1 or 1 1/2 ounces can work, too. You can also make a less spicy version by reducing the hot sauce from two teaspoons to one.\nRead More\nOur Favorite Beer Cocktails for Easy Warm-Weather Drinking\nThe Best Bloody Mary\nCocktail 101: Savory Cocktails in Theory and Practice\nBeer\nMexican\nCocktails\nCinco de Mayo\nMemorial Day"
}