{
  "url": "https://www.seriouseats.com/perfect-roast-chicken-recipe-8384377",
  "image_url": "https://www.seriouseats.com/thmb/hrxUSBC1qRhd-C_BinFGocL5tFM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230905SEA-HowtoCarveaRoastChicken-AmandaSuarez-00-1-92850971ebe64be19959251553d91679.jpg",
  "tags": [
    "Chicken Mains",
    "The Latest",
    "Chicken",
    "Roasted Chicken"
  ],
  "title": "How to Roast a Perfect Chicken",
  "full_text": "How to Roast a Perfect Chicken\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nBrining and Resting Time\n80 mins\nTotal\n2 hrs 35 mins\nServes\n4 servings\nMakes\n1 chicken\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n1/2\nteaspoon\nfreshly ground\nblack pepper\n(optional)\n1\nteaspoon\n(\n5\ng\n)\nbaking powder\n(optional; see note)\n1\nlarge\nchicken\n, about\n4 to 5 pounds (1.8 to 2.3 kg\n), giblets removed and wing tips trimmed and reserved for stock\n1\ntablespoon\n(\n15\nml\n) neutral-flavored\noil\n, such as canola or vegetable, plus more for rubbing\nDirections\nIn a small bowl, thoroughly mix the salt with black pepper and baking powder (if using). Season chicken all over, inside and out, with salt mixture (or just plain salt if not using pepper and baking powder).\nSerious Eats / Amanda Suarez\nSet chicken, breast side up, on work surface and tuck wings behind back. Using butcher's twine, run the center of the twine under the tip of the tail end and truss chicken by tying drumsticks together at their bony ends, securing the legs and the tip of the tail together in a bundle. Criss-cross the twine and pass along the crevasse where the legs meet the breast; pass twine over wings to hold them into place, then tie securely around the stump of the neck. Place chicken, back side down, on a wire rack set in a rimmed baking sheet and refrigerate, uncovered, at least 1 hour and up to 2 days.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and preheat oven to 425°F (220°C). In a 10- or 12-inch stainless steel skillet, heat oil over medium-high heat until shimmering. Rub chicken lightly with oil, set set it on its side in the skillet so that the full thigh and drumstick are in contact with the pan; the wing will also be touching, but the breast should have little to no contact with the skillet. Cook until leg is well browned, 8 to 10 minutes, then flip bird so other leg is touching pan and repeat; lower heat at any point if chicken skin begins to burn.\nSerious Eats / Amanda Suarez\nUsing hands and spatula if needed, rotate chicken so it is breast side up in the skillet and transfer to oven. Roast until breast registers 150°F (65°C) in the center of its thickest part and thighs register 165°F (75°C) near (but not touching) the bone, about 40 minutes. Remove from oven and transfer chicken to a carving board. Let rest 10 to 20 minutes, then carve and serve.\nSerious Eats / Amanda Suarez\nNotes\nBaking powder (note: not baking soda!) can\nhelp make even crispier skin\nby producing tiny air bubbles in the skin; it is optional, however, and not required.\nChicken Mains\nThe Latest\nChicken\nRoasted Chicken",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-roast-a-perfect-chicken.webp?"
}