{
  "url": "https://www.seriouseats.com/perfect-grilled-t-bone-steak-recipe",
  "image_url": null,
  "tags": [
    "Grilled Steaks",
    "Beef Mains",
    "Memorial Day",
    "4th of July",
    "Labor Day"
  ],
  "title": "Perfectly Grilled T-Bone Steak",
  "full_text": "Perfectly Grilled T-Bone Steak\nJump to recipe\nPrep\n50 mins\nCook\n30 mins\nActive\n60 mins\nResting Time\n10 mins\nTotal\n90 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole T-bone steaks\n, at least 1 1/2 inches thick (about\n30 ounces\neach; see notes)\nKosher salt\nand freshly ground black pepper\nDirections\nAt least 45 minutes before cooking, season steaks generously with salt and pepper on all sides, including edges. Set steaks on a wire rack set over a rimmed baking sheet and refrigerate, uncovered, until ready to cook. Alternatively, season steaks immediately before placing on hot grill.\nSerious Eats / Eric Kleinberg\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate.\nSerious Eats / Eric Kleinberg\nArrange steaks on cooler side of grill with tenderloins (the smaller medallions of meat) positioned farthest from the coals. Cover and set top and bottom vents to half-closed position. Cook steaks, turning once (but always keeping tenderloin farthest from the coals), until an instant-read thermometer inserted into the coolest part of the strip (the larger section of meat) registers 115°F (46°C) and the tenderloin registers 110°F (43°C) for medium-rare, about 15 minutes. Cooking times can vary drastically depending on the heat of the grill, so begin checking after 10 minutes.\nSerious Eats / Eric Kleinberg\nIf coals are not blazing-hot at this point, add more to the fire and allow fire to become hot again. Transfer steaks directly over coals and cook, turning, until very well seared on both sides. Using tongs, hold steaks on their edges to sear the sides as well. Transfer to cutting board and let rest 10 minutes, then serve.\nSerious Eats / Eric Kleinberg\nSpecial Equipment\nGrill\n,\nchimney starter\n,\ninstant-read thermometer\n,\nwire cooling rack\n,\nrimmed baking sheet\nNotes\nThis method works just as well with porterhouse steaks, which are simply T-bones with larger portions of tenderloin attached.\nRead More\nHow to Get Started Grilling\nThe Four High-End Steaks You Should Know\nSlow-Smoked Porterhouse Steaks Recipe\nPan-Seared, Butter-Basted Thick-Cut Steak Recipe\nGrilled Steaks\nBeef Mains\nMemorial Day\n4th of July\nLabor Day"
}