{
  "url": "https://www.seriouseats.com/perfect-refried-beans",
  "image_url": "https://www.seriouseats.com/thmb/OUO7GgPeeh2PxonlEC1ofqNovpE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/perfect-refried-beans-hero-01-9cdd0476ee0b40b7acc7ac63b73e21fd.jpg",
  "tags": [
    "Mexican",
    "Southwestern & Tex Mex",
    "Dairy-free Sides",
    "Gluten-free Sides",
    "Stovetop Beans"
  ],
  "title": "Perfect Frijoles Refritos (Mexican Refried Beans) Recipe",
  "full_text": "Perfect Frijoles Refritos (Mexican Refried Beans) Recipe\nClose\nJump to recipe\nCook\n2 hrs 20 mins\nActive\n20 mins\nTotal\n2 hrs 20 mins\nMakes\n4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\n(\n227\ng\n)\ndried\npinto or\nblack beans\nWater\n2\nsprigs\nfresh epazote\nor oregano (see notes)\n1\nmedium\nwhite onion\n, 1/2 minced (about\n1/2\ncup\n;\n26\ng\n), 1/2 left whole\n2\nmedium\ncloves garlic\nKosher salt\n6\ntablespoons\n(\n77\ng\n)\nlard\n, bacon drippings, vegetable oil, or butter (see notes)\nDirections\nIn a large pot, cover the beans with cold water by at least 2 inches. Add herb sprigs, the whole onion half, and garlic cloves and bring to a boil over high heat. Reduce heat to simmer and cook until beans are very tender, about 1 to 2 hours. Season with salt. Drain beans, reserving bean-cooking liquid. You should have about 3 cups of cooked beans; if you have more, measure out 3 cups of beans and reserve the rest for another use. Discard herb sprigs, onion, and garlic.\nSerious Eats / Eric Kleinberg\nIn a large skillet, heat lard, bacon drippings, or oil until shimmering, or butter until foaming, over medium-high heat. Add minced onion and cook, stirring occasionally, until translucent and lightly golden, about 7 minutes. Stir in beans and cook for 2 minutes. Add 1/4 cup of reserved bean-cooking liquid. Using bean masher, potato masher, or back of a wooden spoon, smash the beans to form a chunky purée; alternatively, use a stick blender to make a smoother purée. Thin with more bean cooking water until desired consistency is reached. If refried beans become too wet, simmer, stirring, until thickened; if they become too dry, add more bean-cooking liquid, 1 tablespoon at a time, as needed. Season with salt and serve.\nSerious Eats / Eric Kleinberg\nSpecial Equipment\nBean masher, potato masher, or\nstick blender\nNotes\nEpazote, a Mexican herb, can be found at Mexican grocers. To add other flavors to the refried beans, try sautéing a pinch of ground cumin or fresh chiles with the minced onion, or puréeing toasted dried chiles into the mixture. Different cooking fats give different flavors to the beans: lard is one of the most traditional, and it adds a porky, funky depth to the beans that's hard to beat; bacon ups the ante even more by layering in a smoky flavor; vegetable oil keeps things neutral so you can really enjoy the flavor of the beans and the aromatics; and butter is decadent and rich without being overpowering.\nMexican\nSouthwestern & Tex Mex\nDairy-free Sides\nGluten-free Sides\nStovetop Beans",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/perfect-frijoles-refritos-mexican-refried-beans-recipe.webp?"
}