{
  "url": "https://www.seriouseats.com/perfect-quick-easy-french-toast",
  "image_url": null,
  "tags": [
    "French Toast",
    "Quick Breakfast",
    "Easter",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Perfect Quick-and-Easy French Toast",
  "full_text": "Perfect Quick-and-Easy French Toast\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n25 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\n(1/2-inch thick)\nslices\nwhite bread\n6\nlarge\neggs\n4\ntablespoons\nsugar\n, plus more for sprinkling\nPinch\nkosher salt\nPinch\nground cinnamon\nPinch\nfreshly\ngrated nutmeg\n1/4\nteaspoon\nvanilla extract\n2\ncups\nwhole milk\n4\ntablespoons\nunsalted butter\nfor the pan, plus more for serving\nMaple syrup\n, for serving\nDirections\nSet a wire rack on a rimmed baking sheet in the oven and preheat to 200°F (93°C). If using very fresh, moist bread, arrange slices in a single layer on the rack and cook in oven, turning once, until lightly toasted, about 10 minutes.\nSerious Eats / Eric Kleinberg\nMeanwhile, in a large mixing bowl, whisk together eggs, sugar, salt, cinnamon, nutmeg, and vanilla until thoroughly combined. Add milk and whisk to blend.\nSerious Eats / Eric Kleinberg\nHeat 1 tablespoon butter in a large non-stick or cast iron skillet over medium heat, swirling skillet, until foaming subsides, about 5 minutes. Soak 2 slices of bread in egg bath, turning, until saturated. Add soaked bread to skillet and cook, swirling occasionally, until browned on bottom side, about 3 minutes. Sprinkle top side of bread with sugar, flip, and continue to cook, swirling occasionally, until browned on second side, about 3 minutes longer. Transfer French toast to the rack in the oven in a single layer to keep warm and repeat with remaining slices of bread and egg bath.\nSerious Eats / Eric Kleinberg\nServe French toast with pats of butter and maple syrup.\nSerious Eats / Eric Kleinberg\nRead More\nThick and Fluffy Pancakes\nButtermilk Vanilla Waffles\nHong Kong-Style French Toast\nFrench Toast\nQuick Breakfast\nEaster\nMother's Day\nFather's Day"
}