{
  "url": "https://www.seriouseats.com/perfect-pot-roast-recipe-pioneer-woman",
  "image_url": "https://www.seriouseats.com/thmb/riqrQ6M-KvqA2z1rTNWSivOANbw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20091030-potroast-f1d62f053ff74e6ca6258d3cf20b349f.jpg",
  "tags": [
    "Braised & Stewed Beef",
    "Roasted Beef",
    "Beef Chuck",
    "Comfort Food",
    "Winter Mains"
  ],
  "title": "Perfect Pot Roast",
  "full_text": "Perfect Pot Roast\nClose\nJump to recipe\nPrep\n5 mins\nCook\n4 hrs 10 mins\nTotal\n4 hrs 15 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 or 3\ntablespoons\nolive oil\nKosher salt\n1\n(\n3- to 5-pound)\nchuck roast\n2\nonions\n6 to 8\ncarrots\nPepper\n2 to 2 1/2\ncups\nbeef stock\n3 or 4\nfresh rosemary\nsprigs\n2 or 3\nfresh thyme\nsprigs\nDirections\nPreheat the oven to 275ºF.\nHeat a large pot or Dutch oven over medium-high heat. Add the olive oil and let it get really hot. While it heats, prepare the other ingredients.\nGenerously salt the chuck roast on both sides. I like kosher salt because it adheres more readily to the meat.\nCut a couple of onions in half from root to tip...\nThen cut off the tops and bottoms and peel off the papery skin.\nWhen the pot is very hot, place the onions in the oil and brown on both sides, about a minute per side. Remove the onions to a plate.\nNext, thoroughly wash-but don't peel-the carrots. Cut them roughly into 2-inch slices..\nThrow the carrots into the same (very hot) pot. Toss them around until slightly brown, about a minute or so. The point here is to get a nice color started on the outside of the vegetables, not to cook them.\nRemove the carrots from the pot and allow the pot to get really hot again. Add another tablespoon of oil to the pan.\nPlace the meat in the pot and sear it, about a minute per side. Remove to a plate.\nNow, with the burner on high, deglaze the pot by adding 1 cup of the beef stock, whisking constantly. The point of deglazing is to loosen all of the burned flavorful bits from the bottom of the pot.\nWhen most of the bits are loosened, place the meat back in the pot...\nFollowed by the carrots and onions. Pour enough beef stock into the pot to cover the meat halfway.\nNext, put in the fresh rosemary and thyme sprigs. The fresh herbs absolutely make this dish. Tuck them into the juice to ensure that the flavors are distributed throughout the pot.\nNow, just cover the pot and roast for 3 to 5 hours, depending on the size of your roast.\nFor a 3-pound roast,\nallow 3 to 3 1/2 hours.\nFor a 5-pound roast,\nallow for a 4- to 5-hour cooking time. Don't disrupt the roast during the cooking process.\nWhen the cooking time is over, check the roast for doneness; a fork should go in easily and the meat should be very tender. Remove the meat to a cutting board and slice against the grain.\nBraised & Stewed Beef\nRoasted Beef\nBeef Chuck\nComfort Food\nWinter Mains"
}