{
  "url": "https://www.seriouseats.com/persian-baklava-cake-recipe-11711973",
  "image_url": "https://www.seriouseats.com/thmb/SBdZoyvhc0MkbwUQAo3XJAM0zYI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250319-SEA-BaklavaCake-NaderMehravari-Beauty3-25-6b4d80eb0def46209eeb31319e726717.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Recipes",
    "Middle Eastern",
    "Sheet Cake"
  ],
  "title": "Persian Baklava Cake",
  "full_text": "Persian Baklava Cake\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nCooling Time:\n4 hrs 15 mins\nTotal\n5 hrs 20 mins\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n1\ncup\n(\n240\nml\n) plain whole milk\nyogurt\n(not strained Greek-style yogurt)\n1/4\ncup\n(\n60\nml\n)\nrose water\n1\ngenerous\npinch\n(\n1\ng\n) of\nsaffron\nthreads, ground and steeped in\n2\ntablespoons\nhot\nwater\n(see notes)\n220\ng\nall-purpose flour\n(\n7.8\nounces\n;\n1 3/4\ncup\n)\n75\ng\nblanched\nalmond flour\nor ground almond meal (\n2.6\nounces\n;\n3/4\ncup\n; see notes)\n75\ng\nground shelled raw or toasted\npistachios\nor pistachio flour (\n2.6\nounces\n;\n3/4\ncup\n; see notes)\n2\nteaspoons\nbaking powder\n1\nteaspoon\nfinely ground\ncardamom\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n175\ng\ngranulated\nsugar\n(\n6.2\nounces\n;\n7/8\ncup\n)\nOrange\nzest\nfrom\n1\norange\n226\ng\nunsalted butter\nat room temperature (\n16\ntablespoons\n) plus more for greasing baking pan\n4\nlarge\neggs\n2\ntablespoons\ncoarsely ground or slivered\npistachios\n, and/or whole dried rose petals, crushed dried rose petals, or ground coconut flakes for garnish\nFor the Syrup:\n1/2\ncup\n(\n100\ng\n)\ngranulated sugar\n1\ncup\n(\n240\nml\n)\nwater\n1/2\ncup\n(\n120\nml\n)\nrose water\n1\ngenerous\npinch\n(\n1\ng\n) of\nsaffron threads\n, ground and steeped in\n2\ntablespoons\nhot water\n(see notes)\n2\nteaspoons\n(\n10\nml\n)\nfresh lemon juice\n, from\n1\nlemon\n6\nwhole\ncardamom\npods\n(or\n1/4\nteaspoon\nwhole cardamom seeds\n)\nDirections\nAdjust oven rack to middle position and preheat the oven to 325°F (160°C). Lightly grease bottom and sides of a 9 x 13-inch baking pan and line bottom of pan with parchment paper; set aside.\nIn a small mixing bowl, stir together yogurt, rose water, and steeped liquid saffron.\nSerious Eats / Nader Mehravari\nIn a medium mixing bowl, whisk together all-purpose flour, almond flour, pistachio flour, baking powder, finely ground cardamom, and salt until thoroughly combined and lump-free.\nSerious Eats / Nader Mehravari\nIn the bowl of stand mixer fitted with the whisk attachment, whisk sugar and orange zest on low speed until zest is evenly distributed and sugar appears moistened and clumped, about 1 minute.\nSerious Eats / Nader Mehravari\nAdd butter to sugar and orange zest mixture and mix on medium-low speed for until blended 1 minute. Increase speed to medium-high and whisk until pale and fluffy, about another 3 minutes, scraping down sides of bowl as needed.\nSerious Eats / Nader Mehravari\nReduce mixer speed to low and add eggs, one at a time, scraping down bowl after each addition.\nSerious Eats / Nader Mehravari\nAdd prepared yogurt mixture and mix at low speed until combined, about 1 minute.\nSerious Eats / Nader Mehravari\nMove mixing bowl from stand mixer to kitchen counter. With a silicone spatula, fold in one third of prepared flour mixture until partially mixed. Repeat with another third of flour mixture, then with remaining flour mixture; continue mixing with spatula until no streaks of dry ingredients remain. Batter will be very thick.\nSerious Eats / Nader Mehravari\nScrape batter into prepared baking pan. Using an offset or silicone spatula, spread batter into a smooth even layer. Bake cake, rotating pan once halfway through baking, until golden brown, center feels firm when gently pressed, and a cake tester or toothpick inserted into the center of the cake comes out clean, about 45 minutes.\nSerious Eats / Nader Mehravari\nFor the Syrup:\nWhile cake is baking, prepare syrup. In a 2-quart saucepan, combine all syrup ingredients and heat over medium-high stir until sugar is dissolved. Once mixture starts to boil, reduce heat to rapid simmer with soft bubbles, and simmer until mixture is reduced by half and its temperature has reached about 118-120°F (47-48°C), 10 to 15 minutes. Remove from heat and let cool to room temperature. Remove and discard cardamom seeds or pods.\nSerious Eats / Nader Mehravari\nOnce cake is baked, let it cool in the pan for about 15 minutes, then run a knife around edges of pan to loosen it. Invert a large cooling rack on the cake pan, then flip over the cooling rack and cake pan together. Using oven mitts or kitchen towels, gently lift and remove pan and parchment paper.\nCover a large cutting board with a sheet of fresh parchment paper. Re-invert cake onto parchment-covered cutting board. Use a toothpick or cake tester to poke holes all over cake’s surface. Using a pastry brush, liberally brush half of the syrup onto the cake while still warm. Let the cake cool completely, 3 to 4 hours.\nSerious Eats / Nader Mehravari\nWith cake on parchment-covered cutting board, use a sharp knife to cut cake into bite-size diamonds or squares (about 1 1/2 inches x 1 1/2 inches). Leave cut cake on board. Brush remaining syrup onto cake. Be more liberal with syrup when brushing over the grooves made by the knife. At this stage, the cake can be garnished and served immediately. Or, for a fuller flavor, let cake sit for up to 24 hours before garnishing and serving. (I believe the cake is best when left to soak up the syrup for a longer period of time—as the syrup penetrates the cake, it enhances its flavor.)\nSerious Eats / Nader Mehravari\nFor serving, garnish each bite-size piece with coarsely ground or slivered pistachios. Alternatively, garnish with any desired combination of pistachios and whole dried rose petals, crushed dried rose petals, or ground coconut flakes.\nSerious Eats / Nader Mehravari\nVariations\nIn addition to using pistachios and almonds, some Persian home cooks incorporate finely ground walnuts into the cake. As long as you have a total of 150 grams of ground nuts, any combination of pistachios, almonds, and walnuts will work.\nIf you desire a thicker cake, replace the suggested 9 x 13–inch baking pan with a 9 x 9–inch square or a 10-inch round baking pan. The baking time should not be much different but always make sure the cake has developed a uniform golden-brown top before taking it out of the oven.\nIf you want to deviate a bit from the traditional bite-size square or diamond-shaped pieces, an attractive option is to bake the batter as if you were baking cupcakes. Using small fluted/flared cupcake liners (often used to make small brioche) makes it easier to take the baked mini cakes out of the liner, which in turn allows you to garnish the flat end of the mini cakes for a charming platter arrangement.\nSpecial Equipment\n9 x 13–inch baking pan, stand mixer with whisk attachment, toothpick or cake tester, 2-quart saucepan, wire cooling rack, cutting board slightly larger than 9x13 (alternatively use the back of a baker’s half sheet), parchment paper, pastry brush.\nNotes\nIt is best to grind saffron from threads as needed, which is most easily done with a stone mortar and pestle. Like many spices, saffron retains its flavor better in its whole (thread) form. Store-bought ground or powdered saffron if often dull and stale, or, worse, mixed with other ingredients as filler. While you likely don't have a kitchen scale that can reliably weigh a single gram of saffron, it is often sold by the gram in small containers. If, for example, you had a 2 g box of saffron, you would use half of those threads for the cake and half for the syrup.\nFor both the almonds and pistachios, you can grind your own nuts by starting with whole (or slivered) blanched almonds and whole shelled raw or toasted pistachios. Using a large food processor, pulse the nuts until finely ground, stirring a couple of times to prevent them from turning into a paste—it is OK if a few larger pieces remain.\nAlternatively, you can purchase already finely ground almonds and pistachios. For almonds, you can purchase almond meal or almond flour—now readily available in most well stocked grocery stores. For finely ground pistachios, your best bet is to order from online sources unless you live near a Persian market.\nMake-Ahead and Storage\nThe syrup for this cake can be made up to 2 weeks ahead and refrigerated in an airtight container. It is a lovely and versatile aromatic syrup with a beautiful golden color. I often make a large batch—the recipe for the syrup is very scalable—and keep it in a clear glass bottle in the door of my refrigerator. You can drizzle it on pancakes, put it on peanut butter sandwiches instead of jam, substitute it for honey, drip a bit on dark chocolate ice cream, use it to make\nlemonade\n, or replace simple syrup with it to jazz up your favorite\ncocktail\n.\nLeftovers, if there is such a thing with this cake, stored in an airtight container in the refrigerator will stay fresh for at least a week. Let them warm up to room temperature before serving.\nIf you let the cake pieces sit on the kitchen counter uncovered, they will eventually dry out. Pulse the completely dried pieces in your food processor into a coarse breadcrumb-like mass. Sprinkle this on top of cakes, open-face peanut butter sandwiches, open-face bagel and cream cheese sandwiches, or a bowl of fruit cocktail to add a magical crunchy layer.\nCakes\nThe Latest\nRecipes\nMiddle Eastern\nSheet Cake"
}