{
  "url": "https://www.seriouseats.com/persian-saffron-rice-pudding-recipe-8422153",
  "image_url": "https://www.seriouseats.com/thmb/2nS8v3aluH0pj3fl77VpwqI_lxQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-Sholeh-Zard-NaderMehravari-10-abd9d78371a8455ca38e841a7195240b.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "The Latest",
    "Middle Eastern",
    "Rice & Grains"
  ],
  "title": "Sholeh-Zard (Persian Saffron Rice Pudding)",
  "full_text": "Sholeh-Zard (Persian Saffron Rice Pudding)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nSoaking and Resting Time\n45 mins\nTotal\n110 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n1/3\ncup\nslivered blanched\nalmonds\n(\n1.4\nounces\n;\n40\ng\n); see notes\n1/2\ncup\n(\n118\nml\n)\nrosewater\n1/2\nteaspoon\n(\n1\ng\n)\nsaffron\n(see notes)\n3\ntablespoons\n(\n45\nml\n) hot\nwater\n2\ncups\nshort-grain or medium-grain\nrice\n(\n13.5\nounces\n;\n380\ng)\n3\ncups\ngranulated sugar\n(\n21\nounces\n;\n600\ng\n) (see notes)\n3 1/2\ntablespoons\nunsalted butter\n(\n50\ng\n)\nFor Garnishing (any one or a combination):\nGround cinnamon\nPistachio\nslivers\nAlmond\nslivers\nCrushed dried\nrose\npetals\nDirections\nIn a small bowl, soak the slivered almonds in the rosewater; set aside.\nSerious Eats / Nader Mehravari\nIn a separate small bowl, steep the ground saffron in the 3 tablespoons hot water; set aside.\nSerious Eats / Nader Mehravari\nIn a large bowl, combine rice with enough cold water to cover. Using your hand, swirl the rice until the water turns cloudy. Pour off the cloudy water through a fine-mesh strainer, then return the drained rice to the bowl and refill with fresh cold water. Repeat 5 to 6 times until the water runs clear, then drain rice.\nSerious Eats / Nader Mehravari\nIn a 5- or 6-quart heavy-bottom pot or Dutch oven, combine the washed rice with 1 tablespoon of the steeped saffron mixture and 7 cups (1.7L) water. Bring to a boil over high heat, then lower heat to maintain a gentle simmer and cook, stirring and scraping the bottom of the pot occasionally, until the rice grains are plump and suspended in a thickened slurry roughly the consistency of regular yogurt (not Greek) yogurt, 20 to 25 minutes. (To check for proper consistency, carefully press a couple grains of rice between your fingers: The grains should show no resistance and turn into a sticky paste.) If the mixture is too thick or the grains of rice are not fully cooked, add boiling water in 1/2 cup increments and cook as needed until desired consistency is reached and/or rice is done.\nSerious Eats / Nader Mehravari\nAdd sugar and continue to cook over low heat until the sugar is fully dissolved and pudding is glossy, about 10 minutes.\nSerious Eats /  Nader Mehravari\nStir in the remaining 2 tablespoons of steeped saffron, the soaked almonds with the rosewater, and the 3 1/2 tablespoons butter until the butter is melted and the saffron has fully integrated into the pudding while stirring occasionally, about 10 minutes. Remove the pot from heat, cover, and let rest for 15 minutes.\nSerious Eats /  Nader Mehravari\nLadle pudding into individual serving bowls or into one large shallow and wide serving bowl and let cool to room temperature, 20 to 30 minutes. Decorate the top with ground cinnamon, pistachios, almonds, and/or rose petals into your preferred decorative pattern only once the pudding has cooled and a thin skin has formed on the surface. Serve.\nSerious Eats /  Nader Mehravari\nNotes\nThis recipe can easily be halved to serve 4 to 6. Reduce each ingredient by half and reduce cooking time in step 4 by 5 to 10 minutes and the cooking time in step 5 by about 5 minutes.\nIt is best to grind saffron from threads as needed. Like many spices, saffron retains its flavor better in its whole (thread) form. Store-bought ground or powdered saffron if often dull and stale, or, worse, not a pure product. While you likely don't have a kitchen scale that can reliably weigh a single gram of saffron, it is often sold by the gram in small containers. If, for example, you had a 2g box of saffron, you would grind half of those threads for this recipe, which is most easily done in a small marble or stone mortar and pestle.\nFeel free to omit the slivered almonds from this recipe for personal preference.\nPersians refer to the resting of the cooked pudding in step 8 as “dam-keshidan.” There is no good English translation for this term. Culinarily speaking, it is something between integrating, steeping, steaming, and resting—all at the same time. It is an ancient technique that is used in the preparation of many Persian rice-centric dishes as well as when making Persian-style tea. For sholeh-zard, its purpose is to allow all the flavors to fully blend together.\nPersians like their sholeh-zard to be very sweet. The amount of sugar specified in the recipe results in a minimum acceptable sweetness level. After you have made it for the first time, taste and adjust the amount of sugar to your preferred level of sweetness.\nThe final color of sholeh-zard should be deep bright yellow as illustrated in the pictures in this article. If the color appears too pale, add more steeped saffron, one teaspoon at a time, until desired color is reached.\nMake-Ahead and Storage\nSholeh-zard can be covered and refrigerated  for up to 1 week.\nCustards, Mousses & Puddings\nThe Latest\nMiddle Eastern\nRice & Grains"
}