{
  "url": "https://www.seriouseats.com/persian-makaroni-recipe-11740864",
  "image_url": "https://www.seriouseats.com/thmb/KEtaZ6pr4dZ_nmTUuJdqtMo5U-E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250523-SEA-Makaroni-NaderMehravari-hero-653251f6b6964525aa0622d6d0b14279.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Pasta Mains",
    "Mains",
    "Pastas"
  ],
  "title": "Move Over Lasagna and Bolognese—This Persian Baked Pasta Is Crispy, Meaty, and Totally Weeknight-Friendly",
  "full_text": "Move Over Lasagna and Bolognese—This Persian Baked Pasta Is Crispy, Meaty, and Totally Weeknight-Friendly\nClose\nJump to recipe\nCook\n110 mins\nTotal\n110 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n8\ntablespoons\n(\n120\nml\n)\nolive oil\n, neutral oil, or ghee, divided\n1\npound\n(\n450\ng\n)\nground lamb\n, ground beef (any fat percent is fine for both), or a combination\n3\ntablespoons\nDiamond Crystal Kosher salt\n, divided; for table salt use half as much by volume\n1/2\nteaspoon\ncrushed red pepper\n1/2\nteaspoon\ncumin seeds\n1\nmedium\nwhite or yellow\nonion\n(about\n8\nounces\n;\n226\ng\n), peeled and cut into 1/4-inch dice\n4\ncloves\nof\ngarlic\n(\n20\ng\n), minced\n1/2\nteaspoon\nground turmeric\n6\nounces\n(\n170\ng\n)\ntomato paste\n1\npound\n(\n450\ng\n)\nbucatini pasta\n, each strand broken into four pieces\nDirections\nIn a large Dutch oven or pot, heat 2 tablespoons (30 ml) oil or ghee over medium-high heat until shimmering. Add ground meat with 1 tablespoon salt and cook, stirring and breaking up with a wooden spoon into small pieces, until meat is browned, about 10 minutes. With a slotted spoon, transfer meat to a plate and set aside.\nSerious Eats / Nader Mehravari\nHeat remaining rendered fat and 2 tablespoons oil in pot over medium heat until shimmering. Add red pepper flakes and cumin seeds, and cook, stirring constantly until fragrant, for 30 seconds.\nSerious Eats / Nader Mehravari\nAdd onion and cook, stirring occasionally, until onions soften and just begin to turn golden brown, 7 to 10 minutes.\nSerious Eats / Nader Mehravari\nAdd garlic and turmeric, and cook until fragrant, stirring constantly, for 30 seconds.\nSerious Eats / Nader Mehravari\nAdd tomato paste and cook, stirring to combine until tomato paste has darkened to a deeper red about 2 minutes.\nSerious Eats / Nader Mehravari\nReturn browned ground meat to pot and add 2 cups (480 ml) water. Stir to combine and bring to boil. Reduce heat to medium-low, cover and simmer, stirring every 10 minutes, until mixture is thickened and flavors well developed, about 45 minutes.\nSerious Eats / Nader Mehravari\nIn a separate large pot or Dutch oven, bring 4 quarts water and remaining 2 tablespoons of salt to a boil over high heat.\nCook broken bucatini pasta in the boiling water until fully tender and slightly past the al dente stage, about 10 minutes.\nSerious Eats / Nader Mehravari\nDrain the pasta well. Transfer drained pasta to a large bowl. Add prepared tomato sauce and toss to combine thoroughly.\nSerious Eats / Nader Mehravari\nReturn pot to the stovetop. (See note) Add remaining 4 tablespoons oil to Dutch oven. Pour sauced pasta into pot. Wrap the lid of pot in a clean, thick kitchen towel. Cover pot tightly with the towel-wrapped lid. This helps prevent steam from escaping and keeps condensation from dripping onto pasta. Set Dutch oven over medium-low heat and cook, rotating pot for even heating every 5 to 10 minutes, until pasta develops a dark golden crust on the bottom, for 45 minutes (or longer if you prefer your pasta tahdig darker with a higher degree of singeing.\nSerious Eats / Nader Mehravari\nFill your sink with 1-inch cold water. Without taking the lid off the pot, set the pot immediately in the water-filled sink (alternatively, set the pot on top of a thoroughly wet kitchen towel); this will help in getting the tahdig out. Let sit 4 minutes. Move pot to your kitchen counter and carefully remove the lid (avoid any hot steam that might come out and also make sure not to let any condensed water drip down onto the pasta).\nIf using a nonstick pot, invert a round serving platter (slightly wider than the diameter of the pot) over the pot. Firmly grasp both the platter and the pot and carefully but quickly flip them over together. Lift off the pot. The tahdig should be beautifully displayed atop a cake-like mound of pasta. If using a standard pot, the tahdig may not release easily. Run a thin, flexible silicone spatula around the edges of the tahdig to loosen it from the bottom and sides of the pot. Repeat this a few times, gently working the spatula a bit further underneath each time. If the tahdig releases completely, use the same flipping technique as with a nonstick pot. If not, gently spoon the pasta onto a serving platter. Then, using a spoon or flat spatula, carefully scrape the tahdig up, trying to keep it in as large pieces as possible, and arrange them around the pasta.\nSerious Eats / Nader Mehravari\nVariations For the Tomato Sauce\nMushrooms are a popular addition to the meat-based tomato sauce. For best results,\nsauté\n8 ounces of your preferred mushrooms until deeply brown before adding them to the sauce. This prevents the sauce from becoming watery and enhances the flavor.\nWhile ground lamb or beef are traditional, crumbled sausage, ground pork, or ground poultry also work well in the sauce.\nFor a vegetarian version, use your favorite meatless tomato sauce. Enhance the flavor with\nother add-ins\nas desired.\nVariations For the Tahdig\nPersian home cooks often use the bottom of the pot as a canvas for innovative tahdig creations. The possibilities are endless! Popular options include lining the pot with potato slices or a layer of flatbread, such as\nlavash\nor\npita\n.\nMore elaborate tahdig variations include creating a lattice with tortillas, arranging edible leaves, or forming circular patterns with long strands of boiled pasta.\nSpecial Equipment\nLarge Dutch oven or nonstick pot with lid for cooking the sauce and assembled dish, large slotted spoon, a separate large pot or Dutch oven for boiling the pasta, stainer, large round serving plate, thin metal spatula\nNotes\nConsider using a heat diffuser, a.k.a. A flamer tamer. Alternative means of ensuring even heating include heavy-bottomed pot, rotating the pot every five minutes, or placing a parchment paper circle in the bottom before adding the sauced pasta.\nMake-Ahead and Storage\nThe tomato sauce can be refrigerated for up to 7 days in advance or frozen for up to 3 months. Thaw frozen sauce in the refrigerator for at least 12 hours before reheating. Reheat refrigerated sauce on the stovetop or in the microwave.\nLeftover mākāroni is excellent. Refrigerate it in an airtight container for up to 7 days or freeze it for up to 3 months. Thaw frozen mākāroni before reheating. Reheat leftovers in the microwave, adding a few tablespoons of water as needed.\nThe Latest\nRecipes\nPasta Mains\nMains\nPastas"
}