{
  "url": "https://www.seriouseats.com/peruvian-style-grilled-chicken-with-green-sauce-recipe",
  "image_url": null,
  "tags": [
    "Grilled Chicken",
    "Peruvian",
    "Whole Chicken",
    "Memorial Day",
    "Summer Mains"
  ],
  "title": "Peruvian-Style Grilled Chicken With Green Sauce Recipe",
  "full_text": "Peruvian-Style Grilled Chicken With Green Sauce Recipe\nJump to recipe\nPrep\n30 mins\nCook\n45 mins\nActive\n30 mins\nResting Time\n5 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n3\nwhole\njalapeño chiles\n, roughly chopped (see notes)\n1\ntablespoon\n(\n15\nml\n)\nají amarillo pepper paste\n(see notes)\n1\ncup\nfresh\ncilantro leaves\n(\n1\nounce\n;\n28\ng\n)\n2\nmedium cloves\ngarlic\n1/2\ncup\n(\n120\nml\n)\nmayonnaise\n1/4\ncup\n(\n60\nml\n)\nsour cream\n2\nteaspoons\n(\n10\nml\n) fresh\njuice\nfrom\n1\nlime\n1\nteaspoon\n(\n5\nml\n) distilled\nwhite vinegar\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nKosher salt and freshly ground black pepper\nFor the Chicken:\n1\nwhole chicken\n,\n3 1/2 to 4\npounds\n(\n1.6 to 1.8\nkg\n)\n4\nteaspoons\n(\n12\ng\n)\nkosher salt\n2\ntablespoons\n(\n18\ng\n)\nground cumin\n2\ntablespoons\n(\n18\ng\n)\npaprika\n1\nteaspoon\n(\n3\ng\n) freshly\nground black pepper\n3\nmedium cloves\ngarlic\n, minced (about\n1\ntablespoon\n)\n2\ntablespoons\n(\n30\nml\n)\nwhite vinegar\n2\ntablespoons\n(\n30\nml\n) vegetable or\ncanola oil\nDirections\nFor the Sauce:\nCombine jalapeños, ají amarillo (if using), cilantro, garlic, mayonnaise, sour cream, lime juice, and vinegar in the jar of a blender. Blend on high speed, scraping down sides as necessary, until smooth. With blender running, slowly drizzle in olive oil. Season to taste with salt and pepper. Sauce will be quite loose at this point, but will thicken as it sits. Transfer to a sealed container and refrigerate until ready to use.\nMelissa Hom\nFor the Chicken:\nPat chicken dry with paper towels and place on a large cutting board, breast side down. Using sharp kitchen shears, remove backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten chicken. For added stability, run a metal or wooden skewer horizontally through chicken, entering through one thigh, going through both breast halves, and exiting through other thigh. Tuck wing tips behind back.\nMelissa Hom\nCombine salt, cumin, paprika, pepper, garlic, vinegar, and oil in a small bowl and massage with fingertips until homogeneous. Spread mixture evenly over all surfaces of chicken.\nMelissa Hom\nLight a chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean and oil\ngrilling grate.\nMelissa Hom\nPlace chicken, skin side up, on cooler side of grill, with legs facing toward hotter side. Cover grill, with vents on lid open and aligned over chicken. Open bottom vents of grill. Cook until an instant-read thermometer inserted into thickest part of breast registers 110°F (43°C). Carefully flip chicken and place, skin side down, on hotter side of grill, with breasts pointed toward cooler side. Press down firmly with a wide, stiff spatula to ensure good contact between bird and grill grates. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of breast registers 145 to 150°F (63 to 66°C), about 10 minutes longer. If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature, or chicken will burn.\nMelissa Hom\nTransfer chicken to a cutting board and allow to rest for 5 to 10 minutes. Carve and serve with sauce.\nMelissa Hom\nSpecial Equipment\nGrill\n,\nblender\n,\ninstant-read thermometer\n,\nmetal or wooden skewer\nNotes\nFor a less spicy sauce, remove the ribs and seeds of the jalapeños before puréeing. Ají amarillo is a Peruvian yellow pepper paste that can be found in most Latin markets. It can be omitted.\nRead More\nSerious Entertaining: A Spring Grilling Menu\nThe Food Lab's Grilled Chicken World Tour: 5 Recipes to Rock Your Backyard Bird\nGrilled Chicken\nPeruvian\nWhole Chicken\nMemorial Day\nSummer Mains"
}