{
  "url": "https://www.seriouseats.com/peruvian-style-grilled-chicken-sandwiches-recipe",
  "image_url": null,
  "tags": [
    "Sandwiches",
    "Peruvian",
    "Grilled Chicken",
    "Summer Mains"
  ],
  "title": "Peruvian-Style Grilled-Chicken Sandwiches With Spicy Green Sauce Recipe",
  "full_text": "Peruvian-Style Grilled-Chicken Sandwiches With Spicy Green Sauce Recipe\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n60 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n3\nmedium cloves\ngarlic\n, roughly chopped\n4\nteaspoons\n(\n15\ng\n)\nkosher salt\n2\ntablespoons\nground cumin\n2\ntablespoons\npaprika\n1\nteaspoon\nfreshly\nground black pepper\n2\ntablespoons\n(\n30\nml\n)\nwhite vinegar\n2\ntablespoons\n(\n30\nml\n) vegetable or\ncanola oil\n4\nboneless, skinless chicken\nbreasts\n(\n5 to 7 ounces\n/\n140 to 200 g\neach),\ncut into 8 cutlets\nFor the Sauce:\n3\nwhole\njalapeño chiles\n, roughly chopped (see notes)\n1\ntablespoon\n(\n15\nml\n)\nají amarillo pepper paste\n(optional; see notes)\n1\ncup\n(\n1\nounce\n)\nfresh cilantro leaves\n2\nmedium\ncloves\ngarlic\n1/2\ncup\n(\n120\nml\n)\nmayonnaise\n1/4\ncup\n(\n60\nml\n)\nsour cream\n2\nteaspoons\n(\n10\nml\n)\nfresh juice\nfrom\n1\nlime\n1\nteaspoon\n(\n5\nml\n)\ndistilled white vinegar\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\nTo Serve:\n4\nsturdy\nbuns\n, such as telera or\nciabatta\n2\nripe avocados\n, halved, pitted, and flesh scooped\nThinly sliced red onion\nCrisp\nlettuce leaves\n, such as\nromaine\nDirections\nFor the Chicken:\nIn a large mortar and pestle, pound garlic and salt until a smooth, sticky paste forms. Add cumin, paprika, black pepper, and vinegar and grind them together to form a paste. Drizzle in vegetable oil while grinding (see notes). Transfer chicken and marinade to a large bowl and massage with your hands until all the chicken is coated in the marinade. Set aside at room temperature while you make the sauce, or cover and place in the fridge up to overnight.\nFor the Sauce:\nCombine jalapeños, ají amarillo (if using), cilantro, garlic, mayonnaise, sour cream, lime juice, and vinegar in the jar of a blender. Blend on high speed, scraping down as necessary, until smooth. With blender running, slowly drizzle in olive oil. Season to taste with salt and pepper. Sauce will be quite loose at this point, but will thicken as it sits. Transfer to a sealed container and refrigerate until ready to use.\nTo Cook:\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate.\nPlace chicken directly over the hot side of the grill, cover, and cook, rotating the pieces occasionally (but not flipping them), until the chicken is almost completely cooked through and only a few pink spots remain on the top side, about 4 minutes. Flip chicken and cook on second side until just done, about 30 seconds. Transfer to a large plate.\nTo Assemble:\nPlace buns cut side down over the hot side of the grill and cook, moving and rotating them occasionally, until well toasted and starting to char, about 1 minute. Transfer to a large cutting board. Use a fork to mash half an avocado on each bottom bun. Sprinkle with a little salt. Top with red onions, lettuce, and 2 pieces of chicken each. Spread top buns with sauce and close sandwiches. Serve immediately, with any extra green sauce on the side.\nSpecial Equipment\nBlender\n,\nmortar and pestle\n,\ngrill\nNotes\nThe marinade can also be made by combining all ingredients in a\nblender\n, mini chopper, or\nfood processor\nand blending until smooth, though the flavor won't be as good as the one made with the mortar and pestle.\nFor a less spicy sauce, remove the ribs and seeds of the jalapeños before puréeing.\nAjí amarillo is a Peruvian yellow pepper paste that can be found in most Latin markets. It can be omitted.\nRead More\nPeruvian-Style Grilled Chicken With Green Sauce Recipe\nHow to Cut Chicken Breasts Into Cutlets\nHow to Get Started Grilling\nSandwiches\nPeruvian\nGrilled Chicken\nSummer Mains"
}