{
  "url": "https://www.seriouseats.com/philly-cheesesteak-recipe-7546830",
  "image_url": null,
  "tags": [
    "Beef",
    "The Latest",
    "Cheese",
    "North American"
  ],
  "title": "Philly Cheesesteaks",
  "full_text": "Philly Cheesesteaks\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nFreezing\n60 mins\nTotal\n100 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\nboneless rib eye steak\nor\nskirt steak\nor store-bought pre-sliced rib eye (see notes)\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\nor other neutral oil\n1/2\nmedium\nyellow onion\n(\n4\nounces\n;\n114\ng\n), cut into 1/4-inch dice\n8\nthin\nslices\nprovolone cheese\n(about\n6\nounces\n;\n160\ng\n), 4 slices torn into 1-inch pieces and 4 slices left whole\n2\ntablespoons\ngrated\nParmigiano-Reggiano cheese\n(optional)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1/8\nteaspoon\nfreshly\nground black pepper\nTwo\n7- to 8-inch-long\nItalian hoagie/sub rolls\n, split lengthwise, but left attached on 1 side to create a hinge\nDirections\nIf using a whole steak, trim and cut steak crosswise with grain into roughly 3-inch wide sections, then set on large plate and freeze until firm but not frozen solid, about 1 hour. If using pre-sliced steak, skip to chopping instructions in Step 2.\nSerious Eats / Amanda Suarez\nUsing a sharp knife, shave steak as thin as possible on a biased angle against the grain. Mound shaved meat on cutting board and chop coarse with knife, about 5 times for store-bought sliced meat or 10 times for hand-sliced.\nSerious Eats / Amanda Suarez\nHeat an empty 12-inch cast-iron skillet over medium-high heat for 5 minutes. Add oil to skillet and heat until just smoking. Add meat and onion in an even layer and cook, without stirring, until well browned on one side, 4 to 6 minutes. Continue to cook, stirring frequently to move and pull apart the meat slices until meat and onions are browned and meat is no longer pink, 2 to 4 minutes.\nSerious Eats / Amanda Suarez\nStir in torn provolone cheese, Parmesan cheese (if using), salt, and pepper. Cook, stirring constantly, until cheese is melted and well combined, 1 to 2 minutes. Turn off heat.  Divide mixture into 2 individual portions the length of the rolls. Shingle 2 slices of Provolone cheese over each portion. Cover and let cheese melt, about 1 minute.\nSerious Eats / Amanda Suarez\nCenter rolls, cut sides down, over each portion of meat. Working with one at a time, use a large spatula to scoop under each portion of meat and flip meat into roll to create a filled sandwich. Serve immediately.\nSerious Eats / Amanda Suarez\nMake-Ahead and Storage\nAbsolutely not.\nSpecial Equipment\n12-inch cast-iron skillet with lid or large cast-iron flat griddle pan or plancha\nSerious Eats / Amanda Suarez\nNotes\nWhile I prefer rib eye steak in this recipe, skirt steak will work just as well. You may also use store-bought pre-sliced well marbled steak found at some supermarkets like Wegmans and many Asian market chains like H-Mart. If using pre-sliced steak, still run a knife through mound of meat about 5 times at the end of Step 2.\nIf you have a cast-iron flat griddle pan or plancha, this is the time to use it. Position and center (over two burners if needed) for even heating of the pan.\nWhile written for an indoor stovetop, this recipe works great in a cast-iron skillet cooked outside on a grill, which is a great way to avoid grease splatter in your kitchen. Preheat the grill as usual, then preheat the empty cast-iron skillet on a preheated grill on high heat, with lid closed, for 5 minutes. Proceed with the recipe.\nProvolone cheese can range from mild to very sharp. Go with your personal preference, but the cheese should be sliced thin and melt easily. You may also substitute with equal weight Cheese Whiz or American cheese in this recipe.\nThis recipe can easily be cut in half to make 1 serving. Alternatively, it may also be doubled and cooked through in 2 separate batches to serve 4.\nBeef\nThe Latest\nCheese\nNorth American"
}