{
  "url": "https://www.seriouseats.com/philly-cheesesteak-pierogi-dumpling-recipe",
  "image_url": "https://www.seriouseats.com/thmb/daeYYGBErOHs5mOgHa7aXGleb-U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__03__20150306-cheesesteak-pierogi-plated-morgan-eisenberg-6802e6afdc524a4980adfe19ecdc86af.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Steaks",
    "Mozzarella",
    "Sour Cream"
  ],
  "title": "Philly Cheesesteak Pierogi Recipe",
  "full_text": "Philly Cheesesteak Pierogi Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n65 mins\nActive\n90 mins\nChilling and Resting Time\n35 mins\nTotal\n2 hrs\nServes\n30 pierogi\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/4\ncups\nall-purpose flour\n, plus extra for dusting\n1\nteaspoon\nkosher salt\n, plus more as needed\n1\nlarge\negg\n, beaten\n1\ncup\nsour cream\n, plus more for serving\n6\ntablespoons\nunsalted butter\n, softened, divided\n1\nlarge\nyellow onion\n, thinly sliced\n3\ntablespoons\ncanola or\nvegetable oil\n, divided, plus more as needed\n10\nounces\nthinly sliced\nsteak, such as\nribeye\nor top round (see notes)\nFreshly ground black pepper\n1 1/2\ncups\nshredded provolone cheese\n1\ncup\nshredded low-moisture mozzarella cheese\nChopped flat-leaf parsley\n, to garnish\nDirections\nIn a large bowl, whisk together flour and 1 teaspoon salt. Add egg, 1 cup sour cream, and 4 tablespoons softened butter. Stir until well combined and the dough pulls away from the bowl. If dough is too dry, add one tablespoon of water at a time until it comes together. Cover and refrigerate for at least 30 minutes or up to 48 hours.\nMeanwhile, heat 1 tablespoon oil in a medium skillet over medium heat until shimmering. Add sliced onion and season with salt and pepper. Cook, stirring frequently, until golden, about 30 minutes. Roughly chop half the onion and transfer to a large bowl; set the other half of onions aside.\nAdd 1 tablespoon oil to the skillet and increase heat to high. Season steak with salt and pepper and, working in batches, sauté, stirring, until just cooked though, about 1 minute per batch; add more oil to pan if needed. Remove from heat and roughly chop. Add chopped steak to the chopped onions and toss in both shredded cheeses. Mix to evenly distribute and set aside to cool.\nRemove the dough from the refrigerator and turn out onto a lightly floured work surface. Roll the dough out to a sheet about 1/16 inch thick. Using a 3-inch circular cookie cutter or the top of a glass, cut the dough into circles. Roll the excess dough into a new dough ball and wrap with plastic wrap; let rest for 5 minutes, then roll out and repeat. Discard any remaining dough scraps.\nSerious Eats / Morgen Eisenberg\nPlace 2 teaspoons of filling in the center of each dough round. Working one at a time, use a wet finger to moisten the edge of each round with water, then fold into a semi-circle around the filling. Gently pinch edge together to seal, then press with tines of fork to make pleated edge. At this point, the pierogi can be frozen and saved for later use, if desired (to freeze, arrange pierogi on parchment-lined baking sheets and freeze, then transfer to zipper-lock bags and return to freezer until ready to use).\nSerious Eats / Morgan Eisenberg\nBring a large pot of salted water to a gentle boil and add fresh or frozen pierogi in small batches. Boil until they float to the top and are cooked through, about 3 minutes. Remove with a slotted spoon and let drain in a colander. Repeat until all of the pierogi have been boiled.\nHeat the remaining 1 tablespoon oil and 2 tablespoons butter to a nonstick skillet over medium heat until butter is melted. Working in batches, sauté pierogi until crisp and browned on each side, about 6 minutes per batch. In the last few minutes of cooking the last batch, add the reserved onions to the pan to heat through.\nSerious Eats / Morgan Eisenberg\nTransfer pierogi to a plate, top with the warmed onions and garnish with parsley. Serve with sour cream.\nSerious Eats / Morgan Eisenberg\nNotes\nSteak must be sliced very thinly. To do so, it helps to freeze it first, then shave with a sharp knife. Alternatively, ask your butcher to shave the steak for you.\nHors D'Oeuvres\nSteaks\nMozzarella\nSour Cream"
}