{
  "url": "https://www.seriouseats.com/philadelphia-butter-cake-bars-recipe",
  "image_url": "https://www.seriouseats.com/thmb/7yidgJuYR11qstqDVOC8LAXvm-I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120416-201495-buttercake-723dac284029401cac26806461f9f0f7.jpg",
  "tags": [
    "Cakes",
    "Dessert Bars"
  ],
  "title": "Philadelphia Butter Cake Recipe",
  "full_text": "Philadelphia Butter Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nRising and Resting Time\n80 mins\nTotal\n2 hrs 5 mins\nServes\n16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Base:\n1/4\ncup\n(about\n2\nounces\n)\ngranulated sugar\n1/4\ncup\n(\n4\ntablespoons\n)\nsalted butter\n1/4\nteaspoon\nsalt\n1\nlarge\negg\n1\n(\n1/4 ounce) packet\nactive dry yeast\n1/2\ncup\nwarm\nmilk\n(105-115°F)\n2 1/4\ncups\n(about\n12\nounces\n)\nflour\n, sifted\n2\nteaspoons\nvanilla extract\n(clear or regular)\nFor the Topping:\n1\ncup\n(\n16\ntablespoons\n, or\n2\nsticks\n)\nunsalted butter\n2/3\ncup\n(about\n3\nounces\n)\nflour\n2\ncups\n(about\n16\nounces\n)\nsuperfine sugar\n2\nlarge\neggs\n4\ntablespoons\nmilk\n1\nteaspoon\nvanilla extract\n(clear or regular)\nDirections\nIn the bowl of a stand mixer fitted with the paddle attachment, mix sugar, butter, and salt on low speed until combined. Add egg, and beat on medium speed for 1 minute.\nIn a small bowl, dissolve the yeast in warm milk.\nTo egg/sugar mixture, add flour, then yeast mixture and vanilla, beating about 3 minutes (with dough hook or by hand). Turn the dough onto a lightly floured board and knead for 90 seconds. Place in a lightly greased bowl, cover with a towel, and allow the dough to rise until doubled in size, about 1 hour.\nToward the end of the rising period, start preparing the topping. In a stand mixer fitted with the paddle attachment, cream the butter until light and fluffy, about 2 minutes on medium speed. Add the flour and sugar to the mixture, and continue beating on medium speed until fully combined. Add the eggs one at a time, allowing the first to fully incorporate into the batter before adding the second. Add in the vanilla. Add the milk, 1 tablespoon at a time. If the consistency is any thinner than a pancake batter, don't add any more milk.\nGrease or line a 9- by 13-inch aluminum pan with parchment paper.\nOnce the dough has doubled in size, punch it down. Remove it from the bowl, and pat into the bottom of your prepared pan. Crimp the edges of the crust halfway up the sides of the container so that they will hold in the filling.\nSpread the topping evenly over the dough. Let stand for 20 minutes. Meanwhile, preheat the oven to 375°F and position a rack in the middle position.\nBake 30 minutes, or until browned on the edges but still quite gooey in the middle. It will solidify as it cools. Wait until it has cooled completely before serving; store in the refrigerator.\nNote: Salted butter is suggested for the base, but not necessary; if you only stock unsalted butter, feel free to use that with a pinch of salt, or just on its own.\nRegarding the vanilla extract, if you want a pale yellow hue, use clear vanilla extract; if you don't mind about a lemony hue, use regular vanilla extract; it tastes good both ways.\nCakes\nDessert Bars"
}