{
  "url": "https://www.seriouseats.com/piadina-italian-flatbread-sandwich-recipe-8605123",
  "image_url": "https://www.seriouseats.com/thmb/2AvCDCRHp1tTw4pDAy-HqSynTSI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240306-SEA-Piadina-KevinWhite-27-745b5e8cb77746d0ab5af2a64929ade0.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Italian"
  ],
  "title": "Piadina (Italian Flatbread Sandwich)",
  "full_text": "Piadina (Italian Flatbread Sandwich)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nResting Time\n40 mins\nTotal\n75 mins\nServes\n4\nMakes\n4 Sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n1 3/4\ncups\n(\n245\ng\n)\nall-purpose flour\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; if using table salt use half as much by volume\n1/4\nteaspoon\nbaking soda\n3\ntablespoons\n(\n40\ng\n)\nlard\nor shortening\n1/2\ncup\n(\n355\nml\n)\nwhole milk\n, warm\nOlive oil\n, for skillet\nFor the Filling:\n1\ntablespoon\n(\n15\nml\n)\nextra virgin olive oil\n1\ntablespoon\n(\n15\nml\n)\nbalsamic vinegar\nKosher salt\nFreshly\nground black pepper\n1\ncup\nstracchino\nor stracciatella cheese (\n8\nounces\n;\n225\ng\n), or\n2\n(\n4-ounce\n) balls burrata, halved\n4\ncups\narugula\n(\n4\nounces\n;\n115\ng\n)\nDirections\nFor the Dough:\nAdjust oven rack to middle position and preheat oven to 250℉ (120℃). In a medium bowl, thoroughly whisk together flour, salt, and baking soda. Use your finger to pinch the lard into the flour mixture until lard is broken into pea-sized or smaller pieces and coated with flour. Add milk and stir until a shaggy dough forms. Transfer dough to a clean work surface and knead until smooth, 3 to 5 minutes. Shape into a ball, cover dough loosely with plastic wrap and let rest for 20 minutes.\nSerious Eats / Kevin White\nDivide dough into 4 equal pieces and shape each into a ball. Cover dough balls loosely with plastic wrap and let rest for 20 minutes.\nSerious Eats / Kevin White\nOn a lightly floured work surface, pat 1 dough ball into a 5-inch disk (keep remaining dough balls covered). Using a rolling pin, roll disk into a 10-inch circle, flouring counter and rolling pin as needed to prevent sticking (dough rounds should be ¼ inch thick—about the thickness of a piece of cardstock). Use a fork to lightly prick the dough rounds all over on just 1 side, making sure to prick all the way through to the other side (about 8 times); set aside and cover. Repeat with remaining dough balls.\nSerious Eats / Kevin White\nPreheat an empty 12-inch stainless-steel or cast iron skillet over medium-high heat until very hot (a drop of water dripped onto the surface should sizzle immediately), 2 to 4 minutes. Using a pastry brush, coat the hot skillet lightly with oil. Place 1 dough round into skillet and cook until the bottom side is spotty brown and bubbles form across the dough’s top surface, about 30 seconds. Using a spatula, flip dough and continue to cook until dough puffs and the second side is spotty brown, about 30 seconds. Use a spatula to transfer piadina to a rimmed baking sheet and hold warm in the oven while cooking the remaining piadine. Repeat with the remaining 3 dough rounds.\nSerious Eats / Kevin White\nFor the Filling:\nIn a large bowl, toss arugula with olive oil and balsamic vinegar and season with salt and pepper to taste; set aside.\nSerious Eats / Kevin White\nIf using stracchino or stracciatella,\nworking with 1 piadina at a time, spoon tablespoon sized dollops over top of piadina and spread over the surface, leaving a ½-inch border all the way around the perimeter.\nIf using burrata,\nwork over a bowl and use fingers to gently tear cheese into bite size pieces.Working with 1 piadina at a time\nscatter 1/4 of the torn buratta cheese evenly over half of the piadina surface, leaving a 1/2-inch border around perimeter.\nSerious Eats / Kevin White\nScatter 1 cup dressed arugula evenly over the cheese. Fold piadina in half (over the greens) and press gently to secure shut. Repeat steps 6 and 7 with the remaining 3 piadine. Slice in half and serve.\nSerious Eats / Kevin White\nSpecial Equipment\nRolling pin, 12-inch stainless-steel skillet, pastry brush, rimmed baking sheet\nMake-Ahead and Storage\nOnce cooled, the cooked flatbread can be wrapped tightly with plastic wrap and stored at room temperature for up to 1 day. Reheat briefly in a skillet to warm through before building the sandwich.\nSandwiches\nThe Latest\nItalian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/piadina-italian-flatbread-sandwich.webp?"
}