{
  "url": "https://www.seriouseats.com/pickled-watermelon-rind-recipe-7560697",
  "image_url": "https://www.seriouseats.com/thmb/MFu4lT9AUjkHIFigOMcokwRe2pU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230530-SEA-PickledWatermelon-AmandaSuarez-09-8877e759ae674b3db8a85a8c2afdf84a.jpg",
  "tags": [
    "Watermelon",
    "The Latest",
    "Pickling",
    "Summer"
  ],
  "title": "Pickled Watermelon Rind",
  "full_text": "Pickled Watermelon Rind\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nCooling Time\n3 hrs\nTotal\n4 hrs 10 mins\nMakes\n2 pounds\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n947\nml\n)\ncider vinegar\n1 1/2\ncups\nsugar\n(\n10 1/2\nounces\n;\n300\ng\n)\n1\nounce\ncandied ginger\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n5\ncloves\n2\nallspice berries\n1\ncinnamon stick\n1\n(1-inch) strip\nlemon rind\n2\npounds\n(\n907\ng\n)\ntrimmed watermelon rind\n, cut into 1.5-inch (4 cm) chunks (see notes)\nDirections\nIn a 3-quart saucepan, combine cider vinegar, sugar, candied ginger, salt, cloves, allspice berries, cinnamon stick, and lemon rind. Set over medium-high heat, bring to a boil, and cook for 15 minutes.\nSerious Eats / Amanda Suarez\nAdd watermelon rind, return to a boil, and cook until rind looks slightly translucent, about 40 minutes.\nSerious Eats / Amanda Suarez\nTransfer pickled rind and spices to mason jars (of any size you prefer), packing to fill well, then pour brine on top to fully cover rind. Seal jars, let cool to room temperature, then refrigerate. Watermelon rind pickles can be kept refrigerated for up to 1 month.\nSerious Eats / Amanda Suarez\nNotes\nA large 13-pound (6kg) watermelon will yield roughly 4 to 5 pounds (1.8–2.3kg) of fully trimmed rind. Larger or smaller watermelons and watermelon varieties with a thinner or thicker rind will yield less or more. This recipe is scaled to 2 pounds (907g) of fully trimmed rind, but can be halved or doubled as need.\nTo trim watermelon rind, carefully cut off almost all but the faintest traces of the red flesh (it does not maintain a pleasant texture once pickled). Then cut off the dark outer skin. The remaining white rind with a green-to-pinkish tinge in spots is now ready for pickling.\nMake-Ahead and Storage\nThe pickled watermelon rind can be refrigerated in its brine for at least one month; signs it's no longer good include loss in quality of the pickle's texture, evidence of mold, or any cloudiness, discoloration, or off aromas.\nThis recipe is not formulated for food-safe canning.\nWatermelon\nThe Latest\nPickling\nSummer"
}