{
  "url": "https://www.seriouseats.com/pierogi-recipe-5220146",
  "image_url": "https://www.seriouseats.com/thmb/4kbif44kapg0KVb5oXtG2n6zigQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220303-pierogi-vicky-wasik-57-ebc147e5870e4544add8cd880f75125c.jpg",
  "tags": [
    "Potatoes",
    "The Latest"
  ],
  "title": "Potato and Cheese Pierogi",
  "full_text": "Potato and Cheese Pierogi\nClose\nJump to recipe\nPrep\n30 mins\nCook\n60 mins\nCooling and Resting Time\n35 mins\nTotal\n2 hrs 5 mins\nServes\n4\nto 6 servings\nMakes\n24 pierogi\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n5\ntablespoons\n(\n75\ng\n)\nunsalted butter\n, divided\n1\nlarge\nonion\n(\n10\nounces\n;\n285\ng\n), finely chopped\nKosher salt\nand freshly ground back pepper\n1\npound\n(\n455\ng\n)\nrusset potatoes\n, peeled and cut into 1-inch pieces\n6\nounces\n(\n170\ng\n)\nfarmer cheese\nFor the Dough:\n12.5\nounces\n(about\n2 1/2\ncups\n;\n355\ng\n)\nhigh-protein all-purpose flour\n, such as King Arthur (see note)\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or an equal amount by weight\n8\nounces\n(\n1\ncup\n;\n225\ng\n)\nsour cream\n1\nlarge\negg\nTo Assemble and Finish:\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n, divided\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, divided\nSour cream\n, for serving\nSliced chives\n, for serving (optional)\nDirections\nFor the Filling:\nIn a medium skillet, melt 2 tablespoons (30g) butter over medium heat. Add onion, season with salt and pepper, and cook, stirring frequently, until softened, about 5 minutes. Continue to cook, stirring frequently and adding 1 to 2 tablespoons (15 to 30ml) of water at a time when onions begin to stick and threaten to scorch, until light golden-brown, about 15 minutes.\nVicky Wasik\nMeanwhile, in a large saucepan, combine potatoes, 2 quarts (1.9L) water, and 2 teaspoons (6g) salt. Bring to a boil over high heat, then reduce heat to maintain a simmer. Cook until potatoes are tender and offer little resistance when pierced with a paring knife, about 10 minutes. Drain potatoes, and return to now-empty saucepan. Set saucepan over low heat and cook, shaking constantly, until moisture has evaporated from potatoes, about 1 minute. Remove from heat.\nVicky Wasik\nUsing a ricer or food mill, pass potatoes into a medium bowl. Using a flexible spatula, stir in remaining 3 tablespoons (45g) butter, and 1/2 cup (115g) of the reserved onion mixture; transfer remaining onion mixture to a small bowl for garnish. Season with salt and pepper to taste, and allow to cool for 5 minutes. Stir in farmer cheese until thoroughly combined, cover, and set aside if making the pierogi right away, or refrigerate filling for up to 2 days.\nVicky Wasik\nFor the Dough:\nWhisk together flour and salt in the bowl of a stand mixer until thoroughly combined, at least 30 seconds. Add sour cream and egg, fit stand mixer with dough hook, and mix on medium-high speed until a smooth and elastic dough forms that pulls away from the sides of the bowl, 6 to 8 minutes. Cover, and set aside at room temperature for at least 30 minutes or wrap in plastic and refrigerate for up to 24 hours.\nVicky Wasik\nTo Assemble and Finish:\nWhile dough is resting, portion the potato filling. Using a 1-tablespoon measuring spoon, scoop 1 heaping tablespoon (1 ounce; 30g) portions of potato mixture onto a rimmed baking sheet. Roll each portion between your palms to form a ball and set back on baking sheet. Line a second rimmed baking sheet with parchment, and dust lightly with flour; set aside.\nVicky Wasik\nOnce dough is rested, turn out onto a lightly floured surface. Using a rolling pin, roll dough into a roughly 18-inch circle, about 1/8-inch thick. Using a 3-inch cookie cutter, punch out 24 rounds of dough. Place one portion of filling in the center of each round of dough. Working with one portion of dough at a time, fold dough over filling to form a half-moon while distributing filling to fit within it, firmly pinch edges to seal, and transfer to prepared baking sheet. Repeat with remaining portions. Uncooked pierogi can be covered and refrigerated for up to 24 hours.\nVicky Wasik\nIn a pot of boiling salted water, cook half of the pierogi until dough is cooked through and filling is heated through, 3 to 5 minutes. Using a spider skimmer, transfer to a lightly greased baking sheet. Repeat with remaining pierogi. Boiled pierogi can be served as-is with reserved cooked onion and sour cream, or proceed to step 8 for pan-frying instructions.\nVicky Wasik\nIn a large nonstick skillet, heat 1 tablespoon (15ml) vegetable oil and 1 tablespoon (15g) butter over medium-high heat until butter is foaming. Add enough pierogi to cover the bottom of the skillet in a single layer without crowding the pan, and cook, flipping occasionally, until crisp and golden brown on both sides, 3 to 5 minutes. Transfer to serving platter. Repeat with remaining pierogi, adding remaining oil and butter as needed. Serve, passing sour cream, reserved onion, and chives (if using) at the table.\nVicky Wasik\nSpecial Equipment\nRicer or food mill, stand mixer, 3-inch cookie cutter, rimmed baking sheets, large nonstick skillet\nNotes\nWe often avoid King Arthur's all-purpose flour because of its higher-than-standard protein content relative to other brands of all-purpose flour. Here, though, it does its job perfectly. Take note, therefore, that substituting lower-protein all-purpose flour from other brands in this recipe may impact results.\nMake-Ahead and Storage\nThis recipe can easily be broken into parts, with components that can be made in advance if you don't want to tackle the project from start to finish all at once. The filling can be made in advance and refrigerated in an airtight container for up to 2 days. The dough can be made in advance and refrigerated for up to 24 hours. Formed, uncooked pierogi can be made in advance and refrigerated for up to 2 days or frozen for up to 1 month. Boiled pierogi can be refrigerated for up to 3 days.\nPotatoes\nThe Latest"
}