{
  "url": "https://www.seriouseats.com/pig-pickin-mandarin-orange-cake-with-pineapple-whipped-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/jZc1uGKg9BG6DdK0lE7yroLT7aE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120524-207756-pig-pickin-cake-10baae7389cc400fa03787c97956f513.jpg",
  "tags": [
    "Layer Cake",
    "Orange",
    "Pineapple",
    "Cakes"
  ],
  "title": "Pig Pickin' Cake (Mandarin Orange Cake With Pineapple Whipped Cream Frosting) Recipe",
  "full_text": "Pig Pickin' Cake (Mandarin Orange Cake With Pineapple Whipped Cream Frosting) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\n30 mins\nCooling Time\n30 mins\nTotal\n75 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake\n11 1/2\nounces\n(about\n2 1/4\ncups\n)\nall-purpose flour\n, plus more for flouring pans\n1\ntablespoon\nbaking powder\n1/2\ntablespoon\nsalt\n11 1/2\nounces\n(about\n1 2/3\ncups\n)\nsugar\n2\nsticks\n(\n16\ntablespoons\n)\nunsalted butter\n, softened and cut into 1 inch pieces, plus more for greasing pans\n4\neggs\n, room temperature\n2\nyolks\n, room temperature\n1\ntablespoon\nvanilla extract\n1 1/4\ncups\nwhole milk\n, room temperature\n1\n(\n11-ounce) can\nmandarin oranges\n, drained\n2\ntablespoons\nzest\nfrom\n1\norange\nFor the Whipped Cream Frosting\n2\ncups\nheavy cream\n1\ntablespoon\nsugar\n1\n(\n3.4 ounce) box\nof\ninstant vanilla pudding\n2/3\ncup\ncrushed pineapple\n, drained of all its liquid\nDirections\nSet oven rack to middle position and preheat oven to 350°F (175°C). Grease and flour 3 cake pans and set aside. In a medium bowl whisk together flour, baking powder, and salt, and set aside.\nIn bowl of a stand mixer fitted with a paddle attachment, cream butter and sugar together on high speed until light and fluffy (about 5 minutes). Reduce mixer speed to medium and add eggs and yolks, one at a time, mixing well between each addition until incorporated and scraping down sides with a rubber spatula as needed. Once eggs have been added, mix in vanilla. Alternate adding dry ingredients and milk a third at a time on low speed, mixing until just incorporated. Add mandarin oranges and zest. Beat on high speed until oranges are crushed and well incorporated, 1 to 2 minutes.\nDivide batter equally among 3 cake pans and bake until golden brown and springy to the touch and cake tester inserted into center comes out clean, 25-27 minutes, rotating the pans halfway through. Cool cakes in the pan for 15 minutes then carefully release from the pan onto cooling racks to cool completely. Do not assemble cake until it has completely cooled.\nFor the Frosting\n: Pour cream into the bowl of a stand mixer. Turn mixer to high and begin beating. Add sugar while mixer is running. Once soft peaks form, turn mixer to low and add vanilla pudding mix. Mix pudding for 1-2 minutes then stop mixer, scrape down the sides and gently stir to incorporate any remaining pudding powder.\nFold in pineapple and frost cake adding a thin layer of frosting between the layers to leave enough to cover the top and sides of the cake completely. Store covered in the refrigerator.\nSpecial Equipment\nStand mixer\n,\nthree 8-inch cake pans\nMake-Ahead and Storage\nThe cooled cakes can be tightly wrapped in plastic wrap and stored in the freezer for up to 1 week. Thaw at room temperature, still wrapped tightly in plastic wrap.\nUse the frosting the day you make it, or cover and store in the refrigerator for up to 1 day, then bring to room temperature and paddle again for a few minutes until smooth before using.\nThe cake can be stored in an airtight container at room temperature for up to 2 days.\nRead More\nBumpy Cake (Chocolate Cake with Vanilla Buttercream and Chocolate Fudge)\nPhiladelphia Butter Cake\nHoosier Sugar Cream Pie\nClassic Vanilla Butter Cake\nLayer Cake\nOrange\nPineapple\nCakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pig-pickin-cake-mandarin-orange-cake-with-pineapple-whipped-cream-frosting-recipe.webp?"
}