{
  "url": "https://www.seriouseats.com/pineapple-upside-down-cake-recipe-8686941",
  "image_url": "https://www.seriouseats.com/thmb/QbuuXD5ffjqepybVVjvHsMUAXKI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-SEA-PineappleUpsideDownCake-MorganHuntGlaze-beauty-18-bf2eb8dd26714088925e9e2bbcf5920c.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Pineapple"
  ],
  "title": "Classic Pineapple Upside Down Cake",
  "full_text": "Classic Pineapple Upside Down Cake\nClose\nJump to recipe\nCook\n59 mins\nCooling Time\n15 mins\nTotal\n74 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n20\n-ounce (567g) can of\npineapple sliced\nrings packed in 100% pineapple juice, plus 3/4 cup (180ml) juice reserved\n1/4 cup (\n60\nml\n) unrefined virgin\ncoconut oil\n8 tablespoons (\n113\ng)\nunsalted butter,\ndivided\n4 2/3 ounces (133g) granulated\nsugar\n(about\n2/3\ncup)\n2 tablespoons (\n30\nml)\nspiced rum,\nsuch as Captain Morgan brand (optional, see notes)\n1 1/2\nteaspoons\nvanilla bean paste\nor vanilla extract\n2\nlarge eggs\n, at\nroom temperatur\ne\n5 ounces (141g) dark\nbrown sugar\n(about\n2/3\ncup\npacked)\n7\nmaraschino\ncherries\n, stems removed and patted dry\n6 3/4 ounces (191g)\nall-purpose flour\n(about\n1 1/2\ncups)\n2\nteaspoons\nbaking powder\n1/2\nteaspoon\nkosher salt;\nfor table salt use half as much by volume\n1/2 cup (\n12\n0ml)\nbuttermilk\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F(175℃). In a small saucepan, bring 3/4 cup reserved canned pineapple juice to a simmer over medium-high heat. Once simmering, reduce heat to medium, and continue to simmer until reduced to about 1/4 cup, about 10 minutes. Remove from heat, and whisk in coconut oil and 4 tablespoons butter until melted. Transfer to a large heatproof bowl. Whisk in granulated sugar, rum, and vanilla into the melted butter mixture until smooth; whisk in eggs until incorporated. Set aside while preparing the skillet.\nMorgan Hunt Glaze\nIn a 10-inch cast-iron skillet, melt the remaining 4 tablespoons butter over medium heat. Once melted, add brown sugar, and cook, stirring constantly, until sugar is melted and starts to bubble, about 2 minutes. Remove from heat. Arrange 7 of the pineapple rings over the sugar mixture in the skillet. Cut 1 of the remaining pineapple rings into 1-inch pieces; place around the rings to fill in any gaps. (Reserve any remaining pineapple slices for another use.) Place one cherry in the center of each pineapple ring.\nMorgan Hunt Glaze\nIn a medium bowl, whisk flour, baking powder, and salt until combined. Add half of the flour mixture to the egg mixture and use a spatula to fold until combined. Stir in the buttermilk until combined. Add the remaining flour mixture, then fold until the cake batter is combined.\nMorgan Hunt Glaze\nPour the batter over the prepared pineapple rings in the skillet, and spread into a smooth even layer. Bake until the cake is golden brown and a wooden skewer inserted into the center comes out clean, 30 to 40 minutes. (If the top becomes too brown before the cake is baked through, tent with aluminum foil to finish baking.)\nMorgan Hunt Glaze\nTransfer skillet to a wire rack and let cool slightly for 15 minutes. Run a small palette knife around the edges of the skillet to loosen, then place a serving plate over the cake and carefully invert the cake onto the plate. (If any fruit sticks to the skillet, remove and position on top of the cake.) Let the cake cool for at least 30 minutes. Slice and serve warm or at room temperature with whipped cream or vanilla ice cream, if desired.\nMorgan Hunt Glaze\nSpecial Equipment\nSmall saucepan, 10-inch cast iron skillet\nNotes\nThe rum can be replaced with 1 tablespoon water.\nMake-Ahead and Storage\nCover and store at room temperature for up to three days.\nCakes\nThe Latest\nPineapple",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/classic-pineapple-upside-down-cake.webp?"
}