{
  "url": "https://www.seriouseats.com/pistachio-frosting-recipe-8682527",
  "image_url": "https://www.seriouseats.com/thmb/HSFOM6iWDrpqsnjPN4vTiQXKzMw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__11__20191108-pistachio-buttercream-vicky-wasik-1-1c9be763da4a4b378bbfbd9b6adeb495.jpg",
  "tags": [
    "Pistachios",
    "The Latest",
    "Desserts"
  ],
  "title": "This Luxe, Goes-With-Everything Pistachio Frosting Will Forever Change You",
  "full_text": "This Luxe, Goes-With-Everything Pistachio Frosting Will Forever Change You\nClose\nJump to recipe\nTotal\n40 mins\nServes\n48 servings\nMakes\n6 cups\nCook Mode\n(Keep screen awake)\nIngredients\n5 1/2 ounces\negg yolk\n(shy 2/3 cup;\n155\ng\n), from about 10 large eggs\n5 1/4 ounces plain or lightly toasted\nsugar\n(about 3/4 cup;\n145\ng\n); see note\n1\nounce\nliqueur\nor amaro, such as Cardamaro,\nMaraschino\n, and rum, or just water (about 2 tablespoons; 30g)\n1/2 teaspoon (\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight, or more to taste\n16\nounces\nunsalted butter\n(4 sticks;\n455\ng\n), softened to about 65°F (18°C)\nHomemade\npistachio paste\nto taste, up to 14 ounces (\n396\ng\n)\nDirections\nFor a Stand Mixer With a Bowl-Lift Design:\nTear off a long strip of foil and crumple it into a thick ring. Place it in the bottom of a 3-quart saucier or similarly large, wide pot, and fill with roughly 1 1/2 inches water. Place over high heat until bubbling-hot, then adjust the temperature to maintain a gentle simmer. In a stainless steel stand mixer bowl, combine egg yolks, sugar, Cardamaro or other liquid ingredient, and salt. Place bowl over steaming water, stirring and scraping constantly with a flexible spatula, until egg yolk syrup reaches 155°F (68°C). This should take only about 5 minutes; if the process seems to be moving slowly, simply turn up the heat. Transfer bowl to a stand mixer fitted with a whisk attachment.\nFor a Stand Mixer With a Tilt-Head Design:\nFill a large pot with a few inches of water. Place over high heat until bubbling-hot. In a large heatproof glass or ceramic bowl, combine egg yolks, sugar, Cardamaro or other liquid ingredient, and salt. Set bowl over the steaming water, then cook, stirring and scraping constantly with a flexible spatula, until egg yolk syrup register 155°F (68°C); this should take no longer than 8 minutes; if the process seems to be moving slowly, simply turn up the heat. Scrape mixture into stand mixer bowl and fit stand mixer with a whisk attachment.\nWhip the egg yolk mixture at high speed until fluffy, stiff, and beginning to ball up around the whisk, about 8 minutes. With mixer still running, add butter a few tablespoons at a time, waiting only a second or two between additions. In the end, the buttercream should be thick, creamy, and soft but not runny, around 72°F (22°C). When the consistency has been properly adjusted (see troubleshooting guide below), begin whipping in the pistachio paste a few tablespoons at a time, to achieve the desired intensity of flavor. Additionally, the buttercream can be seasoned with additional salt or other extracts to taste.\nUse buttercream right away or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to 72°F and re-whip before using.\nTroubleshooting:\nIf warmer than 74°F (23°C), the buttercream will be soft and loose; pop it in the fridge for 15 minutes and re-whip to help it thicken and cool. If colder than 68°F (20°C), the buttercream will be firm and dense, making it difficult to spread over cakes and slow to melt on the tongue, creating a greasy mouthfeel. To warm, briefly set over a pan of steaming water, just until you see the edges melting slightly, then re-whip to help it soften and warm. French buttercream can be fixed according to the same rules for Swiss buttercream. For more information, see the troubleshooting guide and video\nhere\n.\nSpecial Equipment\nLarge pot, flexible spatula,\ndigital thermometer\n, stand mixer\nNotes\nThough technically optional, using\nquick-toasted sugar\nwill dramatically tame the sweetness of this buttercream, while also adding subtle depth of flavor. It's a lovely touch for basic vanilla, but not nearly as vital when stronger flavors, like chocolate or spices, come into play.\nMake-Ahead and Storage\nButtercream can be refrigerated for up to 2 weeks and frozen for up to several months. Rewarm to 72°F and re-whip before using.\nThis Recipe Appears In\nSilky French Buttercream Without All the Fuss\nA No-Fuss Chocolate Yule Log That’s Easy to Roll\nPistachios\nThe Latest\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/this-luxe-goes-with-everything-pistachio-frosting-will-forever-change-you.webp?"
}