{
  "url": "https://www.seriouseats.com/pistachio-ice-cream",
  "image_url": "https://www.seriouseats.com/thmb/NqkuX75Ro6ZOE4MGBqQ1G77G_sQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190522-pistachio-gelato-vicky-wasik-21-0701b4078f6b41fd94df89d56df9dc01.jpg",
  "tags": [
    "Holidays & Seasons",
    "Pistachios",
    "4th of July",
    "Summer Desserts"
  ],
  "title": "From-Scratch Real Pistachio Ice Cream",
  "full_text": "From-Scratch Real Pistachio Ice Cream\nClose\nJump to recipe\nPrep\n20 mins\nCook\n3 hrs\nActive\nAbout 30 mins\nChilling Time\n8 hrs\nTotal\n11 hrs 20 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n9\nounces\nbest-quality\nwhole, raw pistachios\n(shy\n2\ncups\n;\n255\ng\n) (see notes)\nAbout\n1\nteaspoon\nroasted pistachio oil\n, or a neutral oil like vegetable or grapeseed\n16\nounces\nwhole milk\n(about\n2\ncups\n;\n455\ng\n)\n10\nounces\nheavy cream\n(about\n1 1/4\ncups\n;\n285\ng\n)\n6\nounces\nplain or\ntoasted\nsugar\n(preferred) (about\n3/4\ncup\nplus\n2\ntablespoons\n;\n170\ng\n)\n4\nounces\negg yolk\n(about\n1/2\ncup\n;\n115\ng\n)\nHeaping\n1/4\nteaspoon\n(\n1.5\ng\n) Diamond Crystal\nkosher salt\n, or more to taste; for table salt, use about half as much by volume or the same weight\n1/2\nounce\nCynar, Cardamaro, or a similar amaro, or Serravinci's Pistacchino, maraschino, or\nalmond liqueur\n(about\n1\ntablespoon\n;\n15\ng\n)\nBlue gel paste\n, such as Americolor, optional\nDirections\nPreparing the Pistachios:\nBlanch and peel the pistachios\n, then drizzle lightly with pistachio oil. Toss to evenly coat with oil, spread over a parchment-lined half sheet pan, and place in a cold oven. Preheat to 200°F (90°C), and dry the pistachios until they feel firm to the touch and rather hard, with a golden hue just beginning to develop here and there, about 3 hours. The timing of this process can vary dramatically depending on the accuracy of a given oven, and how much water the pistachios were able to absorb during the blanching phase, among other factors, such as freshness. The idea is to slowly and gently drive off their moisture and develop a delicately toasted flavor, rather than one that is dark or robust. Everything about the flavor of the ice cream hinges on this step, so keep a close eye on them.\nSerious Eats / Vicky Wasik\nAfter toasting, cool the pistachios and then roughly chop. Combine with the milk and cream in a 3-quart saucier, and bring to a simmer over medium heat, stirring from time to time, then cover and cool to room temperature off heat. Once cool, refrigerate overnight, or up to 36 hours.\nSerious Eats / Vicky Wasik\nReturn the chilled pistachio-infused dairy to a simmer, then strain through a mesh sieve into a large bowl. The pistachios can be used as a 1:1 substitution for the pistachios called for in our\npistachio paste\n, but they will not be used further in this recipe.\nSerious Eats / Vicky Wasik\nLet the 3-quart saucier cool until safe to touch (no need to wash), then add the toasted sugar, egg yolks, and salt, and whisk to combine. When smooth, add the warm pistachio-infused dairy and whisk gently to combine.\nSerious Eats / Vicky Wasik\nCook over medium-low heat, stirring and scraping constantly with a flexible, heat-resistant spatula until warm to the touch, then increase heat to medium. Continue stirring and scraping until thickened and steaming hot, or around 165°F (74°C), although precision is not required in a recipe like this. Strain the ice cream base into a non-reactive container, then whisk in the Cynar, or other liqueur.\nSerious Eats / Vicky Wasik\nColor Correction, optional:\nDepending on the natural color of the pistachios, as well as the degree of browning developed in the toasting phase, and the intensity of the color of the yolks, the color of the ice cream base can range from army green to khaki, or outright yellow. This is perfectly normal, if not what's traditionally expected. If desired, the warm tone imparted by the toasted pistachios and egg yolks can be neutralized with a minute amount of blue gel paste. Place a single drop onto the edge of a knife, then dip the top of a whisk or spatula into the gel. Whisk or stir the base to disperse the color, and repeat as needed, stirring patiently between each addition to ensure the full color has developed. Use caution, as excess dye will produce a decidedly artificial color.\nSerious Eats / Vicky Wasik\nCover and refrigerate the base until no warmer than 39°F (4°C), or cool to the same temperature in an ice bath; the time required will vary considerably depending on the technique, as well as the container style. Churn in an ice cream maker until thick, with a texture like soft-serve. Meanwhile, place a 1-quart container and flexible spatula in the freezer. When ice cream looks thick and light, shut off the machine and, using the chilled spatula, scrape ice cream into the prepared container. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until firm. In an airtight container, with the surface of the ice cream protected by a sheet of plastic, the ice cream will keep for up to one month in the freezer.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel saucier, non-reactive sieve, stainless steel mixing bowl,\nice cream maker,\nnon-reactive, freezer-safe container\nNotes\nThe exact character of this ice cream will vary depending on both the type and freshness of the pistachios involved. Sicilian pistachios are highly prized by gelato makers and pastry chefs, driving up their price per pound, and they provide the strongest, most iconic pistachio flavor and color. American pistachios are more affordable, with a milder flavor and color that tends toward beige, but these deficiencies can be punched up with a few food-science hacks (see below). In either case, be wary of dusty pistachios that look past their prime or those that feel mealy after blanching, as well as pistachios with a price tag that seems too good to be true.\nIf the pistachios have a weak flavor, or seem less than fresh, as evidenced by a mealy texture in the peeling phase, add a 1 1/4-inch sprig of rosemary (about 0.35g) and a 3/4- by 1/4-inch strip of orange or lime zest (0.15g) in with the dairy to steep. The herb and zest contain essential oils similar in composition to those found naturally in pistachio, and subtle use can help bring out the flavor in lackluster nuts.\nWith or without this addition, the milk-soaked pistachios leftover from the infusion can be refrigerated in an airtight container for up to one week and used as a 1:1 replacement for the fresh pistachios called for in our\npistachio paste.\nThe color of the paste will be quite muted, but the flavor will still be rather toasty and bold.\nMake-Ahead and Storage\nIn an airtight container, with the surface of the ice cream protected by a sheet of plastic, the ice cream will keep for up to one month in the freezer.\nHolidays & Seasons\nPistachios\n4th of July\nSummer Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/from-scratch-real-pistachio-ice-cream.webp?"
}