{
  "url": "https://www.seriouseats.com/pistachio-torrone-candy-how-to-make-recipe",
  "image_url": "https://www.seriouseats.com/thmb/bfIUw99AQc3dvgZjCOkwYUlfLKI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111221-182838-torrone-nougat-candy-610x458-1-c29d27e8410245a7a518d127b40ece7f.jpg",
  "tags": [
    "Candy",
    "Stovetop",
    "Pistachios"
  ],
  "title": "Pistachio Torrone Recipe",
  "full_text": "Pistachio Torrone Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nActive\n45 mins\nCooling Time\n2 hrs\nTotal\n2 hrs 55 mins\nServes\n24 pieces\nCook Mode\n(Keep screen awake)\nIngredients\nEdible wafer paper\ncut into four 8- by 11-inch sheets\n3\nlarge\negg whites\n1/2\ncup\nconfectioners' sugar\n1/2\nteaspoon\nsalt\n3/4\ncup\nhoney\n1/4\ncup\nlight corn syrup\n1/4\ncup\nwater\n3\ncups\ngranulated sugar\n2\ncups\nshelled\nraw pistachios\n(see note)\nOptional: seeds scraped from\n1\nvanilla bean\n, citrus zest, or flavor extracts\n1/3\ncup\ncornstarch\nDirections\nLine a half sheet-sized baking pan with parchment paper, then place two of the 8- by 11-inch pieces of wafer paper on top, without overlapping. Set aside. Pour egg whites into bowl of electric mixer fitted with the paddle attachment; set aside. Measure out confectioners' sugar, salt, and optional flavoring, and set each aside. Preheat oven to 350°F (175°C).\nSerious Eats / Lauren Wiesenthal\nIn a large saucepan (see note), stir to combine honey, corn syrup, water, and granulated sugar. Wash any excess off the sides of the pan using a pastry brush dipped in water. Place over medium heat; cook until mixture just begins to simmer, about 4 minutes. Clip a digital thermometer onto the side of saucepan.\nSerious Eats / Lauren Weisenthal\nContinue to cook the syrup until a thermometer registers 310°F (154°C), about 10 to 20 minutes. Watch the mixture and thermometer carefully; the syrup will bubble and rise up, then settle back down as it cooks. Once the temperature hits 270°F (132°C) it will climb very fast. Remove the honey mixture from heat and stir until temperature drops to 300°F (149°C).\nSerious Eats / Lauren Weisenthal\nMeanwhile, quickly beat the egg whites on medium speed. Once they are frothy, lower the speed, add the salt and confectioner's sugar, then return to medium speed to whisk the egg whites to soft peaks. Then turn the mixer down to its lowest setting, until the syrup has cooled to 300°F.\nSerious Eats / Lauren Weisenthal\nOnce the syrup has cooled to 300°F, turn up the mixer speed to high, and, with mixer running, slowly pour into whipped egg-white mixture (at this point, whites will double in volume; let stand a few seconds; volume will return to normal). Beat until mixture thickens and begins to stick to beaters, approximately 5 minutes. Meanwhile, place the nuts in the preheated oven to warm for a few minutes, then turn off the oven to hold them. Once the nougat has thickened and is getting trapped inside the whisk, remove the bowl from the stand mixer and fold in the nuts with a spatula or big wooden spoon.\nSerious Eats / Lauren Weisenthal\nSerious Eats / Lauren Weisenthal\nSerious Eats / Lauren Weisenthal\nDust a work surface liberally with cornstarch. Pour mixture onto cornstarch-covered surface. Dust the top of the mixture with additional starch. Fold the meringue and stretch it out. Turn the meringue, and fold and stretch it out again. While the motion of kneading nougat is similar to bread, avoid applying the same amount of pressure. The rhythm is fold, stretch, turn. Repeat another 6 times, applying more starch to any sticky areas as needed.\nSerious Eats / Lauren Weisenthal\nSerious Eats / Lauren Weisenthal\nDust off excess starch. Stretch nougat to fit the edible paper and transfer to the pan. Cover with another layer of wafer paper. Let cool on a wire rack for 2 hours. After the first 30 minutes, flip candy over in the pan so the bottom paper ends up on top.\nSerious Eats / Lauren Weisenthal\nSerious Eats / Lauren Weisenthal\nCut into slices with an oiled knife or a pair of kitchen shears. Store in an airtight container between layers of parchment for up to 2 weeks.\nSerious Eats / Lauren Weisenthal\nSpecial Equipment\nRimmed baking sheet\n, large saucepan (see note),\ndigital thermometer\n,\nstand mixer\nwith whisk attachment, edible wafer paper\nNotes\nPistachios should not be toasted, but for other types, you may want to toast the nuts to bring out their oils and flavor. If you are using hazelnuts, toast, then rub off the skins before using.\nIt's important that you use a pot that is large enough to create a large surface area for cooking, and with sides that are tall enough to hold the liquid as it bubbles and grows when cooking (in the photo above, I use a 6-quart pan).\nTo cut the torrone, insert the oiled knife straight down into the candy slab, then use the knife to pull the cut piece away. If the edible paper pulls away in some spots, just place it back over the nougat and continue cutting. You may also consider using kitchen shears to cut the torrone.\nRead More\nTurrón de Alicante (Nougat With Marcona Almonds)\nAlmond Cherry Croquants\nChocolate Chip Meringue Cookies\nBasic Italian Meringue\nCandy\nStovetop\nPistachios"
}