{
  "url": "https://www.seriouseats.com/pistachio-buns",
  "image_url": "https://www.seriouseats.com/thmb/rC8UGRLIst5QcGNqbtxfMj7kgsM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190525-pistachio-buns-vicky-wasik-28-1500x1125-fc4d5c5a1c0d4b8bbaada925c89462ea.jpg",
  "tags": [
    "Rolls & Buns",
    "Pastries",
    "Pistachios",
    "Breakfast & Brunch"
  ],
  "title": "Pistachio Buns Recipe",
  "full_text": "Pistachio Buns Recipe\nClose\nJump to recipe\nPrep\n50 mins\nCook\n50 mins\nActive\n45 mins\nRising and Chilling Time\n10 hrs\nTotal\n11 hrs 40 mins\nServes\n12 buns\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n2\nounces\nunsalted butter\n, brought to about 70°F/21°C (about\n5\ntablespoons\n;\n55\ng\n)\n7 1/2\nounces\nhomemade\npistachio paste\n, made from toasted pistachios (about\n3/4\ncup\n;\n210\ng\n)\nFor the Dough:\n18\nounces\nall-purpose flour\n(about\n4\ncups\n, spooned;\n510\ng\n), plus more for rolling\n2\nteaspoons\ninstant yeast\n, such as SAF (not rapid-rise; see notes)\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n10\nounces\nhomemade\npistachio paste\n(about\n1\ncup\n;\n285\ng\n), made from toasted pistachios, brought to about 70°F/21°C\n8\nounces\nplain, unsweetened Greek yogurt\n(about\n1\ncup\n;\n225\ng\n), any percentage will do, brought to about 70°F/21°C\n4\nounces\nmilk\n(about\n1/2\ncup\n;\n115\ng\n), any percentage will do, brought to about 70°F/21°C\n2\nounces\nroasted pistachio oil\n(about\n5\ntablespoons\n;\n55\ng\n)\n4\nounces\nblanched, peeled, and\nlightly toasted pistachios\n(a shy cup;\n115\ng\n), or more to taste, optional\nFor the Frosting:\n6\nounces\nheavy cream\n(about\n3/4\ncup\n;\n170\ng\n)\n2 1/2\nounces\nchilled\nhomemade\npistachio paste\n, made from toasted pistachios (about\n1/4\ncup\n;\n70\ng\n)\nDirections\nFor the Filling:\nIn the bowl of a stand mixer fitted with a paddle attachment, beat pistachio paste and butter until creamy and smooth. Transfer the pistachio filling to a small zip-top bag or a disposable pastry bag, scraping the bowl as thoroughly as you can with a flexible spatula. Wipe the bowl with a paper towel, and proceed to the next step (no need to wash).\nFor the Dough:\nIn the stand mixer bowl from the last step, whisk flour, yeast, and salt until thoroughly combined. In a quart-sized liquid measuring cup, combine pistachio paste, Greek yogurt, milk, and pistachio oil, mixing by hand or with an immersion blender until homogenous and smooth. Add to flour mixture and stir to form a very dry and shaggy dough. With the hook attachment, knead on low until silky-smooth, elastic, and able to be gently stretched into a thin but rough sheet without tearing, about 25 minutes.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nFirst Rise:\nCover bowl with plastic and set dough to rise until puffy, light, and doubled in bulk, about 2 hours at roughly 70°F (21°C). If the dough feels dense, firm, or overly resilient, rest 30 minutes before testing again. It's normal for the timing of this step to vary, depending on ambient conditions, with doughs moving faster in warmer environments, and slower when things are cool.\nShaping and Second Rise:\nTurn dough onto a lightly floured surface, dust with flour, and roll into a 13-inch square. Snip a corner from the bag of pistachio filling, squeeze over the dough, and spread into an even layer with an offset spatula. Sprinkle additional pistachios on top, if using, and roll into a log, ending seam side down.\nSerious Eats / Vicky Wasik\nSlide an 8-inch strand of thread, unflavored dental floss, or butcher's twine under the dough until you reach the middle. Cross the ends over the top and pull tight to divide the log in two. Cut each half into 6 even portions and arrange in a parchment-lined 9- by 13- by 2-inch aluminum baking pan (or two 8-inch by 3-inch round cake pans). Cover rolls with foil and refrigerate overnight, or up to 48 hours.\nSerious Eats / Vicky Wasik\nFor the Frosting:\nPlace pistachio paste and cream into a measuring cup, blending container, or jar just large enough to accommodate the head of an immersion blender. If the container is too large, the cream layer will not be deep enough for proper blending. If the container is too small, the blades will not reach the paste at the bottom of the jar. Alternatively, the ingredients can be placed in the bowl of a food processor. Process until the mixture is creamy and thick, like a frosting; the time can vary substantially depending on the equipment itself, so closely monitor the texture and body of the cream to find the ideal timing for your equipment. Transfer to an airtight container and refrigerate until needed, up to 48 hours. Alternatively, the frosting can be prepared while the pistachio buns are in the oven.\nSerious Eats / Vicky Wasik\nTo Bake and Serve:\nAdjust oven rack to middle position and preheat to 350°F (180°C); meanwhile, let pistachio buns stand at room temperature until oven is hot. Bake, covered, until pistachio buns are puffed and firm but pale, about 35 minutes. (If using darker pans, check on the buns even sooner.) Remove the foil and continue baking until lightly browned, about 15 minutes more.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nLet buns cool about 15 minutes to help set the crumb, then serve with a generous dollop of frosting over each bun. Serve immediately, and leave no survivors, the buns do not hold up well with time.\nNotes\nInstant yeast doesn't require hydration prior to use and is suitable for cold fermentation, making it distinct from both active dry and rapid-rise yeast. My favorite brand is SAF, which is higher-quality than anything found in supermarkets, and dramatically cheaper, too.\nSpecial Equipment\nStand mixer\n, 2-quart saucier, flexible spatula,\ndigital thermometer\n,\noffset spatula\n, unflavored dental floss or butcher’s twine, 9- by 13- by 2-inch anodized aluminum baking pan or two 8-inch anodized aluminum cake pans (preferably 3 inches deep)\nMake-Ahead and Storage\nCovered tightly with foil, the portioned pistachio buns can be refrigerated up to 48 hours, then baked as directed. Alternatively, the buns can be frozen for up to six months, then thawed overnight in the fridge before baking as directed.\nRead More\nHomemade Pistachio Paste\nRolls & Buns\nPastries\nPistachios\nBreakfast & Brunch"
}