{
  "url": "https://www.seriouseats.com/ployes-buckwheat-pancakes-recipe-11704538",
  "image_url": "https://www.seriouseats.com/thmb/ynFGdTQ3o74aEIy-uXBEAH-9JI8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250227-SEA-Ployes-MelatiCitrawireja-Beauty1-17-34c452e07f0640c09a895a34703c6129.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Bread",
    "Pancakes"
  ],
  "title": "Ployes (Acadian Flatbreads)",
  "full_text": "Ployes (Acadian Flatbreads)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nTotal\n25 mins\nServes\n12\nMakes\n12 ployes\nCook Mode\n(Keep screen awake)\nIngredients\n160\ng\nlight buckwheat flour\n(\n5.6\nounces\n;\n1\ncup\n) (see note)\n64\ng\nall-purpose flour\n(\n2.25\nounces\n;\n1/2\ncup\n)\n12\ng\n(\n1\ntablespoon\n)\nbaking powder\n3\ng\n(\n1\nteaspoon\n)\nDiamond crystal kosher salt\n; for table salt, use half as much by volume\n480\nml\n(\n2\ncups\n)\nroom temperature water\nDirections\nIn a large bowl, whisk together buckwheat flour, all-purpose flour, baking powder, and salt to combine. Add water and whisk until a smooth batter with the consistency of half-and-half forms. Let sit until slightly thickened and bubbly, about 10 minutes.\nSerious Eats / Melati Citrawireja\nMeanwhile, adjust oven rack to middle position and preheat oven to 200°F (90°C). Set a wire rack in a rimmed baking sheet and transfer to oven.\nSerious Eats / Melati Citrawireja\nPreheat a 10-inch cast iron skillet or griddle over medium heat until hot, 3 to 4 minutes. (If your pan is well-seasoned, then no cooking oil will be necessary; if it's not, add 1/2 teaspoon neutral oil to the pan as it heats and use a wadded up paper towel to spread it into a then layer before proceeding with the recipe.)\nWhisk batter to recombine. Using a 1/4-cup dry measuring cup\n,\npour one 1/4 cup portion of batter into center of skillet. Using the bottom of measuring cup or back of a metal ladle, spread batter into a very thin circle, about 7 inches in diameter.\nSerious Eats / Melati Citrawireja\nCook until holes form and batter sets, top is dry with edges beginning to curl, and bottom is golden brown and crisp, 1 to 2 minutes. Use a spatula to transfer to wire rack in oven to keep warm or serving plate to serve immediately. Repeat cooking with remaining batter. You should have 12 ployes. Serve with your preferred sweet or savory accompaniments, such as butter, maple syrup, berries, cretons, or meats.\nSerious Eats / Melati Citrawireja\nSpecial Equipment\nWhisk, rimmed baking sheet, wire rack, 10-inch cast iron skillet or griddle, 1/4-cup dry measuring cup, spatula\nNotes\nI recommend using Maine-grown light buckwheat from growers like Bouchard Family Farms or Maine Grains. If you substitute with other buckwheat flour, the ployes will be a dark purplish-brown color rather than yellow, and the pancakes will have a stronger buckwheat flavor.\nBreakfast & Brunch\nThe Latest\nBread\nPancakes"
}