{
  "url": "https://www.seriouseats.com/plum-infused-water-recipe-7560513",
  "image_url": "https://www.seriouseats.com/thmb/Zhca4-N_4P2VyaCm8RPhh6OorRY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230713-SEA-FresnoPlumThymeInfusedWaterhero-AmandaSuarez-003-6d841a7d53bc4345bce6f97c37d48e5c.jpg",
  "tags": [
    "Recipes",
    "The Latest",
    "Non-Alcoholic Drinks",
    "Drinks"
  ],
  "title": "Plum, Thyme, and Chile Infused Water",
  "full_text": "Plum, Thyme, and Chile Infused Water\nClose\nJump to recipe\nPrep\n10 mins\nRefrigeration\n60 mins\nTotal\n70 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n8\ncups\ncold water\n(\n1.9\nL\n) , divided\n3\nplums\n(\n12\nounces\n;\n340\ng\n),\nhalved, pitted, and cut into thin wedges\n,\ndivided\n3\nthyme\nsprigs\n, plus extra for garnish\n1\npepper\nchile\nDirections\nIn a large bowl or 8-cup liquid measuring cup, combine 1 cup water (236ml), 2/3 of the sliced plums, thyme, and half of the sliced chile. Using a potato masher or muddler, mash plum mixture until broken down and all juice is expressed from plums, about 1 minute.\nSerious Eats / Amanda Suarez\nStir in 3 cups (710ml) water. Refrigerate covered until flavors meld and mixture is chilled, 30 minutes to 1 hour.\nSerious Eats / Amanda Suarez\nStrain infused water through a fine-mesh strainer set over a large serving pitcher, pressing on solids to extract as much juice as possible. Discard solids.\nSerious Eats / Amanda Suarez\nStir in remaining 4 cups (945ml) water. Just before serving, garnish pitcher or individual glasses with remaining plum slices, additional  thyme sprigs and remaining half of the sliced chile. Serve over ice.\nSerious Eats / Amanda Suarez\nNotes\nOther stone fruit such as peaches, nectarines, or apricots may be substituted for the plums.\nAdjust the fresh chile amount to your preferred spice level, or omit completely.\nFeel free to adjust the amount and cutting technique of the ingredients used as the final garnish in the water. This is your opportunity to be creative and add your personal touch.\nFor a fun final garnish, serve with decorative ice cubes filled with small pieces of fresh produce or herbs frozen in the center.\nRecipes\nThe Latest\nNon-Alcoholic Drinks\nDrinks"
}