{
  "url": "https://www.seriouseats.com/polenta-lasagna-pasticiatta-casserole-recipe",
  "image_url": "https://www.seriouseats.com/thmb/hrRfF1r2t7Vq08jIGMo8OiKdNhg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__05__20150504-polenta-lasagna-vicky-wasik-10-f24ad5ceccf742248adb2876c4126895.jpg",
  "tags": [
    "Lasagna",
    "Italian",
    "Savory",
    "Cornmeal",
    "Mushrooms"
  ],
  "title": "Polenta Pasticciata (Polenta Lasagna With Mushroom Ragù) Recipe",
  "full_text": "Polenta Pasticciata (Polenta Lasagna With Mushroom Ragù) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nActive\n20 mins\nCooling Time\n20 mins\nTotal\n70 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n8\nounces\n)\nheavy cream\n3\nounces\ngrated\nParmigiano-Reggiano cheese\n, divided\n2\nrecipe\nsmooth and creamy polenta\n1\nquart\nmushroom ragù\n(see notes) or\nragù Bolognese\n2\ntablespoons\nunsalted butter\n, cut into small pieces\nDirections\nPreheat oven to 350°F (180°C). In a small saucepan, heat heavy cream over medium heat until simmering. Lower heat to medium-low and cook, stirring often to prevent scorching, until cream is reduced by half, about 15 minutes. Whisk in 2 ounces grated parmesan cheese until melted. Cover and set aside.\nIn a medium (roughly 2-quart) baking dish, spread a thin, even layer of polenta. Top with a small amount of the remaining grated Parmesan. Spoon half of the ragù on top in an even layer and drizzle with about 2 tablespoons of Parmesan cream.\nSerious Eats / Vicky Wasik\nGently spread another even layer of polenta on top of ragù, covering it completely, then top with more grated Parmesan and the rest of the ragù. Drizzle 2 more tablespoons Parmesan cream on top. Spread a final thin layer of polenta on top, dot with butter and top with more grated Parmesan.\nSerious Eats / Vicky Wasik\nBake polenta lasagna until heated throughout and golden on top, about 20 minutes. Let stand until cooled slightly so that the polenta sets a little, about 20 minutes. Reheat remaining Parmesan cream, thinning with a little water if necessary, and serve polenta lasagna, spooning Parmesan cream on top.\nSerious Eats / Vicky Wasik\nNotes\nThe exact quantity of polenta and mushroom sauce you need will depend on the size of the baking dish you use; it's possible you may have a small amount of polenta and/or mushroom sauce left over. This recipe calls for a half recipe of the mushroom ragù, but I recommend making the full batch, since it'll leave you with leftovers that you can freeze for future meals.\nSpecial Equipment\nMedium baking dish (about 2-quart capacity)\nRead More\nMushroom Ragù\nCreamy Polenta with Chicken, Caramelized Shallots, and Arugula\nGrilled Polenta With Marinara, Parmesan, and Basil\nDinner Tonight: Polenta with Broccoli and Tomato\nSeared Skirt Steak With Blistered Cherry Tomatoes and Polenta\nLasagna\nItalian\nSavory\nCornmeal\nMushrooms",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/polenta-pasticciata-polenta-lasagna-with-mushroom-rag-recipe.webp?"
}