{
  "url": "https://www.seriouseats.com/pomegranate-molasses",
  "image_url": "https://www.seriouseats.com/thmb/cjbTwfG6hubSiNc2KrRe41eVH-E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20210201-pomegranate-molasses-nik-sharma-6-ecf9af54466a4334a7123e1c95dd510e.jpg",
  "tags": [
    "Pomegranate",
    "Condiments & Sauces"
  ],
  "title": "How to Make Pomegranate Molasses From Fresh Fruit or Juice Recipe",
  "full_text": "How to Make Pomegranate Molasses From Fresh Fruit or Juice Recipe\nClose\nJump to recipe\nCook\n90 mins\nActive\n2 hrs\nCooling Time\n30 mins\nTotal\n2 hrs\nServes\n10 servings\nMakes\n2/3 cup\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n1\nL\n)\npomegranate juice\n, fresh or store-bought (see notes)\nDirections\nIn a 12-inch stainless-steel skillet or a wide 3-quart stainless-steel sauté pan, bring pomegranate juice to a bare simmer over medium heat (the juice will begin steaming and bubbles will form on the bottom of the vessel, with only a few breaking the surface). Reduce heat to medium-low to maintain a bare simmer and cook, stirring and occasionally wiping down the sides of the skillet with a silicone spatula, until reduced to about 2/3 cup (155ml) and juice has become syrupy enough to lightly coat the back of a spoon (a finger, when dragged through it, should leave a clear trail), about 1 hour 30 minutes; adjust heat as necessary to keep the liquid at a bare simmer the entire time without boiling.\nRemove from the heat, let cool slightly, then transfer to a clean, dry glass container and seal tightly with a non-metallic lid. Store the pomegranate molasses in the refrigerator for up to 6 months.\nSpecial Equipment\n12-inch stainless-steel skillet, 3-quart stainless-steel sauté pan\nNotes\nThis recipe has been tested with both bottled and fresh pomegranate juice, and both work, though you will get the most consistent results and deep color with bottled juice, such as from Pom brand. If you use fresh pomegranates, the amount of juice they yield will vary, but we've found that about eight 12-ounce pomegranates (about 6 pounds total) will yield the 4 cups juice you need. No matter what you use, keep in mind that pomegranate juice stains surfaces and fabrics, so wear an apron and be sure to clean up any spills promptly.\nMake-Ahead and Storage\nRemove from the heat, let cool slightly, then transfer to a clean, dry glass container and seal tightly with a non-metallic lid. Store the pomegranate molasses in the refrigerator for up to 6 months.\nPomegranate\nCondiments & Sauces"
}