{
  "url": "https://www.seriouseats.com/pommes-anna-recipe-5217317",
  "image_url": "https://www.seriouseats.com/thmb/lVIeysZ0s_pw3VTttDCcWbW7r8s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220201-pommes-anna-vicky-wasik-32-40066069bda0464491cd825c2d903817.jpg",
  "tags": [
    "Potatoes",
    "The Latest"
  ],
  "title": "Pommes Anna",
  "full_text": "Pommes Anna\nClose\nJump to recipe\nPrep\n40 mins\nCook\n75 mins\nTotal\n115 mins\nServes\n4\nto 6 servings\nMakes\n1 8-inch Potato Cake\nCook Mode\n(Keep screen awake)\nIngredients\nNonstick cooking spray\n2\npounds\n(900g)\nYukon Gold potatoes\n(about 4 medium potatoes)\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\n(30g) melted\nhomemade\nor store-bought\nclarified butter\n, plus more for brushing\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Spray an 8-inch aluminum cake pan with nonstick cooking spray, making sure to get the interior sides as well as the bottom. Cut an 8-inch\nparchment round\nand press it flat on the bottom of the cake pan. Spray the parchment round with more nonstick cooking spray.\nSerious Eats / Vicky Wasik\nPeel potatoes and hold them in a bowl of cold water to prevent discoloration. Working with one potato at a time and using a mandoline, slice potatoes crosswise 1mm thick. If desired, select a round cookie cutter just big enough to punch perfect circles from the potato slices; make small stacks of potato slices and punch out the circles, discarding scraps or saving for another use (if you do decide to make potato circles, note that you only need to do it for the first layer or two of the pommes Anna, after that you can just use the remaining potato slices as-is).\nSerious Eats / Vicky Wasik\nStarting in the center of the cake pan, set down a single potato slice, then arrange concentric circles of potato slices around it in an overlapping shingled pattern until you fully cover the bottom of the cake pan.\nSerious Eats / Vicky Wasik\nUsing a pastry brush, gently brush the potato layer with clarified butter, then season lightly with salt and pepper. Repeat this pattern in layers with remaining potatoes until you've made 5 or 6 layers, seasoning each layer with salt and pepper and brushing lightly with clarified butter each time. Weigh down the layered potatoes with a small flat lid or oven-safe plate (spray the side of the lid or plate that will touch the potatoes with nonstick spray first); if you have oven-safe weights to add on top, do so, or press down firmly with your hands.\nSerious Eats / Vicky Wasik\nAllow layered potatoes to stand 15 minutes, pressing down occasionally to help extract as much liquid as possible. Remove the weights, if using, and, using the lid or plate to hold the layered potatoes in place, carefully tip cake pan, and squeezing down on the lid/plate with your fingers, expel and pour out as much liquid as possible. Replace oven-safe weights, if using, and transfer to oven to cook until potatoes are fully tender throughout and can be easily pierced with a paring knife, about 45 minutes. Let cool to room temperature.\nSerious Eats / Vicky Wasik\nWhen ready to finish, remove weights and lid/plate from potato cake (if any potato slices stick when removing the cover, just put them back as best you can; this will be the non-presentation side of the pommes Anna). Using a paring knife or small offset spatula, carefully slide around the edge of the potato cake to ensure it is not attached to the cake pan. Set a large, flat plate on top of the cake pan, then, in one quick, confident motion, flip to invert. The potato cake may take a second to release, but with a gentle shake or two it should drop onto the plate. If the parchment paper remains attached to the potatoes, carefully remove and discard. Very gently brush or dab top side of potato cake all over with additional clarified butter.\nSerious Eats / Vicky Wasik\nSet an empty, cold, oven-safe 10-inch nonstick skillet over the plate. In another quick, confident motion, flip the potato cake into the skillet.\nSet skillet over medium-high heat, add 2 tablespoons (30g) clarified butter, and cook until butter begins to gently sizzle all over. Transfer skillet to the oven and cook until potato cake is heated through, about 10 minutes. Return to medium heat on the stovetop and continue to cook, gently rotating the pan and swirling the potato cake for even browning, until underside is well browned and crisped all over, about 5 minutes longer (use a thin spatula to very slightly lift the potato cake in various spots to check the progress of browning, being careful not to let it fall apart).\nSerious Eats / Vicky Wasik\nUsing the lid or plate from baking to hold the potato cake in place in the skillet, pour out the clarified butter into a heatproof bowl so that there is no liquid fat remaining in the skillet.\nSerious Eats / Vicky Wasik\nWhile wearing oven mitts, set a serving platter on top of the skillet and once more quickly and confidently invert it. Serve the pommes Anna right away, cutting wedges for each diner.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n8-inch\naluminum cake pan\n,\nmandoline slicer\n, 10-inch oven-safe\nnonstick skillet\nMake-Ahead and Storage\nThe baked and cooled potato cake can stand at room temperature for up to 2 hours before finishing; it can be wrapped in plastic on the plate it's turned out onto and refrigerated for up to 1 day (make sure it fully heats through in the oven during the browning process in the skillet).\nRead More\nLyonnaise Potatoes Recipe\nPommes de Terre Fondantes (Fondant Potatoes) Recipe\nHasselback Potato Gratin Recipe\nClassic Rich and Silky Potato Gratin (Scalloped Potatoes) Recipe\nPotatoes\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pommes-anna.webp?"
}