{
  "url": "https://www.seriouseats.com/pommes-darphin-recipe-5217311",
  "image_url": "https://www.seriouseats.com/thmb/VeVQo5TTXeGMXrqBlGhMdC2QNRs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220131-potato-darphin-vicky-wasik-11-2af09e1fc50c4e8faf57b29aabfc238d.jpg",
  "tags": [
    "Potatoes",
    "French",
    "The Latest"
  ],
  "title": "Pommes Darphin (French Potato Pancake)",
  "full_text": "Pommes Darphin (French Potato Pancake)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nTotal\n30 mins\nServes\n2 servings\nMakes\n1 Potato Pancake\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\nrusset\nor\nYukon Gold potatoes\n(about\n14\nounces\ntotal;\n400\ng\n), peeled\nKosher salt\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n, plus more as needed, divided\nDirections\nUsing the julienne setting on a mandoline slicer or the fine shredding disc on a food processor, shred potatoes into strands. Transfer to a medium bowl, season with salt, and toss to combine. Immediately proceed to Step 2.\nIn an 8-inch nonstick, cast iron, or carbon-steel skillet (see note), melt 2 tablespoons (30g) butter over medium-high heat until foaming. Add potatoes and cook, using a silicone spatula to push the shredded potatoes into a round cake about 3/4-inch thick. Continue cooking, using the spatula to form a nicely rounded and evenly flat disc shape while rotating the cake for even browning, until well browned and crisp on bottom side, about 8 minutes; lower heat as needed to maintain an active sizzle while avoiding scorching the potato. (It can also help to weigh down the potato cake as it cooks, either by setting a small, heavy skillet on top or a cooking weight like the\nChef's Press\n).\nSet a heatproof plate on top of the skillet, then quickly and carefully flip to invert the potato cake onto it. Gently slide the potato cake back into the skillet so that the browned side is up. Add remaining 1 tablespoon (15g) butter and continue to cook, rotating the cake in the pan for even browning and using the spatula to press any loose potato shreds in and form an even disc shape, until well browned and crisp on second side, about 8 minutes; if using a weight, set it on top of the potato cake again to compress it and cook it evenly. Add butter at any point if the pan becomes too dry, as you want it to gently fry in the fat.\nUsing a spatula, transfer the potato cake to a paper towel-lined plate to drain. Season with salt, then serve right away as desired.\nSpecial Equipment\n8-inch nonstick, cast iron, or carbon-steel skillet; second small, heavy skillet or\ncooking weight\n(optional)\nNotes\nEven in a well-seasoned cast iron or carbon steel skillet, potatoes have a tendency to adhere, which can lead to failure; if you use one, make sure potato shreds are blotted dry and that the skillet is very well seasoned. In our testing, though, nonstick worked beautifully and came with none of the risks.\nMake-Ahead and Storage\nThis style of potato cake is best made shortly before serving, though it can be kept warm in a 200°F (95°C) oven for up to 30 minutes.\nPotatoes\nFrench\nThe Latest"
}