{
  "url": "https://www.seriouseats.com/pork-and-leek-dumplings-with-homemade-wrapper",
  "image_url": "https://www.seriouseats.com/thmb/zeyruCpig_PP4-qAMu_AOZ2d1rE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__20110406-chinese-appetizers-dumplings-18-7fafeeba029c4fa1b05cf518b48ee1b9.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Christmas",
    "Chinese",
    "Pork",
    "Cabbage"
  ],
  "title": "Guo Tie (Chinese Fried Pork and Cabbage Dumplings with Homemade Wrappers)",
  "full_text": "Guo Tie (Chinese Fried Pork and Cabbage Dumplings with Homemade Wrappers)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n20 mins\nActive\n90 mins\nResting Time\n60 mins\nTotal\n110 mins\nServes\n8 servings\nMakes\n40 dumplings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n2\ncups\n(\n9\nounces\n;\n255\ng\n)\nall-purpose flour\n1\ncup\n(\n237\nml\n) boiling\nwater\nFor the Filling:\n1/2\npound\n(\n8\nounces\n;\n226\ng\n)\nNapa cabbage\n(about\n1/2\na small\nhead\n), roughly chopped\n1\nteaspoon\n(\n3\ng\n)\nkosher salt\n; for table salt, use half as much by volume\n2\nscallions\n, roughly chopped\n1/2\npound\n(\n8\nounces\n;\n226\ng\n) fatty\nground pork\n2\nteaspoons\nsoy sauce\n1\ntablespoon\nShaoxing wine\n2\nteaspoons\nsugar\nFor the Dipping Sauce:\n2\ntablespoons\nsoy sauce\n2\ntablespoons\nChinkiang vinegar\n(or rice vinegar)\n1\nteaspoon\nsugar\n1\ntablespoon\nfinely sliced\nscallion greens\n1\nteaspoon\nginger\n, grated on a microplane\nTo Cook:\nVegetable oil\nDirections\nFor the Dough:\nplace flour in bowl of food processor. With machine running, slowly drizzle in water until a cohesive dough forms (you probably won't need all the water). Allow dough to ride around processor for 30 seconds. The dough should be smooth and tacky. Form into a ball using floured hands and transfer to a bowl. Cover with a damp towel and let rest for at least 30 minutes.\nFor the Filling:\nPlace cabbage and salt in food processor and pulse until finely chopped, about 10 one-second pulses. Transfer to a fine-meshed strainer set over a bowl. Allow to rest for 30 minutes. Meanwhile, place scallions, pork, soy sauce, Shaoxing wine, and sugar in bowl of food processor. Pulse until homogeneous and pasty, about 10 one-second pulses. Transfer to a large bowl and set aside.\nSerious Eats / J. Kenji López-Alt\nAfter cabbage has purged, squeeze any remaining moisture out with your fingers, then transfer to the bowl with the pork. Fold together with a spatula until homogeneous. Microwave a small ball of the filling in a bowl for 10 seconds and eat it to taste for seasoning. Add more salt, soy sauce, or sugar as necessary and repeat tasting and seasoning until the filling tastes like you want it to. Refrigerate until ready to use.\nSerious Eats / J. Kenji López-Alt\nTo Make the Dumplings:\nDivide dough into 4 sections. Roll each section into a 6-inch long log. Cut each section into 10 equal pieces and roll each into a ball, making 40 balls total (about 3.8 ounce; 10g each). On a well-floured work surface, roll each ball into a round 3 1/2- to 4-inches in diameter. Stack wrappers and keep under plastic until all of them are rolled out.\nSerious Eats / J. Kenji López-Alt\nTo form dumplings, place 1 tablespoon of filling in the center of a wrapper. Moisten the edges of the wrapper with a wet fingertip or a pastry brush. Fold in half and pinch the bottom-right corner closed. Pleat the front edge of the wrapper repeatedly, pinching the edge closed after each pleat until the entire dumpling is sealed. Transfer sealed dumplings to a lightly floured wooden or parchment-lined board.\nSerious Eats / J. Kenji López-Alt\nTo Make the Sauce:\nCombine all sauce ingredients in a small bowl and set aside at room temperature.\nTo Cook the Dumplings:\nBring a large pot of water to a boil. Add 6 to 12 dumplings and boil until they float, about 1 minute. Continue boiling for 2 minutes longer, then transfer to a plate with a wire-mesh spider or slotted spoon. Heat 3 tablespoons vegetable oil in a 10-inch nonstick skillet or the bottom of a well-seasoned cast iron wok over medium heat until shimmering. Add dumplings flat-side down and cook, swirling occasionally, until bottom of dumplings are golden brown and crisp, about 3 minutes. Serve immediately with dipping sauce. Repeat step 7 with remaining dumplings, working in batches.\nSpecial Equipment\nFood Processor\nRead More\nHow to Throw a Dumpling Party\nAsk The Food Lab: How Can I Get My Dumplings Extra Crispy?\nSerious Entertaining: A Dim Sum-Inspired Chinese Food Party\nHors D'Oeuvres\nChristmas\nChinese\nPork\nCabbage",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/guo-tie-chinese-fried-pork-and-cabbage-dumplings-with-homemade-wrappers.webp?"
}