{
  "url": "https://www.seriouseats.com/pork-belly-buns-with-spicy-mayo-recipe",
  "image_url": "https://www.seriouseats.com/thmb/yh5gA3DVb9Qnlolu09mgX4WeJP4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120301-tonkotsu-chashu-cha-siu-pork-belly-ramen-18-61e6f4d5781a402c982f2d8acdbdd8cd.jpg",
  "tags": [
    "Pork Belly",
    "Stovetop Pork",
    "Snacks & Appetizers"
  ],
  "title": "Pork Belly Buns with Spicy Mayo, Scallions, and Pickled Bean Sprouts Recipe",
  "full_text": "Pork Belly Buns with Spicy Mayo, Scallions, and Pickled Bean Sprouts Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n6\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pickled Bean Sprouts:\n1\ncup\nrice vinegar\n1\ncup\nwater\n1\ncup\nsugar\n1\ntablespoon\nsalt\n3\ncups\npicked\nmung bean sprouts\nFor the Spicy Mayonnaise:\n1/2\ncup\nmayonnaise\n2\ntablespoons\nchile paste, such as\nsriracha\n, gochujang, or sambal oelek\nTo Assemble:\n12\n(\n1/4-inch-thick) slices\nchashu pork\n1\ncup\nreserved broth from chashu pork recipe\n6\nscallions\n, finely sliced at a heavy bias\nShredded iceberg lettuce\n(if desired)\n12\nChinese folded steamed buns\n(see note)\nDirections\nMake the pickled bean sprouts:\nCombine water, vinegar, sugar, and salt in a small saucepan. Bring to a boil over high heat, stirring until sugar and salt are dissolved. Place bean sprouts in a small bowl. Pour hot pickling liquid over them. Cover with a paper towel, pressing the towel down into the liquid to make sure sprouts are completely submerged. Set aside.\nMake the spicy mayo:\nCombine mayonnaise and chile paste in a small bowl. Stir with a fork until combined. Set aside.\nChar the pork:\nPlace pork slices in a medium skillet and pour broth on top. Heat over medium-high heat until simmering and pork slices are heated through. Transfer with a slotted metal spatula to a foil-lined rimmed baking sheet. Using a blowtorch or kitchen torch, char top of each slice by running the flame rapidly back and forth over each slice until evenly crisped. Flip and repeat on second side. Alternatively, use the broiler (see note).\nSerious Eats / J. Kenji López-Alt\nAssemble the buns:\nHeat buns (see note). Spread mayonnaise mixture evenly over inside of each bun. If using, spread some shredded iceberg lettuce on bottom half of bun. Lay a slice of pork in each and top with pickled bean sprouts and sliced scallions. Close buns and serve.\nSpecial Equipment\nKitchen blowtorch\n(optional)\nNotes\nFolded Chinese-style steamed buns can be found in the refrigerated or frozen section of most Chinese markets. To reheat, first allow buns to thaw to room temperature in their packaging (if frozen). Transfer six to a large microwave-safe plate and cover with a double layer of damp paper towels. Microwave at high power until hot, about 1 1/2 minutes. Repeat with remaining buns. Alternatively, buns can be reheated in a bamboo steamer set over a wok of simmering water.\nIf you don't have a blowtorch, pork belly slices can be charred by arranging on a foil-lined baking sheet and placing 2 inches from a preheated broiler until crisp and brown. Flip slices and repeat to brown second side.\nRead More\nTaiwanese Pork Belly Buns (Gua Bao)\nSteamed Buns With Grilled Shrimp and Sriracha Mayonnaise\nSteamed Buns With Simmered Daikon and Shiitake, Pickled Bean Sprouts, and Spicy Mayonnaise\nSteamed Buns With Tempura King Oyster Mushrooms and Agave-Miso Mayonnaise Recipe\nPressure Cooker Pork Belly Chashu\nPork Belly\nStovetop Pork\nSnacks & Appetizers"
}