{
  "url": "https://www.seriouseats.com/pork-chops-apple-cider-pan-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/fyJI9TBWTONA8vmvHurrYGoOheI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Pork-Chops-with-Apple-Cider-Pan-Sauce-Hero-1a-00245-61a7569246dc4b25a3c7a374ccb9ff77.jpg",
  "tags": [
    "Pork Chop",
    "Roasted Pork",
    "Pork Mains",
    "Fall Mains",
    "Winter Mains"
  ],
  "title": "Pork Chops With Apple Cider Pan Sauce Recipe",
  "full_text": "Pork Chops With Apple Cider Pan Sauce Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nActive\n45 mins\nResting Time\n5 mins\nTotal\n60 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nbone-in\npork rib\nchops\n, about 1- to 1 1/2-inches thick (about\n3 1/4\npounds\ntotal)\n4\ntablespoons\n(\n36\ng\n)\nkosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(\n15\ng\n)\ngranulated sugar\nFreshly ground black pepper\n2\ntablespoons\n(\n30\ng\n)\nvegetable oil\n4\ntablespoons\n(\n2\nounces\n;\n56\ng\n)\nunsalted butter\n, divided\n2\ntablespoons\nminced\nshallot\n(\n1\nsmall\nshallot\n)\n2\nteaspoons\nminced\nthyme leaves\n, divided\n3/4\ncup\n(\n177\nml\n)\napple cider\n1/2\nteaspoon\napple cider vinegar\n2\nteaspoons\nminced\nparsley\nDirections\nPat pork chops dry with a paper towel. Combine salt and sugar in a small bowl. Season pork chops generously on all sides with salt/sugar mixture (you may have some seasoning mixture left over; reserve for another use or discard). Transfer to a wire rack set in a rimmed baking sheet. If dry-brining chops overnight, refrigerate, uncovered, at least 8 hours and up to 24; otherwise proceed immediately to Step 2.\nSerious Eats / Victor Protasio\nWhen ready to cook chops, preheat oven to 250°F (121°C). Season chops with pepper. Place baking sheet with pork chops in oven and cook until an instant-read thermometer inserted into the center of the chops registers 100 to 110°F (38 to 43°C) for medium-rare, about 20 to 25 minutes, or 110 to 120°F (43 to 49°C) for medium, about 35 minutes. To prevent overcooking, start checking temperature 5 to 10 minutes before suggested time. Remove from oven.\nSerious Eats / Victor Protasio\nHeat oil in a large stainless steel or cast iron skillet over high heat until smoking. Working in batches if necessary to not overcrowd the skillet, place pork chops in skillet and cook, turning occasionally, until browned and an instant-read thermometer registers 120 to 130°F (49 to 54°C) for medium-rare or 130 to 140°F (54 to 60°C) for medium, about 3 to 5 minutes. Stack pork chops with tongs, hold them on their sides, and sear the fat caps on the edges until crisp, about 1 minute. Remove pan from heat, transfer chops to a clean rack set in a rimmed baking sheet, and let rest for 3 to 5 minutes.\nSerious Eats / Victor Protasio\nPour fat from skillet. Add 1 tablespoon butter and melt over medium-high heat. Add shallot and thyme and cook, stirring, until softened, about 1 minute. Stir in apple cider and bring to a simmer. Lower heat to medium and simmer until liquid is slightly reduced, about 4 minutes. Whisk in cider vinegar and remaining 3 tablespoons butter. Remove from heat, season to taste, and stir in parsley. Serve chops, spooning sauce on top.\nSerious Eats / Victor Protasio\nSpecial Equipment\nRimmed baking sheet with wire rack\n; large\nstainless steel\nor\ncast iron skillet\nPork Chop\nRoasted Pork\nPork Mains\nFall Mains\nWinter Mains"
}