{
  "url": "https://www.seriouseats.com/pork-ragu-pappardelle-recipe-7553799",
  "image_url": "https://www.seriouseats.com/thmb/Epk8EwbSNk9M00iDGznfLZwEPlI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230628-SEA-PappardellewithPorkRagu-LorenaMasso-hero-d82c2b736bd043d5bfcdf9736f0f78bd.jpg",
  "tags": [
    "Pastas",
    "The Latest",
    "Italian",
    "Braising & Stewing",
    "Pork"
  ],
  "title": "Pappardelle With Tuscan Pork Ragù",
  "full_text": "Pappardelle With Tuscan Pork Ragù\nClose\nJump to recipe\nPrep\n15 mins\nCook\n3 hrs 20 mins\nMarinating and Cooling Time\n8 hrs 5 mins\nTotal\n11 hrs 40 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinade:\n2 1/4\ncups\n(\n533\nml\n) dry\nred\nItalian\nwine\n(preferably Chianti or other Tuscan wine)\n3\nmedium\ngarlic cloves\n(\n15\ng\n), smashed\n1\ntablespoon\nkosher salt\n1\ntablespoon\ndried\njuniper berries\n1\ntablespoon\nwhole black\npeppercorns\n2\ndried\nbay leaves\n1\nrack\n(\n2.5 to 3\nlbs\n;\n1125 to 1350\ng\n)\nSt. Louis–cut\nribs\n, cut between bones into\n3\nequal\npieces\nFor the Ragù:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, divided\n2\nmedium\ncarrots\n(about\n4\nounces\n;\n115\ng\n), peeled and diced\n2\ncelery\nstalks\n(about\n4\nounces\n;\n110\ng\n), diced\n1\nmedium\nonion\n(about\n8\nounces\n;\n225\ng\n), diced\n2\ntablespoons\n(\n30\ng\n)\ntomato paste\n4\nmedium\ngarlic cloves\n(\n20\ng\n), minced\n1\ntablespoon\n(\n6\ng\n) chopped\nfresh sage\n1\nsprig\nfresh rosemary\n2\ncups\n(\n450\ng\n)\ncrushed tomatoes\nor\npassata di pomodoro\n(see notes)\n2\ncups\n(\n450\ng\n) homemade\nchicken stock\nor low-sodium chicken broth\nFor the Pappardelle:\n1\npound\n(\n450\ng\n)\nhomemade\nfresh pasta\ndough\n, cut into 1- to 1 1/2–inch wide ribbons or store-bought fresh pappardelle\nKosher salt\nand freshly ground black pepper\nDirections\nFor the Marinade:\nIn a large bowl, mix together the wine, garlic, salt, juniper berries, peppercorns, and bay leaves. Add the rib pieces to the marinade, making sure they are fully submerged. Cover the bowl and refrigerate for at least 8 hours, or up to 24 hours.\nSerious Eats / Lorena Masso\nFor the Ragù:\nRemove ribs from marinade and pat dry with paper towels. Strain the marinade and discard solids. Set strained marinade aside.\nSerious Eats / Lorena Masso\nIn a large Dutch oven or deep sauté pan, heat 1 tablespoon (15ml) oil over medium-high heat until shimmering. Working in batches, brown the rib pieces, meaty side down, and cook until well browned, about 5 minutes. Transfer browned ribs to a clean plate and set aside.\nSerious Eats / Lorena Masso\nIn now-empty Dutch oven, add remaining 1 tablespoon (15ml) oil and heat over medium heat until shimmering. Add carrots, celery, and onion, and cook stirring occasionally until the vegetables begin to soften, about 5 minutes. Add tomato paste, garlic, sage, and rosemary and cook until the mixture is fragrant and the paste begins to brown, about 2 minutes. Stir in the reserved strained marinade, and bring to a boil over medium-high heat. Cook until mixture is reduced slightly and thickened, about 5 minutes. Stir in tomatoes and broth and return to a boil.\nSerious Eats / Lorena Masso\nNestle ribs and their juices, meaty side down, into the sauce, cover Dutch oven, reduce heat to low and cook until pork is fully tender and falls off the bones, 2 to 2 1/2 hours.\nSerious Eats / Lorena Masso\nRemove and discard rosemary sprig. Transfer ribs to a clean plate and let cool slightly, about 5 minutes. Using 2 forks, shred meat, discard the bones, and return shredded meat to sauce. Simmer ragù over medium-high heat, stirring occasionally, until ragù is reduced to a saucy consistency, about 10 minutes.\nSerious Eats / Lorena Masso\nFor the Pappardelle:\nIn a large pot of salted boiling water, cook pasta. If using fresh pasta, cook until noodles are barely cooked through. If using dry pasta, cook until just shy of al dente (1 to 2 minutes less than the package directs). Using tongs or a spider skimmer, transfer pasta to ragù in Dutch oven along with 1/2 cup (120ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 2 cups (500ml) pasta cooking water.\nSerious Eats / Lorena Masso\nReturn Dutch oven to medium-high heat and cook, stirring and tossing pasta until it is al dente and ragù clings to the noodles, about 1 minute. Add pasta cooking water in 1/4 cup (60ml) increments to thin sauce, if needed. Season with salt and pepper to taste. Divide pasta between individual serving bowls. Serve.\nSerious Eats / Lorena Masso\nSpecial Equipment\nLarge Dutch oven or deep sauté pan, large pot\nNotes\nPassata di pomodoro is a cooked tomato puree that can be made at home, or jarred versions can be found at most supermarkets.\nMake-Ahead and Storage\nThe ragù can be cooked (through step 6), cooled, and refrigerated in an air-tight container for up to 5 days, or frozen for up to 3 months. When reheating ragù, thin with water as needed to reach desired consistency.\nPastas\nThe Latest\nItalian\nBraising & Stewing\nPork"
}