{
  "url": "https://www.seriouseats.com/pork-larb-thai-salad-with-pork-herbs-chili-an",
  "image_url": "https://www.seriouseats.com/thmb/geZhPFZOKovDVhWu4QDfaaG-V1U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__06__20120613-kenjis-larb-primary-9205f60aa1024a4e9f916651e1f65386.jpg",
  "tags": [
    "Salads",
    "Thai",
    "Pork",
    "Rice & Grains"
  ],
  "title": "Pork Larb (Thai Salad with Pork, Herbs, Chile, and Toasted Rice Powder) Recipe",
  "full_text": "Pork Larb (Thai Salad with Pork, Herbs, Chile, and Toasted Rice Powder) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n30 mins\nFreezing and Cooling Time\n20 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\npound\nlean pork\nor chicken, trimmed of connective tissue and cut into 1-inch cubes\n1/2\ncup\ndry glutinous rice\n(see note)\n1/2\ncup\nthinly sliced\nshallots\n1/2\ncup\nvegetable oil\n1/4\ncup\nfish sauce\n2\nscallions\n, thinly sliced\n1/2\ncup\nroughly chopped fresh basil\nleaves (preferably Thai)\n1/2\ncup\nroughly chopped fresh cilantro\nleaves and tender stems\n1/4\ncup\nroughly chopped fresh\nmint leaves\n2\ntablespoons\nground dry Thai chiles\n(more or less to taste)\n1/4\ncup\nlime juice\nfrom about\n4\nlimes\n2\ntablespoons\npalm sugar\n(see note)\nCrumbled pork rinds\n(optional)\nThinly sliced fresh red chile\n(optional)\nDirections\nPlace meat on a tray leaving a 1-inch space between each cube and place in freezer until firm but not frozen, about 15 minutes. Transfer half of meat to bowl of food processor and pulse until meat is roughly ground and no pieces larger than 1/4-inch remain, about 10 one-second pulses. Transfer meat to a bowl. Repeat with remaining meat. Set aside.\nWhile meat chills, place rice in an empty 12-inch skillet and heat over medium-high heat shaking constantly until rice is golden brown and a nutty popcorn-like aroma emerges, about 6 minutes. Transfer to mortar and pestle and grind until it has the texture of coarsely ground black pepper. Alternatively, grind in a spice grinder. Set aside.\nAdd oil and shallots to now-empty skillet and cook over medium-low heat, stirring constantly until shallots are golden brown, about 5 minutes. Drain shallots and discard oil but do not wipe out pan.\nAdd pork, 1 tablespoon fish sauce, and 2 tablespoons water to pan. Cook, stirring frequently until pork is just cooked through but not browned at all, about 6 minutes. Transfer to a large bowl and allow to cool 5 minutes. Add remaining fish sauce, scallions, basil, cilantro, mint, half of chile, lime juice, sugar, and toasted rice powder. Toss with hands and taste for seasoning, adding more chile if higher heat is desired.\nJust before serving, add fried shallots and toss again. Granish with pork rinds and chile. Serve immediately with cabbage or lettuce on the side.\nSpecial Equipment\nFood processor\n;\nmortar and pestle\nor\nspice grinder\nNotes\nGlutinous rice (also known as sticky rice) can be found in most Asian grocers. It has opaque, pearly white grains, not the translucent grains of regular rice.\nFor best results, use ground dried Thai chiles and palm sugar, though red pepper flakes and regular sugar will do. Adjust the sweetness, heat, and acidity of the salad to fit your taste.\nRead More\nLaab Moo Isan (Thai Isan-Style Minced Pork Salad)\nLarb Muang Moo (Northern Thai-Style Chopped Pork Salad)\nShimeji Mushroom Laab\nThai-Style Spicy Chicken, Banana Blossom, and Herb Salad (With Lots of Fried Things)\nIsan-Style Spicy Thai Fried Pork Rind and Herb Salad\nSalads\nThai\nPork\nRice & Grains"
}