{
  "url": "https://www.seriouseats.com/pork-brisket-braised-in-milk-recipe",
  "image_url": "https://www.seriouseats.com/thmb/3Zc6czbOrBFWMGgNxa8TtZxngTU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100506-butcherscuts-rolledup-a2c8b3781441442da09c518ca915a6a0.jpg",
  "tags": [
    "Pork Shoulder",
    "Braised & Stewed Pork",
    "Pork Mains"
  ],
  "title": "Pork Brisket Braised in Milk Recipe",
  "full_text": "Pork Brisket Braised in Milk Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n115 mins\nTotal\n2 hrs\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n3- to 4-pound\nskin-on, boned-out\npork brisket\n, to be rolled and tied up\nSalt\nand\npepper\nFresh sage\nand\nthyme\n,\n1\ntablespoon\nof each, chopped, or\n1/2\nteaspoon\ndried\n2\ntablespoons\nolive oil\nor\nlard\n1\ntablespoon\ngarlic\n1\nquart\nwhole milk\n2\nbay leaves\nThe\njuice\nof\n1/2\nlemon\nZest\nfrom\n1\nwhole\nlemon\nDirections\nRub salt, pepper, and herbs all over meat. Depending on the size of your roast, you will need about 1 1/2 to 2 teaspoons of salt and pepper, each. Roll and tie up roast into a cylinder. The roast will benefit from being salted and kept in the refrigerator overnight, or you can proceed with the recipe immediately.\nSerious Eats / Chichi Wang\nPreheat oven to 325°F (160°C). In a Dutch oven, heat 2 tablespoons of oil or lard. Add tied up roast and brown it on all sides, about 10 minutes total. 5 minutes into the browning, add chopped garlic and let it brown alongside meat.\nRemove meat from pot and pour off all but 1 teaspoon of fat. Add milk, bay leaves, lemon juice, and zest. Bring mixture to a boil. Return roast to pot, placing skin side up. Cover pot and braise in oven for 1 hour. Remove cover and braise for 30 minutes longer, or until internal temperature of roast registers around 160 (71°C) to 170°F (77°C). The skin on the roast should be golden brown and crisp.\nRemove roast from pot and place it into a sauté pan or hotel pan. Place roast under broiler for 30 seconds to 1 minute, to further crisp up skin.\nIn the meantime, reduce sauce: Take braising milk in pot and place it on top of stove. Simmer sauce for 5 to 7 minutes, until sauce has formed light-brown curds. Remove bay leaves.\nSlice as much of the roast as you need into 1/2-inch thick slices, arrange on a platter, and spoon sauce over them. Serve immediately. Leftovers may be refrigerated and sliced cold for use in sandwiches.\nPork Shoulder\nBraised & Stewed Pork\nPork Mains"
}