{
  "url": "https://www.seriouseats.com/pork-roll-sandwich-recipe-8604825",
  "image_url": "https://www.seriouseats.com/thmb/Mx3NPGv8ZdGAEB-XPoRZelmWhXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240307-PorkRoll-AmandaSuarez28-5cd2c54588cd445f83433463981a7fe5.jpg",
  "tags": [
    "Breakfast Sandwich",
    "The Latest",
    "American",
    "Ham"
  ],
  "title": "5-Ingredient Pork Roll (AKA Taylor Ham)",
  "full_text": "5-Ingredient Pork Roll (AKA Taylor Ham)\nClose\nJump to recipe\nCook\n15 mins\nSteaming Time\n5 mins\nTotal\n20 mins\nServes\n1\nMakes\n1 sandwich\nCook Mode\n(Keep screen awake)\nIngredients\n14\ng\nunsalted butter\n(\n1\ntablespoon\n)\n2\nslices\nTaylor ham\n(\n3\nounces\n;\n85\ng\n)\n2\nlarge\neggs\n2\nslices\nAmerican cheese\nKosher salt\nFreshly\nground black pepper\n1\nKaiser\nroll\n, split and warmed through (see notes)\nKetchup\n, optional (but also mandatory)\nDirections\nLine a plate with paper towel. In a 10-inch cast iron skillet set over medium heat, melt butter until foaming. Add the pork slices and cook, pressing down once or twice with a spatula, until well browned around the edges and domed on top, about 3 minutes. Flip and continue cooking until second side is well browned, 2 to 3 minutes longer. Transfer to prepared plate and set aside.\nSerious Eats / Amanda Suarez\nGently slip eggs into the pan, season with salt, and cook until the whites are just set and bubbling, then flip, season with pepper and continue cooking until eggs are over-easy, about 2 minutes. Place both slices of cheese on top of one of the eggs and continue to cook until eggs are over-medium, about 1 minute longer. Stack the cheese-covered egg on top of the bare egg and transfer to a plate.\nSerious Eats / Amanda Suarez\nDip Kaiser roll halves, cut side down, into the pan juices to lightly coat.\nSerious Eats / Amanda Suarez\nSet eggs on top of bottom half of roll, top with pork roll slices, and close sandwich. Wrap sandwich tightly in aluminum foil and let steam for at least 3 minutes and up to five—the longer the steam, the softer the sandwich.\nSerious Eats / Amanda Suarez\nServe with ketchup (if using), either alongside for dunking or on the sandwich itself, depending on preference.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nSlotted spatula, paper towels, aluminum foil\nNotes\nFor the most efficient execution of the recipe, you can carefully wrap the kaiser roll in foil and heat in a low oven or toaster oven while cooking the pork and eggs. Then unwrap to dip the bread in the fat and assemble the sandwich before rewrapping.\nMake-Ahead and Storage\nYeah, that’s a hard no.\nBreakfast Sandwich\nThe Latest\nAmerican\nHam"
}