{
  "url": "https://www.seriouseats.com/pork-croquettes-with-sauce-gribiche-8727448",
  "image_url": "https://www.seriouseats.com/thmb/tuT6oiFgPiV4q2NZ_A8wAZMrxLk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241015-PorkCroquettesWithSauceGribiche-AmandaSuarez-10-7b19d52b67a54fb6bc123ea93e06511d.jpg",
  "tags": [
    "Mains",
    "The Latest",
    "French",
    "Pork Mains"
  ],
  "title": "Pork Belly Croquettes With Sauce Gribiche",
  "full_text": "Pork Belly Croquettes With Sauce Gribiche\nClose\nJump to recipe\nCook\n5 hrs 30 mins\nChilling Time:\n12 hrs\nTotal\n17 hrs 30 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(1.36kg) meaty boneless\npork belly\n, with or without skin\n1\nmedium\nyellow onion\n, cut into large dice\n1\nmedium\ncarrot\n, cut into large dice\n1\nlarge\ncelery rib\n, cut into large dice\n4\nsprigs\nthyme\n3\nmedium\ncloves garlic\n5\nwhole\nblack\npeppercorns\n2\nbay leaves\n1\ntablespoon\nkosher salt,\nplus more as needed\n1/2\ncup\nall-purpose flour\n(2.25 ounces; 64g)\n3\nlarge\neggs\n, beaten (about 2/3 cup)\n2\ncups\npanko breadcrumbs\n(5 ounces; 145g), roughly crushed by hand if very large\nVegetable\nor other neutral\noil\n, for frying\nOne recipe\nSauce Gribiche\nDirections\nIn a large pot, combine pork belly with onion, carrot, celery, thyme, garlic, black peppercorns, and bay leaves. Add enough cold water to cover, add 1 tablespoon salt, and bring to a simmer over medium-high heat. Lower heat to maintain simmer and cook, topping up with extra boiling water if needed, until pork can easily be pierced with a fork, about 5 hours.\nSerious Eats / Amanda Suarez\nTransfer pork to a rimmed baking sheet and let cool slightly; discard poaching liquid and aromatics. Using your hands and/or forks, shred pork belly meat and fat well. Season to taste with salt and pepper, mixing to incorporate well.\nSerious Eats / Amanda Suarez\nStretch a roughly 2-foot length of plastic wrap on a work surface and transfer shredded pork to it in a long mound (it's okay if some of the liquid fat stays behind; save it for another use, like frying potatoes). Wrap plastic around the mound lengthwise; wrap with a second long sheet of plastic, if necessary, to contain the mound of shredded pork and its juices well. Holding the ends of the plastic, spin the loose cylinder to tighten the ends and compress it into a tight cylinder. Set on a clean rimmed baking sheet and refrigerate until fully set, at least 12 hours.\nSerious Eats / Amanda Suarez\nSpread flour, egg, and panko breadcrumbs in 3 separate shallow bowls. Carefully remove plastic and slice pork roll into four roughly 1-inch thick discs (you can cut fewer discs or more, depending on your yield and how many servings you want to cook at once; refrigerate any remaining pork roll for later).\nSerious Eats / Amanda Suarez\nWorking with 1 disc at a time and using separate hands for the wet and dry elements of the breading, dredge the pork discs first in flour, making sure to coat it completely before shaking off excess. Then dip in egg, turning to coat. Finally, press into the panko breadcrumbs, turning the disc and using your dry hand to press them all over until fully coated. Transfer to a platter or baking sheet and repeat with remaining discs.\nSerious Eats / Amanda Suarez\nIn a large cast iron pan or stainless-steel saute pan, heat about 1/2 inch oil to 340°F (170°C), then carefully lower breaded pork discs into oil and fry, turning once, until golden brown on both sides, about 8 minutes total. Transfer to paper towels to drain and season lightly with salt. (If making more pork discs at once, fry in batches and keep the earlier batches warm in a low 200°F oven).\nSerious Eats / Amanda Suarez\nSpoon gribiche onto serving plate, spreading it in a generous circle. Set a fried pork disc on top of each plate and serve.\nSerious Eats / Amanda Suarez\nNotes\nThis recipe makes a sizeable enough chilled pork roll that you cut many servings from it; feel free to make as many servings as you need at a time, while reserving the remaining pork roll for later.\nMake-Ahead and Storage\nThe pork roll can be kept wrapped and chilled in the refrigerator for up to 5 days.\nMains\nThe Latest\nFrench\nPork Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pork-belly-croquettes-with-sauce-gribiche.webp?"
}