{
  "url": "https://www.seriouseats.com/pork-and-chives-dumpling-filling",
  "image_url": "https://www.seriouseats.com/thmb/APFNj62gmesQpaI46EsBftYgBwM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/pork-and-chives-dumpling-filling-hero-03-QiAi-4fe8e98b6371461bbd1316ce4093e27c.JPG",
  "tags": [
    "Hors D'Oeuvres",
    "Chinese",
    "Pork"
  ],
  "title": "Pork and Chives Dumpling Recipe",
  "full_text": "Pork and Chives Dumpling Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n10 mins\nActive\n20 mins\nTotal\n40 mins\nServes\n6\nto 8 servings\nMakes\n40 dumplings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1/2\npound\n(\n225\ng\n)\nChinese chives\n, finely sliced (see notes)\n1/2\npound\n(\n225\ng\n)\nground pork\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal kosher\nsalt\n, or more to taste; for table salt, use half as much by volume or the same weight\n1\ntablespoon\n(\n12\ng\n)\nsugar\n, or more to taste\n2\nteaspoons\nShaoxing rice wine\n2\ntablespoons\n(\n30\nml\n)\npork stock\nor water\n1\nteaspoon\n(\n5\ng\n)\nginger\n, minced or grated\n40\nround\ndumpling wrappers\nDirections\nIn a medium bowl, combine oil, chives, ground pork, salt, sugar, rice wine, pork stock or water, and ginger and mix together until thoroughly combined. To taste for seasoning, place a 1/2 teaspoon-sized amount of filling on a microwaveable plate and microwave until cooked, about 10 seconds. Taste, then adjust mixture with more salt or sugar. If not using immediately, cover bowl with plastic wrap and refrigerate until you are ready to use, up to 24 hours.\nSerious Eats / Qi Ai\nWorking one dumpling at a time, place approximately 1 tablespoon of filling in the center of each wrapper. Use your finger to spread a small amount of water around the inside edge of each wrapper. Seal wrappers by folding in half and, if desired, pleat one side 5 or 6 times, pinching the edges together as you go. Place sealed dumplings on a parchment-lined baking sheet, separating them to avoid sticking, and cover entire tray with a clean, damp dishtowel.\nSerious Eats / Qi Ai\nLine a bamboo steamer with wilted cabbage or lettuce leaves, or create a\nparchment liner\n. Place dumplings in steamer, leaving a small gap between each one, and place over a wok filled with simmering water. Steam until skins are translucent and filling is cooked through, 7 to 9 minutes. Serve immediately with dipping sauce of choice alongside.\nSerious Eats / Qi Ai\nNotes\nChinese chives can be found in most Chinese grocers. If unavailable, substitute a mixture of sliced regular chives and finely sliced scallions.\nThis recipe can be made using\nhomemade dumpling wrappers\n. Simply sub in the pork and chives dumpling filling, as described above, and then start at Step 4 of the homemade dumpling wrapper recipe.\nRead More\nChinese Fried Pork and Cabbage Dumplings With Homemade Wrappers (Guo Tie) Recipe\n17 Recipes for a Homemade Dumpling Feast\nBeyond Potstickers: Around the World in Dumplings\nHors D'Oeuvres\nChinese\nPork"
}