{
  "url": "https://www.seriouseats.com/pork-ginger-buta-shogayaki-recipe-5208113",
  "image_url": "https://www.seriouseats.com/thmb/7nfxdBHKqyF1wx5QjasiN0rTuIc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210930-pork-ginger-vicky-wasik-10-2681823b1af146d6b150cffcb5b95716.jpg",
  "tags": [
    "Japanese",
    "Pork Shoulder",
    "Pork Stir-Fry",
    "Quick Dinners",
    "Pork Mains"
  ],
  "title": "Butaniku no Shogayaki (Japanese Ginger Pork)",
  "full_text": "Butaniku no Shogayaki (Japanese Ginger Pork)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nMarinating Time\n15 mins\nTotal\n35 mins\nServes\n2\nto 4 people\nCook Mode\n(Keep screen awake)\nIngredients\n2\n(2-inch) pieces\nfresh ginger\n(\n2 1/2\nounces\n;\n72\ng\n),\n1\npiece\npeeled and grated,\n1\npiece\npeeled and julienned, divided\n2\ntablespoons\n(\n30\nml\n)\nsoy sauce\n2\ntablespoons\n(\n30\nml\n)\nmirin\n1\ntablespoon\n(\n15\nml\n)\nsake\n1/8\nteaspoon\nground\nwhite pepper\n1\npound\n(\n454\ng\n)\npork butt\n, thinly sliced (about 1/8-inch thick; see note)\n2\ntablespoons\n(\n30\nml\n) neutral\noil\n, such as canola, divided\n2\nscallions\n, sliced thinly\nCooked short-grain\nrice\n, for serving\nKizami shoga\n, for garnish (optional, see note)\nDirections\nIn a medium mixing bowl, stir together grated ginger, soy sauce, mirin, sake, and white pepper. Add thinly sliced pork and toss to coat each piece. Let marinate for at least 15 minutes and no more than 30 minutes.\nVicky Wasik\nIn a wok or 10-inch cast iron skillet, heat 1 tablespoon oil over high heat until just starting to smoke. Add half the marinated pork, spreading it out in a single, even layer, and cook without stirring for 1 minute. Stir pork with a wok spatula or tongs, then continue to cook, tossing and stirring, until pork is just cooked through, about 1 minute longer. Transfer pork to plate, then repeat with remaining oil and pork. Return first batch of pork and any juices to the pan.\nVicky Wasik\nAdd julienned ginger and cook, stirring and tossing constantly, until ginger is fragrant, about 30 seconds. Turn off heat, add scallions, tossing and stirring to combine. Serve immediately with rice and kizami shoga.\nVicky Wasik\nSpecial Equipment\nWok or 12-inch cast iron skillet.\nNotes\nThinly sliced pork butt (and loin and belly) can be purchased at Japanese specialty markets or large Asian groceries, such as H-Mart. If thinly sliced pork isn't readily available, you can substitute pork tenderloin, loin, or pork cutlets cut into thin slivers.\nKizami shoga is julienned pickled ginger, which is typically artificially tinted an unnatural red color. It can be purchased at specialty markets and some grocery stores.\nThe sake can be substituted with Shaoxing wine or, in a pinch, a dry white wine.\nMake-Ahead and Storage\nOnce cooked, pork ginger can be stored in an airtight container in the refrigerator for up to one week, but it's best eaten within several days. It's excellent when served cold over hot rice, as a light leftovers lunch.\nJapanese\nPork Shoulder\nPork Stir-Fry\nQuick Dinners\nPork Mains"
}