{
  "url": "https://www.seriouseats.com/pork-roll-rachel-sandwiches-recipe",
  "image_url": "https://www.seriouseats.com/thmb/q7yPwylkGUKkXD118WvPM2lUR7E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130713-pork-roll-rachel-11-01854f639ccd416b93f8901126173367.jpg",
  "tags": [
    "Sandwiches",
    "Stovetop",
    "Pork"
  ],
  "title": "Pork Roll Rachel Sandwiches Recipe",
  "full_text": "Pork Roll Rachel Sandwiches Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n20 mins\nTotal\n35 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6 to 8\nslices\npork roll\n(see note)\n4\nslices\nrye bread\n4\nslices\nSwiss cheese\n1\ncup\ncoleslaw\n1/4\ncup\nThousand Island dressing\n2\ntablespoons\nbutter\nDirections\nHeat a large cast iron or non-stick skillet over medium heat. Stack pork roll slices and cut a single notch from the center to the edge of the stack. Lay pork roll slices in a single layer in the skillet (you may need to work in batches) and fry until browned on both sides, about 4 minutes. Set aside.\nSerious Eats / J. Kenji López-Alt\nAssemble sandwiches: Lay four slices of bread on a cutting board. Place a slice of swiss cheese on each. Divide half of cole slaw evenly between two slices of bread. Top each with half of pork roll. Top each stack of pork roll with half of dressing. Top with remaining cole slaw. Close sandwiches and press gently to compess.\nReduce heat to medium-low or preheat sandwich press to medium. Melt butter in skillet or in sandwich press. Place sandwiches in skillet or press and cook until even golden brown, pressing gently and flipping half way through cooking, about 10 minutes total. Serve immediately.\nSpecial Equipment\nLarge non-stick of cast iron skillet, or a sandwich press\nNotes\nTaylor Pork Roll, also known as Taylor Ham, is a seasoned pork product from New Jersey. It can be ordered online from\njerseyporkroll.com\n. If unavailable, you can also use thin slices of Spam.\nThis Recipe Appears In\nHow to Make Gloriously Fatty Pork Roll Rachel Sandwiches\nSandwiches\nStovetop\nPork"
}