{
  "url": "https://www.seriouseats.com/portokalopita-greek-orange-cake-recipe-11742322",
  "image_url": "https://www.seriouseats.com/thmb/Ut6YfrCisZHlEYAiASWoZFrqshQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250527-SEA-Portokalopita-QiAi-Beauty3-35-1090bf14984441209c128a01f7b3ad01.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Recipes",
    "Desserts",
    "Orange"
  ],
  "title": "This Greek Citrus Pie Is Actually a Cake—and It's Shockingly Simple to Make",
  "full_text": "This Greek Citrus Pie Is Actually a Cake—and It's Shockingly Simple to Make\nClose\nJump to recipe\nCook\n90 mins\nCooling and Resting Time:\n70 mins\nTotal\n2 hrs 40 mins\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Syrup:\n2\ncups\ngranulated sugar\n(\n14.2\nounces\n;\n400\ng\n)\n2\ncups\n(\n480\nml\n)\nwater\nor chai (see notes)\n2/3\ncups\n(\n175\nml\n)\nfresh orange or tangerine juice\n, plus zest (from\n2\nwhole\noranges\nor\n3\nwhole\ntangerines\n)\n2\nteaspoons\n(\n10\nml\n)\norange blossom water\n, optional\n1/2\nteaspoon\npumpkin pie spice\n, optional\n1/2\norange\nor\n1\nwhole\ntangerine\n, cut into 12 pieces (roughly chopped into 1/4-inch to 1/3-inch pieces or sliced thinly into half moons), optional\nFor the Pie:\n450\ng\n(\n1\npound\n)\nstore-bought frozen phyllo sheets\n, defrosted (see notes)\n1\ncup\ngranulated sugar\n(\n7\nounces\n;\n200\ng\n)\nZest\nof\n2\noranges\n4\nlarge\nwhole eggs\n1\ncup\n(\n240\nml\n) plus\n1\ntablespoon\n(\n15\nml\n)\nolive oil\n, divided\n1\ncup\n(\n240\nml\n)\nplain whole-milk yogurt\n(preferably strained Greek-style yogurt)\n2/3\ncups\n(\n175\nml\n)\nfresh orange juice\nfrom\n2\noranges\n(see notes)\n1\ntablespoon\n(\n15\nml\n)\nvanilla extract\n1\ntablespoon\n(\n15\ng\n)\nbaking powder\n1/2\nteaspoon\n(\n2.5\ng\n)\nbaking soda\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nPlain whole-milk strained Greek-style yogurt\n, sour cream, or vanilla ice cream for serving, optional\nDirections\nFor the Syrup:\nIn a medium saucepan, combine sugar, water or tea, orange juice, orange blossom water (if using), pumpkin pie spice (if using), and orange or tangerine pieces (if using). Bring to a boil over high heat, then reduce heat to medium and simmer for 15 minutes. Remove from heat. Set aside and let cool completely.\nSerious Eats /Qi Ai\nFor the Pie\n: Meanwhile, adjust oven racks to upper-middle and lower-middle positions and heat oven to 200°F (95°C). Place two rimmed baking sheets on work surface. Working with 1 phyllo sheet at a time, loosely scrunch phyllo sheet lengthwise like an accordion, and place on rimmed baking sheet, arranging width-wise. Repeat with all phyllo dough sheets evenly distributed among baking sheets arranged width-wise.\nSerious Eats /Qi Ai\nBake both sheets at same time for 15 minutes. Carefully remove baking sheets from oven and flip phyllo sheets using hands. (The phyllo that had direct contact with the baking sheets will be slightly damp, flipping the phyllo dries that side.) Return to oven and continue baking until phyllo is completely dry, about 5 more minutes. Set aside and let phyllo cool on baking sheets.\nSerious Eats /Qi Ai\nUsing oven mitts, carefully re-adjust 1 oven rack to middle position and heat oven to 350°F (175°C). Grease a 9-by-13-inch baking dish with 1 tablespoon oil.\nSerious Eats /Qi Ai\nOnce phyllo is cool, in a small bowl, combine sugar and orange zest and use your fingers to rub together until mixture is fragrant, about 30 seconds. Set aside.\nSerious Eats /Qi Ai\nIn a large bowl, add eggs and remaining 1 cup oil and whisk to combine. Add yogurt, orange juice, and vanilla and whisk to combine. Whisk in sugar with orange zest mixture, baking powder, baking soda, and salt and whisk until fully combined.\nSerious Eats /Qi Ai\nTo egg mixture in large bowl, add dried phyllo in batches of 2 to 3 pieces at a time by breaking each piece into 2 to 3 smaller pieces, then add to large bowl and use a spatula to smash and crunch phyllo as you fold it into the wet ingredients. Continue folding and smashing until pieces range from 2 inches to bite-size and all phyllo is incorporated into egg mixture; do not overmix.\nSerious Eats /Qi Ai\nTransfer batter to greased baking pan, and use a spatula to smooth it into an even layer. Refrigerate for 10 minutes. Once batter has rested, bake until cake is deep golden brown on top and cake tester or paring knife inserted in center comes out clean, 40 to 50 minutes.\nSerious Eats /Qi Ai\nLet pie rest for 2 minutes, then quickly prick the surface with a paring knife or toothpick in approximately 2-inch increments. Using a ladle or large spoon, gently pour half of cooled syrup evenly over pie and use a pastry brush to brush evenly over top. You may hear the syrup lightly hissing as it touches the hot pie. Let syrup absorb into cake for 1 minute, then pour remaining syrup over pie. Alternatively, you can reserve a small amount (about 1/2 cup) of syrup for garnish. If you candied pieces of orange while making the syrup, use them to decorate pie.\nSerious Eats /Qi Ai\nLet pie cool for at least 1 hour and up to 24 hours before serving. Serve with yogurt, vanilla ice cream, or sour cream, if desired.\nSerious Eats /Qi Ai\nSpecial Equipment\n1 small saucepan, two rimmed baking sheets, rasp grater such as a Microplane or zester, 9-by-13-inch baking pan or dish, ladle or large spoon, pastry brush\nNotes\nThe syrup can be made with water or chai (regular or decaffeinated). I prefer the warm spice flavor of chai.\nBoxed phyllo dough sold in the US often contains stabilizers and starches. Look for a brand with fewer ingredients, as this results in a more flavorful dough.\nMake sure to use fresh orange juice in this recipe.\nMake-Ahead and Storage\nThis pie is excellent, if not better, 12 to 24 hours after it is made. Store at room temperature, covered with plastic wrap or foil, for up to 3 days.\nCakes\nThe Latest\nRecipes\nDesserts\nOrange"
}