{
  "url": "https://www.seriouseats.com/potato-croquettes-recipe-5217324",
  "image_url": "https://www.seriouseats.com/thmb/UkmIzxxyourVmnKQvGLpCD1Elq8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220202-croquettes-vicky-wasik-29-3f3cabf699694ee889a72693e9da0cf9.jpg",
  "tags": [
    "Potatoes",
    "The Latest"
  ],
  "title": "Potato Croquettes",
  "full_text": "Potato Croquettes\nClose\nJump to recipe\nCook\n60 mins\nChilling Time\n60 mins\nTotal\n2 hrs\nServes\n4\nto 6 servings\nMakes\n28 potato croquettes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Béchamel:\n1 tablespoon plus 2 teaspoons (\n22\ng\n)\nunsalted butter\n1 tablespoon plus 2 teaspoons (\n14\ng\n)\nall-purpose flour\n1/2\ncup\n(120ml)\nwhole milk\nKosher salt\nand freshly ground black pepper\nFreshly grated nutmeg\n, to taste\nFor the Potato Croquettes:\n1\npound\n(455g)\nYukon Gold potatoes\n(2 to 3 medium potatoes), peeled and cut into 1-inch cubes\n2\nquarts\n(1.9L)\ncold water\n2\nteaspoons\n(8g) Diamond Crystal\nkosher salt\n, plus more to taste; for table salt use half as much by volume or the same weight\n3\ntablespoons\n(45g)\nunsalted butter\n, melted\nFreshly ground black pepper\nCayenne pepper\n, to taste (optional)\n1/2\ncup\n(65g)\nall-purpose flour\n, transferred to a shallow bowl\n2\nlarge\neggs\n(100g), beaten in a shallow bowl\n2\ncups\n(140g)\npanko breadcrumbs\n, finely ground in a food processor and transferred to a shallow bowl\n2\nquarts\n(2L)\nvegetable oil\n, for frying\nDirections\nFor the Béchamel:\nIn a small saucepan, melt butter over medium-high heat until foaming. Add flour and whisk to form a paste. Lower heat to medium and cook, whisking constantly, until raw flour smell is gone but flour has not browned, about 1 minute. While whisking constantly, slowly pour milk in a thin, steady stream until all of it has been added, and continue to cook, stirring often, until béchamel is thick enough to coat the back of a spoon, about 2 minutes. Season with salt, pepper, and nutmeg to taste. Transfer to small bowl and cover with plastic wrap, pressing plastic against surface to prevent a skin from forming. Set aside.\nVicky Wasik\nFor the Potato Croquettes:\nIn a 3-quart saucepan, combine potatoes, water, and salt. Bring to a boil over high heat, then reduce heat to maintain a simmer. Cook until potatoes are tender and offer little resistance when pierced with a paring knife, about 10 minutes. Drain potatoes, then transfer back to now-empty saucepan.\nVicky Wasik\nSet saucepan over low heat, shaking saucepan constantly, until moisture has evaporated from potatoes, about 1 minute.\nVicky Wasik\nPass potatoes through a ricer into a medium bowl, then allow them to cool slightly, about 2 minutes. Using a flexible spatula, stir in butter and season with salt, pepper, and cayenne pepper (if using) to taste. Stir in béchamel until thoroughly combined, about 1 minute.\nVicky Wasik\nLine rimmed baking sheet with parchment paper. Using a 1-tablespoon cookie scoop or measuring spoon, scoop potato-béchamel mixture onto prepared baking sheet; you should have 28 portions. Using your hands, roll each portion into a ball between your palms (dough should be soft but not sticky) and return to prepared baking sheet. Cover loosely with plastic wrap and refrigerate until thoroughly chilled, at least 1 and up to 12 hours.\nVicky Wasik\nPosition bowls with flour, eggs, and breadcrumbs next to prepared baking sheet. Working with one ball at a time, roll ball completely in flour, transfer to beaten eggs and roll to coat on all sides, then place in breadcrumbs, turning to coat completely. Return to prepared baking sheet and repeat breading process with remaining balls. Transfer baking sheet with breaded croquettes to refrigerator.\nVicky Wasik\nAdjust oven rack to middle position and preheat oven to 200°F (95°C). Set a wire rack inside a rimmed baking sheet and line with paper towels. In a Dutch oven, heat oil over medium-high heat to 340°F (170°C). Working in batches of 7, carefully add breaded croquettes to hot oil using a spider or slotted spoon. Fry, turning pieces as they cook, until golden brown on all sides, about 1 1/2 minutes. Transfer croquettes to prepared wire rack, season with salt, and transfer to oven to keep warm.\nVicky Wasik\nReturn oil to 340°F (170°C) and repeat frying with remaining breaded croquettes, continuing to work in batches of 7. Transfer croquettes to a serving bowl and serve immediately.\nVicky Wasik\nSpecial Equipment\nPotato ricer\n,\nrimmed baking sheet\n,\nwire rack\n,\ncolander\n,\nspider skimmer\nor\nslotted spoon\n,\nDutch oven\n,\ninstant-read thermometer\n, 1 tablespoon cookie scoop\nMake-Ahead and Storage\nBechamel can be prepared ahead of time and refrigerated in an airtight container for up to 3 days.\nPotato croquettes are best enjoyed immediately.\nPotatoes\nThe Latest"
}