{
  "url": "https://www.seriouseats.com/potato-cups-with-pulled-pork-and-cheddar-recipe",
  "image_url": "https://www.seriouseats.com/thmb/TbWP3oc7zjol_24d13Z-ChlNtmY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__10__20191028-crispy-potato-cups-vicky-wasik-24-e3ff7b25bebd47abafe8e4f8c479580f.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Fried Potatoes",
    "Cheddar Cheese",
    "Pork",
    "Yukon Gold Potatoes"
  ],
  "title": "Deep-Fried Potato Skins With Pulled Pork and Cheddar Recipe",
  "full_text": "Deep-Fried Potato Skins With Pulled Pork and Cheddar Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n65 mins\nActive\n45 mins\nCooling Time\n10 mins\nTotal\n90 mins\nServes\n10 potato-skin cups\nCook Mode\n(Keep screen awake)\nIngredients\n5\nYukon Gold potatoes\n, ideally about\n5 to 6 ounces (140 to 170 g\n) each (though larger potatoes will also work)\nVegetable or\ncanola oil\n, for greasing the potatoes and deep-frying\nKosher salt\n1 1/2\ncups\npulled pork\n(you can use any of our recipes:\ntraditional barbecue\n,\neasy oven pulled pork\n, or\nsous vide\n)\nGrated cheddar cheese\n, for topping\nDirections\nPreheat oven to 375°F (190°C). Using a fork or paring knife, puncture potatoes in several spots. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until just tender, 30 to 45 minutes. Alternatively, microwave pricked and oiled potatoes until just tender, about 5 minutes.\nLet potatoes stand until cool enough to handle, then cut in half across their equators. Using a small spoon, scoop out most of the potato flesh into a medium bowl, leaving a layer of potato flesh roughly 1/8 to 1/4 inch thick still attached to the skin. (It's okay if the layer of potato flesh attached to the skin isn't perfectly even; that unevenness can add some good textural contrast to each cup.) If you want the cups to stand up more easily, slice off the very bottom of each one to create a level base. Set potato cups aside.\nUsing a blender or immersion blender, process scooped potato flesh into a slurry, adding just enough water to form a purée the consistency of applesauce. (You need only enough potato slurry to lightly coat each scooped potato cup, so you may want to purée only a portion of the scooped flesh and reserve the rest for a small batch of\nmashed potatoes\n.)\nLine a rimmed baking sheet with paper towels. In a 5-quart Dutch oven or large wok, heat 2 1/2 inches oil over high heat until it reaches a temperature of 365°F (185°C). Working in batches, dip each scooped potato cup in the potato slurry to coat it inside and out; allow the excess slurry to drain off, then carefully lower each potato cup into the hot oil. Because the slurry is so wet, the frying will be very vigorous, so be careful not to fry more than a few at a time.\nCook, agitating occasionally with a wire mesh spider, until potatoes just begin to turn lightly golden, about 1 minute. Transfer to paper towel–lined baking sheet, inverting each one, concave side down, to allow it to fully drain. Repeat dipping and frying with remaining potato cups. Using a fine-mesh strainer, skim out any free-floating fried bits of slurry from the oil and discard.\nWhen ready to serve, fry the potato cups in batches a second time, agitating them with a wire mesh spider, until deeply golden brown and crispy all over, inside and out, about 3 minutes. Transfer to fresh paper towels to drain, seasoning all over with salt on all sides before turning cup-side-down to fully drain.\nLine a rimmed baking sheet with aluminum foil and arrange the potato cups on it, concave side up. (If you didn't trim the bottoms of the cups, you can scrunch up the foil around the base of each cup to help keep them upright.) Fill each cup with a heaping scoop of pulled pork, then top them all with grated cheddar cheese. Return to the 375°F (190°C) oven until the pork is heated through and the cheese is melted, about 5 minutes. Serve.\nSpecial Equipment\nDutch oven\nor\nwok\n, wire mesh spider,\nprobe\nor\ninstant-read thermometer\n,\nrimmed baking sheet\n,\nwire rack\n(optional),\nblender\nor\nimmersion blender\nMake-Ahead and Storage\nAfter the first frying step, you can allow the potatoes to fully cool, then refrigerate them overnight or freeze them for up to 2 months before frying a second time from chilled or frozen.\nThis Recipe Appears In\nIt’s Always Fry-Day: Crispy Potato Cups Put Potato Skins to Shame\nSnacks & Appetizers\nFried Potatoes\nCheddar Cheese\nPork\nYukon Gold Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/deep-fried-potato-skins-with-pulled-pork-and-cheddar-recipe.webp?"
}