{
  "url": "https://www.seriouseats.com/potato-knish-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Kkek-M0UgnnHOx-CAJNO2Ze7tlw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/potato-knish-recipe-hero-09-fulldish-3206dfb302e943df9e9683f567e863ed.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Vegetarian Snacks & Appetizers",
    "Baking",
    "Russet Potatoes"
  ],
  "title": "Potato Knish Recipe",
  "full_text": "Potato Knish Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n45 mins\nResting and Cooling Time\n85 mins\nTotal\n2 hrs 40 mins\nServes\n8 knishes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n2 1/2\ncups\n(\n12 1/2\nounces\n)\nall-purpose flour\n1\nteaspoon\nbaking powder\n1/2\nteaspoon\nkosher salt\n1\nlarge\negg\n, beaten\n1/2\ncup\nvegetable oil\n1\nteaspoon\nlemon juice\nfrom\n1\nlemon\n1/2\ncup\nwater\nFor the Filling:\n1\npound\nrusset potatoes\n, peeled and cut into 1 inch pieces (about\n2\nmedium\n)\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\nbutter\n1/2\ncup\nfinely sliced\nscallion\nwhites and greens (about\n4\nscallions\n)\n1\nlarge\negg\n, beaten\nDirections\nFor the Dough:\nIn a large bowl combine flour, baking powder, and salt and whisk to combine. In a separate bowl whisk together egg, vegetable oil, lemon juice, and water. Pour wet ingredients over dry and using a wooden spoon mix until a dough forms. Using your hands knead until dough comes together and is smooth, about 1 minute. Wrap dough tightly with plastic wrap and let sit for 1 hour at room temperature or up to overnight in the refrigerator. Allow to come to room temperature before proceeding.\nSerious Eats / Qi Ai\nFor the Filling:\nIn a large pot cover the potatoes with water, season well with salt, and bring to a simmer. Cook until potatoes are easily pierced with a knife, about 10 minutes. Drain potatoes and let dry for a few minutes before adding the butter and mashing until almost smooth. Add scallions and mix, then season to taste with salt and pepper. Allow to cool to room temperature.\nSerious Eats / Qi Ai\nAdjust oven rack to middle position and preheat to 375°F. Line a baking sheet with foil or parchment paper.\nSerious Eats / Qi Ai\nTurn dough out onto a floured surface. Divide dough in half and roll it out into a wide, thin rectangle, less than 1/4-inch thick. Using half the filling, form a log of filling along the bottom long edge of the dough, roll the dough up, and then cut into four equal portions. Seal and pinch dough around filling on one end of each portion, and set on a parchment-lined baking sheet. Press each portion down a little to flatten slightly. Repeat process with remaining dough and filling to form a total of 8 knishes, then brush all portions with beaten egg. Bake until golden, about 45 minutes. Serve immediately.\nSerious Eats / Qi Ai\nSpecial Equipment\nBaking sheet\nHors D'Oeuvres\nVegetarian Snacks & Appetizers\nBaking\nRusset Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/potato-knish-recipe.webp?"
}