{
  "url": "https://www.seriouseats.com/potato-wedges-recipe-5217319",
  "image_url": null,
  "tags": [
    "Vegetable Sides",
    "Roasted Potatoes",
    "Potatoes",
    "The Latest"
  ],
  "title": "Crispy Baked Potato Wedges",
  "full_text": "Crispy Baked Potato Wedges\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nCooking spray\n, for the baking sheet\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n2 1/2\npounds\n(\n1.1\nkg\n)\nrusset potatoes\n, washed and scrubbed\n2\nquarts\n(\n1.9\nL\n)\nwater\n2\ntablespoons\n(\n25\ng\n) Diamond Crystal\nkosher salt\n, plus extra for seasoning; for table salt use half as much by volume or an equal amount by weight\n1/2\nteaspoon\nbaking soda\nFreshly\nground black pepper\nDirections\nAdjust oven rack to lower position and preheat oven to 450°F (230°C). Spray a rimmed baking sheet with cooking spray. Pour oil over baking sheet and tilt until evenly coated with oil. Using a sharp knife, halve potatoes lengthwise. Place potato halves cut side down on cutting board and cut lengthwise into 1- to 1 1/2-inch-thick wedges (3 to 4 wedges per half potato, depending on size).\nVicky Wasik\nIn a large pot, bring water to a boil over high heat. Add salt, baking soda, and potatoes and stir to combine. Return to a boil, then reduce heat to a simmer, and cook until potatoes are barely tender, offering some resistance when poked with a paring knife or cake tester (the texture should be similar to that of a firm poached pear or lightly cooked apple), about 7 minutes from when potatoes are added to the pot. Drain potatoes, taking care not to break the wedges, and transfer to a large bowl.\nVicky Wasik\nSeason potatoes with salt and pepper and toss to coat, shaking bowl roughly, until a thick layer of mashed potato–like paste has built up on the surface of the wedges. Transfer wedges to prepared baking sheet, arranging them in a single layer with one flat cut side down, and space between each piece.\nVicky Wasik\nTransfer to oven and roast, without moving, until potatoes are golden brown on bottom side, 18 to 22 minutes. Using a thin, flexible metal spatula, flip potatoes onto second flat cut side and continue to roast until golden brown on second side, 18 to 22 minutes longer.\nVicky Wasik\nTransfer baking sheet to a heatproof surface, season wedges with salt and pepper to taste, and toss on baking sheet to evenly coat. Transfer to a paper towel-lined plate and blot away excess oil. Discard paper towels and serve with your favorite condiments.\nVicky Wasik\nSpecial Equipment\nRimmed baking sheet\nMake-Ahead and Storage\nPotato wedges are best enjoyed immediately. Leftovers can be refrigerated in an airtight container for up to 3 days.\nVegetable Sides\nRoasted Potatoes\nPotatoes\nThe Latest"
}