{
  "url": "https://www.seriouseats.com/potato-doughnuts-recipe-5220154",
  "image_url": "https://www.seriouseats.com/thmb/crVTvKZ_TRUBIUZiW4Rhr25aXNI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/PotatoDoughnuts-Beauties-5-c2aea5bfab124ad0bd0d58cb176d195c.JPG",
  "tags": [
    "Potatoes",
    "Frying",
    "Doughnuts",
    "Hanukkah Desserts",
    "The Latest"
  ],
  "title": "Potato Doughnuts",
  "full_text": "Potato Doughnuts\nClose\nJump to recipe\nPrep\n20 mins\nCook\n35 mins\nCooling Time\n10 mins\nTotal\n65 mins\nServes\n12 servings\nMakes\n12 3-inch doughnuts\nCook Mode\n(Keep screen awake)\nIngredients\n1.4\nounces\n(\n40\ng\n; about\n3\ntablespoons\n)\nunsalted butter\n12\nounces\nrusset potatoes\n(\n340\ng\n; about\n2\nmedium\npotatoes\n), peeled and cut into 1-inch cubes\n12.5\nounces\nall-purpose flour\n(\n355\ng\n; about\n2 3/4\ncups\n), such as Gold Medal\n2\nteaspoons\n(\n8\ng\n)\nbaking powder\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nground nutmeg\n4.6\nounces\n(\n130\ng\n;\n2/3\ncup\n)\nsugar\n2\nlarge\neggs\n(\n3 1/2\nounces\n;\n100\ng\n)\n2\nounces\n(\n55\ng\n;\n1/4\ncup\n)\nwhole milk\n2\nounces\n(\n55\ng\n;\n1/4\ncup\n)\ncultured lowfat buttermilk\n, well-shaken\n1 1/2\nteaspoons\n(\n7\ng\n)\nvanilla extract\nPowdered sugar or\ncinnamon sugar\n, for dusting (see note)\n2\nquarts\n(\n1.9\nL\n)\nrefined coconut oil\n, such as Nutiva, for frying\nDirections\nIn a small stainless-steel saucier or saucepan, melt butter over medium-low heat. Increase heat to medium and bring to a simmer. Cook, stirring frequently with a heat-resistant spatula, scraping up brown bits that form on bottom, until foaming subsides and butter is golden and milk solids are chestnut brown, about 3 minutes. Transfer to a large heatproof bowl; set aside.\nDebbie Wee\nPlace potatoes in a medium bowl and cover with cool water. Using your hands, swish potatoes until water turns cloudy, about 30 seconds. Using a colander, drain potatoes, discarding the cloudy soaking water. Return potatoes to bowl, refill with cool water, and repeat rinsing process until water runs clear.\nDebbie Wee\nTransfer drained potatoes to a 3-quart saucepan and add 1 quart (945ml) cold water so that potatoes are just submerged. Bring to a boil over high heat, then reduce heat to maintain a simmer. Cook until potatoes are tender and offer little resistance when pierced with a paring knife, about 10 minutes. Drain potatoes in colander, then rinse under hot running water for 30 seconds to wash away excess starch.\nDebbie Wee\nReturn drained potatoes to now-empty saucepan. Set over low heat and cook, shaking saucepan constantly, until surface moisture has evaporated from potatoes, about 1 minute.\nDebbie Wee\nPass potatoes through a ricer or food mill onto a rimmed baking sheet, spreading them into an even layer to allow them to cool slightly. Set aside.\nDebbie Wee\nLine a rimmed baking sheet with parchment paper. In a medium bowl, whisk together flour, baking powder, salt, baking soda, and nutmeg until well combined, about 1 minute. Set aside.\nDebbie Wee\nAdd sugar and eggs to bowl with cooled brown butter and whisk until smooth, fluffy, and light in color, about 1 minute. Whisk in milk, buttermilk, vanilla extract, and 5 ounces (140g; 1 lightly packed cup) riced potatoes until well combined; reserve remaining potatoes for another use.\nDebbie Wee\nAdd flour mixture to potato mixture. Using a flexible spatula, stir until no dry flour remains and a soft, slightly sticky, shaggy dough forms, about 1 minute.\nDebbie Wee\nTurn dough out onto a floured surface and, using floured hands, knead until dough is mostly smooth and no longer sticks to your hands, about 45 seconds. Dust work surface, dough, and hands with more flour as needed throughout the kneading process.\nDebbie Wee\nLightly dust work surface with flour. Using a rolling pin, roll out dough into a 1/2-inch-thick circle. Using a 3-inch round cutter, stamp out doughnuts, dipping the cutter in flour as needed to keep dough from sticking. Transfer doughnuts to prepared baking sheet; you may need to slide an offset spatula under the cut-out circles of dough to loosen them from work surface. Using a 1-inch round cutter, cut out rounds from the center of each doughnut to form a ring, dipping the cutter in flour as needed. Gather scraps, knead briefly, and repeat rolling and cutting out doughnuts with the leftover dough; discard any remaining dough.\nDebbie Wee\nPrepare a small fine-mesh strainer with powdered sugar set in a bowl, or fill a shallow bowl with cinnamon sugar. Set a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels. In a large Dutch oven, heat oil over medium-high to 365°F (185°C). Working in batches of 4, carefully add doughnuts to hot oil, dropping doughnuts from as close to the oil’s surface as possible to minimize splashing. Fry, using a spider or slotted spoon to flip doughnuts halfway through, until golden brown on all sides, about 2 minutes. Transfer doughnuts to prepared wire rack.\nDebbie Wee\nReturn oil to 365°F (185°C) and repeat frying process with remaining doughnuts, continuing to work in batches of 4.\nDebbie Wee\nWhen doughnuts are cool enough to handle, dust with powdered sugar or dip in cinnamon sugar, turning to coat on all sides. Transfer doughnuts to a serving platter and enjoy immediately.\nDebbie Wee\nSpecial Equipment\nPotato ricer\n,\nrimmed baking sheet\n,\ncolander\n,\nspider skimmer\nor\nslotted spoon\n,\nDutch oven\n,\ninstant-read thermometer\n,\nrolling pin\n, round cutters\nNotes\nTo make cinnamon sugar, combine 1 cup (200g; 7 ounces) sugar and 2 teaspoons ground cinnamon in a wide shallow bowl. Whisk until well combined.\nMake-Ahead and Storage\nPotato doughnuts are best enjoyed the same day they’re made.\nPotatoes\nFrying\nDoughnuts\nHanukkah Desserts\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/potato-doughnuts.webp?"
}