{
  "url": "https://www.seriouseats.com/pozole-mexican-red-chile-pork-soup-recipe-8732258",
  "image_url": "https://www.seriouseats.com/thmb/ek6hu9MdD0tyxpMWUnZIVHcTJkQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241017-Pozole-RojoLorena-Masso-2024hero-5814c040ab3b4e8d8dcf7b0a031d39bb.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Mexican",
    "Pork"
  ],
  "title": "Pozole Rojo",
  "full_text": "Pozole Rojo\nClose\nJump to recipe\nPrep\n15 mins\nCook\n3 hrs\nTotal\n3 hrs 15 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork and Broth:\n3\npounds\nboneless\npork shoulder\n, trimmed of excess fat and cut into 2-inch cubes\n1\nt\nablespoon\nDiamond Crystal kosher salt\n, plus more for seasoning; for table salt, use half as much by volume\nFreshly\nground\nblack pepper\n1\npound\npig’s feet\n(optional)\n1 whole\nwhite onion\n, peeled, ends trimmed (8 ounces;\n227\ng)\n5\nmedium\ncloves garlic,\npeeled and left whole\n2\nbay\nleaves\nFive 15-ounce cans white\nhominy\n(75\nounces\ntotal weight), drained and rinsed\nFor the Chile Sauce:\n5\nguajillo\nchiles\n, stems and seeds removed\n4\nCalifornia\nchiles\n, stems and seeds removed\n2\nancho\nchiles,\nstems and seeds removed\n1/2\nwhite\nonion\n, trimmed, halved, and roughly chopped (4 ounces; 113g)\n5\nmedium\ncloves garlic,\nroughly chopped\n1\ntablespoon\nchicken bouillon powder\nsuch as Knorr brand or substitute with 1 teaspoon Diamond Crystal kosher salt\n1\nteaspoon\nwhole black peppercorns\n1\nt\neaspoon\ncumin seeds\nFor Serving:\nDiced\nwhite\nonion\nThinly\nsliced\nradish\nThinly\nsliced\ncabbage\nCubed\na\nvocado\nDried\nMexican\noregano\nC\nr\nem\na\nTostadas\nor\nchicharrón\nLime\nwe\ndges\nDirections\nFor the Pork and Broth:\nGenerously season pork shoulder all over with salt and pepper. In a large stockpot or large Dutch oven, add the pork shoulder, pig’s feet, if using, onion, garlic, and bay leaves. Add 2 1/2 quarts of water and 1 tablespoon salt. Bring to a boil over high heat, then reduce heat to low and cook, covered, adjusting heat as needed and occasionally skimming any scum and fat that rises to the surface, until a richly flavored broth is created and pork is just beginning to turn tender, about 1 hour.\nSerious Eats / Lorena Masso\nFor the Sauce:\nMeanwhile, in a high-walled stainless-steel skillet, toast chiles over medium-low heat until aromatic, turning occasionally, about 2 minutes. Add 2 cups of water, bring to a boil, then immediately turn off heat and soak chiles until softened, about 5 minutes.\nSerious Eats / Lorena Masso\nIn a blender, blend the chiles with their soaking water, garlic, onion, black peppercorns, cumin seeds, and chicken bouillon powder until smooth, about 1 minute. Season with salt to taste.\nSerious Eats / Lorena Masso\nAfter the pork has cooked for 1 hour in step 1, add the hominy and pour the blended chile sauce into the pork and broth mixture through a fine mesh strainer. Continue to cook on low heat, covered, adjusting heat as needed to maintain a gentle simmer until pork is fork-tender (broth yield should be about 2 1/2 quarts), about 2 more hours. Discard pig’s feet, onion, and bay leaves. Use a ladle to skim off any excess fat, if needed. Season to taste with salt.\nSerious Eats / Lorena Masso\nFor Serving:\nLadle into individual serving bowls and serve with toppings (onion, radish, cabbage, avocado, oregano, and lime juice) on the side to be added at the table. Tostadas can be shattered into the soup or slathered in crema and eaten on the side.\nSerious Eats / Lorena Masso\nSpecial Equipment\nBlender, large stockpot or large Dutch oven, skimmer, fine-mesh strainer\nNotes\nCanned hominy can be found in the Mexican aisle of most well-stocked supermarkets.\nThis recipe can easily be doubled if; if doubling, you will need a very large stockpot, or need to cook in 2 separate batches.\nMake-Ahead and Storage\nThe chile sauce can be made ahead and refrigerated in an airtight container for up to 2 days.\nPozole can be refrigerated in an airtight container for up to 4 days or frozen for up to 3 months.\nSoups\nThe Latest\nMexican\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pozole-rojo.webp?"
}