{
  "url": "https://www.seriouseats.com/pozole-verde-de-pollo-green-mexican-hominy-and-chicken-soup-recipe",
  "image_url": null,
  "tags": [
    "Mexican",
    "Braised & Stewed Chicken",
    "Chicken Legs",
    "Pumpkin Seeds",
    "Hominy"
  ],
  "title": "One-Pot Pozole Verde de Pollo (Green Mexican Hominy and Chicken Soup)",
  "full_text": "One-Pot Pozole Verde de Pollo (Green Mexican Hominy and Chicken Soup)\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n30 mins\nTotal\n65 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Soup:\n3\nounces\npumpkin seeds\n(\n85\ng\n; about\n1/2\ncup\n)\n2 1/2\npounds\nbone-in\nchicken leg\nquarters (\n1.2\nkg\n; about\n3\nleg\nquarters)\n1\npound\ntomatillos\n(\n450\ng\n)\n1\nlarge\nwhite onion\n, roughly chopped\n1\njalapeño\npepper\n, stems and seeds removed, roughly chopped\n1\npoblano\npepper\n, stems and seeds removed, roughly chopped\n1\nAnaheim\npepper\n, stems and seeds removed, roughly chopped\n6\ncups\nhomemade\nor store-bought\nlow-sodium chicken stock\n(\n1.5\nliters\n)\n2\ntablespoons\ndried oregano\n, preferably Mexican (about\n8\ng\n)\n2\nsprigs\nepazote\n(optional)\nSalt\nHandful\nfresh cilantro leaves\nand fine stems\n1\n(28-ounce; 800 g)\nca\nn\nwhite hominy\n, drained (see note)\nTo Serve:\nDiced avocado\nDiced radishes\nThinly sliced serrano or\njalapeño peppers\nChopped fresh cilantro leaves\nFinely chopped white onion\nDirections\nFor the Soup:\nHeat pumpkin seeds in the base of a large Dutch oven over medium-high heat, stirring constantly, until they start to pop and smell nutty, about 4 minutes. Transfer pumpkin seeds to a bowl and set aside.\nSerious Eats / J. Kenji López-Alt\nAdd chicken, tomatillos, onion, peppers, chicken stock, oregano, epazote (if using), and a large pinch of salt to the Dutch oven. Bring to a boil over high heat, then reduce to a bare simmer. Cook, stirring occasionally, until chicken and vegetables are completely tender, about 40 minutes.\nSerious Eats / J. Kenji López-Alt\nUsing tongs, transfer chicken to a large plate or bowl and set aside. Discard epazote sprigs (if using). Set a large fine-mesh strainer over a large bowl and strain the broth through it. Transfer solids to the jar of a blender. Add pumpkin seeds and cilantro to the blender. Blend on high speed until smooth. Set aside.\nUsing a ladle, carefully skim off a few tablespoons of fat from the strained stock and add it to the Dutch oven (it's okay if a little stock gets in as well). Heat over high heat, swirling and stirring until the watery stock completely evaporates and starts to form a browned layer in the bottom of the pan. (It will spatter a bit. The more you stir, the less it will spatter.) As soon as the chicken fat starts to smoke, pour in the contents of the blender all at once and cook, stirring, for about 15 seconds (it will spatter a lot—wear an apron!). Immediately pour in strained chicken stock and fat and stir to combine. Bring to a bare simmer, stir in hominy, season to taste with salt, and keep warm.\nSerious Eats / J. Kenji López-Alt\nBy this stage, the chicken should be cool enough to handle. Discard the skin and bones and shred the meat into bite-size pieces with your fingertips. Stir the picked chicken back into the soup.\nSerious Eats / J. Kenji López-Alt\nTo Serve:\nLadle the hot soup into bowls and garnish with diced avocado and radish, sliced chiles, chopped cilantro, and chopped white onion. Serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nDutch oven\n,\ntongs\n,\nfine-mesh strainer\n,\nblender\nNotes\nYou can use dried hominy in place of canned. Soak dried hominy in water overnight. Drain and cook in fresh water at a gentle simmer until tender, about one and a half hours. Drain and use as directed.\nRead More\nPork and Hominy Soup\nVegan Sweet Potato and 2-Bean Chili With Hominy\nMexican\nBraised & Stewed Chicken\nChicken Legs\nPumpkin Seeds\nHominy"
}