{
  "url": "https://www.seriouseats.com/pressure-cooker-butternut-squash-risotto-sage-brown-butter-quick-easy-recipe",
  "image_url": null,
  "tags": [
    "Rice & Grain Mains",
    "Italian",
    "Pressure Cooker",
    "Sage",
    "Butternut Squash"
  ],
  "title": "Pressure Cooker Butternut Squash Risotto With Frizzled Sage and Brown Butter",
  "full_text": "Pressure Cooker Butternut Squash Risotto With Frizzled Sage and Brown Butter\nJump to recipe\nPrep\n10 mins\nCook\n70 mins\nActive\n60 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3 1/2\npounds\n(\n1.6\nkg\n)\nbutternut squash\n, peeled and seeded\n6\ntablespoons\n(\n90\nml\n)\nextra-virgin olive oil\n, divided\n3\nmedium\ncloves garlic\n, crushed\n1/2\nGolden Delicious apple\n, peeled and cored\nPinch\nred pepper flakes\n2\nsprigs\nsage\nplus\n8\nsage\nleaves\n, divided\nKosher salt\n2\ntablespoons\n(\n30\nml\n)\nmaple syrup\n1\nteaspoon\n(\n5\nml\n) white or yellow\nmiso\n3 3/4\ncups\n(\n900\nml\n)\nhomemade\nor store-bought\nlow-sodium vegetable broth\n, divided\n1\nmedium\nyellow onion\n, minced\n2\ncups\n(\n400\ng\n) risotto rice, such as\narborio\n1/2\ncup\n(\n120\nml\n)\ndry white wine\n4\ntablespoons\n(\n55\ng\n)\nunsalted butter\nParmigiano-Reggiano cheese\n, for grating\nDirections\nPreheat oven to 400°F (200°C). Cut about half the squash into 1-inch chunks, to yield 4 cups. Cut remaining squash into 1/4-inch dice. In a large mixing bowl, toss large squash chunks with 2 tablespoons (30ml) olive oil, garlic, apple, red pepper flakes, sage sprigs, and a large pinch of salt until evenly coated, then spread in an even layer on a rimmed baking sheet. In a separate bowl, toss small diced squash with 2 tablespoons (30ml) olive oil, maple syrup, and a pinch of salt, then spread in an even layer on a second rimmed baking sheet.\nSerious Eats / Vicky Wasik\nBake both trays of squash, stirring once or twice during baking, until large chunks are very tender, about 45 minutes, and small diced squash is browned in spots, about 30 minutes. Discard sage sprigs from large squash chunks.\nTransfer large squash chunks, apple, and garlic cloves to a food processor, blender, or the container of a stick blender. Add miso and 1/4 cup (60ml) broth and blend until a smooth purée forms. Season with salt.\nSerious Eats / Vicky Wasik\nHeat remaining 2 tablespoons (30ml) olive oil in a pressure cooker over medium-high heat until shimmering. Add onion and cook, stirring, until translucent but not browned, about 4 minutes.\nSerious Eats / Vicky Wasik\nAdd rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3 to 4 minutes. (Rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center.)\nSerious Eats / Vicky Wasik\nAdd wine and cook, stirring, until raw alcohol smell has cooked off and wine has almost fully evaporated, about 2 minutes.\nSerious Eats / Vicky Wasik\nStir in remaining 3 1/2 cups (840ml) broth; scrape any grains of rice or pieces of onion from side of pressure cooker so that they are fully submerged. Close pressure cooker and bring up to low pressure (10 psi on most units). Cook at low pressure for 5 minutes, then depressurize cooker either by running it under cold water if it is not electric, or using the steam-release valve if it is electric.\nSerious Eats / Vicky Wasik\nMeanwhile, in a small saucepan, melt butter over medium-high heat until foaming subsides, 2 to 3 minutes. Add remaining 8 sage leaves and fry, gently swirling, until milk solids in butter turn a hazelnut-brown color, 1 to 2 minutes longer. Remove from heat. Using a slotted spoon, transfer sage leaves to a paper towel–lined plate.\nSerious Eats / Vicky Wasik\nOpen pressure cooker and stir to combine rice and cooking liquid; it should begin to develop a creamy consistency. Stir in squash purée.\nSerious Eats / Vicky Wasik\nStir in brown butter. If risotto is too soupy, cook for a few minutes longer, stirring, until it begins to thicken more; it should look like a smooth, creamy sauce.\nSerious Eats / Vicky Wasik\nStir in a generous grating of parmesan cheese, followed by the maple-roasted diced squash. Season with salt. Spoon risotto onto plates, top with fried sage leaves and more grated cheese, and serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nElectric countertop pressure cooker or stovetop pressure cooker\n, 2\nrimmed baking sheets\n,\nfood processor\n,\nblender\nor\nimmersion blender\nNotes\nTo learn how to prepare, peel, and cut butternut squash, check out our\nknife skills guide\n.\nRead More\nPressure Cooker Corn Risotto\nPressure Cooker Mushroom Risotto\nBaked Saffron Risotto With Mozzarella and Crispy Topping\nWarm Butternut Squash and Cheddar Dip\nRice & Grain Mains\nItalian\nPressure Cooker\nSage\nButternut Squash"
}