{
  "url": "https://www.seriouseats.com/pressure-cooker-chicken-and-rice-soup-recipe-5220183",
  "image_url": "https://www.seriouseats.com/thmb/fZi_5USJrKugOsYJYTIo4FFMOlE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220210-Pressure-Cooker-Chicken-and-Rice-Soup-Hero-Horz-1-b9a9fdaf044e4da19508b48cce3527f7.jpg",
  "tags": [
    "Chicken",
    "White Rice",
    "Pressure Cooker",
    "The Latest"
  ],
  "title": "Pressure Cooker Chicken and Rice Soup",
  "full_text": "Pressure Cooker Chicken and Rice Soup\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 20 mins\nTotal\n2 hrs 30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n)\nchicken wings\n1\npound\n(\n450\ng\n)\nchicken leg quarter\n2\ntablespoons\n(\n18\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n1\nteaspoon\nwhole\nblack peppercorns\nplus\n1\nteaspoon\nfreshly\nground black pepper\n, divided\n2\nteaspoons\n(\n10\nml\n)\nvegetable oil\n1/2\ncup\n(\n100\ng\n) medium- or\nlong-grain rice\n, rinsed\n1\n(\n8-ounce\n;\n225\ng\n)\nyellow onion\n, peeled and cut crosswise into 1 inch thick rounds\n6\nounces\n(\n170\ng\n)\ncarrots\n(\n2\nmedium\n), cut into 1/4-inch dice\n6\nounces\ncelery\n(\n2 to 4\nribs\n), cut into 1/4-inch dice\n3\nounces\nfrozen peas\n1/2\ncup\n(\n15\ng\n)\nchopped parsley\nDirections\nAdjust oven rack to middle position and preheat to 500°F (260°C). Spread chicken wings directly on an unlined rimmed baking sheet. Roast wings until golden brown, about 30 minutes.\nSerious Eats / Liz Voltz\nRemove wings from oven and drain any rendered chicken fat into a heatproof bowl and reserve. Pour about 1/2 cup of water on baking sheet and scrape up any browned bits that may be stuck to the bottom.\nSerious Eats / Liz Voltz\nTransfer wings along with water and dissolved browned bits to a stovetop pressure cooker or electric multicooker (such as the Instant Pot). Cover with 1 1/2 quarts (1.4L) water. Bring stovetop pressure cooker to high pressure over high heat, then cook for 20 minutes, adjusting heat as needed to maintain high pressure; alternatively, set an electric multicooker to run at high pressure for 20 minutes.\nSerious Eats / Liz Voltz\nDepressurize using the quick-release method, then carefully remove lid, allowing steam to escape away from you. Strain broth through a fine-mesh strainer over a heat-proof container, pressing on solids to extract as much liquid as possible; discard solids. Return broth to now-empty pressure cooker pot.\nSerious Eats / Liz Voltz\nMeanwhile, in a medium saucepan, combine chicken legs with enough water to barely cover, along with 1 tablespoon (9g) salt and 1 teaspoon black peppercorns. Bring to a boil. Reduce heat to low and simmer until thickest part of legs registers 190°F (88°C), about 30 minutes. Drain chicken, reserving 3/4 cup (175ml) cooking liquid; discard peppercorns. When cool enough to handle, tear chicken into bite-size pieces. Set aside.\nSerious Eats / Liz Voltz\nWipe now-empty saucepan dry. Add reserved chicken fat and oil and heat over medium-high heat until shimmering. Add rice and cook, stirring occasionally, until rice is coated in oil and beginning to toast, about 2 to 3 minutes. Stir in reserved 3/4 cup chicken leg poaching liquid and swirl gently to evenly distribute the rice. Bring rice to simmer, then cover, lower heat to low, and cook until liquid is absorbed and rice is just cooked through, about 20 minutes. Off heat, uncover rice, stir to fluff, and cover again until ready to serve.\nSerious Eats / Liz Voltz\nHeat a dry 12-inch cast iron or stainless-steel skillet over high heat. Char onion slices until blackened on both sides, about 5 minutes per side. Add onions to broth and bring to a simmer on the stovetop, or set electric multicooker to Soup/Broth or other appropriate simmering setting; simmer for 30 minutes. Strain broth through a fine-mesh strainer set over a clean heat-proof container; discard solids.\nSerious Eats / Liz Voltz\nReturn now-empty pressure cooker pot to medium-high heat; alternatively, set electric multicooker to sauté function. Sprinkle the 1 teaspoon ground pepper into pot and cook, stirring occasionally, until pepper is smoky and fragrant, 45 to 60 seconds.\nSerious Eats / Liz Voltz\nAdd broth, carrots, celery, and remaining 1 tablespoon salt and bring mixture to a simmer. Cover and cook until vegetables are just tender, 8 to 10 minutes. Stir in chicken and peas and cook until heated through, about 2 minutes longer. Season to taste with salt. To serve, divide cooked rice between bowls and ladle soup over rice. Sprinkle with parsley and serve.\nSerious Eats / Liz Voltz\nSpecial Equipment\nPressure cooker, medium saucepan, 12-inch cast iron or stainless steel skillet\nMake-Ahead and Storage\nTo make ahead, prepare recipe through Step 7; store chicken, broth, and cooked rice separately in refrigerator for up to 1 week or frozen for up to 3 months. To serve, defrost all components and finish soup as described in Step 8.\nChicken\nWhite Rice\nPressure Cooker\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pressure-cooker-chicken-and-rice-soup.webp?"
}