{
  "url": "https://www.seriouseats.com/pressure-cooker-lentils-and-sausage-recipe-8723551",
  "image_url": "https://www.seriouseats.com/thmb/Vd0kyFpN5ZAhaeUtEVJP5fmkpYY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240929-SEA-PressureCookedLentilsAndSauasage-QiAi-Hero1-39-79aa62332c2547fc827432e71efa24c9.jpg",
  "tags": [
    "Pressure Cooker",
    "The Latest",
    "Sausages",
    "Lentils",
    "Pressure Cooked Beans"
  ],
  "title": "Pressure Cooker Lentils and Sausage",
  "full_text": "Pressure Cooker Lentils and Sausage\nClose\nJump to recipe\nCook\n30 mins\nTotal\n30 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1 tablespoon (\n15\nml\n) extra-\nvirgin olive oil,\nplus extra for serving\n1 medium\nonion\n(8 ounces;\n227\ng),\nfinely chopped\n1/2\nteaspoon\nDiamond Crystal\nkosher salt;\nfor table salt use half as much by volume\n1\nGranny\nSmith\napple\nor other tart apple, cored and cut into 1/2-inch pieces\n2\nteaspoons\nfresh thyme leaves,\nminced\n1\nteaspoon\nground cumin\n2\ncloves\ngarlic,\nminced\n2 3/4 cups (\n650\nml)\nhomemade\nchicken stock or low-sodium\nchicken broth\n1 1/2 cups\n(315\ng)\ndried brown\nlentils\nor French Le Puy lentils, picked over and rinsed\n1\nbay\nleaf\n1 1/4 pounds (\n570\ng)\nfresh\nsausage links,\nsuch as a mild Italian, merguez, or chorizo\n2\nteaspoons\napple cider\nvinegar,\nwhite wine vinegar, sherry vinegar, or freshly squeezed lemon juice\n2\ntablespoons\nminced\nfresh parsley\nleaves or chives, optional\nDirections\nIn an electric pressure cooker or multi-cooker such as an Instant Pot, heat oil using the sauté function until shimmering. Add onion and salt and cook, stirring often, until softened and beginning to brown, 6 to 8 minutes. Stir in apple, thyme, cumin, and garlic, and cook until fragrant, about 1 minute.\nSerious Eats / Qi Ai\nAdd broth, lentils, and bay leaf and stir to combine. Nestle sausage links into lentils. Lock lid in place and close pressure release valve. Select high pressure function, bring to pressure, then cook at pressure for 9 minutes. Turn off the electric pressure cooker and let sit untouched to let pressure release naturally for 10 minutes. Quick-release any remaining pressure, then carefully remove lid, allowing steam to escape away from you.\nSerious Eats / Qi Ai\nStir in vinegar and season with salt and pepper to taste. Transfer sausage to a cutting board and slice sausage on bias into 1-inch pieces. Transfer lentils to individual serving dishes or a large serving platter and top with sliced sausage. Sprinkle with fresh chives or parsley, if using, and drizzle with additional oil to serve.\nSerious Eats / Qi Ai\nSpecial Equipment\nElectric or stovetop pressure cooker\n(for stovetop cooker, see notes)\nNotes\nIf using a stovetop pressure cooker, cook the onion and aromatics as directed over medium-high heat, then proceed with recipe, bringing cooker to high pressure before cooking at high-pressure for 9 minutes; let stand before using cold-water method or quick-release method to fully depressurize.\nMake-Ahead and Storage\nLeftovers can be refrigerated in an airtight container for up to 5 days.\nPressure Cooker\nThe Latest\nSausages\nLentils\nPressure Cooked Beans"
}