{
  "url": "https://www.seriouseats.com/pressure-cooker-chunky-beef-and-bean-chili",
  "image_url": "https://www.seriouseats.com/thmb/RpxTT9cr4T9CpMAoFQRu1bpG3BQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-SoupsandStewsMPP-PressureCookerChunkyBeefandBeanChili-GregDupree-hero-feef099be95f4e09930871109fc85432.jpg",
  "tags": [
    "Southwestern & Tex Mex",
    "Mexican",
    "Pressure Cooked Beef",
    "Cannellini & Kidney Beans",
    "Short Ribs"
  ],
  "title": "Pressure Cooker Chunky Beef and Bean Chili Recipe",
  "full_text": "Pressure Cooker Chunky Beef and Bean Chili Recipe\nClose\nJump to recipe\nCook\n75 mins\nActive\n30 mins\nTotal\n75 mins\nServes\n6\nto 8 servings\nMakes\n2 1/2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\n(\n1.1\nkg\n)\nboneless beef short ribs\nKosher salt\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n, plus more if needed\n1\nmedium (\n8-ounce; 225 g\n)\nyellow onion\n, diced\n3\nmedium\ncloves garlic\n, minced\n2\nteaspoons\nchili powder\n, plus more if desired\n1/2\nteaspoon\nonion powder\n1/2\nteaspoon\ngarlic powder\n1/2\nteaspoon\nground cumin\n, plus more as needed\n1/4\nteaspoon\ncayenne pepper\n, plus more if desired\n1\ntablespoon\n(\n15\nml\n)\ntomato paste\n1\n(28-ounce; 794 g) can\nwhole peeled tomatoes\n, tomatoes crushed by hand, juices drained and reserved\n1/4\ncup\n(\n60\nml\n) strongly brewed coffee or\nespresso\n1/2\nounce\n(\n15\ng\n)\ndark chocolate\n1/2\nteaspoon\n(\n3\nml\n) Asian\nfish sauce\n1\nbay leaf\n4\ncups\ncooked and drained\nred kidney beans\nor\n2\n(15.5-ounce; 439 g) cans\nred kidney beans, drained (see notes)\n1\nteaspoon\nground black pepper\nSour cream, cilantro leaves, thinly sliced fresh chile or jalapeño, grated cheese, thinly sliced scallions,\nlime wedges\n, and more, for serving\nDirections\nSeason beef all over with salt. Heat oil in pressure cooker over medium-high heat (or, if using electric pressure cooker, using sauté setting), until shimmering. Working in batches, add short rib slabs and cook, turning, until well browned on the two largest sides. Transfer browned short ribs to a cutting board and cut into 1/2-inch chunks. Set aside.\nAdd onion and cook, stirring and scraping up any browned bits from bottom of the cooker, until lightly golden, about 5 minutes (cooking time will depend heavily on pressure cooker, especially electric ones where you can't control heat level). Stir in garlic, chili powder, onion powder, garlic powder, cumin, and cayenne pepper; cook, stirring, until fragrant, about 1 minute. (Add more oil at any time if cooker seems too dry.) Add tomato paste and cook, stirring, until slightly darkened, about 1 minute.\nReturn beef to cooker along with any accumulated juices. Add crushed tomatoes and stir well to combine. Season lightly with salt. Stir in coffee, chocolate, and fish sauce. Add bay leaf. Bring to a simmer, stirring well and scraping bottom all over right before sealing cooker.\nSeal cooker, bring to high pressure, and cook for 35 minutes. Quick-release cooker and stir chili well, scraping bottom to make sure nothing is sticking.\nDiscard bay leaf. Stir in drained beans. Season with salt and plenty of black pepper. Taste chili and add more chili powder, cumin, or cayenne pepper to taste, if desired. Let simmer, stirring occasionally, for 5 minutes. If chili is too thick, stir in some reserved tomato juices (or bean-cooking liquid, if you have it) to thin to desired consistency. If chili is too thin, simmer until thickened to desired consistency.\nServe with toppings of your choice.\nSpecial equipment\nOur favorite countertop electric pressure cooker or our favorite budget countertop electric pressure cooker\nNotes\nYou can make your beans from dried or use canned; from-dried beans taste better than canned, though in a full-flavored chili like this, canned are not a problem. To cook dried red kidney beans, before making the chili, add 3/4 pound (340g) dried red kidney beans to pressure cooker and cover with at least 3 inches of cold water. Season water to taste with salt, add 1 peeled onion, 2 medium cloves garlic, 1 dried bay leaf, and a sprig or two of fresh thyme or rosemary (if desired). Bring to high pressure, cook for 25 minutes, then quick-release the cooker to depressurize. You should have just slightly more than 4 cups cooked beans. Transfer cooked beans to a heatproof container, leaving them in their cooking liquid until ready to use. Clean pressure cooker before making chili.\nMake-Ahead and Storage\nThe chili can be made up to 5 days ahead and refrigerated in an airtight container.\nThis Recipe Appears In\nPressure Cook Your Way to Perfect Chili in Just 60 Minutes\nSouthwestern & Tex Mex\nMexican\nPressure Cooked Beef\nCannellini & Kidney Beans\nShort Ribs"
}