{
  "url": "https://www.seriouseats.com/pressure-cooker-beef-barley-soup-recipe",
  "image_url": null,
  "tags": [
    "Soups",
    "Pressure Cooked Beef",
    "Beef Chuck",
    "Barley",
    "Beef Mains"
  ],
  "title": "Pressure Cooker Beef Barley Soup Recipe",
  "full_text": "Pressure Cooker Beef Barley Soup Recipe\nJump to recipe\nPrep\n5 mins\nCook\n75 mins\nActive\n30 mins\nTotal\n80 mins\nServes\n8\nto 10 servings\nMakes\n3 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n1\nkg\n) boneless\nbeef chuck roast\n, cut into 1 1/2–inch steaks, or\n3\npounds\n(\n1.3\nkg\n) bone-in\nbeef short ribs\n(see note)\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\n(\n30\nml\n)\ncanola oil\n, divided\n4\nlarge\ncarrots\n(\n15\nounces\n;\n400\ng\n),\n3\ndiced\nand\n1\nleft\nwhole\n, divided\n2\nlarge\nyellow onions\n(\n1 1/2\npounds\n;\n680\ng\n),\n1\ndiced\nand\n1\nhalved\n, divided\n3\ncelery\nribs\n(\n9\nounces\n;\n255\ng\n),\n2\ndiced\nand\n1\nleft\nwhole\n, divided\n4\nmedium\ncloves garlic\n1\ncup\n(\n235\nml\n)\ndry white wine\n2\nquarts\n(\n2\nL\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n(see note)\n2\nsprigs\nfresh thyme\n1\nbay leaf\n1\ncup\npearled barley\n(\n7\nounces\n;\n200\ng\n)\n1/2\nteaspoon\n(\n3\nml\n)\nAsian fish sauce\n, optional\n8\nounces\n(\n225\ng\n)\nfrozen sweet peas\nDirections\nSeason beef with salt and pepper. In a pressure cooker, heat 1 tablespoon (15ml) oil over high heat until lightly smoking. Working in batches if necessary, add beef and cook, turning occasionally, until well browned on all sides, about 5 minutes per side. Transfer to a large platter.\nSerious Eats / Vicky Wasik\nAdd diced carrot, diced onion, and diced celery to pressure cooker and cook, stirring and scraping up any browned bits from the bottom, until lightly browned, about 6 minutes. Scrape vegetables into a heatproof bowl and set aside.\nAdd remaining 1 tablespoon (15ml) oil to pressure cooker and heat over medium-high heat until shimmering. Add remaining whole carrot, halved onion, and whole celery rib, along with garlic, and cook, stirring occasionally, until browned in spots, about 4 minutes. Add wine to pot and cook, scraping up any browned bits from bottom of pot, until wine comes to a simmer and alcohol smell cooks off, about 4 minutes.\nSerious Eats / Vicky Wasik\nAdd stock, thyme, bay leaf, reserved beef and any accumulated juices, and barley to pressure cooker; the liquid should just cover all the other ingredients. Close cooker, bring to high pressure, and cook for 30 minutes. Release pressure using pressure release valve.\nRemove beef, discard bones (they should fall right out), and cut meat into bite-size chunks. Return to pot. Discard thyme sprigs, large vegetable chunks and garlic cloves, and bay leaf. Stir in reserved diced vegetables and fish sauce, if using. Season with salt and pepper. Stir in peas and cook until just warmed through. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nElectric or stovetop\npressure cooker\nNotes\nBeef chuck is the easier and more affordable option, and produces very good results. Short ribs, especially when combined with their bones, create an even more deeply beefy stew. Ask your butcher to remove and reserve the bones for you if you don't feel comfortable doing it yourself. If you have beef chuck that's already cut into chunks for stewing, we recommend searing only half of them in step 1 and adding the other half raw in step 4.\nMost store-bought beef stock has poor flavor, which is why we recommend chicken stock instead; if you have good-quality homemade beef stock available, feel free to use it.\nRead More\nAll-American Beef Stew\nTaiwanese Beef Noodle Soup\nHearty Escarole, Barley, and Parmesan Soup\nSoups\nPressure Cooked Beef\nBeef Chuck\nBarley\nBeef Mains"
}