{
  "url": "https://www.seriouseats.com/pressure-cooker-ribollita",
  "image_url": "https://www.seriouseats.com/thmb/JGfp3WpZ0QTvqks4U6m1PjQYryc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200211-pressure-cooker-ribbolita-vicky-wasik-9-5718c30c3b464bbbba9e1653dd7f5d38.jpg",
  "tags": [
    "Italian",
    "Braised & Stewed Beans",
    "Pressure Cooked Beans",
    "Cannellini & Kidney Beans",
    "Kale"
  ],
  "title": "Pressure Cooker Ribollita (Tuscan Bean and Vegetable Stew) Recipe",
  "full_text": "Pressure Cooker Ribollita (Tuscan Bean and Vegetable Stew) Recipe\nClose\nJump to recipe\nCook\n2 hrs 30 mins\nActive\n45 mins\nTotal\n2 hrs 30 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n4\nlarge\ncarrots\n(\n1 1/4\npounds\n;\n525\ng\n), peeled and cut into 1/4-inch dice\n3\nlarge\ncelery stalks\n(\n8\nounces\n;\n240\ng\n), cut into 1/4-inch dice\n1\nlarge (\n13-ounce; 370 g\n)\nleek\n, white and light green parts only, cut into 1/4-inch dice\n1\nmedium (\n7-ounce; 200 g\n)\nred onion\n, cut into 1/4-inch dice\n2 1/2\ncups\npeeled, seeded, and diced\nbutternut squash\n(\n12\nounces\n;\n360\ng\n; about\n1/2\nof a\nmedium\nsquash\n)\n3\nmedium\ngarlic cloves\n, thinly sliced\nKosher salt\n8\nounces\n(\n1 1/2\ncups\n;\n225\ng\n)\ndried cannellini beans\n2\nsprigs\nfresh thyme\nand/or sage\n1\nbunch\n(about\n8\nounces\n;\n225\ng\n)\nlacinato kale\n(a.k.a. dinosaur, Tuscan, or black kale), stemmed, leaves roughly chopped\n4\nounces\n(\n110\ng\n) fresh or stale\nrustic crusty bread\n, cut into 1-inch cubes\nFreshly\nground black pepper\nFreshly grated\nParmigiano-Reggiano\n, for serving (optional)\nDirections\nIn a 6-quart stovetop pressure cooker set over medium-high heat or an electric multi-cooker (such as an Instant Pot) set to sauté mode, heat olive oil until shimmering. Add carrots, celery, leek, onion, squash, and garlic, season with salt, and cook, stirring frequently, until softened but not browned, about 20 minutes; lower heat if necessary to prevent browning.\nSerious Eats / Vicky Wasik\nAdd dried beans along with enough cold water to reach the pressure cooker's maximum fill line; this will vary slightly by pressure cook model but should be about 2 1/2 quarts (2.3 liters), enough to cover the vegetables and beans by roughly 2 inches (5cm). Add thyme and/or sage. Season well with salt.\nSeal cooker and bring to high pressure over medium-high heat, if using a stovetop model, or by switching to pressure-cooker mode on an electric multi-cooker. Cook at high pressure for 1 hour.\nRapidly release pressure on the cooker (how you do this will vary depending on the model; see manufacturer's instructions). Open lid, being careful to avoid the strong blast of steam. Check beans; they should be creamy throughout. If they're still firm, return cooker to high pressure and cook 10 to 15 minutes longer, then check again. (For this recipe, it's far better to overcook your beans than undercook them.)\nSerious Eats / Vicky Wasik\nStir in kale, then either simmer uncovered for 20 minutes until tender or replace lid and return to high pressure for 15 minutes if you want the kale very well done before rapidly releasing and opening the cooker again.\nSerious Eats / Vicky Wasik\nStir in bread and simmer until it melts into the soup and no firm or distinct pieces remain, 10 to 15 minutes. Season with salt to taste; discard thyme/sage sprigs. You can adjust the consistency of the ribollita by either adding more water (or vegetable stock) if it's too thick, or simmering it to reduce the liquid until it reaches your desired thickness level; this is entirely a matter of personal preference.\nSerious Eats / Vicky Wasik\nDivide ribollita between individual serving bowls. Drizzle with fresh olive oil and top with freshly ground black pepper and grated cheese, if desired. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStovetop pressure cooker\nor\nelectric multi-cooker\nMake-Ahead and Storage\nThe ribollita can be refrigerated for up to 5 days or frozen for up to 3 months. You may need to loosen with a little extra water when reheating.\nItalian\nBraised & Stewed Beans\nPressure Cooked Beans\nCannellini & Kidney Beans\nKale",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pressure-cooker-ribollita-tuscan-bean-and-vegetable-stew-recipe.webp?"
}