{
  "url": "https://www.seriouseats.com/pressure-cooker-brisket",
  "image_url": "https://www.seriouseats.com/thmb/nlskxJYOtrmw2JEvKVkDtNm4L7w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200211-pressure-cooker-brisket-vicky-wasik-21-0297afcfdd8046e1844a9af0c2ea6952.jpg",
  "tags": [
    "Brisket",
    "Braised & Stewed Beef",
    "Pressure Cooked Beef",
    "Winter Mains",
    "Passover"
  ],
  "title": "Pressure Cooker Jewish-Style Braised Brisket With Onions and Carrots",
  "full_text": "Pressure Cooker Jewish-Style Braised Brisket With Onions and Carrots\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 35 mins\nActive\n45 mins\nCooling and Resting Time\n50 mins\nTotal\n3 hrs 30 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n5\npounds\n(\n2.25\nkg\n)\nbeef brisket\n(see note)\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n, plus more if needed\n3\npounds\nyellow onions\n(\n1.3\nkg\n; about\n5\nlarge\n), sliced 1/4 inch thick\n1 1/4\npounds\ncarrots\n(\n560\ng\n; about\n8\nmedium\n), cut into 3/4-inch dice\n3/4\npound\ncelery\n(\n340\ng\n; about\n5\nlarge ribs\n), cut into 3/4-inch dice\n6\nmedium cloves\ngarlic\n1/2\ncup\n(\n120\nml\n)\nketchup\n1/4\ncup\n(\n60\nml\n)\ntomato paste\n1\ncup\n(\n240\nml\n)\ndry red wine\n4\nsprigs\nthyme\n2\nbay leaves\nDirections\nIf your brisket is too large to sit flat on the bottom of your pressure cooker, cut it into pieces that will fit. Season brisket all over with salt and pepper. In an electric multi-cooker (such as an Instant Pot), set to searing mode or a stovetop pressure cooker set over medium-high heat, add oil and heat until shimmering. Working in batches, add brisket, and brown on both sides, about 6 minutes per side (the exact browning time will depend on your pressure cooker model; electric ones will generally take quite a bit longer than stovetop ones). Transfer brisket to platter or rimmed baking sheet, and set aside.\nSerious Eats / Vicky Wasik\nAdd 1 to 2 tablespoons additional oil, as needed, if pot has gone dry. Add onion, carrot, celery, and garlic, and season with salt. Cook, stirring and scraping up any browned bits, until onions are very soft and any released juices have thickened into a glaze, 25-35 minutes (the exact cooking time will again depend on the type of cooker you're using, with electric ones taking quite a bit longer); reduce heat at any point if vegetables threaten to scorch. The vegetables should have reduced significantly in volume by this time.\nSerious Eats / Vicky Wasik\nStir in ketchup and tomato paste and cook, stirring, until thick, about 3 minutes. Add wine and cook until raw alcohol smell has cooked off, about 3 minutes.\nSerious Eats / Vicky Wasik\nAdd thyme and bay leaves. Reduce heat to medium-low or turn off searing mode on electric multi-cooker. Give the vegetables a good stir, scraping the bottom well all over (this will be your last chance to stir before closing the cooker); if vegetables are very dry, stir in 1/2 cup water to moisten. Add brisket pieces, nestling them well in the vegetables, and add any accumulated juices. Seal pressure cooker and bring to high pressure over medium heat or using the pressure-cooking mode of an electric multi-cooker. Cook for at least 1 hour at high pressure and up to 1 hour 30 minutes. Choose 1 hour if your brisket pieces are closer to 1 inch thick, or if they're thicker but you want a little more chew to the meat; choose 1 hour 30 minutes if your brisket is closer to 2 inches thick, and you want it more tender.\nSerious Eats / Vicky Wasik\nRapidly release pressure cooker or allow to release naturally, then open. Transfer brisket pieces to a work surface, and let rest until cool enough to handle. Taste braising liquid and season with salt, if necessary. Discard thyme sprigs and bay leaves, and skim off any excess fat if it's there (this will depend on the cut of brisket). If the braising liquid is a little too watery, you can reduce it at this point by simmering it uncovered until it thickens slightly (in some electric multi-cookers, you may need to use the sauté or similar function).\nSerious Eats / Vicky Wasik\nSlice brisket thinly against the grain. Arrange on a platter and spoon the sauce and vegetables all over, making sure the meat is bathing in juices. Cover and let stand for 30 minutes in a warm place. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStovetop pressure cooker\nor\nelectric multi-cooker\nNotes\nFor the juiciest brisket, try to use one that still has the second cut (also called the point or the deckle) attached. It has more intramuscular fat than the more common, lean first cut and will remain moister as a result. If using just the first cut, be sure not to trim any fat—it needs the fat for moistness.\nMake-Ahead and Storage\nBrisket can be made up to 4 days ahead and refrigerated whole or sliced in its braising liquid. Reheat gently before serving.\nBrisket\nBraised & Stewed Beef\nPressure Cooked Beef\nWinter Mains\nPassover"
}