{
  "url": "https://www.seriouseats.com/pressure-cooker-butter-chicken",
  "image_url": "https://www.seriouseats.com/thmb/YTLDXO5StrBo2ZIyvFFkOfXMYgc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200218-butter-chicken-vicky-wasik-36-0733fcb29f354c4f946b59bc9e719de7.jpg",
  "tags": [
    "Pressure Cooked Chicken",
    "Indian",
    "Chicken Thighs",
    "Tomato",
    "Chicken Mains"
  ],
  "title": "Better Pressure Cooker Butter Chicken Recipe",
  "full_text": "Better Pressure Cooker Butter Chicken Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n30 mins\nTotal\n75 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinating the Chicken:\n1\ntablespoon\nkasuri methi (fenugreek leaves) or, alternatively,\n2\nteaspoons\nfenugreek seeds\n(see notes)\n1/4\ncup\n(\n60\nml\n)\nplain Greek yogurt\n,\nstore-bought\nor\nhomemade\n1\ntablespoon\ngaram masala\n, store-bought or homemade\n2\nteaspoons\nDiamond Crystal\nkosher salt\n(if using table salt, use half as much)\n1\nteaspoon\nkala namak (\nblack salt\n) (optional, see notes)\n1\n(1-inch) piece\nof\nginger\n(\n1/2\nounce\n;\n14\ng\n), peeled and finely grated\n2\npounds\n(\n900\ng\n)\nboneless, skinless chicken thighs\n(about\n4\nthighs\n), cut into bite-size, 1-inch pieces\nFor the Makhani Sauce:\n1\ntablespoon\nplus\n2\nteaspoons\nkasuri methi (fenugreek leaves) or, alternatively,\n1\ntablespoon\nfenugreek seeds\n(see notes)\n2\nwhole\ndried chiles de arbol\n(see notes)\n1\npod\nbrown cardamom\nor, alternatively,\n1\npod\ngreen cardamom\n(see notes)\n1\nwhole\nclove\n1\ntablespoon\ngaram masala\n, store-bought or homemade\n1\ntablespoon\nDiamond Crystal\nkosher salt\n(if using table salt, use half as much)\n1\nounce\n(\n28\ng\n)\nraw cashews\n(about\n12 to 15\ncashews\n)\n1\n(28-ounce; 800 g) can\nwhole fire-roasted tomatoes\n(see notes), strained, with\n1/2\ncup\nof liquid reserved\n2\ntablespoons\n(\n30\nml\n)\ncanola oil\nor other neutral-flavored oil\n1\nmedium\nwhite onion\n, peeled and cut into 1/2-inch dice\n1/4\nteaspoon\nbaking soda\n1\n(1-inch) piece\nof\nginger\n(\n1/2\nounce\n;\n14\ng\n), peeled and thinly sliced\n4\ncloves\ngarlic\n, smashed and roughly chopped\n1/2\ncup\n(\n120\nml\n)\nheavy cream\n, plus more for drizzling\n4\ntablespoons\n(\n60\ng\n)\nunsalted butter\n, cut into\n4\npieces\nWarm long-grain rice\n, for serving\nDirections\nTo Marinate the Chicken:\nAdd fenugreek leaves (or fenugreek seeds, if using) to small skillet and place over medium heat. Toast leaves, tossing them constantly, until quite fragrant, about 30 seconds. Transfer toasted leaves to spice grinder or mortar and pestle and grind to fine powder. Set aside.\nIn the center of a rimmed baking sheet, create a roughly 9- by 13-inch aluminum-foil boat with 1-inch sides, and set aside. (Alternatively, if you have a 1/4 rimmed baking sheet, use that instead, omitting foil.) In a medium mixing bowl, stir together yogurt, garam masala, salt, black salt, grated ginger, and ground fenugreek leaves.\nAdd chicken thigh pieces to bowl and, using clean hands, toss with marinade until evenly coated. Transfer chicken to prepared baking sheet, arranging pieces in an even, single layer. Set aside.\nFor the Makhani Sauce:\nAdd fenugreek leaves (or seeds, if using), chiles de arbol, brown cardamon (or green cardamom, if using), and clove to small skillet and place it over medium heat. Toast, tossing frequently, until spices are quite fragrant, about 1 to 2 minutes. Transfer spices to spice grinder or mortar and pestle along with garam masala and salt and grind to a fine powder. Set aside. (If you don't want to toast and grind the spices yourself, see the note section for instructions on making a spice mixture with pre-ground spices.)\nIn a small, microwave-safe bowl, combine cashews and reserved liquid from strained tomatoes. Microwave on high until cashews look plump and have softened slightly, about 1 minute. Set aside.\nAdd canola oil to pressure cooker pot. If using an electric pressure cooker, turn on \"Sauté\" function. If using a stovetop pressure cooker, place pot over medium-high heat. When oil is shimmering, add onions and baking soda and, using a wooden spoon, stir to coat onions in oil and distribute baking soda. Cook, stirring occasionally, until onions have completely broken down, most of their moisture has cooked off, and they begin to brown, 14 to 17 minutes. If at any point, the onions seem to be browning too quickly or unevenly, add a tablespoon (15ml) of water and scrape up any brown bits that form on the bottom of the pot.\nIf using an electric pressure cooker, turn off \"Sauté\" function. If using a stovetop pressure cooker, reduce heat to medium-low. Add ginger and garlic to pot and cook, stirring constantly, until quite fragrant, about 1 minute. Using wooden spoon, push onions into center of pot to form a mound. Add ground spice mixture to the mounded onions to prevent spices from scorching. Cook, stirring constantly, until onions are coated in spices and mixture is very fragrant, about 30 seconds. Add cashews and their soaking liquid, scraping up any bits stuck to the bottom of the pot. Add tomatoes and, using the back of wooden spoon, crush tomatoes.\nIf using an electric pressure cooker, turn on \"Pressure Cook\" function; set pressure to high and time to 7 minutes (do not close lid). If using a stovetop pressure cooker, increase heat to medium. Cook, uncovered, stirring constantly, until mixture comes to a simmer. Close and seal pressure cooker lid, bring to high pressure, and cook for 7 minutes. Allow contents of pressure cooker to sit, off-heat, for an additional 7 minutes.\nIf, after 7 minutes, the pressure cooker has not depressurized, manually release pressure.\nWhile the sauce cooks, adjust oven rack to 3 inches below broiler element and preheat broiler on high. Transfer sheet pan with marinated chicken to broiler. Cook, checking the chicken frequently to ensure it is not burning, until chicken is charred in spots and fully cooked through, about 14 minutes (time will vary depending on the strength of the broiler). Remove chicken from broiler and set aside.\nUsing an immersion blender, blend contents of pressure cooker until completely smooth, about 2 minutes. Alternatively, transfer contents of pressure cooker to countertop blender and blend until completely smooth, about 2 minutes. Add butter and cream, and blend until completely smooth and emulsified, about 2 minutes. At this point, you may remove 1 1/2 (360ml) cups of sauce and reserve it for another use. If using a countertop blender, return sauce to the pot.\nTo Finish:\nAdd reserved broiled chicken along with any juices in the sheet pan to sauce and stir until chicken is well incorporated and warmed through. Ladle chicken and sauce into serving bowl and drizzle with additional heavy cream. Serve immediately with rice alongside.\nSpecial equipment\nElectric pressure cooker or\nstovetop pressure cooker\n;\nspice grinder\n;\nimmersion blender\nor blender.\nNotes\nIf you cannot find kala namak, or black salt, you can substitute a 1/2 teaspoon of Diamond Crystal kosher salt. (Read more about black salt in our\nguide to salt\n.)\nIf you'd prefer to forgo toasting and grinding the spices yourself, you can use pre-ground spices. Substitute 1 tablespoon of ground fenugreek for the 2 teaspoons of fenugreek called for in the marinade, and 1 tablespoon plus 1 teaspoon of ground fenugreek for the 1 tablespoon of fenugreek seeds called for in the sauce; you can substitute 1/4 teaspoon of ground cardamom for the 1 green cardamom pod called for in the sauce; you can substitute 1/8 teaspoon of ground clove for the 1 clove called for in the sauce; you can substitute 1/2 teaspoon of cayenne pepper for the chile de arbol (more, if you like it spicier).\nBrown cardamom is sometimes called black cardamom, but note that it's not the same as Chinese black cardamom (also sometimes called red cardamom).\nFire-roasted whole canned tomatoes are preferred, but plain whole canned tomatoes can be used as well.\nMake-Ahead and Storage\nSealed in an airtight container, butter chicken will keep for up to a week in the refrigerator.\nRead More\nButter Chicken: Even When It’s Bad, It’s Good!\nPressure Cooked Chicken\nIndian\nChicken Thighs\nTomato\nChicken Mains"
}