{
  "url": "https://www.seriouseats.com/pressure-cooker-french-onion-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/brfG2te5qUgj47564X_RlHr7a6g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20151202-pressure-cooker-onion-soup-recipe-kenji-5-485c9e6902c8445ebc83ac40223f34d9.jpg",
  "tags": [
    "Soups",
    "French",
    "Pressure Cooker",
    "Gruyere",
    "Onions"
  ],
  "title": "Pressure Cooker French Onion Soup Recipe",
  "full_text": "Pressure Cooker French Onion Soup Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nActive\n20 mins\nTotal\n90 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\nunsalted butter\n, plus more for toasts (\n3\nounces\n; about\n90\ng\n)\n3\npounds\nyellow\nor mixed\nonions\n, sliced 1/8 inch thick (\n1.4\nkg\n; about\n4 to 5\nlarge\nonions) (see note)\n2\nteaspoons\nDiamond Crystal kosher salt\n, plus more to taste; for table salt, use half as much by volume\nFreshly\nground black pepper\n1/4\ncup\n(\n60\nml\n)\ndry sherry\n, such as Amontillado\n2\nquarts\n(about\n2\nL\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\nsprigs\nthyme\n1\nbay leaf\n1 1/2\nteaspoons\n(\n7\nml\n)\ncider vinegar\n16\nbowl-size slices\nrustic bread\n, toasted until crisp\n1\nmedium\nclove garlic\n1\npound\n(\n450\ng\n)\nGruyère cheese\n, grated\nFreshly minced chives\n, for garnish\nDirections\nMelt butter in an electric or stovetop pressure cooker over medium heat. Without stirring, add onions. Season with salt and pepper. Seal pressure cooker and heat to high pressure (12.5 to 15 psi). Cook at high pressure for 20 minutes. Remove from heat. Let the pressure release naturally (float valve will drop; this will take about 30 minutes.) Remove lid from cooker.\nContinue cooking with lid off, stirring constantly, until liquid inside has completely reduced and the onions are golden brown, about 5 minutes. Add sherry and bring to a simmer. Cook until alcohol smell is mostly gone, about 3 minutes. Add stock, thyme, and bay leaf, raise heat to medium-high, and bring to a simmer. Lower heat and simmer for 10 minutes. Add cider vinegar and season with salt and pepper to taste. Discard thyme sprigs and bay leaf.\nTo Serve:\nPreheat broiler and move oven rack to top position. Butter toasts and rub with garlic clove until fragrant. Spoon a small amount of broth into the bottoms of 8 ovenproof serving bowls, then top with half the toasts. Sprinkle some Gruyère on top of toasts, then spoon more soup and onions on top, nearly filling the bowls. Set the remaining 8 toasts in each bowl, pushing to nearly submerge them. Top with remaining Gruyère and set bowls on a rimmed baking sheet. Broil until cheese is melted and browned in spots, about 5 minutes. Garnish with chives and serve.\nSpecial equipment\nElectric or stovetop pressure cooker, rimmed baking sheet\nNotes\nYellow onions are your best all-purpose bet for this soup, but a mix of yellow, sweet (e.g., Vidalia), and red onions, as well as shallots, produces an even more complex flavor.\nThis Recipe Appears In\nThe Food Lab: Use the Pressure Cooker for Quick Caramelized Onions and French Onion Soup\nSoups\nFrench\nPressure Cooker\nGruyere\nOnions"
}