{
  "url": "https://www.seriouseats.com/pressure-cooker-corn-risotto",
  "image_url": null,
  "tags": [
    "Rice & Grain Mains",
    "Italian",
    "Pressure Cooker",
    "Corn",
    "Quick Dinners"
  ],
  "title": "Pressure Cooker Corn Risotto",
  "full_text": "Pressure Cooker Corn Risotto\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n14\nounces\n;\n400\ng\n) short-grain rice such as arborio, bomba, or\ncarnaroli\n3 1/2\ncups\n(\n28\nounces\n;\n820\ng\n)\nhomemade\nor store-bought\nlow-sodium chicken\nor\nvegetable\nstock\n6\nears\nof\ncorn\n, shucked\n6\ntablespoons\n(\n3\nounces\n;\n45\ng\n)\nunsalted butter\n, divided\n2\nsmall\nshallots\n, minced (about\n2\nounces\n;\n60\ng\n)\n2\ncloves\ngarlic\n, minced (about\n10\ng\n)\n3/4\ncup\n(\n6\nounces\n;\n170\ng\n)\ndry white wine\n1\nbay leaf\n3-4\nsprigs\nof\nthyme\nKosher salt\nand freshly ground black pepper\n1/4\ncup\n(\n2\nounces\n;\n60\ng\n)\nheavy cream\n1\nteaspoon\nground turmeric\n(optional)\n1/2\ncup\n(\n2\nounces\n;\n60\ng\n)\ngrated pecorino cheese\nDirections\nIn a small bowl, rinse rice with chicken stock, gently stirring with a spoon or rubber spatula. Drain rice through a fine-mesh sieve, reserving stock and rice.\nSerious Eats / Vicky Wasik\nInvert a small metal bowl and place inside a larger metal bowl to create an elevated surface to cut the corn. Using a small paring knife, trim the corn from the cobs. After removing the kernels, using the back of the knife, scrape any remaining starchy liquid from the cobs. Set aside and reserve 3 of the stripped cobs.\nSerious Eats / Vicky Wasik\nSet the pressure cooker to sauté or place over medium-high heat and preheat. Add 2 tablespoons of butter and melt until foamy, about 1 minute. Add corn and sauté until tender and sweet, about 2 minutes. Remove corn from heat, return it to the bowl, and set it aside.\nReturn pressure cooker to sauté or medium-high and melt remaining 4 tablespoons of butter until foamy, about 1 minute. Add minced shallots and garlic, cooking until tender, about 2 minutes. Add rinsed rice and gently toast in the butter, about 2 minutes. Pour in wine and cook until reduced and no raw alcohol taste remains, about 2 minutes. Add chicken stock, bay leaf, and thyme to pot and season with kosher salt and freshly ground pepper. Add the 3 reserved cobs to the liquid and close the pressure cooker. Bring to low pressure and cook for 4 minutes.\nSerious Eats / Vicky Wasik\nWhile the risotto cooks, transfer half the sautéed corn to a blender along with heavy cream and turmeric (if using). Blend until smooth and set aside.\nSerious Eats / Vicky Wasik\nAfter the risotto has cooked, quickly depressurize cooker by either submerging it under running cold water if it is not electric, or using the steam release valve if it is electric.\nOpen pressure cooker and remove and dispose of bay leaf and thyme sprigs. Remove cobs, scraping liquid from cobs back into the risotto.\nSerious Eats / Vicky Wasik\nAdd corn purée, sautéed corn, and pecorino to the risotto and stir vigorously to develop a thick and creamy texture. Add more kosher salt and freshly ground black pepper to taste. Serve immediately, with more cheese if desired.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nPressure cooker\n,\nmixing bowls\n,\nparing knife\n,\nfine mesh strainer\n,\nhigh-speed blender\nRead More\nPressure Cooker Mushroom Risotto\nCreamy Risotto alla Milanese (Saffron Risotto)\nA Comprehensive Guide to Rice Varieties\nThe Best Corn Chowder Recipe\nRice & Grain Mains\nItalian\nPressure Cooker\nCorn\nQuick Dinners"
}