{
  "url": "https://www.seriouseats.com/pressure-cooker-pork-belly-chasu",
  "image_url": "https://www.seriouseats.com/thmb/pxB4cGn7mGVJ_RPmYcjQ0vC2Lso=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200207-pressure-cooker-chashu-vicky-wasik-13-b333402b25164faa9b24dfc2e12c9b9e.jpg",
  "tags": [
    "Pork Belly",
    "Japanese",
    "Pressure Cooker",
    "Pork Mains"
  ],
  "title": "Pressure Cooker Pork Belly Chashu Recipe",
  "full_text": "Pressure Cooker Pork Belly Chashu Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n100 mins\nActive\n30 mins\nCooling and Chilling Time\n6 hrs 30 mins\nTotal\n8 hrs 20 mins\nServes\n4\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n240\nml\n)\nsake\n1\ncup\n(\n240\nml\n)\nmirin\n1/2\ncup\n(\n120\nml\n)\nsoy sauce\n1/4\ncup\n(\n50\ng\n)\nsugar\n6\nscallions\n, roughly chopped\n6\nwhole\ngarlic cloves\n1\n(\n2-inch) knob\nginger\n, unpeeled, sliced into 1/2-inch-thick pieces\n1\nlarge\nshallot\n, unpeeled, halved\n1\n(\n2-pound; 900 g\n) skin-on slab of boneless\npork belly\nKosher salt\nDirections\nIn a small saucepan, bring sake to a boil over medium-high heat, and cook until reduced by half and alcohol has cooked off, about 5 minutes. Transfer reduced sake to pressure cooker pot along with mirin, soy sauce, sugar, scallions, garlic, ginger, and shallot. Set aside.\nLay pork belly on cutting board and roll up tightly lengthwise, with skin facing out.\nSerious Eats / Vicky Wasik\nUsing butchers twine, tightly secure pork belly at 3/4-inch intervals.\nSerious Eats / Vicky Wasik\nAdd pork belly to pressure cooker pot (it won't be submerged). If using an electric pressure cooker, cover and seal the pot, set the pressure cooker to \"high pressure\" and set the cook time to 1 hour and 30 minutes. If using a stovetop pressure cooker, cover and seal the pot, set it over medium-high heat, and allow to come to pressure. Cook at high pressure for 1 hour and 30 minutes. Allow pressure to release naturally, or manually release pressure. Pork belly should be fully tender, offering little resistance when poked with a cake tester or paring knife at its center.\nSerious Eats / Vicky Wasik\nUsing a spatula and tongs, carefully transfer pork (it will be very soft) to a large container. Strain cooking liquid through fine-mesh strainer into container with pork. Cool at room temperature, then cover container tightly and refrigerate until pork is completely chilled, at least 6 hours.\nWhen ready to serve, remove pork belly from container, wiping off excess cooking liquid; reserve cooking liquid for another use (like making\najitsuke tamago\nor braising more pork in the future). Slice pork belly crosswise 1/4-inch-thick pieces, removing and discarding twine as you go (if you are not serving all of the pork at once, do not remove all of the twine, as it helps hold the shape of the chashu and makes it easier to slice).\nSerious Eats / Vicky Wasik\nTo Serve\n: Pork belly slices can be seasoned with salt to taste and placed directly on top of a bowl of piping hot ramen. Alternatively, slices can be torched or broiled before serving.\nIf using a broiler, set rack 2 to 3 inches from broiler element, and preheat broiler on high. Place pork belly slices on rimmed baking sheet and broil until slices are warmed through, fat is bubbling, and some light charring occurs, 1 to 2 minutes, depending on the strength of the broiler. Season pork belly slices with salt to taste. Place atop piping hot bowls of ramen.\nSerious Eats / Vicky Wasik\nIf using a kitchen torch, place pork belly slices on rimmed baking sheet. Turn torch on, making sure the flame is blue (which indicates full combustion of the gas), then direct the flame at the surface of the meat, holding torch 4 to 5 inches above meat. Cook until fat is bubbling, some light charring occurs, and meat is warmed through, about 30 seconds. Season pork belly slices with salt to taste. Place atop piping hot bowls of ramen.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nElectric or stovetop\npressure cooker\n, kitchen twine\nMake-Ahead and Storage\nPork belly can be cooked and stored in its braising liquid for up to one week. When removed from its braising liquid, it can be wrapped tightly in plastic wrap and frozen for up to 3 months.\nRead More\nRich and Creamy Tonkotsu Ramen Broth\nMiso Tori Paitan Ramen (Creamy Chicken Broth Ramen)\nPressure Cooker Chintan Shoyu Ramen\nFrom-Scratch Shio Ramen\nHow to Make Ramen Noodles From Scratch\nPork Belly\nJapanese\nPressure Cooker\nPork Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pressure-cooker-pork-belly-chashu-recipe.webp?"
}