{
  "url": "https://www.seriouseats.com/pressure-cooker-chile-con-carne-texas-red-chili-recipe",
  "image_url": "https://www.seriouseats.com/thmb/eFO3J6yoEb7enlGJjAWSUMliZ8M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__01__20150125-pressure-cooker-chile-con-carne-recipe-12-71a10188891d4fb1bc24a4c782765c60.jpg",
  "tags": [
    "Chili",
    "Southwestern & Tex Mex",
    "Pressure Cooked Beef",
    "Beef Chuck",
    "Chile Pepper"
  ],
  "title": "1-Hour Pressure Cooker Texas-Style Chili con Carne Recipe",
  "full_text": "1-Hour Pressure Cooker Texas-Style Chili con Carne Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nActive\n30 mins\nCooling and Chilling Time\n8 hrs 30 mins\nTotal\n9 hrs 45 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nwhole\nsweet fresh dried chiles\nlike Costeño, New Mexico, or Choricero, stems and seeds removed\n2\nsmall\nhot dried chiles\nlike Arbol or Cascabel, stems and seeds removed\n3\nwhole\nrich fruity\ndried chiles\nlike Ancho, Mulatto, Negro, or\nPasilla\n, stems and seeds removed\n1 1/2\nquarts\nhomemade chicken stock\nor store-bought\nlow-sodium broth\n2\nwhole\nchipotle dried chiles canned in adobo sauce\n, plus\n2\ntablespoons\nsauce, stems and seeds removed\n4\npounds\nwhole beef chuck\n, trimmed of excess gristle and fat, cut into\n2 to 3\nlarge\nsteaks\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\nvegetable oil\n1\nlarge\nonion\n, finely diced\n4\nmedium\ncloves garlic\n, minced\n1/2\nteaspoon\nground cinnamon\n1\ntablespoon\nground cumin\n1/4\nteaspoon\nground allspice\n2\nteaspoons\ndried oregano\n2\ntablespoons\nAsian fish sauce\n, plus more to taste\n2 to 3\ntablespoons\nmasa harina\n(optional)\n2\ntablespoons\napple cider vinegar\nHot sauce\n, to taste\nCilantro\n, chopped onions, scallions, grated cheese, avocado, and warm tortillas for serving as desired\nDirections\nAdd dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside. Alternatively, place dried chiles on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl. Add chicken broth and chipotle chiles, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside.\nSeason chuck steaks generously with salt and pepper. Heat oil in the base of an electric or stovetop pressure cooker over high heat until just starting to smoke. Add half of beef chuck in a single layer and cook without moving until deeply browned, about 6 minutes. Flip steaks and brown second side, 3 to 4 minutes longer. Transfer steaks to a cutting board.\nAdd onions to pressure cooker and cook, stirring frequently until translucent and softened, about 2 minutes. Add garlic, cinnamon, cumin, allspice, and oregano, and cook, stirring constantly, until fragrant, about 1 minute. Add the soaked chiles and the chicken broth and bring to a simmer. Transfer mixture to the jar of a blender. Blend, starting on the lowest possible setting and gradually increasing speed to high (make sure to hold the lid down with a clean kitchen towel or a potholder to prevent it from blowing out). Blend until smooth, about 1 minute. Return purée to the pressure cooker.\nCut the seared and raw chuck steaks into 1 1/2- to 2-inch chunks and transfer to the pressure cooker. Bring to a simmer, season gently with salt and pepper, seal pressure cooker, and cook on high pressure for 30 minutes.\nRelease pressure using quick release valve on an electric cooker or running under cold water for a stovetop cooker. Remove lid. Stir in fish sauce, masa harina (if using), and vinegar. Add hot sauce to taste. Simmer until thickened to desired consistency, about 5 minutes. Season to taste with salt. For best results, allow chili to cool and store in the refrigerator at least overnight and up to five days. Reheat the next day to serve.\nServe, garnished with cilantro, chopped onions, scallions, grated cheese, avocado, and warm tortillas as desired.\nSpecial equipment\nElectric or stovetop pressure cooker\nThis Recipe Appears In\nThe Food Lab: The Pressure Cooker Makes Short Work of This Authentic Texas Chili con Carne\nChili\nSouthwestern & Tex Mex\nPressure Cooked Beef\nBeef Chuck\nChile Pepper"
}