{
  "url": "https://www.seriouseats.com/prik-gaeng-garee-yellow-curry-paste-5190967",
  "image_url": "https://www.seriouseats.com/thmb/korBVeRRSKfcskb_iwYT5OmPSVk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-thai-yellow-curry-paste-PrikGaengGari-vicky-wasik-seriouseats-26-95181db20db74c6092f9d9aa3c88489c.jpg",
  "tags": [
    "Thai",
    "Vegetarian",
    "The Latest"
  ],
  "title": "Prik Gaeng Garee (Thai Yellow Curry Paste)",
  "full_text": "Prik Gaeng Garee (Thai Yellow Curry Paste)\nClose\nJump to recipe\nPrep\n45 mins\nCook\n5 mins\nTotal\n50 mins\nServes\n4 servings\nMakes\n4 ounces\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Curry Powder (Optional):\n5\ngreen cardamom\npods\n2\ntablespoons\n(\n10\ng\n)\ncoriander seeds\n1\ntablespoon\n(\n10\ng\n)\ncumin seeds\n1\nteaspoon\n(\n4\ng\n)\nwhole cloves\n1\nteaspoon\n(\n4\ng\n)\nfennel seeds\n1\ncinnamon\nstick\n, broken into pieces\n1\npiece\nwhole nutmeg\n2\ntablespoons\n(\n16\ng\n)\nground turmeric\n1\ntablespoon\n(\n8\ng\n)\nKashmiri chile powder\n(see note)\nFor the Curry Paste:\n1\ntablespoon\n(\n5\ng\n)\ncoriander seeds\n1\nteaspoon\n(\n3\ng\n)\ncumin seeds\n1 1/4\nteaspoons\nwhite peppercorns\n5\ndried spur chiles\n(about\n8\ng\ntotal), stemmed and seeded (see note)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n2\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced (about\n20\ng\nsliced\nlemongrass\n)\n1\ntablespoon\n(\n8\ng\n) homemade or store-bought\ncurry powder\nOne\n3-inch (10 g) piece\nfresh turmeric\n, thinly sliced\n3\ncoriander roots\n(\n10\ng\n), cleaned and thinly sliced (see note)\n5\nmedium\ngarlic cloves\n(\n25\ng\n), thinly sliced\n2\nsmall\nshallots\n(\n40\ng\n), thinly sliced\nDirections\nFor the Curry Powder:\nPlace cardamom, coriander, cumin, cloves, fennel seed, cinnamon, and nutmeg in a medium skillet, and set over medium-low heat. Cook, tossing frequently, until fragrant and toasted-smelling, 3 to 4 minutes. Remove from heat and allow to cool for 2 minutes. Transfer to a spice grinder with ground turmeric and Kashmiri chile and grind into a fine powder. Set aside 1 tablespoon (8g) for the curry paste. The remaining curry powder can be stored in an airtight container in a dark, cool place for up to 6 months.\nSerious Eats / Vicky Wasik\nFor the Curry Paste:\nPlace coriander, cumin, and white peppercorns in now-empty skillet and set over medium-low heat. Cook, tossing frequently, until aromatic and toasted-smelling, 2 to 3 minutes. Remove from heat and allow to cool for 2 minutes. Transfer to spice grinder and grind into a fine powder. Set aside.\nSerious Eats / Vicky Wasik\nPlace spur chiles in a small heatproof bowl and add enough hot water to cover. Steep until softened, 10 to 15 minutes. Drain, and cut rehydrated chiles into 1-inch pieces. Transfer to a granite mortar and pestle and pound with salt until pulverized, 3 to 5 minutes.\nSerious Eats / Vicky Wasik\nPounding thoroughly between each addition to break down and incorporate each ingredient into the paste, add lemongrass, curry powder, fresh turmeric, coriander root, garlic, shallots, and ground spice mixture until a very fine paste forms, about 25 minutes. (The additions of the dried spice mixture and curry powder will help absorb moisture released from the other ingredients in the paste, making it easier to pound them into a smooth paste.)\nUse right away\nor transfer curry paste to an airtight container, covering paste with plastic wrap pressed directly onto its surface to prevent it from drying out, and refrigerate for up to 1 week.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nSpice grinder\n,\ngranite mortar and pestle\nNotes\nKashmiri chile powder can be found at South Asian markets and online. If you can’t find Kashmiri chile powder, substitute with 1 1/2 teaspoons cayenne.\nDried spur chiles are a type of Thai chile known as prik cheefa haeng; they have a fruity, mild flavor, and are prized for the color they impart to curry pastes. They can be hard to come by in the US, but are sometimes available online. Alternatively, you can substitute puya or guajillo chiles, which are available at Central American markets.\nThe roots of fresh coriander (a.k.a. cilantro) provide a slight herbal note to curry pastes, but unfortunately they're hard to find in the US, as they are often cut off from the stems before cilantro is brought to market (though local farmers markets in the summer and fall often have coriander with the roots still attached). Coriander roots can be found at Southeast Asian markets. If you can't find the herb with the roots still attached, you can either use the tender stems of fresh cilantro, which won't make too much of a difference in this particular curry, or omit it altogether. And, to clarify, although they are called coriander \"roots,\" Thai cooks usually also use some of the tender green stem.\nMake-Ahead and Storage\nCurry paste can be refrigerated in an airtight container, with plastic wrap pressed directly against the surface of the paste to prevent it from drying out, for up to 1 week, or frozen for up to 3 months.\nThai\nVegetarian\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/prik-gaeng-garee-thai-yellow-curry-paste.webp?"
}