{
  "url": "https://www.seriouseats.com/prik-gaeng-pak-dtai-southern-thai-curry-paste-5191908",
  "image_url": "https://www.seriouseats.com/thmb/GuKdwLKYc375CwqseifGSVP3Gvk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-southern-thai-red-curry-paste-dry-chile-PrikGaengDtai-vicky-wasik-seriouseats-13-0b76c563da9a4dcb8a84c9295b60a49d.jpg",
  "tags": [
    "Thai",
    "Chile Pepper",
    "The Latest"
  ],
  "title": "Prik Gaeng Pak Dtai (Southern Thai Curry Paste)",
  "full_text": "Prik Gaeng Pak Dtai (Southern Thai Curry Paste)\nClose\nJump to recipe\nPrep\n30 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n18\nmedium\ndried Thai chiles\n(\n10\ng\n), stemmed\n1\nteaspoon\n(\n3\ng\n) freshly\nground black pepper\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n5\nmedium\nfresh red Thai chiles\n(\n8\ng\n), stemmed\n1\n(2-inch)\npiece\nfresh\ngalangal\n, peeled and thinly sliced (about\n2\ntablespoons\n;\n15\ng\n) (see note)\n2\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced (about\n20\ng\nsliced lemongrass\n)\n1 1/2\nteaspoons\n(\n3\ng\n) peeled makrut\nlime zest\nfrom\n1\nwhole\nmakrut\nlime\n(optional, see note)\n1\n(\n3-inch; 10 g) piece\nfresh turmeric\n, thinly sliced\n3\nsmall\ngarlic cloves\n(\n10\ng\n)\n1\nsmall\nshallot\n(\n20\ng\n), thinly sliced\n1\nteaspoon\n(\n10\ng\n)\nThai shrimp paste\nDirections\nPlace dried Thai chiles in a spice grinder or mortar and pestle, and grind into a fine powder. If using a spice grinder, transfer ground chiles to a granite mortar and pestle. Add black pepper, salt, and fresh Thai chiles to the mortar. Pound until fresh chiles are slightly broken down, making sure to keep the pestle as close to the chiles as possible to avoid splattering chile juices over yourself, 2 to 3 minutes.\nVicky Wasik\nPounding thoroughly between each addition to break down and incorporate ingredients into the paste (3 to 4 minutes of pounding per addition) add in the following order: galangal; lemongrass; makrut lime zest (if using); turmeric; garlic and shallots; shrimp paste. It should take about 25 minutes total to pound ingredients into a very fine paste with just a few visible pieces of fresh chile skin. Use right away or transfer curry paste to an airtight container, covering paste with plastic wrap pressed directly onto its surface to prevent it from drying out, and refrigerate for up to 1 week or freeze for up to 3 months.\nVicky Wasik\nSpecial Equipment\nSpice grinder\n,\ngranite mortar and pestle\nNotes\nGalangal is a rhizome and an integral part of basic red curry pastes. If you are in the US, it's usually best to peel it before slicing as most of what we get is mature galangal, which is very tough to work with. While galangal looks like ginger, they are not interchangeable, as their flavors are very different.\nFresh makrut limes can be hard to find in the US. You can order them online, though they are a seasonal product and may not always be available (note that they are often sold under a different name that we avoid using, as it is a\nderogatory term in some contexts\n); you may also be able to find them in the freezer section at Southeast Asian markets. Makrut lime zest freezes well. If you cannot find makrut lime, you are better off omitting it, as the more common Persian lime and other citrus are not good substitutes.\nMake-Ahead and Storage\nCurry paste can be refrigerated in an airtight container, with plastic wrap pressed directly against the surface of the paste to prevent it from drying out, for up to 1 week, or frozen for up to 3 months.\nThai\nChile Pepper\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/prik-gaeng-pak-dtai-southern-thai-curry-paste.webp?"
}