{
  "url": "https://www.seriouseats.com/prik-gaeng-massaman-thai-massaman-curry-paste-5190555",
  "image_url": "https://www.seriouseats.com/thmb/Gvf-Xt-ZwhSViGbf-DrGRhinWEo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-thai-massaman-curry-paste-PrikGaengMassaman-vicky-wasik-seriouseats-25-4bad36084d984158bd94fae49b3f9733.jpg",
  "tags": [
    "Thai",
    "The Latest"
  ],
  "title": "Prik Gaeng Massaman (Thai Massaman Curry Paste)",
  "full_text": "Prik Gaeng Massaman (Thai Massaman Curry Paste)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nCooling Time\n15 mins\nTotal\n60 mins\nServes\n8 servings\nMakes\n4 ounces\nCook Mode\n(Keep screen awake)\nIngredients\n5\nThai or Chinese white\ncardamom\npods\n(see note)\n1\ncinnamon\nstick\n, broken into pieces\n1\npiece\nwhole nutmeg\n, broken into pieces\n10\nwhole\ncloves\n6\nblades\nmace\n2\nteaspoons\ncoriander seeds\n1\nteaspoon\nwhole\ncumin seeds\n1\nteaspoon\nwhite\npeppercorns\n10\nmedium\ndried spur chiles\n(\n15\ng\n), stemmed and seeded (see note)\n2\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced (about\n20\ng\nsliced\nlemongrass\n)\n4\nsmall\nshallots\n(\n75\ng\n), thinly sliced\n7\nsmall\ngarlic cloves\n(\n25\ng\n), thinly sliced\n3\nwhole\ncoriander roots\n(\n10\ng\n), cleaned and thinly sliced (see note)\n1 1/2\nteaspoons\n(\n15\ng\n) Thai\nshrimp paste\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\nDirections\nPlace cardamom, cinnamon, and nutmeg in a medium nonstick skillet and set over medium-low heat. Cook, tossing frequently, until fragrant, about 5 minutes. Add cloves, mace, coriander seeds, cumin, and white peppercorns, and continue to cook, tossing frequently, until spices are fragrant and darkened in spots, 4 to 5 minutes longer. Remove from heat and allow to cool slightly. Transfer to a spice grinder and grind into a fine powder. Transfer mixture to a small bowl, and set aside.\nVicky Wasik\nAdd spur chiles to now-empty skillet and toast over medium-low heat until fragrant and charred in spots, 2 to 3 minutes. Set aside to cool for 2 minutes, then transfer to spice grinder and grind into a fine powder. Set aside.\nVicky Wasik\nAdd lemongrass to skillet and cook over medium heat, stirring frequently, until dry and lightly  charred at edges, about 5 minutes. Transfer to a plate or rimmed baking sheet and set aside. Add shallots to skillet and cook over medium-low heat, stirring frequently, until shallots just begin to shrivel and char at edges, 2 to 3 minutes. Add coriander root and garlic, and continue to cook, stirring frequently, until  lightly charred at edges, about 3 minutes. Transfer to plate with lemongrass, and set aside to cool.\nVicky Wasik\nSpread shrimp paste evenly in the center of a 10- by 6-inch piece of foil (or a 10- by 6-inch piece of banana leaf). Close foil to form a flat packet, add to now-empty skillet, and toast over medium-low heat, turning occasionally, until fragrant, about 5 minutes. Remove from heat and set aside.\nVicky Wasik\nCombine toasted lemongrass, shallots, coriander root, and garlic with salt in a granite mortar and pestle. Pound until a coarse paste forms, 2 to 3 minutes. Pounding thoroughly between each addition to break down and incorporate ingredients into the paste, add ground spur chiles, toasted shrimp paste, and ground spice mixture until a very fine, dry, sticky paste forms, about 10 minutes longer. While pounding, use a spoon to occasionally flip the paste over in the mortar to ensure a consistent final texture. Use right away or transfer curry paste to an airtight container, covering paste with plastic wrap pressed directly onto its surface to prevent it from drying out.\nVicky Wasik\nSpecial Equipment\nSpice grinder\n,\ngranite mortar and pestle\nNotes\nThai or Chinese white cardamom can be found in Southeast and East Asian markets or online. Its flavor is both more floral and subdued than green cardamom's.\nDried spur chiles are a type of Thai chile known as prik cheefa haeng; they have a fruity, mild flavor, and are prized for the color they impart to curry pastes. They can be hard to come by in the US, but are sometimes available online. Alternatively, you can substitute puya or guajillo chiles, which are available at Central American markets.\nThe roots of fresh coriander (a.k.a. cilantro) provide a slight herbal note to curry pastes, but are unfortunately hard to find in the US, as they are often cut off from the stems before going to market (though local farmers markets in the summer and fall often have coriander with the roots still attached). Coriander roots can also be found at Southeast Asian markets. Although slightly less aromatic, we used the tender stems in this curry due to availability.\nMake-Ahead and Storage\nCurry paste can be refrigerated in an airtight container, with plastic wrap pressed directly against the surface of the paste to prevent it from drying out, for up to 2 weeks, or frozen for up to 3 months. Massaman curry paste freezes well due to its low moisture content.\nThai\nThe Latest"
}