{
  "url": "https://www.seriouseats.com/profiteroles-5188510",
  "image_url": "https://www.seriouseats.com/thmb/oN0XXRAYpQqfRrefFnhOvUBmuWg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210609-profiteroles-debbie-wee-seriouseats-17-b1ac56cd654549bc896307e919b26edc.jpg",
  "tags": [
    "Pastries",
    "French",
    "Pastries",
    "Ice Cream",
    "The Latest"
  ],
  "title": "Profiteroles",
  "full_text": "Profiteroles\nClose\nJump to recipe\nPrep\n15 mins\nCook\n65 mins\nFreezing and Cooling Time\n55 mins\nTotal\n2 hrs 15 mins\nServes\n18 profiteroles\nCook Mode\n(Keep screen awake)\nIngredients\n1\nquart\nhomemade\nor store-bought\nvanilla ice cream\n, softened slightly (see notes)\n1\nrecipe\nchoux pastry\n(made with water and optional sugar),\ntransferred to a pastry bag\nfitted with a 1/2-inch plain, round tip\nPowdered sugar\n, for dusting\nFor the Chocolate Sauce:\n8\nounces\nbittersweet chocolate\n, about 60%, chopped (\n1 1/2\ncups\n;\n230\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\ninstant espresso powder\n1 1/4\ncups\n(\n295\nml\n)\nheavy cream\nDirections\nLine a rimmed baking sheet with parchment paper and place in freezer until cold, about 10 minutes. Remove prepared baking sheet from freezer. Using a 2-ounce ice cream scoop, scoop 18 balls of ice cream onto prepared baking sheet and place in freezer until ice cream is firm, about 30 minutes.\nDebbie Wee\nAdjust oven racks to upper-middle and lower-middle positions and preheat oven to 400°F (204°C). Line two rimmed baking sheets with parchment paper. Pipe a small amount of choux paste under each corner of parchment paper (the dough acts as a glue and keeps the paper in place as you pipe).\nVicky Wasik\nTo pipe the choux puffs, hold the filled pastry bag at a 90° angle, apply steady downward pressure, and pipe a 2-inch-wide mound (see note). To stop piping, cease applying pressure and swirl the pastry tip away. Continue to pipe choux mounds about 3 inches apart, for a total of 9 choux mounds. Repeat with second tray. To smooth the surface of any uneven choux mounds, dip a finger into cold water and gently pat down any bumps. Dust choux mounds evenly with powdered sugar.\nDebbie Wee\nBake both trays until choux mounds are puffed, deeply golden brown, and feel hollow when lifted, about 25 minutes. Turn off oven, crack the door open, and let stand for 30 minutes to allow profiteroles to dry and fully set. Remove from oven and let cool completely, about 15 minutes.\nDebbie Wee\nTo Make the Chocolate Sauce:\nIn a heatproof medium bowl that will sit comfortably on top of a 1-quart stainless steel saucepan without toppling over, combine chocolate, salt, and espresso powder. In a 1-quart stainless-steel saucepan, heat cream over medium-high heat until it has reached a simmer and started to bubble hard around the edges. Immediately pour hot cream over chocolate and let stand 1 minute. Whisk until smooth.\nDebbie Wee\nClean saucepan and fill with 1 inch water. Bring to a boil over high heat. Turn off heat, then carefully set bowl with chocolate sauce on top of the saucepan to keep warm.\nDebbie Wee\nTo serve, using a serrated knife, slice each choux puff in half to create a top and bottom \"bun.” Place a scoop of ice cream on each bottom half. Cover with the top half of each puff. Serve profiteroles immediately with chocolate sauce drizzled on top.\nDebbie Wee\nSpecial Equipment\n2-ounce\nice cream scoop,\ndisposable pastry bags, 1-quart stainless-steel saucepan,\nserrated knife\nNotes\nYou can swap 1 quart of vanilla ice cream with a different ice cream flavor of your choice.\nIf you want to make sure that each profiterole is the right size, you can prepare a template ahead of time. Take one sheet of parchment paper and, using a 2-inch round cutter as a guide, trace 9 circles that are 3 inches apart. Flip paper upside down and set it on the baking sheet. Repeat with a second piece of parchment paper.\nMake-Ahead and Storage\nProfiteroles are best consumed on the day they’re made.\nThe ice cream scoops can be prepared in advance. In an airtight container, arrange frozen scoops in single layers, making sure to place parchment paper between each layer, and store in the freezer for up to 2 weeks.\nThe chocolate sauce can be prepared in advance, allowed to cool completely at room temperature, then refrigerated in an airtight container for up to 5 days. To rewarm, transfer sauce to a wide, shallow, microwave-safe bowl and microwave in 15 second increments, stirring after each increment, until sauce is completely smooth. Alternatively, if you don’t have a microwave, fill a 1-quart stainless-steel saucepan with 1 inch of water and place over medium heat. Transfer sauce to a medium heatproof bowl that will sit comfortably on the pot without toppling over or touching the water below. Stir until sauce is smooth and warm.\nTo store unfilled choux puffs, wrap them tightly in plastic and place in an airtight container; they can be kept frozen for up to 1 month. To refresh frozen choux puffs, preheat oven to 350°F (177°C). Transfer frozen choux puffs to a rimmed baking sheet and reheat until crisp, about 5 minutes. Let cool to room temperature before filling.\nPastries\nFrench\nPastries\nIce Cream\nThe Latest"
}