{
  "url": "https://www.seriouseats.com/puff-puff-5537120",
  "image_url": "https://www.seriouseats.com/thmb/Nu0tR17GqQjiNALnk4WWKHAIlbI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220705-PuffPuffMaureen-Celestine-21-b365ebc25e3d4dde978c02c19cc5b2cd.JPG",
  "tags": [
    "Nigerian",
    "Sides",
    "Snacks & Appetizers",
    "Frying",
    "Vegetarian"
  ],
  "title": "Puff Puff (Nigerian Fried Yeasted Dough)",
  "full_text": "Puff Puff (Nigerian Fried Yeasted Dough)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nRising Time\n45 mins\nTotal\n85 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n13\nounces\nall-purpose flour\n(\n360\ng\n; about\n2 3/4\ncups\n)\n7\nounces\nsugar\n(\n200\ng\n;\n1\ncup\n)\n4\nteaspoons\n(\n13\ng\n)\nfast-acting yeast\n1/4\nteaspoon\nfreshly grated\nnutmeg\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\n2\nquarts\n(\n1.9\nL\n) vegetable or other\nneutral oil\n, for frying\nDirections\nIn a large bowl, thoroughly whisk together flour, sugar, yeast, and nutmeg, about 1 minute. In a small bowl, combine vanilla extract with 2 cups (475ml) lukewarm water.\nSerious Eats / Maureen Celestine\nIn the center of the flour mixture, make a well about 4 inches wide. Pour vanilla water into well, and, using a wooden spoon, gradually stir flour into the water until a thick, sticky batter has formed and no lumps remain, about 5 minutes (batter should have the same consistency as cake batter with a few bubbles). Cover bowl loosely with plastic wrap or a clean, damp kitchen towel, and let sit at warm room temperature (75°F/24°C) until roughly doubled in size, about 45 minutes.\nSerious Eats / Maureen Celestine\nLine a rimmed baking sheet with paper towels. In a wok or large Dutch oven, heat oil over medium-high heat to 330°F (165°C). Using a 1-tablespoon cookie scoop, dip scoop in hot oil, then scoop a 1-tablespoon portion of batter and carefully add to oil, dropping portion from as close to the oil’s surface as possible to minimize splashing. (Alternatively, using two spoons dipped in the hot oil, scoop roughly 1-tablespoon of batter onto first spoon, and, using second spoon, gently form into a round shape, then carefully release into hot oil). Working quickly, repeat process until wok is full but not overcrowded. Fry puff puff, using a spider or slotted spoon to turn them as they cook, until puffed and golden brown on all sides, about 6 minutes. Transfer puff puff to prepared baking sheet.\nSerious Eats / Maureen Celestine\nReturn oil to 330°F (165°C) and repeat frying with remaining batter, continuing to work in batches. Transfer puff puff to a serving bowl and serve hot, warm, or at room temperature. Puff puff can be eaten on its own, tossed in spiced sugar, or with a dip (see recipe headnote for more serving ideas).\nSerious Eats / Maureen Celestine\nSpecial Equipment\nRimmed baking sheet, spider skimmer or slotted spoon, wok or large Dutch oven, instant-read thermometer, 1-tablespoon cookie scoop (optional).\nMake-Ahead and Storage\nPuff puff can be refrigerated in an airtight container for up to 5 days or frozen for up to 1 month. To warm puff puff, cover with a damp paper towel and reheat in the microwave in 10-second intervals.\nNigerian\nSides\nSnacks & Appetizers\nFrying\nVegetarian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/puff-puff-nigerian-fried-yeasted-dough.webp?"
}