{
  "url": "https://www.seriouseats.com/pull-apart-thanksgiving-stuffing-roll-bread-recipe",
  "image_url": null,
  "tags": [
    "Sides",
    "Thanksgiving Stuffings",
    "Rolls & Buns",
    "Sausages",
    "Thanksgiving Side Dishes"
  ],
  "title": "Pull-Apart Stuffing Rolls Recipe",
  "full_text": "Pull-Apart Stuffing Rolls Recipe\nJump to recipe\nPrep\n15 mins\nCook\n55 mins\nActive\n30 mins\nRising Time\n4 hrs\nTotal\n5 hrs 10 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ntablespoons\n(\n57\ng\n)\nbutter\n, divided\n8\nounces\n(\n225\ng\n) sage sausage or\nbreakfast sausage\n, removed from casings (see notes)\n1\nsmall\nonion\n, finely chopped (about\n3/4\ncup\n)\n1\nrib\ncelery\n, finely chopped (about\n1/2\ncup\n)\n4\nmedium\ncloves garlic\n, finely chopped\n1/4\ncup\n(\n7\ng\n) minced\nfresh sage leaves\n1/4\ncup\n(\n7\ng\n) minced\nfresh parsley\nleaves\nKosher salt\nand freshly ground black pepper\nAll-purpose flour\n, for dusting\n1\npound\n(\n450\ng\n)\nhomemade\nor store-bought\npizza dough\n(see notes)\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nDirections\nMelt 2 tablespoons (28g) butter in a large skillet over medium-high heat. Add sausage and mash with a stiff whisk or potato masher to break up into fine pieces (the largest pieces should be no bigger than 1/4 inch). Cook, stirring frequently, until only a few bits of pink remain, about 8 minutes. Add onion, celery, garlic, and sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Add parsley and season to taste with salt and pepper. Transfer contents to a large bowl and set aside until completely cool.\nWhile filling cools, make knots. On a lightly floured surface, divide dough into 2 even pieces. Working with one piece at a time, roll or stretch into an oblong strip about 8 inches long and 4 inches wide. With a bench scraper or knife, cut crosswise into 12 strips. Repeat with other half of dough.\nTie each strip into a knot and transfer to bowl with sausage mixture. Toss and fold with your hands, very gently, until every knot is thoroughly coated in sausage mixture. Grease a 9- by 13-inch baking dish with 1 tablespoon (14g) butter. Transfer knots to baking dish in a single layer. Drizzle with olive oil, cover tightly with plastic, and set aside until doubled in size, about 4 hours. Alternatively, refrigerate until doubled in size, 12 to 16 hours. Or cover in aluminum foil and freeze for up to a week, thaw completely in the refrigerator, and bring the rolls up to room temperature for an hour before baking.\nWhen ready to bake, adjust oven rack to center position and preheat oven to 425°F (220°C). Unwrap rolls. Transfer to oven and bake until golden brown and crisp, 25 to 30 minutes.\nWhen rolls are almost ready, melt remaining tablespoon butter in the microwave or on the stovetop. Remove rolls from oven and immediately brush on butter. Serve with\ngravy\nand\ncranberry sauce\non the side.\nSpecial Equipment\n9- by 13-inch baking dish,\nlarge cast iron skillet\nNotes\nOther\ncured meats\ncut into fine dice, like bacon, pancetta, or chorizo, can be used in place of the sausage. Because of how intensely flavored these rolls are, this is a case in which store-bought dough (which is often under-seasoned) works just as well as homemade. So feel free to take the easy road here and use premade pizza dough—you won't be sacrificing any flavor.\nSides\nThanksgiving Stuffings\nRolls & Buns\nSausages\nThanksgiving Side Dishes"
}