{
  "url": "https://www.seriouseats.com/pull-apart-garlic-knots-recipe-11688854",
  "image_url": "https://www.seriouseats.com/thmb/0pFsCwmLc-gBvZurtceW8LQWjyU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250220-SEA-EasyPullApartGarlicKnots-JenCausey-Beauty2-22-2fc78510801b469195e5e720d8b14ff1.jpg",
  "tags": [
    "Bread",
    "The Latest",
    "Snacks & Appetizers",
    "Rolls & Buns"
  ],
  "title": "Easy, Cheesy Pull-Apart Garlic Knots",
  "full_text": "Easy, Cheesy Pull-Apart Garlic Knots\nClose\nJump to recipe\nPrep\n105 mins\nCook\n30 mins\nCooling Time\n5 mins\nTotal\n2 hrs 20 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n8\ntablespoons\n(\n113\ng\n)\nunsalted butter\n1/4\ncup\n(\n60\nml)\nextra-virgin olive oil\n6\nmedium\ncloves garlic\n(\n30\ng)\n, grated on a rasp grater\n1/2\nteaspoon\ncrushed red pepper flakes\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\ncup\nfinely chopped fresh f\nlat-leaf parsley\n(about\n0.5\nounce\n;\n13\ng\n), divided, plus more for serving\n22- to 24\n-\nounces\n(\n624 to 680\ng\n) store-bought fresh\npizza dough\nor\nhomemade New York-style pizza dough\n, at room temperature (see notes)\n2\nounces\n(\n56\ng\n)\nGruyère cheese\n, finely shredded (about\n1/2\ncup\n)\n1\nounce\ngrated\nParmesan cheese\n(\n28\ng\n, about\n1/4\ncup\n), plus more for serving\nHomemade\nor s\ntore-bought\npizza sauce\nfor serving,\noptional\nDirections\nIn a small saucepan, melt butter over low heat. Add olive oil, garlic, crushed red pepper, and salt; cook, stirring often, until fragrant and butter mixture turns a light golden brown, 4 to 5 minutes. Stir in 2 tablespoons of parsley. Set aside and let cool until just warm, about 15 minutes.\nSerious Eats / Jen Causey\nOn a lightly floured surface, divide dough into 2 even pieces. Working one piece at a time, roll or stretch into an oblong about 8 inches long and 4 inches wide. With a bench scraper or knife, cut crosswise into 12  (8-inch long) strips that are about 1 ounce or 28 g each. Tie each strip into a knot. Transfer 1/3 cup garlic-butter mixture to a large bowl; leave remaining garlic-butter mixture in saucepan and set aside. In bowl with reserved garlic-butter, gently toss knots in garlic-butter until evenly coated, letting excess butter drip back into bowl. In a 10-inch cast iron skillet, arrange knots in a single layer evenly spaced apart. Cover loosely with plastic wrap. Let proof at warm room temperature until dough springs back very slowly to the touch, and almost doubles in size, about 1 hour.\nSerious Eats / Jen Causey\nMeanwhile, adjust oven rack to middle position, and preheat oven to 400°F (205ºC). Remove plastic wrap from knots, and discard. Bake knots until edges start to brown, 20 to 22 minutes. Remove from oven; sprinkle evenly with Gruyère and Parmesan. Return to oven, and continue to bake until cheese is fully melted and just beginning to brown in spots, about 5 minutes. Transfer skillet to a wire rack and let cool for 5 minutes.\nSerious Eats / Jen Causey\nMeanwhile, reheat remaining garlic-butter mixture in small saucepan over low heat until warmed through, 1 to 2 minutes. Remove from heat, and stir in remaining 2 tablespoons parsley. Transfer to a serving bowl.\nSerious Eats / Jen Causey\nSprinkle garlic knots with additional Parmesan and parsley. Serve with warmed garlic butter and pizza sauce, if using.\nSerious Eats / Jen Causey\nSpecial Equipment\nSmall saucepan, 10-inch cast iron skillet, wire rack\nNotes\nBecause of how intensely flavored these garlic knots are, this is one case where store-bought dough (which is often under-seasoned) works just as well as homemade. So feel free to take the easy road here and use pre-made pizza dough—you won't be sacrificing any flavor.\nWe have given a range in dough about (22 to 24 ounces) to accommodate variability in weight dough weight is sold in. If using 22 ounces\nMake-Ahead and Storage\nPrepared garlic butter can be refrigerated in an airtight container for up to 3 days.\nGarlic knots can be prepared through step 2 before proofing, covered loosely with plastic wrap and refrigerated up to 12 hours. Proceed with the recipe as directed, and increase the proofing time at room temperature to 90 minutes.\nLeftover baked garlic knots can be stored in an airtight container at room temperature for up to 2 days. To reheat, preheat your oven to 350°F. Wrap bread loosely in aluminum foil and bake at 350°F (175℃) until warmed through and cheese is melted, 10 to 15 minutes.\nBread\nThe Latest\nSnacks & Appetizers\nRolls & Buns"
}