{
  "url": "https://www.seriouseats.com/pulpo-gallego-octopus-spanish-galicia-tapas-recipe",
  "image_url": "https://www.seriouseats.com/thmb/P6r2B35TBeiSBd7De4Ig0Ia6G5w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160512-octopus-vicky-wasik-8-4478c2c6552f4de3861079ca1b9fe0ec.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Octopus",
    "Spanish",
    "Pressure Cooker",
    "Christmas Appetizers"
  ],
  "title": "Classic Pulpo Gallego (Galician Octopus Tapa) Recipe",
  "full_text": "Classic Pulpo Gallego (Galician Octopus Tapa) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nCooling Time\n10 mins\nTotal\n30 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n2 1/2-pound; 1 kg\n)\nwhole octopus\n, rinsed well (including inside head cavity)\n1\nmedium\nyellow onion\n, peeled and halved (optional)\n3\nmedium\ncloves garlic\n(optional)\nKosher salt\n(see note)\nExtra-virgin olive oil\n, for drizzling\nPimentón dulce\n(sweet smoked Spanish paprika), to taste (see note)\nDirections\nIf Using a Pressure Cooker:\nPlace octopus in pressure cooker and add just enough water to cover. (Be sure to keep water level below pressure cooker's maximum fill line.) Add onion and garlic, if using, along with a couple of large pinches of salt. Close pressure cooker and bring to high pressure (12 to 15 psi). Once cooker has reached high pressure, cook for 15 minutes.\nSerious Eats / Vicky Wasik\nUsing steam-release valve, depressurize cooker rapidly. Check octopus for tenderness by sliding a paring knife into the thickest part of one of its tentacles; it should slide in easily with little resistance. If octopus is not tender enough, return to high pressure and cook for 5 minutes longer. (Fifteen minutes was the correct time based on all our tests, but variations in the octopus, such as size, and in the pressure cooker used may change the cooking time slightly.) Let octopus cool slightly in its cooking liquid, then drain and discard onion and garlic. Continue with step 4.\nIf Using a Conventional Pot:\nPlace octopus in a large pot and add enough water to cover by at least 2 inches. Add onion and garlic, if using, along with a couple of large pinches of salt. Bring to a simmer over high heat, then lower heat and continue to simmer until octopus is tender (a paring knife should slide into the thickest part of one of its tentacles easily), 1 to 2 hours. Let octopus cool slightly in its cooking liquid, then drain and discard onion and garlic.\nTo Serve:\nCut out and discard the hard beak (if it hasn't been removed already by the fishmonger), which is found in the center of the base of the octopus body, where the tentacles converge. Cut out and discard the section of the head with eyes; the rest of the head is edible. Separate tentacles into individual pieces.\nSerious Eats / Vicky Wasik\nCut tentacles crosswise into 1/2-inch-thick rounds and head into small strips. Arrange on a plate in a single layer. Sprinkle salt all over, drizzle with olive oil, and dust with smoked paprika to taste. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nElectric or stovetop\npressure cooker\nNotes\nFeel free to add a touch of hot pimentón in addition to the sweet (i.e., not spicy) kind, if you have it and if that appeals to you. You can use kosher salt for sprinkling on the dish before serving, a tender sea salt like fleur de sel, or a flaky salt like Maldon.\nRead More\nGrilled Octopus With Chile-Herb Oil\nOctopus Poke With Kimchi\nThe Best Ways to Cook Octopus\nHow to Shop for Sustainable Seafood\nHors D'Oeuvres\nOctopus\nSpanish\nPressure Cooker\nChristmas Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/classic-pulpo-gallego-galician-octopus-tapa-recipe.webp?"
}