{
  "url": "https://www.seriouseats.com/pumpkin-spice-latte-tiramisu-recipe-8732696",
  "image_url": "https://www.seriouseats.com/thmb/E824Dm7bUzEj9CYeiNmgHcBwZ5M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241001-SEA-PSLTiramisu-RobbyLozano-Hero1-36-b8fad8e75af647f297a1fb068031bc4b.jpg",
  "tags": [
    "Fall Desserts",
    "The Latest",
    "Desserts",
    "Fall",
    "Pumpkin"
  ],
  "title": "Pumpkin Spice Latte Tiramisu",
  "full_text": "Pumpkin Spice Latte Tiramisu\nClose\nJump to recipe\nPrep\n30 mins\nChilling Time\n8 hrs\nTotal\n8 hrs 30 mins\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncup\ns (480ml) strong brewed\ncoffee\n, such as espresso, coffee brewed in a Moka pot, or coffee concentrate\n6\ntablespoons\ncoffee liqueur\n(90ml; 85g)\n1 1/2\nteaspoons\nvanilla extract\n6\nlarge\negg yolks\n(4 1/4 ounces; 120g)\n2/3 cup\ngranulated sugar\n(\n4 3/4\nounces\n; 135g)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\ncups\ncold\nmascarpone cheese\n(8 ounces; 227g)\n1 cup\npumpkin purée\n(\n8 1/2\nounces\n; 240g), such as Libby’s\n1 1/2\nteaspoons\npumpkin pie spice\n1\ncup\n(240ml)\nheavy cream\n48\nladyfingers\n(\n7\nounces\n; 200g)\n2\nteaspoons\nground cinnamon\n1\nteaspoon\nespresso\npowder\nDirections\nIn a medium bowl, combine coffee, coffee liqueur, and vanilla extract; set aside.\nSerious Eats / Robby Lozano\nIn a stand mixer fitted with the whisk attachment, whip egg yolks, sugar, and salt on medium-high speed until pale yellow and quadrupled in size, 1 1/2 to 2 minutes. Using a flexible rubber spatula, scrape down sides and bottom of the bowl. Add mascarpone cheese and beat on medium-high speed until incorporated and fluffy, about 45 seconds. Scrape down sides and bottom of bowl, and add pumpkin and pumpkin pie spice. Beat on medium-high speed until light and fluffy and no lumps remain, about 1 minute. Transfer mixture to a large bowl; do not clean stand mixer bowl or whisk attachment.\nSerious Eats / Robby Lozano\nBeat cream in same stand mixer bowl on medium-high speed with whisk attachment until stiff peaks form, 2 to 3 minutes. Using a rubber spatula, add about 1/3 of the whipped cream to mascarpone mixture and gently fold until combined. Add remaining whipped cream and gently fold until no streaks remain.\nSerious Eats / Robby Lozano\nWorking one at a time, dip 24 ladyfingers into coffee mixture, rotating fully to coat and giving it two or three seconds to absorb the liquid, then transfer to a 9- by 13-inch baking dish. (See notes.) Arrange soaked ladyfingers in a single layer, breaking or trimming ladyfingers as needed to fit neatly. Top with half of the mascarpone mixture (about 3 1/2 cups), and, using a flexible or offset spatula, spread into an even layer. Repeat with remaining ladyfingers, then top with remaining mascarpone mixture and spread until smooth.\nSerious Eats / Robby Lozano\nIn a small bowl, whisk ground cinnamon and instant espresso powder to combine. Using a fine mesh sieve, lightly dust top of tiramisu with cinnamon and espresso mixture. Loosely cover with plastic wrap and refrigerate for at least 8 hours or up to 3 days; serve cold.\nSerious Eats / Robby Lozano\nSpecial Equipment\nStand mixer, 9- by 13-inch baking dish\nNotes\nDo not submerge ladyfingers in coffee mixture; dipping should take no longer than 3 seconds for each biscuit.\nMake-Ahead and Storage\nTiramisu can be refrigerated for up to 3 days.\nFall Desserts\nThe Latest\nDesserts\nFall\nPumpkin",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pumpkin-spice-latte-tiramisu.webp?"
}