{
  "url": "https://www.seriouseats.com/pumpkin-chiffon-pie-recipe-8750356",
  "image_url": "https://www.seriouseats.com/thmb/IC4I8XezlrfNM-_AOEXfIPFNFqI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210930-pumpkin-chiffon-pie-vicky-wasik-30-a8ce091f162142dfbb431ed96b98df7c.jpg",
  "tags": [
    "Desserts",
    "Pies",
    "Butternut Squash",
    "Thanksgiving Desserts",
    "Fall Desserts"
  ],
  "title": "Pumpkin Chiffon Pie",
  "full_text": "Pumpkin Chiffon Pie\nClose\nJump to recipe\nPrep\n35 mins\nCook\n75 mins\nCooling and Chilling Time\n5 hrs 25 mins\nTotal\n7 hrs 15 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pumpkin Base:\n1\nlarge\npound\nbutternut squash\n(about 2 1/4 pounds; 1021g), halved lengthwise and seeded (see note)\n1/4 cup (\n60\nml\n)\nwater\nOne 1/4-ounce envelope (about 2 1/4 teaspoons;\n7\ng\n) unflavored\ngelatin\n(see note)\n3\nlarge\negg yolks\n(2 ounces; 56g)\n1/2\ncup\ngranulated sugar\n(3 1/2 ounces; 100g)\n1/2 cup (\n120\nml\n)\nwhole milk\n1/2\nteaspoon\nground cinnamon\n, plus more for garnish\n1/2\nteaspoon\nground ginger\n1/4\nteaspoon\nground nutmeg\n1 teaspoon (\n5\nml\n)\nvanilla extract\nFor the Swiss Meringue (See Note):\n3 large\negg whites\n(\n3 1/4\nounces\n; 90g)\n2/3 cup\ngranulated sugar\n(\n4 3/4\nounces\n; 134g)\n1/8\nteaspoon\ncream of tartar\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nTo Assemble:\n1\npie dough\n,\nhomemade\nor store-bought\nBrown sugar whipped cream\nor\nwhipped cream\n, for topping\nDirections\nFor the Pumpkin Base:\nAdjust oven rack to lower-middle position and preheat to 400°F (205°C). Place squash halves cut-side down on a foil-lined aluminum baking sheet. Roast until fork-tender, about 45 minutes. Let stand until cool enough to handle, 15 to 20 minutes. Scrape pulp into a food processor, discarding skins, and purée until smooth, about 1 to 2 minutes. Measure out 14 ounces (395g; about 1 2/3 to 1 3/4 cups) squash purée (leftovers can be refrigerated for another use). Use warm, or refrigerate in an airtight container for up to 1 week.\nVicky Wasik\nAdd the water to a small bowl and sprinkle gelatin evenly on top. Let stand until gelatin absorbs the water and becomes translucent, about 5 minutes.\nVicky Wasik\nn a 2- to 3-quart saucepan, add the egg yolks, sugar, milk, cinnamon, ginger, and nutmeg and whisk to combine. Turn the heat to medium and cook, whisking frequently, until mixture thickens slightly, about 4 to 5 minutes. A few bubbles are okay, but do not let it boil; adjust heat as needed.\nVicky Wasik\nOnce the custard has thickened, reduce heat to low and stir in bloomed gelatin. Whisk until gelatin is completely dissolved and no lumps remain, about 45 seconds.\nVicky Wasik\nTurn off heat and whisk in butternut squash purée and vanilla extract. Transfer mixture to a large bowl and chill in an ice-water bath, stirring occasionally, until cool to touch, about 10 minutes.\nVicky Wasik\nFor the Swiss Meringue:\nFill a wide pot with at least 1 1/2 inches of water, with a thick ring of crumpled tinfoil placed inside to act as a \"booster seat.\" Place over high heat until steaming-hot, then adjust temperature to maintain a simmer. Combine egg whites, sugar, cream of tartar, and salt in the bowl of a stand mixer. Set on foil booster seat over steaming water, stirring and scraping constantly with a flexible spatula, until egg whites hold steady at 145°F (63°C), 16 to 20 minutes (if the temperature seems to be rising too slowly, crank up the heat; see notes). Transfer to a stand mixer fitted with a whisk attachment and whip at high speed until meringue is glossy and beginning to ball up inside the whisk, about 3 to 5 minutes.\nVicky Wasik\nAdd about one third of remaining meringue into cold squash mixture and, using a flexible spatula, fold gently until just incorporated. Fold in remaining meringue in two additions until smooth and combined.\nVicky Wasik\nTo Assemble:\nScrape filling into prepared, blind-baked crust and spread in an even layer. Cover loosely and refrigerate until filling is firm and cold, at least 5 hours and up to overnight.\nVicky Wasik\nWhen ready to serve, top pie with whipped cream and sprinkle with cinnamon. Slice into wedges with a hot chef’s knife, rinsing the knife under hot running water and wiping it dry between slices. Carefully slide a pie server under the crust, making sure it reaches all the way to the tip of each wedge, and serve.\nVicky Wasik\nSpecial Equipment\n9-inch glass deep-dish pie plate,\nfood processor\n,\nwhisk\n, 3-quart saucepan,\nstand mixer\n, flexible spatula, chef’s knife\nNotes\n14 ounces (395g; about 1 3/4 cups) canned pumpkin purée can be used in place of homemade butternut squash purée.\nThis recipe was not tested with sheet gelatin, which can vary substantially in bloom strength and use. For best results, use unflavored gelatin, such as the produced by the brand Knox.\nThis recipe makes just the small amount of  Swiss meringue needed for the chiffon pie, but it can be easier to make the Swiss meringue successfully in larger batches. If you're not as experienced at making Swiss meringue, it's possible to double all of the meringue ingredients and make as directed, keeping in mind the egg white mixture may take longer to reach the desired temperature. Fold half of the meringue into filling as directed. Use excess meringue to bake off as kisses, use for toppings, layer onto a cookie sandwich or s’more, and beyond. If you’re concerned about the safety of only cooking the egg whites to 145°F (63ºC), you can continue to cook them, stirring constantly, for an additional 9 minutes once they have reached the appropriate temperature. In terms of food safety, this would be the equivalent of cooking the egg white mixture to 160°F (71ºC).\nMake-Ahead and Storage\nThe raw pie dough can be made, shaped, and refrigerated up to 24 hours in advance, if well wrapped in plastic. The butternut squash purée can be refrigerated in an airtight container up to 1 week in advance.\nWrapped in plastic, leftover pie can be refrigerated for up to 5 days.\nDesserts\nPies\nButternut Squash\nThanksgiving Desserts\nFall Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pumpkin-chiffon-pie.webp?"
}