{
  "url": "https://www.seriouseats.com/puntarelle-alla-romana-recipe-7091445",
  "image_url": "https://www.seriouseats.com/thmb/GaDSXOZ-d0ndmFgKqv5AYaqu-gI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221221-Punterelle-AndrewJanjigian-41-3deed02dabec417cac47747e4836fe7c.JPG",
  "tags": [
    "Italian",
    "The Latest",
    "Greens",
    "Green Salads"
  ],
  "title": "Puntarelle Alla Romana (Puntarelle Salad With Anchovy and Garlic Dressing)",
  "full_text": "Puntarelle Alla Romana (Puntarelle Salad With Anchovy and Garlic Dressing)\nClose\nJump to recipe\nPrep\n10 mins\nSoaking Time\n2 hrs\nTotal\n2 hrs 10 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n20\nounces\n(\n570\ng\n) puntarelle (\n1 to 2\nheads\n) or\nBelgian endive\n(\n8 to 10\nheads\n; a mix of white and red if available), trimmed (see note)\n8\noil-packed\nanchovies\n, drained (\n32\ng\n)\n2\nmedium\ngarlic cloves\n(\n10\ng\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n, plus more to taste; for table salt, use half as much by volume\n3\ntablespoons\n(\n45\nml\n)\nred wine vinegar\n5\ntablespoons\n(\n75\nml\n)\nextra-virgin olive oil\n1/2\ncup\n(\n20\ng\n)\nfresh flat-leaf parsley leaves\n3\ntablespoons\n(\n45\ng\n)\ncapers\n, drained and roughly chopped\nFreshly ground black pepper\nDirections\nPluck the outer leaves off the heads of puntarelle, tear or cut into bite-sized pieces, and set aside. Remove the shoots from the heads and, if present, trim and discard the woody bottom end of each. Cut shoots into 1/4-inch-thick strips (you may need to halve or quarter them lengthwise first). If there’s a fatter core, trim off the tougher base, cut it in half lengthwise, and then cut the halves into strips.\nSerious Eats / Andrew Janjigian\nSerious Eats / Andrew Janjigian\nAlternatively, if using endive, quarter endive lengthwise without removing cores. Slice each quarter into 1/8-inch strips lengthwise, at an angle through core, so leaves remain attached.\nSerious Eats / Andrew Janjigian\nTransfer prepared puntarelle or endive to a bowl and cover fully with cold water and a handful of ice cubes. Cover with a small plate or other similar object to keep pieces submerged. Refrigerate until curled, at least 2 hours (they may remain submerged for up to 18 hours).\nSerious Eats / Andrew Janjigian\nDrain puntarelle or endive and dry in a salad spinner. Refrigerate until needed.\nSerious Eats / Amanda Suarez\nMeanwhile, place anchovies, garlic, and salt on a cutting board and mash with the back of a fork until a coarse paste forms. Transfer to a medium bowl. Add vinegar and whisk until uniform. Add oil in a thin stream, whisking constantly, until emulsified.\nSerious Eats / Andrew Janjigian\nAdd puntarelle or endive, parsley, and half of the capers to bowl and toss to coat with dressing. Season with pepper and salt to taste. Transfer to a serving platter, top with remaining capers, and serve.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nsalad spinner\nNotes\nSome supermarkets sell heads of red endive, which is actually a cross between endive and treviso. (Trader Joe’s sells them in mixed packs.) Use a mix of both if you can find them for a splash of color.\nMake-Ahead and Storage\nOnce soaked, drained, and spun dry, endive or puntarelle will keep for up to 24 hours in the refrigerator.\nItalian\nThe Latest\nGreens\nGreen Salads"
}