{
  "url": "https://www.seriouseats.com/puto-filipino-steamed-rice-cakes-recipe-8598074",
  "image_url": "https://www.seriouseats.com/thmb/_9FTQAgWsKaIylR5NcNkSFiSpxY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240129-puto-rezel-kealoha-20-SEA-929a59c56e8c458b96b683c17b7c51c0.jpg",
  "tags": [
    "Rice & Grains",
    "The Latest",
    "Filipino",
    "Coconut Milk & Cream"
  ],
  "title": "Puto (Filipino Steamed Rice Cakes)",
  "full_text": "Puto (Filipino Steamed Rice Cakes)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nRising Time\n60 mins\nTotal\n105 mins\nMakes\n16\nto 20 Individual Puto\nCook Mode\n(Keep screen awake)\nIngredients\n275\ng\nwhite\nrice flour\n(\n2 1/3\ncup\nplus\n1\ntablespoon\n), divided\n1 1/4\ncups\n(\n295\nml\n)\nwater,\ndivided\n50\ng\n(\n1/4\ncup\n)\nsugar\n1/2\nteaspoon\n(\n3\ng\n)\ninstant yeast\n1/2\nteaspoon\n(\n4\ng)\nbaking powder\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n7\nfluid ounces\nfull-fat\ncoconut milk\n(\n198\ng\n; about half\n1\n13.5-ounce can\n)\nNonstick\ncooking spray,\nfor the silicone cups\nBanana leaves\n, for serving (optional)\nDirections\nIn a 2- or 3-quart saucepan, whisk 2 tablespoons rice flour and 1/2 cup water together. Set over medium-high heat and cook, whisking constantly, until a sticky paste forms, 1 to 2 minutes. Set aside to cool.\nSerious Eats / Rezel Kealoha\nIn the bowl of a stand mixer fitted with the whisk attachment, combine remaining 1 1/2 cups rice flour, sugar, yeast, baking powder, and salt. Mix on low speed until thoroughly combined, about 1 minute. Add cooled rice flour paste, coconut milk, and remaining 3/4 cup water; increase speed to medium and mix, scraping down sides of bowl as needed, until a smooth, pancake-like batter forms, 5 to 7 minutes.\nSerious Eats / Rezel Kealoha\nRemove bowl from stand mixer, cover with plastic wrap or a clean kitchen towel, and let stand at warm room temperature until the dough rises slightly and a few bubbles form on the top, 1 hour.\nSerious Eats / Rezel Kealoha\nIn a clean wok with a stacking bamboo steamer or another steamer setup, bring about 2 cups water to boil over high heat. (If using a wok with stacking bamboo steamers, you can cook 8 puto at once; if using a different steamer setup, you may only be able to cook 4 puto at a time.) Spray 2 1/2-ounce silicone baking cups with cooking spray (the number of cups will depend on how many you can fit in your steamer setup at once). Fill baking cups with puto batter about three-quarters full and arrange them in your steamer. Stretch a clean kitchen towel across steamer, then close lid to hold towel in place (the towel will prevent condensation from dripping down onto the puto below). Steam until puto are puffed, firm, and have a pearlescent sheen, 20 minutes.\nSerious Eats / Rezel Kealoha\nLine a serving platter with banana leaves, if using. Take out the first batch and place them on the platter. Cover puto with additional banana leaves (this imparts flavor).\nSerious Eats / Rezel Kealoha\nRepeat with remaining batter and transfer to the platter when done (or store extra batter in the fridge for future batches). Serve.\nSerious Eats / Rezel Kealoha\nSpecial Equipment\nStand mixer with whisk attachment, wok, bamboo steamer, 2 1/2-ounce silicone cupcake/muffin molds\nor muffin liners\nNotes\nTraditionally puto are steamed in banana leaves, but silicone molds are convenient, work well, and are reusable. Feel free to line the molds with banana leaves if you have them, for more of the flavor they impart.\nYou can add shredded cheese (such as cheddar), grated coconut, diced salted duck eggs (adding them after about 10 minutes of steaming), or other toppings before steaming.\nYou can also opt to steam the batter in one big mold or loaf pan (this will take roughly 45 minutes); let cool before unmolding.\nMake-Ahead and Storage\nThe batter can be made ahead of time; it will keep in the fridge for up to 1 day.\nSteamed puto can be stored in an airtight container in the fridge for a week or in the freezer for up to 3 weeks. Reheat refrigerated puto in the microwave for 30 seconds on high; reheat frozen puto in the microwave, covered with a damp paper towel, for 1 minute on high.\nRice & Grains\nThe Latest\nFilipino\nCoconut Milk & Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/puto-filipino-steamed-rice-cakes.webp?"
}