{
  "url": "https://www.seriouseats.com/qatayef-recipe-11692388",
  "image_url": "https://www.seriouseats.com/thmb/rKKFEEeAQNV8PUTBD9ipiEWEcsI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250306-Qatayef-MaiKakish-10-79c7ecbb0d45455ea366ec46a7a59288.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Middle Eastern",
    "Ramadan"
  ],
  "title": "Qatayef (Stuffed and Fried Pancakes)",
  "full_text": "Qatayef (Stuffed and Fried Pancakes)\nClose\nJump to recipe\nPrep\n2 hrs 45 mins\nCook\n45 mins\nTotal\n3 hrs 30 mins\nServes\n4\nto 6\nMakes\n8 qatayef\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cheese Filling (see notes):\n6\nounces\n(\n170\ng\n)\nNabulsi\nor fresh Mozzarella cheese, cut into approximately 1/4-inch pieces (see notes)\nPinch\nmastic crystals\n,\noptional\n(see notes)\nFor the Walnut-Raisin Filling:\n3/4\ncup\n(\n80\ng\n)\nwalnuts\n, finely chopped\n2 1/2\ntablespoons\n(\n32\ng\n)\ngolden raisins\n1 1/2\ntablespoons\n(\n20\ng\n)\nsugar\n1 1/4\nteaspoons\ncinnamon\n4\nteaspoons\n(\n20\nml\n)\norange blossom water\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume\nFor the Qatayef:\n65\ng\n(\n1/2\ncup\n)\nall-purpose flour\n20\ng\n(\n2\ntablespoons\n) finely ground\nsemolina\n13\ng\n(\n1\ntablespoon\n)\ngranulated sugar\n1/4\nteaspoon\nactive\ndry yeast\n1/8\nteaspoon\nDiamond Crystal kosher\nsalt\n: for table salt use half as much by volume\n160\nml\nwater\n, heated to 110℉\n1/8\nteaspoon\nbaking soda\nNeutral oil\nsuch as vegetable oil for frying\nFor the Syrup:\n1\ncup\n(\n7\nounces\n;\n200\ng\n)\ngranulated sugar\n1/2\ncup\n(\n120\nml\n)\nwater\n2\ntablespoons\n(\n30\nml\n)\norange blossom water\n1\nteaspoon\n(\n5\nml\n)\nfresh lemon juice\nFor Serving:\n1\ntablespoon\nfinely chopped raw\npistachios\n, optional\nDirections\nFor the Cheese Filling:\nIf using Nabulsi cheese, rinse and drain cheese: In a large bowl, submerge Nabulsi cheese with 1 inch boiling water. Let soak for 1 1/2 hours, changing with fresh boiling water once halfway through soaking. Alternatively, place cheese in large bowl, cover with room temperature water by 1 inch, and let soak for at least 8 hours or up to 14 hours, changing water once every two hours for the first 8 hours. Using fine-mesh strainer, drain cheese well, squeezing out excess water, and finely chop it. If using fresh mozzarella cheese, omit soaking and draining and just finely chop cheese. In a bowl, combine cheese with mastic gum, if using.\nSerious Eats / Mai Kakish\nFor the Walnut-Raisin Filling:\nIn a small bowl, combine walnuts, raisins, sugar, cinnamon, orange blossom water, and salt.\nSerious Eats / Mai Kakish\nFor the Qatayef Batter:\nIn a large bowl, whisk flour, semolina, sugar, yeast, salt, and water. Cover with plastic wrap and allow batter to sit at room temperature until mixture is bubbly and foamy with a watery ring appearing around edges, 1 1/2 to 2 hours (depending on kitchen’s temperature).\nSerious Eats / Mai Kakish\nFor the Syrup:\nWhile qatayef batter sits,\nin a small saucepan, combine sugar and water, and bring to a simmer over medium heat. Cook, adjusting heat as needed to maintain a simmer and stirring occasionally, until syrup reduces to about 3/4 cup and thickens until it coats back of a spoon, about 8 minutes. Stir in orange blossom water and lemon juice and continue tosimmer for 30 more seconds; set aside.\nSerious Eats / Mai Kakish\nFor Cooking the Qatayef:\nLine a rimmed baking sheet with parchment paper and set aside. When ready to cook, in a blender or using an immersion blender, add baking soda to rested batter and blend until combined. Heat a large nonstick skillet over medium-high heat until a splash of water beads and sizzles on contact, about 3 minutes. Wipe off any remaining water, then reduce heat to medium-low. Using a 2 tablespoon (1/8 cup) measuring cup filled to the top or a 1/4 cup measuring cup filled halfway, pour three 2 tablespoon portions of batter into skillet, letting each portion spread into a circle approximately 4 inches in diameter, leaving space between each pancake to prevent them from sticking. Cook until batter is dry on top and undersides are golden (small holes will start forming around the edges almost immediately and will gradually spread across the qatayef), 1 to 2 minutes. Do not flip qatayef during cooking. Transfer qatayef to prepared baking sheet. Cover with clean kitchen towel to prevent qatayef from drying. Repeat with remaining batter, lowering heat if qatayef start to get too dark. You should have 8 qatayef total. If not using right away, let cool, then cover qatayef tightly with plastic wrap and set aside at room temperature for up to 3 hours.\nSerious Eats / Mai Kakish\nTo Fill Qatayef:\nPlace about 1 tablespoon plus 1 teaspoon of either cheese or walnut-raisin filling in center of the bubbly side of each qatayef. Fold qatayef over itself and pinch the top middle edges together to seal, then continue pinching along the edges to close completely to form a half-moon shape. Use fingers to keep the filling from spilling out. Ensure edges are thoroughly sealed. Return to prepared baking sheet when filled.\nSerious Eats / Mai Kakish\nFor Frying the Qatayef:\nSet a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels. In a large Dutch oven, fill with oil to measure 1 1/2 inches deep and heat over medium-high heat to 350°F (177°C). Meanwhile, gently reheat syrup over medium-low heat until warm to the touch; place in medium bowl and set aside.\nSerious Eats / Mai Kakish\nOnce oil reaches temperature, carefully add qatayef to hot oil, and fry, using a spider skimmer or slotted spoon to flip qatayef halfway through, until golden brown on both sides, about 2 minutes total. Transfer qatayef to prepared wire rack and use a slotted spoon to immediately dunk them into the syrup until they're soaked through, about 30 seconds, flipping qatayef midway through. Transfer dipped qatayef to serving platter and top with pistachios, if using. Serve.\nSerious Eats / Mai Kakish\nSpecial Equipment\nKitchen scale, fine-mesh strainer, rimmed baking sheet, small saucepan, large nonstick skillet, wire rack, Dutch oven, Spider skimmer or slotted spoon\nNotes\nThis recipe can easily be doubled.\nThe two most common qatayef fillings are cheese, and walnuts with raisins and cinnamon. Usually, both variations are served together on a platter. This recipe includes both filling options, with each filling recipe written to make enough for 8 qatayef. If you’d like to make both, halve each filling recipe to prepare 4 of each, or double the number of qatayef and the amount of syrup.\nFor the cheese filling,\nmake sure to taste the Nabulsi cheese after soaking, as its salt content can vary. A hint of remaining salt in the cheese is desirable, but if it’s still too salty after soaking, change the water again and soak it longer. I prefer to remove the nigella seeds before chopping the cheese, but a few stragglers are fine.\nOrange blossom water can be purchased from Middle Eastern grocery stores or ordered online. It  also can be found at some American grocery stores.\nMastic gum is often sold as crystals and can be purchased from Middle Eastern grocery stores or ordered online. The small crystals can be chopped into a powder with a chef's knife. I recommend adding a pinch of sugar while chopping the crystals to prevent sticking. You can also grind the crystals in a spice grinder or with a mortar and pestle, but be sure to add a pinch of sugar to keep it from turning into a gummy paste.\nMake-Ahead and Storage\nQatayef can be filled and shaped, then frozen for up to 2 months. Spread on a parchment paper–lined baking sheet and freeze until solid, then transfer to a zip-top bag or airtight container. To cook, thaw in the refrigerator for at least 2 and up to 4 hours, then fry according to the recipe’ instructions. They can also be fried directly from frozen, but you’ll need to increase frying time by about 1 minute.\nDesserts\nThe Latest\nMiddle Eastern\nRamadan",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/qatayef-stuffed-and-fried-pancakes.webp?"
}