{
  "url": "https://www.seriouseats.com/qidreh-recipe-6749874",
  "image_url": "https://www.seriouseats.com/thmb/hDefz4GPVbeWtE2So2NaTozp24A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221011-Qidreh-MaiKakish-Hero-472647a2bf814f518b83ffc58cfb192c.JPG",
  "tags": [
    "Middle Eastern",
    "White Rice",
    "Lamb",
    "The Latest"
  ],
  "title": "Qidreh (Palestinian Bone-In Lamb With Spiced Rice)",
  "full_text": "Qidreh (Palestinian Bone-In Lamb With Spiced Rice)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n3 hrs 40 mins\nRest Time\n15 mins\nTotal\n4 hrs 5 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the lamb broth:\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n6\npounds\n(\n2.7\nkg\n)\nbone-in lamb shanks\nor shoulder chops (about\n4 to 6\nsmall\nshanks\nor\n8\nshoulder\nchops\n; see note)\n4\ncardamom\npods\n, lightly cracked open\n2\nbay leaves\n1\nteaspoon\nground allspice\n1/2\nteaspoon\ncinnamon\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\nground coriander seed\n1/2\nteaspoon\nground cumin\n1/2\nteaspoon\nturmeric\n1\nlarge (\n10-ounce; 283 g\n)\nyellow onion\n, peeled but left whole\n2\nquarts\n(\n1.9\nL\n)\nwater\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table or fine\nsea salt\n, use half as much by volume or the same weight\nFor the rice:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n1\nlarge (\n10-ounce; 283 g\n)\nyellow onion\n, halved and thinly sliced\n15\nmedium\ncloves garlic\n(about\n1 3/4\nounces\n;\n50\ng\n), peeled\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt\n; for table or fine\nsea salt\n, use half as much by volume or the same weight\n1\nteaspoon\nground cumin\n1/4\nteaspoon\nground allspice\n1/4\nteaspoon\ncinnamon\n1/4\nteaspoon\nfreshly\nground black pepper\n1/4\nteaspoon\nground coriander seed\n1\nteaspoon\nturmeric\n1\npound\n2\nounces\n(\n500\ng\n)\njasmine\nor Calrose\nrice\n(scant\n2 2/3\ncups\n)\n1\n(15-ounce; 425 g) can\nchickpeas\n, drained and rinsed\nTo serve:\n1\ncup\nslivered almonds\n(\n3 1/2\nounces\n;\n100\ng\n), lightly toasted\nMinced flat-leaf parsley\n, for garnish\nPlain yogurt\nDirections\nFor the lamb broth:\nIn a large 7 or 8-quart Dutch oven or stockpot, heat olive oil over medium-high heat until just shy of smoking. Working in batches to avoid crowding the pot, add the lamb and cook, turning occasionally, until well browned on all sides, about 4 minutes per side. Return all lamb to the pot.\nSerious Eats / Mai Kakish\nAdd the cardamom, bay leaves, allspice, cinnamon, black pepper, ground coriander seed, cumin, turmeric, and the whole onion followed by the water and salt. Bring to a boil over high heat, skimming any foam that rises to the surface, then lower heat to a simmer and cook until lamb is tender, about 2 hours. Remove from heat and strain lamb broth through a fine mesh strainer set over a large heatproof bowl. Discard onion, bay leaves, and cardamom pods. Transfer lamb to a platter and set aside.\nSerious Eats / Mai Kakish\nFor the rice:\nPreheat oven to 325°F (160°C). In a Dutch oven, heat olive oil and butter over medium heat until butter is melted. Add onions, lower heat to medium-low, and cook, stirring occasionally, until softened and golden, 10 to 15 minutes.\nSerious Eats / Mai Kakish\nAdd the garlic and cook, stirring, until garlic is just starting to turn a golden hue, about 2 minutes. Stir in salt, cumin, allspice, cinnamon, black pepper, coriander seed, and turmeric, cook for 1 minute, then stir in the rice until evenly coated. Stir in the chickpeas until well combined.\nSerious Eats / Mai Kakish\nAdd 1 quart (940ml) lamb broth to the rice mixture, increase heat to high and bring the broth to a boil; reserve additional broth for another use. Immediately remove from heat, arrange the reserved lamb on top of the rice, cover the pot, and cook in the oven until the rice is fully cooked, all the broth has been absorbed, and the lamb has browned on its exposed surface, about 1 hour. Remove from oven and let stand, covered, for 15 minutes.\nSerious Eats / Mai Kakish\nUncover pot, sprinkle with toasted almonds and minced parsley, and serve, passing yogurt in a separate bowl at the table. Traditionally, when served at large gatherings, the pieces of meat are removed, the pot is inverted onto a large serving platter, then the pieces of meat are rearranged on top and sprinkled with the garnish. However, it looks just as beautiful served from the pot, especially if you are using an enameled Dutch oven and/or having a small familiar gathering.\nSerious Eats / Mai Kakish\nSpecial Equipment\nDutch oven\nNotes\nIf you prefer not to deal with bone-in lamb, you can substitute with 1 1/4 to 1 1/2 pounds boneless lamb stewing cuts. It will cut about an hour from the broth-cooking time than the larger bone-in pieces. If going this route, using chicken broth instead of water for the broth to make up for any loss in flavor due to the lack of bones and shorter simmering time.\nIf you are averse to lamb, you could use beef instead; bone-in shanks and short ribs are a good choice.\nMake-Ahead and Storage\nThe broth and lamb can be made up to 2 days in advance; simply strain broth, then return lamb to it and refrigerate, tightly covered, until ready to finish the dish. Reheat the lamb in the broth before proceeding with the recipe.\nTo reheat leftovers, splash about 1/2 cup of broth on the qidreh, then heat in a moderate oven until hot throughout; add more broth as necessary until fully heated through to prevent the qidreh from over-drying.\nMiddle Eastern\nWhite Rice\nLamb\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/qidreh-palestinian-bone-in-lamb-with-spiced-rice.webp?"
}