{
  "url": "https://www.seriouseats.com/quadruple-chili-cheeseburgers-recipe",
  "image_url": "https://www.seriouseats.com/thmb/39INMuUybUJmF-qOWr1g8sJgDxE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120713-burger-topping-variations-03-ceb7331a7da1463088a62bda926e63af.jpg",
  "tags": [
    "Burgers",
    "Grilled Beef",
    "Green Chiles",
    "Summer"
  ],
  "title": "Quadruple Chile Cheeseburgers Recipe",
  "full_text": "Quadruple Chile Cheeseburgers Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n45 mins\nActive\n45 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nfreshly ground beef chuck\nKosher salt and freshly ground black pepper\n1\nchipotle pepper canned in adobo\n, finely chopped, plus\n2\nteaspoons\nadobo sauce\n4\ntablespoons\nmayonnaise\n2\nwhole\nfresh poblano\nor\nHatch chiles\n8\nslices\npepperjack\nor\npepper colby-jack cheese\n4\nlarge\nhamburger buns\n1/4\ncup\nsliced pickled jalapeños\nDirections\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate.\nMeanwhile, divide meat into 4 even piles and shape into burger patties about 1/2-inch wider than burger buns. Season generously with salt and pepper and set aside. Combine chipotle, adobo sauce, and mayonnaise in a small bowl. Stir to combine. Set aside.\nPlace poblano chiles directly over lit coals or gas burners, turning occasionally, until charred and blistered all over. Transfer to a sheet of aluminum foil and wrap tightly. Set aside for 5 minutes, then remove from foil and carefully peel off most of skin. Discard stems and seeds. Roughly chop chiles.\nPlace burgers directly over hot side of grill and cook, turning occasionally, until well charred and internal temperature registers 125°F to 130°F (51°C-54°C) on an instant-read thermometer for medium-rare, about 5 minutes total, or 135°F to 140°F (57°C-60°C) for medium, about 6 minutes total. Top each burger patty with 2 slices of cheese, then transfer to a large plate and tent with aluminum foil.\nToast buns directly over hot side of grill until browned, about 30 seconds.\nPlace bottom buns on a cutting board. Top with burger patties. Top burger patties with roasted chiles and pickled jalapeños. Top with chipotle mayonnaise. Close sandwiches and serve.\nSpecial Equipment\nGrill\n,\nchimney starter\n(optional)\nRead More\nSichuan Peppercorn Burgers With Chile-Ginger Mayo and Cucumber Pickles\nThe Ultimate Smash Cheeseburger\nOklahoma-Style Onion Burgers\n10 Tips for Better Burgers\nHow to Get Started Grilling\nBurgers\nGrilled Beef\nGreen Chiles\nSummer"
}