{
  "url": "https://www.seriouseats.com/quick-and-easy-huevos-rancheros-recipe",
  "image_url": null,
  "tags": [
    "Fried Eggs",
    "Mexican",
    "Breakfast & Brunch",
    "Quick Breakfast",
    "Cinco de Mayo"
  ],
  "title": "Quick and Easy Huevos Rancheros With Tomato-Chile Salsa",
  "full_text": "Quick and Easy Huevos Rancheros With Tomato-Chile Salsa\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n20 mins\nTotal\n40 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole\ndried ancho chiles\n1/4\ncup\n(\n60\nml\n)\ncanola oil\n, divided\n1\nsmall\nyellow onion\n, thinly sliced\n4\nmedium\ncloves garlic\n, thinly sliced\n1/2\nteaspoon\ndried oregano\n, preferably Mexican\n1\n(\n14-ounce) can\ncrushed tomatoes\n, preferably fire-roasted (such as Muir Glen)\n2\nwhole\nchipotle chiles packed in adobo\n, plus\n2\ntablespoons\n(\n30\nml\n) sauce from can\n1/4\ncup minced\nfresh cilantro\nleaves and fine stems (\n1/4\nounce\n;\n7\ng\n), plus more for serving\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n1\ntablespoon\n(\n15\nml\n)\njuice\nfrom\n1\nlime\n, plus lime wedges for serving\nKosher salt\nand freshly ground black pepper\nUp to\n12\nfresh corn tortillas\n(2 per serving)\nUp to\n12\nlarge\neggs\n(2 per serving)\nCrumbled Cotija cheese\n, for serving\nHot store-bought or\nhomemade\nrefried beans\n, for serving\nDirections\nTrim tops of chiles and discard seeds (see\nhere for more detailed instructions\n). Place on a microwave-safe plate and microwave on high power until pliable and fragrant, about 15 seconds. Cut chiles into thin strips using kitchen shears or a sharp knife.\nSerious Eats / J. Kenji López-Alt\nHeat 1 tablespoon oil in a medium saucepan over medium-high heat until shimmering. Add onion and garlic and cook, stirring, until softened and just starting to brown, about 5 minutes. Add oregano and chile strips and cook until fragrant, about 15 seconds. Add tomatoes and chipotle chiles with their sauce and bring to a simmer. Reduce heat to maintain a gentle simmer for 10 minutes.\nSerious Eats / J. Kenji López-Alt\nPurée mixture with a hand blender or in a standing blender until a loose purée is formed. Stir in cilantro, soy sauce, and lime juice and season to taste with salt and pepper. Set aside.\nSerious Eats / J. Kenji López-Alt\nHeat remaining 3 tablespoons oil in a medium cast iron or non-stick skillet over medium heat until shimmering. Working one at a time, fry corn tortillas until lightly browned but still pliable, about 15 seconds per side. Transfer to a paper towel to drain and stack them as you work. Cover with foil or a clean kitchen towel to keep warm.\nSerious Eats / J. Kenji López-Alt\nWhen tortillas are cooked, reheat skillet over medium-high heat until oil is shimmering (add more oil if necessary). Fry eggs, using a spoon to baste the tops with hot oil as they cook in order to help set the upper whites while keeping the yolk completely liquid. Fry until crisp on the bottom, whites are set, and yolks are golden, about 1 1/2 minutes. Season with salt and pepper and slide onto a clean plate.\nSerious Eats / J. Kenji López-Alt\nTo serve, place 2 tortillas on a serving plate. Top with 2 fried eggs. Spoon salsa all over the top, leaving the yolks exposed. Sprinkle with Cotija cheese and more chopped cilantro. Serve immediately with refried beans.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nBlender\nor\nhand blender\n, medium\nnonstick skillet\nor\ncast iron skillet\nFried Eggs\nMexican\nBreakfast & Brunch\nQuick Breakfast\nCinco de Mayo"
}