{
  "url": "https://www.seriouseats.com/quick-easy-bar-style-tarte-flambee-alsatian-pizza-recipe",
  "image_url": "https://www.seriouseats.com/thmb/VBY5UxNFxg6WaRkhpWnyP09-roY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150222-Tarte-Flambee-daniel-gritzer-13-8d8c4dd6815547b6bfef120de32c2604.jpg",
  "tags": [
    "Western European",
    "French",
    "German",
    "Cheese",
    "Bacon"
  ],
  "title": "Bar-Style Tarte Flambée (Alsatian Pizza With Fresh Cheese, Onions, and Bacon) Recipe",
  "full_text": "Bar-Style Tarte Flambée (Alsatian Pizza With Fresh Cheese, Onions, and Bacon) Recipe\nClose\nJump to recipe\nActive\n25 mins\nTotal\n25 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nfromage blanc\n(see note)\n1/2\ncup\ncrème fraîche\n(see note)\nKosher salt and freshly ground black pepper\nPinch\nfreshly grated\nnutmeg\nVegetable oil\n, for skillet\n6\n(\n10-inch\n)\nflour tortillas\n1\nmedium\nwhite or\nyellow onion\n, very thinly sliced\n1/4\npound\nsliced bacon\n, cut crosswise into thin strips\nDirections\nAdjust oven rack to 6 to 8 inches below broiler element and preheat broiler to high. In a medium bowl, whisk together fromage blanc and crème fraîche together until thoroughly incorporated. Season with salt and pepper; whisk in nutmeg.\nHeat 1 teaspoon oil in large cast iron skillet over high heat until shimmering. Reduce heat to low and wipe out excess oil with a paper towel.\nWorking 1 tortilla at a time, place tortilla in skillet with the rougher textured-side facing down. Spread 1/4 cup fromage blanc mixture over tortilla all the way to the edges.\nScatter a small amount of onion on top, all the way to the edge.\nScatter small amount of bacon on top, all the way to the edge.\nPlace skillet under broiler and broil until bacon is cooked and tarte flambée is browned in spots, 2 to 4 minutes. Remove from oven. Using a small metal spatula, peek under bottom. If more crispness is desired, place skillet over medium heat and cook, swirling tarte and peeking occasionally, until desired crispness is achieved. Slide tarte out onto a cutting board. Cut and serve immediately. Wipe out skillet and repeat with remaining tortillas and toppings.\nNotes\nIf you can't find fromage blanc, a tangy fresh cheese, you can substitute the fromage blanc- and crème fraîche-mixture below with either 1 1/2 cups quark, or 3/4 cup buttermilk blended with 3/4 cup cream cheese.\nSpecial Equipment\nLarge cast iron skillet\nThis Recipe Appears In\nThe Art of Tarte Flambée: Alsatian Pizza With Fromage Blanc, Bacon, and Onions\nWestern European\nFrench\nGerman\nCheese\nBacon",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bar-style-tarte-flambe-alsatian-pizza-with-fresh-cheese-onions-and-bacon-recipe.webp?"
}