{
  "url": "https://www.seriouseats.com/quick-mango-pickle-recipe-11709568",
  "image_url": "https://www.seriouseats.com/thmb/t2reAoSt-v-LgpHWTqy6d332buQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250205-SEA-QuickMangoPickle-KanikaAndJatinSharma-Beauty3-75-d0494c5d97b948b0a3883a93a09c0ed2.jpg",
  "tags": [
    "Condiments & Sauces",
    "The Latest",
    "Indian",
    "Pickling",
    "No-Cook Fruit"
  ],
  "title": "Quick Indian Mango Pickle",
  "full_text": "Quick Indian Mango Pickle\nClose\nJump to recipe\nPrep\n35 mins\nCook\n5 mins\nMaceration Time:\n3 hrs\nTotal\n3 hrs 40 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n4\nfresh unripe\ngreen mangoes\n(10 ounces each), pitted, peeled, and diced into 3/4-inch pieces or unpeeled and cut into 1/2-inch pieces (see notes)\n2\ntablespoons\n(\n18\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or the same weight\n1\nounce\ncrumbled\njaggery\nor\n2\ntablespoons\n(\n30\ng\n)\nwhite sugar\n(see notes)\n4\ntablespoons (90 ml)\nneutral oil\nsuch as vegetable oil\n2\nteaspoons\nbrown\nmustard seeds\n1 1/2\nteaspoons\nground turmeric\n1 to 2\nteaspoons\nKashmiri red chile powder\n, as desired\n1/2\nteaspoon\nasafetida\n(hing; see notes)\n1/4\nteaspoon\nfenugreek seeds\nDirections\nIn a large metal bowl, toss diced mangoes with salt and jaggery or sugar until combined; set aside.\nSerious Eats / Kanika and Jatin Sharma\nIn a seasoning wok (see notes) or small heavy-bottomed saucepan or small carbon-steel skillet, heat oil until smoking, about 3 minutes. Test oil temperature with one mustard seed. If it pops right away, your oil is ready; if not, return heat to medium-high for 1 additional minute and retest. When ready turn off heat and immediately add mustard seeds to the saucepan and cover with the lid/screen. The mustard seeds will pop, making a sound like popping corn, about 30 seconds.\nSerious Eats / Kanika and Jatin Sharma\nOnce the popping stops, uncover the pan and add the turmeric, red chile powder, asafetida, and fenugreek to the pan, stir gently to mix. Let the oil cool completely, about 30 minutes.\nSerious Eats / Kanika and Jatin Sharma\nScrape the cooled oil onto the mango and mix well. Taste the mango and add more salt or sugar if desired.\nSerious Eats / Kanika and Jatin Sharma\nLet mango stand at room temperature, stirring occasionally until well macerated, at least 3 and up to 4 hours. Then transfer to an airtight glass container or jar and refrigerate until ready to use. Before serving, stir to combine and serve in a small bowl as a condiment.\nSerious Eats / Kanika and Jatin Sharma\nVariations\nCarrot Quick Pickle:\nSubstitute mango with 2 1/2 pounds medium carrots, cut into 1/4 -inch pieces, and continue with recipe as written.\nCauliflower Quick Pickle:\nSubstitute 1 large head cauliflower (about 2 pounds), trimmed and cut into 1/2-inch florets and continue with recipe as written.\nPear or Apple Quick Pickle:\nSubstitute 4 crisp apples or slightly underripe, firm pears; core and cut into 1/2-inch chunks, leaving the peel on. Continue with recipe as written.\nSpecial Equipment\nMetal or glass mixing bowl, large metal spoon (so turmeric does not stain it), Indian seasoning wok or a small sauté pan, canning jars or glass containers for storage\nNotes\nMake sure to use unripe mango that are not yet mature and will not mature, and not to be confused with underripe mangos, which are mature mangos that just have not peaked in ripeness yet.\nIf using jaggery, a couple seconds in the microwave will help soften it. Then you can chop it just like chocolate with a bread knife. Alternatively, a microplane works as well.\nAsafetida can be found at most Indian grocers. I recommend the powder sold in small jars, rather than large plastic containers, because the plastic can hold the aroma. Keep it tightly shut between uses, otherwise the smell will pervade your entire kitchen. While it adds a distinct flavor to the chutney, you can omit it if unavailable, though the chutney will be less aromatic.\nA seasoning wok is a small wok that is used in Indian cooking for toasting spices and for making seasoned oil blends. They generally are made from thicker metal than Chinese woks. I often use a seasoning wok at home to make spice blends for a variety of dishes, but a small sauté pan or skillet will work well in its place.\nMake-Ahead and Storage\nThe pickle can be stored in airtight jars and refrigerated for up to 1 week.\nCondiments & Sauces\nThe Latest\nIndian\nPickling\nNo-Cook Fruit"
}