{
  "url": "https://www.seriouseats.com/quiche-lorraine-recipe-8715255",
  "image_url": "https://www.seriouseats.com/thmb/cvym_kKph6DJJyTChZdPvT6G_aI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240918-SEA-QuicheLorraine-DeliStudios-23-ff8b9aec8f604cc0a806aeb0ca4f6378.jpg",
  "tags": [
    "Eggs",
    "The Latest",
    "French",
    "Quiches"
  ],
  "title": "Quiche Lorraine",
  "full_text": "Quiche Lorraine\nClose\nJump to recipe\nPrep\n75 mins\nCook\n90 mins\nCooling Time\n2 hrs\nTotal\n4 hrs 45 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\nOne\nhalf\nButtery\nFlaky Pie Crust\nrecipe (dough shaped through step 2) or store-bought pie crust\nFor the Filling:\n8\nounces\n(227g)\nbacon\n(about 8 slices) cut into 1/2-inch pieces\n1\nlarge\nshallot\n(2 ounces; 55g), finely chopped (about 1/4 cup)\n2\ngarlic\ncloves\n, minced\n1\nteaspoon minced\nfresh thyme leaves\n4\nlarge\neggs\n3/4\ncup\n(175ml)\nwhole milk\n3/4\ncup\n(175ml)\nheavy cream\n3/4\nteaspoon\ngrated\nlemon zest from 1 lemon\n1/2\nteaspoon\nkosher salt;\nfor table salt use half as much by volume\n1/2\nteaspoon\nfreshly\nground black pepper\nPinch\nfresh\ngrated\nnutmeg\n, optional\n3\nounces\n(85g)\nGruyère cheese,\nshredded (3/4 cup)\n1\nounce\n(28g)\nParmesan\ncheese, grated (1/4 cup)\nDirections\nFor the Crust:\nUsing your hands and rolling the dough's edges on the counter, shape into a 5-inch disk. Wrap tightly with plastic wrap and refrigerate until firm, about 30 minutes. Set the dough on a generously floured work surface and roll dough into a 12-inch circle. If the dough is too firm to roll at the start, let sit on the counter for 5 minutes before trying to roll again. Loosely roll dough around rolling pin and gently unroll it onto a 9-inch pie plate (preferably metal), letting excess dough hang over the edge. Ease dough into plate by gently lifting edge of dough with one hand while pressing into plate bottom with your other hand.\nSerious Eats / Deli Studios\nTrim overhang to 1/2 inch beyond the lip of the plate. Make a fluted edge: Tuck overhang under itself; folded edge should be flush with edge of plate. Press the double layer of dough with your fingers to seal, then bend up at a 90-degree angle and flute by pressing thumb and index finger about 1/2-inch apart against outside edge of dough, then use index finger (or knuckle) of other hand to press into the dough to form a fluted edge. Repeat all the way around. Wrap dough-lined plate loosely in plastic and refrigerate until dough is firm, at least 1 hour or up to 24 hours.\nSerious Eats / Deli Studios\nAdjust oven rack to middle position and heat oven to 350℉ (175℃). Remove plastic wrap and place chilled pie shell on rimmed baking sheet. Line shell with double layer of parchment paper, covering edges to prevent burning, and fill with pie weights, dried beans, or granulated sugar to the top. Bake until edges are light golden brown, 15 to 20 minutes. Remove parchment and weights; rotate plate; and bake until crust bottom dries out and turns light golden brown, 15 to 20 minutes. If crust begins to puff, pierce gently with tip of paring knife. Set aside. (Crust needn’t cool completely before adding filling.)\nSerious Eats / Deli Studios\nFor the Filling:\nIn a 10-inch stainless-steel or cast iron skillet, add bacon and cook over medium heat, stirring frequently and adjusting heat as needed to avoid burning, until fat is rendered from the bacon and it’s evenly browned and crisp, 7 to 9 minutes. Use a slotted spoon to transfer bacon to a paper towel–lined plate. Reserve 1 tablespoon of the rendered bacon fat in the skillet, and discard any extra bacon fat.\nSerious Eats / Deli Studios\nHeat reserved bacon fat in the skillet over medium heat until shimmering. Add shallots and cook, stirring frequently, until softened and browned, 3 to 4 minutes. Stir in garlic and thyme and cook until fragrant, about 30 seconds, remove from heat and let cool slightly, about 10 minutes.\nSerious Eats / Deli Studios\nIn a large bowl, whisk eggs until thoroughly combined and no white streaks remain. Whisk in lemon zest, salt, pepper, and nutmeg until well combined. Whisk in milk, heavy cream, and the cooled shallot mixture until smooth and combined.\nSerious Eats / Deli Studios\nSprinkle half of the Gruyère (1/2 cup) and half of the Parmesan cheese (2 tablespoons) evenly over the bottom of the parbaked pie crust. Sprinkle half of the reserved cooked bacon over top in an even layer. Rewisk to combine the egg mixture, then slowly pour the egg mixture into the pie shell over the bacon. Smooth into an even layer, then sprinkle the remaining Gruyère, Parmesan, and bacon over the top. It will submerge slightly into the custard.\nSerious Eats / Deli Studios\nBake in preheated 350℉ (175℃) oven on baking sheet until top of quiche is lightly browned, and a knife blade inserted about 1 inch from the edge comes out clean and the center feels set but still soft and jiggly like gelatin, 40 to 50 minutes, rotating sheet halfway through baking. When done, the center should register 170℉(75℃). Transfer to a wire rack and let rest until cool to touch, 2 to 3 hours. Slice and serve.\nSerious Eats / Deli Studios\nSpecial Equipment\n9-inch pie plate (preferably metal), 10-inch stainless-steel or cast iron skillet, baking sheet\nMake-Ahead and Storage\nYou can blind-bake the crust a day or two in advance and leave it on the counter, or freeze it, well-wrapped, for up to 3 months.\nQuiche can be refrigerated for up to 3 days. Bring to room temperature on the counter before serving or gently warm in a 325℉ (165℃) until center is warm.\nEggs\nThe Latest\nFrench\nQuiches"
}