{
  "url": "https://www.seriouseats.com/quick-easy-bibim-guksu-recipe-8680707",
  "image_url": "https://www.seriouseats.com/thmb/FmuY9PXE3Yz-BqsTLme4LRj6fD4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240719-SEA-BibimGuksu-MattHunziker-hero-6ed7a03a35dd43b2b41e6992e5a90793.jpg",
  "tags": [
    "Noodles",
    "The Latest",
    "Korean",
    "Vegetarian",
    "Vegetarian Mains"
  ],
  "title": "Bibim Guksu (Korean Cold Mixed Noodles)",
  "full_text": "Bibim Guksu (Korean Cold Mixed Noodles)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nChilling Time\n5 mins\nTotal\n35 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\neggs\n16\nounces\n(\n454\ng\n) dried somyeon (\nsomen\n) noodles, or other thin round wheat noodle\nFor the Sauce:\n1/4\nlarge\nAsian pear\n(about\n4 1/2\nounces\n;\n123\ng\n), peeled, cored, finely grated (about\n1/2\ncup\ngrated)\n1/4\ncup\nplus\n1\ntablespoon\ngochujang\n(about\n2 3/4\nounces\n;\n80\ng\n), see notes\n1/4\ncup\n(\n60\nml\n) unseasoned\nrice vinegar\n2\ntablespoons\n(\n30\nml\n)\nsoy sauce\n, such as Kikkoman\n3\ntablespoons\ncoarse\ngochugaru\nflakes (about\n3/4\nounces\n;\n20\ng\n)\n2\nteaspoons\n(\n12\ng\n)\nhoney\n1\ntablespoon\n(\n15\nml\n)\ntoasted sesame oil\n2\nmedium\ncloves garlic\n(\n10\ng\n), finely grated\n3\ntablespoons\n(\n45\nml\n)\nwater\nTo Serve:\n2\nmini\nPersian cucumbers\nor\n1/4\nEnglish seedless cucumber\n(\n8\nounces\n;\n226\ng\n), julienned\n10\nperilla leaves\n, thinly sliced into a chiffonade (see notes)\nSesame oil\n, for drizzling\n2\ntablespoons\ntoasted sesame seeds\n, coarsely crushed in a mortar and pestle\nDirections\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Set aside.\nSerious Eats / Matt Hunziker\nBring a large saucepan of water to a boil over high heat. Using a spider or slotted spoon, gently lower eggs into water. Boil eggs for 8 to 10 minutes, then, using a spider or slotted spoon, transfer eggs to ice bath. Let eggs sit in ice bath until cool to the touch, about 2 minutes, before peeling under cool running water. Using a sharp knife, halve eggs; set aside. (Reserve ice bath for noodles.)\nSerious Eats / Matt Hunziker\nBring same saucepan of water to a boil over high heat and add somyeon. Cook according to package directions, using tongs to constantly stir and move noodles around to prevent them from sticking to each other. Using a colander, strain noodles. Immediately transfer noodles to ice bath. Swish noodles around in the ice water to loosen them up a bit, then let noodles sit in ice bath while you prepare the sauce.\nSerious Eats / Matt Hunziker\nIn a large bowl, combine Asian pear, gochujang, rice vinegar, soy sauce, gochugaru, honey, toasted sesame oil, garlic, and water. Whisk until sauce is smooth. (Sauce should be fairly runny, which helps it to more evenly coat the noodles. You should have about 1 1/2 cups.)\nSerious Eats / Matt Hunziker\nDrain noodles into a colander, then run the noodles under cold running water, vigorously agitating and scrubbing them with clean hands (as if you were hand-washing laundry), until they no longer feel sticky, about 30 seconds. Drain noodles well, then transfer to bowl with sauce. Using a clean and/or gloved hand, toss noodles with sauce to evenly coat. Season to taste, adding more vinegar, soy sauce, honey, or sesame oil as needed. (The sauce should taste equal parts spicy, tangy, sweet, and savory, with no one flavor overly dominating.)\nSerious Eats / Matt Hunziker\nDivide noodles amongst four shallow bowls. Top each bowl with some cucumber, perilla, and an egg half and drizzle with toasted sesame oil. Sprinkle the crushed toasted sesame seeds on top and serve. Have guests use chopsticks to mix the garnishes and noodles together before eating.\nSerious Eats / Matt Hunziker\nSpecial Equipment\nMortar and pestle, spider or slotted spoon, colander\nNotes\nThere is no salt in this recipe, as many of the sauce ingredients are naturally quite salty.\nSome Asian pears are less sweet than others. If yours is not particularly sweet, you may need to add more honey to achieve the right level of sweetness to temper the dish’s savory and spicy flavors. Asian pears can be expensive ($5 a pear when I last checked!), but grated Fuji or Gala apples make a very good substitute. You can also find inexpensive cans of\ncrushed pear juice\nwith pulp at  Korean supermarkets, which work well.\nWhen buying gochujang, look for one that lists rice syrup instead of corn syrup in the ingredients list, as corn syrup can add an overpowering, cloyingly sweet flavor. When buying gochugaru, look for coarse flakes (akin to wheat bran), as opposed to the very finely ground flakes.\nAlthough perilla leaves are part of the mint family, they have an earthy, anise-like flavor that is distinct from mint or other mint-y cousins such as shiso. You can substitute either for the perilla, but the effect will not be quite the same.\nFor convenience (or if you don’t care about aesthetics), you can add the sliced cucumber and perilla directly to the bowl of noodles and sauce and mix everything together, as opposed to serving the vegetables on top.\nAlthough boiled eggs are common, you could add virtually any protein to this dish: poached chicken breast, cooked shrimp, baked tofu, thinly sliced ribbons of yuba. In his cookbook\nMy Korea,\nthe chef Hooni Kim tops his bibim guksu with shredded soy-braised and chilled brisket. It’s also a great vehicle for leftover grilled meats.\nMake-Ahead and Storage\nBibim guksu sauce can be made up to two weeks ahead and refrigerated in an airtight container.\nNoodles\nThe Latest\nKorean\nVegetarian\nVegetarian Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bibim-guksu-korean-cold-mixed-noodles.webp?"
}