{
  "url": "https://www.seriouseats.com/ragu-napoletano-meat-sauce-pork-beef-sausage-recipe",
  "image_url": "https://www.seriouseats.com/thmb/4-j7Twrr3rBNHvgTCt2tw1ewGt8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-Ragu-Napoletano--FredHardy-Hero-bd073b3d424e404c9286ddbe477adb4c.JPG",
  "tags": [
    "Italian",
    "Braised & Stewed Mains",
    "Beef Chuck",
    "Pastas",
    "Pork"
  ],
  "title": "Ragú Napoletano (Neapolitan-Style Italian Meat Sauce With Pork, Beef, and Sausage)",
  "full_text": "Ragú Napoletano (Neapolitan-Style Italian Meat Sauce With Pork, Beef, and Sausage)\nClose\nJump to recipe\nCook\n5 hrs 45 mins\nActive\n45 mins\nCooling Time\n20 mins\nTotal\n6 hrs 5 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n)\npork spare ribs\n, cut into\n2\nchunks\n2\npounds\n(\n900\ng\n) boneless\nbeef chuck\n, cut into\n2\nchunks\n2\npounds\n(\n900\ng\n) boneless\npork shoulder\n, cut into\n2\nchunks\n1/4\ncup\nplus\n2\ntablespoons\n(\n89\nml\n)\nextra-virgin olive oil\n, divided\n1\nlarge\nyellow or red\nonion\n(about\n10 ounces; 283 g\n), finely chopped (about\n1 1/2\ncups\n)\n1\n(\n6-\nounce;\n170 g) can\ntomato paste\n2\ncups\n(\n473\nml\n)\ndry red wine\n2\n(\n28-ounce; 794 g) cans\nwhole peeled tomatoes\n, preferably D.O.P. San Marzano, pureed in a blender or thoroughly crushed by hand in a large bowl\n1\n(\n2- to 3-inch\n)\nParmesan rind\n(optional)\n1\nbunch\nfresh basil\n, divided\n1\npound\n(\n454\ng\n)\nmild Italian sausage\n, in the casings (see note)\n8 to 10\nservings\nfresh or\ndried pasta\nGrated Parmigiano-Reggiano cheese\n, for serving\nDirections\nAdjust oven rack to lower-middle position and preheat oven to 300°F (150°C). Season ribs with salt and pepper. Heat 2 tablespoons (30ml) olive oil in a large Dutch oven over high heat until shimmering. Add ribs and cook without moving until well browned, 8 to 10 minutes. Flip and cook until second side is well browned, 5 to 7 minutes longer. Transfer to a plate and set aside. Repeat with beef chuck and pork shoulder until browned all over and add to plate with pork ribs.\nSerious Eats / Fred Hardy\nAdd onions to now-empty Dutch oven and cook, scraping up any browned bits, and stirring frequently until lightly browned, about 8 minutes. Add tomato paste, and cook, stirring often, until paste begins to caramelize, about 2 minutes. Add wine and cook until mixture is very thick, about 5 minutes. Add tomatoes, Parmesan rind (if using), and 3/4 of basil. Return ribs, beef chuck, and pork shoulder to pot and bring to a simmer.\nSerious Eats / Fred Hardy\nCover with lid slightly ajar and place in the oven (see notes for slow cooker instructions). Cook, stirring occasionally, until the rib bones can be easily pulled from the meat, about 3 hours. Add sausages and continue cooking for 30 minutes. Remove from oven and reduce oven temperature to 200°F (93°C).\nSerious Eats / Fred Hardy\nTransfer pork ribs, beef chuck, pork shoulder, and sausages to a bowl, discard bones, and let stand until cool enough to handle. Discard basil sprigs from sauce. Arrange meat on a platter, pour 1/2 cup (118ml) tomato sauce over meat, cover with aluminum foil, and keep warm in oven while sauce reduces.\nSerious Eats / Fred Hardy\nBring the tomato sauce in the Dutch oven to a boil over medium-high heat. Reduce to a simmer and cook, stirring often, until sauce has thickened, developed a deep red color, and reduced to about 4 cups (1L), about 1 hour.  Stir in remaining olive oil and season with salt and pepper.\nSerious Eats / Fred Hardy\nTo serve, cook pasta in a pot of boiling salted water until just shy of al dente (about 1 minute for fresh pasta or 1 minute short of recommended cooking time for dried pasta). Drain, reserving about 1 cup of starchy pasta water. Return pasta to the pot you just cooked it in and add half of ragù, half of pasta cooking water, and a handful of grated cheese. Cook over medium-high heat, stirring until the sauce emulsifies with the pasta water and clings to the pasta, adding more pasta water if necessary. Serve immediately, passing additional sauce, cheese, and remaining fresh basil at the table. Carve and serve meat either alongside pasta or as the following course.\nSerious Eats / Fred Hardy\nNotes\nAny mildly flavored sausage from the butcher will do. If no mild sausages are available, sweet Italian sausages will work.\nSpecial Equipment\nDutch oven\nItalian\nBraised & Stewed Mains\nBeef Chuck\nPastas\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rag-napoletano-neapolitan-style-italian-meat-sauce-with-pork-beef-and-sausage.webp?"
}