{
  "url": "https://www.seriouseats.com/ramp-pesto-recipe-7504162",
  "image_url": "https://www.seriouseats.com/thmb/nAZkAFoaWYYN4kTv1IgE-hDbuis=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230525-SEA-RampPesto-AmandaSuarez-18-c9a16f365fee48a1b7389878cbdc68a9.jpg",
  "tags": [
    "Pesto",
    "Pastas",
    "Vegetables",
    "Spring Mains",
    "Nuts & Seeds"
  ],
  "title": "Ramp Pesto",
  "full_text": "Ramp Pesto\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nTotal\n25 mins\nServes\n2\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\nramps\n1/2\ncup\nshelled unsalted\nroasted pistachios\n(\n2.25\nounces\n;\n65\ng\n)\n2\nounces\n(\n60\ng\n) freshly grated\nPecorino Romano cheese\nZest\nfrom\n1/2\nof a\nlarge\nlemon\n2\nteaspoons\n(\n10\nml\n)\nfresh lemon juice\n1\ncup\n(\n237\nml\n)\nextra-virgin olive oil\nKosher salt\nDirections\nBring a pot of salted water to a boil. Trim root ends from ramps, being careful not to remove more of the white bulb than necessary. Separate white and green parts, then roughly chop white parts. Set white and green ramp parts aside separately.\nSerious Eats / Amanda Suarez\nIn a food processor, pulse pistachios until finely chopped. In a large mixing bowl, prepare an ice bath. Add reserved ramp greens to boiling water and cook until greens have wilted, about 30 seconds. Using a spider, immediately transfer ramp greens to prepared ice bath, swirling to chill rapidly. Drain ramp greens and, using your hands, gently squeeze out any excess water. Coarsely chop greens and add to bowl of food processor with reserved ramp whites and Pecorino Romano.\nSerious Eats / Amanda Suarez\nPulse contents of food processor, scraping down sides as needed, until mixture forms a rough paste, about 10 pulses. Add lemon zest and lemon juice and pulse until well incorporated, about 5 to 10 pulses.\nSerious Eats / Amanda Suarez\nWith food processor running, drizzle in olive oil in a thin stream until oil is fully incorporated and sauce is thick but flowing, about 30 seconds. Season with salt. Use as desired, or refrigerate or freeze.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFood processor, spider skimmer\nNotes\nIf using the ramp pesto to sauce pasta, we recommend using about 1 1/2 cups of the pesto for every pound of dried pasta (though pasta shape and personal preference may require slight adjustments to that ratio). After cooking the pasta, reserve 1 cup of the pasta cooking water. Then combine the ramp pesto and cooked pasta off-heat, stirring to coat and adding the pasta cooking water 1/4 cup at a time until the sauce coats the pasta and is neither thick and pasty nor loose and watery.\nMake-Ahead and Storage\nRamp pesto can be refrigerated in an airtight container for up to 1 week, but will begin to lose vibrancy after about 3 days. It can be frozen in an airtight container for up to 3 months. When chilled, the pesto will solidify; gently rewarm to loosen.\nRead More\n14 Ramp Recipes to Celebrate Ramp Season\nHow to Sustainably Harvest Ramps\nPesto\nPastas\nVegetables\nSpring Mains\nNuts & Seeds",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ramp-pesto.webp?"
}