{
  "url": "https://www.seriouseats.com/ras-el-hanout-beef-stew-recipe-11699097",
  "image_url": "https://www.seriouseats.com/thmb/Ms4iVC-j0VCvRzTGcLm2YXUC4Rc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250313-SEA-MaureenCelestine-RaselHanoutBeefStewwithgreensandchickpeas-Beauty1-29-5f3f52096924494bad226c602a291043.jpg",
  "tags": [
    "Braised & Stewed Beef",
    "The Latest",
    "Mains",
    "Comfort Food"
  ],
  "title": "Moroccan-Inspired Beef Stew With Ras el Hanout",
  "full_text": "Moroccan-Inspired Beef Stew With Ras el Hanout\nClose\nJump to recipe\nCook\n3 hrs 20 mins\nTotal\n3 hrs 20 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\n(\n1.13\nkg\n)\nboneless beef chuck\nor other stewing beef, trimmed of excess fat and cut into 1- to 1 1/2–inch chunks\nKosher salt\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, divided\n2\nmedium\nyellow onions\n(\n1\npound\n;\n454\ng\n), diced\n3\nmedium cloves\ngarlic\n, minced\n1\ntablespoon\n(\n15\nml\n)\ntomato paste\n2\nteaspoons\nhomemade\nor store-bought\nras el hanout\n(see notes)\n2\ncups\n(\n480\nml\n)\nhomemade\nbeef stock\nor\nchicken stock\n, or store-bought low-sodium chicken broth, plus more if needed\n1\nteaspoon\n(\n5\nml\n)\nhoney\n1\nsmall bunch\ncilantro\n, tied with kitchen string into a bundle, plus chopped cilantro for serving (optional)\n6\nounces\n(\n170\ng\n)\ncollard greens\n, thick central stems removed, leaves cut crosswise into 1-inch-wide strips (about 3 cups prepped leaves)\n1\n(\n15.5-ounce) can\nchickpeas\n, drained and rinsed\nBread\n,\ncooked couscous\n, or rice, for serving\nDirections\nPat beef dry with paper towels and season all over with salt. In a large Dutch oven or heavy-bottomed pot, heat 1 tablespoon (15 ml) oil over medium-high heat until shimmering. Add half of beef and cook, turning occasionally (wait until beef releases easily from the bottom of the pot with a gentle lift), until well browned on all sides, 8 to 10 minutes; transfer to a large plate. Repeat with 1 tablespoon (15 ml) oil and remaining beef.\nMaureen Celestine\nIn now-empty Dutch oven or pot, reduce heat to medium and add remaining 2 tablespoons (30 ml) oil. Add onion and cook, stirring occasionally, until softened and just beginning to brown, 3 to 5 minutes. Add garlic, tomato paste, and ras el hanout and cook, stirring occasionally, until fragrant, 1 to 2 minutes. Return seared meat to pot and add stock or broth, 1 teaspoon salt, and honey and stir to combine.\nMaureen Celestine\nAdd cilantro bundle, increase heat to medium-high and bring to a boil, then cover pot, reduce heat to low, and simmer, adjusting heat as needed to maintain a gentle simmer, until beef is fork-tender, 2 to 2 3/4 hours; stir every 30 minutes or so to prevent sauce from sticking to bottom of pot.\nMaureen Celestine\nStir in collard greens and chickpeas. There should be enough liquid to partially cover the ingredients; if necessary, add a little more stock or water. Cover pot and simmer until collard greens are tender, 15 to 20 minutes.\nMaureen Celestine\nOff heat, discard cilantro bundle and season to taste with salt, if needed. Using a ladle or wide spoon, skim any excess fat from top of stew. Sprinkle individual portions with chopped cilantro, if desired, and serve with bread or cooked couscous or rice.\nMaureen Celestine\nSpecial Equipment\nLarge Dutch oven or heavy-bottomed pot\nNotes\nRas el hanout, a Moroccan spice blend, can be made from scratch or purchased from most grocery stores with a good spice section (even major mass-market spice companies like McCormick make it).\nMake-Ahead and Storage\nThe stew can be cooled down and refrigerated in an airtight container for up to 4 days or frozen for up to 2 months.\nBraised & Stewed Beef\nThe Latest\nMains\nComfort Food"
}