{
  "url": "https://www.seriouseats.com/rasgulla-indian-milk-dumplings-in-sweet-syrup-recipe-8594146",
  "image_url": "https://www.seriouseats.com/thmb/ooZ5WuJhXSW5thcSRCEFASpUN8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240222-SEA-Rasgulla-KanikaandJatinSharma19-62308471b3cc4c0da691a0d07a7beec9.jpg",
  "tags": [
    "Indian Cuisine",
    "The Latest",
    "Desserts",
    "Milk"
  ],
  "title": "Rasgulla (Indian Milk Dumplings in Sweet Syrup)",
  "full_text": "Rasgulla (Indian Milk Dumplings in Sweet Syrup)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n20 mins\nDraining Time\n15 mins\nTotal\n65 mins\nMakes\n16 Each\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n1\nL\n)\nwhole milk\n2\ntablespoons\n(\n20\nml\n)\nfresh lemon juice\n3\ncups\n(\n700\nml\n)\nwater\n1 1/2\ncups\n(\n300\ng\n)\ngranulated sugar\n4\ncardamom\npods\n, lightly crushed or split\n1\ntablespoon\ncornstarch\nDirections\nIn a large saucepan, bring milk to a boil over medium-high heat. Stir in lemon juice, then remove from heat. Let stand until coagulated, about 5 minutes.\nSerious Eats / Kanika and Jatin Sharma\nLine a fine-mesh strainer or colander with a large piece of muslin or double layer of cheesecloth and set over a large bowl or pot. Pour coagulated milk into strainer, then gather the cloth in the sieve and place a heavy weight such as a couple large cans or stone mortar and pestle on top and let drain for 15 minutes. Remove the weight and twist the gathered muslin to squeeze out any remaining excess liquid.\nSerious Eats / Kanika and Jatin Sharma\nIn a large saucepan or sauté pan, heat the water, sugar, and cardamom pods over medium-low heat, stirring to dissolve sugar, until beginning to simmer.\nSerious Eats / Kanika and Jatin Sharma\nMeanwhile, transfer the drained chenna (milk solids) to a clean surface and sprinkle the cornstarch on top. Knead the chenna, pressing it with the heel of your hand, until smooth, 10 minutes. (The mixture will be crumbly at first but will smooth out as you knead it.) Divide into 16 equal portions and shape each portion into a small ball.\nSerious Eats / Kanika and Jatin Sharma\nReduce syrup heat to low and gently add the balls. Cover and cook until the rasgulla have doubled in size and are soft and spongy, 12 to 14 minutes. Remove from the heat. Transfer rasgulla and some of their syrup to individual serving dishes and serve.\nSerious Eats / Kanika and Jatin Sharma\nSpecial Equipment\nFine-mesh strainer or colander, muslin\nor cheesecloth\nMake-Ahead and Storage\nRasgulla can be made up to three days ahead of serving; store both rasgulla and syrup together in an airtight container in the refrigerator. Once refrigerated, they are best served chilled, as reheating will degrade their quality.\nIndian Cuisine\nThe Latest\nDesserts\nMilk"
}