{
  "url": "https://www.seriouseats.com/raspberry-yogurt-popsicles-recipe-11758810",
  "image_url": "https://www.seriouseats.com/thmb/5YwC2Sw9XujZObA1chsr4a_LwSw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__08__20200811-yogurt-fruit-popsicles-raspberry-vicky-wasik-6-9d4f4e664d1b46eeab53e0a5126c53f9.jpg",
  "tags": [
    "Popsicles",
    "Recipes",
    "Summer Desserts",
    "Desserts",
    "Summer"
  ],
  "title": "The Sweet, Tangy Frozen Snack You’ll Be Grateful for During This Heat Wave",
  "full_text": "The Sweet, Tangy Frozen Snack You’ll Be Grateful for During This Heat Wave\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nCooling and Freezing Time\n4 hrs 30 mins\nTotal\n4 hrs 50 mins\nServes\n6 popsicles (see note)\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Raspberry Purée:\n8\nounces\n(\n1 3/4\ncups\n;\n225\ng\n) fresh or\nfrozen raspberries\n(see note)\n3\nounces\nwater\n(\n1/4\ncup\nplus\n2\ntablespoons\n;\n85\ng\n)\n3\nounces\ngranulated sugar\n(\n1/4\ncup\nplus\n2\ntablespoons\n;\n85\ng\n)\n1/4\nteaspoon\nfresh orange juice\nfrom\n1\norange\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Yogurt Base:\n5 1/2\nounces\n(\n3/4\ncup\n;\n155\ng\n) strained\nfull-fat Greek yogurt\n, 5% milkfat (see note)\n2\nounces\ngranulated sugar\n(\n1/4\ncup\n;\n55\ng\n)\n2\nounces\n(\n1/4\ncup\n;\n55\ng\n)\nheavy cream\n(see note)\n1/2\nteaspoon\nfresh orange juice\nfrom\n1\norange\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nDirections\nFor the Raspberry Purée:\nIn a 2-quart stainless steel saucepan, stir together raspberries, water, sugar, orange juice, and salt. Bring to a boil over medium-high heat, then reduce heat to maintain a gentle simmer. Cook, stirring occasionally with a heat-resistant spatula, until the raspberries have broken down and the mixture has slightly thickened in consistency, about 10 minutes. Remove from heat and let cool for 30 minutes. Transfer mixture to a blender and process until very smooth, about 15 seconds. Strain the raspberry purée through a fine-mesh strainer set over a small bowl to remove seeds (you should have 1 cup of strained purée).\nFor the Yogurt Base\n: In a medium bowl, whisk together yogurt, sugar, cream, orange juice, and salt until well combined.\nTo make the Popsicles\n: Whisk raspberry purée into yogurt base until thoroughly combined. Divide popsicle base evenly between six 3-fluid-ounce popsicle molds and freeze until solid, at least 4 hours (to make filling the molds easier, you can transfer the popsicle mixture to a measuring cup or other vessel with a spout first). To unmold, follow your popsicle mold's instructions.\nSpecial Equipment\n2-quart stainless steel saucepan, heat-resistant spatula,\nfine-mesh strainer\n,\nblender\n,\n3-ounce popsicle molds\nNotes\nThis recipe is formulated to make six 3-ounce popsicles, but you can scale it up or down as needed to accommodate popsicle molds of different sizes and numbers.\nYou can read about\nour favorite popsicle molds right here\n.\nIf using frozen fruit, place the frozen raspberries in a medium bowl and let thaw at room temperature until slightly softened, about 20 minutes. Discard any liquid that has accumulated at the bottom of the bowl before proceeding with the recipe (this will increase the total time of the recipe).\nNot all Greek yogurts are created equal, which can make a big difference in a recipe where it’s the main ingredient. Look for brands that contain nothing but milk and active cultures, such as Fage and Chobani, or try skyr instead. Steer clear of any yogurt or skyr artificially thickened with gums or pectin, as its high moisture content can alter the frozen texture.\nWe highly recommend sticking with full-fat greek yogurt; substituting with low-fat or skim yogurts will produce icy popsicles with a harsher, more tart flavor. The same goes for heavy cream; substituting with milk of lower fat percentages will produce icy popsicles with a watered-down flavor.\nMake-Ahead and Storage\nThe raspberry purée can be refrigerated in an airtight container for up to 5 days.\nAfter unmolding, each popsicle can be tightly wrapped in plastic and kept frozen for up to 4 weeks.\nThis Recipe Appears In\nHow to Make Yogurt Popsicles With Your Fruit of Choice\nPopsicles\nRecipes\nSummer Desserts\nDesserts\nSummer"
}