{
  "url": "https://www.seriouseats.com/real-irish-soda-bread-recipe",
  "image_url": null,
  "tags": [
    "Quick Breads",
    "Irish",
    "Spring Breakfast & Brunch",
    "St. Patrick's Day"
  ],
  "title": "Real Irish Soda Bread",
  "full_text": "Real Irish Soda Bread\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nActive\n2 mins\nCooling Time\n30 mins\nTotal\n100 mins\nServes\n10\nto 12 servings\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\n15\nounces\nall-purpose flour\n, such as Gold Medal (\n3\ncups\n;\n425\ng\n)\n1 3/4\nteaspoons\n(\n7\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use the same weight or half as much by volume\n1 1/8\nteaspoons\n(\n6\ng\n)\nbaking soda\n(see notes)\n18\nounces\nlow-fat cultured\nbuttermilk\n(\n2 1/4\ncups;\n510\ng\n), well shaken\nDirections\nAdjust oven rack to middle position and preheat to 450°F (230°C) at least 15 minutes in advance. Roughly cover bottom of deep 10-inch cast-iron or enameled Dutch oven with sheet of parchment paper; no need to trim.\nSerious Eats / Vicky Wasik\nCombine flour, salt, and baking soda in a large bowl and whisk for full minute to combine. Stir in buttermilk with flexible spatula until dough is fully moistened and no pockets of flour remain. For extra-fluffy results, stop folding as soon as dough comes together. For extra-chewy results, fold dough about 20 seconds more. Scrape sticky dough into prepared Dutch oven and smooth with spatula into rough boule-like shape. Score deeply into quarters with sharp knife or razor, cleaning the blade between each slice.\nSerious Eats / Vicky Wasik\nCover and bake until well risen and golden, 45 minutes. Remove lid and continue baking until chestnut brown, with an internal temperature of 210°F (99°C), 12 to 15 minutes longer. Invert onto a wire rack, discard parchment, turn right side up, and cool until crumb has set, about 30 minutes. Cut thick slices to accompany hearty soups and stews, or slice thinly for sandwiches. (This will be easier if bread cools at least 2 hours.) Store up to 24 hours in an airtight container and toast to freshen bread before serving.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n10-inch cast iron or enameled\nDutch oven\n,\nwire rack\nNotes\nUnless your\ndigital scale\nis exquisitely sensitive, measure the baking soda by volume; even an extra gram can produce an unpleasantly soapy loaf of bread.\nQuick Breads\nIrish\nSpring Breakfast & Brunch\nSt. Patrick's Day"
}