{
  "url": "https://www.seriouseats.com/real-deal-kung-pao-chicken-recipe",
  "image_url": "https://www.seriouseats.com/thmb/BDJ9J1TKURp-WzODtAmxbrdg_Zg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2010__06__2021-02-12-Real-Deal-Kung-Pao-Chicken-MHOM-21-d8de1c4b127a4dc7b6d9e43e4b18a9e8.jpg",
  "tags": [
    "Chicken Stir-Fry",
    "Chinese",
    "Chicken Thighs",
    "Chicken Mains",
    "Quick Dinners"
  ],
  "title": "Real-Deal Kung Pao Chicken Recipe",
  "full_text": "Real-Deal Kung Pao Chicken Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nMarinating Time\n30 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\nboneless skinless chicken thighs\n, trimmed of excess fat, and cut into 1/2 to 3/4-inch pieces\n2\ntablespoons\nsoy sauce\n, divided\n2\ntablespoons\nShaoxing wine\n, divided (or dry sherry, if unavailable)\n1\ntbsp\ncornstarch\n, divided\n1/3\ncup\npeanut oil\n1 to 2\ntablespoons\nSichuan peppercorns\ntoasted in hot skillet for 30 seconds until fragrant, divided (see note)\n3\nscallions\n, whites finely minced, and greens finely sliced, reserved separately\n1/2\ncup\nfried fresh peanuts or\nroasted unsalted peanuts\n2\ncloves\nminced garlic\n(about\n4\nteaspoons\n)\n1\ntablespoon\nminced\nfresh ginger\n1\ntablespoon\nChinese black vinegar\n(or distilled white vinegar if unavailable)\n1\ntablespoon\nSichuan fermented chili-bean paste\n(or generic Asian chili-garlic sauce if unavailable)\n2\nteaspoons\nsugar\n12\nhot Chinese dry chile\npeppers\n, seeded\n2\nsmall\nleeks\n, white and light green parts only, cut into 1/4-inch slices (about\n1/2\ncup\ntotal)\nDirections\nCombine chicken, 2 teaspoons soy sauce, 2 teaspoons Shaoxing wine, and 1 teaspoon cornstarch in medium bowl and mix thoroughly. Allow to marinate in fridge for at least 30 minutes, and up to two hours.\nGrind half of Sichuan peppercorns in mortar and pestle. Combine with scallion greens and reserve. Combine scallion whites, garlic, and ginger in small bowl. Combine remaining soy sauce, remaining Shaoxing wine, remaining corn starch, black vinegar, chili-bean paste, and sugar in small bowl and mix until cornstarch is fully dissolved.\nSet fine-meshed strainer over small heat-proof bowl. Heat peanut oil in wok over high heat until shimmering. Add remaining Sichuan peppercorns and dried chiles and cook until fragrant, about fifteen seconds. Drain in strainer. Pick out chiles and reserve. Discard peppercorns.\nReturn wok to high heat until smoking. Add 1/4 of oil and immediately add half of marinated chicken. Spread in even layer with spatula. Cook without moving for 1 minute, then cook, stirring and tossing constantly until barely cooked through, about 1 minute longer. Transfer to a medium metal bowl. Wipe out wok with paper towel, add another 1/4 of oil, and repeat with remaining chicken. Wipe out wok with paper towel, add another 1/4 of the oil, and cook leeks until charred in spots but still slightly crisp, about 1 minute. Add peanuts, reserved chiles, reserved chicken, and remaining oil to wok and push to side to make space in the center of the wok. Add garlic/ginger mixture and cook, stirring mixture constantly until aromatic, about 15 seconds. Toss entire contents of wok together and add sauce. Cook, stirring and tossing constantly until chicken is coated in glossy layer of sauce. Stir in scallion greens and ground Sichuan pepper. Transfer to serving plate and serve immediately with steamed white rice.\nSerious Eats / Melissa Hom\nSpecial Equipment\nWok\nNotes\nYou can find Sichuan peppercorns online at The Mala Market.\nThis Recipe Appears In\nWok Skills 101: Stir-Frying Basics\nThe Food Lab: For the Best Stir-Fry, Fire Up the Grill\nChicken Stir-Fry\nChinese\nChicken Thighs\nChicken Mains\nQuick Dinners"
}