{
  "url": "https://www.seriouseats.com/real-texas-chili-con-carne",
  "image_url": "https://www.seriouseats.com/thmb/mdFx8UDn6-Ki6uAXyU9cY3suGKY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230915-SEA-OriginalTexasChiliConCarneRecipe-GregDupree-01-e5624a96b6fd4f93b707b8cc3f2b2cf4.jpg",
  "tags": [
    "Chili",
    "Southwestern & Tex Mex",
    "Beef Chuck",
    "Beef Mains",
    "Winter Mains"
  ],
  "title": "Original Texas Chili Con Carne",
  "full_text": "Original Texas Chili Con Carne\nClose\nJump to recipe\nPrep\n10 mins\nCook\n3 hrs 20 mins\nActive\n45 mins\nCooling and Chilling Time\n8 hrs 5 mins\nTotal\n11 hrs 35 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nwhole\nsweet\ndried chiles\nlike costeño, New Mexico, or choricero, stems and seeds removed (\n0.7\nounces\n;\n19\ng\n)\n2\nsmall\nhot dried chiles\nsuch as arbol, stems and seeds removed\n3\nwhole\nrich, fruity\ndried chiles\nlike ancho, mulatto, ñegro, or\npasilla\n, stems and seeds removed (\n1.4\nounces\n;\n40\ng\n)\n1\nquart\n(\n1\nL\n) low-sodium canned or\nhomemade\nchicken broth\n, divided\n2\nwhole\nchipotle chiles\ncanned in adobo sauce, plus\n2\ntablespoons\nsauce\n, stems and seeds removed (\n1.2\nounces\n;\n34\ng\n)\n4\npounds\n(\n1.8\nkg\n)\nbeef chuck\n, trimmed of excess gristle and fat, cut into 2-inch cubes\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1\nmedium\nonion\n(\n8\nounces\n;\n227\ng\n), finely diced\n4\nmedium\ncloves\ngarlic\n, minced\n1/4\nteaspoon\npowdered\ncinnamon\n(optional)\n1\ntablespoon\nground cumin\n(optional)\n1/4\nteaspoon\nground allspice\n(optional)\n2\nteaspoons\ndried oregano\n(optional)\n2\ntablespoons\nAsian\nfish sauce\n(optional)\n2 to 3\ntablespoons\nmasa harina\n1-2\ntablespoons\napple cider vinegar\n, to taste\nHot sauce\n, to taste\nCilantro\n, chopped onions, scallions, grated cheese, avocado, and warm tortillas for serving as desired\nDirections\nAdd dried chiles to a large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to a 2 quart microwave-safe liquid measuring cup or bowl, set aside. (Alternatively, place dried chiles on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl.) Add half of chicken broth and chipotle chiles and their sauce, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside for 5 minutes. Transfer chiles and liquid to blender and blend, starting on the lowest possible setting and gradually increasing speed to high (make sure to hold the lid down with a clean kitchen towel or a potholder to prevent it from blowing out). Blend until smooth, about 1 minute.\nSerious Eats / Greg Dupree\nSeason beef cubes generously with salt and pepper. Heat oil in the base of a Dutch oven over high heat until just starting to smoke. Add half of the beef cubes in a single layer and cook until deeply browned on a single side, about 3 minutes. Remove from pot, set aside with remaining unseared beef.\nSerious Eats / Greg Dupree\nReturn Dutch oven to medium-high heat. Add onion and cook, stirring frequently until translucent and softened, about 2 minutes. Add garlic, and if using, cinnamon, cumin, allspice, and oregano, and cook, stirring constantly until fragrant, about 1 minute. Add all meat (seared and non-seared) and accumulated juices back to pan along with chile purée, stir to combine.\nSerious Eats / Greg Dupree\nBring to a boil over high heat, reduce to a gentle simmer over medium-low heat. Cover, leaving lid just barely ajar, and cook, stirring occasionally, until meat is completely tender, about 3 hours. (Check sauce levels occasionally; if sauce gets too thick, add 1/4 cup water or stock until desired consistency is reached). Once sauce has thickened to desired consistency, cover completely for the remainder of cook time. Alternatively, chili can be cooked in a 200° to 250°F (95° to 120°C) oven with the lid of the Dutch oven slightly ajar.\nSerious Eats / Greg Dupree\nStir in optional fish sauce, and vinegar. Season to taste with salt and hot sauce. For best results, allow chili to cool and store in the refrigerator at least overnight and up to 5 days. Reheat the next day to serve.\nSerious Eats / Greg Dupree\nServe, garnished with cilantro, chopped onions, scallions, grated cheese, avocado, and warm tortillas as desired.\nSerious Eats / Greg Dupree\nSpecial Equipment\nDutch oven\nor\nstock pot\n,\nblender\nNotes\nThis makes for a moderately hot to hot chili. You can vary the heat by adding or removing the hot chiles and the canned chipotles.\nRead More\nChile Verde With Pork\nHow to Add Chile Flavor Without Too Much Heat\nCincinnati Chili\nThe Best Vegetarian Bean Chili\nChili\nSouthwestern & Tex Mex\nBeef Chuck\nBeef Mains\nWinter Mains"
}