{
  "url": "https://www.seriouseats.com/real-barbecued-pulled-pork",
  "image_url": "https://www.seriouseats.com/thmb/_v7X5SRaRvlVVcMidUkvknDnmaQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190618-barbecue-smoked-pork-shoulder-pulled-pork-sandwiches-vicky-wasik-18-6f8e51604f5940f39bb8de5d69729076.jpg",
  "tags": [
    "Pork",
    "Grilled Pork",
    "Barbecue",
    "Pork",
    "Summer Mains"
  ],
  "title": "Low-and-Slow Pulled Pork (Smoked Pork Shoulder)",
  "full_text": "Low-and-Slow Pulled Pork (Smoked Pork Shoulder)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n12 hrs\nActive\n3 hrs\nDry-Brining and Resting Time\n8 hrs 20 mins\nTotal\n20 hrs 30 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n10-pound; 4.5 kg\n) skinless, bone-in\npork butt\n, or\n1\n(\n6-pound; 2.7 kg\n) skinless,\nboneless pork butt\n(see note)\nKosher salt\nBrown or\nyellow mustard\n, for slathering\nHot sauce\n, such as Texas Pete, for slathering (optional)\nLean and Mean Dry Rub for Pulled Pork\nEastern North Carolina Vinegar-and-Pepper Barbecue Sauce\nPotato buns\n, for serving\nColeslaw\n, for serving\nDirections\nThe Day Before You Begin Smoking:\nSet a wire rack over a rimmed baking sheet. Season pork shoulder generously all over with salt and set on the wire rack. Refrigerate at least overnight (8 hours) or up to 24 hours.\nSerious Eats / Vicky Wasik\nLift pork shoulder and remove wire rack, then set shoulder directly on rimmed baking sheet. Turn pork shoulder fat cap side down. Rub a generous and even coating of mustard and hot sauce (if desired) all over the exposed sides of the pork shoulder.\nSerious Eats / Vicky Wasik\nSprinkle dry rub evenly all over the slathered sides of the shoulder, creating a coating that's thorough but not too heavy. Turn pork shoulder fat cap side up. Repeat slathering and sprinkling of dry rub on that final side.\nSerious Eats / Vicky Wasik\nPreheat smoker to 225°F (105°C) and prepare with the hardwood of your choice. (How you do this will depend on your smoker; some burn logs of wood, some burn charcoal with wood chunks or chips sprinkled on top, some burn pellets, some are electric, and some use gas.) You'll want to maintain a relatively even 225°F temperature for the duration of the cooking time, with a continuous supply of clean smoke. (The smoke should look like thin blue wisps, not heavy white clouds.)\nSet pork in smoker, fat cap side up. Fill a disposable aluminum roasting pan with an inch or two of water and set it in the smoker as well. If your smoker doesn't have a drip tray, put the pan of water below the pork to catch grease; if it does, set the tray wherever there's space.\nSerious Eats / Vicky Wasik\nSmoke pork shoulder until a leave-in probe thermometer registers 195°F (91°C) in the center; make sure the thermometer is not touching a bone. This can take roughly 12 to 15 hours. It's impossible to give a more precise time estimate, since this depends on several variables, including how even the smoker temperature is, the size and thickness of the shoulder, and other factors. A boneless shoulder will cook faster than a bone-in one, but in either case, monitor the temperature frequently as it approaches its goal. Remove pork shoulder from smoker and let rest 20 minutes.\nUsing two forks or a set of bear claws, shred pork into thin, stringy strands, breaking up any un-rendered fat into small pieces. Discard bones and/or butcher's twine used to truss a deboned shoulder (see note) as you find them. Break up the bark (the dark crust on the pork) into small pieces and mix into the pulled pork. Mix well again to distribute the bark and fat. Chop pork more finely, if desired.\nSerious Eats / Vicky Wasik\nSprinkle barbecue sauce on top of pork to your taste, stirring to mix it in thoroughly. Season with additional salt, if desired.\nSerious Eats / Vicky Wasik\nPile pulled pork onto potato buns, then top with coleslaw. Close sandwiches and serve, passing more barbecue sauce at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nSmoker\n, forks or bear claws (optional),\nwire rack\nand\nrimmed baking sheet\n, disposable aluminum roasting tray (or other container to hold water in the smoker),\nleave-in probe thermometer\nNotes\nPork butt, a part of the shoulder, is also called Boston butt. We recommend bone-in if you can get it, but a boneless one will work as well; if using boneless, tie the shoulder up into a uniform shape with butcher's twine (or ask your butcher to do this for you) before beginning the recipe, so that the meat cooks evenly. Try to find a shoulder that still has a nice, even fat cap attached.\nMake-Ahead and Storage\nLeftover pulled pork freezes well. To store in the freezer, transfer to a zipper-lock bag, push out excess air, then freeze for up to 3 months. Defrost in the fridge, then reheat pulled pork in a skillet along with just enough water to lightly moisten.\nRead More\nGuide to Grilling: Smoking on a Charcoal Kettle Grill\nHow to Use Smoke Woods\nEasy Oven-Cooked Pulled Pork Recipe\nSous Vide Barbecue Pulled Pork Shoulder Recipe\nPork\nGrilled Pork\nBarbecue\nPork\nSummer Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/low-and-slow-pulled-pork-smoked-pork-shoulder.webp?"
}