{
  "url": "https://www.seriouseats.com/red-ale-for-beginning-homebrewers-hoppy-red-ale-recipe",
  "image_url": "https://www.seriouseats.com/thmb/YZldY0etJgQWerD4N0gNT540LSE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110422-148765-Homebrew-Red-Ale-11419b976f6d4006bfe27c3b58d6c339.jpg",
  "tags": [
    "Beer",
    "Fermentation"
  ],
  "title": "Hoppy Red Ale (For Beginning Homebrewers) Recipe",
  "full_text": "Hoppy Red Ale (For Beginning Homebrewers) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n90 mins\nActive\n4 hrs\nFermentation and Cooling Time\n505 hrs\nTotal\n506 hrs 50 mins\nCook Mode\n(Keep screen awake)\nIngredients\n6\ngallons\nof\ntap water\n, split\n6\npounds\nLight liquid\nmalt\nextract\n1\npound\nCaraRed\nmalt\n, crushed\n1/2\npound\nCrystal\n60 L malt\n, crushed\n2\nounces\nBlack Roasted\nBarley malt\n, crushed\n1\nounce\nCentennial\nHops\n—60 minutes\n1\nounce\nCentennial\nHops\n—15 minutes\n1\nounce\nAmarillo\nHops\n—5 minutes\n1\nLiter\nstarter of American Ale\nyeast\n(White Labs WLP001 or Wyeast 1056)\n1\nounce\nAmarillo\nHops\n—for dry hopping in secondary\npriming sugar\nfor bottling\nDirections\nIf possible, place 3 gallons water in the refrigerator to cool in a sanitized container.\nTie the CaraRed, Crystal 60L and Black Roasted Barley malt in a large mesh grain bag or hop bag. Place the bag in 3 gallons of water in a 5 gallon pot and immerse the grain.\nBegin to heat, making sure mesh bag isn’t sitting directly on the bottom of the pot. Remove the grain bag when the temperature reaches 170°F (77°C).\nBring wort to a vigorous boil. As water is heating, slowly add 6 pounds of light liquid malt extract, stirring constantly until completely dissolved. When the boil begins, add 1 ounce Centennial hops in a mesh bag.\nAfter 45 minutes of boiling has passed, add 1 ounce Centennial hops in a mesh bag.\nAfter a total of 55 minutes has passed, add 1 ounce Amarillo hops in a mesh bag.\nAfter total of 60 minutes of boil, remove from heat.\nWarning:\nAfter wort cools below 180°F (82°C) everything that touches it should be sanitary, and exposure to open air should be limited as much as possible.\nCool wort by placing pot in ice bath until it is below 85°F (29°C). Transfer to sanitized fermentor (either a carboy or a fermentation bucket). Top off to make 5 gallons using refrigerated water.\nUse a sanitized auto-siphon racking cane to remove enough wort to take a gravity reading with your hydrometer. Make a note of this number, since you will be using it to calculate the actual alcohol content when it's done fermenting. The reading should be around 1.050.\nCarefully pour yeast into cooled wort (it should be below 70°F or 21°C), and agitate vigorously. Cover fermentor with a sanitized stopper and airlock. Ferment in dark place, keeping ambient temperature consistent, preferably between 65° and 68°F (18° and 20°C).\nAfter 2 to 3 weeks when primary fermentation is complete (take at least 2 consistent gravity readings), transfer to a secondary carboy for conditioning, add 1 ounce Amarillo hops for dry hopping and store as cool as possible.\nBottle after another 1 to 2 weeks using enough priming sugar for a medium level of carbonation\naccording to these instructions.\nSpecial Equipment\n5 gallon glass carboy in addition to\nbasic homebrewing equipment setup\nRead More\nHomebrewing: Essentials for Your First Brew\nHomebrewing: Carbonation and Bottling\nBeer\nFermentation",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/hoppy-red-ale-for-beginning-homebrewers-recipe.webp?"
}