{
  "url": "https://www.seriouseats.com/red-eye-gravy-recipe-8640434",
  "image_url": "https://www.seriouseats.com/thmb/Oa4q2RFZDZ_3yPMbg3NA1zjhacc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240429-RedEyeGravy-MorganGlaze-02-8bee20380c874670b56ceca3bca2416e.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Condiments & Sauces",
    "Soul Food & Southern",
    "Ham"
  ],
  "title": "Red-Eye Gravy",
  "full_text": "Red-Eye Gravy\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nSoaking Time\n20 mins\nTotal\n50 mins\nServes\n4\nMakes\n1/2 cup gravy\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n454\ng\n) untrimmed center-cut\ncountry ham\nslices, preferably bone-in (about two to three 1/4 inch thick slices (see notes)\n1 tablespoon (\n14\ng\n)\nunsalted butter,\ndivided\n1/2\ncup\n(118ml) strong\nblack coffee\n1/4\ncup (60ml)\nwater\n1/4\nteaspoon\nlight brown sugar\nPinch\nfreshly\nground black pepper\nDirections\nIn a large baking dish or large bowl, place ham slices and cover with cold water until fully submerged. Soak for 30 minutes.\nSerious Eats / Morgan Hunt Glaze\nPat ham dry as best as possible with paper towels. Trim fat from ham; reserve fat trimmings and ham slices separately. You should have about ⅓ to ½ cup (about 3 ounces) of trimmed fat.\nSerious Eats / Morgan Hunt Glaze\nIn a 12-inch stainless-steel skillet or sauté pan, heat the reserved fat trimmings and 1/2 tablespoon butter over medium-low heat, stirring occasionally, until fat has rendered, 6 to 8 minutes. Reserve 1 tablespoon drippings (rendered fat) in skillet, and transfer any additional drippings to a small bowl; set aside.\nSerious Eats / Morgan Hunt Glaze\nIncrease heat to medium, push rendered trimmings to one side, and place 1 slice ham in skillet. Cook, until browned on both sides, 2 to 3 minutes per side. Transfer to a plate and repeat with remaining ham slices, adding a teaspoon of the reserved drippings as needed to the skillet in between slices if skillet is dry. Remove and discard crispy trimmings.\nSerious Eats/Morgan Glaze\nPour any remaining reserved drippings into the skillet and swirl to coat. Pour in coffee and water and bring to a simmer over medium heat, scraping bottom of skillet with a flat wooden spoon to release any browned bits. Simmer, stirring occasionally, until mixture has reduced to about ½ cup, 3 to 5 minutes. Remove from heat and whisk in sugar, pepper, and remaining ½ tablespoon butter until melted and incorporated. Serve immediately with reserved fried country ham slices.\nSerious Eats/Morgan Glaze\nSpecial Equipment\n12-inch stainless-steel skillet or sauté pan\nNotes\nBone-in slices tend to come untrimmed and slightly fattier, yielding enough drippings to build the gravy, and the marrow of the bone adds richness and depth to the overall flavor. If you cannot get ham with the bone-in, opt for a piece that has a generous amount of fat for trimming and rendering.\nIf your coffee is weak, skip the water and use 3/4 cup coffee.\nMake-Ahead and Storage\nLeftover red-eye gravy can be refrigerated in an airtight container for up to 7 days or frozen for up to 3 months. Fats will solidify and separate. Reheat over low on the stovetop in a saucepan or skillet, and be sure to whisk well before using.\nBreakfast & Brunch\nThe Latest\nCondiments & Sauces\nSoul Food & Southern\nHam"
}