{
  "url": "https://www.seriouseats.com/red-velvet-cake-recipe-8779083",
  "image_url": "https://www.seriouseats.com/thmb/21nzM6htExOJWsXnH9i488jyQIM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/00000000-SEA-Red-Velvet-Cake-DebbieWee-hero-b2849cb0f8a34d17baf3bbe977fca7ec.jpg",
  "tags": [
    "Cakes",
    "Desserts",
    "Layer Cake",
    "Valentine's Day"
  ],
  "title": "Red Velvet Cake",
  "full_text": "Red Velvet Cake\nClose\nJump to recipe\nPrep\n30 mins\nCook\n25 mins\nCooling Time\n60 mins\nTotal\n115 mins\nMakes\n1 2-layer 8-inch cake or 22 cupcakes\nCook Mode\n(Keep screen awake)\nIngredients\n265\ng\nall-purpose flour\nabout\n9 1/4\nounces\n;\n2\ncups\nplus\n1\nteaspoon\n)\n50\ng\nnatural unsweetened\ncocoa powder\n, not Dutch-processed (\n1 3/4\nounces\n;\n1/2\ncup\nplus\n1\ntablespoon\n), plus extra for dusting cake pans\n1 1/2\nteaspoons\nbaking soda\n227\ng\nunsalted butter\n(\n8\nounces\n;\n2\nsticks\n), room temperature, plus more for greasing\n144\ng\ngranulated sugar\n(about\n5\nounces\n;\n3/4\ncup\nminus 1 teaspoon)\n144\ng\nlight brown sugar\n(about\n5\nounces\n;\n2/3\ncup\nlightly packed)\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\ntablespoon\n(\n15\nml\n)\nvanilla extract\n1\ntablespoon\nred gel paste\nfood coloring\n(optional; see notes)\n3\nlarge\neggs\n, room temperature\n1\ncup\n(\n240\nml\n)\nbuttermilk\n, room temperature\nTo Frost the Cake:\n1 recipe\nFlour Frosting (a.k.a. Ermine Frosting)\n,\nCream Cheese Buttercream Frosting\n, or\nFast and Easy\nCream Cheese Frosting\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). Grease two 8-inch round cake pans with butter and cover the bottom with a round of\nparchment paper\n. Lightly dust the insides of the cake pans with cocoa powder and discard any excess by tapping the pans upside down. (For cupcakes, line a muffin pan with baking cups.)\nSerious Eats / Debbie Wee\nIn a medium bowl, sift the flour, 50g cocoa, and baking soda together and lightly whisk to combine. Set aside.\nSerious Eats / Debbie Wee\nIn the bowl of a stand mixer fitted with the paddle attachment, beat the butter, granulated sugar, brown sugar, salt, and vanilla extract on low speed to roughly incorporate; then increase speed to medium and beat until soft, fluffy, and pale, 5 to 7 minutes, using a flexible spatula to scrape as needed.\nSerious Eats / Jen Causey\nWith the mixer running on its lowest speed, drizzle in the food coloring (if using). Gradually increase the speed to medium and mix until the coloring is evenly distributed, about 30 seconds, stopping to scrape down the sides of the bowl if needed. With the mixer on low speed, add the eggs one by one, briefly increasing the mixer speed after each addition until each egg is fully incorporated. Once fully mixed, stop mixer and use a flexible spatula to scrape down the sides of the bowl.\nSerious Eats / Debbie Wee\nAdd a third of the flour-cocoa mixture to the butter-egg mixture, then start mixer on low speed and gradually increase to medium speed, until no dry flour remains, about 30 seconds. On low speed, slowly add a third of the buttermilk and beat until fully incorporated, about 30 seconds. Scrape down the bowl as needed, and repeat adding and alternating with half of the remaining flour mixture, half of the remaining buttermilk, then finally the remaining flour mixture, and the remaining buttermilk.With a rubber spatula, scrape the paddle clean and give the batter a final stir, making sure to scrape the bottom of the bowl.\nSerious Eats / Debbie Wee\nFor Cupcakes:\nLine standard-size muffin pan with baking-cup liners. Distribute the batter evenly among the baking cups so each is about 3/4 full. Bake for 24 to 26 minutes, or until a tester comes out clean. Repeat with remaining batter. Let cool completely before frosting. Once cool, use an offset spatula to spread the frosting on top of each cupcake.\nFor a Layer Cake:\nScrape the batter into the prepared pans and bake until a toothpick or cake tester inserted into cake center comes out clean, 25 to 30 minutes. Cool cakes in their pans on a cooling rack for 15 minutes. Run an offset spatula or butter knife around edges of cakes, then invert cake onto a plate and transfer back to the rack to cool completely, at least 1 hour.\nSerious Eats / Debbie Wee\nTo Crumb Coat the Cake:\nUsing a serrated knife,\nlevel cakes\n. Place one layer on a turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with 1 cup frosting, using an offset spatula to spread it evenly from edge to edge. Top with the second layer and cover the sides of the cake with 1 cup frosting, spread into an even and smooth layer. (Tutorial\nhere\n.) Refrigerate cake until frosting is firm to the touch, about 30 minutes.\nSerious Eats / Debbie Wee\nTo Finish the Cake:\nSpread the top and sides of the cake with the remaining frosting to decorate as desired. Allow the cake to come to room temperature before serving.\nSerious Eats / Debbie Wee\nSpecial Equipment\nParchment paper, two 8-inch aluminum\ncake pans\nor\nmuffin pan\n,\nstand mixer\n, whisk, rubber spatula, wire rack, turntable, offset spatula\nNotes\nMake sure to use natural cocoa, and not Dutch processed cocoa in this recipe. The higher acidity in natural cocoa reacts with the cake's baking soda and buttermilk to properly leaven the cake. Natural cocoa is also lighter in color than Dutch processed cocoa, which ensures the red velvet cake retains its signature red color.\n4 teaspoons of red liquid food coloring can be substituted for gel paste coloring.\nMake-Ahead and Storage\nThe frosted cake can be covered with a cake dome or a large inverted pot and held at room temperature for up to 1 day, or refrigerated for up to 4 days.\nCupcakes can be transferred to an airtight container and held at room temperature for up to 1 day or refrigerated for up to 3 days.\nCakes\nDesserts\nLayer Cake\nValentine's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/red-velvet-cake.webp?"
}