{
  "url": "https://www.seriouseats.com/red-wine-poached-pears-recipe-8764366",
  "image_url": "https://www.seriouseats.com/thmb/YzM2X3qv5tkmCsl06jIhEZ42FOg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241219-RedWinePoachedPears-AmandaSuarez-10-b4e67612131e432293a2d8c3b5049413.jpg",
  "tags": [
    "The Latest",
    "Desserts",
    "Fall",
    "Winter",
    "Christmas"
  ],
  "title": "This Weeknight-Friendly French Dessert Requires Just a Bottle of Wine and a Few Pears",
  "full_text": "This Weeknight-Friendly French Dessert Requires Just a Bottle of Wine and a Few Pears\nClose\nJump to recipe\nCook\n60 mins\nTotal\n60 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n750\nml\nbottle of\nred wine\n1\ncup\ngranulated sugar\n(7 ounces; 200g)\nOne 2-inch piece\norange peel\nfrom 1 medium orange\nOne\n2-inch\ncinnamon stick\n3\ncloves\n5\nblack\npeppercorns\n3\nstar anise\n6\nfirm but ripe\nmedium\npears\n(about 2 1/4 pounds; 1kg), peeled\nIce cream\nor vanilla sauce for serving (optional)\nDirections\nIn a 5-quart non-reactive pot or Dutch oven, combine red wine and sugar. Bring to a boil over high heat, stirring occasionally to dissolve sugar, about 6 minutes. Reduce heat to medium and add orange peel, cinnamon stick, cloves, black peppercorns, and star anise.\nSerious Eats / Amanda Suarez\nUsing your hands, carefully hold pears by the stem and lower them into the wine mixture one at a time. Gently simmer pears, uncovered, until tender and a knife pierces the flesh easily, 25 to 30 minutes.\nSerious Eats / Amanda Suarez\nUsing a slotted spoon, remove poached pears and carefully arrange into a single layer in a wide, shallow bowl; set aside. (This prevents the pears from weighing down and squishing one another.)\nSerious Eats / Amanda Suarez\nIncrease heat to medium-high. Bring poaching liquid to a simmer and cook, stirring occasionally, until it has reduced to a glaze and is thick enough to coat a spoon, 20 to 30 minutes; you should have about 3/4 cup glaze. Serve pears with warm glaze spooned over and ice cream or vanilla sauce, if desired.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n5-quart non-reactive pot or Dutch oven, slotted spoon\nMake-Ahead and Storage\nPears can be prepared through step 3 and refrigerated in their poaching liquid up to 3 days in advance. Once pears are tender, use a slotted spoon to remove fruit and carefully arrange them into a single layer in an airtight container. Allow poaching liquid to cool completely, then pour over pears before refrigerating.\nWhen ready to serve, bring poaching liquid to a simmer over medium heat. Gently lower pears and simmer until just warmed through, about 5 minutes. Using a slotted slotted spoon, remove poached pears and carefully arrange into a single layer in a wide, shallow bowl; set aside. Proceed with step 4 of recipe.\nThe Latest\nDesserts\nFall\nWinter\nChristmas"
}