{
  "url": "https://www.seriouseats.com/red-plum-jam-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Lj15IjNWN-2gbMrK_ZtGJFaHE_Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__20140630-plum-jam-beignets-jennifer-latham-36175e87792a442b864acf3729e1a6ff.jpg",
  "tags": [
    "Jams & Jellies",
    "Plum"
  ],
  "title": "Rich Red Plum Jam Recipe",
  "full_text": "Rich Red Plum Jam Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n70 mins\nActive\n90 mins\nMacerating and Cooling Time\n11 hrs\nTotal\n12 hrs 25 mins\nServes\n96 servings\nMakes\n12 half-pint jars\nCook Mode\n(Keep screen awake)\nIngredients\n5\npounds\nlarge red-fleshed plums\n, such as Elephant Hearts, halved and pitted\n2\npounds\nwhite\ncane sugar\n, divided\n2\nounces\n(\n4\ntablespoons\n)\nfresh juice\nfrom\n2\nwhole\nlemons\nDirections\nDivide plums halves into two equal portions. In a non-reactive mixing bowl, mix first group of plum halves with 1 pound 4 ounces of sugar. Cut the remaining plum halves in half to make quarters. In a separate bowl, mix plum quarters with remaining 12 ounces sugar. Cover both bowls tightly and let stand at room temperature overnight.\nIn a large pot, scrape plum halves along with any sugar and syrup and cook over medium heat, stirring only enough to prevent scorching, until softened, about 15 minutes. Pass plum halves through a food mill fitted with the smallest-hole plate; scrape any plum left on the mill into the plum puree. Mix plum puree into quartered plums and stir in lemon juice.\nThoroughly wash 12 half-pint canning jars and their lids. If you plan to process the jam for shelf-stable storage, prepare a water bath and sterilize the jars as described in our\ncanning guide\n. Set several metal spoons on a plate in the freezer. Scrape plum mixture into a wide jamming pot.\nHeat plum mixture over medium-high heat, stirring as needed to prevent scorching, until jam starts to foam, about 15 minutes. Continue to cook, stirring minimally and lowering the heat if necessary to prevent scorching, until foaming has subsided, about 15 minutes longer; scrape any foam off jam surface with a stainless steel spoon as needed. Continue to cook after foaming has subsided until bubbling has slowed and jam looks glossy, 5 to 15 minutes; lower heat as necessary to prevent scorching.\nWhen plum quarters have broken down and jam has thickened, begin testing for doneness: Turn off heat and set a small spoonful of jam in the freezer for 5 minutes. Jam is ready once it holds together and doesn't run off the spoon when tilted. If jam is too runny, return to heat and cook, stirring frequently and repeating the spoon test every 5 minutes, until jam passes test.\nTransfer jam into prepared canning jars and wipe any jam from the rims. To store in refrigerator, simply place lids on jars, screw on rings, and let cool completely at room temperature before refrigerating. To process jam for shelf-stable storage, bring water bath to a rolling boil. Place lids on jars and screw on rings until they are snug but not overly tight. Carefully lower jars into boiling water bath and process for 10 minutes. Remove jars and let cool completely at room temperature. Unprocessed jam can be refrigerated for a couple of months; Processed jam can be stored in a cool, dark place for up to 1 year.\nSpecial Equipment\nKitchen scale\n, large wide-bottomed pot,\nfood mill\n,\nrubber spatula\n, 2\nmixing bowls\nThis Recipe Appears In\nJam Making 101: The Tools and Techniques for Success\nJams & Jellies\nPlum"
}