{
  "url": "https://www.seriouseats.com/red-wine-duck-jus-recipe",
  "image_url": "https://www.seriouseats.com/thmb/AMsIHfR-AKXYt6riYIMZZJY7w-g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200116-duck-jus-vicky-wasik18-fb6ba00cd5b84f06b4efa2b24245f22c.jpg",
  "tags": [
    "Dipping Sauce",
    "Stovetop",
    "Duck",
    "Fall",
    "Winter"
  ],
  "title": "Rich Red Wine Duck Jus Recipe",
  "full_text": "Rich Red Wine Duck Jus Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n90 mins\nActive\n15 mins\nTotal\n95 mins\nServes\n12 servings\nMakes\n1 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\n(\n2\nL\n)\nbrown duck stock\n, divided\n1/2\nounce\n(\n2 packets\n;\n14 g\n)\npowdered gelatin\n, such as Knox\n1\n(\n750 ml) bottle\ndry red wine\n1 to 2\ntablespoons\n(\n15 to 30\nml\n)\nshio koji\n, blended until smooth (optional, see note)\nKosher salt\nDirections\nPour 1 cup (240ml) of duck stock in small bowl or liquid measuring cup and evenly sprinkle gelatin over surface of stock. Set aside. Transfer remaining stock to 3-quart saucier. Pour wine into separate medium-size saucepan.\nSet saucepans of wine and stock on stovetop and bring each to a boil over high heat, then reduce heat to maintain both at a rapid simmer. Cook, uncovered, until wine is reduced to syrupy consistency that measures about 1/2 cup (120ml) in volume, about 40 minutes.\nAdd reduced wine and gelatin-enriched stock to saucier of simmering stock. Continue to cook, adjusting heat to maintain simmer and occasionally skimming fat and scum from surface of liquid with a ladle, until liquid has darkened in color, thickened to a sauce-like consistency, and reduced to about 1 1/2 cups (355ml), about 50 minutes. For glossy jus with few impurities in it, midway through reducing, strain jus through a fine-mesh strainer into a smaller saucepan and continue to reduce until liquid has achieved proper consistency.\nUsing a spoon, test the consistency of sauce; jus should coat the back of a spoon when dipped in it, and when you drag a finger over the spoon, it should leave a clear path.\nSeason jus with shio koji (if using), adding 1 tablespoon (15ml) at a time and stirring to incorporate into the sauce, until desired flavor is reached. Season with salt (if using shio koji, additional salt may not be needed). Jus can be used right away or cooled and refrigerated in airtight container until ready to use.\nSpecial Equipment\n3-quart stainless steel saucier\n,\nfine-mesh strainer\nNotes\nShio koji adds savory depth, salinity, and subtle sweetness to the jus, but the success of the sauce doesn't hinge on its inclusion. If you don't have any shio koji on hand, you can simply omit it, or substitute an equal volume amount of\nkecap manis\n. The flavor of Indonesian sweet soy sauce is different from that of shio koji but hits on many of the same notes—salty, sweet, slightly funky, and umami.\nMake-Ahead and Storage\nDuck jus can be refrigerated in an airtight container for up to 1 month, or frozen for up to 6 months. To reheat, warm gently in a saucepan over low heat or in a microwave-safe container in the microwave.\nDipping Sauce\nStovetop\nDuck\nFall\nWinter",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rich-red-wine-duck-jus-recipe.webp?"
}