{
  "url": "https://www.seriouseats.com/rhode-island-style-stuffed-quahog-clams-7852619",
  "image_url": "https://www.seriouseats.com/thmb/j2_MvGdpAPJ35M__jiVB3HL27Ps=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230824-SEA-StuffedQuahogs-KevinWhite-22-49f29cbbba8546e1b01748677fe279d8.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Savory",
    "New England",
    "Clams"
  ],
  "title": "Rhode Island–Style Stuffed Quahog Clams (\"Stuffies\")",
  "full_text": "Rhode Island–Style Stuffed Quahog Clams (\"Stuffies\")\nClose\nJump to recipe\nPrep\n10 mins\nCook\n90 mins\nCooling Time\n30 mins\nTotal\n2 hrs 10 mins\nServes\n6\nto 8\nMakes\n12 each\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nhigh-quality white sandwich bread or soft Italian or\nFrench bread\n(\n450\ng\n; about\n1\nloaf\n), cut into 3/4-inch dice (about\n2 1/2\nquarts\n) (see notes)\n12\nquahog\nclams\n(about\n8\npounds\n;\n3.6\nkg\n), purged and scrubbed (see notes)\n1\nstick\nunsalted butter\n(\n4\nounces\n;\n113\ng\n)\n1/2\ncup\nfinely diced\nyellow onion\n(\n4\nounces\n;\n113\ng\n), from\n1/2\nmedium\nyellow onion\n1/2\ncup\nfinely diced\ngreen bell pepper\n(\n4\nounces\n;\n113\ng\n), from\n1/2\nmedium\ngreen bell pepper\n3\nounces\nPortuguese-style chouriço or Spanish-style\nchorizo\n, casing removed and finely diced\n2\nmedium\ngarlic cloves\n, minced\n1/2\nteaspoon\nsweet Spanish\npaprika\n, optional (see notes)\n1/2\nteaspoon\nminced fresh\nthyme\nor\n1/4\nteaspoon\ndried thyme\n2\ntablespoons\nminced flat-leaf\nparsley\nleaves and tender stems\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice\n, plus lemon wedges for serving\nDirections\nAdjust oven rack to middle position. Heat oven to 275°F (130°C). On a rimmed baking sheet, spread bread in a single even layer and bake, rotating sheet and stirring bread cubes several times during baking, until bread is completely dried, 30 to 40 minutes. Remove from oven, let cool, then transfer to a large bowl; set aside. Increase oven temperature to 400°F (200°C).\nSerious Eats / Kevin White\nIn a large Dutch oven, bring 3 cups (710ml) water (should measure about 1-inch deep) to a boil. Add clams and cook, covered, stirring occasionally, until clams open, 8 to 12 minutes. Using a slotted spoon, remove clams from water as they open and transfer to a rimmed baking sheet to cool.\nSerious Eats / Kevin White\nMeasure 2 cups (475ml) of the clam cooking liquid and set aside. Reserve remaining clam broth for another use or discard (see notes). Wipe Dutch oven clean with a paper towel.\nSerious Eats / Kevin White\nWorking with one clam at a time, use a paring knife to carefully separate the clam meat from the shell. Transfer clam to cutting board. Separate the now-empty top shell from the bottom shell at the hinge. Discard the top shell and rinse the bottom shell under water to remove any shell fragments. Transfer the cleaned bottom shell to a rimmed baking sheet. Repeat with remaining clams. Finely chop the clam meat into roughly 1/8- to 1/4-inch pieces; set aside.\nSerious Eats / Kevin White\nIn the now-cleaned Dutch oven, melt butter over medium-high heat just until foaming subsides (do not allow butter to brown), about 2 minutes. Add onion, bell pepper, and chouriço, and cook, stirring frequently, until vegetables are softened and chouriço begins to crisp and render its fat, 7 to 10 minutes. Add garlic, paprika (if using), and thyme and cook until fragrant, about 30 seconds.\nSerious Eats / Kevin White\nOff heat, stir in 1 1/2 cups (355ml) of reserved clam broth, minced clams, lemon juice, and parsley. Let cool slightly, about 10 minutes.\nSerious Eats / Kevin White\nPour clam mixture into the bowl with bread croutons and stir until well combined. Squeeze bread between your fingers or mash with a spoon until a homogenous mixture is formed, no dry spots remain, and about half of bread pieces are broken down to a coarse paste-like consistency. If mixture is too dry, add remaining 1/2 cup (120ml) broth, 1 tablespoon at a time, as needed. Mixture should be moist but not wet. You should have about 4 cups of filling.\nSerious Eats / Kevin White\nDivide stuffing among reserved cleaned clam shells (about 1/3 cup each). Bake until stuffing is heated through and golden brown, 15 to 20 minutes. Serve with lemon wedges.\nSerious Eats / Kevin White\nSpecial Equipment\nLarge Dutch oven\nNotes\nStale bread may be substituted for fresh. Use 1 1/2 quarts stale bread and skip step 1.\nQuahog clams are large hard-shell clams. They are sometimes sold as “chowder clams.”\nTo purge clams, submerge them in a large container of salted cold water (about 3% salinity) and let stand for 30 minutes. Lift out clams. If there is no sand in the bottom of the container, they're ready to scrub and use. If there is sand, drain and rinse the container, fill with fresh salted water, and return clams for 30 more minutes. Continue this process until the water is clear and free of sand.\nIf you want to avoid steaming the clams and cleaning the clam shells in this recipe, a good fish monger will sell you chopped raw quahog clam meat, and already cleaned shells to make stuffies at home, just call in advance and ask. If you choose to go this route, skip steps 2 through 4 in the recipe. Add 2 cups of raw clam meat with the onion mixture to saute and cook through. Substitute bottled clam juice in place for the clam cooking broth.\nUnused clam broth can be cooled down and refrigerated for up to 3 days or frozen for up to 2 months.\nThe amount of seasoning and paprika in chouriço can vary greatly. If you are using a deep rich red chouriço that has a strong paprika aroma, you might not want to use the additional paprika in the recipe.\nMake-Ahead and Storage\nThe clam shells filled with stuffing can be covered and refrigerated, prior to baking, for up to 2 days or wrapped tightly in plastic wrap and frozen for up to 1 month. Thaw in the refrigerator overnight before baking.\nSnacks & Appetizers\nThe Latest\nSavory\nNew England\nClams",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rhode-islandstyle-stuffed-quahog-clams-stuffies.webp?"
}