{
  "url": "https://www.seriouseats.com/ribollita-tuscan-italian-vegetable-soup-stew-recipe",
  "image_url": "https://www.seriouseats.com/thmb/mTQiMO58KndbrY6LfRq3r7fTHuw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__02__20160201-ribolita-vicky-wasik-019-7cdf1e0e7e5744aaa96b1c8af644d51c.jpg",
  "tags": [
    "Italian",
    "Dairy-free",
    "Vegan Mains",
    "Vegetarian Mains",
    "Braised & Stewed Beans"
  ],
  "title": "Ribollita (Hearty Tuscan Bean, Bread, and Vegetable Stew) Recipe",
  "full_text": "Ribollita (Hearty Tuscan Bean, Bread, and Vegetable Stew) Recipe\nClose\nJump to recipe\nCook\n50 mins\nActive\n60 mins\nTotal\n50 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n3\nmedium\ncloves garlic\n, thinly sliced (see note)\n1\nmedium\nred onion\n, diced (about\n7\nounces\n;\n200\ng\n)\n1\nlarge\nleek\n, white and light green parts only, diced (about\n13\nounces\n;\n370\ng\n)\n4\nlarge\ncarrots\n, peeled and diced (about\n1 1/4\npounds\n;\n525\ng\n)\n2 1/2\ncups\npeeled, seeded, and\ndiced butternut squash\n(about\n1/2\nof a\nmedium\nsquash\n) (about\n12\nounces\n;\n360\ng\n)\n1\nturnip\n, peeled and diced (about\n8\nounces\n;\n240\ng\n)\n3\nlarge\ncelery\nstalks\n, diced (about\n8\nounces\n;\n240\ng\n)\nWater\n1\nbunch\nlacinato kale\n, stemmed, leaves roughly chopped (about\n6\nounces\n;\n170\ng\n) (see note)\n1\nbouquet garni\n(herb bundle made from a few sprigs each of mixed herbs, such as parsley, oregano, thyme, rosemary, and bay leaf)\n2\ncups\ncooked beans\n, such as\ncannellini\n, navy, or cranberry, plus\n1\ncup\nbean-cooking liquid\nor water (if using canned beans) (see note)\n1/4\npound\n(\n110\ng\n) fresh or stale\nrustic crusty bread\n, cut into 1-inch cubes\nKosher salt\nand freshly ground black pepper\nGrated Parmigiano Reggiano\n, for serving (optional)\nDirections\nIn a large Dutch oven or soup pot, heat olive oil over medium heat with garlic. Cook, stirring, until garlic is fragrant and very lightly golden. Add onion, leek, carrots, squash, turnip, and celery and cook, stirring, until slightly softened but not browned, about 5 minutes.\nSerious Eats / Vicky Wasik\nAdd enough water to slightly cover vegetables (about 6 cups; 1.5L) along with kale and bouquet garnis and bring to a simmer over medium-high heat. Lower heat to maintain simmer and cook until vegetables are very tender, about 25 minutes.\nStir in beans and their cooking liquid (or 1 cup water if using canned beans). Add bread, stir well, and simmer until bread is very soft and breaking down, about 15 minutes. Add water, 1/2 cup at a time, if soup becomes too thick and dry.\nSerious Eats / Vicky Wasik\nSeason with salt and pepper. The soup can be served at varying consistencies: more wet and broth-y, like a thick, chunky soup, or cooked down until thickened like a porridge. Once reduced to a thick porridge, you can ladle some of it into a small (8-inch) nonstick skillet with 1 tablespoon oil and cook over medium-high heat, stirring frequently, until it coalesces into a dense mass; it will eventually take the shape of a pancake. (If your flipping skills are good, you can flip it to serve it browned side up.) Slide it onto a plate. To serve at any consistency, drizzle with fresh olive oil and top with freshly ground black pepper and grated cheese (optional).\nNotes\nFeel free to alter the vegetables according to personal taste or season. I recommend leaving in at least the onion (or leek), garlic, carrots, and celery.\nLacinato kale is also sold as dinosaur kale, cavolo nero, and black kale.\nYou can use canned or cooked-from-dried beans here, though dried ones will be even more delicious (especially if you cook them with aromatics, like onion, garlic, and herbs, in the water). Two 15-ounce (425g) cans of beans will yield slightly more than the 2 cups needed here. Roughly 1/3 pound (150g) of dried beans will yield about 2 1/2 cups cooked.\nRead More\nTuscan Ribollita With Summer Vegetables\nThe Best Minestrone Soup\nPasta e Fagioli (Italian Bean and Pasta Soup)\nAçorda à Alentejana (Portuguese Garlic and Cilantro Bread Soup)\nItalian\nDairy-free\nVegan Mains\nVegetarian Mains\nBraised & Stewed Beans"
}