{
  "url": "https://www.seriouseats.com/rice-krispie-treats-recipe-7107746",
  "image_url": "https://www.seriouseats.com/thmb/pf-uNo0o4oTboy18fdFNUCpt5_A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230209-RiceKrispieTreats-AmandaSuarez-hero-b51c6fbd26d14242a4022e5806cde9b4.JPG",
  "tags": [
    "Dessert Bars",
    "The Latest",
    "Baking",
    "Rice & Grain Mains"
  ],
  "title": "Rice Krispie Treats",
  "full_text": "Rice Krispie Treats\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nCooling Time\n35 mins\nTotal\n65 mins\nServes\n9\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ncups\n(\n165\ng\n)\nRice Krispies\nNonstick cooking spray\n, for greasing\n4\ntablespoons\n(\n56\ng\n)\nunsalted butter\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\n(\n12-ounce) bag\nmarshmallows\n, any size\nFlaky salt\n, such as Maldon, to garnish\nDirections\nAdjust oven racks to the second-from-top and second-from-bottom positions. Preheat oven to 325ºF (160ºC). Line 2 rimmed baking sheets with parchment (this will make it easier to transfer the rice krispies into a bowl after) and divide Rice Krispies evenly between the 2 sheets. Toast in the oven, stirring with a silicone spatula every 3 minutes, until evenly golden brown, about 10 minutes. Remove from oven and let cool 5 minutes. Lift up both the shorter sides of the parchment to form a “sleeve” to gather all the Rice Krispies, then transfer cereal to a large bowl. Set aside.\nSerious Eats / Amanda Suarez\nMeanwhile, line a 2-quart baking dish (see note) with parchment overhanging two sides and coat evenly with nonstick cooking spray. Set aside.\nIn a 6-quart pot, melt 4 tablespoons unsalted butter over medium heat, then cook, stirring and swirling, until milk solids turn golden brown and the butter smells nutty, 3 to 4 minutes. Reduce heat to low. Add salt and marshmallows, then, using a silicone spatula, stir until the marshmallows have just melted, about 4 minutes. Add toasted Rice Krispies and fold until evenly coated.\nSerious Eats / Amanda Suarez\nScrape Rice Krispies mixture into prepared baking dish. Spray another spatula with nonstick cooking spray, then use it to press the mixture into an even layer.\nSerious Eats / Amanda Suarez\nSprinkle all over with flaky salt. Allow bars to cool for 30 minutes before portioning.\nSerious Eats / Amanda Suarez\nTo portion, remove bars from the baking dish and place on a cutting board. Using a serrated knife, cut bars into squares, rectangles, or your desired shape.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n2 rimmed baking sheets; parchment paper; 2-quart baking dish (see note), or 9- by 9-inch baking dish\nNotes\nTo make these Rice Krispie treats vegetarian, substitute the regular marshmallows with a vegetarian-friendly alternative.\nVarious dimensions of baking dish will work as long as the baking dish has a roughly 2-quart volume.\nMake-Ahead and Storage\nThe bars can be kept in an airtight container at room temperature for up to 1 week, but are best enjoyed within 5 days.\nDessert Bars\nThe Latest\nBaking\nRice & Grain Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rice-krispie-treats.webp?"
}