{
  "url": "https://www.seriouseats.com/rice-pilaf-recipe-5509610",
  "image_url": "https://www.seriouseats.com/thmb/AU4Bdzo8AfRMoNGuZ8tA7PsSTsU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220627-RICEPILAF-ANDREWJANJIGIAN-Hero-850fb3b67ef84859a1cb8bc687e6e198.JPG",
  "tags": [
    "White Rice",
    "Armenian",
    "The Latest"
  ],
  "title": "Armenian-Style Rice Pilaf",
  "full_text": "Armenian-Style Rice Pilaf\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nSoaking and Resting Time\n20 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n185\ng\n)\nlong-grain white rice\n3\ntablespoons\n(\n42\ng\n)\nunsalted butter\n3/4\ncup\n(\n2\nounces\n;\n57\ng\n)\nthin pasta\n(such as vermicelli or fine spaghetti), broken into 1-inch pieces, or 1/2 cup of small, non-tubular pasta, like orzo\n2\ncups\n(\n480\nml\n) homemade or store-bought\nlow-sodium chicken stock\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; if using table salt use half as much by volume or same weight\n1/2\nteaspoon\nblack pepper\n1\ntablespoon minced\nfresh parsley\nor dill (or a combination), optional, divided\nDirections\nPlace rice in a medium bowl and rinse with hot tap water until water runs clear, about 30 seconds. Cover rice completely with fresh hot tap water and set aside for 10 minutes. Drain rice thoroughly in a fine-mesh strainer; discard soaking water.\nSerious Eats / Andrew Janjigian\nMelt butter in a 3-quart saucepan over medium heat. Add the pasta and cook, stirring regularly, until evenly golden brown, 4 to 6 minutes. Add rice and cook, stirring occasionally, until edges of rice begin to turn translucent, about 3 minutes. Add stock, salt, and pepper, increase heat to high, and bring to boil. Reduce heat to low, cover, and cook until liquid is absorbed, about 10 minutes.\nSerious Eats / Andrew Janjigian\nRemove pan from heat, remove the lid, cover pot with a folded dish towel, and set lid back in place. Let sit for 10 minutes. Fluff rice with a fork, stir in half of parsley, if using, and transfer to a serving dish. Top with remaining parsley and serve.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nFine-mesh sieve\nNotes\nThe recipe can easily be doubled, if desired.\nFor bulgur pilaf, replace the rice with 1 cup (175g) bulgur, rinsed and drained and skip step 1 entirely. Add the bulgur in place of the rice in step 3, and cook until sizzling stops, about 3 minutes, before adding the remaining ingredients.\nMake-Ahead and Storage\nRice and bulgur pilaf can be refrigerated in a sealed container for up to 3 days.\nWhite Rice\nArmenian\nThe Latest"
}