{
  "url": "https://www.seriouseats.com/rice-cooker-oatmeal-8766231",
  "image_url": "https://www.seriouseats.com/thmb/Aco6vi8zHqJJAGIdL2mQiT8QUQs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/120103-SEA-RiceCookerOatmeal-AmandaSuarez-Hero-9bc2e2e7b6f14d11875b3ff0278f18dd.jpg",
  "tags": [
    "Oatmeal",
    "The Latest",
    "Breakfast & Brunch"
  ],
  "title": "Make-Ahead Rice Cooker Oatmeal",
  "full_text": "Make-Ahead Rice Cooker Oatmeal\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nTotal\n50 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 cup (\n180\ng\n)\nsteel-cut oats\n3\ncups\n(710ml)\nwater\n(see notes)\nPinch\nkosher salt\nToppings\n, as desired\nDirections\nIn a rice cooker, combine oats, water, and salt. Close cooker and set to porridge mode (or the most appropriate mode for your cooker; consult manufacturer's directions). If a timer function is available on your cooker, you can use it to set when you want your oatmeal ready (for example, you can fill the cooker the night before and specify that you want it ready at 7am; the cooker will turn on early enough to ensure it's ready when you wake up). If not using a timer function, the cooking time will vary with different rice cooker models, anywhere from about 40 minutes up to 1 hour 30 minutes.\nSerious Eats / Amanda Suarez\nWhen ready, open rice cooker and stir oatmeal to ensure an even consistency throughout. Spoon into bowls and top as desired, then serve right away.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRice cooker\nNotes\nThe ratio of 3 cups of water for every 1 cup of steel-cut oats produces a thick but not stiff porridge, which I like. You may need to adjust the ratio of oats to water if your preferences are different from mine, or if your cooker produces slightly different results. Once you figure out the perfect ratio for your tastes and cooker, you'll be good to go.\nIt may be tempting to use milk instead of water; just beware that it's not safe to leave milk sitting in a rice cooker at room temperature overnight if you're planning to use the timer function. Milk also runs a higher risk of scorching as the sealed cooker heats, since you're not able to stir.\nMake Ahead and Storage\nLeftover cooked oatmeal can be stored in an airtight container in the refrigerator for up to 4 days or frozen for up to 3 months. For best results, freeze and thaw in individual portions and thaw overnight in the fridge.\nOatmeal\nThe Latest\nBreakfast & Brunch"
}