{
  "url": "https://www.seriouseats.com/rich-and-creamy-mashed-potatoes-recipe",
  "image_url": null,
  "tags": [
    "Vegetable Sides",
    "Gluten-free Sides",
    "Vegetarian Sides",
    "Stovetop Vegetables",
    "Yukon Gold Potatoes"
  ],
  "title": "Pommes Purée (Rich and Creamy Mashed Potatoes) Recipe",
  "full_text": "Pommes Purée (Rich and Creamy Mashed Potatoes) Recipe\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\n20 mins\nCooling Time\n5 mins\nTotal\n50 mins\nServes\n4\nto 5 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n) skin-on\nYukon Gold potatoes\n, scrubbed\n8\ntablespoons\nunsalted butter\n(\n1\nstick\n;\n115\ng\n), cut into 1-tablespoon pieces\n1 1/2\ncups\n(\n355\nml\n)\nheavy cream\n, plus more as needed\nUp to\n1/2\ncup\n(\n120\nml\n)\nhomemade\nchicken stock or\nlow-sodium broth\n(optional)\nKosher salt\nand freshly ground black pepper\nDirections\nIn a large pot, cover potatoes with cold water. Bring to a boil over high heat, then reduce to a simmer. Cook until potatoes are tender and offer no resistance when poked with a paring knife. Drain and let stand until cool enough to handle.\nCarefully peel potatoes, transferring potatoes to a large bowl as you peel them.\nPass potatoes through a ricer or food mill set over the now-empty pot or, optionally, the bowl of a stand mixer fitted with a paddle attachment. (For the absolute smoothest texture, work the potatoes through a drum sieve before proceeding; this is entirely optional and not required unless you're in a very fancy French restaurant kitchen.)\nIf using the stand mixer, whip on low speed for 30 seconds, then increase speed to high and whip until smooth, about 30 seconds longer; transfer whipped potatoes to now-empty pot and add butter, cream, and a generous sprinkling of salt. If skipping the stand mixer step, add butter to potatoes in pot along with the cream and salt.\nBring cream to a simmer, allowing butter to fully melt. Fold in hot cream and melted butter, stirring well to incorporate. Season to taste with salt and pepper. For even creamier potatoes, or for more savory ones, add additional cream or the optional chicken stock, pouring it around the mass of potatoes and bringing to a simmer before folding in. Keep warm until ready to serve.\nSpecial Equipment\nRicer or food mill;\nstand mixer with paddle attachment\n(optional)\nNotes\nThis recipe can be doubled to serve a larger crowd.\nVegetable Sides\nGluten-free Sides\nVegetarian Sides\nStovetop Vegetables\nYukon Gold Potatoes"
}