{
  "url": "https://www.seriouseats.com/rich-and-creamy-tonkotsu-ramen-broth-from-scratch-recipe",
  "image_url": "https://www.seriouseats.com/thmb/IBikLAGkkP2QVaF3vLIk_LeNqHM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/rich-and-creamy-tonkotsu-ramen-broth-from-scratch-recipe-Diana-Chistruga-hero-6d318fadcca64cc9ac3e1c40fc7682fb.JPG",
  "tags": [
    "Ramen",
    "Japanese",
    "Stovetop",
    "Pork",
    "Soups"
  ],
  "title": "Rich and Creamy Tonkotsu Ramen Broth",
  "full_text": "Rich and Creamy Tonkotsu Ramen Broth\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 hrs 40 mins\nActive\n2 hrs\nTotal\n10 hrs 50 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\npig trotters\n, split lengthwise or cut crosswise into 1-inch disks (ask your butcher to do this for you)\n2\npounds\nchicken backs and carcasses\n, skin and excess fat removed\n2\ntablespoons\nvegetable oil\n1\nlarge\nonion\n, skin on, roughly chopped\n12\ngarlic\ncloves\n1 (\n3-\ninch)\nknob\nginger\n, roughly chopped\n2\nwhole\nleeks\n, washed and roughly chopped\n2\ndozen\nscallions\n, white parts only (reserve greens and light green parts for garnishing finished soup)\n6\nounces\nwhole mushrooms\nor\nmushroom scraps\n, such as cremini\n1\npound\nslab pork fat back\nDirections\nPlace pork and chicken bones in a large stockpot and cover with cold water. Place on a burner over high heat and bring to a boil. Remove from heat as soon as boil it starts to boil.\nSerious Eats / Diana Chistruga\nWhile pot is heating, heat vegetable oil in a medium cast iron or non-stick skillet over high heat until lightly smoking. Add onion, garlic, and ginger. Cook, tossing occasionally until deeply charred on most sides, about 15 minutes total. Set aside.\nSerious Eats / Diana Chistruga\nOnce pot has come to a boil, dump water down the drain. Carefully wash all bones under cold running water, removing any bits of dark marrow or coagulated blood. Bones should be uniform grey/white after you've scrubbed them. Use a chopstick to help remove small bits of dark marrow from inside the trotters or near the chicken's spines.\nSerious Eats / Diana Chistruga\nReturn bones to pot along with charred vegetables, leeks, scallion whites, mushrooms, and pork fatback. Top up with cold water. Bring to a rolling boil over high heat, skimming off any scum that appears. (This should stop appearing within the first 20 minutes or so.) Use a clean sponge or moist paper towels to wipe any black or gray scum off from around the rim of the pot. Reduce heat to a bare simmer and place a heavy lid on top.\nSerious Eats / Diana Chistruga\nOnce the lid is on, check the pot after 15 minutes. It should be at a slow rolling boil. If not, increase or decrease heat slightly to adjust boiling speed. Boil broth until pork fatback is completely tender, about 4 hours. Carefully remove pork fat with a slotted spatula. Transfer fatback to a sealed container and refrigerate until step 7. Return lid to pot and continue cooking until broth is opaque with the texture of light cream, about 6 to 8 hours longer, topping up as necessary to keep bones submerged at all times. If you must leave the pot unattended for an extended period of time, top up the pot and reduce the heat to the lowest setting while you are gone. Return to a boil when you come back and continue cooking, topping up with more water as necessary.\nSerious Eats / Diana Chistruga\nOnce broth is ready, cook over high heat until reduced to around 3 quarts. Strain through a fine-mesh strainer into a clean pot. Discard solids. For an even cleaner soup, strain again through a fine-mesh strainer lined with several layers of cheesecloth. Skim liquid fat from top with a ladle and discard.\nSerious Eats / Diana Chistruga\nFinely chop cooked pork fatback and whisk into finished broth. To serve, season broth with condiments of your choice (salt, soy sauce, miso, sesame paste, grated fresh garlic, chili oil or a mixture of all, for instance) and serve with cooked ramen noodles and toppings as desired.\nSerious Eats / Diana Chistruga\nSpecial Equipment\nLarge stockpot with a heavy, tight-fitting lid\n,\nfine-mesh strainer\nNotes\nWhile this dish can be made with any type of fresh mushroom and is an excellent way to use up mushroom scraps, fresh cremini mushrooms will produce more flavor than some other varieties, and at a nice price point.\nRead More\nThe Food Lab Redux: How to Make the Perfect Bowl of Tonkotsu Ramen\nGuide to Ramen Varieties\nPressure Cooker Chintan Shoyu Ramen\nUltimate Vegan Ramen With Miso Broth\nRamen\nJapanese\nStovetop\nPork\nSoups"
}