{
  "url": "https://www.seriouseats.com/rich-and-frothy-holiday-eggnog-with-an-electric-mixer-or-stand-mixer",
  "image_url": null,
  "tags": [
    "Rum",
    "Eggs",
    "Brandy & Cognac"
  ],
  "title": "Classic Eggnog Recipe",
  "full_text": "Classic Eggnog Recipe\nJump to recipe\nPrep\n10 mins\nActive\n10 mins\nTotal\n10 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\neggs\n, separated\n2/3\ncup\nsugar\n(\n5\nounces\n;\n140\ng\n), divided\n3\ncups\n(\n700\nml\n)\nwhole milk\n2\ncups\n(\n475\nml\n)\nheavy cream\n2\ncups\n(\n475\nml\n) dark rum,\nbrandy\n, or a mix\nFreshly grated nutmeg\n, to garnish\nDirections\nFor Basic Shaken Eggnog:\nIn a cocktail shaker, combine 2 eggs, 2 1/2 tablespoons (37g) sugar, 3/4 cup (180ml) milk, 1/2 cup (120ml) cream, and 1/2 cup (120ml) rum, brandy, or a mix of the two. Shake vigorously until homogeneous and frothy. Strain into 3 to 4 goblets and top with freshly grated nutmeg. Repeat process with remaining ingredients for further batches.\nSerious Eats / Jen Causey\nFor Extra-Light and Foamy Eggnog:\nPlace egg whites in the bowl of a stand mixer and whisk on low speed until frothy, about 30 seconds. (Alternatively, use a handheld electric mixer or hand blender in a large bowl.) Increase speed to medium-high and, watching carefully, beat until egg whites are about the consistency of shaving cream, about 90 seconds. Reduce speed to medium. With mixer running, add half of sugar and beat until incorporated, about 30 seconds. Transfer whites to a large bowl. Do not wash mixer bowl.\nSerious Eats / Jen Causey\nAdd egg yolks and remaining sugar to now-empty mixer bowl and beat at medium-high speed until pale yellow and ribbony, shutting off machine and scraping down sides with a rubber spatula as necessary, about 2 minutes total. Add milk, cream, and alcohol and mix on low speed to combine.\nSerious Eats / Jen Causey\nUsing a rubber spatula or handheld whisk, fold whipped whites into egg yolk/milk mixture until completely incorporated. Serve by ladling into goblets and garnishing with grated nutmeg.\nSerious Eats / Jen Causey\nNotes\nEggnog can also be aged in the refrigerator indefinitely. Transfer to a sealed container and place in the refrigerator. It will gain complexity with time, though it may also get harsher. Blend aged eggnog with fresh eggnog to tame the harsh edge while retaining the complexity.\nSpecial Equipment\nCocktail shaker\n,\nstand mixer\nRead More\nNutella Eggnog\nToasted Coconut Eggnog\nMaple Bourbon Eggnog\nToffee Eggnog\nRum\nEggs\nBrandy & Cognac"
}