{
  "url": "https://www.seriouseats.com/ricotta-gnocchi-homemade-food-lab-recipe",
  "image_url": null,
  "tags": [
    "Ricotta"
  ],
  "title": "Quick and Easy Homemade Ricotta Gnocchi Recipe",
  "full_text": "Quick and Easy Homemade Ricotta Gnocchi Recipe\nJump to recipe\nPrep\n25 mins\nCook\n15 mins\nActive\n30 mins\nFreezing Time\n30 mins\nTotal\n70 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\nbest quality\nricotta cheese\n(about\n1 1/2\ncups\n, see notes)\n1\nounce\nfinely grated Parmesan cheese\n(about\n1/2\ncup\n), plus more for serving\n4 to 6\nounces\nall-purpose flour\n(about\n1\ncup\n)\n1\nwhole\nlarge egg\n1\nlarge\negg yolk\nKosher salt\nand freshly ground black pepper\nSemolina flour\n, for dusting\n2\ncups\nyour favorite\nmarinara sauce\n, such as\nslow-cooked red sauce\nExtra-virgin olive oil\nMinced fresh herbs\nsuch as basil, parsley, or chives\nDirections\nLine a large plate with three layers of paper towels or a clean dish towel. Transfer ricotta directly to paper towels and spread with a rubber spatula. Place another triple layer of paper towels or a clean dish towel on top and press down firmly with the palms of your hands to blot excess moisture. Peel off upper paper towels.\nSpreading the ricotta on paper towels and then blotting it removes excess moisture. Here, the left side shows the ricotta before it's been drained and blotted, and the right side shows the texture of the ricotta after the excess moisture has been removed.\nSerious Eats / Mateja Zvirotic Andrijanic\nPlace a large bowl on a scale and zero the scale. Scrape ricotta into bowl to weigh. Remove excess ricotta to leave exactly 8 ounces. Reserve excess ricotta for another use. Add Parmesan, 3 1/2 ounces of flour, whole egg, and egg yolk to bowl. Season with salt and pepper. Combine mixture with a rubber spatula. It should be sticky but not loose. Add flour a tablespoon at a time if it is still very moist after kneading with the spatula for 1 minute.\nSerious Eats / Mateja Zvirotic Andrijanic\nTransfer dough to a lightly floured work surface and dust the top with flour. Flatten into a 4- to 6-inch disk and cut into quarters using a bench scraper. Working one piece at a time, roll dough into a log about 6 inches long, dusting with flour as necessary. Split log in half and roll each half into a log about 12 inches long and 3/4-inch wide. You should end up with 8 logs.\nSerious Eats / Mateja Zvirotic Andrijanic\nUsing your bench scraper, cut each log into 8 to 10 gnocchi. Transfer to a parchment-lined baking sheet dusted in semolina flour. Shake to lightly coat gnocchi and prevent sticking. At this point, gnocchi can be frozen. Transfer baking sheet to freezer until gnocchi are completely frozen, about 30 minutes. Transfer gnocchi to a zipper-lock freezer bag and freeze for up to 2 months. Cook directly from frozen, adding a few minutes to cooking time.\nSerious Eats / Mateja Zvirotic Andrijanic\nTo cook, bring a large pot of salted water to a boil. Heat sauce in a separate saucepan until hot but not simmering. Add gnocchi to pot, stir gently, and cook until gnocchi float for 30 seconds, about 3 minutes total. Drain gnocchi, reserving 1/2 cup of pasta cooking water. Add gnocchi and 1/4 cup of cooking water to pot with sauce and bring to a hard boil, stirring gently. Add more pasta water to thin sauce to desired consistency. Season to taste with salt and pepper.\nSerious Eats / Mateja Zvirotic Andrijanic\nStir in a big drizzle of olive oil and a handful of chopped fresh herbs. Transfer to a large serving plate. Sprinkle with more herbs and Parmesan cheese. Drizzle with more olive oil. Serve immediately.\nSerious Eats / Mateja Zvirotic Andrijanic\nSpecial Equipment\nKitchen scale\n,\nbench scraper\nNotes\nMass market ricotta cheese not only has a terrible taste and texture, it's also loaded with stabilizers that make it a poor match for this recipe. For good results here, you must seek out a better quality ricotta, such as Calabro.\nRicotta"
}