{
  "url": "https://www.seriouseats.com/rigatoni-pesce-spada-sicilian-swordfish-eggplant-tomato-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Pwerys3XxNH2hUGOwd1dmVoQQ3U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__07__20180702-rigatoni-swordfish-vicky-wasik-14-bfd3a6f17b494c9b8fccb16cc9f5b6bb.jpg",
  "tags": [
    "Italian",
    "Stovetop Pasta",
    "Pastas",
    "Swordfish",
    "Eggplant"
  ],
  "title": "Rigatoni Con Pesce Spada (Pasta With Swordfish, Tomato, and Eggplant)",
  "full_text": "Rigatoni Con Pesce Spada (Pasta With Swordfish, Tomato, and Eggplant)\nClose\nJump to recipe\nCook\n35 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, plus more as needed\n1/2\npound\n(\n225\ng\n)\neggplant\n(about two-thirds of a large eggplant), cut into 1/2-inch dice (see note)\n1\nmedium\nclove garlic\n, gently crushed under the flat side of a knife\n3/4\npound\n(\n340\ng\n)\nswordfish\n, skin removed, flesh cut into 1/2-inch pieces\n1/2\npound\n(\n225\ng\n)\nrigatoni\nor spaghetti\n8\nounces\n(\n225\ng\n) ripe\ncherry\nor other small\ntomatoes\n, cut into 1/2-inch pieces\n1/4\ncup\n(\n60\nml\n)\ndry white wine\n1\nteaspoon minced\nfresh\nmint and/or\noregano leaves\nDirections\nFill a small pot with salted water and bring to a boil.\nIn a large skillet, heat olive oil over medium-high heat until shimmering. Add eggplant and cook, stirring, until golden and tender, about 5 minutes. Using a slotted spoon, transfer eggplant to paper towels to drain.\nSerious Eats / Vicky Wasik\nAdd garlic to skillet, lower heat to medium-low, and cook, turning occasionally, until lightly golden, about 4 minutes. Using slotted spoon, remove and discard garlic.\nIncrease heat to medium-high and add swordfish. Cook, stirring, until fish is opaque and just starting to brown lightly, about 2 minutes.\nMeanwhile, add pasta to boiling water and cook until al dente, according to manufacturer's recommended timing.\nAdd tomatoes and white wine to skillet and cook until wine has reduced slightly and its raw-alcohol smell is mostly gone, about 2 minutes. Use a\nwooden spoon\nto break up the swordfish slightly. Stir in herbs and season sauce with salt.\nReturn cooked eggplant to skillet. When pasta is cooked, transfer to skillet as well, along with about 1/4 cup (60ml) pasta-cooking water. Cook, stirring, until sauce has reduced to a silky glaze.\nDrizzle a generous dose of olive oil all over pasta, toss to combine, then transfer to bowls or plates and serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge skillet, slotted spoon\nNotes\nThere's no need to pre-salt the eggplant if you're using in-season specimens that are young and have small seeds. Older eggplants with lots of big seeds can benefit from pre-salting. (To pre-salt, sprinkle salt all over the diced eggplant and let it drain for 15 to 30 minutes in a colander set over a bowl.)\nItalian\nStovetop Pasta\nPastas\nSwordfish\nEggplant",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rigatoni-con-pesce-spada-pasta-with-swordfish-tomato-and-eggplant.webp?"
}