{
  "url": "https://www.seriouseats.com/risotto-con-i-gamberi-risotto-with-shrimp-5212626",
  "image_url": "https://www.seriouseats.com/thmb/XOhbKrn5Om43uENd5hZj_iJiKyc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-risotto-shrimp-vicky-wasik-45-b01ad9630c6b4291901316bee83bf043.jpg",
  "tags": [
    "Christmas",
    "Italian",
    "The Latest"
  ],
  "title": "Risotto ai Gamberi (Shrimp Risotto)",
  "full_text": "Risotto ai Gamberi (Shrimp Risotto)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nTotal\n65 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n455\ng\n) medium to large head-on\nshrimp\n(see note)\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, divided\n1\nmedium\n(\n8-ounce\n;\n225 g\n)\nyellow onion\n, half cut into large dice, half finely chopped, divided\n2\nmedium\ngarlic cloves\n, crushed\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n2\nsprigs\nfresh parsley\nplus\n1\npacked cup\n(\n15\ng\n)\nleaves\nand\ntender stems\n, finely chopped, divided\n3/4\ncup\n(\n180\nml\n) dry\nwhite wine\n, divided\n7\ncups\n(\n1.5\nL\n)\nwater\nKosher salt\n2\ncups\n(\n400\ng\n) short grain\nrisotto rice\n, such as carnaroli or arborio\nPinch\nred pepper flakes\n(optional)\n1\ncup\n(\n240\nml\n)\ntomato passata\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice\nfrom\n1\nlemon\n, plus lemon wedges for serving\nDirections\nPeel and devein shrimp, reserving the shrimp shells; if using head-on shrimp, twist off the heads and reserve with the shells. Using a sharp knife, cut shrimp crosswise into 3/4-inch pieces (3 to 4 pieces per shrimp, depending on size). Transfer to a small bowl and season with 1/2 teaspoon salt. Refrigerate shrimp until it’s time to add them to the risotto.\nVicky Wasik\nIn a medium Dutch oven, heat 2 tablespoons (30ml) olive oil over medium-high heat until shimmering. Add reserved shrimp shells and cook, stirring occasionally with a wooden spoon, until shells turn deep orange and oil is rust-colored and aromatic, about 5 minutes. Optional: If you and your guests aren't put off by people sucking shrimp heads at the dinner table, remove one to two shrimp heads per person (depending on size), and reserve them for garnishing the finished risotto. Just don't get greedy and fish out too many; the heads are the main source of flavor for the shrimp stock.\nVicky Wasik\nAdd diced onion and garlic and continue to cook, stirring occasionally, until onion begins to soften and turn brown around the edges, 3 to 5 minutes. Add tomato paste and parsley sprigs and cook, stirring constantly, until tomato paste turns rust-colored and begins to stick to the bottom of the pot, 30 seconds to 1 minute. Add 1/4 cup (60ml) wine and, using a wooden spoon, scrape up any browned bits from the bottom of the pot.\nVicky Wasik\nAdd water, bring to a boil, then reduce heat to a simmer and cook for 10 minutes. Meanwhile, set a fine-mesh strainer over a large bowl. Strain stock through prepared strainer, pressing on solids to extract as much liquid as possible; discard solids. If you have a 3- or 5-quart saucier or our recommended\npasta pan\n, you will use that to cook the risotto. Otherwise, wipe out the Dutch oven.\nVicky Wasik\nIn a 3- or 5-quart saucier or now-empty Dutch oven, heat remaining 2 tablespoons (30ml) olive oil over medium heat until shimmering. Add remaining finely chopped onion, season lightly with salt, and cook, stirring frequently, until onion is translucent and soft but not browned, 5 to 7 minutes.\nVicky Wasik\nIncrease heat to medium-high, add rice, and continue to cook, stirring constantly, until rice is evenly coated in oil and toasted but not browned, 2 to 3 minutes. Rice should smell nutty and grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center. Add red pepper flakes (if using) and remaining 1/2 cup (120ml) wine. Cook until wine is almost completely evaporated, about 30 seconds.\nVicky Wasik\nAdd tomato passata, 1/2 cup (120ml) of shrimp stock, and season lightly with salt. Cook, stirring constantly with a rubber spatula or wooden spoon, until liquid is mostly absorbed, 1 to 2 minutes. Continue to cook, adding stock in 1/2-cup increments while stirring constantly, until rice is softened on the exterior but still slightly raw and crunchy at the center, 13 to 15 minutes.\nVicky Wasik\nAdd shrimp and another 1/2 cup stock, reduce heat to medium, and continue to cook until shrimp and rice are just cooked through, about 2 minutes. There should be enough liquid in the pot that the rice flows when you stir it. Keep in mind that the risotto will tighten up in the time it takes to plate and serve it, so adjust with more stock as needed to achieve a free-flowing consistency, leaving it looser than you think it should be (you may not need to use all of the stock). Season with salt to taste and stir in lemon juice and chopped parsley. Divide between warmed plates and serve immediately, passing lemon wedges at the table.\nVicky Wasik\nSpecial Equipment\nDutch oven\n; fine-mesh strainer; 3- or 5-quart saucier or\npasta pan\nNotes\nHead-on shrimp make the most flavorful shrimp stock and are well worth seeking out for this recipe. If you’re lucky enough to have access to genuinely fresh or live shrimp, use those (please note that we’re very jealous of you). For everyone else, we\nrecommend purchasing individually quick frozen (IQF) shrimp\n, rather than shrimp that have already been thawed. This is especially important for head-on shrimp, as the heads contain enzymes that can render the shrimp meat mushy; freezing halts this process. Thaw shrimp as close to cooking as possible. High quality, sustainably farmed, frozen head-on shrimp can be purchased online from seafood purveyors such as Wulf’s Fish.\nMake-Ahead and Storage\nShrimp stock can be made in advance and refrigerated in an airtight container for up to 3 days or frozen for up to 1 month. However, because the shrimp themselves should be cooked as soon as possible once thawed (and should never be re-frozen), we don't recommend making the stock more than 1 day in advance. If making the stock in advance, do not cut up and season the shrimp in step 1 until you are ready to start cooking the risotto; instead, arrange the peeled and deveined shrimp in a single layer on a small tray, tightly wrap it with plastic, and refrigerate until ready to use.\nChristmas\nItalian\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/risotto-ai-gamberi-shrimp-risotto.webp?"
}