{
  "url": "https://www.seriouseats.com/roasted-acorn-squash-with-red-onion-recipe-8742158",
  "image_url": "https://www.seriouseats.com/thmb/x8CsyRHp1PhybepZJPKBBf5AAX0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241108-RoastedAcronSquash-AmandaSuarez-1hero-6950b8abeb53469abf968b13db162936.jpg",
  "tags": [
    "Winter Squash",
    "The Latest",
    "Acorn Squash"
  ],
  "title": "Roasted Acorn Squash With Red Onions",
  "full_text": "Roasted Acorn Squash With Red Onions\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nTotal\n60 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nTwo\nacorn squashes (\nabout\n1 1/2\npound;\n680g each), halved lengthwise and seeds scooped out and removed\n1/2 cup (\n120\nml)\nextra-virgin olive oil\n, divided\n2 1/2 teaspoons\n(\n8g\n)\nDiamond Crystal kosher salt\n, divided; for table salt use half as much by volume or the same weight\n3/4\nteaspoon\nfreshly\nground black pepper,\ndivided\n2\nlarge\nred onions\n(12 ounces; 340g each), peeled and halved lengthwise through the root\n1/2\ncup\ndried pitted Medjool or Deglet Noor\ndates,\nminced (3 ounces; 85g; about 5 dates)\n1/3\ncup\n(80ml) fresh\norange juice\nfrom 1 orange\n1 tablespoon\n(15\nml)\nsherry vinegar\n2 teaspoons (\n10\nml)\nhoney\n(see notes)\nPinch\nof\nc\nhile powder\nChopped\nroasted\nand\nsalted pistachios\n, for serving\nDirections\nAdjust oven racks to middle and lowest positions. Place a large rimmed baking sheet on the lowest oven rack. Preheat oven with baking sheet to 475°F (245℃). Line a second large rimmed baking sheet with aluminum foil. Cut each onion half through the root end into 4 (about 1 1/2–inch-thick) wedges. Brush onion wedges all over with 1 tablespoon oil. Arrange wedges, cut side down and evenly spaced, along outer edges of prepared foil-lined baking sheet. Cover baking sheet tightly with aluminum foil. Roast on middle rack for 10 minutes.\nSerious Eats / Amanda Suarez\nWhile onions are roasting, cut each squash half crosswise into four 1 1/2– to 2-inch-thick half-moon wedges; transfer to a large plate. Using a pastry brush, brush squash wedges with 2 tablespoons oil, and sprinkle evenly with 1 teaspoon salt, and 1/2 teaspoon pepper.\nSerious Eats / Amanda Suarez\nAfter onions have roasted for 10 minutes, carefully remove the empty preheated baking sheet from oven. Working quickly, arrange squash wedges on the preheated baking sheet, cut side down and evenly spaced, along outer edges of baking sheet (spoon the squash pieces into each other to maximize space). Roast on lowest oven rack. Let onions and squash roast until onions are softened and translucent, 10 minutes longer.\nSerious Eats / Amanda Suarez\nRemove onions from oven and carefully remove foil. Brush with 2 tablespoons oil and sprinkle with 1 teaspoon of the salt and remaining 1/4 teaspoon pepper. Return to middle oven rack and continue to roast both onions and squash, uncovered and flipping squash once halfway through, until bottom sides of onion wedges are lightly browned and squash are browned, about 20 additional minutes.\nSerious Eats / Amanda Suarez\nWhile vegetables roast, place dates, orange juice, vinegar, honey, pinch of chile powder, and remaining 3 tablespoons oil, and 1/2 teaspoon salt in a small bowl. Stir and mash dates using the back of a spoon until mixture is thickened and creamy but still loose enough to drizzle.\nSerious Eats / Amanda Suarez\nTransfer roasted squash and onion wedges to a large serving platter. Drizzle with date-orange dressing and garnish with pistachios. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nPastry brush, 2 rimmed baking sheets\nNotes\nYou can use hot honey in place of the regular honey. If using hot honey, omit the pinch of chile powder.\nMake-Ahead and Storage\nThe dressing can be made ahead and refrigerated for up to 3 days. Bring to room temperature and whisk to recombine,thinning with a teaspoon of water if necessary.\nLeftover roasted vegetables and be refrigerated in an airtight container for up to 5 days. Serve at room temperature or reheat in oven.\nWinter Squash\nThe Latest\nAcorn Squash",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/roasted-acorn-squash-with-red-onions.webp?"
}