{
  "url": "https://www.seriouseats.com/roasted-cauliflower-soup-curry-cream-8748572",
  "image_url": "https://www.seriouseats.com/thmb/S0PpCtc7fa6fOXY4n0K7i7AoRVI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241120-RoastedCauliflfowerSoup-AmandaSuarez-hero-9e9dc86981804d5d907f94f082f5a4e4.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Fall",
    "Winter",
    "Cauliflower"
  ],
  "title": "Roasted Cauliflower Soup",
  "full_text": "Roasted Cauliflower Soup\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nTotal\n55 mins\nServes\n8 servings\nMakes\n2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Soup:\n2\nheads\ncauliflower\n(about 2 pounds/900g each), trimmed and cut into roughly 1-inch-thick florets\n9\ntablespoons\n(150ml)\nextra-virgin olive oil\n, divided\nKosher salt\n1\nmedium\nyellow onion\n(8 ounces; 227g), thinly sliced\n1\ncelery\nrib\n(2 ounces; 57g), thinly sliced\n3\nmedium\ncloves garlic\n, smashed\n1\nlarge sprig\nfresh sage\n1\nquart\n(1L)\nhomemade\nchicken or vegetable\nstock\nor store-bought low-sodium broth, plus more as needed (see notes)\n3/4\ncup\n(177ml)\nheavy cream\nFreshly ground black pepper\nFor the Curry Cream:\n1/2\ncup\n(118ml)\nheavy cream\n1/2\ncup\n(118g)\nsour cream\n2\nteaspoons\n(8g)\ncurry powder\n(see notes)\nKosher salt\nDirections\nFor the Soup:\nPreheat oven to 500°F (260°C) and set racks in upper and lower third positions. Divide cauliflower evenly between 2 rimmed baking sheets. Drizzle 6 tablespoons (90ml) olive oil all over both sheets of cauliflower, season all over with salt, then toss to coat evenly. Spread cauliflower in a single even layer on each sheet. Roast cauliflower, stopping once halfway through to rotate trays top to bottom and flip cauliflower florets, until cauliflower is well browned, about 25 minutes. (If you only have one rimmed baking sheet, you can roast the cauliflower in two successive batches.)\nSerious Eats / Amanda Suarez\nMeanwhile, in a 4- or 5-quart saucepan, heat remaining 3 tablespoons (45ml) olive oil over medium-high heat until shimmering. Add onion, celery, and garlic, season lightly with salt, and cook, stirring, until softened but not browned, about 6 minutes; reduce heat if needed to prevent scorching.\nSerious Eats / Amanda Suarez\nAdd roasted cauliflower to pot along with sage and stock or broth. Bring to a simmer over high heat, then reduce heat to maintain simmer and cook until all vegetables are very soft, about 20 minutes. Discard sage.\nSerious Eats / Amanda Suarez\nCarefully transfer vegetables and liquid to a blender jar, cover with blender lid with the center cap removed, and cover with a clean kitchen towel. Starting at the lowest speed and gradually increasing speed as needed, blend soup until very smooth, at least 1 minute; blend in batches if your blender jar can't hold all the soup vegetables and liquid at once. The soup will be thick at this point and may require some stirring in the blender jar to ensure it is fully blended. (If desired, you can also use an immersion blender and blend the soup directly in the pot.)\nSerious Eats / Amanda Suarez\nReturn blended soup to the rinsed and wiped-out pot and stir in cream. Thin with additional stock/broth or water as needed to reach desired soup consistency (it should be thick and silky, but still flow like a liquid). Season with salt and pepper to taste. Bring soup to a simmer when ready to serve.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Curry Cream:\nIn a large mixing bowl or the bowl of a stand mixer fitted with the whisk attachment, whisk cream, sour cream, curry powder, and a large pinch of salt until soft peaks form.\nSerious Eats / Amanda Suarez\nLadle hot soup into bowls, garnish each with a generous dollop of curry cream and serve.\nNotes\nThe better and more flavorful the broth you use, the better the soup will be. Homemade stock is always best, but store-bought will work in the interest of speed. Since it may be inconvenient to use a second quart of stock just to thin the soup, you can thin it with water instead, though this will dilute flavor more than stock will.\nUse any curry powder you wish, and feel free to adjust to taste based on the curry powder you use, as their flavor and intensity can vary from type to type and brand to brand. You do want the curry cream to be strongly flavored, as it melts into the soup and will be diluted by it.\nMake-Ahead and Storage\nThe soup can be fully made through step 5, then cooled and refrigerated in an airtight container for up to 5 days. Reheat before serving, thinning with additional stock or water if necessary.\nThe curry cream will weep liquid if made too far in advance, but can be prepared and refrigerated up to 3 hours in advance.\nSoups\nThe Latest\nFall\nWinter\nCauliflower"
}