{
  "url": "https://www.seriouseats.com/roasted-brussels-sprouts-and-shallots-with-balsamic-vinegar-thanksgiving-recipe",
  "image_url": "https://www.seriouseats.com/thmb/L_aWEjxQ23JAVyLhv1DgDEu8WJo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240903_SEA_Roasted-Brussels-Sprouts_MorganHuntGlaze_Step-01_22-8377a52323f34ade947653a06a234bba.jpg",
  "tags": [
    "Dairy-free Sides",
    "Gluten-free Sides",
    "Vegan Sides",
    "Vegetarian Sides",
    "Roasted Vegetables"
  ],
  "title": "Roasted Brussels Sprouts",
  "full_text": "Roasted Brussels Sprouts\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.4\nkg\n)\nBrussels sprouts\n,\nbottoms trimmed, outer leaves removed, cut in half\n(see note)\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil, divided\n(see note)\nKosher salt\nand freshly ground black pepper\n8\nmedium\nshallots\n, sliced thinly (see note)\n2\ntablespoons\n(\n30\nml\n)\nbalsamic vinegar or aged sherry vinegar\nDirections\nAdjust oven racks to upper and lower middle positions and place a rimmed baking sheet on each rack. Preheat oven with sheets to 500°F (260°C).\nIn a large bowl, add sprouts, 3 tablespoons of the olive oil, and salt and pepper to taste and toss to combine. Once the oven has reached temperature, working quickly, remove the baking sheets with a dish towel or oven mitt and divide Brussels sprouts mixture evenly between both trays, shaking sheets to distribute into a single even layer. Return pans to the oven. Roast for 10 minutes. While Brussels sprouts roast, in the now-empty bowl, toss shallots, remaining 1 tablespoon olive oil, and salt and pepper to taste to combine.\nSerious Eats / Morgan Hunt Glaze\nWorking quickly and carefully, divide the shallot mixture evenly between the two sheets and stir with the Brussels sprouts to combine. Rotate and swap pans top to bottom in oven. Continue to bake until Brussels sprouts are deeply charred and fully tender and shallots begin to brown, 10 to 15 minutes more.\nSerious Eats / Morgan Hunt Glaze\nImmediately after removing sheets from oven, drizzle sprouts with balsamic vinegar and shake to coat. Season to taste with more salt and pepper if desired and serve.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nTwo rimmed baking sheets\nNotes\nLook for sprouts about one and a half inches in diameter, with tight heads.\nChicken, turkey, or duck fat can be used in place of the olive oil. Crisped bacon or fatback can be added to the Brussels sprouts after roasting.\nYou can substitute 2 thinly sliced red onions for shallot in the recipe.\nMake-Ahead and Storage\nThe Brussel sprouts and shallots can be cut and refrigerated, before tossing with oil, for up to 2 days.\nLeftovers can be refrigerated in an airtight container for up to 2 days.\nRead More\nHow to Trim and Cut Brussels Sprouts\nEasy Roasted Brussels Sprouts Recipe\nFried Brussels Sprouts With Shallots, Honey, and Balsamic Vinegar Recipe\nRoasted Brussels Sprouts With Chorizo and Sherry Vinegar Recipe\nDairy-free Sides\nGluten-free Sides\nVegan Sides\nVegetarian Sides\nRoasted Vegetables"
}