{
  "url": "https://www.seriouseats.com/roast-goose-and-gravy-recipe",
  "image_url": "https://www.seriouseats.com/thmb/TzDaq7QF1xuqFiQNrz2kAt5Glxo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20151212-goose-vicky-wasik-14-2bc1c05a78a34133a74ceca026e54b19.jpg",
  "tags": [
    "Roasting",
    "Christmas",
    "Other Meat & Poultry",
    "Hanukkah",
    "Christmas Dinners"
  ],
  "title": "Crisp-Skinned Roast Goose and Gravy",
  "full_text": "Crisp-Skinned Roast Goose and Gravy\nClose\nJump to recipe\nPrep\n15 mins\nCook\n6 hrs 25 mins\nActive\n90 mins\nDry-Brining and Resting Time\n12 hrs 35 mins\nTotal\n19 hrs 15 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\ngoose\n(\n10-12 pounds\n;\n4.5-5.5 kg\n), neck, giblets, wing tips, and wishbone removed and reserved (see notes)\n1/2\ncup\n(\n2.5\nounces\n;\n70\ng\n) Diamond Crystal\nkosher salt\nor\n6\ntablespoons\n(\n3\nounces\n;\n85\ng\n) Morton's kosher salt, plus more to taste\n2\ntablespoons\n(\n24\ng\n)\nbaking powder\n1 1/2\ncups\n(\n355\nml\n)\nhomemade chicken stock\nor\nlow-sodium chicken broth\n1\npacket\n(\n2 1/2 teaspoons; 7 g\n)\nunflavored gelatin\n(only if using store-bought chicken broth; see notes)\n1\nlarge\nyellow onion\n, diced (\n10\nounces\n;\n283\ng\n)\n2\nmedium\ncarrots\n, peeled and diced (\n4\nounces\n;\n113\ng\n)\n2\nribs\ncelery\n, diced (\n4\nounces\n;\n113\ng\n)\n1\ntablespoon\n(\n15\nml\n)\ntomato paste\n2\ncups\n(\n475\nml\n)\ndry red wine\n8\nlarge sprigs\nparsley\n3\nsprigs\nfresh thyme\n1\nbay leaf\n1/2\ncup\n(\n120\nml\n)\nAmontillado sherry\n2\ntablespoons\n(\n16\ng\n)\nall-purpose flour\nFreshly\nground black pepper\nDirections\nUsing kitchen shears, trim excess skin from the goose's neck. Use shears or fingers to remove bundles of pale, lumpy fat from the cavity. Reserve 3 tablespoons solid fat, plus an additional 1/3 cup if making\nprune and apple stuffing\n. Pat reserved fat dry, chill, then mince.\nSerious Eats / Vicky Wasik\nUsing a trussing needle or paring knife, prick goose skin at 1/2-inch intervals all over, front and back, being sure to pierce the skin but not poke holes in the meat. Pay special attention to particularly fatty areas, such as beneath wings and around thighs.\nSerious Eats / Vicky Wasik\nFill a large stock pot by two-thirds with water and bring to a boil over high heat. Wearing clean rubber kitchen gloves, grasp the legs of the goose and lower it into the water, neck end first, submerging it halfway. Keep submerged for 1 minute. Lift goose, allowing excess water to drain back into pot, then transfer to a work surface. Grasp wings and submerge other half of goose, tail end first, in boiling water and keep submerged 1 minute longer. Lift goose, allowing excess water to drain back into pot, then transfer goose to work surface. Pat dry with paper towels inside and out.\nSerious Eats / Vicky Wasik\nIn a small bowl, mix kosher salt and baking powder together. Generously and evenly sprinkle salt mixture all over goose skin; use just enough of the salt mixture to coat thoroughly. (You will most likely not need all of the salt, and in some cases, less than half will be sufficient, depending on the size of your bird and your salt preference.) Transfer goose to a wire rack set in a rimmed baking sheet and refrigerate uncovered for 12 to 24 hours.\nIf using store-bought chicken broth, pour into a microwave-safe medium bowl and sprinkle gelatin in an even layer on surface. Let stand 5 minutes; microwave in 1-minute intervals, whisking each time, until gelatin is dissolved. Using a cleaver, cut reserved goose neck and wing tips crosswise into 3-inch pieces. Meanwhile, in a large, wide 5-quart saucepan, heat the 3 tablespoons reserved minced goose fat over medium heat, stirring often, until the fat renders and forms small browned bits, about 3 minutes. Increase heat to medium-high and add goose neck, wing tips, wishbone, and all giblets (except liver); sauté, stirring often until  browned, 8 to 10 minutes.\nAdd onions, carrots, and celery to saucepan, and cook, stirring occasionally, until onions begin to brown, about 10 minutes. Stir in tomato paste and cook, stirring constantly for 1 minute. Add red wine, scraping up any brown bits on bottom of saucepan. Add chicken broth mixture, parsley, thyme, and bay leaf. Bring to a boil over medium-high heat, stirring occasionally, then reduce heat to low;  partially cover leaving a 1-inch opening on one side, and cook, stirring occasionally, at a bare simmer for 2 hours. If necessary, add additional stock or water to keep ingredients mostly submerged. Set a fine-mesh strainer over a 4-cup measuring cup then strain stock, pressing down on solids with a ladle or spoon to extract all liquid. Reserve and finely chop heart and gizzard; dispose of all other solids. Skim fat off top of strained stock and, if necessary, add additional chicken stock or water to total 2 full cups. Return strained stock to saucepan. (Stock can also be made ahead of time, cooled and refrigerated in an airtight container for up to 5 days.)\nAdjust oven rack to lower-middle  position and preheat to 425°F (218°C). Fill a large roasting pan with a 1/2-inch of warm water. Remove goose from refrigerator and place breast side down in a V-rack set in prepared roasting pan (we often recommend roasting on a wire rack set in a rimmed baking sheet, but the goose renders too much fat for this to be a safe option). Roast goose for 20 minutes. Remove from oven. Carefully use 2 wooden spoons inserted into neck and body cavities, to carefully rotate goose to breast side up. Return goose to the oven and roast for 20 minutes. Remove from oven and carefully transfer the V-rack with goose to a heat-safe work surface. Pour the water mixture from the bottom of the roasted pan into a very large bowl; return V-rack with goose to the now-empty roasting pan. (If you don’t have a garbage disposal, skim fat off water before pouring down the drain.)\nReduce oven temperature to 275°F (135°C). Roast goose until skin is fully browned and an instant-read thermometer inserted in the thickest portion of thigh registers at least 175°F,  2 1/4 hours to 2 3/4 hours. Remove from oven and increase temperature to 425°F (218°C); Once oven reaches temperature, transfer V rack with goose to a rimmed baking sheet. Return goose on the baking sheet to the oven and roast until skin is crisp, about 15 minutes more. Let goose rest for 30 minutes. Meanwhile, transfer accumulated rendered fat from roasting pan to a heat-proof container. Do not wash the roasting pan.\nBring the goose stock in saucepan to a simmer over medium heat, stirring occasionally. Meanwhile, heat the roasting pan set over 2 burners on low heat. Add sherry and, using a wooden spoon, scrape up any brown bits from the bottom of the pan. Bring sherry mixture to a boil over medium heat, stirring often for just 30 seconds. Scrape contents of roasting pan into saucepan with goose stock. Add reserved chopped gizzard and heart to the saucepan. Continue simmering for 5 minutes\nFinely chop reserved goose liver. In a clean medium saucepan, stir together 2 tablespoons of rendered goose fat from roasting pan with flour over medium-low heat, stirring constantly, until aromatic and light brown, about 5 minutes. Remove from heat. (Remaining goose fat can be refrigerated or frozen and used for cooking and frying.) Gradually pour hot goose stock into flour mixture, whisking constantly until combined. Bring to a simmer over medium heat, stirring occasionally. Reduce heat to low and simmer, stirring occasionally, until gravy is slightly thickened, 3 to 6 minutes. .\nAdd goose liver and simmer, stirring occasionally, for 1 minute longer. Season with salt and pepper to taste. Carve goose and serve with gravy.\nSpecial Equipment\nKitchen shears\n,\nstockpot\n, clean rubber kitchen gloves\nNotes\nTo remove wingtips, cut through at the joint. For guidance on removing the goose's wishbone, you can view the method for\nremoving it from a turkey\n—the process is virtually identical. If you're uncomfortable doing these steps yourself, you can ask your butcher to do so.\nWe recommend\nadding unflavored gelatin to store-bought broth to give it more body.\nRead More\nPrune and Apple Stuffing With Sausage and Chestnuts\nRoasting\nChristmas\nOther Meat & Poultry\nHanukkah\nChristmas Dinners"
}