{
  "url": "https://www.seriouseats.com/roasted-garlic",
  "image_url": "https://www.seriouseats.com/thmb/FjXfEISZgexeOhYQS6Pb_7MZMiI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201007-roast-garlic-sasha-marx-1-5dbd681305b144b392c8772e8761a8d1.jpg",
  "tags": [
    "Recipes By Ingredients"
  ],
  "title": "Roasted Garlic",
  "full_text": "Roasted Garlic\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n5 mins\nCooling Time\n5 mins\nTotal\n55 mins\nServes\n1 bulb\nMakes\n1/4 cup roasted garlic\nCook Mode\n(Keep screen awake)\nIngredients\n2\nheads\ngarlic\n(about\n3 1/2\nounces\n;\n100\ng\ntotal), outer papery skins removed and top 1/2-inch of head cut off and discarded\nExtra-virgin olive oil or neutral\nvegetable oil\nsuch as canola or grape seed, as needed (see notes)\nKosher salt\nand freshly ground black pepper\nDirections\nAdjust oven rack to middle position and preheat oven to 375°F (190°C).\nFor Foil-Roasted Garlic:\nSet wire rack inside a rimmed baking sheet, and cut a 12- by 8-inch piece of aluminum foil. Place garlic heads in center of aluminum foil, cut side up, drizzle with 1 tablespoon (15ml) oil, and season assertively with salt and pepper. Bring opposite ends of foil together and crimp tightly at top to form a compact, sealed packet. Place foil packet on prepared baking sheet and transfer to oven.\nFor Oil-Roasted Garlic:\nAdd 1 cup (240ml) oil to a small ovenproof saucepan (you can use all olive oil, all vegetable oil, or a blend of both). Place garlic heads, cut side down, in oil; cover and transfer to oven.\nFor Foil-Roasted Garlic:\nRoast until garlic cloves are lightly golden and tender enough to be easily pierced with a cake tester or paring knife (be careful when opening foil packet to test doneness), about 45 minutes. Remove baking sheet from oven and set aside, with packet open to allow steam to escape, until garlic heads are cool enough to handle, about 5 minutes. Squeeze cloves out of their skins, moving from root end toward cut end; discard skins. Roasted garlic cloves can be used right away, or refrigerated in an airtight container for up to 1 week.\nFor Oil-Roasted Garlic:\nCook until cut side of garlic is golden brown, about 20 minutes. Turn garlic heads cut side up, cover, and continue to cook until cloves are tender and can be easily pierced with a cake tester or paring knife, 20 to 25 minutes longer. Transfer saucepan to a heatproof surface and set aside to cool, uncovered, until garlic heads are cool enough to handle, 5 to 10 minutes. Squeeze cloves out of their skins, moving from root end toward cut end; discard skins. If there are pieces of papery skin left in the oil, strain through a fine-mesh strainer, using cheesecloth if necessary to remove any sediment. Roasted garlic cloves and roasted garlic oil can be used right away, or refrigerated in airtight containers for up to 1 week.\nSpecial Equipment\nRimmed baking sheet\n,\nwire rack\nNotes\nFor both versions of roasted garlic you can use extra-virgin olive oil, a neutral vegetable oil, or a combination of the two. For oil-roasted garlic, we generally favor a 50/50 blend of extra-virgin olive oil and canola oil.\nMake-Ahead and Storage\nRoasted garlic cloves and garlic oil can be refrigerated in an airtight container for up to 1 week.\nRead More\nRoasted Garlic, Potato, and Parmesan Soup\nTomato-Roasted Garlic Freezer Jam\nEasy Weeknight Garlic Bread\nSkordalia (Greek Garlic and Potato Spread)\nRecipes By Ingredients",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/roasted-garlic.webp?"
}