{
  "url": "https://www.seriouseats.com/roasted-delicata-squash-and-kale-salad-with-hazelnut-parmesan-crumble-recipe-5210699",
  "image_url": "https://www.seriouseats.com/thmb/PnG4pBnhr4iq-PI0pKTIRnH552U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Delicata-Squash-Kale-Hazelnuts-Jillian-Atkinson-Hero_1-174569b4f495403fb801cf9e7cf4bc99.jpg",
  "tags": [
    "Winter Squash",
    "Kale"
  ],
  "title": "Roasted Delicata Squash and Kale Salad With Hazelnut-Parmesan Crumble",
  "full_text": "Roasted Delicata Squash and Kale Salad With Hazelnut-Parmesan Crumble\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\nml\n)\nextra virgin olive oil\n1\ntablespoon\n(\n15\nml\n)\nred wine vinegar\n1\ntablespoon\n(\n1\ng\n) chopped\nfresh thyme\nleaves\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n1/2\ncup\n(\n60\ng\n)\nhazelnuts\n, toasted, skinned, and roughly chopped\n2\ntablespoons\n(\n10\ng\n) finely grated\nParmigiano-Reggiano\n2\ntablespoons\n(\n2\ng\n) chopped fresh\nsage leaves\n2\nmedium\ndelicata squash\n(about\n2\npounds\n;\n900\ng\ntotal), washed and dried\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, melted\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n, plus extra as needed\n1/2\nteaspoon\nfreshly\nground black pepper\n, plus extra as needed\n1\nbunch\n(\n8\nounces\n;\n225\ng\n)\nlacinato kale\n(a.k.a. dinosaur, Tuscan, or black kale), tough stems removed, leaves cut into 1-inch pieces\nDirections\nAdjust oven rack to lowest position and preheat oven to 425°F (220°C).\nIn a small bowl, whisk together 1 tablespoon (15ml) of olive oil, vinegar, thyme, and mustard until thoroughly combined, about 30 seconds. Set aside.\nSerious Eats / Jillian Atkinson\nIn a second small bowl, combine hazelnuts, Parmigiano-Reggiano, and sage; set aside.\nSerious Eats / Jillian Atkinson\nTrim both ends of each delicata squash. Stand one squash up on its larger flat cut side, and use a chef’s knife to slice down lengthwise through the center of the squash, creating two even halves. Use a soup spoon to scrape out and discard the seeds and any fibrous flesh attached to them. Repeat with second squash. Place squash halves cut-side down on a large cutting board, and cut crosswise into 1-inch-thick slices. Transfer squash slices to a large bowl.\nSerious Eats / Jillian Atkinson\nAdd melted butter, salt, and pepper to the bowl and toss to coat squash slices evenly. Transfer squash slices to a rimmed baking sheet, arranging them around the perimeter of the sheet with an even amount of space between each slice; set aside the large bowl. Roast squash until golden brown on bottom side, 12 to 14 minutes.\nSerious Eats / Jillian Atkinson\nMeanwhile, toss kale in the now-empty large bowl with the remaining 1 tablespoon (15ml) of the olive oil. Using your hands, massage kale until slightly wilted, about 1 minute.\nSerious Eats / Jillian Atkinson\nOnce squash slices are browned on the first side, transfer baking sheet to a heatproof surface, and use kitchen tweezers or tongs to flip each slice over. Transfer massaged kale to empty space in the center of the baking sheet. Rotate baking sheet 180 degrees, return it to the oven, and continue to roast until squash slices have browned on second side, about 10 minutes.\nSerious Eats / Jillian Atkinson\nTransfer baking sheet to a heatproof surface. Briefly whisk the vinaigrette to re-emulsify then immediately drizzle over the kale and squash. Use a wide spatula to gently toss until vegetables are evenly coated with dressing. Season with additional salt and pepper to taste. Sprinkle with hazelnut mixture, transfer to a serving platter, and serve right away.\nSerious Eats / Jillian Atkinson\nSpecial Equipment\nRimmed baking sheet\n,\nwhisk\n,\nkitchen tweezers\nor\ntongs\nMake-Ahead and Storage\nThe vinaigrette can be made in advance and refrigerated in an airtight container for up to 2 days. The finished salad is best enjoyed right away while still warm, but leftovers can be reheated gently in a skillet on the stovetop with a little additional butter or olive oil.\nRead More\nFall Harvest Salad With Roasted Brassicas, Fingerlings and Radishes Recipe\nWarm Pigeon Pea Salad With Roasted Butternut Squash, and Spiced Onions Recipe\nRoasted-Beet and Citrus Salad With Ricotta and Pistachio Vinaigrette Recipe\nMake-Ahead Roasted Squash and Kale Salad Recipe\nRoasted Vegetable Caesar Salad Recipe\nCharred, Oven-Roasted Carrot Salad With Feta Cheese Recipe\nWinter Squash\nKale"
}