{
  "url": "https://www.seriouseats.com/roast-chicken-with-romesco-and-creamy-corn",
  "image_url": "https://www.seriouseats.com/thmb/l1Zze6GEd7NiQCoiz73iaMvI2Do=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__09__20200909-Chicken-Corn-romesco-1-daniel-gritzer-72996db748224b8785ff2926e16ecfa9.jpg",
  "tags": [
    "Chicken Mains",
    "Spanish",
    "Roasted Chicken",
    "Stovetop Chicken",
    "Corn"
  ],
  "title": "Roast Chicken With Romesco and Creamy Corn Recipe",
  "full_text": "Roast Chicken With Romesco and Creamy Corn Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nActive\n60 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\nchicken\n, about\n4 to 5\npounds\n(\n1.8\nto\n2.25\nkg\n)\nKosher salt\nand freshly\nground white pepper\n4\ntablespoons\n(\n1/2\nstick\n;\n60\ng\n)\nunsalted butter\nplus\n1\ntablespoon\n(\n15\ng\n)\nsoftened unsalted butter\n, divided\n1\nmedium\nleek\n(about\n12\nounces\n;\n340\ng\n), white and light green parts only, cut into 1/4-inch dice\n4\nfresh\nears\nfresh corn\n(about\n12\nounces\n;\n340\ng\neach),\nkernels cut and cobs scraped of any corn milk\n2\nteaspoons minced\nfresh thyme leaves\n1\nrecipe\nromesco sauce\n, room temperature or just slightly warmed\nDirections\nAdjust oven rack to upper-middle position and preheat oven to 400°F (205°C). Using sharp kitchen shears, remove spine from chicken and reserve for another use (such as\nhomemade chicken stock\n). Flatten chicken by placing skin side up on cutting board and applying firm pressure to breast bone. Season generously all over with salt and white pepper.\nSet wire rack in rimmed baking sheet lined with aluminum foil. Position chicken, skin side up, so that breasts are aligned with center of baking sheet and legs are close to edge. Roast for 20 minutes, then rub skin all over with the 1 tablespoon (15 g) softened butter. Return to oven and cook until thickest part of breast close to bone registers 150°F (66°C) on an instant-read thermometer and joint between thighs and body registers at least 170°F (77°C), 25 to 45 minutes longer. Transfer chicken to cutting board, and let rest for 10 minutes before carving.\nMeanwhile, in a 3-quart saucier or saucepan, melt remaining 4 tablespoons (60g) butter over medium heat until foaming. Add diced leek and cook, stirring often, until just starting to soften, about 3 minutes. Add corn kernels, along with any of the cob's scraped milk, and the thyme, raise heat to medium-high, and cook, stirring often, until corn is crisp-tender, about 8 minutes; lower heat to medium at any point if the corn or leeks begin to brown.\nStir in 1/2 cup water and cook until reduced to a creamy glaze; if the glaze breaks, stir in water, 1 tablespoon at a time, until the emulsion reforms. Season with salt and white pepper to taste.\nCarve chicken. Spoon a large circle of romesco sauce onto the bottom of individual serving plates or bowls. Divide corn mixture between each plate, setting it in the middle of the romesco, then arrange chicken on top. Serve.\nSpecial Equipment\n3-quart saucepan\n,\nrimmed baking sheet\nand\nwire rack\nMake-Ahead and Storage\nThe romesco can be made up to 5 days ahead and refrigerated in an airtight container; bring to room temperature or gently warm before serving. The corn can be cooked up to 3 days ahead and refrigerated in an airtight container until ready to serve; gently reheat before serving.\nChicken Mains\nSpanish\nRoasted Chicken\nStovetop Chicken\nCorn"
}