{
  "url": "https://www.seriouseats.com/roasted-vegetable-caesar-salad-recipe-8669384",
  "image_url": "https://www.seriouseats.com/thmb/o6XRh0f4hVqKcAyoG-NL7chQwA8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-SheetPanRoastVeggieCaesarSalad-TwoBites-hero-f66f6e15d1894e3c9b878672c510910f.jpg",
  "tags": [
    "Salads",
    "The Latest",
    "Green Salads"
  ],
  "title": "Roasted Veggie Caesar Salad",
  "full_text": "Roasted Veggie Caesar Salad\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nCooling Time\n15 mins\nTotal\n65 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n4\noil-packed anchovy fillets\n2\nmedium\ngarlic cloves\n, minced (about\n2\nteaspoons\n)\n1/4\nteaspoon\nkosher salt\n2\ntablespoons\n(\n30\nml\n)\nlemon juice\nfrom\n1\nlemon\n2\nteaspoons\nDijon mustard\n1\nteaspoon\nWorcestershire sauce\n1\npinch\nfreshly ground black pepper\n6\ntablespoons\n(\n90\nml\n)\nextra-virgin olive oil\n2\ntablespoons\nfinely grated Parmigiano-Reggiano\nplus\n1/2\nounce\nshaved Parmigiano-Reggiano\n(about\n1/2\ncup\n) divided\n8\nounces\n(\n225\ng\n)\nbroccolini\n(about\n1\nbunch\n), ends trimmed, trimmed and cut into 1-inch pieces\n8\nounces\n(\n225\ng\n)\ncremini mushrooms\n, washed, trimmed and quartered\n1\nmedium\nred bell pepper\n(\n8\nounces\n;\n225\ng\n), cored and cut into 1-inch pieces (about\n1\ncup\n)\n1\nmedium\nyellow onion\n(\n9\nounces\n;\n225\ng\n), roughly chopped (about\n1\ncup\n)\n4\nounces\nbaby green leaf lettuce\n,\ngem\n, or\nbaby romaine lettuce\n(about\n4\ncups\n), washed and dried\n1/2\ncup\nCaesar bread crumbs\n, if desired\nDirections\nAdjust oven rack to upper-middle position and preheat the oven to 500℉ (260℃). Set a rimmed baking sheet in the oven while the oven preheats.\nSerious Eats / Two Bites\nPlace anchovies and garlic in a small pile on a cutting board and sprinkle with salt. Roughly chop the anchovies and garlic, then use the side of a chef's knife to mash the mixture into a paste, about 2 minutes.\nSerious Eats / Two Bites\nTransfer mixture to a large mixing bowl and add lemon juice, mustard, Worcestershire sauce, and black pepper and whisk to combine. Slowly drizzle in the olive oil while continuing to whisk to form an emulsion. Whisk in the grated Parmigiano-Reggiano. Remove 6 tablespoons of the vinaigrette to a small bowl and set aside; reserve the remaining vinaigrette (about 2 tablespoons) in the large mixing bowl.\nSerious Eats / Two Bites\nAdd broccolini, mushrooms, bell pepper, and onion to the large mixing bowl with the reserved 2 tablespoons vinaigrette and toss until well coated.\nSerious Eats / Two Bites\nCarefully transfer the coated vegetables to the preheated baking sheet in an even layer and roast until the vegetables are tender and slightly browned around the edges, 18 to 25 minutes, stirring halfway through. Let the vegetables cool slightly on the sheet tray at room temperature for about 15 minutes.\nSerious Eats / Amanda Suarez\nIn the now-empty large mixing bowl, combine the lettuce and the cooled roasted vegetables. Drizzle with 4 tablespoons of the reserved dressing and toss well to coat. Transfer mixture to a serving platter and top with shaved Parmesan and Caesar bread crumbs, if using. Drizzle with more dressing, if desired.\nSerious Eats / Two Bites\nSpecial Equipment\nKitchen scale, rimmed baking sheet, aluminum foil\nNotes\nYou can double this recipe if desired. Place racks in the upper and lower thirds of the oven and line two rimmed baking sheets with aluminum foil. Split the vegetables among the two baking sheets and rotate racks from upper to lower position halfway through cooking.\nMake-Ahead and Storage\nThe Caesar vinaigrette and roasted vegetables can be prepared up to two days ahead. Store the vinaigrette and vegetables in separate airtight containers in the refrigerator. Remove the vegetables and vinaigrette from the refrigerator 30 minutes to an hour before assembling the salad. Toss the vegetables and lettuce with the dressing just before serving.\nSalads\nThe Latest\nGreen Salads"
}