{
  "url": "https://www.seriouseats.com/roasted-potatoes-curry-leaf-mustard-oil-mayo",
  "image_url": "https://www.seriouseats.com/thmb/j2seyCqKcBmYTT7jffFAlOsVxiQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201015-curry-leaf-mustard-oil-mayo-nik-sharma-7-cf8a96abd83b4e3397d2ebbc8b4b2958.jpg",
  "tags": [
    "Roasted Potatoes",
    "Indian",
    "Russet Potatoes",
    "Yukon Gold Potatoes",
    "Fall Sides"
  ],
  "title": "Crispy Roasted Potatoes With Curry Leaf and Mustard Oil Mayonnaise Recipe",
  "full_text": "Crispy Roasted Potatoes With Curry Leaf and Mustard Oil Mayonnaise Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nActive\n30 mins\nResting Time\n10 mins\nTotal\n115 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1/2\nteaspoon\n(\n4\ng\n)\nbaking soda\n4\npounds\n(about\n2\nkg\n)\nrusset\nor\nYukon Gold potatoes\n, peeled and cut into quarters, sixths, or eighths, depending on size (see notes)\n5\ntablespoons\n(\n75\nml\n)\nextra-virgin olive oil\n1\ntablespoon\nonion powder\n2\nteaspoons\ngarlic powder\n2\nteaspoons\nground sumac\n1\nteaspoon\nred chile powder\nCurry leaf\nand\nmustard oil mayonnaise\n, for serving\nDirections\nAdjust oven rack to center position and preheat oven to 450°F/230°C (or 400°F/200°C if using convection). Heat 2 quarts (2L) water in a large pot over high heat until boiling. Add 2 tablespoons kosher salt (about 1 ounce; 25g), baking soda, and potatoes and stir. Return to a boil, reduce to a simmer, and cook until a knife meets little resistance when inserted into a potato chunk, about 10 minutes after returning to a boil.\nWhen potatoes are cooked, drain carefully and let them rest in the pot for about 30 seconds to allow excess moisture to evaporate. Transfer to large mixing bowl, add olive oil, season to taste with a little more salt and pepper, and toss to coat, shaking bowl roughly, until a thick layer of mashed potato–like paste has built up on the potato chunks.\nTransfer potatoes to a large rimmed baking sheet and separate them, spreading them out evenly. Transfer to oven and roast, without moving, for 20 minutes. Using a thin, flexible metal spatula to release any stuck potatoes, shake pan and turn potatoes. Continue roasting until potatoes are deep brown and crisp all over, turning and shaking them a few times during cooking, 30 to 40 minutes longer.\nTransfer potatoes to a large bowl and add onion powder, garlic powder, ground sumac, and red chile powder. Toss to coat and season with more salt and pepper to taste. Serve immediately with ramekin of curry leaf and mustard mayonnaise for dipping alongside.\nSpecial Equipment\nRimmed baking sheet,\nfine-mesh strainer\nNotes\nRusset potatoes will produce crisper crusts and fluffier centers. Yukon Golds will be slightly less crisp and have creamier centers, with a darker color and deeper flavor. You can also use a mix of the two.\nThe potatoes should be cut into very large chunks, at least 2 to 3 inches or so. For medium-sized Yukon Golds, this means cutting them in half crosswise, then splitting each half again to make quarters. For larger Yukon Golds or russets, you can cut the potatoes into chunky sixths or eighths.\nRoasted Potatoes\nIndian\nRusset Potatoes\nYukon Gold Potatoes\nFall Sides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/crispy-roasted-potatoes-with-curry-leaf-and-mustard-oil-mayonnaise-recipe.webp?"
}