{
  "url": "https://www.seriouseats.com/roast-turkey-breast-stuffing-recipe",
  "image_url": "https://www.seriouseats.com/thmb/KelFQDlNJji5ciymTptbJK3QZOA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220501-herb-roasted-turkey-breast-and-stuffing-mariel-delacruz-hero-0202a30550814c1088e8f4181a31444c.jpg",
  "tags": [
    "Turkey Breast",
    "Thanksgiving Turkeys",
    "Roasted Turkey",
    "Christmas Dinners",
    "Winter Mains"
  ],
  "title": "Herb-Roasted Turkey Breast and Stuffing",
  "full_text": "Herb-Roasted Turkey Breast and Stuffing\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs\nActive\n45 mins\nResting Time\n20 mins\nTotal\n2 hrs 35 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\ntablespoons\n(\n1\nstick\n)\nbutter\n, divided\n1 1/2\npounds\nsage sausage\n, removed from casing\n1\nlarge\nonion\n, finely chopped (about\n2\ncups\n)\n4\nlarge stalks\ncelery\n, finely chopped (about\n2\ncups\n)\n4\ncloves\ngarlic\n, minced or grated on microplane, divided\n1/4\ncup minced\nfresh sage leaves\n(or\n2\nteaspoons\ndried sage leaves)\n32\nounces\n(\n4\ncups\n;\n946\nml\n)\nlow-sodium chicken\nor turkey\nbroth\n, preferably homemade\n3\nlarge\nwhole eggs\n2 1/2\npounds\n(about\n2\nloaves\n) high quality\nsandwich bread\nor soft Italian or French bread, stale or dried in the oven\n1/2\ncup\nminced\nfresh parsley\n2\ntablespoons\nminced\nfresh oregano\nKosher salt\nand freshly ground black pepper\n1\nwhole\nbone-in, skin-on turkey breast\n(about\n4 to 5\npounds\n), patted dry\nDirections\nAdjust oven rack to middle position and preheat oven to 450°F. In a large Dutch oven, melt 5 tablespoons butter over medium-high heat until foaming subsides (don't allow butter to brown), about 2 minutes. Add sausage and mash with stiff whisk or potato masher to break up into fine pieces (largest pieces should be no greater than 1/4-inch). Cook, stirring frequently until only a few bits of pink remain, about 8 minutes. Add onions, celery, garlic, and sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.\nSerious Eats / Mariel De La Cruz\nWhisk remaining chicken stock, eggs, and 3 tablespoons parsley in a medium bowl until homogeneous. Stirring constantly with a wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes and fold gently until evenly mixed.\nSerious Eats / Mariel De La Cruz\nUsing poultry shears, cut off and remove any back portion that may be attached to the turkey (there may not be any). Fill cavity under turkey breast and under flap of fat around neck with stuffing. Transfer remaining stuffing to a buttered 9- by 13-inch baking dish and place turkey on top.\nSerious Eats / Mariel De La Cruz\nUsing your hands, carefully separate the turkey skin from the meat by inserting at the bottom of the breast, being careful not to tear it. In a small bowl, combine remaining butter with remaining parsley and oregano. Add 1 tablespoon kosher salt and 1/2 teaspoon freshly ground black pepper. Stir with a fork until homogenous. Rub mixture evenly over and under turkey skin.\nSerious Eats / Mariel De La Cruz\nTransfer to oven and roast until stuffing starts to brown, about 45 minutes. Remove from oven, transfer turkey to a wire rack set in a foil-lined rimmed baking sheet, and return turkey to oven. Continue roasting until turkey is golden brown and crisp, and thickest part near bone registers 145 to 150°F on an instant-read thermometer, about 30 minutes longer. Remove from oven, transfer to a plate, and let rest for 20 minutes.\nSerious Eats / Mariel De La Cruz\nMeanwhile, pour exuded juices back over stuffing. Return stuffing to oven and cook until it's golden brown and registers 160°F on an instant read thermometer, about 15 minutes. Carve turkey, spread over stuffing, and serve.\nSerious Eats / Mariel De La Cruz\nSpecial Equipment\n9- by 13-inch baking dish\nRead More\nThe Food Lab's Definitive Guide to Buying, Prepping, Cooking, and Carving Your Holiday Turkey\nTurkey Breast\nThanksgiving Turkeys\nRoasted Turkey\nChristmas Dinners\nWinter Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/herb-roasted-turkey-breast-and-stuffing.webp?"
}