{
  "url": "https://www.seriouseats.com/roasted-potato-salad-mushrooms-shallots-kale-recipe",
  "image_url": "https://www.seriouseats.com/thmb/HNQ47Iv9-wLj2PBfVWwmGZF8et4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160311-potato-mushroom-shallot-salad-vicky-wasik-3-a7a8e24843af467789c37d01059cec48.jpg",
  "tags": [
    "Dairy-free Salads",
    "Gluten-free Salads",
    "Vegan Salads",
    "Vegetarian Salads",
    "Roasted Potatoes"
  ],
  "title": "Roasted Potato and Shallot Salad With Marinated Mushrooms and Kale Recipe",
  "full_text": "Roasted Potato and Shallot Salad With Marinated Mushrooms and Kale Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nActive\n60 mins\nCooling Time\n5 mins\nTotal\n60 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n680\ng\n)\nsmall fingerling potatoes\nKosher salt\n2\nmedium\ncloves\ngarlic\n1/2\nteaspoon\nminced\nfresh thyme leaves\n, plus\n3\nthyme\nsprigs\n, divided\n1\ncup\n(\n240\nml\n)\nextra virgin olive oil\n, divided\n12\nounces\nshallots\n(about\n10\nshallots\n;\n340\ng\n), peeled and trimmed (if shallots are large, cut them in half)\n1\nscallion\n, white and light green parts only, roughly chopped\n1\nsmall handful\nflat-leaf parsley leaves\n, roughly chopped\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n5\ntablespoons\n(\n75\nml\n)\nwhite wine vinegar\n, divided\n1/8\nteaspoon\nsmoked paprika\nFreshly\nground black pepper\n12\nounces\n(\n340\ng\n)\nshiitake mushrooms\n, stemmed\n3\nounces\n(\n85\ng\n)\nbaby Russian kale leaves\n, woody stems trimmed and large leaves torn\nDirections\nPreheat oven to 325°F (165°C). In a large saucepan, cover potatoes with cold water and season heavily with salt until water is saltier than the sea. Add garlic and thyme sprigs and set over medium-high heat. Bring to a bare simmer and cook, adjusting heat to maintain bare simmer, until potatoes are tender, about 25 minutes.\nMeanwhile, in a large ovenproof skillet, heat 2 tablespoons (30 ml) oil over medium-high heat until shimmering. Add shallots and cook, tossing, until lightly browned, about 4 minutes. Season with salt. Transfer to oven and cook, tossing occasionally, until shallots are very tender, about 25 minutes.\nIn a tall, narrow container, combine scallion, parsley, mustard, 3 tablespoons (45 ml) white wine vinegar, and smoked paprika, along with a generous pinch of salt. Using an immersion blender, blend until fully puréed and smooth. Transfer to a mixing bowl and whisk in 1/2 cup (120 ml) olive oil. Season with salt and pepper.\nIn a clean large skillet, heat 4 tablespoons (60 ml) oil over medium-high heat until shimmering. Add mushrooms and cook, stirring and tossing, until tender and just starting to brown, about 5 minutes; stir in minced thyme leaves during last 1 minute of cooking. Transfer mushrooms to a small heatproof bowl. Season with salt. Add remaining 2 tablespoons (30 ml) vinegar to mushrooms, along with enough of the scallion vinaigrette to thoroughly coat, tossing well. Set aside.\nSerious Eats / Vicky Wasik\nIncrease oven to 500°F (260°C). Drain potatoes and discard garlic and thyme, shaking to remove any excess liquid. Transfer to a foil-lined rimmed baking sheet and toss with remaining 2 tablespoons (30 ml) oil. Roast potatoes, shaking baking sheet once or twice during cooking, until starting to crisp and brown, about 15 minutes. Let cool until warm.\nIn a large bowl, combine roasted shallots, marinated mushrooms and any of their juices, roasted potatoes, and kale. Add more vinaigrette as needed to lightly coat, tossing well. Season with salt and pepper as needed. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge saucepan\n,\n2 large skillets\n(one must be ovenproof),\nimmersion blender\n, aluminum foil,\nrimmed baking sheet\nRead More\nEasy Fingerling Potato Salad With Creamy Dill Dressing\nYukon Gold Potato Salad With Tarragon Pesto and Pickled Onions Recipe\nFingerling Potato Salad With Chorizo, Onion, and Arugula Recipe\nDairy-free Salads\nGluten-free Salads\nVegan Salads\nVegetarian Salads\nRoasted Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/roasted-potato-and-shallot-salad-with-marinated-mushrooms-and-kale-recipe.webp?"
}