{
  "url": "https://www.seriouseats.com/roasted-squash-raw-carrot-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/mJu20Aads2Yoa3NDDh_pJlJ7dzE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__20120129-roasted-butternut-squash-raw-carrot-soup--4-de6329f810714cc28f20408703dadf28.jpg",
  "tags": [
    "Soups",
    "Vegan",
    "Carrots",
    "Winter Squash",
    "Fall Sides"
  ],
  "title": "Roasted Squash and Raw Carrot Soup Recipe",
  "full_text": "Roasted Squash and Raw Carrot Soup Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nActive\n30 mins\nTotal\n75 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmall\nbutternut squash\n(about\n2 1/2\npounds\n), split lengthwise, seeds removed\n1/2\ncup\nextra-virgin olive oil\n, plus additional for finishing\nKosher salt\nand\nfreshly ground black pepper\n2\nthyme sprigs\n2\ngarlic cloves\n1\nmedium\nonion\n, finely sliced (about\n1 1/2\ncups\n)\n1 1/2\nquarts\nfresh carrot juice\n(see notes)\n1/4\ncup\nchopped parsley\n(optional)\n1/4\ncup\ntoasted pumpkin\nor\nsquash seeds\n(optional)\n1/4\ncup\ntoasted croutons\n(optional)\nDirections\nAdjust oven rack to upper-middle position and preheat oven to 375°F (190°C). Coat squash halves with 2 tablespoons olive oil and season with salt and pepper. Place on rimmed baking sheet lined with aluminum foil with cut side facing up. Place garlic clove and thyme sprig in each seed hollow. Roast until completely tender and lightly browned in spots, about 1 hour total. Remove from oven and allow to cool slightly. Discard thyme and carefully scrape flesh away from skin. Discard skin.\nMeanwhile, heat 2 more tablespoons olive oil in a large Dutch oven over medium-high heat until shimmering. Add onion and cook, stirring frequently, until completely tender and lightly browned, about 15 minutes total. Add cooked squash flesh along with garlic cloves. Stir to combine. Add carrot juice and just enough water to submerge everything. Bring to a boil then remove from heat.\nTransfer soup to a blender (if necessary, work in two batches). Start blender and slowly increase speed to high. With blender running, slowly drizzle in remaining olive oil. Continue blending until completely smooth and creamy. Season to taste with salt and pepper.\nReheat soup until simmering and serve immediately, garnishing with additional extra-virgin olive oil, chopped parsley, toasted pumpin or squash seeds, and toasted croutons drizzled with extra-virgin olive oil.\nSpecial Equipment\nDutch oven\n,\nblender\n,\njuicer\n(see notes)\nNotes\nYou can use bottled store-bought carrot juice, but I prefer freshly juiced carrots. 4 pounds of carrots will get you about 1 1/2 quarts of juice.\nSoups\nVegan\nCarrots\nWinter Squash\nFall Sides"
}