{
  "url": "https://www.seriouseats.com/roasted-carrots-harissa-creme-fraiche-food-lab-recipe",
  "image_url": null,
  "tags": [
    "Vegetable Sides",
    "Gluten-free Sides",
    "Vegetarian Sides",
    "Roasted Vegetables",
    "Carrots"
  ],
  "title": "Roasted Carrots With Harissa and Crème Fraîche Recipe",
  "full_text": "Roasted Carrots With Harissa and Crème Fraîche Recipe\nJump to recipe\nCook\n45 mins\nActive\n20 mins\nDrying Time\n5 mins\nTotal\n50 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n) medium\ncarrots\n, ends trimmed, quartered lengthwise and cut into 3-inch segments\nKosher salt\n1/4\ncup\n(\n60\nml\n)\ncrème fraîche\n2\ntablespoons\n(\n30\nml\n)\nharissa paste\n(see notes)\n1/2\nteaspoon\nground cumin\n1/2\nteaspoon\nfreshly\nground black pepper\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n2\ntablespoons\nfinely\nchopped fresh cilantro\nleaves\nDirections\nAdjust oven rack to center position and preheat oven to 375°F. Place carrots in a large pot, cover with water, and season heavily with salt. Heat over high heat until boiling. Reduce to a simmer and cook until barely tender, about 5 minutes. Drain and allow to dry for 5 minutes. Set aside. Season crème fraîche with salt to taste and refrigerate until ready to use.\nCombine harissa, cumin, black pepper, and olive oil in a large bowl. Season to taste with salt. Transfer half of mixture to small bowl and set aside. Add carrots to remaining mixture and toss to coat. Transfer to foil-lined rimmed baking sheet and spread out in an even layer. Roast until caramelized, about 40 minutes, turning once or twice during roasting. Transfer carrots to a large bowl and toss with cilantro.\nSpread crème fraîche on serving platter. Top with carrots and drizzle with remaining harissa mixture. Serve immediately.\nSpecial equipment\nRimming baking sheet, large pot\nNotes\nHarissa is a North African chili paste that can found in specialty markets or ordered online.\nThis Recipe Appears In\nHow to Roast Carrots and Parsnips\nHow to Roast Fall and Winter Vegetables | The Food Lab\nVegetable Sides\nGluten-free Sides\nVegetarian Sides\nRoasted Vegetables\nCarrots"
}