{
  "url": "https://www.seriouseats.com/roasted-delicata-squash-5209890",
  "image_url": "https://www.seriouseats.com/thmb/JCArRtO-f6PT0rVsjnlBt4WSz0U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2024112-SEA-Roast-DelicataSquash-MorganHuntGlaze-Hero1-30-f44cf0cae0f540038b1a5c65ecb28dee.jpg",
  "tags": [
    "Winter Squash",
    "Vegetable Guides",
    "Roasted Vegetables",
    "Fall",
    "Winter"
  ],
  "title": "How to Roast Delicata Squash",
  "full_text": "How to Roast Delicata Squash\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\ndelicata squash\n(about\n2\npounds\n,\n907\ng\ntotal), washed and dried\n2\ntablespoons\n(\n28\ngrams\n)\nunsalted butter\n, melted\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n1/2\nteaspoon\nfreshly\nground black pepper\nDirections\nAdjust oven rack to lowest position and preheat oven to 425°F (218°C).\nTrim both ends of each delicata squash. Stand one squash up on the larger cut side and, using a chef’s knife, slice it lengthwise, down through the center of the squash, creating two even halves. Use a soup spoon to scrape out and discard seeds and any fibrous flesh. Repeat with second squash.\nSerious Eats / Morgan Hunt Glaze\nPlace all 4 squash halves cut-side down on a large cutting board. Cut each squash half crosswise into 1-inch-thick slices. Transfer slices to large bowl. Add melted butter, salt, and pepper, and toss to evenly coat squash slices.\nSerious Eats / Morgan Hunt Glaze\nTransfer squash slices to a rimmed baking sheet, arranging them around the perimeter of the sheet with an even amount of space between each slice. Roast until squash slices are golden brown on the bottom, about 12 minutes. Use kitchen tweezers or tongs to flip each slice. Rotate baking sheet 180 degrees, return it to oven, and continue to roast until second side is golden brown, about 10 minutes. Remove sheet from oven, transfer squash slices to a platter, and serve.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\nHeavy-duty rimmed baking sheet\n,\nkitchen tweezers\nor\ntongs\n.\nNotes\nIt's important to use medium delicata squash for this recipe, about 1 pound each, so there aren't too many slices crowding the baking sheet and inhibiting browning. If you want to make a larger batch, use two trays and roast them one at a time.\nMake-Ahead and Storage\nRoasted delicata can be served hot, at room temperature, or cold. Leftovers straight from the refrigerator can be used for cold salads, or reheated gently in a skillet with a little extra butter.\nRead More\nHow to Roast Butternut Squash\nHow to Roast Spaghetti Squash\nRoasted Delicata Squash and Kale Salad With Hazelnut-Parmesan Crumble\nWinter Squash\nVegetable Guides\nRoasted Vegetables\nFall\nWinter"
}