{
  "url": "https://www.seriouseats.com/roasted-tomato-and-caper-spread",
  "image_url": "https://www.seriouseats.com/thmb/U-Sg_TXP6TPkL4IQW30Mf5stHS8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__07__20180711-tomato-spread-vicky-wasik-19--395eef52ff09490884c6bf160b3cf736.jpg",
  "tags": [
    "Italian",
    "Dairy-free",
    "Gluten-free",
    "Vegan",
    "Vegetarian"
  ],
  "title": "Roasted-Tomato and Caper Spread Recipe",
  "full_text": "Roasted-Tomato and Caper Spread Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n4 hrs 10 mins\nActive\n45 mins\nTotal\n4 hrs 15 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\nextra-virgin olive oil\n(\n6\nounces\n;\n170\ng\n), divided\n4\npounds\nRoma (plum) tomatoes\n(\n1.8\nkg\n; about\n18\nmedium\n)\n4 to 6\nmedium\ncloves garlic\n, thinly sliced\n8 to 10\nsprigs\nfresh thyme\n1/4\ncup\ncapers\n(\n2\nounces\n;\n60\ng\n), drained\n1\nteaspoon\ndried basil\nKosher salt\nand freshly ground black pepper\nDirections\nGetting Started:\nLine 2 rimmed baking sheets with parchment paper and set 2 wire cooling racks into the sheets. Brush wire racks with 1 tablespoon extra-virgin olive oil. Adjust 2 oven racks to the upper- and lower-middle positions and preheat oven to 250°F (120°C). Fill a large stockpot with water and bring to a boil. Fill a large bowl with ice and water to make an ice bath.\nTo Blanch the Tomatoes:\nUsing a small\nparing\nor\ntourné knife\n, remove the core from the stem end of each tomato. On the opposite end, carve a small\nx\nthrough the skin of each tomato. Working with small batches of 4 to 5 at a time, drop tomatoes into the boiling water and blanch until you see the skin pulling away from the flesh in the area where each tomato is scored, about 30 seconds to 1 minute. Transfer tomatoes to ice bath to halt the cooking and continue until all the tomatoes are blanched.\nUsing a small paring knife, tourné knife, or your hands, peel tomatoes. Cut tomatoes in half lengthwise and arrange them, cut side up, on oiled wire racks. Brush cut sides of tomatoes with 3 tablespoons extra-virgin olive oil. Place a slice of garlic on each tomato half. Scatter sprigs of thyme across tomatoes.\nPlace trays of tomatoes in the oven and bake until each tomato half has reduced to a quarter of its size. They should remain more plump than sun-dried tomatoes, still jammy in the center. Depending on the air circulation in your oven and how juicy the tomatoes are to start, this can take anywhere from 4 to 8 hours. The total weight of the tomatoes after cooking will drop from 4 pounds (1.8kg) to about 14 ounces (400g).\nTo Make the Spread:\nDiscard garlic and thyme from roasted tomatoes. In a\nfood processor\n, pulse together roasted tomatoes, capers, and dried basil. Stir in remaining 1/2 cup olive oil and season with kosher salt and freshly ground pepper to taste. Serve with bread, tossed with pasta or vegetables, or alongside grilled meats. The spread will keep in the refrigerator for 1 week or in the freezer for 6 months.\nSpecial equipment\nRimmed baking sheets\n,\nwire racks\n, pastry brush, food processor, stockpot\nThis Recipe Appears In\nThis Tomato and Caper Spread Is a Taste of Summer, Whenever You Like\nItalian\nDairy-free\nGluten-free\nVegan\nVegetarian"
}