{
  "url": "https://www.seriouseats.com/roasted-frozen-sweet-potatoes-with-whipped-creme-fraiche-and-granola-recipe-5210232",
  "image_url": "https://www.seriouseats.com/thmb/xcZuTsTjYBtc25KHtFgxRoG-_8E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211001-frozen-sweet-potatoes-vicky-wasik-8-555d24bc9bae45bca39aee04da136f49.jpg",
  "tags": [
    "Sweet Potatoes",
    "Thanksgiving"
  ],
  "title": "Roasted Frozen Sweet Potatoes With Whipped Crème Fraîche and Granola",
  "full_text": "Roasted Frozen Sweet Potatoes With Whipped Crème Fraîche and Granola\nClose\nJump to recipe\nCook\n2 hrs 40 mins\nFreezing Time\n6 hrs\nTotal\n8 hrs 40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nmedium\nsweet potatoes\n(about\n1\npound\n;\n450\ng\neach), scrubbed (see note)\n1\ncup\n(\n240\nml\n)\nheavy cream\n1/4\ncup\n(\n60\ng\n)\ncreme fraiche\n4\nteaspoons\n(\n15\ng\n)\nconfectioners' sugar\n1/2\nteaspoon\nvanilla extract\n1\npinch\nground ginger\n1\npinch\nground cinnamon\n1\npinch\nkosher salt\nHomemade\nor store-bought\ngranola\n, for topping\nDirections\nPlace sweet potatoes in freezer until frozen solid, at least 6 hours and up to 3 months.\nVicky Wasik\nLine a rimmed baking sheet with aluminum foil. Wrap each frozen sweet potato in aluminum foil and seal tightly so that there are no loose seams. Place wrapped sweet potatoes on prepared baking sheet and place in oven. Set oven to 300°F (150°C). Roast until a thin skewer inserted into potatoes meets no resistance, about 2 hours. (Note that roasting times may vary significantly depending on the size and shape of the sweet potatoes.)\nRemove baking sheet from oven and carefully unwrap potatoes; discard aromatics, if using. Increase oven temperature to 450°F (232°C) and return unwrapped sweet potatoes to oven. Roast until sweet potatoes are fragrant and sugars begin to caramelize, about 40 minutes. Let roasted sweet potatoes stand until cool enough to handle.\nVicky Wasik\nWhile sweet potatoes cook, using a stand mixer fitted with the whisk attachment, whip the heavy cream with the crème fraîche, confectioners' sugar, vanilla, ginger, cinnamon, and salt until soft peaks form; alternatively, hand-whisk the ingredients in a large mixing bowl until soft peaks form.\nVicky Wasik\nSplit open the sweet potatoes and arrange on plates. Spoon the whipped crème fraîche on top and sprinkle granola over. Serve immediately.\nVicky Wasik\nSpecial Equipment\nStand mixer (optional), rimmed baking sheet.\nNotes\nThis recipe works equally well with dry or moist sweet potato varieties. Dry sweet potatoes such as Okinawan purple or Hannah varieties will be fluffy and less sweet. Moist sweet potatoes such as Jewel, Garnet, or Beauregard varieties will taste juicier and sweeter. My favorite, however, are the purple fleshed varieties that are small, roast quickly, and end up sweeter and fluffier due to their higher moisture content.\nIt is possible to speed this recipe up by partially freezing the sweet potatoes for at least 45 minutes; you will still get some of the benefit of the freezing process. You can also speed up the cooking time by freezing and then thawing the potatoes prior to roasting. Once thawed, you’ll notice that the sweet potato is entirely soft, almost as if it’s already been cooked; fully thawed sweet potatoes will take about 45 minutes at 450°F (230°C).\nMake-Ahead and Storage\nFrozen sweet potatoes can remain in the freezer for 10-12 months. However, sweet potatoes frozen for overnight or longer will either need to be thawed for at least 30 min prior to roasting or roasted for longer until the flesh is totally soft.\nFully roasted sweet potatoes can also be frozen after roasted and eaten cold.\nSweet Potatoes\nThanksgiving"
}