{
  "url": "https://www.seriouseats.com/roast-beef-sandwich-recipe-8605323",
  "image_url": "https://www.seriouseats.com/thmb/eNrpxVXCKDZawWxxBtpAwksoagE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240312-RoastBeef-KevinWhite-20-24524b393e2c4792b65beb876b3566c8.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "American",
    "Roasted Beef",
    "Beef"
  ],
  "title": "Roast Beef Sandwich",
  "full_text": "Roast Beef Sandwich\nClose\nJump to recipe\nPrep\n5 mins\nCook\n105 mins\nDry-Brining and Cooling Time\n2 hrs\nTotal\n3 hrs 50 mins\nServes\n6\nMakes\n6 Sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Roast Beef (See Notes):\n1\n(\n3-pound; 1.4 kg\n) boneless\ntop round roast\nor eye round roast, trimmed and tied at 1-inch intervals (see notes)\n4\nteaspoons\n(\n12\ng\n) Diamond Crystal\nkosher salt\n; if using table salt use half as much by volume or the same weight\n1\nteaspoon\nfreshly\nground black pepper\n1\ntablespoon\n(\n15\nml)\nvegetable oil\nFor the Sandwiches:\n3\ntablespoons\nunsalted butter\n6\nKaiser rolls or\nBulkie rolls\n, split open, (see notes)\n12\nslices\nAmerican cheese\n, or another mild sliced cheese, such as cheddar, optional\nMayonnaise\n(optional)\nHomemade or store-bought\nbarbecue\nsauce or another sauce of your choice (optional)\nOptional\ntoppings\nDirections\nFor the Roast Beef:\nSprinkle roast evenly with the salt and pepper and refrigerate on a wire rack set in a rimmed baking sheet uncovered for at least 1 hour or up to 24 hours.\nSerious Eats / Kevin White\nAdjust oven rack to center position and preheat oven to 225°F (105°C). Place baking sheet with rack and beef in oven and roast until internal temperature registers 115°F (46°C) on an instant-read thermometer at the thickest point, about 1 to 1 1/2 hours.\nJust before the roast comes out of the oven, add oil to a 12-inch stainless steel, or cast iron, or carbon steel skillet and heat over high heat until smoking. Add roast to skillet and cook, using tongs and moving roast as needed, until roast is evenly browned on all sides, and internal temperature registers 125°F (50°C), 5 to 7 minutes.\nSerious Eats / Kevin White\nTransfer the roast to a large plate and let cool completely, about 1 hour (if time allows, refrigerate the roast whole until well chilled, at least 2 hours and up to 1 day).\nSerious Eats / Kevin White\nSlice the roast as thin as possible against the grain.\nSerious Eats / Kevin White\nFor the Sandwiches:\nIn a 12-inch stainless steel or cast iron skillet, melt 2 tablespoons butter over medium heat until just melted. Add 2 bun bottoms and 2 bun tops, cut side down, and cook, swirling bread around the skillet frequently, until toasted evenly on one bottom, about 3 minutes. Transfer buns, toasted side up, to a plate and while still hot, add a slice of cheese to each top and bottom. Repeat with remaining 1 tablespoon butter, remaining bun halves, and remaining cheese.Transfer to a plate.\nSerious Eats / Kevin White\nSpread a thin layer of mayonnaise, if using, over bun bottoms. Divide the sliced roast beef and mound it evenly on the roll bottoms (about 6 ounces beef per sandwich). Spread barbecue sauce, if using, or your preferred sauce over the beef and add your favorite toppings. Close sandwiches with bun tops and serve.\nSerious Eats / Kevin White\nSpecial Equipment\n12-inch stainless steel or cast iron or carbon steel skillet\nNotes\nIf your top round roast has a fat cap on it, trim the fat cap to 1/4 inch thick.\nThe cooler the roast is, the easier it will be to slice the beef as thin as possible. If time allows, I recommend making the roast up to a day ahead and refrigerating the roast until chilled, at least 2 hours, before removing the twine and slicing for sandwiches.\nMake-Ahead and Storage\nThe cooked roast beef can be refrigerated in an airtight container for up to 4 days.\nSandwiches\nThe Latest\nAmerican\nRoasted Beef\nBeef"
}