{
  "url": "https://www.seriouseats.com/rocky-road-recipe-8752535",
  "image_url": "https://www.seriouseats.com/thmb/VCTcOKghhXrnpUq0Syy6gNU43xs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241121-SEA-RockyRoad-DeliStudios-Hero3-39-27b8ddf06ca14d9681695908b8f9ab7a.jpg",
  "tags": [
    "Candy",
    "The Latest",
    "British",
    "Dessert Bars"
  ],
  "title": "Rocky Road",
  "full_text": "Rocky Road\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nCooling and Chilling Time\n2 hrs 15 mins\nTotal\n2 hrs 30 mins\nServes\n36 slices\nMakes\n1 8- by 8-inch pan\nCook Mode\n(Keep screen awake)\nIngredients\nNonstick\ncooking spray\n200\ng\nmilk chocolate\n, coarsely chopped (\n7\nounces\n; about\n1 1/3\ncups\n)\n100\ng\ndark chocolate\n, coarsely chopped (\n3 1/2\nounces\n; about\n2/3\ncup\n)\n113\ng\nunsalted butter\n, softened (\n4\nounces\n;\n8\ntablespoons\n)\n3\ntablespoons\n(\n60\ng\n)\ngolden syrup\nor light corn syrup\n10\ndigestive biscuits\n, crushed (\n5 1/4\nounces\n;\n150\ng\n), see notes\n100\ng\nmini marshmallows\n(\n3 1/2\nounces\n;\n2\ncups\n)\n50\ng\nglacé cherries\n, quartered (\n1 3/4\nounces\n;\n1/3\ncup\n)\n25\ng\n(about\n2\ntablespoons\n) chopped\nwhite chocolate\n(optional)\nDirections\nUsing nonstick spray, grease an 8- by 8-inch aluminum pan. Line pan with two 8-inch wide strips of parchment paper so that all sides are covered with a 1-inch overhang. Using nonstick cooking spray, grease parchment. Set aside.\nSerious Eats / Deli Studios\nIn a large heatproof bowl, combine milk chocolate and dark chocolate. Set over a large saucepan filled with 1 inch of simmering water and heat, stirring occasionally, until chocolate is fully melted and combined, about 5 minutes. (To melt chocolate in the microwave, see instructions in the notes below.) Add butter and golden syrup or corn syrup to bowl of melted chocolate and whisk until smooth and creamy with no visible pieces of butter remaining, 30 to 45 seconds. Remove from heat. Cool at room temperature until chocolate is no longer hot to the touch but still warm, about 15 minutes.\nSerious Eats / Deli Studios\nUsing a flexible spatula, fold digestive biscuits, marshmallows, and cherries into chocolate until fully incorporated and pieces are completely covered in chocolate. Scrape into prepared pan. Using a flexible or offset spatula, spread mixture evenly across the entire pan, pushing down gently until mixture flattens slightly and surface is relatively smooth, with no jagged biscuit pieces poking out. Cover tightly with foil or plastic wrap and refrigerate until chocolate has set and rocky road is firm to the touch, 1 1/2 to 2 hours.\nSerious Eats / Deli Studios\nIf drizzling with white chocolate:\nPlace white chocolate in a small microwave-safe bowl. Heat on medium-low power until chocolate is melted, about 1 minute, using a heat-proof flexible spatula to stir every 15 seconds. Allow chocolate to cool slightly, about 1 minute, then transfer to a piping bag or plastic zip-top bag. Cut a small hole in the tip of the piping bag and pipe a thin drizzle over chilled rocky road. Refrigerate until white chocolate has set, about 10 minutes.\nSerious Eats / Deli Studios\nLift parchment overhang to gently remove slab of rocky road from the pan. Place on a cutting board and, using a sharp knife, cut bars into 36 squares, about 1 1/4- by 1 1/4-inches each, or desired shape. Serve immediately, or refrigerate, tightly covered with foil or plastic wrap, until ready to serve.\nSerious Eats / Deli Studios\nSpecial Equipment\n8- by 8-inch aluminum pan, parchment, flexible spatula, large saucepan or microwave, a piping bag or plastic zip-top bag (if drizzling with white chocolate)\nNotes\nTo crush the digestive biscuits, place them in a sealed zip-top bag. Using a kitchen mallet, rolling pin, or your hands, gently bash the bag to break biscuits into pieces of assorted shapes and sizes no larger than 1 inch.\nTo melt the chocolate in a microwave, place milk chocolate and dark chocolate in a large microwave-safe bowl. Heat on medium-low power until completely melted, about 3 minutes, using a heat-proof flexible spatula to stir every 30 seconds.\nMake-Ahead and Storage\nRocky road can be refrigerated in an airtight container for up to 5 days. Allow refrigerated rocky road to stand at room temperature until soft enough to slice, about 20 minutes.\nCandy\nThe Latest\nBritish\nDessert Bars",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rocky-road.webp?"
}