{
  "url": "https://www.seriouseats.com/roman-fried-salt-cod-recipe-8757868",
  "image_url": "https://www.seriouseats.com/thmb/Yodp2_ggbulLiBVfSCoiDu7Q-OE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-filetti-di-baccala-vicky-wasik-hero-15623380d7344eedadeb568c1c3b13f8.jpg",
  "tags": [
    "Fish",
    "Italian",
    "Frying",
    "Cod"
  ],
  "title": "Filetti di Baccalà (Roman-Style Fried Salt Cod Fillets)",
  "full_text": "Filetti di Baccalà (Roman-Style Fried Salt Cod Fillets)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nSalt Cod Soak\n72 hrs\nTotal\n72 hrs 40 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Salt Cod:\n1\npound\n(\n454\ng\n) skinless salt\ncod fillets\n, in large pieces\nFor Frying:\n2 quarts (2L)\nvegetable oil\n, for frying\n1 cup\nall-purpose flour\n(4 1/2 ounces;\n130\ng\n)\n1/2 cup\ncornstarch\n(2 1/2 ounces;\n70\ng\n)\n1\nteaspoon\nbaking powder\n3/4 cup plus 2 tablespoons (\n210\nml\n) chilled\nsparkling water\n1/4 cup (\n60\nml\n)\nvodka\nKosher salt\nLemon\nwedges, for serving\nDirections\nThree Days Before Frying, for the Salt Cod:\nRinse salt cod under cold running water until any salt on its surface is washed away. Transfer to a large container and cover with fresh water. Refrigerate for 72 hours, changing the water several times during that period, ideally at least twice a day. (Longer soaking will temper the saltiness of the fish, but keep in mind that salt cod will and should always be somewhat salty.)\nSerious Eats / Vicky Wasik\nDrain salt cod, rinse under cold water, and pat dry with paper towels. Using a sharp knife, portion fillets into pieces that are 6 inches long, and 1 1/2 to 2 inches wide (it’s fine if pieces are slightly smaller or larger).\nSerious Eats / Vicky Wasik\nWhen Ready to Cook, for Frying:\nAdjust oven rack to middle position and preheat oven to 200°F (95°C). Set a wire rack inside a rimmed baking sheet and line with paper towels. In a large Dutch oven, heat oil over medium-high heat to 375°F (190°C).\nMeanwhile, in a large bowl, whisk together flour, cornstarch, and baking powder until well-combined. Add sparkling water and vodka and, using chopsticks, stir until a batter just forms. Don’t over-mix; a few lumps of flour are fine.\nSerious Eats / Vicky Wasik\nAdd half of the salt cod to batter. If you have a mixture of thick fillets and thin tail pieces, keep them separate and batter the thick fillets first. Submerge pieces to evenly coat them in batter. Working with one piece at a time, lift cod from batter, allowing any excess batter to drip back into the bowl, and carefully add to hot oil, lowering it gently from as close to the oil’s surface as possible to minimize splashing; repeat with remaining battered pieces of cod. Fry cod, turning occasionally, until batter is golden brown and crisp on all sides, 5 to 6 minutes for thin tail pieces, 7 to 8 minutes for thick fillets. Using a spider skimmer or slotted spoon, transfer cod to prepared wire rack, season very lightly with salt, and transfer to oven to keep warm.\nSerious Eats / Vicky Wasik\nSkim any browned bits of batter from oil and discard. Return oil to 375°F (190°C), and repeat steps 5 and 6 with remaining cod. Transfer to a serving platter lined with parchment or butcher paper and serve immediately with lemon wedges.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRimmed baking sheet\nand\nwire rack\n; spider skimmer or slotted spoon;\nDutch oven\n;\ninstant-read thermometer\n.\nMake-Ahead and Storage\nThe salt cod needs to be soaked three days in advance. The fried fillets are best enjoyed immediately.\nFish\nItalian\nFrying\nCod"
}