{
  "url": "https://www.seriouseats.com/roman-style-spaghetti-alla-carrettiera-tomato-tuna-and-mushroom-pasta",
  "image_url": "https://www.seriouseats.com/thmb/VJfa-LDjjl9KZ5cmlNHgBFdZ9mU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__03__20200224-carretteira-pasta-vicky-wasik-21-ffe68515b25f4b348cbde845a59d6a62.jpg",
  "tags": [
    "Italian",
    "Spaghetti, Bucatini, & Linguine",
    "Tuna",
    "Porcini Mushrooms",
    "Tomato"
  ],
  "title": "Roman-Style Spaghetti Alla Carrettiera (Tomato, Tuna, and Mushroom Pasta) Recipe",
  "full_text": "Roman-Style Spaghetti Alla Carrettiera (Tomato, Tuna, and Mushroom Pasta) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n30 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\nounces\n(\n40\ng\n)\ndried porcini mushrooms\n1\ncup\n(\n235\nml\n) boiling\nwater\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n, divided, plus more for finishing pasta\n4\nmedium\ncloves garlic\n, minced\nLarge\npinch\nred pepper flakes\n1/4\ncup\nplus\n1\ntablespoon\nfinely minced\nfresh parsley\nleaves and tender stems, divided, plus more for garnish\n1\n(\n28-ounce; 795 g) can\nwhole peeled tomatoes with liquid\n, thoroughly crushed\n1\n(\n5-ounce; 140 g\n)\nolive oil-packed tuna\n, preferably ventresca (tuna belly; see notes), oil reserved\nKosher salt\n1\npound\n(\n450\ng\n)\ndried spaghetti\nDirections\nIn a small heatproof bowl or measuring cup, soak mushrooms in boiling water until fully softened, about 20 minutes. Using a slotted spoon, remove mushrooms from soaking liquid and squeeze out excess moisture back into the bowl or measuring cup. Reserve rehydrated mushrooms and 1/4 cup (60ml) soaking liquid, making sure to dispose of any grit that has settled at the bottom.\nIn a 5-quart pot, combine 1/4 cup (60ml) olive oil, garlic, pepper flakes, and 1 tablespoon minced parsley. Set over medium heat and cook, stirring frequently, until very fragrant and garlic is just beginning to turn the lightest shade of gold, about 3 minutes.\nAdd mushrooms and cook, stirring, until lightly sautéed and fragrant, about 1 minute.\nAdd reserved 1/4 cup (60ml) mushroom soaking liquid, tomatoes, and 2 tablespoons (30ml) reserved tuna oil (if your tuna doesn't have that much oil, just add as much as it does), and bring to a simmer. Season with salt.\nIn a pot of salted, boiling water, cook spaghetti, stirring frequently, until just shy of al dente, about 1 minute less than package recommends. While spaghetti is cooking, flake tuna into pasta sauce.\nUsing tongs, transfer spaghetti directly into simmering sauce along with 1/4 cup (60ml) pasta cooking water, stirring to combine. Cook, stirring, until pasta is al dente and sauce has thickened, so it coats noodles and isn't watery, about 3 minutes. Add remaining 1/4 cup minced parsley and 1/4 cup (60ml) olive oil, stirring vigorously to combine. If sauce is too thick, add more olive oil or pasta water, 1 tablespoon at a time, stirring well between additions, until desired sauce consistency is reached. Taste for seasoning, adding more salt if necessary.\nTransfer to warmed plates and sprinkle with minced parsley. Serve right away.\nSpecial Equipment\n5-quart pot or\nDutch oven\nNotes\nMost cans of tuna in the United States come in 5-ounce sizes while Tonnino, one of the most common brands of ventresca (belly) tuna, is sold in 6.7-ounce jars; you can use either here, but if you use the larger size jar of ventresca, you should still use all of the tuna in it (it's not as densely packed as the canned, so the actual amount of tuna is quite similar).\nMake-Ahead and Storage\nThe sauce can be made in advance and refrigerated up to 3 days, but it's best when made right before serving.\nRead More\nSicilian-Style Spaghetti Alla Carrettiera (Fresh Tomato and Garlic Sauce)\nItalian\nSpaghetti, Bucatini, & Linguine\nTuna\nPorcini Mushrooms\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/roman-style-spaghetti-alla-carrettiera-tomato-tuna-and-mushroom-pasta-recipe.webp?"
}