{
  "url": "https://www.seriouseats.com/roman-rice-stuffed-tomatoes-pomodori-al-riso",
  "image_url": "https://www.seriouseats.com/thmb/EzFBJfJezSBxJTkbEoB9ouSQq04=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__09__20190903-pomodoro-al-riso-joel-russo48-6bf552cb43a14a55bff349841e995f9e.jpg",
  "tags": [
    "Tomato",
    "Vegetarian",
    "Summer Mains",
    "Italian",
    "Roasted Vegetables"
  ],
  "title": "Pomodori al Riso (Roman Rice-Stuffed Tomatoes)",
  "full_text": "Pomodori al Riso (Roman Rice-Stuffed Tomatoes)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n90 mins\nActive\n20 mins\nCooling Time\n10 mins\nTotal\n110 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n675\ng\n)\nYukon Gold potatoes\n, peeled and cut into 1-inch pieces\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, divided\n1\nsprig\nfresh rosemary\n, cut into\n3\npieces\nKosher salt\nand freshly ground black pepper\n6\nbeefsteak tomatoes\n(\n8 to 10 ounces\neach;\n225 to 285 g\n)\nHomemade chicken stock\nor\nlow-sodium broth\nor\nvegetable stock\n, if needed\n1\nlarge\nshallot\n(\n50\ng\n), minced\n1\nmedium\ngarlic clove\n(\n5\ng\n), minced\n3/4\ncup\n(\n6\nounces\n;\n165\ng\n)\nrisotto rice\n, such as arborio or carnaroli (see note)\n1\ntablespoon\n(\n15\ng\n)\ntomato paste\n1 to 2\nteaspoons\n(\n5 to 10\nml\n)\nfish sauce\n, such as\ncolatura\n(optional; see note)\n1/2\nounce\nfresh\nbasil leaves\n(\n1\nloosely packed\ncup\n;\n15\ng\n), roughly chopped\nDirections\nAdjust oven rack to upper-middle position and preheat oven to 375°F (190°C). In a large baking dish, combine potatoes, rosemary, and 2 tablespoons (30ml) olive oil. Season with salt and pepper, then toss to combine. Spread potatoes in an even, single layer. Roast until a knife meets little resistance when inserted into a piece of potato, about 30 minutes. Set baking dish aside to cool; keep oven on.\nSerious Eats / Joel Russo\nMeanwhile, using a sharp knife, cut top 1/2 inch off stem end of tomatoes and set aside. Carefully run knife along the cavity of the tomato to loosen core and pulp, then use a spoon to carefully scoop them out into a bowl. Repeat with remaining tomatoes. Season insides of tomatoes and their tops with salt, and place them upside down on a wire rack set inside a rimmed baking sheet. Set tomatoes aside.\nSerious Eats / Joel Russo\nUsing a food mill, pass reserved tomato pulp into a non-reactive container; discard seeds. (Alternatively, you can blend the tomato pulp with a food processor or blender, though it'll retain some seeds and will be a lighter color due to incorporated air.) Measure yield of tomato pulp by transferring it to a liquid measuring cup; you should have about 2 1/4 cups (530ml); if you don't have that much, add low-sodium chicken broth or vegetable stock to reach that volume.\nSerious Eats / Joel Russo\nIn a 3-quart stainless steel saucier, heat 1 tablespoon (15ml) olive oil over medium heat until shimmering. Add shallots, season lightly with salt, and cook, stirring frequently with a rubber spatula, until shallots are softened but not browned, about 3 minutes. Add garlic and continue to cook, stirring frequently, until garlic is softened as well, about 1 minute longer.\nSerious Eats / Joel Russo\nAdd rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 2 to 3 minutes. (Rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center.) Stir in tomato paste and continue to cook, stirring, until tomato paste evenly coats rice mixture and turns rust-colored, about 1 minute longer.\nAdd tomato pulp, increase heat to medium-high, and cook rice at a steady simmer, stirring frequently, until rice is just beginning to soften, about 10 minutes. Remove from heat, stir in fish sauce (if using) and basil, and season with salt.\nSerious Eats / Joel Russo\nBlot tomato cavities with paper towels, then nestle them into potatoes in baking dish so that they remain upright. Fill tomatoes with rice mixture, set tops on tomatoes, and drizzle with remaining 1 tablespoon (15ml) of olive oil.\nSerious Eats / Joel Russo\nRoast tomatoes until they are very tender and rice is cooked through, 25 to 30 minutes. Turn oven to broil, remove tops from tomatoes (keeping them in baking dish) to expose rice, and broil until rice and potatoes are lightly charred and crispy, 5 to 7 minutes (keep a close eye as broiler intensity can vary significantly from one oven to the next). Remove baking dish from oven, and let cool for at least 10 minutes. Serve warm or at room temperature.\nSerious Eats / Joel Russo\nSpecial Equipment\nFood mill\n,\nwire rack-lined baking sheet\n,\n3-quart saucier\n,\nsilicon spatula\n,\nbaking dish\nNotes\nThe amount of rice used in this recipe can be adjusted to the yield of passed tomato pulp. You are looking for a 3:1 liquid-to-rice ratio, by volume.\nFish sauce intensifies the savory richness of the cooked tomato pulp in the rice. It can be omitted to keep the dish vegan.\nMake-Ahead and Storage\nThis late summer dish is best served warm or at room temperature, so it can be made ahead of time, and either stored at room temperature if serving the same day, or covered and refrigerated for up to 2 days. Bring to room temperature before serving.\nTomato\nVegetarian\nSummer Mains\nItalian\nRoasted Vegetables"
}