{
  "url": "https://www.seriouseats.com/roman-mixed-green-salad-misticanza-recipe",
  "image_url": "https://www.seriouseats.com/thmb/VhQzaesSC-BK5oU-KSlUxv0X6qM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__08__20170713-misticanza-wild-greens-salad-vicky-wasik-11-8eeac76c410f4b51a49c067684378f44.jpg",
  "tags": [
    "Green Salads",
    "Italian",
    "Dairy-free Salads",
    "Gluten-free Salads",
    "Vegan Salads"
  ],
  "title": "Roman-Inspired Mixed-Green Salad (Misticanza alla Romana)",
  "full_text": "Roman-Inspired Mixed-Green Salad (Misticanza alla Romana)\nClose\nJump to recipe\nPrep\n10 mins\nActive\n15 mins\nTotal\n10 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nAbout\n8\ncups\nwild and/or cultivated\nleafy greens\nand tender fresh herbs, such as lettuces, chicory, endive, radicchio, dandelion, purslane, frisée, kale, fennel fronds, parsley, tarragon, chervil, basil, mint, and more, preferably grown locally and at peak season and freshness (see note)\nExtra-virgin olive oil\nFresh lemon juice\nKosher or\nsea salt\nDirections\nPick over the leafy vegetables, discarding any wilted or damaged leaves. Cut lettuce leaves free of their cores, pick tender herbs from stems, and quarter, core, and slice tight leafy heads like radicchio and endive. Wash everything in several changes of water until no dirt or grit remains. Dry well in a salad spinner.\nIn large serving bowl, gently toss salad with just enough olive oil to gently coat leaves. Add splash of lemon juice and salt to taste, tossing to combine. Serve.\nSpecial Equipment\nSalad spinner\nNotes\nThe key here is to use what you can get, and not try to force anything into the salad that won't be great. If you live near a farm stand or farmers market, that may be your best bet.\nIf not, or if it's not the right season, stick to hardy leafy vegetables and herbs like radicchio, endive, romaine, escarole, frisée, and baby kale.\nRead More\nHow to Make a Mixed-Green Salad Like You Actually Care\nPuntarelle Alla Romana (Puntarelle Salad With Anchovy and Garlic Dressing)\nPro Tips for Better Salads\n16 Side Salad Recipes to Complete Any Meal\nGreen Salads\nItalian\nDairy-free Salads\nGluten-free Salads\nVegan Salads"
}