{
  "url": "https://www.seriouseats.com/romesco-sauce-recipe",
  "image_url": null,
  "tags": [
    "Southern European",
    "Spanish",
    "Almonds",
    "Garlic",
    "Tomato"
  ],
  "title": "Romesco Sauce",
  "full_text": "Romesco Sauce\nJump to recipe\nPrep\n15 mins\nCook\n105 mins\nActive\n30 mins\nTotal\n2 hrs\nServes\n16 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2 or 3\nmedium\ntomatoes\n(\n5 1/5 ounces or 150 g\neach), cored (see note)\n1\nmedium\nhead garlic\n, unpeeled, split in half\n1\nounce\n(\n30\ng\n) dried ñora peppers (about\n4\npeppers\n) or\nancho chile peppers\n(about\n3\npeppers\n); (see note)\n1\nslice\ntoasted or stale\nbread\n(\n1 1/2\nounces\n;\n40\ng\n), any thick and heavy crusts removed, bread broken into small pieces\n1\ntablespoon\n(\n15\nml\n) red wine or\nsherry vinegar\n, plus more if desired\n1/2\ncup\nskinned and toasted\nalmonds\nand/or hazelnuts (\n2 3/4\nounces\n;\n80\ng\n); (see note)\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n, plus more if desired\nKosher salt\nDirections\nPreheat oven to 350°F (180°C). Line a rimmed baking sheet with aluminum foil and place tomatoes and half of garlic head on it. Roast in oven until tomatoes are wrinkled and lightly charred in spots and garlic is soft, about 1 hour. Let cool.\nSerious Eats / Vicky Wasik\nMeanwhile, place dried peppers in a medium heatproof bowl and cover with boiling water. Place a weight or wet paper towel on top to help submerge peppers. Let stand until peppers are fully softened, 30 minutes to 1 hour. If peppers are very stubborn (as thick-skinned ñoras can be), you may need to tear a small hole in them to let water penetrate inside.\nDrain peppers and discard stems and seeds. Using a\nparing knife\n, carefully scrape the flesh from the skins. Discard skins. Peel skins from tomatoes and roasted garlic.\nSerious Eats / Vicky Wasik\nTo Make Sauce Using a Mortar and Pestle:\nAdd 3 cloves roasted garlic and 1 or 2 cloves peeled raw garlic to mortar. (Feel free to make this recipe more or less garlicky, according to your own tastes, by adding or subtracting roasted or raw garlic.) Smash garlic to a paste with pestle.\nAdd bread and moisten with vinegar. Smash to a paste. Add nuts and smash as finely as you can. The mixture should have the consistency of a rough paste when you're done.\nSmash in scraped pepper flesh, followed by peeled roasted tomatoes. Mix in olive oil until thoroughly combined. Season with salt. Add more oil, 1 tablespoon (15ml) at a time, if a thinner, richer sauce is desired. Add more vinegar to taste as well.\nTo Make Sauce Using a Countertop Blender or Immersion Blender:\nAdd 3 cloves roasted garlic and 2 cloves peeled raw garlic to jar of blender, or blending container if using an immersion blender. (You can use more or less roasted and raw garlic, as desired, according to your own tastes.) Add nuts. Blend until finely processed, scraping down sides as necessary.\nBlend in peeled roasted tomatoes and scraped pepper flesh. Add bread, olive oil, and vinegar, and blend until smooth. (How smooth to make it is up to you; some texture is okay.) Season with salt and add more oil and vinegar to taste, if desired.\nTo Make Sauce Using a Food Processor:\nIn the bowl of a food processor, combine 3 cloves roasted garlic and 2 cloves peeled raw garlic (use more or less roasted and raw garlic, as desired, according to your own tastes), along with bread and nuts. Process, scraping down sides as necessary, until finely chopped.\nAdd peeled roasted tomatoes and scraped pepper flesh and process until a thick, rough paste forms. Process in olive oil and vinegar, then season with salt. Add more vinegar and olive oil, as desired, to adjust taste and texture.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nMortar and pestle\n,\nblender\n,\nimmersion blender\n, or\nfood processor\nNotes\nUsing three tomatoes instead of two will make a thinner, milder sauce.\nÑora peppers, with their earthy bitterness and molasses-like depth, are more traditional in this sauce. If you can't find them, ancho chile peppers are a good substitute.\nDifferent nuts will give the sauce different flavors. Almonds and hazelnuts are most traditional, but you can also try adding pine nuts or walnuts. Experiment to see what you like most.\nMake-Ahead and Storage\nRomesco sauce can be refrigerated in an airtight container for up to five days.\nRead More\nBurnt Eggplant and Bell Pepper Dip\nTyrokafteri (Hot Pepper and Cheese Dip)\nAjvar (Serbian Roasted Red Pepper Sauce)\nItalian Salsa Rossa (Tomato and Bell Pepper Sauce for Boiled Meats)\nYucatán-Style Hot Dried-Chile Salsa (K'uut Bi Ik)\nSouthern European\nSpanish\nAlmonds\nGarlic\nTomato"
}