{
  "url": "https://www.seriouseats.com/rosemary-lemonade-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/sBkPlSN7hAqhiPdgDE-L38jw7uY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110608-155992-sweettech-candied-zest-recipe-bf8668055c5843689c86b14496549c41.jpg",
  "tags": [
    "Cakes",
    "Lemon",
    "Rosemary"
  ],
  "title": "Rosemary Lemonade Cake Recipe",
  "full_text": "Rosemary Lemonade Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nActive\n45 mins\nCooling and Setting Time\n100 mins\nTotal\n2 hrs 45 mins\nServes\n12\nto 14 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\nbutter\n, softened\n2 1/2\ncups\nsugar\n, divided\n4\neggs\n, room temperature\n1/4\ncup\ncandied lemon peel\n, chopped, plus more, left whole, for garnish\n2\ntablespoons\nchopped\nrosemary\n, plus more for garnish\n3\ncups\nall purpose flour\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1\nteaspoon\nsalt\n1\nteaspoon\nvanilla extract\n1\ncup\nplain yogurt\n, room temperature\n3/4\ncup\nlemon juice\n, strained and divided\nDirections\nPreheat oven to 350 degrees. Grease two 8 inch round cake pans, or two loaf pans and line with parchment.\nIn a small bowl, whisk together flour, baking soda, and baking powder. Set aside.\nCream butter and 2 cups of the sugar together for 3-4 minutes, until very light and fluffy.\nAdd eggs one at a time and beat well after each addition, scraping down the sides of the bowl as you go.\nAdd the vanilla, rosemary, candied zest, and salt. Beat well for 15 seconds, then scrape down the sides and beat for an additional 15 seconds.\nWith the mixer on low speed, add the dry ingredients to the bowl in two additions, alternating with the yogurt. Mix until just incorporated.\nAdd 1/2 cup of the lemon juice and mix until just incorporated. Scrape down sides of the bowl and mix for five seconds. Divide the batter evenly between the two pans.\nBake at 350 for 40-45 minutes, rotating halfway through, until the cake is golden brown and a cake tester or toothpick comes out clean.\nWhile the cake is baking, combine the remaining half cup sugar and the 1/4 cup lemon juice in a saucepan and heat until the sugar dissolves, stirring occasionally. Allow the liquid to cool.\nAllow the cakes to cool for 20 minutes in the pan. Drizzle or brush the lemon mixture over the tops, allowing it to soak into the cake. Let the cakes sit another 10 minutes before unmolding and allow them to finish cooling.\nGarnish with candied zest and a sprig of fresh or candied rosemary.\nSpecial equipment\nStand mixer or hand mixer, parchment paper\nThis Recipe Appears In\nSweet Technique: How to Make Candied Citrus Zest\nCakes\nLemon\nRosemary"
}