{
  "url": "https://www.seriouseats.com/rosette-al-forno-bolognese-lasagna-recipe-8760861",
  "image_url": "https://www.seriouseats.com/thmb/oJIs9MOVZS7pYYOAfTf1oP1ZpZ4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241213-RosettealForno-AmandaSuarez-05-261f7190e38f4af197c773d824255cd5.jpg",
  "tags": [
    "Baked Pasta",
    "The Latest",
    "Pastas",
    "Ground Beef",
    "Lasagna"
  ],
  "title": "Bolognese Lasagna Rolls (Rosette)",
  "full_text": "Bolognese Lasagna Rolls (Rosette)\nClose\nJump to recipe\nPrep\n60 mins\nCook\n3 hrs\nRefrigeration Time:\n60 mins\nTotal\n5 hrs\nServes\n6\nto 8 servings\nMakes\n18 lasagne wheels\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Bolognese:\nOne 1/4-ounce (7g)\npacket\nunflavored gelatin\n(about\n1 1/2\nteaspoons\n)\n1\ncup\n(\n240\nml\n)\nhomemade or store-bought low-sodium chicken stock\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\n1\nlarge\ncarrot\n(about\n6\nounces\n;\n188\ng\n), peeled and finely minced (see notes)\n1 to 2\ncelery ribs\n(about\n4\nounces\n;\n120\ng\n); finely minced (see notes)\n1\nmedium\nyellow onion\n(about\n8\nounces\n;\n240\ng\n), finely minced (see notes)\n2\npounds\n(\n900\ng\n)\nground meat\n, either all beef or 1 pound beef with 1/2 pound each ground pork and veal, divided (see notes)\n2\ntablespoons\n(\n30\nml\n)\ntomato paste\n1\ncup\n(\n240\nml\n)\ndry red wine\n1\nbay leaf\nPinch\nfreshly grated nutmeg\n1\nteaspoon\nfish sauce\n(optional)\nKosher salt\n1/4\ncup\n(\n60\nml\n)\nheavy cream\nFor the Besciamella:\n6\ntablespoons\nunsalted butter\n(\n3\nounces\n;\n84\ng\n)\n6\ntablespoons\n(\n48\ng\n)\nall-purpose flour\n4\ncups\n(\n960\nml\n)\nwhole milk\nKosher salt and freshly ground black pepper\nPinch\nfreshly grated nutmeg\n(optional)\nFor the Tomato Sauce:\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n1\nmedium\nclove garlic\n, lightly smashed\n1\nlarge sprig\nfresh basil\nOne\n28\n-\nounce\n(\n794\ng\n)\ncan\nwhole peeled tomatoes\nin their juices, blended, or one 24-ounce (700g) bottle tomato passata\nKosher salt\nFor the Assembly:\n2\npounds\n(900g) store-bought\nfresh lasagna noodles\nor fresh homemade (follow the\nrecipe and instructions here\nthrough step 10, doubling the quantity to yield 2 pounds total), cut into 6- by 12-inch-long rectangles\nVegetable oil\n, for greasing pan and pasta\n8\nounces\n(226g)\nfresh mozzarella\n, cut into 1/4-inch pieces\n1\ncup\nfinely grated Parmigiano-Reggiano\n(\n4\nounces\n;\n113\ng\n), divided\nDirections\nFor the Bolognese:\nIn a 1-cup liquid measuring cup, sprinkle stock with gelatin; set aside.\nSerious Eats / Amanda Suarez\nIn a large Dutch oven, melt butter over medium-high heat until foaming. Add carrots, celery, and onions and cook, stirring, until translucent, about 6 minutes. Add half the ground meat and cook, stirring occasionally and breaking up any large pieces as you go, until well browned, about 12 minutes. Add remaining meat and continue to cook until all meat is cooked through and broken into very small pieces, about 10 minutes.\nSerious Eats / Amanda Suarez\nAdd tomato paste and cook, stirring, for 2 minutes. Stir in wine, scraping bottom of pot, and bring to a boil, then cook until raw alcohol smell has cooked off, about 5 minutes. Add bay leaf along with the reserved stock and bring to a simmer; lower heat to maintain a very gentle simmer. Stir in nutmeg and fish sauce (if using) and season with salt. Continue to simmer, stirring occasionally, until sauce is thickened and has almost no excess liquid remaining, about 2 hours.\nSerious Eats / Amanda Suarez\nSkim and discard any fat from surface along with bay leaf. Stir in cream and season with salt. Set aside while pasta and besciamella are prepared.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Besciamella\n: In a small saucepan, melt butter over medium-high heat. Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream until fully combined. Sauce will initially become very thick, then get very thin once all the milk is added.\nSerious Eats / Amanda Suarez\nHeat, stirring constantly, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook until sauce is just thick enough to coat the back of a spoon, about 3 minutes. Season with salt and pepper. Whisk in nutmeg. If any lumps form, simply whisk thoroughly or use a hand blender. Add  1/2 cup of the besciamella to the reserved bolognese. Press a piece of plastic wrap over surface of the remaining sauce to prevent a skin from forming and keep warm until ready to use.\nSerious Eats / Amanda Suarez\nTo Assemble:\nPrepare an ice bath. In a pot of salted boiling water and working in batches, cook pasta until just shy of al dente, about 1 minute for fresh pasta. Using a spider or mesh strainer, transfer immediately to ice bath to cool.\nDrain pasta well, then brush each sheet, one at a time, lightly on both sides with vegetable oil to prevent sticking. Lay them out on a parchment-lined baking sheet, with layers of plastic wrap between the layers of pasta to prevent sticking.\nSerious Eats / Amanda Suarez\nTo Make the Rosette:\nOn clean work surface lay one pasta sheet with a short side facing you. Spread 1/4 cup of the besciamella in a thin layer evenly on top of pasta sheet, then sprinkle with grated Parmigiano and pieces of mozzarella. Place a second sheet of pasta on top. Spread about 3/4 cup of the bolognese on top, leaving a 1-inch border at the top short edge farthest from you. Smear about a teaspoon of the besciamella on the border, Starting at the bottom, roll up the layered pasta like a jelly roll. Transfer to a sheet pan seam-side down.\nSerious Eats / Amanda Suarez\nRepeat the process with the remaining pasta sheets, cheese, and sauces to make a total of 6 rolls. Refrigerate the rolls until chilled, at least 1 hour or up to 12 hours.\nSerious Eats / Amanda Suarez\nTo Make the Tomato Sauce:\nIn a small saucepan, heat olive oil with garlic clove over medium heat until garlic begins to sizzle. Reduce heat to medium low and continue to cook until garlic is just beginning to turn golden, about 4 minutes. Remove garlic clove and discard. Add blended canned tomatoes (or passata) along with the basil and bring to a simmer over medium-high heat. Reduce heat to maintain a gentle simmer and cook, stirring often, until thickened and no longer watery (this may take almost no time at all for some passata products, or up to 20 minutes for waterier canned tomatoes). Remove from heat and season with salt. Set aside.\nTo Assemble and Bake:\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). Grease a 3-quart oval or 9- by 13-inch baking dish with oil. Gently slice each roll in thirds crosswise to make 18 pinwheels.\nSerious Eats / Amanda Suarez\nSpoon a thin, even layer of passata on the bottom of baking dish. Arrange lasagne rolls cut side up, then sprinkle a generous amount of cheese on top. Bake, rotating baking sheet halfway through, until golden brown, 35 to 40 minutes.\nSerious Eats / Amanda Suarez\nAdd remaining besciamella to a piping bag and pipe small dots in a decorative pattern; alternatively, dollop warmed besciamella on top with a spoon. Sprinkle with more cheese and serve.\nSerious Eats / Amanda Suarez\nNotes\nYou can mince the vegetables by hand, but for speed and ease, a food processor will make quick work of the aromatic vegetables.\nYou can make this recipe with ground beef alone, but for even better flavor and texture, a mixture of beef, pork, and veal will deliver best results.\nMake Ahead and Storage\nThe bolognese can be refrigerated in an airtight container for up to 5 days or frozen for up to 3 months.\nSpecial Equipment\nDutch oven, 3-quart oval casserole dish or 9- by 13-inch baking dish, half sheet tray, pastry bag (optional), food processor (optional)\nBaked Pasta\nThe Latest\nPastas\nGround Beef\nLasagna",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/bolognese-lasagna-rolls-rosette.webp?"
}