{
  "url": "https://www.seriouseats.com/rosti-recipe-5217302",
  "image_url": "https://www.seriouseats.com/thmb/zGuQ-QGH8eU9CjCYXBPlLFH8DkQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220201-rosti-vicky-wasik-17-39a3c1132a774c5ab85784b3f75de739.jpg",
  "tags": [
    "Potatoes",
    "Swiss",
    "The Latest"
  ],
  "title": "Rösti (Swiss Potato Cake)",
  "full_text": "Rösti (Swiss Potato Cake)\nClose\nJump to recipe\nCook\n60 mins\nChilling Time\n8 hrs\nTotal\n9 hrs\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nYukon Gold Potatoes\n(about\n2\nmedium\npotatoes\n)\nKosher salt\n6\ntablespoons\n(\n85\ng\n)\nunsalted butter\n, divided\nDirections\nIn a medium saucepan or small pot, cover potatoes with cold water. Season generously with salt and bring to a simmer. Continue to cook at a simmer until you can just pierce the potatoes with a paring knife, about 25 minutes; make sure not to cook them so long their skins split. Drain potatoes, allow them to cool to room temperature, and then cover and refrigerate until fully chilled, at least 8 hours and up to 3 days. When ready to cook, peel cold potatoes.\nUsing the large holes of a box grater, grate peeled, cooked potatoes into a mixing bowl. Season with salt to taste, and stir to combine.\nIn a 10-inch nonstick, carbon steel, or cast iron skillet, melt 3 tablespoons (45g) butter over medium-high heat until foaming. Add potatoes, and using a flexible spatula, form them into an even disc, about 1 inch thick. Cook until deep golden brown and crisp on the bottom, about 10 minutes; lower heat if needed to prevent scorching.\nSlide rösti out of the skillet onto a large plate. Set a second plate on top and flip to invert rösti. Slide back into skillet, add the remaining 3 tablespoons (45g) butter, and cook, using the spatula to round out the sides and form an even disc, until deep golden brown and crisp on second side, about 10 minutes longer; adjust heat as necessary to promote even browning but prevent scorching. If desired, you can fold and press any crispy bits that fall off the rösti back into it, using the spatula to coax the disc back to its circular shape.\nSlide rösti onto a serving plate, and serve (if one side is more nicely and evenly browned than the other, feel free to flip the rösti to whichever side you want for presentation).\nSpecial Equipment\nBox grater\n,\n10-inch nonstick (preferred), cast iron, or carbon steel skillet\n.\nMake-Ahead and Storage\nThe potatoes can be boiled, drained, and refrigerated whole in their skins up to 3 days before peeling, grating, and cooking the rösti. The finished rösti is best enjoyed immediately.\nPotatoes\nSwiss\nThe Latest"
}