{
  "url": "https://www.seriouseats.com/rotisserie-porchetta-recipe",
  "image_url": "https://www.seriouseats.com/thmb/kGu0G7QLp1pCo_iP4Kdqkqil4p8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__12__20121213-233759-porchetta-6d8472ae983e4ab3b0b97ad754c9d9d1.jpg",
  "tags": [
    "Pork Mains",
    "Grilled Pork",
    "Pork Belly",
    "Pork Loin",
    "Memorial Day"
  ],
  "title": "Rotisserie Porchetta Recipe",
  "full_text": "Rotisserie Porchetta Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n3 hrs 5 mins\nActive\n90 mins\nBrining and Resting Time\n2 hrs 10 mins\nTotal\n5 hrs 30 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Brine:\n2\nquarts\ncold\nwater\n1/3\ncup\nsalt\n1/4\ncup\nwhite sugar\n1\nwhole\npork loin\n, trimmed of silverskin and excess fat (about\n3\npounds\n)\nFor the Rub:\n1\ntablespoon\nwhole black\npeppercorns\n1\ntablespoon\nfennel seeds\n2\ntablespoons\nfinely chopped\nfresh sage\n1\ntablespoon\nfinely chopped\nfresh rosemary\n1\ntablespoon\nfreshly\nminced garlic\n(about\n3\nmedium\ncloves\n)\n2\nteaspoons\nfinely\nchopped fresh thyme\n2\nteaspoons\ncrushed red pepper\n1\nteaspoon\nlemon zest\n1\nwhole\nboneless\npork belly\n(\n5 to 6\npounds\n)\nDirections\nTo make the brine:\nIn a large bowl, whisk together water, salt, and sugar until solids are dissolved. Submerge pork loin in brine. Place in refrigerator and brine for 2 hours.\nTo make the rub:\nPlace peppercorns and fennel seed in a cast iron skillet over medium-high heat; toast spices until fragrant, about 2 minutes. Transfer to a spice grinder and process until coarsely ground. Transfer spice mixture to small bowl and mix in sage, rosemary, garlic, thyme, crushed red pepper, and lemon zest. Set aside.\nLay pork belly, skin side down, on a large cutting board. Score flesh with a sharp knife at an angle about every inch. Repeat in opposite direction to create a diamond pattern. Season pork belly liberally with salt. Sprinkle rub evenly across pork belly, using hands to pat rub into meat and cut crevices.\nRemove pork loin from brine; pat dry with paper towels. Place in center of pork belly. Roll pork belly around pork loin so it fully encases loin. Tie roll close with butcher twine about every inch.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on either side of the charcoal grate and place a foil pan between the two piles of coals. Cover grill and allow to preheat for 5 minutes. Run spit of the rotisserie through middle of pork roll and secure ends with rotisserie forks. Place on the rotisserie, cover, and cook at medium heat until skin has darkened and crisped and pork registers 155oF when an instant read thermometer is inserted into the thickest part of the meat, about 3 hours, replenishing coals to maintain temperature as needed. Remove from grill and let rest for 10 minutes. Remove spit, slice, and serve.\nSpecial Equipment\nGrill, Rotisserie\nPork Mains\nGrilled Pork\nPork Belly\nPork Loin\nMemorial Day"
}