{
  "url": "https://www.seriouseats.com/roti-john-malaysian-griddled-omelette-sandwich-8430704",
  "image_url": null,
  "tags": [
    "The Latest",
    "Southeast Asian",
    "Eggs",
    "Sandwiches",
    "Ground Beef"
  ],
  "title": "Roti John (Malaysian Griddled Omelette Sandwich)",
  "full_text": "Roti John (Malaysian Griddled Omelette Sandwich)\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nMacerating and Cooling TimeTime\n5 mins\nTotal\n45 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nTopping Option 1: Lettuces and Tomatoes\n1\nsmall\nhead\nbutterhead lettuce\n(\n8\nounces\n;\n226\ng\n)\n2\nmedium\ntomatoes\n(\n8\nounces\n;\n226\ng\n), sliced 1/2-inch thick\n4\ntablespoons\nMalaysian-style\nchile sauce\n, such as Maggi (see notes)\nTopping Option 2: Cabbage and Carrot Slaw\n1\nsmall\nhead\ngreen cabbage\n(\n1 1/2\npounds\n;\n700\ng\n), quartered, cored, and shredded\n1\nmedium\ncarrot\n(\n3\nounces\n;\n85\ng\n), peeled\n1/2\ncup\ngranulated sugar\n(\n3 1/2\nounces\n;\n100\ng\n)\n1/4\ncup\n(\n12\ng\n) Diamond Crystal\nkosher salt\n5\ntablespoons\n(\n75\nml\n)\nmayonnaise\n3\ntablespoons\n(\n45\nml\n)\napple cider vinegar\n1\ntablespoon\n(\n7\ng\n) freshly\nground black pepper\n4\ntablespoons\nMalaysian-style\nchile sauce\n, such as Maggi (optional)\nFor the Sandwiches:\n1/4\ncup\nplus\n1\ntablespoon\n(\n75\nml\n) neutral\noil\nsuch as vegetable or canola, divided\n1\nmedium\nred onion\n(\n8\nounces\n;\n226\ng\n), peeled and diced (about\n3/4\ncup\n)\n8\nounces\n(\n226\ng\n)\nground beef\nor chicken\n1\ntablespoon\ncurry powder\n(see notes)\n2\nteaspoons\nDiamond Crystal\nkosher salt\n, divided, plus more as needed; for table salt use half as much by volume\n6\nlarge\neggs\n2\nteaspoons\nfreshly\nground black pepper\n2\ntablespoons\nthinly sliced\nscallions\n, white and green parts\n2\ntablespoons\nChinese\ncelery\nleaves, chopped (optional)\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\n, softened\n4\nsplit\nhot dog buns\nDirections\nFor Topping Option 1:\nSeparate the lettuce leaves and transfer to a salad spinner. Wash leaves in cold water, then drain and spin dry. Set aside.\nSerious Eats / Michelle Yip\nFor Topping Option 2:\nUsing the large holes of a box grater, shred the carrot. Place the cabbage and carrot into a large colander set in the sink and toss with the sugar and salt. Allow vegetables to macerate for 5 minutes. Meanwhile, in a large bowl, thoroughly whisk together mayonnaise, apple cider vinegar, and black pepper.\nSerious Eats / Michelle Yip\nRinse the cabbage and carrot under cold running water, then spin dry in a salad spinner. Transfer the vegetables to the large bowl with the mayonnaise dressing and toss to combine. (Note that this makes more slaw than you will need for the roti John; save the remainder to eat separately as desired.)\nSerious Eats / Michelle Yip\nFor the Sandwiches:\nIn a large nonstick skillet, combine 1 tablespoon oil and onion and cook over medium-high heat, stirring often, until onions begin to soften, about 4 minutes. Add the ground meat, curry powder, and 1 teaspoon salt, and cook, stirring and breaking up the meat, until completely cooked through, about 4 minutes. Remove from heat and allow to cool, about 5 minutes.\nSerious Eats / Michelle Yip\nMeanwhile, crack eggs into a medium bowl and whisk well with black pepper and the remaining 1 teaspoon salt. Scrape the onion and meat mixture into the eggs, along with scallions and Chinese celery leaves, if using. Stir well to combine and set aside. Wipe out skillet.\nSerious Eats / Michelle Yip\nSpread butter on cut sides of each bun. Working in batches, toast the buns in the nonstick skillet, butter side down, over medium heat until lightly browned, 2 to 3 minutes. Set aside.\nSerious Eats / Michelle Yip\nWipe out the skillet. Heat 1 tablespoon oil in the pan over medium heat. Pour 1/4 of the omelette mixture into the pan and let cook, without stirring, for 10 seconds. Place one bun, toasted side down, into the egg mixture, then press bun lightly but firmly into eggs until egg sticks cohesively to the bun, about 20 seconds, while pushing the egg mixture towards the bread to prevent too much of an overhang. Allow omelette to continue to cook until browned, about 1 minute. Carefully insert a spatula between the egg and pan, then flip the whole thing over; using the spatula, flip any excessively overhanging omelette onto the bun. Toast top side of bun, checking often to prevent burning, 30 seconds to 1 minute. Remove roti John from the pan and place on a wire rack set in a baking sheet. Repeat with remaining oil, omelette mixture, and toasted buns, wiping out skillet in between each sandwich.\nSerious Eats / Michelle Yip\nOnce all the sandwiches are cooked, top either with lettuce, tomatoes, and chile sauce or about 1/4 cup coleslaw per sandwich (with optional chile sauce, if desired). Close buns and slice each roti John crosswise into 2 to 3 segments. Serve immediately for the freshest bite, or wrap in parchment paper and let stand before consuming within 2 hours (the sandwich and its fillings will soften somewhat but I like how the flavors meld). Reserve remaining coleslaw or chile sauce for another use.\nSerious Eats / Michelle Yip\nSpecial Equipment\nLarge nonstick pan\nNotes\nMalaysian curry powder tends to be heavy on kashmiri chile powder and fennel seeds; brands like Adabi are available online. That said, your favorite curry powder will also work.\nMalaysian chile sauce is made from fresh chiles and is processed into a homogenous texture, unlike the relatively chunky, Thai-style sweet chile sauce.\nYou can mix and match the meat and vegetable fillings. My suggested combos are:\nMinced beef omelette with lettuce, tomatoes, and chile sauce\nMinced chicken omelette with coleslaw\nMake-Ahead and Storage\nRoti John can be made ahead up to two hours ahead and wrapped, much like pre-made burgers, allowing the flavors and textures to meld. Refrigeration and freezing are not recommended, as reheating would make it soggy.\nThe Latest\nSoutheast Asian\nEggs\nSandwiches\nGround Beef"
}