{
  "url": "https://www.seriouseats.com/rustic-apricot-jam-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zonP5rsHvLORD8oeA3ME6WPaQoA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__08__08112014-apricot-jam-toast-jennifer-latham-59121b73603a4556b9bf38bc797d4916.jpg",
  "tags": [
    "Jams & Jellies",
    "Stovetop Fruit",
    "Apricot"
  ],
  "title": "Rustic Apricot Jam",
  "full_text": "Rustic Apricot Jam\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nActive\n2 hrs\nMacerating and Cooling Time\n40 mins\nTotal\n110 mins\nServes\n192 servings\nMakes\n12 half-pint jars\nCook Mode\n(Keep screen awake)\nIngredients\n6\npounds\nfirm-but-ripe freestone\napricots\n, such as Blenheims, halved and pitted\n2\npounds\n10\nounces\ngranulated sugar\n3\nounces\n(\n6\ntablespoons\n)\nfresh lemon juice\nfrom\n3\nlemons\nDirections\nIn a large stainless steel or glass mixing bowl, combine apricots, sugar, and 1 1/2 ounces (3 tablespoons) lemon juice and mix until all the sugar is moistened; if some sugar remains dry, allow to macerate until fruit has released enough juices to moisten sugar, 5 to 15 minutes.\nThoroughly wash 12 half-pint canning jars and their lids. If you plan to process the jam for shelf-stable storage, prepare a water bath and sterilize the jars as described in our\ncanning guide\n. Set several metal spoons on a plate in the freezer. Scrape apricot mixture into a wide shallow pot and heat over medium-high heat, stirring regularly, until sugar is melted and mixture starts to bubble, 10 to 15 minutes.\nCook apricot mixture over medium-high heat, stirring as needed to prevent scorching, until jam starts to foam, about 15 minutes. Continue to cook, stirring minimally and lowering the heat if necessary to prevent scorching, until foaming has subsided, about 15 minutes longer; scrape any foam off jam surface with a stainless steel spoon as needed.\nTaste jam for tartness: If the jam tastes too sweet without a good balance of tartness, add 1/2 ounce (1 tablespoon) of the remaining lemon juice at a time, stirring well and tasting between additions, until the lemony flavor is just barely perceptible and the balance of sweet and tart has been reached (like good lemonade).\nContinue to cook until bubbling has slowed and jam looks glossy and appears thickened around the edge, 5 to 15 minutes; lower heat as necessary to prevent scorching. Turn off heat and set a dollop of jam on one of the freezing-cold spoons, then return to freezer for 5 minutes. Jam is ready once it holds together and doesn't run off the spoon when tilted. If jam is too runny, return to heat and cook, stirring frequently and repeating the spoon test every 5 minutes, until jam passes test.\nTransfer jam into prepared canning jars and wipe any jam from the rims. To store in refrigerator, simply place lids on jars, screw on rings, and let cool completely at room temperature before refrigerating. To process jam for shelf-stable storage, bring water bath to a rolling boil. Place lids on jars and screw on rings until they are snug but not overly tight. Carefully lower jars into boiling water bath and process for 10 minutes. Remove jars and let cool completely at room temperature. Unprocessed jam can be refrigerated for a couple of months; Processed jam can be stored in a cool, dark place for up to 1 year.\nSpecial Equipment\nLarge stainless steel or glass\nmixing bowl\n; large, wide pot; half-pint size canning jars, lids, and rings;\ndeep stockpot\nfor canning (optional); jar lifter (optional);\ncanning funnel\n(optional)\nRead More\nJam Making 101: The Secrets to Getting Jam to Set Like a Pro\nWater Activity and the Science of Preservation\nDIY Apricot Liqueur Recipe\nJams & Jellies\nStovetop Fruit\nApricot",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rustic-apricot-jam.webp?"
}