{
  "url": "https://www.seriouseats.com/ryann-farr-new-york-style-hot-dog-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MXUOMWRrgiYKdOZGuFcFcX1HCeY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__02__20140128-hot-dogs-4505-meats-ryan-farr-63-5e3b8dd4f9e34a488e2c0ccb40e9ce51.jpg",
  "tags": [
    "Homemade Sausages",
    "Smoked Beef",
    "Memorial Day"
  ],
  "title": "Ryan Farr's New York-Style Hot Dogs Recipe",
  "full_text": "Ryan Farr's New York-Style Hot Dogs Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n70 mins\nActive\n2 hrs\nFreezing and Chilling Time\n16 hrs 20 mins\nTotal\n17 hrs 55 mins\nServes\n24 servings\nCook Mode\n(Keep screen awake)\nIngredients\n949\ng\nboneless lean beef\nsuch as neck, plate, or shank, cut into 1-inch cubes\n137\ng\nbeef fat\n, cut into 1-inch cubes\n23\ng\nfine sea salt\n10\ng\npaprika\n5\ng\ngranulated garlic\n4\ng\ncoarsely ground black pepper\n3\ng\nonion powder\n1\ng\nInstacure #1 or Prague powder #1\n230\ng\ncrushed\nice\n20\nfeet\nof\nrinsed sheep casings\nDirections\nPlace the meat and fat on a rimmed baking sheet, transfer to the freezer, and chill until crunchy on the exterior but not frozen solid.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nIn a small bowl, add salt, paprika, granulated garlic, black pepper, onion powder, and Instacure #1 and stir to combine.\nSerious Eats / J. Kenji López-Alt\nNest a large mixing bowl in a bowl filled with ice. Grind the meat and fat through the 1/4-inch plate of the grinder into the bowl set in ice.\nSerious Eats / J. Kenji López-Alt\nAdd spice mixture to the meat and stir with your hands until well incorporated; the mixture will look homogenous and will begin sticking to the bowl.\nSerious Eats / J. Kenji López-Alt\nTransfer meat to the bowl of a food processor, add half the crushed ice and process until all of the ice has dissolved, 1 to 2 minutes. Add the remaining crushed ice and continue processing until the mixture is completely smooth, 4 to 5 minutes more. Note: The temperature of your meat during this mixing step is critically important. Its temperature should never rise about 40°F (4°C); work efficiently during this step of the process.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nSpoon 2 tablespoons of the meat mixture into a nonstick frying pan and spread into a thin patty. Cook the test patty over low heat until cooked through but not browned. Taste the sausage for seasoning and adjust as necessary.\nSerious Eats / J. Kenji López-Alt\nPress a sheet of parchment paper or plastic wrap directly on the surface of the meat to prevent oxidation, then cover the bowl tightly with plastic wrap and refrigerate overnight. Alternatively, you can vacuum seal the farce.\nStuff the sausage into the sheep casings and twist into links.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nSmoke the links at 170°F (77°C), using\na smoker\nor the oven set-up described above until the internal temperature of the sausage reaches 145°F (63°C), 45 to 60 minutes. Remove sausages from the smoker, let cool slightly, then transfer to the refrigerator and let stand, uncovered, overnight. The hot dogs are then fully cooked, and can be finished on a\ngrill\n, steamed, or pan-fried.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nMeat grinder\n,\nfood processor\n, vertical sausage stuffer,\nsmoker\nNotes\nTo smoke in a gas oven, you can place the hot dogs on one side of a rack in a wide, deep baking dish, place smoldering wood chunks on the other, and cover the whole thing tightly with foil to trap the smoke before placing them in the oven.\nRead More\nThe Best Grilled Hot Dogs Recipe\nAmerica's Regional Hot Dog Styles\nSmoked Cheddar and Jalapeño Sausage Recipe\nOrange and Leek Loukaniko (Greek Sausage) Recipe\nHomemade Sausages\nSmoked Beef\nMemorial Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ryan-farrs-new-york-style-hot-dogs-recipe.webp?"
}