{
  "url": "https://www.seriouseats.com/sable-cookies-recipe-8763545",
  "image_url": "https://www.seriouseats.com/thmb/RFpPO6MJpNBf_zG5gEY9q02BRMw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241219-SableCookies-AmandaSuarez-hero-a6e712f4768a4035913a4c073ea5c9c2.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "French",
    "Baking"
  ],
  "title": "French Sablé Cookies",
  "full_text": "French Sablé Cookies\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nChilling, Freezing, and Cooling Time\n3 hrs 30 mins\nTotal\n4 hrs 20 mins\nServes\n8\nto 10\nMakes\n30 2 1/2 inch cookies\nCook Mode\n(Keep screen awake)\nIngredients\n250\ng\nall-purpose flour\n(\n8 3/4\nounces\n;\n2\ncups\n), sifted, plus more for dusting\n125\ng\nconfectioners’ sugar\n(\n4 1/2\nounces\n; about\n1\ncup\nand\n2\ntablespoons\n), sifted\n50\ng\nblanched almond flour\n(\n1 3/4\nounces\n;\n1/2\ncup\n), sifted (see notes)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n125\ng\nunsalted butter\n(\n4 1/2\nounces\n;\n9\ntablespoons\n), cold and cut into 1/2-inch cubes\n50\ng\nbeaten egg\n(\n1 3/4\nounce\n;\n3\ntablespoons\n), from 1 large egg\nDemarara sugar\n(optional)\nDirections\nIn a large mixing bowl, whisk flour, confectioners’ sugar, almond flour, and salt to combine. Add butter to flour mixture and toss with fingers until butter pieces are thoroughly coated with flour mixture. Using your fingertips, pinch and flatten butter, then rub it between your fingertips until a sandy texture forms, 3 to 4 minutes.\nSerious Eats / Amanda Suarez\nMake a well in the center of the flour mixture about 2 to 3 inches wide. Pour beaten egg into the well and, using a fork, gradually incorporate flour into the egg until a dry, crumbly dough forms.\nSerious Eats / Amanda Suarez\nTip dough onto a large, clean, unfloured countertop. Using the heel of your hand, smear the dough away from you, then use your hands or a dough scraper to gather it back into a mass. Repeat until a soft, slightly sticky dough forms, about 6 to 8 more times.\nSerious Eats / Amanda Suarez\nOn a clean cutting board or work surface, shape dough into a 10-inch long log about 1 1/2 to 2 inches in diameter. (If desired, roll log in an even layer of demerara sugar for added sweetness and crunch.) Wrap log tightly in plastic, twisting the ends of the plastic to seal. Once wrapped, roll log under your hands in a back-and-forth motion to ensure log is smooth, even, and tight all around. Refrigerate until very firm, about 3 hours. Line two 13-by 18-inch rimmed baking sheets with parchment; set aside.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and preheat to 350ºF (175ºC). Using a sharp chef’s knife, trim ends of log, then slice dough into 1/4-inch thick slices. Transfer sliced cookies onto prepared baking sheets and freeze until firm, about 30 minutes.  (You may have to freeze 1 baking sheet at a time, depending on the size of your freezer.)\nSerious Eats / Amanda Suarez\nBake 1 sheet of cookies at 350°F (175° C) until lightly golden brown around the edges, about 15 minutes, leaving second sheet in the freezer while the first bakes. Repeat with remaining baking sheet.\nSerious Eats / Amanda Suarez\nLet cool for 10 minutes before serving; enjoy warm or at room temperature.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nPlastic wrap, 2 rimmed baking sheets, parchment\nNotes\nAlmond flour can be substituted with the same amount of all-purpose flour, but the dough will be less flavorful and slightly more difficult to work with.\nMake-Ahead and Storage\nOnce cooled, baked cookies can be stored in an airtight container at room temperature for up to 5 days.\nTo freeze unbaked cookies, arrange sliced dough on a parchment-lined rimmed baking sheet in a single layer. Freeze until solid. Transfer to an airtight container or zip-top bag. Unbaked cookies can be frozen for up to 3 months. To bake frozen cookies, remove sliced cookies from freezer and arrange on a parchment-lined rimmed baking sheet. Bake at 350ºF (175ºC) until lightly golden brown around the edges, 15 to 17 minutes.\nCookies\nThe Latest\nFrench\nBaking"
}