{
  "url": "https://www.seriouseats.com/salchipapa-recipe-5217298",
  "image_url": "https://www.seriouseats.com/thmb/mrIC6LF4KWf5dltOBEVBQoMqR04=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220131-salchipapas-vicky-wasik-15-f01dcb79a9f84bcd909845a1a101a962.jpg",
  "tags": [
    "Potatoes",
    "The Latest"
  ],
  "title": "Salchipapa (Peruvian Hot Dogs and French Fries)",
  "full_text": "Salchipapa (Peruvian Hot Dogs and French Fries)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n40 mins\nDrying and Cooling Time\n45 mins\nTotal\n95 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\nYukon Gold or\nrusset potatoes\n(\n1130\ng\n; about\n5\nmedium\npotatoes)\n2 1/2\ntablespoons\n(\n37\nml\n) distilled\nwhite vinegar\nKosher salt\n1/2\ncup\nstore-bought or\nhomemade\nmayonnaise\n(\n4 1/2\nounces\n;\n128\ng\n)\n1/2\ncup\nwhole\npitted kalamata olives\n(\n2 1/2\nounces\n;\n70\ng\n)\n2\nquarts\n(\n1.9\nL\n)\npeanut oil\nor other neutral oil\n1\npound\nhot dogs\n, frankfurters, or other similar wiener, cut crosswise on the bias about 1/2-inch thick\n1\ntbsp\nketchup\nOther dips, such as mayo,\nmustard\n, ají amarillo sauce, etc., as desired (see note)\nDirections\nPeel the potatoes, and transfer to a large bowl of cold water, keeping them submerged, to prevent discoloration. Working with one potato at a time and using a sharp chef's knife, cut into 1/2-inch by 1/2-inch batons; transfer cut potatoes to a second bowl of cold water to prevent discoloration. Repeat with remaining potatoes.\nLine a rimmed baking sheet with paper towels. Drain potatoes, and transfer to a large pot. Add 2 quarts (1.9L) cold water (and any extra that's needed to just cover the potatoes), vinegar and 2 tablespoons (24g) salt. Bring to a boil over high heat. Boil for 10 minutes. Potatoes should be fully tender, but not falling apart. Drain and spread on prepared baking sheet. Allow to dry for 5 minutes.\nMeanwhile, combine mayonnaise and olives in a tall-sided cup or jar that just fits the head of an immersion blender. Using an immersion blender, blend on high speed until a smooth, purple sauce forms. Cover and refrigerate until ready to serve.\nLine a second rimmed baking sheet with paper towels. Heat oil in a 5-quart Dutch oven or large wok over high heat to 400°F (204°C). Add one-third of fries to oil; oil temperature should drop to around 360°F (182°C). Cook for 50 seconds, agitating occasionally with a wire mesh spider to prevent sticking, then, using the spider, transfer to the prepared baking sheet. Repeat with remaining potatoes (working in 2 more batches), allowing oil to return to 400°F before each addition. Allow potatoes to cool to room temperature, 15 to 20 minutes.\nRepeat frying and cooling process at least 1 and up to 3 more times, working in batches and cooking potatoes each time for 50 seconds, starting at 400°F each time.\nAdjust oven rack to middle position and preheat oven to 200°F (90°C). Set a wire rack in a rimmed baking sheet, and line a large bowl with paper towels. Return oil to 400°F over high heat. Fry half of the potatoes until crisp and golden brown, 2 ½ to 3 minutes, adjusting heat to maintain a temperature of around 360°F. Using a spider, transfer to prepared bowl to drain and season immediately with kosher salt. Transfer to the wire rack and set in oven to keep warm and crisp. Repeat with remaining fries.\nReturn oil to 400°F and add one-third of hot dog slices to oil. Cook until hot dogs are lightly darkened, about 30 seconds. Transfer to a paper towel–lined bowl, then repeat with remaining hot dogs.\nArrange fries on a platter. Top with fried hot dogs. Serve right away with olive sauce, ketchup, and any other sauces desired either on the side or squirted on top.\nSpecial Equipment\nImmersion blender, large Dutch oven or wok, instant-read thermometer, spider skimmer, rimmed baking sheets, wire rack\nNotes\nTo make ají amarillo sauce, follow a similar procedure to the olive sauce, simply blending ají amarillo paste into mayonnaise to taste (the more you add, the spicier it'll get).\nMake-Ahead and Storage\nSalchipapa is best enjoyed immediately. Olive sauce can be refrigerated in an airtight container for up to 5 days.\nPotatoes\nThe Latest"
}