{
  "url": "https://www.seriouseats.com/salmon-rillettes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Bs1QQlA0bTHk8EqMxFSzhCsIXlI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160503-samon-rillette-vicky-wasik-7-16f4185fc5cd4709acfb8aa362a37b6f.jpg",
  "tags": [
    "Salmon",
    "Snacks & Appetizers",
    "Easter Appetizers",
    "Christmas Appetizers",
    "Patés & Rillettes"
  ],
  "title": "Salmon Rillettes With Chives and Shallots Recipe",
  "full_text": "Salmon Rillettes With Chives and Shallots Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n30 mins\nChilling Time\n2 hrs\nTotal\n2 hrs 25 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\npounds\n(\n550\ng\n)\nboneless, skinless salmon fillet\n, cut into 1-inch pieces (see notes)\nCold\nwater\n2\ntablespoons\n(\n30\nml\n)\njuice\nfrom\n1\nlemon\n, plus\njuice\nfrom 1\nlemon\n, divided (see notes)\n1\nmedium\nleek\nor\nonion\n(about\n6\nounces\n;\n170\ng\n), halved (see notes)\n1\nlarge\nstalk\ncelery\n(about\n2\nounces\n;\n55\ng\n), cut into large pieces (see notes)\n1\nbay leaf\n(see notes)\n2\nounces\nunsalted butter\n(\n1/2\nstick\n;\n55\ng\n)\n1/4\ncup\nminced shallot (about\n4\nsmall,\n1-ounce/30 g\nshallots\n)\n1/4\ncup\nplus\n2\ntablespoons\n(\n90\nml\n)\nmayonnaise\n2\ntablespoons\n(\n30\nml\n) minced\nchives\n1/4\nteaspoon\nground coriander\nseeds\nPinch\ncayenne pepper\nKosher salt\nand freshly ground black pepper\nToasts\nor crackers, for serving\nDirections\nIn a large saucepan, combine salmon with enough cold water to cover by 1 inch. Add juice from 1 lemon, leek or onion, celery, and bay leaf (if using). Set over medium heat and bring poaching liquid to 170°F (77°C), using an instant-read thermometer if you have one; otherwise, bring liquid to just below a bare simmer. Adjusting heat to maintain water temperature, cook until salmon flakes easily when pressed, about 6 minutes. Drain, discard aromatics, and transfer salmon to a mixing bowl. Using your fingers, shred salmon roughly.\nMeanwhile, in a small skillet, melt butter over medium heat, add shallot, and cook, stirring, until softened but not browned, about 3 minutes. Scrape shallots and butter into bowl with salmon. Add mayonnaise, chives, remaining 2 tablespoons (30ml) lemon juice, coriander seeds, and cayenne. Season with salt and pepper. Stir well until ingredients are thoroughly mixed and salmon is more finely shredded.\nTransfer rillettes to a large ramekin, crock, or other container, pressing down with a spoon and working it into the corners and against the walls to avoid trapping any air bubbles. Press plastic against the surface and refrigerate until thoroughly chilled, at least 2 hours. Serve with toasts or crackers. Rillettes can keep refrigerated for up to 5 days with plastic pressed firmly against the surface.\nNotes\nLook for salmon that has a good amount of fat in it, which more often than not means farmed salmon; a piece of fillet with plenty of the belly flap attached is best, since the belly has the most fat. Cooking the fish in water with lemon juice and aromatics known as a court bouillon improves flavor, but in this recipe, you can use just water with very little change in the flavor of the finished dish. (If not using the court bouillon, you can omit the leek/onion, celery, and bay leaf, but will still need 2 tablespoons of lemon juice for the final mixture.)\nSalmon\nSnacks & Appetizers\nEaster Appetizers\nChristmas Appetizers\nPatés & Rillettes"
}