{
  "url": "https://www.seriouseats.com/salmon-sheet-pan-dinner-recipe-11716748",
  "image_url": "https://www.seriouseats.com/thmb/16_J1souOOWaez0ngdK-MBp4-EQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250415-SEA-SalmonSheetPanDinner-MaureenCelestine-Beauty2-33-31bc08fa0bdf43189ec42ad117acf2b2.jpg",
  "tags": [
    "Seafood Mains",
    "The Latest",
    "Recipes",
    "Salmon"
  ],
  "title": "The Secret to an Actually Delicious Sheet-Pan Salmon Dinner",
  "full_text": "The Secret to an Actually Delicious Sheet-Pan Salmon Dinner\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nTotal\n50 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nmedium head\ngreen or red\ncabbage\n(about\n2 1/2\npounds\n;\n1200\ng\n), cut through core\n5\ntablespoons\n(\n75\nml\n)\nextra-virgin olive oil\n, divided\n1/4\nteaspoon\nsmoked paprika\n2 1/2\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt use half as much by volume\n1/4\nteaspoon\nfreshly\nground black pepper\n8\nounces\n(\n226\ng\n)\nbeech mushrooms\n, trimmed and separated, or thinly sliced cremini mushrooms\n1\nteaspoon\nground\nfennel seeds\n4\n(6- to 8-ounce; 170 to 226 g) skin-on or skinless\nsalmon\nfillets\n1\nteaspoon\nground cumin\n1/2\nteaspoon\nground turmeric\n1/2\nteaspoon\nlime zest\nand\n1\ntablespoon\nlime juice\n(from\n1\nlime\n)\n2\ntablespoons\nchopped fresh\ncilantro\nor parsley (optional)\nDirections\nAdjust oven rack to upper-middle position and heat oven to 500℉. Cut cabbage half through core into 2 pieces, then cut each piece through core into 2 wedges for a total of 4 wedges. Leave core intact. Arrange wedges, 1 flat side down, on 1 side of rimmed baking sheet, leaving other half of sheet empty.\nSerious Eats / Maureen Celestine\nIn a small microwave-safe bowl, combine 3 tablespoons oil with smoked paprika and heat until fragrant, 30 seconds. Vigorously whisk to combine well, then use a pastry brush to brush half of oil mixture on exposed cut sides of wedges and sprinkle evenly with 1/2 teaspoon salt. Flip wedges so oiled sides are now down. Brush second cut sides with remaining oil mixture and sprinkle with pepper and remaining 1/2 teaspoon salt. Cover sheet tightly with aluminum foil and roast for 15 minutes.\nSerious Eats / Maureen Celestine\nWhile cabbage is roasting, in a medium bowl, toss mushrooms with 1 tablespoon oil, ground fennel seed, and 1/2 teaspoon salt until evenly coated.\nSerious Eats / Maureen Celestine\nPat salmon dry with paper towels. In now-empty small bowl, microwave 1 tablespoon oil with cumin, turmeric, and 1 teaspoon salt until fragrant and oil is beginning to bubble, about 30 seconds. Whisk vigorously to combine and set aside.\nSerious Eats / Maureen Celestine\nOnce cabbage has cooked for 15 minutes, remove baking sheet with cabbage from oven and reduce oven temperature to 450℉. Carefully uncover and discard foil and flip cabbage wedges.\nScatter prepared mushrooms next to cabbage on empty part of sheet tray, making sure the mushrooms have contact with sheet. Cook until mushrooms begin to soften, 8 minutes.\nSerious Eats / Maureen Celestine\nRemove baking sheet from oven and using a spatula, gently push mushrooms aside and place salmon fillets directly onto sheet pan, on opposite side of cabbage. Redistribute mushrooms around the salmon and cabbage, ensuring mushrooms have contact with pan.\nSerious Eats / Maureen Celestine\nUsing a fork, whisk lime zest and lime juice into prepared oil mixture to combine, then brush oil mixture all over salmon fillets.\nSerious Eats / Maureen Celestine\nCook until salmon registers 115 to 130°F (46 to 55°C) for medium-rare to medium, and mushrooms and cabbage are cooked through, 8 to 12 minutes. Sprinkle with chopped parsley or cilantro, if desired.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nPastry brush, aluminum foil\nNotes\nThis recipe can easily be halved to serve two or doubled to serve eight. If you do double the recipe, I recommend cooking the cabbage and mushrooms on one pan and the salmon on a second pan with the salmon going on a lower rack in the oven.\nMake-Ahead and Storage\nLeftovers can be refrigerated in an airtight container for up to 3 days.\nSeafood Mains\nThe Latest\nRecipes\nSalmon",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-secret-to-an-actually-delicious-sheet-pan-salmon-dinner.webp?"
}