{
  "url": "https://www.seriouseats.com/salmon-bean-salad-recipe-8682948",
  "image_url": "https://www.seriouseats.com/thmb/8Y5lKjZGSHsT9MCFfSFBJeMPGeU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160505-cranberry-beans-salmon-arugula-salad-vicky-wasik-2-4752f6e6f9014832a7a9d2611ece0c97.jpg",
  "tags": [
    "Salmon",
    "The Latest",
    "Beans",
    "Salads",
    "Poaching"
  ],
  "title": "Easy One-Bowl Salmon and Bean Salad",
  "full_text": "Easy One-Bowl Salmon and Bean Salad\nClose\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nSoaking Time:\n8 hrs\nTotal\n9 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 pound (\n450\ng\n)\ndried cranberry beans\n(see note)\n1\nmedium\nyellow onion\n, halved\n2\nmedium\ncloves garlic\n2\nwhole\nstalks\ncelery\n,\nplus 2\nfinely diced stalks, divided\n1\ncarrot\n, peeled\n2\nbay leaves\n, divided\nKosher salt\n8\nounces\n(225g)\nskinless, boneless salmon fillet\n1 lemon, halved and juiced, plus\n4\ntablespoons\n(60ml)\nfresh juice from 1 lemon\n1/2\ncup\n(120ml)\nextra-virgin olive oil\n1\nsmall\nshallot\n, minced\n1\ntablespoon\n(10g)\ndill\n, minced\nFreshly ground black pepper\n1 medium (8-ounce;\n225\ng\n)\nfennel bulb\n, diced, fennel stalks and fronds reserved for another use\n8\nounces\narugula\n(225g; 2 loosely packed quarts)\nDirections\nFor the Beans (see note):\nIn a large bowl, cover beans by at least 4 inches water and let soak overnight. The next day, drain, transfer beans to a large pot, and cover with at least 2 inches of fresh cold water. Add halved onion, garlic, 1 celery stalk, carrot, and 1 bay leaf to pot. Season with salt. Bring to a gentle simmer over medium-high heat, then lower heat to maintain gentle simmer. Cook until beans are fully tender, about 45 minutes. (Bean cooking time will vary depending on age and exact type of bean; taste every 5 minutes until done.) Set aside to cool.\nMeanwhile, combine salmon in a large saucepan with enough cold water to cover. Add 1 stalk celery, remaining 1 bay leaf, and lemon halves with their juice. Heat over medium heat until water registers 170°F on an instant-read thermometer (or until water is at just below a bare simmer, if you don't have a thermometer), then adjust heat to maintain temperature. Cook until salmon is 115 to 120°F in the center, about 20 minutes. (If you don't have a thermometer, salmon should flake easily when done.) Drain salmon, discard aromatics, and let cool in refrigerator.\nUsing your fingers, flake salmon into large pieces. In a large bowl, whisk together remaining 4 tablespoons lemon juice, olive oil, shallot, and dill. Season with salt and pepper. Add cooled and drained beans, diced celery, diced fennel, and arugula and toss well. Add salmon, season with salt and pepper, and toss gently to combine. Serve right away.\nNotes\nOne pound of dried beans makes about 2 pounds 5 ounces cooked beans; three 15-ounce (425g) cans of cooked beans, drained, will yield slightly more than the required amount. If using canned beans, drain and rinse beans, and skip step 1 (and omit its ingredients).\nSalmon\nThe Latest\nBeans\nSalads\nPoaching",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-one-bowl-salmon-and-bean-salad.webp?"
}