{
  "url": "https://www.seriouseats.com/salsa-macha-recipe-8679915",
  "image_url": "https://www.seriouseats.com/thmb/XNSqudvtSFviPjY47sH-bmGS9Uc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240709-SALSA-MACHA-LORENA-MASSO25-SEA-36-043bf143b4b44489a229b255c0f4d9f6.jpg",
  "tags": [
    "Condiments & Sauces",
    "The Latest",
    "Mexican",
    "Peanuts",
    "Chile Pepper"
  ],
  "title": "Salsa Macha",
  "full_text": "Salsa Macha\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nCooling Time\n30 mins\nTotal\n55 mins\nServes\n10\nto 12\nMakes\n1 1/4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n240\nml)\nneutral oil\n, such as canola or vegetable oil\n15\nmedium\ngarlic cloves\n(\n75\ng\n), peeled and smashed\n5\ndried\nmorita\nchiles or chipotle chiles, stems removed (see notes)\n5\ndried\npuya\nchiles\nor guajillo chiles, stems removed, and halved lengthwise\n4\ndried árbol\nchiles\n, stem removed\n1\ndried\nhabanero chile\n, stem removed (optional)\n3\ntablespoons\ndry roasted, unsalted\npeanuts\n2\ntablespoons\nslivered almonds\n1\ntablespoon\nhulled\npumpkin seeds\n1\ntablespoon\ntoasted sesame seeds\nDirections\nIn a small saucepan, combine oil and smashed garlic. Cook over medium-low heat (the oil temperature should not exceed 275℉(135℃), until garlic is golden and fragrant, 8 to 12 minutes.\nSerious Eats / Lorena Masso\nWhen garlic just turns golden, carefully add the chiles (they may sizzle slightly when adding), and cook until softened, about 45 seconds. Set a fine-mesh strainer over a medium heat-proof bowl, and pour the oil mixture through the strainer into the bowl. Transfer the strained solids to a blender. Blend the solids on medium speed, scraping down the sides of the blender jar as needed, until evenly chopped, about 1 minute.\nSerious Eats / Lorena Masso\nReturn the strained oil to the now-empty saucepan and heat over medium-high until oil registers 325°F. Add peanuts, almonds, pumpkin seeds, and sesame seeds and fry, stirring constantly, until peanuts and almonds turn light brown, about 2 minutes.  Strain the mixture through a fine-mesh strainer set over the now-empty medium heat-proof bowl.  Reserve the strained nuts and oil separately and let cool to room temperature, about 30 minutes.\nSerious Eats / Lorena Masso\nOnce the oil is cooled, add the fried nut mixture and reserved oil to the blender. Pulse until solids are broken down into small pieces (about the size of the sesame seeds), about 10 pulses. Season with salt to taste. Serve or transfer to an airtight container and refrigerate. Stir to recombine before using.\nSerious Eats / Lorena Masso\nSpecial Equipment\nSmall saucepan, blender, fine-mesh strainer\nNotes\nMorita chiles can be substituted with chipotle as they're both smoked chiles made from jalapeños. Puya chiles can be substituted with guajillo chiles since they share a fruity flavor. Chiles de arbol can be substituted with dried Japones or Thai chiles which pack a similar punch of heat.\nSince salt doesn’t dissolve in oil it will settle at the bottom. Make sure to stir well before each use.\nMake-Ahead and Storage\nSalsa macha can be refrigerated in an airtight container for up to 2 weeks.\nCondiments & Sauces\nThe Latest\nMexican\nPeanuts\nChile Pepper",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/salsa-macha.webp?"
}