{
  "url": "https://www.seriouseats.com/salsa-negra-recipe-7724726",
  "image_url": "https://www.seriouseats.com/thmb/V8thb8tPz9T3SB9dHVQuXF6Sduo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230823-SEA-SalsaNegra-AmandaSuarez-32-2d5a987c06de4aecb7f6f22c9be371ec.jpg",
  "tags": [
    "Chile Pepper",
    "The Latest",
    "Mexican",
    "Hot Sauces"
  ],
  "title": "Salsa Negra (Sinaloan Salsa for Seafood)",
  "full_text": "Salsa Negra (Sinaloan Salsa for Seafood)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nResting Time\n60 mins\nTotal\n75 mins\nMakes\n1/2 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\ncup\n(\n60\nm\nl)\nsoy sauce\n2\ntablespoons\n(\n30\nml\n)\nWorcestershire sauce\n2\ntablespoons\n(\n30\nml\n) fresh\nlime juice\n2\ntablespoons\n(\n30\nml\n)\ntomato paste\n2\nteaspoons\nonion powder\n1\nteaspoon\n(\n5\nml\n) Jugo\nMaggi\n(see notes)\n1/4\nteaspoon\nground cumin\n1/4\nteaspoon\nfreshly\nground black pepper\n1/8\nteaspoon\nground clove\nPinch\ndried Mexican\noregano\n(see notes)\n4\nsmall\ndried árbol\nchiles\n, stemmed\n2 to 6\ndried chiltepín\nchiles\n(also called tepín chiles)\nDirections\nIn a medium bowl, whisk together soy sauce, Worcestershire sauce, lime juice, tomato paste, onion powder, Jugo Maggi, cumin, black pepper, and clove. Crumble the oregano into powder with your fingers, then stir into the soy sauce mixture.\nSerious Eats / Lorena Masso\nIn a small cast iron or stainless-steel skillet, toast the árbol chiles and chiltepín chiles over medium heat, stirring frequently, until fragrant, about 2 minutes. Transfer to a molcajete or mortar and pestle.\nSerious Eats / Lorena Masso\nAdd 1 tablespoon (15ml) soy sauce mixture and chiles and grind until seeds are mostly pulverized and the largest remaining scraps of dried chile are no more than 1/4-inch long (see notes). Scrape in remaining soy sauce mixture and stir and scrape until well combined with chile paste. Grind in additional chiltepîn chiles one or two at a time until desired heat level is reached. Let stand at least 1 hour for flavors to meld, then serve with your favorite seafood dishes or refrigerate in an airtight container for up to 2 weeks.\nSerious Eats / Lorena Masso\nSpecial Equipment\nMolcajete or textured mortar and pestle\nNotes\nYou can find Jugo Maggi at most Mexican grocery stores or on Amazon. The version available in the U.S. is called Maggi Seasoning, but the recipe and taste are quite different; both use wheat protein but Jugo Maggi is more concentrated, with additional spices and vinegar.\nMake sure to use Mexican oregano, a plant in the verbena family, and not Italian oregano (which is in the mint family). If it isn’t available at your regular grocery store, you can find it at a Mexican grocery store.\nThe more finely ground the chiles are, the thicker the salsa will be. You can thin out the final salsa with a small amount of water or soy sauce, if needed. Adjust to your desired consistency.\nMake-Ahead and Storage\nThis salsa is best if made at least 1 hour ahead of serving to give the flavors time to meld. It can be refrigerated in an airtight container for up to 2 weeks.\nChile Pepper\nThe Latest\nMexican\nHot Sauces",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/salsa-negra-sinaloan-salsa-for-seafood.webp?"
}