{
  "url": "https://www.seriouseats.com/salty-brown-sugar-shortbread-recipe-8762407",
  "image_url": "https://www.seriouseats.com/thmb/rS07fIzCYppxG0wVmJzNMhT5yCE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241212-SaltyBrownSugarShortbread-Melati-Citrawirejahero-2bfc9792708e401cac6a1c349428eaa1.jpg",
  "tags": [
    "Cookies",
    "The Latest",
    "Desserts",
    "Winter Desserts",
    "Christmas Cookies"
  ],
  "title": "The #1 Holiday Cookie My Friends and Family Request Year After Year",
  "full_text": "The #1 Holiday Cookie My Friends and Family Request Year After Year\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nCooling and Chilling Time\n75 mins\nTotal\n110 mins\nServes\n32 cookies\nMakes\n32 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n227g\nunsalted butter\n(\n8\nounces\n; 2 sticks), at room temperature\n150\ng\ndark brown sugar\n(5 1/4 ounces; 3/4 cup)\n1 1/2\nteaspoons Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nbaking soda\n2\nteaspoons\nvanilla extract\n288\ng\nall-purpose flour\n(10 ounces; 2 1/4 cups)\n50\ng\ngranulated sugar\n(1 3/4 ounces; 1/4 cup), for coating\nFlaky\nsalt\n, for topping\nDirections\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter, brown sugar, salt, baking soda, and vanilla on medium-high speed until smooth and creamy, about 3 minutes. Add flour, and mix on low speed until just combined, about 1 minute. Using a flexible spatula, scrape bowl and beater to make sure there are no streaks of unmixed dough, then knead lightly against sides of bowl. Halve the dough; place 1 portion of dough back into bowl.\nSerious Eats / Melati Citrawireja\nOn a cutting board or work surface, shape dough into a 1 1/2-inch wide log about 8 inches long and wrap tightly with plastic, twisting the ends of the plastic like a Tootsie Pop. Once wrapped, roll log under your hands in a back-and-forth motion to ensure log is smooth, even, and tight all around. Repeat with remaining dough. Chill until firm, about 1 hour. Line two 13- by 18-inch rimmed baking sheets with parchment; set aside.\nSerious Eats / Melati Citrawireja\nAdjust oven rack to middle position and preheat to 325°F (160ºC). Remove plastic wrap and set dough logs on a clean cutting board. Using a sharp chef’s knife, slice each dough log into rounds just shy of 1/2 inch; you should have 16 cookies per log. Place granulated sugar in a wide bowl. Dip each cookie in granulated sugar to lightly coat, then set on prepared baking sheets, taking care to leave about an inch of space between each cookie. Sprinkle each cookie with a pinch of flaky salt.\nSerious Eats / Melati Citrawireja\nBake 1 sheet of cookies until they have very slightly puffed and are matte and dry to the touch, about 15 minutes. (The cookies may still feel quite soft but will firm up as they cool.) Repeat with remaining baking sheet.\nSerious Eats / Melati Citrawireja\nLet cool for 5 to 10 minutes before serving. Enjoy warm or at room temperature.\nSerious Eats / Melati Citrawireja\nVariations\nTry mixing in one cup total of coarsely chopped dark chocolate and/or nuts. For extra crunch, brush each log of dough with beaten egg, then roll the dough in sesame seeds or shredded coconut (instead of sugar) before slicing.\nSpecial Equipment\nStand mixer, flexible spatula, parchment paper, bench scraper, plastic wrap, cutting board, sharp knife\nMake-Ahead and Storage\nTo freeze unbaked cookies, lay sliced unsugared dough on a parchment-lined rimmed baking sheet in a single layer.  Freeze until solid. Transfer to an airtight container or resealable gallon-sized zip-top bag. Unbaked cookies can be frozen for up to 3 months.\nTo bake frozen cookies, remove sliced cookies from freezer and arrange on a parchment-lined rimmed baking sheet. Let thaw slightly for 10 minutes, until cookies are still cold but no longer frozen. Dip each cookie in 1/4 cup (50g) granulated sugar to lightly coat, then set on prepared baking sheets, taking care to leave about an inch of space between each cookie. Sprinkle each cookie with a pinch of flaky salt.\nBaked cookies can be stored in an airtight container at room temperature for up to 4 days or frozen for up to 3 months. If frozen, thaw at room temperature.\nCookies\nThe Latest\nDesserts\nWinter Desserts\nChristmas Cookies"
}