{
  "url": "https://www.seriouseats.com/salt-baked-whole-fish-with-fresh-herbs-5212108",
  "image_url": "https://www.seriouseats.com/thmb/lT5t368aIlfujVXVMGqSFCPzmqo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211201-salt-baked-fish-vicky-wasik-24-805cbe038a5445e397565617beba2266.jpg",
  "tags": [
    "Fish",
    "Italian",
    "The Latest"
  ],
  "title": "Salt-Baked Whole Fish With Fresh Herbs",
  "full_text": "Salt-Baked Whole Fish With Fresh Herbs\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nResting Time\n5 mins\nTotal\n35 mins\nServes\n2\nto 4 Servings\nMakes\n1 Whole Fish\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n910\ng\n)\nkosher salt\n3/4\ncup\n(\n175\nml\n)\nwater\n1\n(\n1- to 2-pound; 450 to 910 g\n) whole fish, such as\nbass\n, snapper, porgy, dorade, trout, or branzino, scaled and gutted\nLemon slices, peeled\ngarlic cloves\n, peeled ginger slices, and/or fresh herb sprigs (such as parsley, dill, oregano, thyme, or tarragon), for stuffing\nExtra-virgin olive oil\n, for brushing and drizzling\nDirections\nPreheat oven to 400°F (205°C) and set rack to middle position. Line a rimed baking sheet with parchment paper. In a large mixing bowl, stir together salt and water until thoroughly mixed and salt is damp but not soggy.\nStuff fish cavity with aromatics of your choice, then lightly brush olive oil all over the fish on both sides.\nSpread about one-third of the salt mixture on the prepared baking sheet, covering an area just a little larger than the shape of the fish.\nSet fish on salt bed. If using a leave-in probe thermometer, insert it into thickest part of fish (if using a regular instant-read thermometer, see next step).\nFully cover fish with the remaining salt, making sure to pack salt all around the fish in an even layer about 1/2 inch thick. If using an instant-read digital thermometer, insert the probe of the thermometer into the salt to form a narrow hole leading to the thickest part of the fish (you will use this hole after the salt hardens to access the fish and check its temperature). Roast fish until center of the thickest part of the flesh registers 130°F (55°C), about 20 minutes for a 1-pound fish and 30 minutes for a 2-pound fish. Let rest 5 minutes.\nUsing a knife, carefully cut into salt crust along the length of the fish on the side near its belly, then gently crack open salt to uncover fish. Being careful not to get the salt crust mixed into the flesh, remove and discard skin, then\nfillet the cooked fish\nand transfer to a platter. Serve.\nSpecial Equipment\nLeave-in probe thermometer\nor\ninstant-read digital thermometer\n;\nrimmed baking sheet\n.\nFish\nItalian\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/salt-baked-whole-fish-with-fresh-herbs.webp?"
}