{
  "url": "https://www.seriouseats.com/sambal-stingray-malaysian-portuguese-baked-fish-8547831",
  "image_url": "https://www.seriouseats.com/thmb/wXp55lreavow460kLy_EeffkYjk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-SambalStingray-MichelleYip-00-83ccfbefbf5146c1ae95b51efe31d35f.jpg",
  "tags": [
    "Southeast Asian Cuisines",
    "Chile Pepper",
    "Fish",
    "The Latest",
    "Asian"
  ],
  "title": "Sambal Stingray (Malaysian-Portuguese Baked Fish)",
  "full_text": "Sambal Stingray (Malaysian-Portuguese Baked Fish)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nResting Time\n5 mins\nTotal\n75 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\nred onions\nor Asian shallots (about\n2\nmedium\nonions\nor\n8-10\nAsian\nshallots\n), peeled and roughly chopped\n1/2\nounce\n(\n15\ng\n) stemmed whole dried Kashmiri\nchilies\n(about\n30\ndried\nchiles\n), soaked for at least 20 minutes in hot water and drained\n1\nounce\n(\n30\ng\n)\ncandlenuts\n(about\n10\nwhole\ncandlenuts\n; see notes)\n3\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced (about\n2\nounces\n;\n60\ng\nsliced lemongrass)\n3\ntablespoons\n(\n45\nml\n)\nvegetable oil\n5\nmakrut lime leaves\n, roughly torn\nKosher salt\n1 1/2\npounds\n(\n600\ng\n) bone-in, skinless skate wing or skin-on\nsnapper fillets\n, cut into 2-by-4-inch pieces\nThawed frozen or fresh\nbanana leaves\n, cut into about\n3\n2-foot\nstrips\n1\ncalamansi or Persian\nlime\n, halved and seeded\nCooked white rice\n, for serving\nDirections\nAdjust oven rack to middle position and preheat oven to 350℉ (180℃). Line a quarter- or half-sheet pan or 10-inch cast-iron skillet with parchment paper or aluminum foil.\nSerious Eats / Michelle Yip\nIn the bowl of a food processor, add onions, soaked chiles, candlenuts, and lemongrass. Process until fairly smooth, 2 to 3 minutes, scraping down sides of food processor bowl if necessary.\nSerious Eats / Michelle Yip\nIn a wok or 10-inch skillet, heat vegetable oil over medium-high heat. Once oil begins to shimmer (but not smoke), scrape contents of food processor bowl into oil along with the makrut lime leaves. Bring to a bubble, then reduce heat to medium-low and cook the spice paste, stirring and scraping occasionally, until it takes on a deep brown color and begins to look ever so slightly shiny, about 30 minutes. Stir in 2 teaspoons (6g) salt and cook for 1 minute longer.\nSerious Eats / Michelle Yip\nPlace the banana leaves on the prepared baking sheet, darker side up, overlapping the leaves to fully cover the pan and overhang the sides. Sprinkle lightly with salt, then set the on top in a single even layer. Spoon cooked spice paste directly onto fish, spreading it to cover fish completely. Fold banana leaves over fish, then fold parchment or aluminum foil over all the ingredients, sealing edges into an airtight parcel (see notes).\nSerious Eats / Michelle Yip\nBake fish for 15-20 minutes if pieces are thinner than 1 inch, or 20-25 minutes if pieces are thicker than 1 inch (an instant-read thermometer inserted through the banana leaves into the center of the thickest part of a piece of fish within should register 140 to 150°F (60-65°C). Let rest in packet for about 5 minutes, then gently unwrap the foil and banana leaves. Transfer banana leaves and fish to a platter, squeeze calamansi or lime juice over the fish and serve immediately with warm rice on the side.\nSerious Eats / Michelle Yip\nSpecial Equipment\nFood processor, aluminum foil, half-sheet pan or 10-inch cast-iron pan\nNotes\nIf skate is unavailable, a similar weight of red snapper or sea bass can be used instead. In this case, the freshness of the fish is more important than the species, so use your judgment.\nCandlenuts are also known as kukui in Hawai’i, and are relatively common in Polynesian islands and Southeast Asia. They are macadamia-like in color and texture, though should be cooked before consumption as they are mildly toxic when raw.\nIt's also possible to cook the fish in the banana-leaf package without having to seal it with foil or parchment. To do so, line the baking sheet as directed with banana leaves, then spread the cooked spice paste in an even layer on the banana leaves. Set the fish on to, lightly season with salt, and fold the overhanging banana leaves in to close the package. Carefully flip the package so that the folded-over side is now on the bottom (the package will now remain closed without the assistance of parchment or foil). Cook as directed.\nMake-Ahead and Storage\nThe cooked fish keeps in an airtight container in the fridge for up to 5 days; reheat gently in the microwave.\nSoutheast Asian Cuisines\nChile Pepper\nFish\nThe Latest\nAsian"
}