{
  "url": "https://www.seriouseats.com/sambal-tumis-malaysian-chile-paste-7197954",
  "image_url": "https://www.seriouseats.com/thmb/iPe8nV2JA3YYU-1iqOkH36RJ7Lc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230309-SambalTumis-MichelleYip-HERO-SEA-774b88a576704429a8096676e63ddec4.JPG",
  "tags": [
    "Malaysian",
    "The Latest",
    "Southeast Asian",
    "Chile Pepper",
    "Asian"
  ],
  "title": "Sambal Tumis (Malaysian Chile Paste)",
  "full_text": "Sambal Tumis (Malaysian Chile Paste)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs\nTotal\n2 hrs 15 mins\nServes\n16 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2/3\nounce\n(\n19\ng\n)\ndried whole Kashmiri chiles\n(about\n18-20\nchiles\n), stemmed (see notes)\n1\nlarge\nred onion\n(\n12\nounces\n;\n340\ng\n), roughly chopped\n3\nmedium\ncloves garlic\n(\n15\ng\n)\n3\nounces\n(\n85\ng\n)\nwhole ikan bilis\n(Southeast Asian dried anchovies), cleaned (about\n2\nounces\n/\n60\ng\ncleaned; see notes)\n1 1/2\ncups\n(\n355\nml\n) neutral oil, such as\nvegetable oil\n, divided\n1 1/2\ntablespoons\npalm sugar\n(\n3/4\nounce\n;\n20\ng\n), preferably gula Melaka (see notes)\n2\ntablespoons\n(\n30\nml\n)\ntamarind concentrate\n, such as Tamicon\nKosher salt\nDirections\nIn a 2-quart saucepan, boil 2 cups (473ml) water over high heat. Meanwhile, using kitchen shears, cut the dried chiles diagonally into 1/4-inch-thick (0.5cm) strips. Massage the strips gently to release as many seeds as possible to the bottom of the bowl. Transfer chile strips without the seeds to the boiling water and let boil until chiles are softened, about 2 minutes. Using a slotted spoon or spider, lift chiles out of saucepan and transfer to heatproof plate, leaving any stray seeds behind (seeds will make the sambal bitter, so it's important to remove them all).\nUsing a food processor, process the onion and garlic, scraping down sides as needed, to a paste, about 30 seconds; scrape the onion and garlic paste into a bowl. Next, process the ikan bilis into fine powdery shards, 2 to 3 minutes; scrape into a separate bowl. Finally, process the boiled chiles with 1/2 cup (120ml) oil until well pureed, 3 to 5 minutes; transfer pureed chiles to a third bowl.\nSerious Eats / Michelle Yip\nIn a wok or large, deep stainless-steel skillet, heat the remaining 1 cup (235ml) oil over medium-low heat until shimmering. Add the onion and garlic paste, immediately reduce heat to low, and cook, stirring every few minutes, until the onions are very soft and translucent, about 35 minutes.\nSerious Eats / Michelle Yip\nStir in the ikan bilis and cook, stirring every few minutes, until the color deepens to a light brown and oil separates, about 10 minutes.\nSerious Eats / Michelle Yip\nStir in the chile puree and cook, stirring every few minutes, until color deepens and oil separates, about 35 minutes; be sure to lower the heat if it seems like the puree is foaming up or darkening too quickly, both signs that it's cooking too rapidly.\nSerious Eats / Michelle Yip\nStir in palm sugar, tamarind concentrate, and 1/2 cup (120ml) water. Cook, stirring often, until color is dark reddish brown, almost maroon-like, the sambal is thick, and oil has again separated from the paste, about 30 minutes longer; continue to regulate heat as needed so this process happens gently to avoid scorching the paste. (The exact color and consistency of the sambal is up to personal preference, though many nasi lemak stalls serve their sambal on the thicker, gloopier end, which is also my preference.) Remove from heat and season with salt.\nMichelle Yip\nServe as an accompaniment to\nnasi lemak\nor as a condiment with your preferred carbohydrate.\nSerious Eats / Michelle Yip\nSpecial Equipment\nFood processor\nNotes\nConsidering how much chile pepper Malaysians consumes, we don't really have specific names for different types of chiles like, say, Mexicans do. They're usually described instead by appearance: large chiles, dried chiles, etc. The chiles called for in this recipe are essentially Kashmiri chiles, those dry and wrinkly South Asian chiles that give a deep red color without rendering the final dish too spicy.\nIkan bilis can be found at any good Asian grocery store, especially those specializing in Southeast Asian imports. Ask for ‘dried anchovies’—every Southeast Asian country has their own name for it. They are sometimes sold already cleaned and gutted, but those will be more expensive; if yours aren't cleaned, you'll need to prep them by removing the heads, then splitting the fish lengthways so you can gut and debone it. The bigger varieties tend to be quite salty, so seek out the smaller varieties.\nPalm sugar is relatively easy to find, also at any good Asian grocery store. Thai palm sugar is a great substitute. Jaggery will do in a pinch. No need to grate or soften the palm sugar here, just chuck some chunks in roughly equal to 1 1/2 tablespoons; they will dissolve.\nMany Malay dishes are seasoned at the end, whether with salt or sugar. During pecah minyak, the mass of the ingredients is reduced as the moisture is cooked off, which means the final volume is much less than the starting volume. For this reason, it's important not to season early, or you risk concentrating the seasoning to unpalatable levels.\nMake-Ahead and Storage\nIf prepared properly, this sambal can be stored for up to 1 week on the counter, 3 weeks in the fridge, and up to 1 year in the freezer. Always use a clean and dry spoon when serving so the sambal does not get contaminated and lasts as long as possible.\nMalaysian\nThe Latest\nSoutheast Asian\nChile Pepper\nAsian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sambal-tumis-malaysian-chile-paste.webp?"
}