{
  "url": "https://www.seriouseats.com/sambal-belacan-malaysian-chile-paste-8430755",
  "image_url": "https://www.seriouseats.com/thmb/IXR16CyHt3jhWrQLnXnfJubO2k0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-SambalBelcan-MichelleYip-00-1bbbeaac1cb74fb2a5d4f6835b5bf544.jpg",
  "tags": [
    "Southeast Asian",
    "The Latest",
    "Condiments & Sauces",
    "Chile Pepper",
    "Asian"
  ],
  "title": "Sambal Belacan (Malaysian Chile Paste)",
  "full_text": "Sambal Belacan (Malaysian Chile Paste)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n5 mins\nCooling Time\n5 mins\nTotal\n25 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n1\nthumb-size\nchunk\n(\n20\ng\n) belacan (Malaysian-style fermented\nshrimp paste\n) or terasi (Indonesian-style fermented shrimp paste), plus more as needed\n2\nounces\n(\n60\ng\n) large, mild\nred chiles\n(about\n3\nchiles\n), such as Fresnos, stemmed\n1/2\nounce\n(\n15\ng\n) small, hot\nred chiles\n(about\n5\nchiles\n), such as bird’s eye chiles, stemmed\n1\ntablespoon\n(\n15\nml\n) calamansi or Persian\nlime juice\n, plus more as desired\nDirections\nLine an 8-inch stainless-steel skillet with aluminum foil, then place the belacan on the foil. Set the skillet over medium heat and toast, flipping the belacan every 30 seconds until darkened slightly, 2 to 5 minutes. Turn off the heat and set aside to cool.\nSerious Eats / Michelle Yip\nMeanwhile, if a less spicy final sambal is preferred, split chiles lengthways and discard the seeds and ribs. Cut the chiles into roughly 1-inch pieces, taking care to keep the two types of chile separate.\nSerious Eats / Michelle Yip\nPlace a few pieces of the larger mild red chiles and half the toasted belacan in the mortar (for a food processor or blender, see notes). While shielding the mortar with your non-dominant hand to contain mess and splatter, pound chiles and belacan into a paste. Once paste is formed, add the remaining larger mild red chiles, a few pieces at a time, until pounded into a smooth paste. The sambal at this point should be mildly spicy.\nSerious Eats / Michelle Yip\nTaste the sambal and increase the spice level to your preference by adding the small hot red chiles, a few at a time and tasting as you go, and pound into a smooth paste. Pound in more of the remaining toasted belacan, a pinch at a time, until desired flavor is achieved.\nSerious Eats / Michelle Yip\nStir in calamansi or lime juice, then taste and add more juice and season with salt to taste. Serve as part of a family-style meal with other dishes and rice.\nSerious Eats / Michelle Yip\nSpecial Equipment\nMortar and pestle\nNotes\nWe recommend opening your windows and turning on your exhaust while toasting the belacan, otherwise your kitchen will smell like belacan for several days. Alternatively, you could also use a toaster oven and toast the belacan on high heat for the same amount of time.\nAvoid adding all the chiles at once when pounding the sambal; it will be much messier and more difficult to pound them into a cohesive paste.\nTo prepare this in a food processor or blender, add the preferred amount of chiles and the toasted belacan to the bowl, blitz into a paste, adding small amounts of water if needed to get things moving, and stir in the lime juice after.\nMake-Ahead and Storage\nSambal belacan can be stored in an airtight container in the refrigerator for up to 1 week, and can be frozen for up to 6 months; defrost in the refrigerator or at room temperature, do not use heat.\nSoutheast Asian\nThe Latest\nCondiments & Sauces\nChile Pepper\nAsian"
}