{
  "url": "https://www.seriouseats.com/samgyetang-korean-rice-stuffed-chicken-soup",
  "image_url": "https://www.seriouseats.com/thmb/oPPe_FUKlWcZn7xmXiLXmHS5e9k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__03__20190314-Samgyetang-vicky-wasik-17-865db4610ee740d986786b689d9fecb6.jpg",
  "tags": [
    "Chicken Mains",
    "Korean",
    "Dairy-free Mains",
    "Stovetop Chicken",
    "Soups"
  ],
  "title": "Samgyetang (Korean Rice-Stuffed Chicken Soup) Recipe",
  "full_text": "Samgyetang (Korean Rice-Stuffed Chicken Soup) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n3 hrs 5 mins\nActive\n60 mins\nSoaking Time\n2 hrs\nTotal\n5 hrs 20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nsticky rice\n(\n7\nounces\n;\n200\ng\n)\n1\npiece\nhwanggi\n(황기 or milk vetch root; about\n1/3\nounce\n;\n10\ng\n), see note\n1\npiece\neomnamu\n(엄나무 or prickly castor-oil tree bark), see note\n2\nsmall young chickens or\nCornish hens\n(about\n14 ounces; 400 g\neach)\n6\nsmall\n(about 1 inch in length) or\n4\nlarge\n(about 2 inches in length)\ndried jujubes\n, pitted\n6\nwhole\nskinned gingko nuts\n(see note)\n2 to 4\nraw chestnuts\n, peeled\n2\npieces\nfresh ginseng\n(about 10 cm long), or\n2\nlarge\nslices dried ginseng\n4\nmedium\ncloves garlic\nThinly sliced scallions\n, for garnish\nA mixture of\nsalt\n, freshly ground black pepper, and ground toasted sesame seeds, for serving\nDirections\nIn a medium bowl, cover rice with 1 inch of cold water and soak for 2 hours. Drain rice.\nWash hwanggi and eomnamu under cold running water, using a clean brush to dislodge any grit. Place hwanggi and eomnamu in a large saucepan, cover with 2 quarts (2 liters) cold water, and soak for 2 hours.\nTransfer pot to the stovetop and bring to a simmer. Gently simmer hwanggi and eomnamu for 1 hour.\nMeanwhile, trim off chickens' wing tips, tail, and excess fat. Clean inside of chicken cavity well, trying to remove any blood stuck between the ribs.\nStuff each chicken with alternating layers of sticky rice, jujubes, gingko, chestnuts, ginseng, and garlic.\nUsing a paring knife, cut a small slit into the skin on either side of the cavity. Cross the drumsticks, inserting the end of each drumstick through the slit on the opposite side of the cavity (this trusses the bird and seals the cavity without the need for string).\nStrain the hwanggi and eomnamu from the broth, discarding the solids. Top up the broth with fresh water to equal 2 quarts (2 liters).\nIn a heavy, large pot or Dutch oven, arrange the stuffed birds side-by-side. Pour the broth over them. Cover and bring to a boil, then reduce heat and gently simmer until the birds are fully cooked through and tender, about 2 hours. If the broth doesn't fully cover the birds, rotate them halfway through cooking.\nTransfer each stuffed bird to a deep serving bowl or small earthenware pot and ladle the broth on top. Garnish with scallions and serve with the salt/pepper/sesame seed mixture alongside, so that each person can season the soup and chicken to their tastes.\nSpecial Equipment\nDutch oven\n,\n3-quart saucepan\n,\nfine-mesh strainer\nNotes\nHwanggi, eomnamu, and the other Korean ingredients can be found at well-stocked Korean markets; you may not always be able to find every single one, so just use what you can get. Some stores will sell pre-assembled samgyetang ingredient packets, which can make it easy to procure the essentials.\nIf your gingko nuts need to be peeled, roast them in a lightly oiled pan over medium heat, stirring frequently, until the nuts start popping out of their skins. Lower heat and continue cooking until skins have loosened even more. Transfer gingko nuts to a paper towel and rub together to fully remove their skins.\nMake-Ahead and Storage\nThe rice can be soaked and strained up to 1 day ahead, then kept in the refrigerator until ready to stuff the chickens. The soup can be made up to 5 days in advance, then gently reheated until chickens are completely heated through (use an instant-read thermometer to confirm the heat has penetrated to the center of the stuffing.\nRead More\nDak Juk (Korean Chicken and Rice Porridge) Recipe\nKorean Seaweed and Brisket Soup ( Miyeok-Guk) Recipe\nChicken Mains\nKorean\nDairy-free Mains\nStovetop Chicken\nSoups",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/samgyetang-korean-rice-stuffed-chicken-soup-recipe.webp?"
}