{
  "url": "https://www.seriouseats.com/sandwiched-grilled-pimento-cheese-ham-and-hom",
  "image_url": "https://www.seriouseats.com/thmb/bOZiDAyQbOOb8yjfbocM7xi50gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120416-127677-Sandwiched-Pimento-Cheese-Grilled-PRIMARY-e9fc54b1f0d04f9ab5cc531f8372f9b9.jpg",
  "tags": [
    "Sandwiches",
    "Stovetop",
    "Cheese",
    "Ham",
    "Quick Dinners"
  ],
  "title": "Grilled Pimento Cheese, Ham, and Homemade Pickles Sandwich",
  "full_text": "Grilled Pimento Cheese, Ham, and Homemade Pickles Sandwich\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\n45 mins\nSalting and Chilling Time\n2 hrs 5 mins\nTotal\n2 hrs 50 mins\nServes\n4 sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pickles:\n4\nKirby (pickling) cucumbers\n, sliced crosswise into 1/4-inch thick slices\n1\ntablespoon\nkosher salt\n1\ncup\nfresh dill\n, chopped\n1\ntablespoon\nblack\npeppercorns\n1\ntablespoon\ndill seeds\n1\ntablespoon\nmustard seeds\n1 1/2\ncups\ndistilled white vinegar\n2\ntablespoons\nsugar\n4\ngarlic\ncloves\n, peeled and smashed\n1/2\ncup\nice cubes\nFor the Pimento Cheese:\n4\ntablespoons\nmayonnaise\n1\ntablespoon\nfinely grated yellow or\nwhite onion\n2\nteaspoons\ndry mustard\n1/8\nteaspoon\ncayenne pepper\n2\ncups\n(\n8\nounces\n)\nextra-sharp orange cheddar cheese\n, finely grated\n4\nounces\ncream cheese\n, softened\n2/3\ncup\ndrained\njarred or canned\npiquillo peppers\n, finely chopped (see note)\n1\ntablespoon\nWorcestershire sauce\nSalt\nand pepper\nHot sauce\n(optional)\nFor the Assembly:\n8\nslices\nsturdy white sandwich bread\n(see note)\n6\ntablespoons\nunsalted butter\n, melted\n12\nslices\ndeli ham\nDirections\nFor the Pickles:\nToss cucumbers with salt in colander set over bowl. Allow to stand at room temperature for 1 hour. Discard all liquid released by cucumbers.\nPlace 1/2 cup fresh dill, peppercorns, dill seeds, and mustard seeds in square of cheesecloth and tie together. Place spice bag in a medium saucepan along with vinegar, sugar, and garlic and bring to boil over medium-high heat. Add cucumbers and reduce heat to medium-low.\nCook until cucumbers turn dark green, about 5 minutes. Transfer cucumbers and cooking liquid to bowl, add ice, and stir until melted. Chill, uncovered, at least 1 hour before serving. Discard spice bag and garlic and stir in remaining 1/2 cup fresh dill.\nFor the Pimento Cheese:\nMelt 2 tablespoons mayonnaise in a small skillet over medium heat. Add onion, dry mustard, and cayenne and cook, stirring often, until onion is softened, about 3 minutes. Transfer to a large bowl and cool to room temperature, about 5 minutes.\nAdd cheddar cheese, cream cheese, peppers, Worcestershire, and remaining 2 tablespoons mayonnaise to bowl and stir to thoroughly combine. Season to taste with salt, pepper, and optional hot sauce (see note).\nFor the Assembly:\nBrush one side of each slice of bread with melted butter, then flip so that un-buttered side is facing up.\nSpread 1/4 cup pimento cheese on each slice of bread. Arrange 3 slices ham on 4 slices bread. Top ham with enough pickles to cover. Press remaining cheese-spread slices (cheese side down) over pickles.\nHeat large skillet or griddle over medium heat. Cook sandwiches until golden and beginning to ooze cheese, 2 to 3 minutes per side. Transfer sandwiches to cooling rack and allow to rest 2 minutes before cutting in half. Serve with additional pickles.\nSpecial Equipment\nColander\n, medium\nsaucepan\n, cheesecloth, pastry brush, large\nskillet\nor\ngriddle\n,\ncooling rack\nNotes\nI prefer to use piquillo peppers because they are sharper, sweeter, and more flavorful than canned or jarred pimento peppers, but if you prefer pimentos, substitute them here.\nFor best results, use a sturdy loaf of bread, such as Pullman, and slice 3/4-inch thick.\nPimento cheese yields 2 cups, should you want to serve it on its own.\nMake-Ahead and Storage\nPickles may be made up to 2 weeks ahead and stored, refrigerated, in a covered container.\nPimento cheese may be made up to 1 week ahead and stored, refrigerated, in a covered container. Bring the spread to room temperature prior to using or serving.\nRead More\nThe Real History of Pimento Cheese\nPimento Cheese Recipe\nJalapeño Popper Grilled Cheese\nGrilled Cheese With Pepperoni and Pickled Cherry Peppers\nSandwiches\nStovetop\nCheese\nHam\nQuick Dinners"
}