{
  "url": "https://www.seriouseats.com/sandwiched-cuban-medianoche",
  "image_url": "https://www.seriouseats.com/thmb/Bi8nf3rHGYWjWcGVX2CG2bNniWs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231004-SEA-Medinoche-AmandaSuarez-31-058a8034349442c0b46d9b0482caacaa.jpg",
  "tags": [
    "Sandwiches",
    "Caribbean",
    "Roasted Pork",
    "Pork Loin"
  ],
  "title": "Cuban Medianoche Sandwich",
  "full_text": "Cuban Medianoche Sandwich\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n30 mins\nCooling Time\n35 mins\nTotal\n75 mins\nServes\n4 servings\nMakes\n4 sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork:\n1\npork\ntenderloin\n(\n3/4\npound\n;\n340\ng\n)\nKosher salt\nand freshly ground black pepper\n5\nmedium\ncloves\ngarlic\n, minced (about\n2\ntablespoons\n)\n1/4\ncup\n(\n60\nml\n)\nolive oil\n2\ntablespoons\n(\n30\nml\n)\njuice\nfrom\n1\norange\n1\ntablespoon\n(\n15\nml\n)\njuice\nfrom\n1\nlime\n1\nteaspoon\ndried oregano\n1/2\nteaspoon\nground cumin\nFor the Sandwiches:\n4\ntablespoons\n(\n60\ng\n)\nunsalted butter\n, softened (divided)\n1\ntablespoon\n(\n15\nml\n)\nyellow mustard\n4\n(\nsix-inch\n)\nChallah\nrolls\n(see note), split\n8\nslices\ndeli ham\n32\ndill or bread-and-butter\npickle chips\n8\nthin slices\nSwiss cheese\nDirections\nFor the Pork:\nAdjust oven rack to upper middle position and preheat oven to 450°F (230°C). Line a rimmed baking sheet with foil and set pork tenderloin on it. Poke pork tenderloin all over with a paring knife, then season all over with salt and pepper.\nSerious Eats / Amanda Suarez\nIn a 4-cup measuring cup, combine garlic and olive oil and microwave for 45 seconds. Stir in orange juice, lime juice, oregano, and cumin.\nSerious Eats / Amanda Suarez\nPour garlic mixture over pork tenderloin, rubbing into perforations; lift foil around tenderloin to form low walls around it (this will prevent the sauce from spreading out all over the baking sheet and burning). Roast until temperature reads 145°F (60°C) on instant-read thermometer, about 20 minutes. Let cool completely, about 30 minutes. Thinly slice pork on a bias.\nSerious Eats / Amanda Suarez\nFor the Sandwiches:\nIn a small bowl, stir together 2 tablespoons softened butter with mustard until well combined. Spread the cut sides of the rolls evenly with butter-mustard mixture.\nSerious Eats / Amanda Suarez\nTop roll bottoms with a layer of sliced roasted pork, 2 slices ham, 8 pickle chips, 2 slices cheese, and roll tops.\nSerious Eats / Amanda Suarez\nIn a 12-inch skillet, melt 1 tablespoon butter over medium heat until foaming. Add sandwiches and set a weight (such as a second heavy skillet) on top, pressing down with your hands to compress. Cook until toasted toasted, about 4 minutes. Lift weight, remove sandwiches, add remaining 1 tablespoon butter to skillet, and cook until melted. Return sandwiches to skillet, untoasted side down, and set weight on top once more, pressing down once again. Cook until toasted on second side and cheese is melted, about 4 minutes longer. Alternatively, heat a panini press according to manufacturer’s instructions and cook sandwiches until crisp and golden. Allow sandwiches to set about 2 minutes, then serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nRimmed baking sheet, foil, large skillet plus a weight (such as a second heavy skillet) or panini press, instant-read thermometer\nNotes\nMedianoches are usually made with \"pan suave,\" a soft, sweet bread. This recipe calls for easier-to-find 6 inch-long challah rolls, which are sweet and soft like the original. If you have access to pan suave, that will work as well if not better.\nMake-Ahead and Storage\nThe pork tenderloin can be roasted up to 1 day in advance; let cool, then transfer to an airtight container and refrigerate until ready to slice and use.\nSandwiches\nCaribbean\nRoasted Pork\nPork Loin",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/cuban-medianoche-sandwich.webp?"
}