{
  "url": "https://www.seriouseats.com/sangkaya-faktong-kabocha-pumpkin-custard-recipe-8746161",
  "image_url": "https://www.seriouseats.com/thmb/lC1L4JFRkiixeq6OYHjklnQ5LwM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241112-SEA-PumpkinCustard-ShriRepp-FINALHERO1-5a1447cc93ef40c68aa90cbc2f014622.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Custards, Mousses & Puddings",
    "Thai",
    "Fall"
  ],
  "title": "Sangkaya Faktong (Thai Kabocha Pumpkin Custard)",
  "full_text": "Sangkaya Faktong (Thai Kabocha Pumpkin Custard)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nCooling Time\n30 mins\nTotal\n100 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(237ml)\ncoconut milk\n9 small knobs (\n142\ng\n) pure\npalm sugar,\nchopped (see notes)\n2\nfresh\nor frozen\npandan leaves,\nthawed if frozen and tied into loose knots (see notes)\n1/2\nteaspoon\n(1.5g) Diamond Crystal kosher salt; for\ntable salt\nuse half as much by volume or the same weight\n4\nlarge\neggs\n1 tablespoon\n(9\ng\n)\nrice flou\nr (see notes)\n1\nsmall\nkabocha squash\n(2 pounds; 907g)\nDirections\nAdjust oven rack to middle position and preheat oven to 300°F (150°C). In a small saucepan, combine coconut milk, palm sugar, pandan leaves, and salt. Heat over medium-low heat, stirring occasionally, until sugar dissolves and mixture gets slightly frothy, 4 to 5 minutes. Do not let it boil.\nSerious Eats / Shri Repp\nIn a medium bowl, lightly whisk eggs and while whisking, gradually add rice flour until well combined. Still whisking, slowly add hot coconut milk mixture and whisk until well combined. Let sit while you prepare the kabocha squash.\nSerious Eats / Shri Repp\nFor the Squash:\nUsing a paring knife or pumpkin carving knife, remove the top of the pumpkin in one piece by cutting a 3-inch wide circle or pentagon around the pumpkin stem to form a lid (see notes). Remove the lid and set aside.\nSerious Eats / Shri Repp\nCarefully run edge of a large spoon (a Chinese soup spoon, particularly a metal one, works well here) along the cavity of the kabocha to loosen seeds and stringy pulp, then use spoon to scoop them out and scrape the cavity clean. Using the paring knife or edge of spoon, scrape seeds and pulp from the lid as well. Discard seeds and pulp or reserve for another use.\nSerious Eats / Shri Repp\nPlace the cleaned and prepped kabocha on a rimmed baking sheet. Hold a fine-mesh strainer over the kabocha opening and pour custard through the sieve directly into the squash. Fill until the custard just reaches the top of the inside cavity. (You may have a little extra custard; if so, pour into a ramekin and bake separately for a little treat for yourself.)\nSerious Eats / Shri Repp\nWrap the kabocha lid in foil and place it on the baking sheet next to the filled pumpkin. Bake until custard puffs up and is just set to the touch, with a slight jiggle in the center, 60 to 90 minutes. An instant-read thermometer should read 175°F (80°C) in the center of the custard.\nSerious Eats / Shri Repp\nCool at room temperature for at least 30 minutes or up to 2 hours. Carefully remove the foil from the kabocha lid and set back into top of the kombucha, enclosing the custard until ready to serve. Slice into 6 or 8 wedges. The dessert can be served warm, at room temperature, or chilled.\nSerious Eats / Shri Repp\nSpecial Equipment\nChinese-style metal soup spoon, fine-mesh strainer,\nbaking sheet\n,\ninstant-read thermometer\nNotes\nPandan leaves can be found at many Southeast Asian markets and are often sold frozen. If you don’t have pandan leaves, add 1 teaspoon (5g) clear pandan extract or vanilla extract after tempering eggs. Alternatively, you can omit it altogether, though pandan is well worth seeking out for its captivating aroma and flavor.\nThe best substitute for palm sugar is a combination of 1/3 cup (66g) light brown sugar and 1/3 cup (71g) granulated sugar.\nIf you don’t have rice flour, substitute 1 tablespoon (7.5g) all-purpose flour.\nTo steam sangkaya faktong instead of baking, place a steamer insert in a large pot and fill with water until it’s just under the steamer. Place the custard-filled pumpkin on the steamer, cover steamer with a lid, and steam over medium-low heat for 50 minutes to 1 hour.\nMake-Ahead and Storage\nThe pumpkin custard will keep for 3 to 5 days covered in the refrigerator. Don’t bother heating it up; some people say it tastes even better cold.\nDesserts\nThe Latest\nCustards, Mousses & Puddings\nThai\nFall",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sangkaya-faktong-thai-kabocha-pumpkin-custard.webp?"
}