{
  "url": "https://www.seriouseats.com/sauced-japanese-style-kewpie-mayonnaise-recipe",
  "image_url": "https://www.seriouseats.com/thmb/CIzBS5k46lVurEzgp6QjQkQw85s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__10__20131003-268452-kewpie-mayo-c175186320f94ccb8f484141994d9ea1.jpg",
  "tags": [
    "Japanese",
    "Dips"
  ],
  "title": "Japanese-Style (Kewpie) Mayo Recipe",
  "full_text": "Japanese-Style (Kewpie) Mayo Recipe\nClose\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nMakes\n1 1/4 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\n(\n30\nml\n)\nrice vinegar\n1\ntablespoon\nplus\n1\nteaspoon\n(\n20\nml\n)\nmalt vinegar\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nKosher salt\n; for table salt, use half as much by volume or the same weight\n1/2\nteaspoon\nMSG powder\n(see note)\n1/2\nteaspoon\nJapanese mustard powder\n1/8\nteaspoon\nhon-dashi powder\n(see note)\n1/8\nteaspoon\ngarlic powder\n2\nlarge\negg yolks\n(\n30\ng\n)\n1\ncup\n(\n240\nml\n)\nvegetable oil\nDirections\nIn a small bowl, whisk together rice vinegar, malt vinegar, salt, MSG, mustard powder, hon-dashi powder, and garlic powder until hon-dashi is completely dissolved.\nSerious Eats / Joshua Bousel\nPlace vinegar mixture in the work bowl of a food processor or in the bottom of a cup or jar that just fits the head of your immersion blender along with the egg yolks. Pulse to combine. The egg/vinegar mixture must reach the blades of the immersion blender for that method to work (see note). If the mixture does not reach the blades, double the recipe before attempting.\nSerious Eats / Joshua Bousel\nIf using a food processor, with the motor running, slowly drizzle in vegetable oil in a thin, steady stream until a thick emulsion forms. If using an immersion blender, pour all of the oil on top of the vinegar mixture and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and turn it on high speed, allowing it to run without pulsing or moving the blender head until a thick emulsion begins to form, about 15 seconds. As mayonnaise forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified. Transfer mayonnaise to an airtight container and refrigerate for up to 2 weeks.\nSerious Eats / Joshua Bousel\nSpecial Equipment\nFood processor\nNotes\nMonosodium glutamate\nis essential to the flavor of Japanese mayonnaise. It can be purchased from most Asian grocers under the Aji-No-Moto brand, in American supermarkets under the brand name Ac'cent, or online.\nHondashi\ncan be found in Japanese markets or ordered online.\nJapanese\nDips"
}