{
  "url": "https://www.seriouseats.com/sauce-gribiche-recipe-8643123",
  "image_url": "https://www.seriouseats.com/thmb/6Bl0V3QMHPLrVYPqC_XgBfGRz2Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240503-SEA-SauceGribiche-AmandaSuarez-18-861b9b4cef984646904a317304b0aa00.jpg",
  "tags": [
    "Eggs",
    "The Latest",
    "French",
    "Condiments & Sauces"
  ],
  "title": "Sauce Gribiche",
  "full_text": "Sauce Gribiche\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nChilling Time\n15 mins\nTotal\n35 mins\nServes\n6\nto 10 servings\nMakes\n1 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\neggs\n2\ntablespoons\n(\n30\nml\n) white or\nred wine vinegar\n1\ntablespoon\n(\n15\nml\n) Dijon\nmustard\nKosher salt\nand freshly ground black pepper\n1\ncup\n(\n237\nml\n)\nextra-virgin olive oil\nor neutral oil such as canola (or a combination)\n10\ncornichons\n(about\n2\nounces\n;\n57\ng\n), finely diced\n2\ntablespoons\ndrained brined\ncapers\n(\n1\nounce\n;\n28\ng\n), minced\n2\ntablespoons\nminced fines\nherbes\n(an equal-parts combination of flat-leaf parsley leaves and tender stems, tarragon leaves, and chervil sprigs; see note)\nDirections\nBring 3 quarts (2.8L) water to a boil in a large pot and prepare an ice bath. Carefully lower eggs into pot and continue to boil for 30 seconds. Cover tightly, reduce heat to low (water should maintain a bare simmer), and continue cooking for 9 minutes for jammy yolks or 11 minutes for hard-cooked yolks (see headnote above for guidance on how the degree of yolk doneness can affect the sauce). Immediately transfer eggs to ice water and allow to cool for at least 15 minutes, then peel under cool running water. Halve eggs lengthwise and scoop yolks into a medium mixing bowl, blender, or food processor. Finely dice egg whites.\nSerious Eats / Amanda Suarez\nAdd vinegar, mustard, and a pinch of salt and pepper to the egg yolks. Whisk, blend, or process until yolks are almost entirely combined with the other ingredients and very few if any yolky lumps remain. While continuously whisking or blending, slowly drizzle in oil in a thin, steady stream. The sauce should emulsify, but it may break more easily with hard-cooked yolks (see headnote above on why you may or may not want this); you can also whisk less vigorously and/or add the oil much faster to deliberately create a broken sauce.\nSerious Eats / Amanda Suarez\nStir in cornichons, capers, herbs, and egg whites until well combined. Season with additional salt and pepper, if desired, then serve or refrigerate in an airtight container until ready to use.\nSerious Eats / Amanda Suarez\nNotes\nChervil, an herb with delicate lacy fronds and a subtle anise flavor, is a very difficult herb to find in US markets. It is fine to omit it and use only parsley and tarragon instead. You can also use just parsley if you can't find tarragon (I've done it, it works!), but that will eliminate one essential flavor from the sauce.\nMake-Ahead and Storage\nSauce gribiche can be refrigerated in an airtight container for up to 4 days.\nEggs\nThe Latest\nFrench\nCondiments & Sauces"
}