{
  "url": "https://www.seriouseats.com/sauteed-mushrooms-recipe-7972096",
  "image_url": "https://www.seriouseats.com/thmb/Ff3Ylm1ZshqMc3ZZRusLtF7fKYE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230920-SEA-SauteedMushrooms-Amanda-Suarez-hero2-4f6b5494c8bb41cfb9dc5c51f76cde99.jpg",
  "tags": [
    "Vegetable Sides",
    "The Latest",
    "Stovetop Vegetables",
    "Mushrooms"
  ],
  "title": "Sautéed Mushrooms",
  "full_text": "Sautéed Mushrooms\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nTotal\n35 mins\nCook Mode\n(Keep screen awake)\nIngredients\n4\ntablespoons\n(\n50\ng\n)\nunsalted butter\n, divided\n1\nsmall\nshallot\n(\n2\nounces\n;\n57\ng\n), minced\n2\npounds\n(\n905\ng\n) mixed\nmushrooms\n, such as cremini, white button, portobello, oyster, shiitake, and/or maitake, cleaned and trimmed (see notes)\n3/4\nteaspoon\nkosher salt\n; if using table salt use half as much by volume\nFreshly cracked\nblack pepper\n1\nteaspoon\nminced\nfresh thyme\nleaves\n1\nmedium\ngarlic clove\n, minced\n1\ntablespoon\n(\n15\nml\n)\nwhite wine vinegar\n(see notes)\n2\ntablespoons\nwater\nDirections\nCut the mushrooms based on the variety used: Stem and halve portobello mushrooms and cut into 1/2-inch pieces. Trim white button or cremini mushrooms; quarter them if large or medium (about 1 1/2 to 3-inches in diameter) or halve them if small (about 1 to 1 1/2-inches in diameter). Tear trimmed oyster mushrooms into about 1-inch pieces. Stem shiitake mushrooms; quarter large caps (about 1 1/2- to 3-inches in diameter) and halve small caps (about 1 to 1 1/2-inches in diameter). Cut trimmed maitake (hen-of-the-woods) mushrooms into about 1-pieces.\nSerious Eats / Amanda Suarez\nIn a 12-inch skillet, melt 2 tablespoons (25g) butter over medium heat. Add shallot and cook, stirring frequently, until softened, 1 to 2 minutes. Add cut mushrooms and salt and increase heat to medium-high. Cover and cook, stirring occasionally, until mushrooms have released their liquid, 8 to 10 minutes.\nSerious Eats / Amanda Suarez\nRemove lid, add remaining 2 tablespoons (25g) butter, and cook, stirring occasionally, until mushrooms are deep golden brown and tender, about 15 minutes. Stir in thyme and garlic and cook until fragrant, about 30 seconds. Add vinegar and water and cook, scraping up any browned bits, until liquid is nearly evaporated, about 1 minute. Season with salt and pepper to taste. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-inch skillet with lid\nNotes\nThis recipe is flexible: You can use a single variety of mushroom or any combination of the mushroom varieties listed.\nWhile I opt for white wine vinegar because it is a pantry-staple for me and offers a fairly neutral pop of acidity, any type of vinegar, such as red wine vinegar or apple cider vinegar, can work. You can also use another acid like lemon juice, or even regular dry red or white wine. If substituting wine for the vinegar, use 1/4 cup (60ml) and omit the added water.\nVegetable Sides\nThe Latest\nStovetop Vegetables\nMushrooms"
}