{
  "url": "https://www.seriouseats.com/savory-crinkle-pie-recipe-8721913",
  "image_url": "https://www.seriouseats.com/thmb/SK-Ic8LuOmqO4e2WHRM4VUZcwss=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241002-SEA-SavoryCrinklePie-FredHardy-Hero-14-64a2ab9eccf64c448ae19b9077195a91.jpg",
  "tags": [
    "Savory",
    "The Latest",
    "Butternut Squash",
    "Baking"
  ],
  "title": "Savory Crinkle Pie",
  "full_text": "Savory Crinkle Pie\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nTotal\n90 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1/2 cup unsalted\nbutter,\n(4 ounces;\n115\ng)\nmelted and divided\n12 ounces (\n340\ng)\nphyllo pastry sheets, t\nhawed (from one 16-ounce package)\n2\ntablespoons (\n30ml)\nextra-virgin olive oil\n2 large\nshallots\n(4 ounces; 120g total), thinly sliced (about\n2/3 c\nup)\n2 medium\ngarlic cloves\n(10\ng)\n, finely chopped\n1/2\nteaspoon\nfinely\nchopped fresh thyme\n, plus more leaves for garnish\n1/4\nteaspoon\nground\naleppo pepper\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\n1/2\nteaspoon\nfreshly\nground black pepper, divided\n2 ounces (58g)\nlacinato kale\n, stemmed and chopped (\n2\ncups)\n2 tablespoons\n(30\nml)\nwater\n10 ounces\n(283\ng)\nbutternut squash\n, peeled, seeds removed, and cut lengthwise, then cut crosswise into thin half-moons (2 cups)\n3/4 cup (\n180\nml)\nwhole milk\n2\nlarge\neggs\nOne (5.2-ounce;\n150\ng)\npackage of garlic and herb flavored\nGournay cheese\n(such as Boursin), at room temperature\n2\nteaspoons\ngrated lemon zest\nfrom 1 lemon, plus more for garnish\n7 ounces\nfeta cheese,\ncrumbled (about\n1 1/2\ncups)\nHoney,\nfor\ndrizzling\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F(175℃). Using a pastry brush, brush a 9- x 13-inch baking pan with melted butter; set aside remaining unused melted butter.\nSerious Eats / Fred Hardy\nUnroll phyllo sheets. Stack 2 sheets together and using your fingers, scrunch up in an accordion-like fashion. No need to be super precise and it’s OK if the sheets tear or crack; you just want to aim for the pleats to be about 1-inch wide. Arrange in prepared baking pan, with peaks standing and facing up. Repeat with remaining phyllo sheets and layer into pan until pan is completely filled with the pleated phyllo. Bake until top is lightly golden and crisp, about 15 minutes.\nSerious Eats / Fred Hardy\nMeanwhile, in a large skillet, heat oil over medium heat until shimmering. Add shallots and cook, stirring occasionally, until softened, about 6 minutes. Add garlic, thyme, aleppo pepper, 1/4 teaspoon salt and 1/4 teaspoon pepper and cook, stirring constantly, until fragrant, about 1 minute. Add kale and water and cook, stirring often, until kale is wilted and tender and water evaporated, about 5 minutes. Set mixture aside to cool slightly until ready to use.\nSerious Eats / Fred Hardy\nOnce phyllo is crisp and golden, remove pan from oven. Arrange and tuck sliced butternut squash in between the folds and pleats of the par-baked phyllo. Sprinkle with 1/2 teaspoon salt and drizzle and brush evenly with remaining reserved melted butter. Return to oven and bake until squash begins to soften, about 10 minutes.\nSerious Eats / Fred Hardy\nMeanwhile, in a medium bowl, whisk milk, eggs, Gournay cheese, lemon zest, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon black pepper until smooth; set aside.\nSerious Eats / Fred Hardy\nRemove pan from oven. Sprinkle reserved shallot and kale mixture and crumbled feta over the squash and phyllo. Use your fingertips to gently push the vegetables and feta in between the layers. Pour the milk mixture evenly over top. Return to oven and bake until squash is tender, custard is set, and pie is browned around the edges and golden on top, 30 to 35 minutes. Let cool for 10 minutes.\nSerious Eats / Fred Hardy\nDrizzle with honey and garnish with additional thyme leaves and lemon zest. Slice and serve hot or at room temperature.\nSerious Eats / Fred Hardy\nSpecial Equipment\n9- x 13-inch baking pan, pastry brush, large skillet\nMake-Ahead and Storage\nThe entire baked pie or any leftovers can be covered and refrigerated for up to 3 days. Reheat in a 325℉ (160℃) oven, covered with foil, until warmed through, or let sit on counter until it reaches room temperature before serving.\nSavory\nThe Latest\nButternut Squash\nBaking",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/savory-crinkle-pie.webp?"
}