{
  "url": "https://www.seriouseats.com/savory-sweet-and-spicy-applesauce-recipe-8642450",
  "image_url": "https://www.seriouseats.com/thmb/-9fmTjZjP0roigVvsphapcahz1Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240502-SweetandSourApplesauce-MaureenCelestine-33-fbd2d3dd632e46279617562749d6fda9.jpg",
  "tags": [
    "Condiments & Sauces",
    "The Latest",
    "Sides",
    "Apple"
  ],
  "title": "Sweet and Spicy Applesauce",
  "full_text": "Sweet and Spicy Applesauce\nClose\nJump to recipe\nPrep\n5 mins\nCook\n55 mins\nTotal\n60 mins\nServes\n8\nto 10\nMakes\n1 1/2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nunsalted butter\n(\n42\ng\n), divided\n1\nstick\ncinnamon stick\n1\ntablespoon\n(\n4\ng)\ncoriander seeds\n, cracked\n1\nmedium\nred onion\n(\n8\nounces\n;\n225\ng\n), finely chopped (about\n1\ncup\n)\n1\nteaspoon\nminced\njalapeño\n, plus more to taste\n2\ngarlic\ncloves\n(\n10\ng\n), minced\n1\nteaspoon\nground ginger\nor\n1\nteaspoon\ngrated\nfresh ginger\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same by weight\n1\ncup\n(\n7 1/2\nounces\n;\n212\ng\n) packed\ndark brown sugar\n, plus more to taste\n1\ncup\n(\n240\nml\n)\napple cider\n2/3\ncup\n(\n160\nml\n)\napple cider vinegar\n, plus more as desired\n1\nteaspoon\n(\n8\ndashes\n) Angostura\nbitters\n(optional)\n1\nteaspoon\n(\n4\ng\n) black/\nbrown mustard\nseeds toasted (and cracked if desired)\n8\nmedium\n-sized (\n3\npounds\n6\nounces\n,\n1.52\nkg\n) Cripps Pink\napples\n, also known as Pink Lady apples, peeled, cored, and cut into 1-inch chunks\n3\ntablespoons\n(\n45\nml\n) fresh\nlemon juice\nfrom\n1\nwhole\nlemon\nDirections\nIn a large Dutch oven or large heavy-bottomed pot, heat 2 tablespoons butter until melted, then add cinnamon stick and coriander seeds, and toast, stirring constantly, until just fragrant, about 1 minute. Add onion, jalapeño, garlic, ginger, and salt and cook, stirring occasionally, until the onion just softens, about 2 minutes. Add sugar, stir, and continue to cook, uncovered, until sugar is dissolved, about 30 seconds.\nSerious Eats / Maureen Celestine\nRemove pot from heat and let cool slightly for 2 minutes. Stir in the apple cider, apple cider vinegar, Angostura bitters, if using, and mustard seeds. Return the pot to medium-high heat, and bring to a boil. Once boiling, stir in apples, then lower and adjust heat as needed to maintain a simmer. Cover pot and simmer until apples are tender and liquid has thickened enough that the base of the pot is dryish when you pull a spoon across the bottom, 30 to 35 minutes. (Test the apples texture by pressing apple pieces against the side of the pot with a spoon or spatula; when fully cooked, the apples will turn mushy and fall apart easily.)\nSerious Eats / Maureen Celestine\nTaste applesauce and adjust the flavor to taste by adding brown sugar for more sweetness; vinegar for more acidity; and/or jalapeño for more heat, if needed. If adding ingredients to taste, continue to cook for 1 additional minute after the additions, then remove from heat. Discard the cinnamon stick.\nSerious Eats / Maureen Celestine\nDepending on your preference for consistency, mash the applesauce with a potato masher, blend with an immersion blender, or purée part (or all) in small batches in a blender or food processor.\nSerious Eats / Maureen Celestine\nReturn mashed or puréed applesauce to the pot, cover, and bring to a simmer over medium-low heat, stirring frequently until heated through and the flavors meld, about 10 minutes.\nSerious Eats / Maureen Celestine\nRemove from heat, stir in lemon juice and remaining 1 tablespoon butter. Serve warm, at room temperature, or cold.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nKitchen scale, potato masher, immersion blender, or food processor\nNotes\nIf you can’t find Cripps Pink, you can substitute Cortland, Honeycrisp, Fuji, Jazz, Gala, Braeburn, or Jonagold apples and add one or two Granny Smiths for tartness.\nYou can use a serrano chile or a Thai green chile in place of the jalapeño, varying the amount to suit your taste. When mincing the chile, you can leave the seeds and ribs in if you like your applesauce spicy, or remove them to temper the heat. I recommend using gloves when handling chiles.\nVariations\nSometimes, I fold in pickled red onion slices and diced pickled red or green jalapeños after it is cooked for color, flavor, and textural contrast.\nMake-Ahead and Storage\nOnce cooled to room temperature, refrigerate in an airtight container for up to 1 week, or freeze for up to 1 year. To use from frozen, thaw overnight in the fridge. Serve cold or at room temperature, or transfer to a saucepan and gently reheat over low heat.\nCondiments & Sauces\nThe Latest\nSides\nApple"
}