{
  "url": "https://www.seriouseats.com/savory-cheese-souffle",
  "image_url": null,
  "tags": [
    "French",
    "Savory",
    "Gruyere",
    "Parmesan",
    "Breakfast & Brunch"
  ],
  "title": "Savory Cheese Soufflé Recipe",
  "full_text": "Savory Cheese Soufflé Recipe\nJump to recipe\nPrep\n25 mins\nCook\n50 mins\nActive\n30 mins\nTotal\n75 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n, plus more for greasing the dish\n2\ntablespoons\ngrated Parmigiano-Reggiano\nor Grana Padano cheese, for dusting the dish\n3 1/2\ntablespoons\n(\n1\nounce\n;\n28\ng\n)\nall-purpose flour\n(see note)\n1\ncup\n(\n235\nml\n)\nwhole milk\nKosher salt and freshly ground black pepper\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n(optional; see note)\n1\npinch\ncayenne pepper\nor two dashes hot sauce (optional; see note)\n4\nlarge\negg yolks\n5\nlarge\ncold egg whites\n1/2\nteaspoon\ncream of tartar\n(optional; see note)\n3\nounces\n(\n85\ng\n)\nfreshly grated Gruyère\nor other semifirm cheese, such as cheddar\nDirections\nPreheat oven to 400°F (200°C) for a more browned soufflé with a slightly looser center or 375°F (190°C) for a more gently cooked soufflé that sets all the way through. Set oven rack in lowest position. Grease interior of a 48-ounce ramekin with softened butter. Add some grated Parmigiano-Reggiano, rotating ramekin all around so cheese sticks to every part of buttered surface; add more cheese if you don't have enough or discard any excess. Wipe rim of soufflé dish and transfer prepared ramekin to the refrigerator until ready to use.\nSerious Eats / Vicky Wasik\nIn a small saucepan, melt 3 tablespoons butter over medium-high heat (do not allow it to brown). Add flour and whisk to form paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of pan to maintain a lump-free texture. Sauce will initially become very thick, then get thin once all the milk is added.\nHeat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring and scraping the sides and bottom of pan, until sauce is nicely thickened, about 3 minutes. Season generously with salt and pepper. Transfer béchamel sauce to a large heatproof mixing bowl and allow to cool slightly.\nWhisk Dijon mustard (if using) and cayenne or hot sauce (if using) into béchamel. Then, while whisking constantly, work in egg yolks one at a time until thoroughly blended. Set soufflé base aside.\nIn a large mixing bowl, using a French whisk, electric hand blender, or stand mixer fitted with whisk attachment, combine egg whites with cream of tartar (if using) and beat until firm, glossy peaks form.\nSerious Eats / Vicky Wasik\nAdd 1/3 of beaten egg whites to béchamel base and stir well until whites are thoroughly combined and soufflé base has a looser consistency. Mix in Gruyère. Using a silicone spatula, gently fold remaining beaten egg whites into soufflé base until just combined.\nSerious Eats / Vicky Wasik\nRemove soufflé dish from refrigerator and set on rimmed baking sheet. Scrape soufflé batter into prepared baking dish, filling it up to the inner ridge, not to the top (discard any excess). If desired, using an offset or other spatula, gently smooth and level surface of the soufflé batter.\nSerious Eats / Vicky Wasik\nTransfer soufflé to oven and bake until well risen and nicely browned on top, about 30 minutes at 400°F (200°C) for less set and 35 minutes at 400°F for more set, and 35-40 minutes at 375°F (190°C) for fully set.\nSerious Eats / Vicky Wasik\nImmediately transfer soufflé to table and serve before it deflates too much, scooping out portions onto each diner's plate.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n48-ounce\nramekin\n;\nFrench whisk\n,\nhand mixer\n, or\nstand mixer\nNotes\nIf desired, you can decrease the flour to 3 tablespoons (24g) for a slightly thinner béchamel sauce and a slightly lighter, but less sturdy, soufflé.\nMustard and cayenne pepper or hot sauce add subtle flavor to the soufflé but are not absolutely necessary.\nCream of tartar is not required, but it can help prevent accidentally overbeating the egg whites; if you have it, you might as well add it.\nRead More\nAwendaw Soufflé (Grits Soufflé) Recipe\nChocolate Soufflé Recipe\nSoufflé Omelette With Cheese Recipe\nHow to Beat Egg Whites\nDo Yolk and Grease Really Ruin Egg Whites for Beating?\nFrench\nSavory\nGruyere\nParmesan\nBreakfast & Brunch"
}