{
  "url": "https://www.seriouseats.com/savory-carrot-tart-recipe-11700697",
  "image_url": "https://www.seriouseats.com/thmb/jn7yRh4g-PD6LPXjZlf4zXN6_vc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250320-SEA-SavoryCarrotTart-JenCausey-Beauty1-33-9a3344bfa0be4fb59defd7c7424454de.jpg",
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Easter",
    "Carrots",
    "Pastries"
  ],
  "title": "Savory Carrot Tart",
  "full_text": "Savory Carrot Tart\nClose\nJump to recipe\nPrep\n20 mins\nCook\n50 mins\nCooling Time:\n10 mins\nTotal\n80 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n907\ng\n) medium\ncarrots\n(about 1-inch in diameter at thickest point), peeled and trimmed\n5\nteaspoons\n(\n25\nml\n)\nextra-virgin olive oil\n, divided\n1 1/2\nteaspoons\n(\n5\ng\n) Diamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume or the same weight\n1\nteaspoon\ngarlic powder\n, divided\n1\nteaspoon\nground ginger\n, divided\n1\ntablespoon\n(\n15\nml\n)\napple cider vinegar\n1\ntablespoon\n(\n15\nml\n)\nDijon mustard\n1\ntablespoon\n(\n15\nml\n)\nhoney\n, divided\n1\nsheet\nfrozen puff pastry\n, thawed\nAll-purpose flour\n, for rolling puff pastry\n8\nounces\n(\n226\ng\n)\ndouble cream Brie cheese\n, thinly sliced\n1\nlarge\negg yolk\n, beaten\nFreshly ground\nblack pepper,\nfor serving\nFresh\nthyme leaves\n, for serving\nDirections\nAdjust oven rack to lower third position; preheat oven to 400°F (205°C). Slice 2 carrots crosswise into 1/2-inch-thick rounds; halve remaining carrots lengthwise.\nSerious Eats / Jen Causey\nOn a rimmed baking sheet, toss all carrots with 1 tablespoon oil, 1 1/4 teaspoons salt, 1/2 teaspoon garlic powder, and 1/2 teaspoon ground ginger until evenly coated. Arrange carrot rounds and lengths in a single layer, cut side down. Roast until carrots are tender and lightly browned at edges, about 25 minutes. Let cool slightly, about 5 minutes; keep oven on.\nWhile carrots are roasting, in a large bowl, thoroughly whisk vinegar, mustard, honey, remaining 1/2 teaspoon garlic, remaining 1/2 teaspoon ginger, and remaining 1/4 teaspoon salt. Drizzle in remaining 2 teaspoons oil while whisking constantly.\nSerious Eats / Jen Causey\nLine a rimmed baking sheet with parchment paper and set aside. On a lightly floured work surface, use a rolling pin to roll puff pastry sheet into a 13- by 11-inch rectangle. Transfer to parchment-lined sheet. Using a pairing knife, lightly score a border around perimeter of puff pastry, about 1/2 inch from edges. Using a fork, prick pastry at 1-inch intervals inside the border (do not prick the border). Loosely cover with plastic wrap, and refrigerate until ready to bake.\nSerious Eats / Jen Causey\nWhen ready to bake, arrange Brie slices in an even layer inside scored border of pastry. Arrange carrot rounds and lengths on top of cheese; drizzle and brush evenly with 2 tablespoons honey-mustard mixture. Lightly brush edges of pastry with beaten egg yolk.\nSerious Eats / Jen Causey\nSerious Eats / Jen Causey\nSerious Eats / Jen Causey\nSerious Eats / Jen Causey\nBake until cheese is melted and pastry is deeply browned on edges and crisp on bottom, 25 to 35 minutes. Transfer baking sheet to a wire rack and let cool 5 minutes. Transfer tart to cutting board and drizzle top with remaining honey-mustard mixture and garnish with black pepper and thyme leaves. Slice and serve warm or at room temperature.\nSerious Eats / Jen Causey\nSpecial Equipment\n2 rimmed baking sheets, parchment paper\nMake-Ahead and Storage\nThis tart is best served right after baking, but leftovers can be refrigerated for up to 3 days. To reheat, transfer to a parchment paper–lined rimmed baking sheet, cover loosely with aluminum foil, and heat in a 350°F (175°C) oven until warmed through, cheese is softened, and puff pastry is recrisped.\nSnacks & Appetizers\nThe Latest\nEaster\nCarrots\nPastries"
}