{
  "url": "https://www.seriouseats.com/schmaltz-krispie-treats-recipe-8718340",
  "image_url": "https://www.seriouseats.com/thmb/fas0e5-P-zoYNySTXgmQKtghbIQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240925-SchmaltzKrispieTreats-04-181a5e16718d4f1ca6d3d6231200cba7.jpg",
  "tags": [
    "Dessert Bars",
    "The Latest",
    "Snacks & Appetizers"
  ],
  "title": "Schmaltz Krispies Treats",
  "full_text": "Schmaltz Krispies Treats\nClose\nJump to recipe\nPrep\n25 mins\nCook\n100 mins\nTotal\n2 hrs 5 mins\nServes\n9\nto 12 servings\nMakes\n9 bars\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(340g)\nchicken skin\nand fat (see notes)\n1\nlarge\nyellow onion\n(12 ounces; 340g), finely diced (about 1 1/2 cups)\n6\ncups\n(165g)\nRice Krispies\n1\nteaspoon\nDiamond Crystal\nkosher salt\n(for table salt, use half as much by volume), plus more as needed\nNonstick cooking spray\n2\nteaspoons\ndry\nonion soup mix\nfrom one 1-ounce packet (preferably Lipton)\nOne 12-ounce (\n340\ng\n) bag\nmarshmallows\n(any size)\n4 teaspoons\nEverything Bagel Seasoning\nor 1 1/2 cups finely chopped dried apricots, optional\nDirections\nUsing a very sharp knife or good kitchen shears, cut chicken skin and fat into roughly 1/4- to 1/2-inch pieces (if using a knife, it helps to freeze the skin and fat for 30 minutes before cutting).\nSerious Eats / Amanda Suarez\nIn a large nonstick skillet, combine chicken skin and fat with enough water to barely cover. Bring to a simmer over medium-high heat, then reduce heat to medium-low and cook, stirring frequently, until the water has entirely evaporated and the chicken has just started to turn brown, about 1 hour. Add diced onion and cook, stirring often, until the onion is golden and the chicken skin has crisped and is thoroughly browned, about 25 minutes.\nSerious Eats / Amanda Suarez\nMeanwhile, preheat oven to 325°F (160°C) and set racks in upper- and lower-middle positions. Line 2 rimmed baking sheets with parchment paper, then divide rice krispies between them and spread in an even layer. Toast in the oven, stirring with a silicone spatula every 3 minutes, until evenly golden brown, about 10 minutes. Set aside to cool slightly.\nSet a fine-mesh strainer over a heatproof bowl and strain the chicken fat through it; you should have about 1/2 cup of schmaltz. Transfer the gribenes (crispy skin and onions) to a paper towel–lined plate and season with a pinch of salt. Let cool (if some pieces are too large, you can further chop them now).\nSerious Eats / Amanda Suarez\nLine 2-quart baking dish (see Special Equipment, below) with parchment overhanging the 2 long sides and coat with nonstick cooking spray; set aside. In a large (6-quart) pot, heat 6 tablespoons schmaltz over medium-low heat until shimmering. Add onion soup mix and the 1 teaspoon salt and cook, stirring often, until the dried onion pieces have turned golden, about 1 1/2 minutes. Add marshmallows and cook, stirring with a silicone spatula and scraping the bottom and sides of the pot, until marshmallows have melted, between 2 and 4 minutes depending on the size of marshmallows.\nSerious Eats / Amanda Suarez\nFold in Rice Krispies and reserved gribenes until thoroughly combined. If desired, stir in the everything bagel seasonings or dried apricots.\nSerious Eats / Amanda Suarez\nTransfer mixture to the prepared baking dish and press into an even layer. Let cool until fully set, at least 30 minutes. To portion, use the parchment to transfer Rice Krispy treats to a work surface, then discard parchment. Use a serrated knife to cut into your desired size and shape.\nSerious Eats / Amanda Suarez\nNotes\nChicken skin and fat can either be collected over time from chicken trimmings and kept in the freezer, or purchased directly from a butcher (if going to a butcher, it helps to call a day ahead to request them to save fat and skin trimmings).\nSpecial Equipment\nRoughly 2-quart baking dish or pan (various dimensions of baking dish will work, including a 9- by 13-inch baking dish, or an 8-inch square cake pan).\nMake-Ahead and Storage\nThe bars can be kept in an airtight container at room temperature for up to 2 days.\nDessert Bars\nThe Latest\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/schmaltz-krispies-treats.webp?"
}