{
  "url": "https://www.seriouseats.com/scottish-oatcakes-recipe-8778411",
  "image_url": "https://www.seriouseats.com/thmb/_g3hq7vGTHUWexUWuofX8KfAXL4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2025116-SEA-OatCakes-AmandaSuarez-hero-b3a9071ac87a4126ba5d611c1b5c2dad.jpg",
  "tags": [
    "Oats",
    "The Latest",
    "Snacks & Appetizers",
    "Baking",
    "British"
  ],
  "title": "Scottish Oatcakes",
  "full_text": "Scottish Oatcakes\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nChilling Time\n30 mins\nTotal\n65 mins\nServes\n16 oatcakes\nMakes\n16 oatcakes\nCook Mode\n(Keep screen awake)\nIngredients\n226\ng\nScottish or quick-cooking\noats\n(\n8\nounces\n;\n2 1/2\ncups\n), see notes\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nbaking soda\n6\ntablespoons\nmelted clarified butter or\nghee\n,\nhomemade\nor store-bought (\n2 1/4\nounces\n;\n66\ng\n)\n3/4\ncup\nhot\nwater\n, around 200ºF (93ºC)\nDirections\nAdjust oven racks to second-from-top and second-from bottom positions. Preheat to 350ºF (175ºC).\nIn a medium bowl, stir oats, salt, and baking soda to combine. Add melted clarified butter or ghee to oat mixture and, using a flexible spatula, toss to evenly coat oats with fat. Add hot water and stir until mixture begins to thicken, 30 seconds to 1 minute. Let sit until oat mixture has hydrated and is slightly sticky, about 5 minutes.\nSerious Eats / Amanda Suarez\nUsing a flexible spatula, scrape oat mixture onto a 18- by 13-inch piece of parchment. Top with another 18- by 13-inch piece of parchment so oat mixture is sandwiched between and, using a rolling pin, roll oat mixture to 1/4-inch thickness. Grab both ends of the parchment, set onto a 18- by 13-inch rimmed baking sheet, and freeze until mixture is firm but pliable, about 30 minutes. Line two 13- by 18-inch rimmed baking sheet with parchment; set aside.\nSerious Eats / Amanda Suarez\nSet a clean piece of parchment on your kitchen counter. Remove oatcake mixture from freezer. Peel off top layer of parchment, then invert oatcake mixture onto prepared sheet of parchment. Using a 3-inch round cookie cutter, cut out 16 oatcakes. (Scraps can be rerolled, frozen, and punched out into additional oatcakes.) Transfer oatcakes to prepared baking sheets, spacing them about 1 inch apart, and bake until crispy and lightly browned, 25 to 30 minutes. Remove from oven and let cool completely before serving or storing.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWhisk, flexible spatula, parchment paper, two or three 13- by 18-inch rimmed baking sheets (if you only have two you can reuse the one you freeze on for baking), 3-inch cookie cutter\nNotes\nDo not substitute Scottish or quick-cooking oats with rolled oats or steel-cut oats, as the latter two will produce a crumbly dough that won’t hold together.\nMake-Ahead and Storage\nThe oatcake mixture can be rolled between parchment and frozen for up to 3 days. When ready to bake, let sit at room temperature until firm enough to punch, about 20 minutes.\nAfter cooking and cooling, oatcakes can be stored in an airtight container at room temperature for up to 1 week.\nOats\nThe Latest\nSnacks & Appetizers\nBaking\nBritish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/scottish-oatcakes.webp?"
}