{
  "url": "https://www.seriouseats.com/scrapple-recipe",
  "image_url": "https://www.seriouseats.com/thmb/3Nwjb_ErdTX3xD_yUJDd8VoJ7BY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/scrapple-recipe-hero-Fred-Hardy-9a77c2176c6041809093160e87f95bd0.JPG",
  "tags": [
    "Pork",
    "Stovetop Pork",
    "Breakfast & Brunch"
  ],
  "title": "Scrapple",
  "full_text": "Scrapple\nClose\nJump to recipe\nPrep\n15 mins\nCook\n4 hrs\nActive\n60 mins\nCooling and Chilling Time\n4 hrs 25 mins\nTotal\n8 hrs 40 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.37\nkg\n)\nbone-in pork butt\n, preferably skin on\n2\npig\ntrotters\n(about\n1.1\npounds\n;\n500\ng\neach)\n4\nmedium\nonions\n(\n8 ounces; 227 g\neach), roughly chopped, about\n3\ncups\n6\nmedium\ncloves garlic\n4\nounces\n(\n115\ng\n)\npork liver\n, about 1/2 inch thick (see note)\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\n(\n30\nml\n) vegetable or\ncanola oil\n, plus extra for serving\n2\ncups\nplain yellow\ncornmeal\n(\n11\nounces\n;\n312\ng\n)\n1/2\ncup\n(\n2 3/8\nounces\n;\n68\ng\n)\nbuckwheat flour\n1\ntablespoon\nchopped\nfresh sage\n1\nteaspoon\npaprika\n1/4\nteaspoon\ncayenne pepper\nDirections\nIn a large Dutch oven, add pork butt, trotters, onions, and garlic. Cover with water and bring to a boil over high heat. Reduce heat to maintain a simmer and cook, skimming off any scum that accumulates on the surface, until pork is very tender and falling off the bone, about 3 hours. Let stand off-heat for 10 minutes.\nSerious Eats / Fred Hardy\nUsing a slotted spoon, transfer pork to a cutting board and set aside until cool enough to handle. Then, separate meat and discard skin, bone, and tendons. Strain cooking liquid through a fine-mesh strainer set over a large heatproof bowl, discarding onions and garlic; you should have about 7 1/2 cups (1.77L) pork stock. Set aside.\nSerious Eats / Fred Hardy\nSeason liver with salt and pepper. In a large cast iron or stainless-steel skillet, heat oil over medium-high heat until shimmering. Add liver and cook, without moving, until lightly browned on first side, 1 to 2 minutes. Flip and cook on second side until center is just cooked through, 1 to 2 minutes longer. Transfer to a cutting board along with reserved pork meat, and, using a sharp knife, finely dice liver and reserved pork meat together (you should have about 5 or 6 cups in total).\nSerious Eats / Fred Hardy\nIn a 3-quart saucepan or saucier, whisk together cornmeal and 7 cups (1.66L) pork stock. Set over medium-high heat and bring to a simmer, whisking often, then reduce heat to maintain a gentle simmer. Continue to cook, whisking and scraping the bottom and sides often and adding additional pork stock and/or water as needed, until the liquid has been absorbed and the cornmeal is smooth and has thickened like polenta, 20 to 45 minutes (cook time will depend heavily on the type and grind size of cornmeal used). Towards the last 10 minutes of cooking, whisk in buckwheat flour quickly to prevent it from clumping.\nSerious Eats / Fred Hardy\nStir meat and liver into cornmeal mixture, then add sage, paprika, and cayenne pepper, and season to taste with salt and pepper. Transfer pork-cornmeal mixture to a 9- by 5-inch loaf pan lined with parchment paper and smooth surface. Let cool to room temperature, about 1 hour. Cover tightly with plastic wrap and refrigerate scrapple until set, at least 3 hours. At this point, scrapple may be kept in the refrigerator for several days, or frozen (let thaw in refrigerator before serving).\nSerious Eats / Fred Hardy\nTo Serve: Slice scrapple into 3/4-inch-thick slabs. In a 10-inch cast iron or nonstick skillet, heat a few tablespoons oil over medium-high heat until shimmering. Working in batches, cook scrapple, flipping once, until brown and crispy on both sides, 2 to 3 minutes per side. Serve immediately.\nSerious Eats / Fred Hardy\nSpecial Equipment\nDutch oven, 10-inch skillet, 3-quart saucepan or saucier, 9- by 5-inch loaf pan\nNotes\nThe 4 ounces pork liver may come as a single piece or a few pieces, depending on where you shop; as long as each piece is about 1/2 inch thick, the cooking times in the recipe will be accurate.\nPork\nStovetop Pork\nBreakfast & Brunch"
}