{
  "url": "https://www.seriouseats.com/sea-urchin-uni-pasta-recipe",
  "image_url": "https://www.seriouseats.com/thmb/t_bJ0F3fuFMeJFagiNvdF-h7A-0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__09__20190717-sea-urchin-pasta-uni-16-aa53dee2980f45a5ace269f537f0a545.jpg",
  "tags": [
    "Seafood Mains",
    "Italian",
    "Stovetop Pasta",
    "Creamy Pastas",
    "Spaghetti, Bucatini, & Linguine"
  ],
  "title": "Creamy Sea Urchin (Uni) Pasta Recipe",
  "full_text": "Creamy Sea Urchin (Uni) Pasta Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n20 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4 to 6\nounces\nfresh\nsea urchin\n(uni); see note\n1/3\ncup\n(\n80\ng\n) Mexican-style\ncrema\n, or crème fraîche\n10\nounces\n(\n300\ng\n)\ndried\nlong pasta, such as\nspaghetti\nor bucatini\nKosher salt\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n2\ncloves\ngarlic\n, finely minced\n1\nsmall\nshallot\n, finely minced\n1\nteaspoon\n(\n5\nml\n)\nCalabrian hot chili spread\n(see note)\n1/2\ncup\n(\n125\nml\n) dry\nsake\nor dry white wine, such as Pinot Grigio\nFreshly\nground black pepper\nSmall handful finely minced fresh\nchives\n, and chive blossoms for serving\nDirections\nSet aside 4 tongues of sea urchin to use as garnish. Combine remaining sea urchin and crema using a blender, immersion blender, food processor, or mini chopper. Blend until completely smooth. Set aside.\nSerious Eats / J. Kenji López-Alt\nPlace pasta in a 12-inch skillet or a saucepan and cover with water. Season with salt. Set over high heat and bring to a boil, stirring occasionally. Cook until pasta is just shy of al dente and retains a small chalky core.\nSerious Eats / J. Kenji López-Alt\nMeanwhile, heat olive oil in a large skillet over medium heat until shimmering. Add garlic and shallot and cook, stirring constantly, until softened but not browned (lower heat if the aromatics threaten to brown), about 2 minutes. Add Calabrian chili spread and stir until homogeneous. Add sake or wine and cook until liquid is reduced down to less than 2 tablespoons, about 1 minute. Remove pan from heat and set aside until pasta is cooked.\nSerious Eats / J. Kenji López-Alt\nWhen pasta is cooked, use tongs to transfer the noodles directly from the boiling water to the pan with the garlic/oil mixture. Scrape uni purée into pan and add a few ounces of starchy pasta-cooking water. Set pan over high heat and cook, stirring and swirling constantly, until the sauce comes together and develops a creamy consistency and the pasta is fully cooked, about 1 minute. Add more pasta water as necessary to thin the sauce if it over-thickens. Season to taste with salt and black pepper.\nSerious Eats / J. Kenji López-Alt\nDivide pasta between warmed serving bowls, drizzle each portion with more extra-virgin olive oil, garnish each with a whole sea urchin tongue, sprinkle with minced chives, and serve.\nSpecial Equipment\nBlender\n,\nimmersion blender\nor\nfood processor\n;\n12-inch skillet\nNotes\nSea urchin roe can be found in Japanese fish markets or ordered online (when in season, which is usually from late summer to early winter) from Fulton Fish Market or Browne Trading. If buying in person, pass over any sea urchin that looks muddy or has poorly defined texture.\nCalabrian hot chili spread can be purchased online. Alternatively, substitute a pinch of red pepper flakes.\nRead More\nPasta con la Bottarga (Pasta With Bottarga)\nJapanese Mentaiko Spaghetti (Pasta With Spicy Cod Roe and Butter Sauce)\nSeafood Mains\nItalian\nStovetop Pasta\nCreamy Pastas\nSpaghetti, Bucatini, & Linguine"
}