{
  "url": "https://www.seriouseats.com/seared-skirt-steak-blistered-cherry-tomato-polenta-recipe",
  "image_url": "https://www.seriouseats.com/thmb/RyvX3Qo7So7_0DAbltnBZatfMF8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__05__20140506-skirt-steak-polenta-cherry-tomato-easy-6-d9157605839c4ef9863a69c424b0e2da.jpg",
  "tags": [
    "Italian",
    "Stovetop Beef",
    "Skirt Steaks",
    "Cornmeal",
    "Tomato"
  ],
  "title": "Seared Skirt Steak With Blistered Cherry Tomatoes and Polenta Recipe",
  "full_text": "Seared Skirt Steak With Blistered Cherry Tomatoes and Polenta Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n30 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\nskirt\nor flank\nsteak\n(see note)\nKosher salt\nand freshly ground black pepper\n6\ncloves\ngarlic\n, minced (about\n2\ntablespoons\n), divided\n3\ntablespoons\nextra-virgin olive oil\n, divided\n4\ntablespoons\nunsalted butter\n, divided\n1\ncup\ncoarse-ground polenta\n(corn meal)\n1\nquart\nhomemade or store-bought\nlow-sodium chicken stock\n1/4\ncup\nheavy cream\n2\nounces\nParmesan cheese\n, grated\n1\nquart\ncherry tomatoes\n2\nsmall red\nchiles\nsuch as Fresno or\nThai bird\n, thinly sliced\n3\nscallions\n, white and pale green parts only, thinly sliced\n1\nteaspoon\njuice\nfrom\n1\nlemon\n1\nteaspoon\nsoy sauce\nChopped chives\n, scallion greens, or parsley, for garnish\nDirections\nSeason steak generously with salt and pepper. Rub with 2 minced cloves garlic and 1 tablespoon olive oil. Set aside at room temperature.\nHeat 1 tablespoon olive oil and 2 tablespoons butter over medium-high heat until butter is foaming. Add 2 minced cloves garlic and cook, stirring, until garlic is fragrant, about 1 minute. Add chicken stock and bring to a boil over high heat. Whisking constantly, slowly add polenta in a thin stream. Reduce heat to a bare simmer. Cover and cook, stirring frequently, until polenta is completely tender and creamy, about 40 minutes, adding water as necessary to keep it loose.\nWhen polenta is fully cooked, stir in heavy cream, Parmesan cheese, and remaining 2 tablespoons butter. Season to taste with salt and pepper. Cover and keep warm.\nHeat remaining tablespoon olive oil in a large cast iron or stainless steel skillet over high heat until lightly smoking. Add steak in a single layer and cook, turning frequently, until well browned on both sides and center of steak registers 110°F for medium-rare or 115°F for medium, 6 to 8 minutes total. 1 minute before steak is done, add tomatoes to pan. Remove steaks and set aside. Add chiles, scallions, and remaining 2 minced cloves garlic to pan. Add 1/4 cup water and scrape up browned bits. Continue cooking, stirring frequently, until tomatoes burst and release their juices. Season to taste with salt and pepper. Stir in lemon juice and soy sauce off heat, adding water as necessary to reach a creamy sauce-like consistency.\nTo serve, transfer polenta to a pre-heated plate. Slice steak thinly against the grain. Transfer to polenta, top with blistered tomatoes and pan sauce, sprinkle with herbs, and serve.\nThis Recipe Appears In\nWhy You Should Be Making Seared Skirt Steak With Blistered Cherry Tomatoes and Polenta\nItalian\nStovetop Beef\nSkirt Steaks\nCornmeal\nTomato"
}