{
  "url": "https://www.seriouseats.com/seriously-asian-korean-soondubu-jjigae-soft-tofu-stew-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LZDtd4VYz3Q0HDbVu2MvIIVY-zA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20091030-soondubu-thumb-8e84c1296a6d45d2a22e26e1d1f7663a.jpg",
  "tags": [
    "Tofu"
  ],
  "title": "Seriously Asian: Korean Soondubu Jjigae (Soft Tofu Stew) Recipe",
  "full_text": "Seriously Asian: Korean Soondubu Jjigae (Soft Tofu Stew) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nChilling Time\n48 hrs\nTotal\n48 hrs 30 mins\nServes\n1\nto 2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncarton\nextra-silken tofu\n, roughly\n5\nounces\n2\ntablespoons\nvegetable oil\nor cooking fat\n1\nounce\nribeye steak\n, sliced thinly across the grain\n1/4 to 1/2\ncup\nvegetables\n(seasonal)\n2\nteaspoons\nsoondubu paste\n, or to taste (recipe below)\n1\ncup\nmeat or\nvegetable stock\nSeafood, optional (\n4\nclams\n, a handful of chopped squid, or\n3\nmedium-size\nshrimp\n)\n1\nlarge\negg\n1/4\ntsp\nsalt\nThinly sliced green onions\nas a garnish\nRice\nas an accompaniment\nSpicy Soondubu Paste:\n2\ntablespoons\ncoarse hot pepper powder\n1\ntablespoon\nsoy sauce\n1/4\nteaspoon\nsalt\n1\nteaspoon\nminced garlic\n1\ntablespoon\nbeef broth, fish sauce, or\nwater\nDirections\nSlowly heat clay pot over a low flame on stovetop.\nIn the meantime, have your mise-en-place ready: Sprinkle slices of beef with a pinch of salt. Cut vegetables of your choice into a 1/2-inch dice.\nWhen clay pot is hot, add cooking oil or fat and briefly heat. Add slices of ribeye all at once. Do not stir. Let surface of meat brown and char; once one side has browned, remove all of the meat with chopsticks or a slotted spoon. Set aside. Each slice of beef should still be fairly raw.\nAdd diced vegetables to pot and let juices deglaze bits of meat sticking to bottom of the pot. Stir occasionally with a wooden spoon.\nWhen vegetables have browned, add tofu paste to pot. Stir it around with vegetables, taking care not to burn paste.\nPour in all of the broth. Broth will simmer, then boil vigorously. Depending on vegetables, cook for 2 to 7 minutes.\nWhen vegetables are nearly tender, add tofu by large spoonfuls, taking care not to break up custard-like tofu into little bits. Any remaining tofu in carton may be stored in an airtight container filled to the brim with filtered water, which must be changed daily. It can be kept for 3 days in this manner.\nAdd seafood if you're using any. Return beef to top of broth. Let simmer for an additional minute. There should be enough broth to just cover all of ingredients. Add more broth if necessary, and add more spicy tofu paste to taste.\nWith heat-proof mitts, very carefully transfer tofu pot from burner to table. Have the accompanying rice ready. Crack egg into tofu pot, stirring very gently to preserve the integrity of tofu. Sprinkle green onions on top for garnish.\nFor the Spicy Soondubu Paste:\nThoroughly mix all ingredients together in a small glass jar. Seal it tightly and keep in refrigerator for at least 2 days and up to 3 weeks.\nNotes\nTofu for soondubu can be found in Korean and Chinese supermarkets. Generally, the tofu is labeled \"extra-silken\" to denote its custard-like nature. In addition to cartons, the tofu is also sold in vacuum-sealed tubes.\nClay pots for tofu and rice are readily available in Korean supermarkets. Mine cost $6 and has given me years of solitary comfort and joy.\nWhile Korean markets sell tubs of chili-garlic paste, the seasoning can be easily made with just four ingredients: hot pepper powder, soy sauce, salt, and minced garlic. Left to commingle in a jar, the ingredients become one: a thick and sanguine paste, especially pungent with the use of fresh garlic.\nTofu"
}