{
  "url": "https://www.seriouseats.com/seriously-asian-tofu-dengaku-recipe",
  "image_url": "https://www.seriouseats.com/thmb/7S9pE-LjhxM7l-EfmP5di6CiXgM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090710-tofu-pan-80da52ceb8cf4d4c94196db09b709c06.jpg",
  "tags": [
    "Tofu"
  ],
  "title": "Tofu Dengaku (Japanese Miso-Brushed Tofu) Recipe",
  "full_text": "Tofu Dengaku (Japanese Miso-Brushed Tofu) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nPressing Time\n10 mins\nTotal\n35 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nblock\nfirm tofu\n(also called cotton)\n1/3\ncup\nmiso\nof your choice, preferably a combination of white and red\n2\nlarge\negg yolks\n2\ntablespoons\nsake\n2\ntablespoons\nmirin\n2\ntablespoons\nsugar\n3\ntablespoons\ndashi\n, or water\nToppings (optional):\nSesame seeds\nGrated lemon\nor yuzu rind\nFresh ginger juice\nDirections\nTo make the miso sauce: Nest a bowl on top of simmering water, or use a double boiler if you have one. Put the miso in the bowl along with the egg yolks, sake, mirin, and sugar. If you cannot find mirin, a type of sweet sake used for cooking, replace it with one more tablespoon of sugar.\nOver the simmering water, gradually add the dashi. Stir until thick, and adjust seasonings to taste if needed. Depending on what type of miso you've chosen, the sauce will veer toward the sweet or salty side. At the last moment, add one of the toppings if desired.\nTo prepare the tofu: Remove the tofu as a block from its packaging, and set it on a chopping board. Wrap the tofu in a clean tea towel. Weigh the block of tofu down with a drop lid (if you have one) and an appropriately heavy item.\nCut tofu into 2-inch blocks. Skewer each piece and grill on both sides over a hot charcoal fire, until the surface is browned and the tofu is heated through. Alternatively, set the tofu in a shallow pan and broil for a few minutes in the oven.\nRemove from the fire and generously lather one side with the miso sauce. Sprinkle with garnishes, like sesame seeds, if you like. Grill or broil the miso-covered side for one or two minutes, until the topping is browned. Serve immediately.\nTofu"
}