{
  "url": "https://www.seriouseats.com/seriously-italian-zabaione-zabaglione-my-way-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Ge7F4T4HvSO8kV4O--DzRSfI3Ew=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/05132022-Zabaglione-Amanda-Suarez-hero_1-c57f8b0d434a483eb50e33181f15fb02.JPG",
  "tags": [
    "Custards, Mousses & Puddings",
    "Italian"
  ],
  "title": "Zabaglione",
  "full_text": "Zabaglione\nClose\nJump to recipe\nPrep\n0 mins\nCook\n15 mins\nTotal\n15 mins\nServes\n4 Servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\negg yolks\n(see notes)\n1/4\ncup\nsugar\n(\n1 3/4\nounces\n;\n50\ng\n)\n1/4\ncup\n(\n60\nml\n) Vin Santo or other sweet, fortified wine such as\nMarsala\n(see notes)\nPinch\nkosher salt\nFresh lemon juice\n, to taste (optional)\nDirections\nIn a large saucepan, bring 1 inch of water to a simmer over medium heat; make sure the saucepan you use is large enough to snugly contain about half of either a copper egg bowl or a heatproof glass mixing bowl without the bottom of the bowl making direct contact with the simmering water. Meanwhile, in the bowl and off the heat, thoroughly whisk together egg yolks and sugar until homogenous and smooth. Whisk in wine and salt until the mixture is lightly foamy.\nSerious Eats / Amanda Suarez\nUsing a pot holder or clean, dry kitchen towel to hold the rim of the bowl, set it over gently simmering water and begin whisking immediately, making sure to use an up-and-over motion to incorporate as much air as possible and paying special mind to work the whisk all over the inner surface of the bowl so the foam doesn't overheat in any spots (this can cause the egg to scramble). Adjust heat as needed to maintain a gentle simmer, not a boil (check the water's status from time to time by lifting the bowl up and peeking underneath). Continue to whisk constantly until foam begins to thicken, about 5 minutes (timing can vary depending on type of bowl you use and simmer level).\nSerious Eats / Amanda Suarez\nOnce zabaglione begins to thicken and the whisk leaves tracks as you move it, perform the \"8-second\" test: Lift a whiskful of the zabaglione and let it fall back down into the bowl. When it takes a full 8 seconds for the small mound of fallen zabaglione to fully flatten, it is done. Remove from heat, set bowl on a folded kitchen towel, and continue whisking, off heat, until thickened further and cooled until warm or at room temperature, depending on your preference. Add lemon juice, 1/2 teaspoon at a time, only if desired to balance the zabaglione's sweet flavor. Serve the zabaglione as desired.\nSerious Eats / Amanda Suarez\nNotes\nThis recipe's ratio of 4 egg yolks per 1/4 cup of fortified wine such as Vin Santo or Marsala works very well. Another traditional wine option is Moscato d'Asti, which is much more delicate in flavor and lower in alcohol; in this case, you can still use the recipe as written, or you can replace the yolks with 1 whole large egg plus 1 large egg yolk per the same 1/4 cup volume of wine. This makes a lighter, slightly less dense and frothier zabaglione that can help show off the Moscato's nuances more clearly.\nCustards, Mousses & Puddings\nItalian"
}