{
  "url": "https://www.seriouseats.com/seriously-asian-crab-two-ways",
  "image_url": "https://www.seriouseats.com/thmb/tpP4wlE3tXy2EA2ezMrFIM1UaLY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20091002-seasian-thumb-828fbc98aef746ca9e08b3302641334f.jpg",
  "tags": [
    "Crab",
    "Asian"
  ],
  "title": "Seriously Asian: Crab Two Ways Recipe",
  "full_text": "Seriously Asian: Crab Two Ways Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nSoaking Time\n10 mins\nTotal\n25 mins\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlive\nDungeness\ncrab\n, about\n2 to 3\npounds\nThe white of\n1\negg\n1/2\ncup\nof\ncornstarch\n, for dipping\n1\ntablespoon\noyster sauce\n2\nteaspoons\nfish sauce\nA few\ngarlic cloves\n, smashed and coarsely chopped\n2\ngreen onions\n, cut into 1 inch segments\n3\nthin\nslices\nof\nginger\n2\ncups\nvegetable oil\n1/4 to 1/2\nof a\nDungeness\ncrab\n, about\n1\npound\n1\nteaspoon\nsoy sauce\n1\nteaspoon\nfish sauce\n1\ngreen onions\n, cut into 1 inch segments\n4\nthin\nslices\nof\nginger\nA platter of freshly made\nrice noodles\n, or a small package of cellophane noodles\nDirections\nTo prepare the crab: Using a toothbrush, wash and rinse the crab under running water. Tear off the abdomen and halve the crab with the cleaver. Remove the gills and reserve the innards. Chop the body of the crab into segments aligned with the legs, so that each section comes attached to an appendage.\nIn the wok, heat the oil to 325 to 350°F.\nPour all but two tablespoons of the oil out of the wok. Add the garlic and stir-fry for 20 seconds, until the garlic is almost golden brown. Add the crab, ginger and green onion and stir-fry for 30 more seconds.\nAdd the fish sauce and the oyster sauce, adjusting the quantity to taste. Serve immediately.\nDungeness Crab Steamed with Noodles\nTo prepare the crab: Using a toothbrush, wash and rinse the crab under running water. Tear off the abdomen and halve the crab with the cleaver. Remove the gills and reserve the innards. Chop the body of the crab into segments aligned with the legs, so that each section comes attached to an appendage. If desired, use the majority of the crab for stir-frying, reserving just a few segments as well as the innards for steaming.\nArrange the rice noodles on a platter to be inserted into your steamer. If using cellophane noodles, soak the noodles for 10 minutes in cold water to slightly rehydrate them. Then arrange the noodles on the platter.\nArrange the pieces of crab on top of the noodles, along with the innards, ginger and green onions. Drizzle the soy sauce and fish sauce over the crab.\nSteam for 10 minutes, until the pieces of crab are just cooked through and the noodles are soft and supple. Serve immediately, accompanied by extra fish sauce on the side.\nCrab\nAsian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/seriously-asian-crab-two-ways-recipe.webp?"
}