{
  "url": "https://www.seriouseats.com/seriously-italian-fig-and-almond-cookies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/blpGJnU0W-tENexSKCMMdXS8rU4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20091015-seitalian-cookies-a63228c102794b55aed35ba4c73c58db.jpg",
  "tags": [
    "Cookies",
    "Italian",
    "Baking",
    "Fig",
    "Almonds"
  ],
  "title": "Italian Fig and Almond Cookies",
  "full_text": "Italian Fig and Almond Cookies\nClose\nJump to recipe\nPrep\n25 mins\nCook\n60 mins\nCooling and Chilling Time\n2 hrs\nTotal\n3 hrs 25 mins\nServes\n60 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\n(about\n10\nmedium\n)\ndried golden figs\n1/2\ncup\norange juice\n1\ncup\nsliced almonds\n, toasted and cooled\n1 1/2\ncups\nunbleached all-purpose flour\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nkosher salt\n1\nteaspoon\nground cinnamon\n6\nounces\n(\n1 1/2\nsticks\n)\nunsalted butter\n, softened\n3/4\ncup\ngranulated sugar\n1\nlarge\negg yolk\nFreshly grated\nzest\nof\n1\nsmall\norange\n1/2\nteaspoon\npure\nvanilla extract\nAdditional\ngranulated sugar\nfor coating the cookies\nDirections\nRemove the stems from the figs and cut them into quarters. Place them in a small saucepan with the orange juice and bring the mixture to a simmer. Remove from heat and allow the figs and juice to cool completely.\nAt the same time, spread the almonds in an even layer on a parchment-lined baking sheet. Toast the almonds until they are golden brown and aromatic. Remove them from the baking sheet and allow them to cool completely.\nChop the nuts finely in a food processor, transfer them to a small bowl, then chop the figs along with the juice until they are a chunky purée.\nIn a medium bowl, whisk the flour, baking soda, salt and cinnamon together and set aside.\nPlace the softened butter and granulated sugar in the bowl of an electric mixer fitted with the paddle attachment and beat them together until the mixture is creamy and light, about a minute. Beat in the egg yolk, scraping down the sides of the bowl, followed by the orange zest and vanilla.\nBeat in the dry ingredients to make a homogeneous dough, then beat in the chopped almonds and figs. Scrape the dough onto a piece of plastic, wrap it tightly and chill the dough until firm enough to roll, about 1 hour.\nPreheat the oven to 325°F. Line two baking sheets with parchment paper.\nDivide the dough into three even pieces. Roll each piece into a log, about 15 inches long. Cut each log into 3/4-inch pieces. Roll each piece into a ball, coat the ball with granulated sugar and place on the baking sheet, spaced 3/4 of an inch apart. Flatten the balls slightly with your fingers.\nBake the cookies for 12 to 14 minutes, or until they are golden brown, cracked slightly and firm. Allow the cookies to cool slightly on the baking sheets, then remove them to a rack to cool completely. Repeat with the remaining dough until all the cookies are baked.\nStore the cookies in an airtight container up to a week.\nCookies\nItalian\nBaking\nFig\nAlmonds",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/italian-fig-and-almond-cookies.webp?"
}