{
  "url": "https://www.seriouseats.com/seriously-asian-chawan-mushi",
  "image_url": "https://www.seriouseats.com/thmb/CowsEvRudBH1bmqzpFg1pU3G6uc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20091125-seasian-chawanmushi-eadaca75ce7a47fb9fb3ab2cc284312a.jpg",
  "tags": [
    "Eggs",
    "Japanese"
  ],
  "title": "Chawan Mushi",
  "full_text": "Chawan Mushi\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Custard:\n2 1/2\ncups\ndashi\n1\ntablespoon\nsoy sauce\n1\nteaspoon\nmirin\n1/2\nteaspoon\nsalt\n3\nlarge\neggs\nSuggestions for Additions:\n1/2\nof a\npackage\nof\nenokitake\n4\nfresh shiitake\nmushrooms\n4\nraw shrimp\n, shelled and deveined\n4\nounces\nboneless chicken thigh\nDirections\nBeat the eggs lightly, then add the rest of the ingredients for the custard. Strain the mixture though a strainer fitted with one layer of cheesecloth.\nPreheat a steamer over high heat. Have ready 4 bowls or lidded cups.\nPlace your choice of additions into the bottom of the cups or bowls.\nFor the enokitake: heat a heavy skillet and pour in a splash of olive oil or vegetable oil. Saute the enokitake in the skillet until golden brown, adding a bit of soy sauce or salt to taste. The mushrooms will exude quite a bit of liquid; let the liquid cook off for a few minutes as you brown the mushrooms.\nPour the liquid into the bowls or cups and cover with saran wrap or fitted lids.\nPlace the covered cups in the preheated steamer over high heat. When the surface turns white, about 3 to 5 minutes, reduce the heat to medium-low and steam for a further 15 minutes.\nTest the custard by inserting a bamboo skewer or toothpick into the center. The custard is done when the liquid runs clear. The surface of the custard should be slick and moist.\nServe hot or chilled in the cup.\nSpecial Equipment\nCheesecloth\nEggs\nJapanese"
}