{
  "url": "https://www.seriouseats.com/sesame-burger-buns",
  "image_url": "https://www.seriouseats.com/thmb/MMiBfctiql7oBFwVPrIhdig0dfw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__06__201212-209977-knead-book-hamburger-buns-2d845404ed8d4bb2b55fbbb7bc55618a.JPG",
  "tags": [
    "Rolls & Buns"
  ],
  "title": "The Bread Bible's Sesame Burger Buns Recipe",
  "full_text": "The Bread Bible's Sesame Burger Buns Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n25 mins\nActive\n20 mins\nRising Time\n80 mins\nTotal\n2 hrs 15 mins\nServes\n12 buns\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4\ncups\nwarm\nwater\n1\ntablespoon\n(\n1\npackage\n)\nactive dry yeast\n2\ntablespoons\nplus\n1/2\nteaspoon\nsugar\n1/3\ncup\nnonfat dry milk\npowder\n1 1/2\nteaspoons\nsalt\n3\ntablespoons\nunsalted butter\n, melted\n4 1/2 to 5\ncups\nunbleached all-purpose flour or\nbread flour\n1\nlarge\negg\nbeaten with\n2\nteaspoons\nwater\n, for glazing\n1/2\ncup\nsesame seeds\nDirections\nIn a small bowl, pour in 1/2 cup of warm water. Sprinkle yeast and 1/2 teaspoon sugar over water. Stir to dissolve and let stand at room temperature until foamy, about 10 minutes.\nIn a large bowl using a whisk or in the work bowl of a heavy-duty electric mixer fitted with paddle attachment, combine remaining 1 1/4 cups water, dried milk, remaining sugar, salt, and butter. Add 2 cups of flour. Beat hard until creamy, about 1 minute. Add remaining flour, 1/2 cup at a time, until a soft, shaggy dough that just clears the sides of the bowl is formed. Switch to a wooden spoon when necessary if mixing by hand.\nTurn dough out onto a lightly floured work surface and knead for about 4 minutes, dusting with flour only 1 tablespoon at a time as needed to make a smooth and soft dough.\nIf kneading by machine, switch from paddle to dough hook and knead for 3 to 4 minutes, or until dough is smooth and springy and springs back when pressed. If desired, transfer dough to a floured surface and knead briefly by hand,\nPlace dough in a greased deep container. Turn once to coat top and cover with plastic wrap. Let rise at room temperature until doubled in bulk, 1 to 1 1/2 hours.\nGently deflate dough. Turn dough out onto a lightly floured work surface. Grease or parchment-line a baking sheet. Divide dough into 12 equal portions. Shape each into a tight round ball and place each ball seam side down and at least 2 inches apart on the baking sheet. Use a second baking sheet rather than crowd the rolls. Flatten each ball with your palm. Cover loosely with plastic wrap and let rise until puffy, about 20 minutes.\n20 minutes before baking, preheat the oven to 350°F (180°C). Brush each roll with egg glaze and sprinkle tops with sesame seeds. Place baking sheet on the rack in the center of the oven and bake 20 to 25 minutes, or until lightly brown and firm to the touch. Transfer rolls immediately to a cooling rack. Cool completely before splitting.\nRolls & Buns",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-bread-bibles-sesame-burger-buns-recipe.webp?"
}