{
  "url": "https://www.seriouseats.com/sev-fried-chickpea-noodles-recipe-6665103",
  "image_url": "https://www.seriouseats.com/thmb/Lj6OwWYGj4m28JbX5m7gkRrD5Iw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20170921-chaat-vicky-wasik-65-17b73f9191dc4e8394a7fffcf36d9a3c.jpg",
  "tags": [
    "Chickpeas",
    "Indian",
    "The Latest"
  ],
  "title": "Sev (Crunchy Fried Chickpea Noodles)",
  "full_text": "Sev (Crunchy Fried Chickpea Noodles)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nTotal\n35 mins\nServes\n4 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n115\ng\n)\nchickpea flour\n1/2\nteaspoon\n(\n2\ng\n)\nKashmiri red chile powder\n(see note)\n1/4\nteaspoon\n(\n1\ng\n) freshly\nground black pepper\nNeutral oil\n, such as\ncanola\n, for frying\nDirections\nIn a medium mixing bowl, whisk together chickpea flour, chili powder, black pepper, and enough water (1/3 cup to 1/2 cup) to form a mixture with the thickness of pancake batter.\nSerious Eats / Vicky Wasik\nAdd batter to a piping bag fitted with a number 2 plain round tip, or use a zipper-lock bag with one corner snipped off to create a small opening.\nSerious Eats / Vicky Wasik\nSet a wire rack on top of a paper towel-lined rimmed baking sheet. Heat 2 inches of oil to 375°F (190°C). Pipe squiggles of batter into oil, like a funnel cake, and fry until bubbling ceases. Using a spider or strainer, lift fried sev and transfer to prepared baking sheet to drain. Repeat with remaining sev batter. If desired, break sev into small pieces to use as a topping (such as for\npapri chaat\n). Serve immediately or store in an airtight container for up to 1 month.\nSerious Eats / Vicky Wasik\nNotes\nA stand-alone snack in its own right, sev is also an important component in many Indian street foods.\nMake-Ahead and Storage\nThe sev will stay crisp in an airtight container for up to 1 month at room temperature.\nRead More\nPapri Chaat (Indian Street Snack With Potato, Chickpeas, and Chutneys) Recipe\nShining a Light on Diwali Treats: An Opinionated Guide\nChickpeas\nIndian\nThe Latest"
}