{
  "url": "https://www.seriouseats.com/shakshuka-north-african-shirred-eggs-tomato-pepper-recipe",
  "image_url": null,
  "tags": [
    "Breakfast & Brunch",
    "North African",
    "Braised & Stewed Mains",
    "Stovetop Eggs",
    "Easter"
  ],
  "title": "Shakshuka (North African–Style Poached Eggs in Spicy Tomato Sauce)",
  "full_text": "Shakshuka (North African–Style Poached Eggs in Spicy Tomato Sauce)\nJump to recipe\nCook\n35 mins\nActive\n25 mins\nTotal\n35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n1\nmedium\nonion\n, thinly sliced\n1\nlarge\nred pepper\n(bell pepper for milder heat, or a hotter variety, such as red horned pepper, depending on your heat preference), stems, seeds, and ribs removed, thinly sliced\n1\nfresh\nsmall\nhot chile (such as\njalapeño\n, serrano, or Fresno), stems, seeds, and ribs removed, thinly sliced\n2 to 3\ncloves\ngarlic\n, thinly sliced\n1 1/2\ntablespoons\n(\n15\ng\n) sweet Hungarian or smoked Spanish\npaprika\n2\nteaspoons\n(\n8\ng\n) whole or ground\ncumin seeds\n1\n(28-ounce; 800 g) can\nwhole peeled tomatoes\n, crushed by squeezing between your fingers or with a pastry blender (see note)\nKosher salt\nand freshly ground black pepper\nLarge handful\nminced cilantro\n, parsley, or a mix\n6\neggs\nSliced\noil-cured black olives\n, feta cheese, and/or artichoke hearts, for serving (all optional)\nCrusty bread\n, for serving\nDirections\nHeat olive oil in a large, deep skillet or straight-sided sauté pan over high heat until shimmering. Add onion, red pepper, and chile and spread into an even layer. Cook, without moving, until vegetables on the bottom are deeply browned and beginning to char in spots, about 6 minutes. Stir and repeat. Continue to cook until vegetables are fully softened and spottily charred, about another 4 minutes. Add garlic and cook, stirring, until softened and fragrant, about 30 seconds. Add paprika and cumin and cook, stirring, until fragrant, about 30 seconds. Immediately add tomatoes and stir to combine (see notes). Reduce heat to a bare simmer and simmer for 10 minutes, then season to taste with salt and pepper and stir in half of cilantro or parsley.\nSerious Eats / J. Kenji López-Alt\nUsing a large spoon, make a well near the perimeter of the pan and break an egg directly into it. Spoon a little sauce over edges of egg white to partially submerge and contain it, leaving yolk exposed. Repeat with remaining 5 eggs, working around pan as you go. Season eggs with a little salt, cover, reduce heat to lowest setting, and cook until egg whites are barely set and yolks are still runny, 5 to 8 minutes.\nSerious Eats / J. Kenji López-Alt\nSprinkle with remaining cilantro or parsley, along with any of the optional toppings. Serve immediately with crusty bread.\nSpecial Equipment\nDeep\n10-inch skillet\nwith matching lid, or 3-quart straight-sided lidded\nsauté pan\nNotes\nTo crush the tomatoes, transfer to a large bowl and squeeze through your fingers to create a chunky purée. Alternatively, leave whole, add to the pan, and use a pastry blender to cut the tomatoes directly in the pan.\nRead More\nMenemen (Turkish-Style Scrambled Eggs With Tomatoes, Onions, and Chiles) Recipe\nChinese Scrambled Eggs With Tomato Recipe\nBaked Eggs With Creamy Greens, Mushrooms, and Cheese Recipe\nCrispy Potato, Chorizo, and Green Chili Hash With Avocado and Eggs Recipe\nMoroccan Egg Drop Harira (Vegetable and Legume Soup) Recipe\nBreakfast & Brunch\nNorth African\nBraised & Stewed Mains\nStovetop Eggs\nEaster"
}