{
  "url": "https://www.seriouseats.com/shchaveloviy-borsch-ukrainian-green-borsch-recipe-7566367",
  "image_url": "https://www.seriouseats.com/thmb/4gJIWZb_wEcPlR97EHLN6LAaQYE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230726-Ukrainian-Green-Borsch-Larisa-Niedle-hero1-932cb9ba8e224bfd9722cbac4f773d14.jpg",
  "tags": [
    "Eastern European",
    "The Latest",
    "Soups",
    "Pork",
    "Summer"
  ],
  "title": "Shchavleviy Borsch (Ukrainian Green Borsch)",
  "full_text": "Shchavleviy Borsch (Ukrainian Green Borsch)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 10 mins\nResting Time\n60 mins\nTotal\n3 hrs 20 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork Broth:\n1.5\npounds\n(\n680\ng\n)\npork ribs\n, divided into individual ribs\n1\nsmall\ncarrot\n(\n2\nounces\n;\n60\ng\n)\n1\nsmall\nyellow onion\n, halved (\n4\nounces\n;\n120\ng\n)\n5\nblack\npeppercorns\n2\nbay leaves\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Borsch:\n12\nmedium\nnew potatoes\n(\n14\nounces\n;\n400\ng\n), halved\n1\ntablespoon\n(\n15\nml\n)\nsunflower\nor other neutral\noil\n1\nlarge\nspring onion\n(\n3\nounces\n;\n85\ng\n), white and green parts separated and each thinly sliced\n1\nsmall\ncarrot\n(\n2\nounces\n;\n60\ng\n), thinly sliced crosswise into rounds\n1\nyoung green\ngarlic\nstalk\n(\n1.5\nounces\n;\n40\ng\n), root end trimmed and diced (see note)\nBeet greens\nfrom\n1\nlarge\nbeet\n(\n2\nounces\n;\n60\ng\n), washed well of any sand or grit, then roughly chopped (see note)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\nlarge\neggs\n, well beaten\n8\nounces\n(\n226\ng\n)\nsorrel\n(about\n1\nbunch\n), washed well of any sand or grit, stems trimmed and leaves roughly chopped\n1 1/2\nounces\n(\n42\ng\n)\ndill\n(about\n1\nbunch\n), finely chopped\nTo Serve:\n4\nhard boiled eggs\n, peeled and roughly chopped\n1/2\ncup\n(\n120\nml\n)\ncrème fraîche\nSourdough bread\nDirections\nFor the Pork Broth:\nIn a 6-quart enameled Dutch oven, add the pork ribs, carrot, onion, peppercorns, bay leaves, and salt. Cover with no more than 2 quarts (8 cups) water and bring to boil over medium-high heat. Lower heat to maintain a gentle simmer and cook, uncovered, until ribs are fork-tender, about 1 1/2 hours. Skim off any impurities that rise to the surface. Discard the carrot and onion.\nSerious Eats / Larisa Niedle\nFor the Borsch:\nAdd potatoes to the pork broth. If there isn’t enough broth to just cover the solids, add enough water just to cover and return to a simmer. Cook until the potatoes are tender, about 20 minutes. Meanwhile, in an 8-inch skillet, heat oil over medium heat, add the sliced white part of spring onion along with the sliced carrots and cook, stirring, until softened and just lightly browned, about 10 minutes.\nSerious Eats / Larisa Niedle\nWhen the potatoes are tender, add the sautéed onions and carrots, the sliced green parts of the green onion, green garlic, beet greens, and salt. Simmer until vegetables are soft, about 10 minutes, adjusting the amount of water as needed (see note).\nSerious Eats / Larisa Niedle\nSlowly pour the beaten eggs into the pot in a thin steam, making sure to drizzle them all around as you pour, then gently stir; egg drop soup–like curds should form.\nSerious Eats / Larisa Niedle\nAdd sorrel and dill to the pot and cook until the sorrel is fully wilted, about 5 minutes. Remove from heat and let borsch rest uncovered until room temperature before serving,  about 1 hour. Ladle the cooled borsch into bowls and top with chopped boiled eggs and dollops of crème fraîche. Serve with sourdough bread\n.\nSerious Eats / Larisa Niedle\nSpecial Equipment\n6-quart enameled cast iron Dutch oven, stainless steel skimmer\nNotes\nThe flavor of your borsch will ultimately depend on the quality of your fresh produce, and we recommend purchasing your ingredients at the farmers market if you can.\nIf you can’t find fresh sorrel even after having made friends with local urban farmers, jarred sorrel that can be purchased online or at an Eastern European grocer can be used. If you are having a hard time getting a large quantity of sorrel, you can substitute half of the sorrel with spinach and adjust the tartness of the soup with vinegar or lemon juice as needed.\nIf you are having a hard time finding green garlic you can substitute with two garlic cloves, you can microplane them directly into the pot.\nIf you can’t find beet greens, Swiss chard can be substituted.\nAfter adding the potatoes, you might need to adjust the amount of water depending on how much water evaporates during the broth making process. The amount of water may vary from 1/2 to 1 1/2 cups (120ml to 360ml). Make sure to add 1/4 cup (60ml) at a time so as to not thin out the borsch too much.\nMake-Ahead and Storage\nThe soup can be refrigerated for up to 5 days and frozen for up to 3 months.\nThe broth can be made ahead of time and stored in the fridge for up to a week in the fridge and 3 months in the freezer.\nEastern European\nThe Latest\nSoups\nPork\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/shchavleviy-borsch-ukrainian-green-borsch.webp?"
}