{
  "url": "https://www.seriouseats.com/sheet-pan-chicken-potato-fennel-gratin-dinner",
  "image_url": "https://www.seriouseats.com/thmb/yvIlLBNWCuQPrWODYZz3C6HmTQE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200102-chicken-potato-fennel-gratin-12-vicky-wasik-ed4969c54d524c75a76d0870b38377d1.jpg",
  "tags": [
    "Roasted Chicken",
    "Chicken Thighs",
    "Fennel",
    "Yukon Gold Potatoes",
    "Chicken Mains"
  ],
  "title": "Sheet-Pan Chicken Thighs With Potatoes, Fennel, and Mustard-Beer Sauce Recipe",
  "full_text": "Sheet-Pan Chicken Thighs With Potatoes, Fennel, and Mustard-Beer Sauce Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n65 mins\nActive\n30 mins\nTotal\n70 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n680\ng\n; about\n3\nlarge\n)\nYukon gold potatoes\n, sliced crosswise into 1/8-inch-thick rounds\n1\nlarge\n(\n1\npound\n;\n450\ng\n) bulb\nfennel\n, stalks, and root end trimmed and bulb sliced lengthwise 1/8-inch-thick, fronds reserved\n1\ntablespoon\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\n8\nbone-in, skin-on\nchicken\nthighs\n(about\n3\npounds\n/\n1.3\nkg\n; see notes)\n4\nounces\n(\n115\ng\n) sharp\nwhite cheddar cheese\n, finely grated, preferably with a Microplane grater\n1\n(\n12-ounce; 355ml) can\nlager\n, pilsner, or pale ale\n3\ntablespoons\n(\n45\nml\n)\nstone-ground (coarse) mustard\n1\nteaspoon\nsugar\n, or more to taste\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\nDirections\nPreheat oven to 450°F (230°C) and set rack in upper-middle position. In large mixing bowl, toss potatoes and fennel with olive oil. Season lightly with salt and pepper.\nOn a rimmed baking sheet, arrange potatoes and fennel in even layers that are slightly overlapping, covering the entire surface of the baking sheet. You can try to make a pretty scalloped pattern, though it's not essential that the design be beautiful.\nSeason chicken all over with salt and pepper. Arrange chicken along outer edges of the sheet pan, making sure there's a thigh covering every corner (the baking sheet gets hottest at the edges and corners, so placing chicken there will keep the potatoes below from scorching).\nBake chicken and vegetables until chicken skin is golden and crispy, about 45 minutes. Transfer chicken thighs to warm serving platter or plates and keep warm.\nScatter grated cheese all over the surface of the potatoes and fennel. Turn the oven to broiler mode. Broil until cheese is melted and turning lightly golden in spots and vegetables grow slightly more crisp and brown on the surface, about 5 minutes.\nUsing a slotted spatula, carefully transfer potatoes and fennel to serving platter or plates, allowing excess fat to drain before each transfer. You can stack vegetables on top of each other to create a taller gratin-like structure. Keep warm.\nSet baking sheet over stovetop burner set to medium-high heat. Cook, moving the baking sheet around as needed, to brown remnant cooking juices on the bottom of the baking sheet; be careful not to accidentally burn your potholder or kitchen towel as you maneuver the baking sheet around over the flame. Also don't be alarmed if your baking sheet buckles; this can happen when it undergoes big temperature shifts, and we've always found they return to their normal flat shape soon.\nDrain excess fat on the baking sheet into a small heatproof bowl. Return baking sheet to heat and immediately add beer. Increase heat to high and bring beer to boil. Using a wooden spoon, scrape up the browned bits on the bottom of the baking sheet.\nStir in mustard, using wooden spoon. Work mustard into the beer while carefully shaking the baking sheet to mix the thin layer of liquid on it. Continue to cook, stirring and gently shaking, until reduced by about half. Stir in sugar. Turn off heat and melt in butter, stirring and shaking the whole time to emulsify it into the sauce. Taste, then season with salt and/or more sugar, as desired. Pour sauce into serving boat. Garnish potatoes with reserved fennel fronds and serve.\nSpecial Equipment\nRimmed baking sheet\nNotes\nYou can also substitute 4 chicken legs, whole or split into drumsticks and thighs.\nThis Recipe Appears In\nHow to Build a Sheet-Pan Dinner\nRoasted Chicken\nChicken Thighs\nFennel\nYukon Gold Potatoes\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sheet-pan-chicken-thighs-with-potatoes-fennel-and-mustard-beer-sauce-recipe.webp?"
}