{
  "url": "https://www.seriouseats.com/sheet-pan-asparagus-tart-recipe-8642723",
  "image_url": null,
  "tags": [
    "Asparagus",
    "The Latest",
    "Spring Mains"
  ],
  "title": "Easy Upside Down Sheet-Pan Asparagus Tart Recipe",
  "full_text": "Easy Upside Down Sheet-Pan Asparagus Tart Recipe\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nCooling Time\n5 mins\nTotal\n40 mins\nServes\n4\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nextra virgin olive oil\n1\ntablespoon\nfresh thyme leaves\n, plus more for garnish\n1/2\nteaspoon\ngrated\nlemon zest\n(from\n1\nmedium\nlemon\n), plus more for garnish\n1/4\nteaspoon\nkosher salt\n1\npound\n(\n460\ng\n) thin\nasparagus\n, ends trimmed and cut diagonally into 3-inch pieces (about\n3\ncups\n); see notes\n2\nounces\n(\n58\ng\n)\nsoft fresh goat cheese\n, crumbled (\n1/2\ncup\n)\n1\n(\n8.6-ounce; 245 g) sheet\npuff pastry\nfrom\n1\n(17.3-ounce) package\n, thawed if frozen\nAll purpose flour\n, for dusting\n1\nlarge\negg\nbeaten with\n1\ntablespoon\n(\n15\nml\n) tap\nwater\nFlaky sea salt\nCracked black pepper\nDirections\nPreheat oven to 425°F (220°C); position oven rack in lower third of oven. Line a rimmed baking sheet with parchment paper. Trace a 8 1/2- by 8 1/2–inch square on paper using a nontoxic permanent marker or pencil; if using marker, let ink dry slightly before flipping paper over so ink is facing towards baking sheet. Brush oil evenly within traced square. Sprinkle thyme, lemon zest, and salt evenly over oil.\nSerious Eats / Robby Lozano\nArrange asparagus pieces in chevron pattern within traced square: Beginning on left side of traced square, arrange asparagus pieces in a row at a 45-degree angle pointing from the lower left to the upper right; trim asparagus as needed to fit row's entire length. Next, make a second row alongside the first, but with the asparagus pieces angled 45 degrees from upper left to lower right. Repeat pattern as needed to fill entire square, using any leftover small pieces to fill gaps Alternatively, arrange asparagus as desired. Sprinkle all over with goat cheese; set aside.\nSerious Eats / Robby Lozano\nRoll puff pastry on a lightly floured surface to a 9 1/2–inch square. Carefully lay pastry over asparagus design so that it overhangs asparagus by 1/2 inch on all sides. Press along edges of pastry to seal against the baking sheet, then press on pastry all over to adhere to cheese and asparagus underneath. Lightly score pastry with paring knife, making about 8 cuts in a diagonal pattern. Brush with egg wash.\nSerious Eats / Robby Lozano\nBake in lower third of oven until pastry is puffed and deep golden brown, about 18 minutes. Transfer baking sheet to a wire rack and let cool 5 minutes. Place a cutting board over pastry, carefully invert tart onto cutting board, then remove and discard parchment. Garnish with flaky sea salt, black pepper, and additional lemon zest and thyme. Slice into nine 3-inch squares; serve warm or at room temperature.\nSerious Eats / Robby Lozano\nNotes\nWhen cutting asparagus into 3-inch pieces, save any small pieces that get trimmed to use to fill gaps when assembling the tart.\nMake-Ahead and Storage\nAsparagus can be cut and stored in an airtight container in the refrigerator for up to 3 days. Tart is best assembled and baked day-of.\nSerious Eats / Robby Lozano\nAsparagus\nThe Latest\nSpring Mains"
}