{
  "url": "https://www.seriouseats.com/sheet-pan-pork-tenderloin-dinner-recipe-8781164",
  "image_url": "https://www.seriouseats.com/thmb/dJZuZYrdtC3eNPM7MVqwpjL64JA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250127-SEA-SheetPanPork-TwoBites-Beauty2-53-950bf346bb124590a4193b53caaef6af.jpg",
  "tags": [
    "Pork Mains",
    "The Latest",
    "Quick Dinners",
    "Roasted Pork",
    "Pork Loin"
  ],
  "title": "Sheet-Pan Pork Tenderloin With Sweet Potatoes and Broccoli",
  "full_text": "Sheet-Pan Pork Tenderloin With Sweet Potatoes and Broccoli\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nResting Time\n10 mins\nTotal\n45 mins\nServes\n2\nto 3\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(\n340\ng\n)\nsweet potatoes\n(about 2 medium sweet potatoes), skin–on, quartered lengthwise, then each quarter cut crosswise into 1/2 inch pieces\n4 1/2\ntablespoons\n(\n70\nml\n) extra-virgin\nolive\nor\navocado oil\n1\ntablespoon\n(\n12\ng\n)\ngaram masala\n4 1/4\nteaspoons\n(\n13\ng\n) Diamond Crystal\nkosher salt,\ndivided; for table salt use half as much by volume or the same weight\nOne 1-\npound\n(450\ng\n)\npork tenderloin, trimmed\n2\nmedium\ncloves\ngarlic, thinly sliced\n4\nteaspoons\n(\n16\ng)\nground coriander, divided\n2\nteaspoons\n(\n8\ng\n)\nground cumin, divided\n12\nounces\n(\n340\ng)\nbroccoli florets\nand stems, trimmed and cut into 1-inch pieces\nPinch\nof\nsugar\n(optional)\nLemon\nwedges,\nfor serving\nDirections\nAdjust oven rack to middle position. Set a rimmed baking sheet on rack and preheat oven with empty sheet to 425℉ (220℃). In a medium bowl, toss sweet potatoes with 2 tablespoons oil, garam masala, and 1 3/4 teaspoons salt to combine. Working quickly, carefully spread into an even layer on preheated sheet and roast for 8 minutes, stirring once halfway through.\nSerious Eats / Two Bites\nWhile sweet potatoes roast, pat tenderloin dry with paper towels and place on a cutting board. Using a very sharp knife, cut 6 slits evenly spaced across the length of the loin, each slit about 1/2-inch wide and about 1/4-inch deep. Divide garlic slices and place into each slit so the garlic sits flush with the top of the meat (not sticking out). Rub 1 tablespoon oil all over the pork, then rub with 2 teaspoons coriander, 1 teaspoon cumin, and 1 teaspoon salt, pressing gently into the pork to adhere.\nSerious Eats / Two Bites\nOnce sweet potatoes have cooked for 8 minutes, remove sheet pan from oven, move sweet potatoes to one side of pan, and place the pork, garlic side up, next to the sweet potatoes, across the center of the pan. Roast pork and sweet potatoes for 10 minutes.\nSerious Eats / Two Bites\nWhile the pork and sweet potatoes roast, in a medium bowl, toss broccoli with remaining 1 1/2 tablespoons oil, remaining 2 teaspoons ground coriander, remaining 1 teaspoon ground cumin, remaining 1 1/2 teaspoons salt, and sugar, if using.\nSerious Eats / Two Bites\nOnce pork has cooked for 10 minutes, remove sheet pan from oven and add broccoli to empty side of the pan next to the pork, spreading it in an even layer. Roast everything until the pork registers 135 to 140°F (54 to 60°C) for medium or 155 to 165℉ for well done, the broccoli is crisp-tender, and sweet potatoes fully tender, 8 to 12 minutes.\nSerious Eats / Two Bites\nTransfer pork to a cutting board and let rest for 5 to 10 minutes. Turn off oven and hold sheet pan with vegetables warm while pork rests. Slice rested pork, remove garlic pieces (serve garlic with the meal or discard). Serve pork with roasted vegetables and lemon wedges.\nSerious Eats / Two Bites\nSpecial Equipment\nRimmed baking sheet\nNotes\nThis recipe can be easily doubled to serve 4. Simply use two sheet pans and cook for the same length of time, switching the shelf the pans are on halfway through cooking so each gets even heat.\nMake-Ahead and Storage\nThe sweet potatoes and the broccoli can be cut and refrigerated in airtight containers for up to 1 day before cooking.\nLeftovers can be refrigerated in an airtight container for up to 4 days.\nPork Mains\nThe Latest\nQuick Dinners\nRoasted Pork\nPork Loin",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sheet-pan-pork-tenderloin-with-sweet-potatoes-and-broccoli.webp?"
}