{
  "url": "https://www.seriouseats.com/sheet-pan-salmon-with-tomato-eggplant-compote",
  "image_url": "https://www.seriouseats.com/thmb/9tI14Tvojok-a6VwVCYkdqvP3EI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__salmon-eggplant-tomato-10-f9c720971c2a4973afe46589926dc873.jpg",
  "tags": [
    "Salmon",
    "Dairy-free Mains",
    "Roasted Seafood",
    "Eggplant",
    "Tomato"
  ],
  "title": "Sheet-Pan Salmon With Tomato-Eggplant Compote Recipe",
  "full_text": "Sheet-Pan Salmon With Tomato-Eggplant Compote Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n40 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n675\ng\n) grape or\ncherry tomatoes\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\nKosher salt\n4\nmedium\ncloves garlic\n, sliced\n1\npound\n(\n450\ng\n)\neggplant\n(about\n1\nmedium\nglobe or\n2\nlarge\nAsian eggplants), cut into 1/2-inch dice\n2\ntablespoons\n(\n30\nml\n)\ngochujang\n(Korean chile paste)\n4\n(\n6-ounce; 170 g\n) skinless\nsalmon fillets\nFresh basil leaves\n, torn, for garnish\nFreshly ground black pepper\nDirections\nAdjust oven rack to middle position and preheat oven to 450°F (232°C). On a rimmed baking sheet, toss tomatoes with olive oil and season with salt. Transfer to oven and roast, shaking sheet tray once or twice, until tomatoes just start to split, about 10 minutes. Add garlic to middle of sheet tray, stirring to lightly coat in oil, then roast until garlic is fragrant and tomatoes have softened more, about 5 minutes.\nSerious Eats / Vicky Wasik\nUsing a wooden spoon, carefully crush the softest tomatoes.\nSerious Eats / Vicky Wasik\nPush garlic and tomatoes to one side of the sheet tray. Add eggplant to the empty half, drizzle lightly with olive oil, and season eggplant with salt. Return to oven and cook, stirring once or twice, until eggplant is beginning to soften, about 10 minutes; if tomatoes and garlic threaten to scorch, add a little water to the hot spots to prevent it.\nSerious Eats / Vicky Wasik\nStir together eggplant and tomato mixture, bursting more tomatoes if possible. Stir in gochujang until well incorporated. Return to oven and continue to cook, stirring occasionally, until eggplant is very soft, about 20 minutes; add a few tablespoons of water at any point if mixture seems dry or at risk of scorching, especially around the edges and corners of the baking sheet.\nSerious Eats / Vicky Wasik\nPush the tomato-eggplant mixture to one side of the baking sheet, scraping well to clear space for salmon. Lay down a sheet of foil just large enough to cover the cleared area and lightly grease with oil. Season salmon all over with salt, then place on prepared foil. Cook until salmon registers 115 to 125°F (46 to 52°C) in the center of the thickest part for medium-rare to medium, 6 to 10 minutes.\nSerious Eats / Vicky Wasik\nIf tomato-eggplant mixture is too thick and dry, loosen by stirring in 1 or 2 tablespoons water at a time until desired consistency is reached. Season with salt, if needed. Using a thin metal spatula, transfer salmon to plates. Scoop tomato-eggplant compote alongside. Garnish with torn basil leaves, drizzle with fresh olive oil, and finish with some freshly ground black pepper. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRimmed baking sheet\n,\nslotted offset spatula\n,\ninstant-read thermometer\nMake-Ahead and Storage\nIf serving hot, the salmon and tomato-eggplant compote are best made shortly before serving; if made ahead, however, they're also very good served at room temperature.\nThis Recipe Appears In\nHow to Build a Sheet-Pan Dinner\nSalmon\nDairy-free Mains\nRoasted Seafood\nEggplant\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sheet-pan-salmon-with-tomato-eggplant-compote-recipe.webp?"
}