{
  "url": "https://www.seriouseats.com/sheet-pan-cauliflower-tofu-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ThqOnIZJAAqoRDs-niYS544wAHs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200116-sheet-pan-cauliflower-tofu-vicky-wasik15-758cf448727f4d4885b9f5050e2b349f.jpg",
  "tags": [
    "Mains",
    "Vegetarian Mains",
    "Roasting",
    "Tofu",
    "Cauliflower"
  ],
  "title": "Sheet-Pan Spiced Cauliflower and Tofu With Ginger Yogurt Recipe",
  "full_text": "Sheet-Pan Spiced Cauliflower and Tofu With Ginger Yogurt Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n45 mins\nResting Time\n10 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\n(\n2 3/4-pound\n;\n1.25 kg\n) head\ncauliflower\n5\ntablespoons\n(\n75\nml\n)\nextra-virgin olive oil\n, divided, plus more for drizzling\n1 3/4\nteaspoons\nstore-bought\nras el hanout\n, divided (see notes)\nKosher salt\n2\n(\n12-ounce; 340 g) packs\nextra-firm tofu\n2\ncups\n(\n475\nml\n)\nfull-fat Greek yogurt\n1\n(\n3-inch) piece\nfresh ginger\n(about\n2\nounces\n;\n55\ng\n), peeled and finely grated or minced\nFreshly ground\nblack pepper\n1\nmedium\nred onion\n(\n8 ounces; 225 g\n), sliced about 1/8 inch-thick and soaked for at least 10 minutes in ice water\n3\ncups\nloosely packed\nfresh mint\nleaves and cilantro sprigs (about one-half bunch cilantro and one bunch mint)\n1\npreserved lemon\n, seeds removed and flesh and peel finely diced (optional; see notes)\nDried ground sumac\n, for sprinkling (optional)\nDirections\nPreheat oven to 475°F (245°C) with a clean rimmed baking sheet set on the middle rack. While the oven heats,\ncut the cauliflower into 1-inch florets\n. In a large bowl, toss cauliflower with 3 tablespoons (45ml) olive oil and 1 1/2 teaspoons ras el hanout; season with salt.\nAdd cauliflower to heated baking sheet, carefully spreading it in a single even layer; set bowl aside. Return baking sheet to oven and roast cauliflower until it is just tender and lightly browned, about 20 minutes.\nWhile cauliflower is cooking, bring a kettle of water to a boil. Drain tofu and cut it into 1- by 3/4-inch planks. Place tofu pieces in a colander in the sink and pour the boiling water all over them.\nTransfer tofu to work surface lined with paper towels. Arrange tofu pieces in an even layer, then lay more paper towels on top and press down to absorb excess water. Add tofu to the same mixing bowl used for cauliflower and toss with remaining 2 tablespoons (30ml) olive oil and 1/4 teaspoon ras el hanout. Season with salt.\nWhen cauliflower is cooked, transfer to platter to cool; wipe baking sheet to ensure any stray bits of cauliflower are removed. Arrange tofu on now-empty baking sheet in a single even layer, then roast, flipping once halfway through, until crispy on both sides, about 15 minutes.\nMeanwhile, in a small mixing bowl, stir together yogurt and ginger. Season with salt and a generous amount of black pepper.\nIn a separate medium bowl, drain red onion, making sure to remove any stray pieces of ice. Sprinkle all over with salt, and using your fingers, rub salt into the onion slices. Let stand for at least 10 minutes.\nTo serve, dollop a generous amount of ginger yogurt onto each serving plate or bowl. Mound the cauliflower and tofu on top. Drizzle with fresh olive oil and scatter preserved lemon on top, if using. Drain onions of any accumulated liquid, then toss with cilantro sprigs and mint. Mound herb salad on top of cauliflower and tofu, and sprinkle with sumac, if using. Serve warm or at room temperature.\nSpecial equipment\nRimmed baking sheet\n, colander\nNotes\nRas el hanout is a complex mix of spices hailing from North Africa. While recipes vary, it typically blends warm spices like cinnamon, nutmeg, clove, and cardamom with paprika, black pepper, and turmeric; some versions also include floral notes from dried rosebuds. You can buy it online and at well-stocked supermarket spice aisles, or make an easy substitute by mixing 3/4 teaspoons sweet or hot paprika with 1/4 teaspoon cinnamon, 1/4 teaspoon ground coriander seed, 1/4 teaspoon ground cumin, and 1/8 teaspoon each ground nutmeg and cardamom.\nMake-Ahead and Storage\nThe cauliflower and tofu are best roasted shortly before serving. You can make the ginger yogurt up to 1 day in advance.\nThis Recipe Appears In\nHow to Build a Sheet-Pan Dinner\nMains\nVegetarian Mains\nRoasting\nTofu\nCauliflower",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sheet-pan-spiced-cauliflower-and-tofu-with-ginger-yogurt-recipe.webp?"
}