{
  "url": "https://www.seriouseats.com/sheet-pan-chicken-fajitas",
  "image_url": "https://www.seriouseats.com/thmb/frJcLorPATsSjBXRXOqRBR4hc4M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__01__20200106-sheet-pan-chicken-fajitas-vicky-wasik1-3f23fa9d3dac4e5c98df595ca51d13b8.jpg",
  "tags": [
    "Holidays & Seasons",
    "Roasted Chicken",
    "Chicken Thighs",
    "Bell Peppers",
    "Chicken Mains"
  ],
  "title": "Sheet-Pan Chicken Fajitas Recipe",
  "full_text": "Sheet-Pan Chicken Fajitas Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n45 mins\nMarinating Time\n3 hrs\nTotal\n3 hrs 50 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Fajita Marinade:\n1/2\ncup\n(\n120\nml\n)\nsoy sauce\n1/2\ncup\n(\n120\nml\n) fresh\nlime juice\n, from\n6 to 8\nlimes\n1/2\ncup\n(\n120\nml\n)\ncanola\nor other neutral\noil\n1/4\ncup\n(\n55\ng\n) packed\nlight brown sugar\n2\nteaspoons\nground cumin seeds\n2\nteaspoons\nfreshly\nground black pepper\n1\ntablespoon\nchili powder\n(see note)\n3\nmedium cloves\ngarlic\n, finely minced (about\n1\ntablespoon\n)\n2\npounds\n(\n900\ng\n)\nboneless, skinless chicken thighs\nFor the Fajitas:\n1\nlarge\nred bell pepper\n, stemmed, seeded, and cut into 1/2-inch-wide strips\n1\nlarge\nyellow bell pepper\n, stemmed, seeded, and cut into 1/2-inch-wide strips\n1\nlarge\ngreen bell pepper\n, stemmed, seeded, and cut into 1/2-inch-wide strips\n1\nwhite or\nyellow onion\n, cut into 1/2-inch slices\n12 to 16\nfresh flour or\ncorn tortillas\n, hot (see notes)\n1\nrecipe\nguacamole\n, for serving, if desired\n1\nrecipe\npico de gallo\n, for serving, if desired\nSour cream\n, shredded cheese, and salsa, for serving, if desired\nDirections\nFor the Fajita Marinade:\nCombine soy sauce, lime juice, oil, brown sugar, cumin, black pepper, chili powder, and garlic in a medium bowl and whisk to combine. Transfer 1/2 cup (120ml) marinade to a separate vessel and set aside.\nFor the Chicken:\nPlace chicken in a gallon-sized zipper-lock bag and add remaining marinade. Seal bag, squeezing out as much air as possible. Massage bag until meat is fully coated in marinade. Lay flat in refrigerator, turning every couple of hours, for at least 3 and up to 10 hours.\nFor the Fajitas:\nWhen ready to cook, preheat broiler and position over rack to highest position. If you have a baking steel or stone, set it on the top rack and allow to preheat. If using a baking steel/stone, set a rimmed baking sheet on it to preheat as well; otherwise leave baking sheet at room temperature.\nSerious Eats / Vicky Wasik\nRemove chicken from marinade and blot dry with paper towels. Arrange chicken in an even layer on rimmed baking sheet. Broil, without flipping, until chicken is well browned on top side, about 5 minutes. Broiler strength and oven designs vary greatly, so cooking times will vary as well; keep a close watch. If your broiler heats unevenly, you may need to move the sheet tray around for more even browning. Flip chicken and broil until second side is also browned, about 4 minutes longer (chicken cooked with the help of a baking steel/stone will already have browned on the bottom, so you can flip it and continue cooking to ensure it's fully cooked through). Remove from oven and transfer chicken to a platter to rest.\nSwitch oven from broil mode to 450°F (230°C). Add red, yellow, and green bell peppers as well as onions to baking sheet. Pour reserved 1/2 cup of marinade all over and toss until evenly coated; using a wooden spoon, scrape up any browned bits on the baking sheet. Arrange peppers and onion in an even layer that covers the baking sheet from edge to edge, then cook, stirring occasionally, until vegetables are tender and browned in spots, about 25 minutes (if your oven heats from the top, you will want to cook the vegetables on a middle rack to avoid excessive scorching and burning). If you're using a baking steel/stone, you can cook the vegetables on it, but keep a closer eye since they run the risk of scorching on the bottom; if this begins to happen, move the sheet pan to another rack.\nSlice chicken into thin strips, then add back to sheet pan with any juices. Return to oven to warm through.\nServe immediately with hot tortillas, guacamole, pico de gallo, and other condiments, as desired.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRimmed baking sheet\n,\nbaking steel\nor stone (optional)\nNotes\nFor best flavor, grind your own chili powder from a mix of equal parts ancho and guajillo chiles.\nYou can wrap the tortillas tightly in aluminum foil and pop them in the oven 10 minutes before serving to heat through, while the steak and vegetables are finishing up.\nMake-Ahead and Storage\nThe finished fajitas are best enjoyed immediately.\nRead More\nHow to Build a Sheet-Pan Dinner\nHolidays & Seasons\nRoasted Chicken\nChicken Thighs\nBell Peppers\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sheet-pan-chicken-fajitas-recipe.webp?"
}