{
  "url": "https://www.seriouseats.com/sheftalia-pork-lamb-sausage-recipe",
  "image_url": "https://www.seriouseats.com/thmb/vdKWw0UehPAZ-fl93CzRxs8VhV8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__20140704-sheftalia-plated-joshua-bousel-ab8a8f2eb56649219777f8d5e4e0bfe9.jpg",
  "tags": [
    "Grilled Lamb",
    "Grilled Sausages",
    "Lamb Shoulder",
    "Leg of Lamb",
    "Summer Mains"
  ],
  "title": "Sheftalia (Cypriot Lamb and Pork Sausage) Recipe",
  "full_text": "Sheftalia (Cypriot Lamb and Pork Sausage) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n90 mins\nChilling and Resting Time\n35 mins\nTotal\n70 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nboneless\nlamb shoulder\nor leg of lamb, cut into 1-inch cubes (or\n1 1/4\npounds\nground lamb\n, at least 30% fat; see notes)\n1\npound\nboneless\npork shoulder\n, cut into 1-inch cubes (or\n1 1/4\npounds\nground pork\n, at least 30% fat; see notes)\n1/2\npound\npork fatback\n, cut into 1-inch cubes (if grinding at home; see notes)\n1\ntablespoon\n(\n9\ng\n)\nkosher salt\n1\ncup\nred onion\n, finely chopped (\n5\nounces\n;\n140\ng\n)\n1/3\ncup\npacked finely chopped\nfresh parsley\n2\nteaspoons\n(\n5\ng\n) freshly\nground black pepper\n1/2\npound\n(\n226\ng\n)\ncaul fat\n(see notes)\nGreek pocketless pita\n, warmed, for serving\n1\nlemon\n, cut in half, for serving\nDirections\nIf grinding at home:\nPlace lamb, pork, and fatback in a large bowl. Add salt and toss to coat evenly. Place in refrigerator until chilled, at least 30 minutes. Place meat grinder parts, including medium and small dies, in freezer to chill.\nSerious Eats / Joshua Bousel\nGrind meat and fat through meat grinder fitted with a medium die. Switch to small die and grind meat mixture once more.\nSerious Eats / Joshua Bousel\nPlace ground meat in a large mixing bowl. Add onion, parsley, and black pepper to meat mixture. Using a large spoon or hands, mix sausage until all ingredients are thoroughly distributed.\nSerious Eats / Joshua Bousel\nForm a small sausage patty; place rest of sausage mixture in refrigerator. Cook patty in a small frying pan over medium-high heat until cooked through. Taste and adjust seasoning of sausage if necessary.\nSerious Eats / Joshua Bousel\nLay 1 piece of caul fat on a work surface. Break off about 2 ounces (57g) of sausage and form into a cylinder. Place sausage 1-inch from top edge of caul fat. Fold top edge over sausage, followed by both sides. Roll sausage in caul fat until fully encased, then cut off remaining caul fat. Repeat with remaining caul fat and sausage mixture.\nSerious Eats / Joshua Bousel\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate. Grill sausages over medium-high direct heat, turning often and repositioning sausages over coals as needed to avoid large flare-ups, until they register 160°F (71°C) on an instant-read thermometer when inserted into the center, 8 to 10 minutes. Let rest for 5 minutes. Serve immediately with warm pita and lemon halves.\nSerious Eats / Joshua Bousel\nSpecial Equipment\nMeat grinder\n(optional),\ngrill\nNotes\nIf you grind the meat at home, you will need 1 pound of lamb, 1 pound of pork, and then 1/2 pound of pork fatback (totaling 2 1/2 pounds); if you decide to buy ground meat, you can get 1 1/4 pounds of ground lamb and 1 1/4 pounds of ground pork, but make sure they're both at least 30% fat.\nCaul fat, a thin membrane that's laced with fat, can be purchased from a good butcher.\nRead More\nCevapi (Southeastern European Meat and Onion Sausages)\nHow to Use and Care for a Meat Grinder\nGrilled Lamb\nGrilled Sausages\nLamb Shoulder\nLeg of Lamb\nSummer Mains"
}