{
  "url": "https://www.seriouseats.com/shepherds-pie-meatloaf-with-parmesan-potato-crust-stilton-sauyce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/WKHoZShRWft7IE8Xt4hW5FC15k4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__10__20140915-Serious-Eats-Shepherds-Pie-Meatloaf-Stilton-Sauce-Jennifer-Olvera1-c2a3a61177a045e3995d1d9d4dbc8e23.jpg",
  "tags": [
    "Savory",
    "British",
    "Ground Beef",
    "Veal",
    "Parmesan"
  ],
  "title": "Shepherd's Pie Meatloaf With Parmesan Potato Crust and Stilton Sauce Recipe",
  "full_text": "Shepherd's Pie Meatloaf With Parmesan Potato Crust and Stilton Sauce Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n95 mins\nActive\n90 mins\nResting Time\n15 mins\nTotal\n2 hrs 10 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Potatoes:\n5\nmedium\nYukon Gold potatoes\n, peeled and cut into chunks\n5\ntablespoons\nunsalted butter\n, divided\n1/3\ncup\ngrated Parmesan cheese\n1/4\ncup\nmilk\nKosher salt\nand freshly ground black pepper\nFor the Meatloaf:\n1\ntablespoon\nextra-virgin olive oil\n1\nmedium\nonion\n, minced (about\n1\ncup\n)\n1\nrib\ncelery\n, minced (about\n1/2\ncup\n)\n2\nmedium\ncloves garlic\n, minced (about\n2\nteaspoons\n)\n2\nlarge\neggs\n1/4\ncup\nhomemade or store-bought\nlow sodium chicken stock\n1/2\nteaspoon\nunflavored gelatin\n1\npound\nground beef\n1/2\npound\nground pork\n1/2\npound\nground veal\n1\ntablespoon\nWorcestershire sauce\n1\ntablespoon\nDijon\nor prepared\nmustard\n1 1/2\ntablespoons\ntomato paste\n1/2\nteaspoon\nsmoked paprika\n3/4\nteaspoon\ndried thyme\n21\nsaltine crackers\n, finely crushed\n1/3\ncup\nfinely\ngrated Parmesan cheese\nNon-stick cooking spray\n3/4\ncup\nfrozen peas and carrots mixture\n, thawed, or the equivalent fresh and blanched\nFor the Sauce:\n4\nounces\nStilton cheese\n1\ncup\nheavy cream\n1/4\nteaspoon\nfreshly\nground black pepper\nDirections\nFor the Potatoes:\nCover potatoes with water in a large saucepan and place over medium-high heat. Bring to a boil and simmer until tender when pierced with a fork, about 20 minutes. Drain and return to pan. Add 3 tablespoons butter, Parmesan, and milk. Season with salt and pepper and whip potatoes using a hand-held mixer until airy, but do not over-mix.\nFor the Meatloaf:\nHeat olive oil in a medium skillet over medium heat until shimmering. Add onion, celery, and garlic and cook, stirring often, until tender and translucent, about 7 minutes. Transfer to a large bowl and let cool.\nAdjust oven rack to lower-middle position and preheat oven to 375°F. Whisk eggs and chicken stock in a medium bowl. Sprinkle with gelatin and let stand for 5 minutes.\nAdd the beef, pork, veal, Worcestershire sauce, mustard, tomato paste, paprika, thyme, 3/4 teaspoon salt, 1/2 teaspoon black pepper, saltines, and Parmesan cheese to bowl with cooled onion mixture. Add egg mixture and combine using hands. Do not over-mix.\nSpray loaf pan with cooking spray. Pack half of the meat lightly and evenly into the loaf pan, creating a well lengthwise down the center and leaving about an inch not indented on either end. Fill well with peas and carrots. Top with remaining meat, pressing gently to fuse top and bottom halves. Evenly spread mashed potatoes on the top and make a crosshatch pattern using the tines of a fork. Cut remaining 2 tablespoons of butter into small pieces and dot them on top of the potatoes. Transfer meatloaf to the oven to cook.\nFor the Cheese Sauce:\nWhile meatloaf cooks, combine cheese, cream, and pepper in a small saucepan. Heat over medium-low heat, stirring frequently, until cheese is melted and sauces has thickened, about 10 minutes. Cover and keep warm.\nThe meatloaf is done cooking when the potatoes are browned and an instant-read thermometer inserted into center of loaf reads 135°F to 140°F, 55 to 65 minutes.Remove from oven and let rest for 15 minutes before slicing. Serve immediately, passing Stilton sauce at table.\nNotes\nThe meatloaf can be assembled a day in advance. Just remove it from the refrigerator 45 minutes before cooking. The Stilton sauce can also be made ahead and refrigerated. Reheat it on the stovetop or in the microwave.\nSpecial Equipment\nHand-held mixer, large meatloaf tin\nSavory\nBritish\nGround Beef\nVeal\nParmesan"
}