{
  "url": "https://www.seriouseats.com/shepherds-pie-baked-potatoes-recipe-8736245",
  "image_url": "https://www.seriouseats.com/thmb/heKU9iIBkOl8cI_q5-Fbad6gL2w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241029-ShepherdsPieBakedPotatoes-AmandaSuarez23-c210101256d24e8f967f00c212086a3f.jpg",
  "tags": [
    "Potatoes",
    "The Latest",
    "Ground Beef",
    "British",
    "Fall"
  ],
  "title": "Shepherd's Pie Baked Potatoes",
  "full_text": "Shepherd's Pie Baked Potatoes\nClose\nJump to recipe\nPrep\n35 mins\nCook\n60 mins\nTotal\n95 mins\nServes\n6\nMakes\n6 baked potatoes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Potatoes:\n6\nlarge\nrusset potatoes\n, scrubbed (about 3 pounds; 1.4kg)\nKosher\nsalt and freshly ground black pepper\n1/3 cup (\n80\nml)\nheavy cream\n6 tablespoons\nunsalted butter\n(about 3 1/4 ounces;\n90\ng\n), melted, plus more for brushing\n1\nlarge\negg\nplus 2 yolks, lightly beaten\nFor the Meat Sauce:\n1 cup (\n240\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\nOne 1/4-ounce (\n7\ng\n) packet unflavored\ngelatin\n(about 1 1/2 teaspoons)\n1 tablespoon (\n15\nml\n)\nvegetable oil\n1 pound (\n454\ng\n)\nground beef\nor lamb\n1/2 large\nyellow onion\n(about 5 ounces;\n200\ng\n), finely diced\n1 large\ncarrot\n(about 4 ounces;\n113\ng\n), finely diced\n1 rib\ncelery\n(about 2 ounces;\n60\ng\n), finely diced\n2 medium\ncloves garlic\n(\n10\ng\n), minced\n1 tablespoon (\n30\nml\n)\ntomato paste\n1/2 cup (\n120\nml\n) dry\nred wine\n2\nsprigs\nthyme\n1\nbay leaf\n1 tablespoon (\n15\nml\n)\nWorcestershire sauce\n1 teaspoon (\n5\nml\n)\nfish sauce\n1 tablespoon (\n8\ng\n)\nall-purpose flour\n1 cup\nfrozen peas\n(4 ounces;\n113\ng\n)\nKosher\nsalt and freshly ground black pepper\nDirections\nIf Using Only the Oven for the Potatoes (see notes):\nPreheat oven to 375°F (190°C). Using a fork or paring knife, puncture potatoes in several spots. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet or 9- by 13-inch dish, and bake until a fork can easily be inserted into the center of each potato, about 1 hour. If setting potatoes directly on the oven rack, set a sheet of foil on the rack below to catch any oil drips.\nSerious Eats / Amanda Suarez\nIf Using the Microwave and Oven for the Potatoes (see notes)\n: Preheat oven to 450°F (230°C). Using a fork or paring knife, puncture potatoes in several spots. Microwave potatoes for 5 minutes. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet or 9- by 13-inch dish, and bake until a fork can easily be inserted into the center of each potato, about 20 minutes. If setting potatoes directly on the oven rack, set a sheet of foil on the rack below to catch any oil drips.\nIf Using Only the Microwave for the Potatoes (see notes):\nUsing a fork, prick skin of the potatoes all over. Working in batches if needed, place potatoes on microwave-safe plate, and microwave on high power until potatoes are tender and can be easily pierced with a paring knife, 10 to 12 minutes.\nLet potatoes stand until cool enough to handle, then slice off upper-third of the potatoes lenthwise (like a potato canoe). Scoop out potato flesh into a medium bowl, leaving a 1/4-inch layer attached to the skin.\nSerious Eats / Amanda Suarez\nUsing a ricer, pass the potatoes into a medium bowl. Using a flexible spatula, stir in butter until incorporated. Add cream, folding until incorporated. Season with salt and pepper to taste. Stir in beaten egg mixture until combined, taking care not to overmix the potatoes. Set aside.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Meat Sauce:\nIn a 1-cup liquid measuring cup, add stock, sprinkle gelatin on top, and set aside.\nSerious Eats / Amanda Suarez\nIn a large skillet or sauté pan, heat oil over high heat until shimmering. Add half of ground meat and cook, stirring and scraping bottom of pot, until well browned, 6 to 8 minutes; use a potato masher or large whisk to break up meat. Add remaining meat and cook, breaking up with masher or whisk, until reduced to small bits, about 3 minutes; lower heat as necessary to prevent scorching. If meat has rendered an excessive amount of fat, use a metal spoon to ladle most of it out, leaving just a few tablespoons in the pot. Add onion, carrots, celery, and garlic and cook, stirring and scraping bottom of pot, until just beginning to soften slightly, about 4 minutes.\nSerious Eats / Amanda Suarez\nAdd tomato paste and cook over medium heat, stirring, for 1 minute. Add red wine and bring to a simmer over high heat. Cook, scraping up any browned bits, until almost fully evaporated. Add reserved chicken stock, thyme, bay leaf, Worcestershire, and fish sauce, if using. Sprinkle flour over ground meat in pot, then stir in. Bring to a simmer, then reduce heat to low and simmer until sauce is reduced and thick, about 20 minutes. Discard thyme sprigs and bay leaf. Stir in peas and season with salt and pepper.\nSerious Eats / Amanda Suarez\nTo Assemble and Bake:\nAdjust oven rack to center position and preheat oven to 425°F (220°C).Brush outer skins with melted butter and place on a sheet pan or in a 9- by 13-inch dish. Fill hollowed skins generously with meat mixture.\nSerious Eats / Amanda Suarez\nFit a piping bag\nwith a 1/2-inch star tip. Using a flexible spatula, scraper potato mixture to piping bag. Pipe potato on top by holding filled pastry bag at an 80° angle, and applying steady downward pressure to form small mounds in an even decorative pattern. You’ll have plenty leftover. We recommend piping the rest to make individual servings of\npommes duchesse\n.\nSerious Eats / Amanda Suarez\nBake, rotating baking sheet or or 9- by 13-inch dish halfway through, until golden brown, 15 to 20 minutes. Serve.\nSerious Eats / Amanda Suarez\n​​\nSpecial Equipment\nMicrowave, ricer or food mill, disposable pastry bag, 1/2-inch star tip, quarter-sheet pan or 9- by 13-inch baking dish\nNotes\nBaking the potatoes in the oven produces marginally better results, but takes longer. The microwave speeds things up.\nMake-Ahead and Storage\nThe potatoes can be assembled, wrapped with plastic, and refrigerated up to 2 days. Reheat in a 350°F (180°C) oven for about 35 minutes, then use broiler to brown top.\nPotatoes\nThe Latest\nGround Beef\nBritish\nFall"
}