{
  "url": "https://www.seriouseats.com/shio-tare-recipe",
  "image_url": "https://www.seriouseats.com/thmb/JF2-KEZKkCAFGa0LcpMFZ8Lw0TQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190416-shio-tade-vicky-wasik-1-addda5b5487a4a648d5a0d35b5dbdf58.jpg",
  "tags": [
    "Condiments & Sauces",
    "Japanese",
    "Lemon",
    "Ramen"
  ],
  "title": "Shio Tare (Salt Seasoning Sauce for Ramen) Recipe",
  "full_text": "Shio Tare (Salt Seasoning Sauce for Ramen) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n5 mins\nActive\n20 mins\nResting and Cooling Time\n24 hrs 15 mins\nTotal\n24 hrs 25 mins\nServes\n16 servings\nMakes\n1 cup shio tare\nCook Mode\n(Keep screen awake)\nIngredients\n24\nounces\n(\n680\ng\n) \"used\"\nlemon rinds\n, cut into eighths (see note)\n5\nounces\n(\n140\ng\n)\nkosher salt\n(see note)\n1/4\nounce\nkombu\n, or dried kelp (\n7\ng\n; about\n1\n(7- by 2-inch) piece\n)\nDirections\nCut each lemon rind into a few chunks and toss with salt in a large glass, ceramic, or stainless steel mixing bowl. Cover tightly with plastic wrap and place in refrigerator for 12 hours or overnight.\nUsing a cheesecloth-lined or fine-mesh stainless steel strainer set over a nonreactive bowl, strain the liquid that has collected at the bottom of the bowl. Working in batches, transfer rinds to a stainless steel or plastic potato ricer and squeeze to release any extra liquid, allowing it to pass through strainer into bowl. (You can also twist the rinds in a doubled-over sheet of cheesecloth, wrapping the ends of the cheesecloth around a spoon for torque to help express the liquid; see our article on\nmaking latkes\nfor photos and a fuller description of the technique.) Discard rinds and any salt left in the strainer.\nScrape liquid and any solid salt in bottom of bowl into a small plastic or glass container; there should be about 1/2 cup (120ml) liquid. Submerge kombu in liquid, cover, and place in refrigerator for 12 hours or overnight.\nRemove kombu from liquid and place in a small saucepan along with 1/2 cup (120ml) water. Bring to a simmer over medium-high heat; do not allow to come to a boil. Once the mixture comes to a simmer, shut off the heat.\nWhen kombu dashi is cool, strain it into salt-lemon solution, stirring to dissolve any solid salt at the bottom of the container; discard kombu. Refrigerate tare for up to 2 months.\nSpecial equipment\nRicer\n,\nfine-mesh strainer\nNotes\nThe amount of salt used in this recipe is 20% of the total weight of the \"used\" lemon rinds, so if you have a larger or smaller amount of lemon rinds on hand, adjust the quantity of salt accordingly. We do not recommend making this with less than 1 pound (450g) lemon rinds, as otherwise the yield is too small for the amount of effort involved.\nMake-Ahead and Storage\nIn a tightly sealed glass or plastic container, shio tare will keep for up to 2 months in the refrigerator.\nThis Recipe Appears In\nHow to Make\nShio\nRamen (\"Salt-Flavored\" Ramen)\nCondiments & Sauces\nJapanese\nLemon\nRamen"
}