{
  "url": "https://www.seriouseats.com/shio-ramen-bowl-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-NZ5KYCdLr3n2Aw55JHV6y8YBcU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__03__20190313-shio-ramen-vicky-wasik-35-86b1cb798e0941ae9aa473c232a3e0b9.jpg",
  "tags": [
    "Ramen",
    "Japanese",
    "Comfort Food",
    "Noodle Mains",
    "Soups"
  ],
  "title": "From-Scratch Shio Ramen Recipe",
  "full_text": "From-Scratch Shio Ramen Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n20 mins\nSoaking Time\n8 hrs\nTotal\n8 hrs 35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dashi:\n1/4\nounce\nkombu\n, or dried kelp (\n7\ng\n; about\n1\n(7- by 2-inch) piece\n)\n1/4\nounce\ndried shiitake mushrooms\n(\n7\ng\n; about\n2 to 3\nmushrooms\n)\n1\nounce\n(\n30\ng\n) shaved katsuobushi (\ndried bonito\n)\nflakes\nFor the Shio Ramen:\n2\nquarts\n(\n1.8\nL\n)\nchintan chicken stock\n(see note)\n1/2\ncup\n(\n120\nml\n)\nshio tare\n4\nservings\nramen noodles\n, either\nhomemade\nor store-bought\n1/2\ncup\n(\n120\nml\n) aromatic oil,\nschmaltz\n, or lard (see note), heated until liquid\nToppings, such as\nchashu\nor\najitsuke tamago\n(optional)\n2\nscallions\n, sliced as thinly as possible\nDirections\nFor the Dashi:\nCombine kombu and shiitake mushrooms with 1 quart (900ml) water in a sealable container and refrigerate for at least 8 and up to 24 hours.\nPlace water, kombu, and shiitakes in a small saucepan and place over medium-high heat. Bring to a bare simmer, then shut the heat off; take care not to let the water boil, as the kombu will make the dashi bitter. Add katsuobushi and let steep for 3 minutes. Strain dashi into a heatproof bowl. You can reserve the kombu, shiitakes, and katsuobushi for another use, such as making a niban dashi.\nSerious Eats / Vicky Wasik\nBring a large pot of water to a boil. Combine dashi with chicken stock in a large saucepan and place over medium-high heat. Bring blended broth to a simmer; take care not to let it boil, as it will become cloudy.\nBegin cooking noodles in a large pot of boiling water according to our homemade ramen noodle recipe or package instructions.\nPlace 2 tablespoons (30ml) shio tare in each of 4 warmed serving bowls. Ladle around 1 1/2 cups (350ml) blended broth into each bowl. Taste broth for seasoning; it should be quite salty. Add more broth or more tare to each bowl to adjust the seasoning.\nDrain noodles and divide among serving bowls. Spoon 1 to 2 tablespoons (15 to 30ml) aromatic oil over noodles in each bowl of soup. Add any toppings you have on hand, such as marinated egg or chashu, to each bowl. Garnish with scallions and serve immediately.\nSpecial Equipment\nLadle,\nstrainer\n, noodle baskets (optional).\nNotes\nThe aromatic oil can be made by frying aromatic vegetables, like onion, garlic, and ginger, in any kind of oil or fat, but the best type of fat for this purpose is rendered chicken fat or lard, or some combination of the two. For a detailed method for making aroma oil, consult our\npressure cooker shoyu ramen recipe\n; if you have leftover aroma oil from that recipe, it can be used here, too.\nRamen\nJapanese\nComfort Food\nNoodle Mains\nSoups"
}