{
  "url": "https://www.seriouseats.com/shokupan-japanese-milk-bread-recipe-8605016",
  "image_url": "https://www.seriouseats.com/thmb/a70rPcJcKQcnPyqrQ9y4rQkDx7Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240306-SEA-DebbieWee-milkbread-step13-1nolid-909fb1a05c3648378d008648e1b6ddbe.jpg",
  "tags": [
    "Bread",
    "The Latest",
    "Baking",
    "Yeast Breads"
  ],
  "title": "Shokupan (Japanese Milk Bread)",
  "full_text": "Shokupan (Japanese Milk Bread)\nClose\nJump to recipe\nPrep\n6 hrs\nCook\n50 mins\nTotal\n6 hrs 50 mins\nMakes\n1 9- by 4-inch loaf\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Scald:\n70\ng\nsweet rice flour\n(about\n2 1/2\nounces\n;\n6\ntablespoons\nplus\n1\nteaspoon\n), see notes\n38\ng\n(\n3\ntablespoons\n)\ngranulated sugar\n209\ng\n(\n3/4\ncup\nplus\n2\ntablespoons\n)\nwhole milk\n, brought to a boil\n42\ng\n(\n3\ntablespoons\n)\ncold unsalted butter\n, cut into 1/2-inch cubes\nFor the Dough:\n45\ng\n(\n3\ntablespoons\n)\ncold whole milk\n1\nlarge\negg yolk\n280\ng\nbread\nor\nhigh-protein all-purpose flour\n(about\n9 3/4\nounces\n;\n2\ncups\nplus\n2\ntablespoons\n)\n6\ng\n(\n2\nteaspoons\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume or same weight\n3/4\nteaspoon\ninstant yeast\n(see notes)\n14\ng\n(\n1\ntablespoon\n)\nunsalted butter\n, melted, for brushing loaf\nDirections\nFor the Scald\n:\nIn a medium bowl, whisk glutinous rice flour and sugar to combine. Add boiling milk and rapidly whisk until mixture thickens to pudding-like consistency and registers between 155 to 170˚F (68 to 77˚C). (See notes.)\nSerious Eats / Debbie Wee\nScatter butter over the scalded rice flour mixture, cover bowl with plastic wrap, and let sit until butter has melted and mixture has cooled to at least 80˚F (27˚C), about 1 hour.\nSerious Eats / Debbi Wee\nFor the Dough\n:\nAdd milk and egg yolk to the scald mixture. Whisk until well-combined and at or below 75˚F (24˚C); if not at temperature, cover and let sit until it reaches 75ºF.\nSerious Eats / Debbie Wee\nIn the bowl of a stand mixer fitted with the dough hook attachment, combine flour, salt, and yeast, and mix on low speed until well combined, about 15 seconds. Turn off mixer, then add scalded rice flour mixture all at once and mix on low speed until dough is uniform, about 2 minutes, using a flexible spatula to scrape down sides of bowl and dough hook as needed.\nSerious Eats / Debbie Wee\nIncrease speed to medium and mix until dough just starts to come away from sides of bowl, about 8 minutes. (The dough will remain sticky and webby. Do not overmix here; the dough should not be bouncy.)\nSerious Eats / Debbie Wee\nUsing nonstick baking spray, grease a large bowl; the bowl should be big enough for dough to double in size. Transfer dough to the greased bowl, and cover bowl tightly with plastic wrap. Let sit at warm room temperature (75-80˚F; 24-27˚C) until the dough is puffy and expanded by about 1 1/2 times its original volume, 60 to 90 minutes.\nSerious Eats / Debbie Wee\nUsing lightly moistened hands, deflate the dough until it is restored to its original volume. Cover tightly and refrigerate until dough is at least 55˚F (13˚C), at least 2 hours and up to 24 hours.\nSerious Eats / Debbie Wee\nTo Bake a Yama (\"Mountain\") Style Loaf (see notes below for how to adapt this recipe to produce a perfectly square kaku-style loaf):\nUsing nonstick baking spray, grease a 9- by 4- by 4-inch loaf pan. Lightly flour top of dough and transfer to a lightly-floured work surface. Using a knife or dough scraper, divide dough into 3 equal pieces, about 225g each. Gently shape each into a round. Cover loosely with plastic wrap and let sit for 30 minutes.\nSerious Eats / Debbie Wee\nWorking with one ball of dough at a time (seam-side up), lightly flour exterior of dough and, using a rolling pin, flatten and roll each ball into a 5- by 8-inch oval. Fold the long ends into the center to form a 4-inch wide strip. Roll strip into 9- by 4-inch rectangle, flouring dough on both sides as needed to prevent sticking. Starting at the short end, roll dough into a 4-inch-wide log, stretching it gently as you go and keeping the spiraled edges even. Pinch the seam closed, set aside. Repeat with remaining dough balls and place each shaped cylinder of dough into greased loaf pan, side-by-side, seam-side down, and evenly spaced apart. (The spiraled ends should be facing the long side of pan.)\nSerious Eats / Debbie Wee\nSerious Eats / Debbie Wee\nLoosely cover with plastic wrap and let sit at warm room temperature (75 to 80˚F; 24 to 27˚C) until top of loaf is 1/2 inch below lip of pan, 1 to 2 hours.\nSerious Eats / Debbie Wee\nHalfway through proofing time, adjust oven rack to middle position and preheat oven to 300ºF (150ºC).\nWhen loaf is ready to bake, transfer loaf to oven. Bake until loaf is well-browned and has an internal temperature of at least 195ºF (88ºC), 50 to 60 minutes.\nSerious Eats / Debbie Wee\nTransfer the pan to a cooling rack and brush the exposed surface of loaf with butter. (See notes.) Let cool for 5 minutes, then remove loaf from pan and cool on wire rack, to room temperature, at least 1 hour.\nSerious Eats / Debbie Wee\nSpecial Equipment\nWhisk\n,\ninstant-read thermometer\n,\nstand mixer\n,\nrolling pin\n, nonstick baking spray,\n9- by 4- by 4-inch rectangular bread pan\n,\nbread knife\n, pastry brush,\nwire rack\nNotes\nThis recipe was developed using weight and not volume and will work best if you have a scale.\nUnlike active dry yeast, instant yeast does not have to be bloomed in warm liquid.\nGlutinous or sweet rice flour is available in supermarkets, Asian markets, or online. It can also be made by grinding sweet or Thai white sticky rice to a fine powder in a tabletop mill, high-powered blender, or spice mill. Do not use white rice flour.\nIf in step 1 the scald mixture is below 160˚F (70˚C), transfer to microwave-safe bowl, cover, and microwave in 30-second intervals, whisking after each, until it thickens and reaches 160˚F. If you do not have a microwave and need to continue cooking the scald after doing the pour-over, transfer the mixture to a small nonstick skillet and heat it over medium-low heat, whisking constantly, until it thickens and reaches 160˚F (71ºC). Take care not to overcook it. Immediately transfer the paste to a bowl and proceed with step 2.\nThe overnight cold proof is optional, but adds flavor and convenience. Either way, chilling the dough before shaping makes the otherwise sticky dough easier to handle and is essential.\nThis recipe is written to work with a perfectly rectangular 9- by 4- by 4-inch loaf pan. If you have a smaller flared bread pan instead of a pullman, or are baking in a covered 9- by 4- by 4-inch pullman pan, reduce the dough ball size to 200g and use the remaining dough to make a single bun as a baker’s treat. Proof bun on a small, lightly-greased pan that will fit next to loaf pan on your oven rack. To bake bun, transfer to oven and bake until golden brown, 17 to 20 minutes.\nIf baking loaf in a flared bread pan, proof until top of loaf is 1/2 inch above lip of pan. When loaf is ready to bake, cover with the pan lid, and transfer loaf to oven and bake. Carefully remove lid after 30 minutes and continue to bake until loaf is well-browned and has an internal temperature of at least 195ºF (88ºC), another 20 to 30 minutes.\nThe melted butter is only used when baking the loaf without a lid (or on a bun), and gets brushed on the exposed top of the loaf\nafter\nbaking.\nMake-Ahead and Storage\nThe dough can be refrigerated for up to 24 hours before shaping. To freeze the loaf, wrap it tightly in foil then place in a zip-top bag. The bread can be frozen for up to 3 months.\nBread\nThe Latest\nBaking\nYeast Breads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/shokupan-japanese-milk-bread.webp?"
}