{
  "url": "https://www.seriouseats.com/shoofly-pie-recipe-8701529",
  "image_url": "https://www.seriouseats.com/thmb/UatmQBY2EhQO5YnHHIcVXn7NuCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240826-SEA-ShooflyPie-DeliStudios-04-ddf18492b62b44ec8abb69bde2c336b0.jpg",
  "tags": [
    "The Latest",
    "American",
    "Breakfast & Brunch",
    "Desserts",
    "North American"
  ],
  "title": "Shoofly Pie",
  "full_text": "Shoofly Pie\nClose\nJump to recipe\nPrep\n25 mins\nCook\n45 mins\nChilling and Cooling Time\n5 hrs\nTotal\n6 hrs 10 mins\nServes\n6\nto 8 servings\nMakes\n1 pie\nCook Mode\n(Keep screen awake)\nIngredients\n1\npie crust\n,\nhomemade\nor store-bought\nFor the Topping:\n192g\nall-purpose flour\n(\n6 3/4\nounces\n; 1 1/2 cups)\n150g\ndark brown sugar\n(\n5 1/4\nounces\n; 3/4 cup)\n1/2\nteaspoon\nground cinnamon\n1/4\nteaspoon\nground nutmeg\n1/4\nteaspoon\nground ginger\n1/4\nteaspoon\nground cloves\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use a pinch\n50g\nvegetable shortening\n(\n1 3/4\nounces\n; 1/4 cup)\nFor the Filling:\n3/4\nteaspoon\nbaking soda\n2/3\ncup\n(160ml) hot\nwater\n, about 115°F or 46°C\n220g\nmolasses\n(\n7 3/4\nounces\n; 2/3 cup)\n1\nlarge\negg yolk\n, at room temperature\nDirections\nIf using homemade pie crust: On a clean, lightly floured work surface, roll pie crust into a 12-inch circle about 1/8-inch thick. Transfer to an 8-inch aluminum pie plate with pie crust. Using a pastry brush, dust off excess flour; nestle dough into corners of pan. With scissors or kitchen shears, trim dough to edge of pie plate. Press a fork into the edges of the dough to create small indents around the entire perimeter of the pie crust. Cover with plastic wrap and refrigerate until cold, at least 1 hour, or up to 24 hours.\nSerious Eats / Deli Studios\nAdjust oven rack to middle position and preheat to 400°F (205°C). Freeze prepared pie crust while you prepare topping and filling, about 15 minutes.\nSerious Eats / Deli Studios\nFor the Topping:\nIn a medium bowl, whisk flour, brown sugar, cinnamon, nutmeg, ginger, cloves, and salt to combine. Add shortening and, using your hands, rub shortening into dry ingredients until mixture resembles coarse breadcrumbs and no large pieces of shortening remain; set aside.\nSerious Eats / Deli Studios\nFor the Filling:\nAdd baking soda to a spouted 2-cup heat-proof measuring cup. Pour hot water over baking soda and allow soda to dissolve, about 10 seconds. Add molasses and whisk vigorously until molasses dissolves and liquid is foamy and bubbly, about 30 seconds. Add egg yolk and whisk well to thoroughly combine, about 10 seconds more. (The filling will be very liquid with foam on the surface.)\nSerious Eats / Deli Studios\nSet prepared pie plate on rimmed baking sheet. Pour filling over crust. Scatter topping evenly over pie filling to cover completely. (Distribute slightly more of the mixture around the outside edge; this stops the filling from bubbling over the crust and prevents a dry, sunken spot from forming in the middle.)\nSerious Eats / Deli Studios\nBake 15 minutes. Reduce oven temperature to 350°F (175°C) and bake until crust and topping are golden brown and the center no longer jiggles, 30 to 35 minutes more. Remove from oven and cool on a wire rack to room temperature, about 4 hours. Slice and serve.\nSerious Eats / Deli Studios\nSpecial Equipment\n8-inch pie plate, rolling pin, pastry brush, rimmed baking sheet\nMake-Ahead and Storage\nPie plate can be lined with dough up to 24 hours in advance, covered with plastic wrap, and refrigerated. Proceed with the recipe at step 2.\nShoofly pie tastes best on the day it's made. Wrap leftovers in plastic wrap and store at room temperature for up to 3 days. To freeze, wrap baked pie, including plate, in foil and freeze for up to 3 months. (Alternatively, wrap individual slices in foil.) Thaw overnight in the fridge and serve at room temperature.\nThe Latest\nAmerican\nBreakfast & Brunch\nDesserts\nNorth American",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/shoofly-pie.webp?"
}