{
  "url": "https://www.seriouseats.com/shortbread-cookie-recipe-one-bowl-quick-and-easy-8623247",
  "image_url": "https://www.seriouseats.com/thmb/S7jPJ8Lybg7Jxw_BxZ4jaudL1Yc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240401-SEA-ShortbreadCookies-AmandaSuarez-hero-10f8c30fae404ac681aabb155489efe0.jpg",
  "tags": [
    "British",
    "The Latest",
    "Baking",
    "Cookies",
    "Desserts"
  ],
  "title": "Shortbread Cookies",
  "full_text": "Shortbread Cookies\nClose\nJump to recipe\nPrep\n4 mins\nCook\n40 mins\nCooling Time\n60 mins\nTotal\n104 mins\nServes\n20\nto 24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n250\ng\nall-purpose flour\n(\n8 3/4\nounces\n;\n1 3/4\ncups\nplus\n3\ntablespoons\n)\n250\ng\nwhite\nwhole wheat flour\n(\n8 3/4\nounces\n;\n1 3/4\ncups\nplus\n3\ntablespoons\n)\n100\ng\ncornstarch\n(\n3 1/2\nounces\n;\n3/4\ncups\nplus\n2\ntablespoons\n)\n170\ng\ngolden\ncaster sugar\n(\n6\nounces\n; about\n3/4\ncup\nplus\n2\ntablespoons\n)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n454\ng\nunsalted butter\n(\n1\npound\n;\n2\ncups\n)\nDirections\nAdjust oven rack to middle position and preheat oven to 350ºF (175ºC). Line a 9- by 13- inch rimmed baking sheet with parchment paper; set aside.\nIn a large bowl, whisk together all-purpose flour, white whole wheat flour, cornstarch, caster sugar, and salt until combined.\nSerious Eats / Amanda Suarez\nIn a small saucepan, heat butter over medium-low heat, stirring occasionally, until melted, about 5 minutes. (Alternatively, melt butter in a medium bowl or measuring cup in the microwave.) Pour melted butter into the flour mixture and, using a rubber spatula or dough scraper, incorporate butter into dry ingredients, gently stirring and pressing to combine, until a cohesive dough just forms and no dry bits remain, about 1 minute. (Be careful not to overwork the dough.)\nSerious Eats / Amanda Suarez\nUsing clean hands press the dough into the prepared baking sheet and, using an offset spatula or the flat bottom of a glass or measuring cup, smooth dough out into an even layer. Bake until fragrant and light golden, about 35 to 40 minutes.\nSerious Eats / Amanda Suarez\nRemove shortbread from oven and sprinkle top with 3 tablespoons caster sugar. Using a knife, cut shortbread into individual portions while still warm. Allow shortbread to cool completely in the baking sheet, about 1 hour. Shake excess sugar off individual portions and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9- by 13-inch rimmed baking sheet, parchment paper, whisk, offset spatula\nNotes\nWhite whole wheat flour has a slightly lower protein content than standard whole wheat flour, making it ideal for tender shortbread. If you can’t find white whole wheat flour, you can substitute with regular whole wheat flour. The shortbread will still be tender but not quite as “short.”\nMake-Ahead and Storage\nStore in an airtight container at room temperature for up to 1 week. (Shortbread is best eaten within 3 days, after which it may begin to stale.)\nBritish\nThe Latest\nBaking\nCookies\nDesserts"
}