{
  "url": "https://www.seriouseats.com/shredded-lamb-noodle-soup",
  "image_url": "https://www.seriouseats.com/thmb/8502ngbWC1GyooEkQUHmcU_NnN8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__04__20200306-lamian-noodles-vicky-wasik-34-e3634ab30d39464bbdcab04b2f27a0c9.jpg",
  "tags": [
    "Chinese",
    "Braised & Stewed Lamb",
    "Lamb Shank",
    "Noodles",
    "Soups"
  ],
  "title": "Hot and Numbing Shredded Lamb Noodle Soup Recipe",
  "full_text": "Hot and Numbing Shredded Lamb Noodle Soup Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n80 mins\nActive\n35 mins\nSalting Time\n30 mins\nTotal\n2 hrs\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n3 1/2 to 4\npounds\n(\n1.5 to 1.8\nkg\n)\nlamb shanks\nor lamb neck slices\n2\ntablespoons\n(\n18\ng\n) Diamond Crystal\nkosher salt\n; if using table salt, use half as much by volume or the same weight\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n, divided\n2\ntablespoons\n(\n30\nml\n)\nShaoxing wine\nor dry sherry wine\n2\nquarts\n(\n1920\nml\n) store-bought or\nhomemade\nchicken stock\n2\ncups\n(\n480\nml\n)\nwater\n2\nscallions\n(\n30\ng\n), trimmed and halved\n2\nmedium cloves\ngarlic\n, smashed\n1\n(\n2-inch) stick\ncinnamon\n1\n(\n1-inch) piece\nginger\n, smashed\n4\nstar anise\npods\nFor the Topping:\n3/4\ncup\n(\n180\nml\n)\ncanola oil\n4\nmedium cloves\ngarlic\n, finely minced\n8-12\ndried bird's eye chiles\n(\n6-10\ng\n), coarsely ground\n2\ntablespoons\n(\n16\ng\n)\ntoasted cumin seeds\n, coarsely ground, plus extra whole seeds for serving\n1\ntablespoon\n(\n4\ng\n)\nSichuan peppercorns\n, coarsely ground (see notes)\n1/4\nteaspoon ground\nwhite pepper\n1/3\ncup\n(\n80\nml\n)\ndark soy sauce\n2\nteaspoons\n(\n8\ng\n)\nsugar\nFor Serving:\n6\nservings\nhand-pulled noodles (lamian)\nor store-bought\nlamian\nor\nramen noodles\n(see notes)\n4\nscallions\n, sliced thinly\n8\nfresh cilantro\nsprigs\n, cut into 1-inch pieces\nDirections\nFor the Broth:\nSprinkle lamb evenly on all sides with salt and place on wire rack set in rimmed baking sheet. Let stand at room temperature for at least 30 minutes and up to 2 hours.\nIn a stovetop pressure cooker set over medium-high heat or in an electric pressure cooker set to sauté mode, heat 1 tablespoon (15ml) oil until smoking. Working in batches, brown lamb on all sides, about 8 minutes; transfer to a heatproof bowl. Pour off fat in pressure cooker into a heatproof bowl and reserve. Return cooker to heat (or sauté mode), stir in wine, and cook, scraping up any browned bits with wooden spoon, until alcohol has cooked off, about 30 seconds. Stir in chicken stock and water. Return lamb to pot along with any accumulated juices.\nLock pressure-cooker lid in place and bring to high pressure over high heat. Once cooker has reached high pressure, cook for 40 minutes, adjusting heat as needed to maintain high pressure (if using a stovetop pressure cooker; electric ones will automatically regulate the heat and pressure level).\nDepressurize the cooker using the quick-release method, then carefully remove lid, allowing steam to escape away from you. Strain broth through fine-mesh strainer into clean heatproof container, pressing on solids to extract as much liquid as possible; transfer lamb to work surface. When lamb is cool enough to handle, separate meat from bones, discarding bones.\nHeat remaining 1 tablespoon (15ml) oil in now-empty pressure cooker over medium heat (or using an electric cooker's sauté mode) until shimmering. Add scallions, garlic, ginger, and star anise and cook until fragrant, about 1 minute. Stir in strained broth, bring to boil, and simmer until fragrant, 10 to 15 minutes. Season with salt.\nFor the Topping:\nMeanwhile, add oil, reserved lamb fat, and minced garlic to medium saucepan set over medium-high heat and cook until garlic is fragrant and just beginning to brown, 3 to 5 minutes. Remove from heat and stir in chilies, cumin, Sichuan peppercorn, and white pepper. Let mixture cool slightly, about 5 minutes. Whisk in dark soy sauce and sugar. Gently stir in reserved lamb meat until lightly shredded and incorporated. Season with salt.\nTo Serve:\nUsing a slotted spoon, remove and discard scallions, garlic, ginger, and star anise pods from broth. Bring large pot of unsalted water to boil over high heat. If making your own hand-pulled noodles, prepare them now; otherwise, proceed with cooking store-bought noodles. Place in pot of boiling water, stirring gently with chopsticks or tongs to prevent sticking. Add about 1 1/2 cups (360ml) hot broth to serving bowls.\nWhen noodles are cooked, drain thoroughly with fine-mesh strainer or noodle basket, shaking off as much excess water as possible, then place noodles in each bowl of hot broth. Stir noodles with chopsticks or tongs, then lift and fold noodles over. Spoon 1/2 cup shredded lamb mixture with some of its sauce over noodles. Sprinkle with sliced scallions and cilantro. Serve immediately.\nSpecial Equipment\nElectric or stovetop pressure cooker\n,\nfine-mesh strainer\nNotes\nIf you're planning to make your own hand-pulled noodles, do not do it until all the components of the soup are ready, as the freshly pulled noodles must be cooked right away.\nMake-Ahead and Storage\nIn separate, sealed, air-tight containers, the broth and topping will keep for 1 week in the refrigerator. The broth can be frozen for up to 1 month.\nRead More\nTaiwanese Beef Noodle Soup Recipe\nChinese\nBraised & Stewed Lamb\nLamb Shank\nNoodles\nSoups"
}