{
  "url": "https://www.seriouseats.com/shrimp-scampi-butter-garlic-recipe",
  "image_url": null,
  "tags": [
    "Shrimp",
    "Italian",
    "Stovetop Seafood",
    "Garlic",
    "Seafood Mains"
  ],
  "title": "Shrimp Scampi With Garlic, Red Pepper Flakes, and Herbs Recipe",
  "full_text": "Shrimp Scampi With Garlic, Red Pepper Flakes, and Herbs Recipe\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n25 mins\nMarinating Time\n60 mins\nTotal\n85 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nlarge shrimp\n, peeled and split down the back, veins removed\nKosher salt\n1/4\nteaspoon\nbaking soda\n4\ntablespoons\n(\n60\nml\n)\nextra-virgin olive oil\n, divided, plus more as needed\n4\nteaspoons\n(\n25\ng\n)\nminced garlic\n(\n4 to 5\nmedium\ncloves\n)\nPinch\nred pepper flakes\n1/2\ncup\n(\n120\nml\n)\ndry vermouth\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n, cut into tablespoon-size pieces\n1\ntablespoon\n(\n15\nml\n)\nfresh juice\nand\n1\nteaspoon\n(\n4\ng\n) grated zest from\n1\nlemon\n2\nteaspoons\n(\n6\ng\n)\nminced parsley\n,\ntarragon\n, and\nchives\nDirections\nIn a large bowl, toss together shrimp with 3/4 teaspoon (3g) kosher salt and baking soda until evenly coated. Let stand for at least 10 minutes and up to 1 hour.\nIn a large skillet, heat 3 tablespoons (45ml) olive oil over high heat until shimmering. Add half of shrimp in an even layer and cook, stirring and turning shrimp occasionally, until pink, barely cooked through, and just starting to turn lightly golden in spots, about 2 minutes. Using a slotted spoon, flexible slotted offset spatula, or tongs, transfer shrimp to a plate. Repeat with remaining shrimp, adding more oil if necessary.\nSerious Eats / Vicky Wasik\nAdd remaining 1 tablespoon (15ml) olive oil to skillet along with garlic and red pepper flakes and cook, stirring, until garlic is just starting to turn golden, about 1 minute; lower heat if necessary to prevent scorching.\nSerious Eats / Vicky Wasik\nAdd vermouth and boil over high heat, stirring and scraping up any browned bits, until raw alcohol smell is mostly gone and vermouth has reduced by about half, about 3 minutes.\nSerious Eats / Vicky Wasik\nAdd butter and cook, stirring and swirling pan rapidly as butter melts to create a silky, emulsified sauce. Remove from heat, add lemon juice, and season with salt. Return to medium heat and bring to a simmer, stirring constantly. (If sauce breaks, whisk in a teaspoon or two of water until sauce emulsifies again.)\nSerious Eats / Vicky Wasik\nReturn shrimp to skillet, add herbs and lemon zest, and toss until shrimp are coated in sauce and warmed through. Serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge\nskillet\nNotes\nThis dish can be served with pasta. To do so, cook linguine or other long noodles until al dente, then toss in the pan with shrimp and sauce, adding a little pasta-cooking water to bind it all together.\nRead More\nShrimp Scampi With Pasta\nShrimp Fra Diavolo (Shrimp and Pasta with Spicy Tomato Sauce) Recipe\nBrazilian-style Peel And Eat Shrimp with Fried Garlic (Camarao ao Alho) Recipe\nA Comprehensive Guide to Buying Better Shrimp\nEasy Techniques to Improve Any Shrimp Recipe\nShrimp\nItalian\nStovetop Seafood\nGarlic\nSeafood Mains"
}