{
  "url": "https://www.seriouseats.com/shrimp-fra-diavolo-pasta-recipe",
  "image_url": "https://www.seriouseats.com/thmb/TWmRGMwXojAl5a3k8rvRcw_6H7g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__02__20170105-shrimp-fra-diavalo-vicky-wasik-11-e4f2798c318a4334bd1a0cda9fa91893.jpg",
  "tags": [
    "Italian",
    "Stovetop",
    "Spaghetti, Bucatini, & Linguine",
    "Shrimp",
    "Tomato"
  ],
  "title": "Shrimp Fra Diavolo (Shrimp and Pasta with Spicy Tomato Sauce) Recipe",
  "full_text": "Shrimp Fra Diavolo (Shrimp and Pasta with Spicy Tomato Sauce) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n30 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nteaspoon\nkosher salt\n, plus more as needed\n3/4\npound\nlarge shrimp\n(\n340\ng\n), shelled and deveined, shells reserved\nLarge\npinch\nbaking soda\n6\ntablespoons\nextra-virgin olive oil\n(\n90\nml\n), divided\n4\nmedium\ncloves garlic\n, thinly sliced\n1 1/2\nteaspoons\ndried oregano\n1 to 2\nteaspoons\nred chile flakes\n(see note)\n2\ntablespoons\n(\n30\nml\n)\nbrandy\n(optional)\n1\n(\n28-ounce; 795 g) can\nwhole peeled tomatoes\nand their juices, coarsely puréed or crushed by hand\n1/2\ncup\nbottled\nclam juice\n(\n120\nml\n)\n1\npound\nspaghett\ni (\n450\ng\n)\n1/4\ncup\nminced flat-leaf parsley\nleaves and tender stems (from\n1\nsmall\nbunch\n)\nDirections\nBring a large pot of salted water to a boil. In a medium bowl, toss the shrimp well with the 1/2 teaspoon salt and the baking soda. Set aside.\nIn a large skillet or sauté pan, heat 4 tablespoons olive oil over medium-high heat until shimmering, Add reserved shrimp shells and cook, stirring constantly, until they've all turned a reddish color, about 4 minutes. Off the heat, remove shells using tongs, a slotted spatula, and/or a slotted spoon, allowing any excess oil to drain back into skillet as you go; discard shells. You should still have plenty of oil left in the skillet.\nSerious Eats / Vicky Wasik\nReturn skillet to medium-high heat, add shrimp, and cook, stirring and turning occasionally, until shrimp are just starting to brown in spots and are almost fully cooked through, about 3 minutes. Off heat, transfer shrimp to a plate and set aside.\nSerious Eats / Vicky Wasik\nReturn skillet to medium-low heat. Add garlic, oregano, and chile flakes and cook, stirring, until garlic is just beginning to turn golden, about 3 minutes. Add brandy, if using, and cook until almost fully evaporated. Add tomatoes and clam juice and bring to a simmer. Season with salt.\nSerious Eats / Vicky Wasik\nBoil pasta in a pot of salted water until al dente. Drain, reserving about 1 cup of pasta cooking water, and add pasta to the sauce along with a splash of pasta cooking water. Add shrimp and cook over medium-high heat, stirring, until sauce reduces and clings to pasta and shrimp are fully heated through; add more pasta water as necessary if the sauce becomes too dry. Season with salt, if necessary.\nSerious Eats / Vicky Wasik\nStir in parsley and remaining 2 tablespoons olive oil. Serve right away.\nNotes\nRed chile flakes can vary greatly in their heat intensity, as does personal tolerance for heat. The quantity given here is a rough estimate, but follow your own judgment based on the strength of your chile flakes and the degree of heat you want.\nRead More\nSpaghetti allo Scoglio (Spaghetti With Mixed Seafood)\nSpaghetti alle Vongole in Bianco (With White Clam Sauce)\nShrimp Scampi With Pasta\nPasta with Crab, Tomato, and Chiles\nItalian\nStovetop\nSpaghetti, Bucatini, & Linguine\nShrimp\nTomato"
}