{
  "url": "https://www.seriouseats.com/shrimp-with-cilantro-sauce-recipe-8685969",
  "image_url": "https://www.seriouseats.com/thmb/zsFD4r9E1WteLDGypex1NPAStco=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240723-Cilantro-Shrimp-Larisa-Niedle-SEA-hero-152e05a5bc28471b9e596549ec229ab8.jpg",
  "tags": [
    "Shrimp",
    "The Latest",
    "Quick Dinners",
    "Indian",
    "Seafood Mains"
  ],
  "title": "This Easy Shrimp With Cilantro Sauce Is My Favorite Dinner Party Recipe",
  "full_text": "This Easy Shrimp With Cilantro Sauce Is My Favorite Dinner Party Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nMarinating Time\n60 mins\nTotal\n75 mins\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cilantro Chutney and Marinating the Shrimp:\n6\nounces\n(\n170\ng\n) fresh\ncilantro\nleaves and tender stems (from\n1 to 2\nbunches\n), washed, trimmed, and roughly chopped, divided\n4\nmedium\ngarlic cloves\n(\n20\ng\n), roughly chopped\n1-3\nThai bird\nchiles,\nstemmed, to taste\n6\ntablespoons\n(\n90\nml\n) fresh lime or\nlemon juice,\ndivided (from\n3\nlarge\nlimes\nor lemons)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n, plus more to taste\n3/4\ncup\n(\n180\nml\n)\nwater,\ndivided\n2\nteaspoons\nground cumin\n1/4\nteaspoon\ngranulated sugar\n1/4\nteaspoon\nbaking soda\n1\npound\nlarge or medium\nshrimp\n(\n21-25 or 26-30\ncount\n), peeled and deveined\nFor Cooking the Shrimp:\n3\ntablespoons\n(\n45\nml\n) neutral\noil,\nsuch as grapeseed or vegetable oil\n1\nteaspoon\nwhole\ncumin seeds\n1/4\nteaspoon\nground turmeric\n1\nsmall\nwhite or\nyellow onion\n(\n6\nounces\n;\n170\ng\n), minced\nRemaining\ncilantro\nchutney, from above\n1\nrecipe\ncooked easy\nbasmati\nrice,\nfor serving\nDirections\nFor the cilantro chutney and marinating the shrimp:\nIn a blender, add 1/3 of the cilantro along with the garlic, chiles, 3 tablespoons lime juice, salt, and 1/4 cup water and blend, scraping down the sides of blender as needed, into a fine, soft paste, 30 to 60 seconds. Add remaining 2/3 of the cilantro, 1/4 cup water, remaining 3 tablespoons lime juice, cumin seeds, and sugar, and blend until smooth, scraping down the sides of the blender jar as needed, about 60 seconds. Season to taste with salt. The chutney should be smooth.\nSerious Eats / Larisa Niedle\nIn a medium bowl, whisk together 3/4 cup (180ml) chutney with the baking soda; add the shrimp and toss until well coated. Refrigerate for 45 to 60 minutes. Store the remaining (about 1 cup) chutney separately. Before washing the blender, pour the remaining 1/4 cup water into it and briefly pulse to collect any remaining chutney in the jar. Add this to the reserved chutney.\nSerious Eats / Larisa Niedle\nFor cooking the shrimp:\nIn a large sautée pan, heat oil over medium heat until shimmering. Add the cumin seeds and cook until they pop and are fragrant, about 10 seconds, then immediately stir in onion and turmeric. Cook over medium-high heat, stirring occasionally, until the onion begins to soften, 3 to 5 minutes, then transfer to a small bowl.\nSerious Eats / Larisa Niedle\nUsing a slotted spoon, remove shrimp from marinade, letting excess marinade drip back into the bowl, and add to the now-empty pan in one even layer. Cook shrimp for 30 seconds without moving, then stir and continue to cook until beginning to brown, 1 minute.\nSerious Eats / Larisa Niedle\nReduce heat to low, add the cooked onions back to the pan and pour in the remaining reserved cilantro chutney mixture. Stir to combine and bring to a boil over medium heat while stirring occasionally; reduce heat to medium-low and simmer until the shrimp are just pink and opaque, about 1 minute longer. Serve the shrimp and the sauce immediately over steamed Basmati white rice.\nSerious Eats / Larisa Niedle\nSpecial Equipment\nHigh-powered blender, large sautée pan\nMake-Ahead and Storage\nThe chutney can be refrigerated in an airtight container for 5 days or frozen for 4 weeks. When freezing the chutney, I like to use an ice cube tray to store it in portions. That way you can remove only as much chutney as you need.\nShrimp\nThe Latest\nQuick Dinners\nIndian\nSeafood Mains"
}