{
  "url": "https://www.seriouseats.com/sichuan-chicken-salad-chinese-bang-bang-hot-and-numbing-recipe",
  "image_url": "https://www.seriouseats.com/thmb/YM_YmJd1I_7l6N819XLycHCHfFg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__05__20150525-bang-bang-chicken-sichuan-recipe-18-7e01a20e36a4462a927ac52c06488994.jpg",
  "tags": [
    "Chinese",
    "Chicken Breast",
    "Sous Vide Chicken",
    "Chicken Salad"
  ],
  "title": "Bang Bang Ji Si (Hot and Numbing Sichuan Chicken Salad)",
  "full_text": "Bang Bang Ji Si (Hot and Numbing Sichuan Chicken Salad)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n20 mins\nChilling Time\n15 mins\nTotal\n80 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 3/4\npounds\nwhole bone-in, skin-on split\nchicken breast halves\n(\n2 to 3\nbreast\nhalves\n)\nKosher salt\nand freshly ground black pepper\n6\ncloves\ngarlic\n, smashed, divided\n6\nwhole\nscallions\n,\n2\nroughly chopped,\n4\nthinly sliced at a sharp bias\n1\n(\n1-inch\n)\nknob\npeeled fresh ginger\n, thinly sliced\n2\nteaspoons\ntoasted\nwhole\nSichuan peppercorns\n1\ntablespoon\nsugar\n2\nteaspoons\nblack or plain\nsesame seeds\n, plus more for garnish\n1\ntablespoon\nsesame paste\n, preferably\nChinese\n1\ntablespoon\nsoy sauce\n4\nteaspoons\nChinkiang\nor black\nvinegar\n1/4\ncup\nchile oil\nwith sediment (see note)\nDirections\nSeason chicken generously with salt and pepper. Place chicken in zipper-lock bags or vacuum bags and add half of garlic, roughly chopped scallions, and all of ginger. Remove air from zipper-lock bags by closing the bags, leaving the last inch of the top unsealed. Slowly lower into a pot of water, sealing the bag completely just before it fully submerges. If using a vacuum bag, seal according to manufacturer instructions.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nIf Cooking in a Sous-Vide Precision Cooker\n: Preheat a sous-vide cooker to 150°F (66°C). Add chicken and cook for at least 1 hour and up to 4. Transfer to an ice bath and let chill for 15 minutes.\nIf Cooking in a Cooler\n: Heat 2 quarts of water in a large, heavy-bottomed saucepan or Dutch oven over medium-high heat until it registers 155°F (68°C) on an instant-read thermometer. Transfer to a small cooler, add chicken, and seal cooler. Cook for at least 1 hour and up to 4, topping up with boiling water as necessary to maintain temperature of 150°F. Transfer to an ice bath and let chill for 15 minutes.\nWhile chicken cooks, grind Sichuan peppercorns in a mortar and pestle until a rough powder is formed. Add sugar, remaining 3 cloves garlic, and sesame seeds and pound until a rough paste is formed. Add sesame paste, soy sauce, and vinegar and pound until a smooth paste is formed. Stir in chile oil and sediment. Set dressing aside.\nSerious Eats / J. Kenji López-Alt\nWhen chicken is cooked, remove from bags and discard garlic, scallions, and ginger. Stir 2 tablespoons of juices from the bag into the dressing. Remove skin and bones from chicken and discard. Shred meat and transfer to a large bowl. Add dressing and sliced scallions.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nToss chicken to coat in dressing and adjust seasoning with salt and pepper. Serve immediately, sprinkled with more scallions and sesame seeds and drizzled with additional chile oil if desired.\nSerious Eats /J. Kenji López-Alt\nSpecial Equipment\nSous vide precision cooker\nor a small beer cooler\nNotes\nChile oil with sediment can be found in most Chinese supermarkets. Alternatively, make your own by toasting 1/4 cup of dried ground Sichuan or Korean chiles in a dry wok until fragrant. Add 1/2 cup of neutral oil like canola and heat until lightly bubbling. Immediately transfer to a cool pot and let rest until cool. Chile oil can be stored in a sealed container in the refrigerator indefinitely.\nRead More\nThe Food Lab's Complete Guide to Sous Vide Chicken Breast\nChinese\nChicken Breast\nSous Vide Chicken\nChicken Salad"
}