{
  "url": "https://www.seriouseats.com/sichuan-stir-fried-potatoes-recipe-5218068",
  "image_url": "https://www.seriouseats.com/thmb/Y_fyH4DXixelpfDH56fie21gJb0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220228-sichuan-potato-stir-fry-vicky-wasik-35-4af36415923546cb868f7e7a79699d35.jpg",
  "tags": [
    "Potatoes",
    "Chinese",
    "The Latest"
  ],
  "title": "Suanla Tudousi (Hot-and-Sour Sichuan Stir-Fried Potatoes) Recipe",
  "full_text": "Suanla Tudousi (Hot-and-Sour Sichuan Stir-Fried Potatoes) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nSoaking Time\n20 mins\nTotal\n40 mins\nServes\n2 Servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\nor\n2\nmedium\nwaxy potato\n(about\n10\nounces\n;\n280\ng\n), such as red bliss or round white, peeled and cut into 1/16-inch-thick matchsticks\n4\ndried Chinese\nchiles\n(about\n4\ng\ntotal), stemmed and seeded\nKosher salt\n1\nteaspoon\n(\n5\nml\n)\nChinkiang black vinegar\n1/2\nteaspoon\nlight Chinese soy sauce\n1/2\nteaspoon\nsugar\n1/2\nteaspoon\nMSG or\nTotole Granulated Chicken Soup Mix\n(see note)\n1\nteaspoon\ndried Sichuan peppercorns\n1\nmedium\nscallion\n(\n15\ng\n), ends trimmed and cut into 2-inch segments\n2\nmedium\ngarlic cloves\n(\n10\ng\n), thinly sliced\n1\nlong\nred hot chile pepper\n(about\n1\nounce\n;\n30\ng\n), stemmed, seeded, and sliced lengthwise into 2-inch matchsticks (see note)\n1\nlong\ngreen hot chile pepper\n(about\n1\nounce\n;\n30\ng\n), stemmed, seeded, and sliced lengthwise into 2-inch matchsticks (see note)\n1/4\ncup\n(\n60\nml\n) neutral oil, such as peanut, canola, or\nvegetable oil\nDirections\nPlace shredded potatoes in a medium bowl, cover with cold water, and soak for 5 minutes. Using your hands, swish potatoes until water turns cloudy, about 30 seconds. Using a colander, drain potatoes, discarding the cloudy soaking water. Return potatoes to bowl, refill with cold water, and repeat process until water runs clear, at least 2 more times. Drain, and set aside; refill now-empty bowl with cold water and set aside as well. Using sharp kitchen shears, cut chiles lengthwise into threads. Place in small bowl, cover with cold water and soak for 5 minutes, then drain and set aside.\nFill a wok with about 4 inches water, season generously with salt, and bring to a boil over high heat. Add potatoes and cook until barely translucent, about 30 seconds. Transfer to prepared bowl of cold water, then rinse under running cold water until completely chilled. Drain well and set aside. In a small bowl, combine black vinegar, soy sauce, sugar, and MSG. Stir until well combined and sugar is dissolved; set aside.\nHeat a carbon-steel wok or large carbon-steel skillet over high heat until lightly smoking. Add oil, swirling to coat wok, and heat until oil is lightly smoking. Pour half the oil into a heatproof bowl; reserve extra oil for another use. Remove wok from heat and add Sichuan peppercorns to remaining oil, swirling wok occasionally, until peppercorns are fragrant and toasted but not burnt, about 30 seconds. Using a slotted spoon or spider, strain and discard Sichuan peppercorns, leaving oil in the wok.\nIncrease heat to high and heat oil until just smoking. Add dried chiles, scallion, and garlic. Cook until aromatic, stirring constantly with a wok spatula and taking care not to brown the garlic, about 10 seconds.\nAdd reserved potatoes, and continue to cook, stirring and tossing constantly, until potatoes are barely cooked through but still retain their crisp texture, about 1 minute. Add red and green chile peppers and cook, stirring and tossing, until just barely cooked and still crisp, about 30 seconds.\nWorking quickly, pour the black vinegar mixture around the sides of the wok and toss until well combined, about 20 seconds. Taste and adjust seasoning with additional salt and sugar, if needed. Transfer to a serving bowl, and serve immediately as a hot dish, or allow to cool to room temperature and then refrigerate until completely chilled, and serve cold.\nSpecial Equipment\nCarbon steel wok, spider\nNotes\nAt home, it’s best to cook this dish at this batch size and not to increase the quantities, so as to prevent overcrowding of the wok.\nIf you want a less spicy version of the dish, you can substitute an equal quantity of red and green bell (or Anaheim) peppers.\nTo make a less aggressively seasoned version of this dish, a cleanly seasoned dish called 炝炒土豆丝, or blanch-fried potatoes, halve the amount of peppers and omit the black vinegar.\nIf you can’t find Totole Granulated Chicken Soup Mix, you can substitute any other chicken broth powder, such as Orrington Farms Chicken Broth powder.\nIf you want to dress up the finished dish, whether served hot or cold, you can toss it with a chile oil of your choosing.\nMake-Ahead and Storage\nTo serve this dish cold, the stir-fry can be made up to 2 days in advance and refrigerated in an airtight container.\nPotatoes\nChinese\nThe Latest\nThe Wok\nWhy The Wok?\nEssays & Profiles\nWok Recipes\nWok Skills 101\nWok Skills 102\nThe Wok Gear Guide\nThe Importance of the Wok\nQ&A: Grace Young & Her Woks\nFrom China: The Future of the Wok\nSan Francisco's Iconic Wok Shop\nExcerpt: The Science of Woks\nDim Sum–Style Steamed Pork Ribs\nTofu With Peas and Silky Egg\nSichuan Stir-Fried Potatoes\nChinese Scrambled Eggs With Tomato\nTaiwanese Deep-Fried Squid Balls\nThai Chicken and Curry Stir-Fry\nJapanese Shrimp in Chili Sauce\nStir-Frying\nDeep-Frying\nBraising\nSteaming\nSmoking\nPassing-Through\nEssential Knife Skills for Wok Cooking\nSetting Up a Wok Cooking Station\nHow to Season Your Wok\nHacking Wok Hei at Home\nBest Flat-Bottomed Woks\nThe Best Torches for Wok Hei\nThe Full Wok Accessory Guide\nOutdoor Wok Burners Picks"
}