{
  "url": "https://www.seriouseats.com/sicilian-style-pasta-with-eggplant-tomatoes-ricotta-salata-pasta-alla-norma-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PU9arPW4qjocxK5AKMIHxneSCEI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2013__01__20210121_Pasta-Norma_LizClayman-16-96d59b641438455ea7cf48936da13c06.jpg",
  "tags": [
    "Italian",
    "Vegetarian Mains",
    "Stovetop Pasta",
    "Pastas",
    "Eggplant"
  ],
  "title": "Pasta Alla Norma (Sicilian Pasta With Eggplant, Tomatoes, and Ricotta Salata) Recipe",
  "full_text": "Pasta Alla Norma (Sicilian Pasta With Eggplant, Tomatoes, and Ricotta Salata) Recipe\nClose\nJump to recipe\nCook\n40 mins\nActive\n30 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\nextra-virgin olive oil\n, plus more for serving\n3/4\npound\nsmall Italian or\nJapanese eggplants\n(\n2 to 3\nsmall\neggplants\n), trimmed, split in half lengthwise, and cut into 3/8-inch half moons (see notes)\nKosher salt\n3\nmedium\ncloves garlic\n, minced (about\n1\ntablespoon\n)\n1\nteaspoon\ndried oregano\n1/4\nteaspoon\nred pepper flakes\n2\ntablespoons\ntomato paste\n1\n(28-ounce) can\nwhole peeled tomatoes\n, crushed by hand into 1/2-inch chunks\n1\npound\ndry\nridged, tubular pasta such as rigatoni or\npenne rigate\nHandful\nfresh small basil\nleaves, or roughly torn large leaves\n2\nounces\naged\nricotta salata\n, finely grated (see notes)\nDirections\nHeat 2 tablespoons olive oil in a 12-inch nonstick or cast iron skillet over medium heat until shimmering. Add as much eggplant as fits in a single layer and season with salt. Cook, shaking pan occasionally, until eggplant is well browned on both sides, about 10 minutes total. Transfer eggplant to a plate and set aside. Repeat with remaining eggplant, adding olive oil as necessary, until all eggplant is browned.\nSerious Eats / Liz Clayman\nAdd any remaining olive oil and increase heat to medium-high. Heat until olive oil is shimmering. Add garlic, oregano, and pepper flakes, and cook, stirring constantly, until fragrant but garlic is not browned, about 30 seconds. Add tomato paste and cook, stirring constantly until evenly incorporated and tomato paste starts to fry. Add crushed tomatoes and their juice. Bring to a boil, reduce to a bare simmer and cook, stirring occasionally, until liquid is thickened into a sauce-like consistency, about 10 minutes. Season to taste with salt.\nSerious Eats / Liz Clayman\nMeanwhile, bring a large pot of salted water to a boil and cook pasta according to package directions. Drain pasta, reserving 1 cup of cooking liquid. Return pasta to pot.\nSerious Eats / Liz Clayman\nAdd sauce to pasta and toss to coat, adding reserved pasta water as necessary to thin sauce to desired consistency. Add eggplant slices and toss to combine.\nSerious Eats / Liz Clayman\nServe pasta immediately, drizzled with extra-virgin olive oil, garnished with grated ricotta salata and torn basil leaves.\nSerious Eats / Liz Clayman\nNotes\nLook for eggplants that are smooth-skinned, firm, and dense.\nMost of the ricotta salata sold in the U.S. is un-aged and milder than is required for this recipe. Look for aged imported ricotta salata at an Italian specialty market, or substitute caciocavallo, or a mix of feta (preferably sheep's milk) and Pecorino Romano cheese.\nRead More\nPasta chi Vruoccoli Arriminati (Sicilian Pasta With Cauliflower and Toasted Breadcrumbs)\nPasta c'Anciuova e Muddica Atturrata (Sicilian Pasta With Anchovies and Toasted Breadcrumbs\n)\nPasta Con le Sarde (Sicilian Pasta With Sardines)\nItalian\nVegetarian Mains\nStovetop Pasta\nPastas\nEggplant"
}