{
  "url": "https://www.seriouseats.com/simmered-tofu-soup-with-pork-and-cabbage-recipe-5212276",
  "image_url": "https://www.seriouseats.com/thmb/yb32xbkmIuOtZTsFwy0zbMs4pzw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211001-frozen-tofu-vicky-wasik-27-9959c2677dae46f2a151a6951c7388cc.jpg",
  "tags": [
    "Chinese",
    "Pork Belly",
    "Tofu",
    "Mains",
    "Cabbage"
  ],
  "title": "Simmered Frozen Tofu Soup With Pork and Cabbage",
  "full_text": "Simmered Frozen Tofu Soup With Pork and Cabbage\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nFreezing/Thawing Time\n6 hrs\nTotal\n6 hrs 25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nfirm tofu\n, drained of packing liquid\n17 1/2\nounces\n(\n500\ng\n)\nNapa cabbage\n, from about\nhalf\na\n2 3/4-pound head\n2\ntablespoons\n(\n30\ng\n)\nneutral oil\nOne\n1 1/2-inch knob\nfresh ginger\n(\n3/4\nounce\n;\n20\ng\n), peeled and thinly sliced\n4\nmedium cloves\ngarlic\n(\n25\ng\n), smashed\n5 1/2\nounces\n(\n155\ng\n) very thinly sliced\nboneless, skinless pork belly\nor\npork shoulder\n(see note)\n1\ntablespoon\n(\n15\ng\n)\nlight soy sauce\n2\ncups\n(\n475\ng\n)\nhomemade\nchicken stock\nor\nlow-sodium\n, store-bought broth\n2\ncups\n(\n475\ng\n)\nwater\n1\ntablespoon\n(\n10\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n2\nteaspoons\n(\n10\ng\n)\nchicken bouillon\n1/4\npound\n(\n115\ng\n)\ndry rice noodles\n, soaked in room temperature water for 5 minutes, then drained (see note)\nCooked long-grain white rice\n, for serving\nDirections\nPlace tofu in a sealed container or on a tray wrapped with plastic and freeze for at least 3 hours and up to 6 months. When fully frozen, the tofu will turn a darker shade of yellow/brown and become slightly translucent.\nSerious Eats / Vicky Wasik\nWhen ready to cook, fully thaw the tofu, at least 3 hours at room temperature or 8 hours in the fridge. Gently squeeze the tofu between your palms to express as much water as possible without damaging it. Cut tofu into 10 equally sized pieces.\nSerious Eats / Vicky Wasik\nCore the Napa cabbage and separate the leaves. Cut the tender portions from the thicker stem of each Napa cabbage leaf. Tear tender portions into roughly 2-inch pieces, and cut thick stems into roughly 5-inch by 1-inch strips. Keep separate and set aside.\nIn a large Dutch oven, heat oil over medium-high heat until lightly smoking. Add ginger and sauté until lightly browned around edges, about 30 seconds. Add garlic and cook until lightly browned, about 15 seconds. Add sliced pork and cook, stirring, until last traces of pink are gone, about 30 seconds.\nSerious Eats / Vicky Wasik\nAdd sliced Napa cabbage stems and cook, stirring, until they begin to soften, about 30 seconds. Stir in soy sauce and cook until mostly dry, about 30 seconds. Add the torn cabbage leaves, followed by the chicken stock and water. Bring to a boil.\nSerious Eats / Vicky Wasik\nAdd the tofu to the pot along with the salt and chicken bouillon. Return to a boil, cover, and let simmer until the Napa cabbage stems have softened, about 5 minutes.\nSerious Eats / Vicky Wasik\nSeason with salt, if necessary. Add soaked rice noodles, and let simmer until the rice noodles are soft and cooked through, about 2 minutes (note that cooking time will depend on the type of rice noodle you use). Serve warm with white rice.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nDutch oven\nNotes\nYou can find very thinly sliced pork belly and shoulder at many Asian markets.\nThere are\nmany types of rice noodles\n, any of which will work here. I prefer a Chinese rice vermicelli in this recipe, though many Northeast Chinese homes prefer chewier cellophane noodles.\nMake-Ahead and Storage\nThe tofu can be kept in the freezer for up to 6 months, then defrosted as needed.\nChinese\nPork Belly\nTofu\nMains\nCabbage"
}