{
  "url": "https://www.seriouseats.com/sinaloan-mackerel-ceviche-recipe-7693372",
  "image_url": "https://www.seriouseats.com/thmb/c6fJPM6_c9Ntt97sVoALmGuTbV0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230823-SEA-MazatlanCevichedeSierra-LorenaMasso-22-75a4bd92627a4d5c9d0e3f1fd770d8ec.jpg",
  "tags": [
    "Seafood Mains",
    "The Latest",
    "Mexican",
    "No-Cook Seafood",
    "Fish"
  ],
  "title": "Mazatlán Ceviche de Sierra (Sinaloan Mackerel Ceviche)",
  "full_text": "Mazatlán Ceviche de Sierra (Sinaloan Mackerel Ceviche)\nClose\nJump to recipe\nPrep\n55 mins\nMarinating Time\n10 mins\nTotal\n65 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nsushi-grade skinless Pacific sierra\nor\nmahi mahi fillets\n(see notes)\n3\nmedium\ncarrots\n(\n12\nounces\n;\n340\ng\n), peeled and finely grated on the small holes of a box grater\n1 1/2\nteaspoons\nplus\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt use half as much by volume, divided\n1\nsmall\nred onion\n(\n6\nounces\n;\n170\ng\n); finely diced (\n3/4\ncup\n)\n2/3\ncup\n(\n158\nml\n)\nfresh lime juice\nfrom about\n6\nwhole\nPersian limes\n(see notes)\nFreshly ground black pepper\n2\nsmall\ngarden cucumbers\n(\n12\nounces\n;\n340\ng\n), peeled, seeded, and cut into 1/4-inch dice\n1/2\ncup\nloosely packed finely chopped fresh cilantro leaves and tender stems\n(\n3/4\nounce\n;\n22\ng\n)\nFor Serving:\nTostadas\nMayonnaise\nSliced avocado\nSalsa negra\nor\nhot sauce\nof your choice (common options include a\nfresh serrano salsa\n,\nValentina\nor\nSalsa Huichol\n)\nDirections\nUsing a very sharp knife, cut the fish into 1/2-inch cubes. Transfer to a large plate or baking sheet in a single layer and freeze until the fish is firm to the touch but not fully frozen, about 30 minutes. Meanwhile, place a food processor bowl and its blade into the freezer to chill while the fish is freezing.\nSerious Eats / Lorena Masso\nToss carrot with 1/4 teaspoon salt and transfer to a fine-mesh strainer set over a bowl. Let drain for 20 minutes, gently pressing on the carrots to remove excess moisture.\nSerious Eats / Lorena Masso\nOnce the fish is firm, transfer to the food processor and pulse until evenly ground, about 10 to 20 pulses (fish should be roughly 1/8 inch in size; be careful not to over-process fish to a smooth paste).\nSerious Eats / Lorena Masso\nTransfer fish to a mixing bowl and toss well with onion, lime juice, remaining 1 1/2 teaspoons salt, and pepper to taste. Let marinate in refrigerator, stirring occasionally, until the fish turns from translucent to opaque white, 5 to 10 minutes.\nSerious Eats / Lorena Masso\nStir in the drained grated carrot and cilantro. Season with salt and pepper to taste. Top with cucumber and serve right away with tostadas, mayonnaise, avocado, and sauces.\nSerious Eats / Lorena Masso\nSpecial Equipment\nFood processor\nNotes\nThis recipe is traditionally made with Pacific sierra, a fish in the mackerel family. If unavailable, mahi mahi may be substituted, as can Spanish mackerel. Mahi mahi is less assertive in flavor and slightly sweeter than Pacific sierra, while Spanish mackerel is an oilier and more flavorful fish. Make sure to buy extremely fresh fish that is suitable for eating raw; flash-frozen fish is even safer, as the deep-freezing process kills some potential parasites.\nThis recipe traditionally uses ground fish. While a food processor does a good job \"grinding\" the fish and is easy to use, you can also finely chop the fish with a very sharp knife to 1/8-inch pieces.\nKey limes are common in Mexico and will also work in this recipe; I recommend using good quality key limes if you can find them. They should be plump, green, and heavy, and about 1 1/2 inches in diameter; you will need more key limes than Persian limes, if you use them.\nMake-Ahead and Storage\nThis recipe is best prepared fresh right before serving. Ceviche should otherwise be kept refrigerated and eaten the same day it is prepared.\nSeafood Mains\nThe Latest\nMexican\nNo-Cook Seafood\nFish"
}