{
  "url": "https://www.seriouseats.com/singapore-curry-noodles-stir-fry-recipe",
  "image_url": null,
  "tags": [
    "Rice Noodles",
    "Chinese",
    "Stir-Fry Noodles",
    "Shrimp",
    "Noodle Mains"
  ],
  "title": "Singapore Rice Noodles",
  "full_text": "Singapore Rice Noodles\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n60 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\npound\nshrimp\n, shelled, deveined, and rinsed under cold water\n4\ntablespoons\nplus\n2\nteaspoons\ncanola or\nvegetable oil\n, divided\n2 1/2\nteaspoons\nAsian fish sauce\n, divided\n1\nbundle\n(about\n5 1/2\nounces\n)\ndried rice stick noodles\n(see notes)\n2\nmedium cloves\ngarlic\n, minced\n1\ntablespoon\ncurry powder\n, divided (see notes)\n1\nteaspoon\nsoy sauce\n1\nteaspoon\nShaoxing wine\n1/4\nteaspoon\nground white pepper\n1/4\nteaspoon\nsugar\n2\neggs\n, beaten with two pinches kosher salt\n1/4\npound\nChinese roast pork (\nchar siu\n) or ham, cut into thin strips\n1/4\nmedium\nonion\n, very thinly sliced\n1/2\nmedium\nred bell pepper\n, stemmed, seeded and julienned\n12\nsnow peas\n, stemmed, tough strings removed, and slice thinly on the bias\n1/2\nmedium\ncarrot\n, julienned\nKosher salt\n2\nscallions\n, sliced very thinly on the bias\n2\nteaspoons\ntoasted sesame oil\nDirections\nPat shrimp dry with paper towels and place in a small bowl. Add 1 teaspoon canola oil and 1/2 teaspoon fish sauce. Mix well and set aside in refrigerator.\nPlace rice noodles in a large bowl and cover with boiling water. Let stand until pliable, about 5 minutes. Drain noodles in a colander, then transfer to a rimmed baking sheet with a wire rack set in it. Spread noodles in an even layer, then, using scissors, cut noodles in half.\nSerious Eats / Shao Z.\nPlace garlic in a small bowl and add 2 teaspoons curry powder along with soy sauce, Shaoxing wine, white pepper, sugar, remaining 2 teaspoons fish sauce. Mix well, thinning with 2 teaspoons water, then set sauce aside.\nHeat 1 teaspoon canola oil in a wok or nonstick skillet over high heat, tilting to swirl oil, until smoking. Add eggs and let cook undisturbed for about 10 second, then gently move the eggs back and forth with a spatula until they start to firm up. Break eggs into small pieces, then set aside in a large bowl.\nSerious Eats / Shao Z.\nWipe wok clean. Return wok to high heat, add 2 tablespoons oil and heat until smoking. Add shrimp and stir-fry for 30 seconds. Add roast pork and onion and continue to stir-fry for another 30 seconds. Add red bell pepper and snow peas and stir for another 30 seconds, then add carrots. Add remaining 1 teaspoon curry powder, season with salt, and cook, tossing, until curry is evenly distributed. Scrape wok contents into bowl with eggs.\nSerious Eats / Shao Z.\nWipe wok clean again. Heat remaining 2 tablespoons canola oil over high heat until smoking. Add rice noodles and stir-fry for 30 seconds. Stir in sauce until curry powder is evenly distributed, adding water 1 or 2 teaspoons at a time as needed to help distribute sauce. Return egg, shrimp, roast pork, and vegetables to wok and stir-fry until everything is evenly combined, about 30 seconds. Season with salt and remove from heat. Add scallions, drizzle with sesame oil, mix well, and transfer to a large serving bowl. Enjoy immediately.\nSerious Eats / Shao Z.\nSpecial Equipment\nWok\nor\nlarge nonstick skillet\n,\nlarge spatula\nNotes\nLook for rice noodles with the words \"kong moon\" on the label (Kong Moon, also romanized as jiangmen, is a city in the Guangdong region of China). There are a few brands that make kong moon-style rice noodles. The Double Swallow brand is my personal favorite, but others will work as long as they have that \"kong moon\" label.\nI often use Madras curry powder from a brand called Trong Food, which can be found at some Chinese or Vietnamese supermarkets. You don't have to use this brand, though, as a more generic curry powder from your local supermarket will do equally well.\nRead More\nMie Goreng (Indonesian Fried Noodles)\nStir-Fried Rice Noodles With Eggs and Greens\nTaiwanese Pan-Fried Rice Noodles\nStir-Fried Lo Mein Noodles With Pork and Vegetables\nStir-Fried Chow Mein With Four Vegetables\nRice Noodles\nChinese\nStir-Fry Noodles\nShrimp\nNoodle Mains"
}