{
  "url": "https://www.seriouseats.com/sini-manti-armenian-baked-manti",
  "image_url": "https://www.seriouseats.com/thmb/yGkgNuwRg0-Y5Ut75xsyqa0BZ9o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20121214-Manti-Andrew-Janjigian-45-9b6782b44d7043d692a283ff9a69c2b9.jpg",
  "tags": [
    "Lamb Shank",
    "Christmas",
    "Savory",
    "Pressure Cooker",
    "Easter"
  ],
  "title": "Sini Manti (Armenian Baked Lamb Manti) Recipe",
  "full_text": "Sini Manti (Armenian Baked Lamb Manti) Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs\nActive\n3 hrs 30 mins\nResting Time\n60 mins\nTotal\n3 hrs 30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n1\npound\n(\n450\ng\n)\nlamb shanks\nor\nlamb neck\nslices\n1 1/2\nteaspoons\n(\n4\ng\n) Diamond Crystal\nkosher salt\n, divided; if using table salt, use half as much by volume or the same weight\n1\nquart\n(\n960\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n5\nmedium\ngarlic cloves\n, lightly crushed\n1/4\ncup\n(\n60\ng\n)\ntomato paste\nFor the Dough:\n280\ng\n(about\n10\nounces\n;\n2\ncups\n)\nall-purpose flour\n1/2\nteaspoon\nkosher salt\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\n1/2\ncup\nplus\n1\ntablespoon\n(\n135\nml\n)\nwater\n(add extra\n1\nteaspoon\n(\n5\nml\n) if rolling dough by hand)\n1\nlarge\negg yolk\n(\n15\ng\n)\nFor the Manti Filling:\n1\nsmall\nonion\n(about\n6\nounces\n;\n170\ng\n), peeled and quartered\n3\nmedium\ngarlic cloves\n1\ntablespoon\n(\n6\ng\n)\nfresh parsley\nleaves and tender stems\n1\nteaspoon\npaprika\n1/2\nteaspoon\nground allspice\n1/2\nteaspoon\nAleppo pepper\n(or an additional\n1\nteaspoon\npaprika\n; see notes)\n1/2\nteaspoon\nkosher salt\n1/4\nteaspoon\nfreshly\nground black pepper\n6\nounces\n(\n170\ng\n)\nground lamb\nor 85% lean ground beef\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nFor the Yogurt-Garlic Sauce:\n2\nmedium\ngarlic cloves\n, minced\n1/2\nteaspoon\nkosher salt\n2\ncups\n(\n450\ng\n)\nGreek yogurt\nFor Serving:\n2\nteaspoons\nAleppo pepper\n(or paprika or gochugaru; see notes)\n2\nteaspoons\nground sumac\nDirections\nFor the Broth:\nSprinkle lamb evenly on all sides with 1 teaspoon salt and place on wire rack set in rimmed baking sheet. Let stand at room temperature for at least 30 minutes and up to 2 hours.\nCombine lamb, chicken stock, garlic, tomato paste, and remaining 1/2 teaspoon salt in a pressure cooker, and stir to combine. Seal pressure cooker, and bring to high pressure over medium-high heat, if using a stovetop model, or by setting to pressure-cooker mode on an electric multi-cooker. Cook at high pressure for 40 minutes, adjusting heat as needed to maintain high pressure (if using a stovetop pressure cooker; electric ones will automatically regulate the heat and pressure level).\nDepressurize cooker using the quick-release method, then carefully remove lid, allowing steam to escape away from you. Strain broth through fine-mesh strainer into clean heatproof container, pressing on solids to extract as much liquid as possible; add water as needed to yield a total 3 cups (700ml) broth. Season with additional salt to taste. Transfer lamb to cutting board and set broth aside to cool to room temperature. When broth has cooled, cover and refrigerate until ready to use. When lamb is cool enough to handle, separate meat from bones in large pieces; set meat aside and discard bones.\nFor the Dough:\nPlace flour and salt in food processor bowl and pulse twice to combine. Add butter and process until fully incorporated, 10 to 20 seconds. Add water (adding extra 1 teaspoon (5ml) water if rolling dough by hand) and egg yolk and process until dough ball starts to form and mixture looks pebbly, about 30 seconds. Transfer dough to lightly floured counter; return food processor bowl to base, but don't clean it. Knead dough until uniform in texture (dough will remain slightly rough in texture), 15 to 30 seconds. Form dough into a 4-inch disk, wrap tightly in plastic, and set aside to rest on countertop for at least 30 minutes and up to 2 hours (or transfer to refrigerator for up to 24 hours).\nFor the Manti Filling:\nMeanwhile, in now-empty food processor, place onion, garlic, parsley, paprika, allspice, Aleppo pepper, salt, and pepper and process until smooth, scraping down sides of bowl as needed, about 15 seconds. Break up ground lamb into small pieces, add to food processor, and pulse to combine, 8 to 10 one-second pulses (do not over-process, as this will make the filling chewy and bouncy rather than tender). Transfer filling to an airtight container and refrigerate until needed (mixture may be made up to 24 hours in advance).\nTo Roll the Dough and Bake Manti:\nSet oven rack to middle position and preheat oven to 350°F (177°C). Using a pastry brush, coat 2 rimmed baking sheets with 1 tablespoon (15ml) olive oil each and set aside.\nDust countertop lightly with flour. Unwrap rested dough and cut into quarters. Set one quarter on work surface and re-wrap remaining dough. Using rolling pin and fingers, flatten and stretch dough to 5- by 4-inch oval that is 1/4 inch thick. If using pasta roller, proceed to step 8. If rolling dough by hand, roll dough into 12- x 8 1/16-inch rectangle using a rolling pin. Cut dough in half lengthwise to yield two 12- x 4-inch sheets. Cut each strip into seven 1 3/4-inch-wide strips. Divide each strip in half crosswise into two 1 1/4-inch squares; each sheet of dough should yield at least 28 squares. Proceed to step 13.\nSet pasta roller to widest setting and pass dough 3 times through the machine lengthwise at this setting.\nPlace dough on lightly floured work surface. Fold both ends in so that they meet at the center of the dough, and then fold the dough in half where the end points meet, trying not to incorporate too much air into the folds. Using rolling pin and fingers, flatten and stretch dough to 6- by 3-inch rectangle that is 1/4 inch thick. Pass through the rollers lengthwise 3 additional times.\nNarrow the setting by 1 notch and pass dough 3 times through the machine at this setting.\nNarrow the setting by 1 notch and pass dough twice through the machine at this setting. Continue passing the dough through the rollers, reducing the thickness by 1 setting each time until it measures about 24 x 3 x 1/16 inches (setting 5 on a Marcato Atlas pasta roller). It should now be very delicate and elastic to the touch, and slightly translucent.\nTransfer rolled dough to lightly floured work surface, and lightly coat both sides of dough with flour to prevent sticking. Using pastry wheel, pizza cutter, or sharp knife, cut sheet crosswise into fourteen 1 3/4-inch-wide strips. Divide each strip in half crosswise into two 1 1/2- by 1 3/4-inch strips; each sheet of dough should yield at least 28 strips.\nUsing 1/8 teaspoon measuring spoon, place scant 1/4 teaspoon ball of meat filling in center of each strip of dough.\nWorking one at a time, using lightly floured hands and fingertips, lift strip of dough in hands and fold in half loosely over filling lengthwise. Pinch sides of dough together, working your way toward filling to enclose it (do not seal dough across top and do not push ball of filling up and out of dumpling). Place manti on lightly floured counter and then gently pinch ends between fingers to form flat-bottomed, stable canoe shape. Transfer to prepared baking sheet and repeat with remaining strips of dough. Using fingertips, gently press meat filling into manti to make them flush with top of dough.\nRepeat steps 7 through 14 with another quarter of dough (if rolling by hand, repeat steps 7, 13, and 14).\nPlace baking sheet of manti in oven and bake until lightly and evenly golden brown, 25 to 30 minutes. Transfer baking sheet to wire rack and allow to cool to room temperature.\nWhile first tray of manti bakes, repeat steps 7 through 14 with remaining 2 quarters of dough, followed by step 16 to bake and cool remaining manti (cooled manti can be transferred to zipper lock freezer bags and frozen for up to 3 weeks). Once all manti are baked, adjust oven racks so that one is in upper-middle position, the other is in lower-middle position, and lower oven temperature to 325°F (165°C).\nFor the Yogurt-Garlic Sauce:\nUsing a fork, mash garlic and salt to a rough paste on cutting board. Combine yogurt and garlic mixture in small bowl and whisk until evenly combined. Cover and refrigerate until needed.\nTo Finish and Serve Manti:\nIn large saucepan, bring broth to boil over high heat. Add reserved lamb pieces, reduce heat to medium-low, and cover.\nReturn both baking sheets of manti to oven and bake until manti are golden brown and heated through, 15 to 20 minutes (20 to 25 if starting with frozen manti).\nAdd about 1/2 cup (120ml) hot broth to individual serving bowls. Place 15 to 20 manti in broth and top with 3 to 4 tablespoons yogurt-garlic sauce. Sprinkle with 1/4 teaspoon of Aleppo pepper and sumac each. Serve immediately. (Lamb pieces reheated in the broth are meant to be served as a treat with any remaining manti.)\nSpecial Equipment\nElectric or stovetop pressure cooker\n,\nfine-mesh strainer\n,\npasta roller\n,\nrimmed baking sheets\nNotes\nAleppo chile peppers, which have been cultivated in Syria for centuries, are quite mild in terms of heat, with a hint of raisin-y, sun-dried tomato sweetness. Due to the ongoing civil war, true Aleppo pepper from Syria is no longer available for import, but chiles grown in neighboring Turkey are. You can find Aleppo pepper at Middle Eastern markets or online. Korean gochugaru or paprika can be substituted for Aleppo pepper in this recipe.\nGround sumac can also be found at Middle Eastern markets or online. It adds a bright, tart finish to this dish.\nMake-Ahead and Storage\nManti can be par-baked through Step 17, cooled, transferred to zipper-lock freezer bags, and frozen for up to 3 weeks; to finish, bake from frozen following recipe instructions, for 20 to 25 minutes. Broth can be made in advance and refrigerated in an airtight container for up to 5 days, or frozen for up to 3 weeks (the picked meat from the lamb shank or neck can be added to the broth or stored in a separate zipper-lock bag); reheat gently in a large saucepan over medium-low heat. Manti filling can be made in advance and refrigerated in an airtight container for up to 24 hours. Manti dough can be made in advance and refrigerated, wrapped tightly in plastic, for up to 24 hours; bring to room temperature before rolling. Yogurt-garlic sauce can be made in advance and stored in an airtight container for up to 3 days.\nLamb Shank\nChristmas\nSavory\nPressure Cooker\nEaster",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sini-manti-armenian-baked-lamb-manti-recipe.webp?"
}