{
  "url": "https://www.seriouseats.com/sinigang-na-baboy-filipino-pork-in-sour-tamarind-soup",
  "image_url": "https://www.seriouseats.com/thmb/zUjRUNFMhpFzTnWvrLYrxnb4ke0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__11__20191030-filipino-Sinigang-na-Baboy-pork-vicky-wasik-14-0c4f581b8fd54f4c84385eaf31633297.jpg",
  "tags": [
    "Soups",
    "Filipino",
    "Stovetop Pork",
    "Pork Shoulder",
    "Pork Mains"
  ],
  "title": "Sinigang na Baboy (Filipino Pork in Sour Tamarind Soup) Recipe",
  "full_text": "Sinigang na Baboy (Filipino Pork in Sour Tamarind Soup) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n85 mins\nActive\n90 mins\nCooling Time\n10 mins\nTotal\n100 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n; about\n3\n)\nplum\ntomatoes\n2\nwhole\n, fresh\nlong green peppers\n(\n4\nounces\n;\n115\ng\ntotal)\n1\ntablespoon\n(\n15\nml\n) canola or other neutral\noil\n1\nhead\nof\ngarlic\n(about\n12\nmedium\ncloves\n), peeled and minced\n1\nsmall\n(\n6-ounce\n;\n170 g\n)\nred onion\n, finely diced\n1\nscallion\n, white part finely chopped, green part sliced thinly on a bias, divided\n1 1/2\npounds\n(\n680\ng\n)\nboneless, skinless pork shoulder\n, cut into 1-inch pieces\n32\nounces\n(\n945\nml\n)\ntamarind concentrate\n(see note)\n1\n(\n1.41-ounce) pack\nKnorr sinigang tamarind soup mix\n1\nsmall\ndaikon radish\n(about\n1\npound\n), peeled and cut crosswise into 1/2 inch thick rounds\n1\nsmall\ntaro root\n(about\n6\nounces\n), peeled and cut crosswise into 1/4 inch thick rounds (see note)\n1/2\npound\n(\n225\ng\n)\nfresh okra\n(optional), caps trimmed, pods cut in half on a bias\n6\nounces\n(\n170\ng\n) long green beans or\nstring beans\n, stem ends trimmed and beans cut into 2-inch lengths\n3\ntablespoons\n(\n45\nml\n)\ncoconut oil\n2\ntablespoons\ngarlic powder\nKosher salt\n1/4\ncup\n(\n60\nml\n)\ncalamansi juice\n, or as much as desired (see note)\n1/4\ncup\n(\n60\nml\n)\nfish sauce\n, or as much as desired\nFried garlic\n, for garnish\nDirections\nPreheat oven to 375°F (190°C). Set whole tomatoes on a foil-lined rimmed baking sheet. Roast until skins split and are browned in spots, about 25 minutes. When cool enough to handle, core and quarter tomatoes. Set aside.\nWorking directly over the flame of a gas burner, or on a rimmed baking sheet under the broiler (as close to the broiler element as possible), roast green peppers, turning often, until the skin of each is blistered and charred over about half its area. Transfer to a work surface, remove and discard stems, then chop flesh, skin, and seeds.\nIn a large 7-quart Dutch oven or pot, heat canola oil over medium-high heat until shimmering. Add minced fresh garlic, red onion, chopped scallion whites, chopped peppers, and pork and cook, stirring, until beginning to brown on the bottom, about 10 minutes.\nAdd 4 quarts (4 liters) water, scraping up browned bits from bottom of pot. Stir in tamarind concentrate and tamarind soup mix. Bring to a boil, then reduce heat and let simmer for 15 minutes.\nAdd tomatoes, daikon, and taro root, then continue to simmer for 30 minutes.\nMeanwhile, in a medium bowl, toss okra, if using, and green beans in coconut oil and garlic powder; season with salt. Spread okra and green beans on a rimmed baking sheet and roast until lightly browned, about 20 minutes. Set aside.\nWorking in small additions, add fish sauce and calamansi juice to soup until desired flavor is reached; you want it mouth-puckeringly sour but balanced with a clear (but not unpleasant) saltiness.\nServe soup, dividing ingredients among bowls and topping with the roasted green beans (and okra, if using), thinly sliced scallion greens, and a sprinkling of fried garlic.\nSpecial equipment\nLarge (7-quart) Dutch oven\nNotes\nWear rubber gloves when peeling and cutting taro root, as it can stain hands. If possible, try to buy frozen calamansi juice from a well-stocked Asian or Filipino market; it has better flavor than bottled options. Tamarind concentrate often comes in 16-ounce containers; make sure to use two of that size for a total of 32 ounces.\nMake-Ahead and Storage\nThe stew and roasted vegetable garnishes can be refrigerated separately for up to 5 days. Reheat the stew on the stovetop and the vegetable garnish in the oven (or even a toaster oven) before serving.\nThis Recipe Appears In\nAuthenticity? These Filipino Chefs Aren’t Concerned\nSoups\nFilipino\nStovetop Pork\nPork Shoulder\nPork Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sinigang-na-baboy-filipino-pork-in-sour-tamarind-soup-recipe.webp?"
}