{
  "url": "https://www.seriouseats.com/sizzling-sisig-5196333",
  "image_url": "https://www.seriouseats.com/thmb/0eE-pJpLG_jD5QhutrCN0gZyDfM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210805-Sisig-Rezel-15-13d8cf604ed942a3af6892b4c2d4538e.jpg",
  "tags": [
    "Filipino",
    "Pork",
    "Eggs",
    "Pork Shoulder",
    "Snacks & Appetizers"
  ],
  "title": "Sizzling Sisig (Filipino Crispy Pork with Eggs)",
  "full_text": "Sizzling Sisig (Filipino Crispy Pork with Eggs)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/4\npound\n(\n115\ng\n)\nchicken livers\n(optional)\n2\npounds\n(\n905\ng\n) skinless, boneless\npork shoulder\n, or pig ears, snout and/or jowl (see notes)\n2\ncups\n(\n475\nml\n) plus\n1\ntablespoon\n(\n15\nml\n) neutral\noil\n, such as canola or vegetable oil, divided\n10\nmedium\ngarlic cloves\n, minced\n1/2\nmedium\nred onion\n(about\n4\nounces\n;\n115\ng\n), finely diced\n1/4\ncup\n(\n60\nml\n)\nsoy sauce\n, preferably Filipino brands such as Silver Swan or Datu Puti\n3\ntablespoons\n(\n45\nml\n)\ncalamansi juice\n(see notes)\n2\nbird’s eye chiles\n, stemmed, seeded, and minced\n4\nlarge\neggs\n(\n7\nounces\n;\n200\ng\n)\n2\ntablespoons\n(\n1\nounce\n;\n30\ng\n)\nmayonnaise\n1\nscallion\n, ends trimmed and sliced thinly on a bias, for garnish\nCooked white rice\n, for serving\nCalamansi\nhalves, for serving (see notes)\nDirections\nIf using chicken livers, place in a countertop blender and process until smooth. Transfer puréed livers to a small bowl, cover, and refrigerate.\nSerious Eats / Rezel Kealoha\nIf using pork shoulder, blot dry with paper towels, cut into 1/2-inch pieces, then proceed to Step 3. If using pig ears, snout, and/or jowl, place pork in stockpot or Dutch oven, cover with water and boil until tender, between 60 to 90 minutes. Using tongs, transfer pig ears, snout, and/or jowl to a rimmed baking sheet and set aside until cool enough to handle. Blot dry with paper towels and cut into 1/2-inch pieces, then proceed to Step 3.\nSerious Eats / Rezel Kealoha\nSet a wire rack in a rimmed baking sheet lined with a double layer of paper towels. In a wok, heat 2 cups (475ml) oil over medium-high heat until it registers 375°F (190°C) on an instant-read thermometer. Working in 3 batches, carefully lower a third of the pork shoulder, pig ears, snout, and/or jowl into the oil and fry until lightly browned all over, about 1 minute. Using a slotted spoon or spider, transfer pork to prepared rack. Return oil to 375°F (190°C) and repeat with remaining pork. Set aside.\nSerious Eats / Rezel Kealoha\nIn a 12-inch cast iron skillet, heat remaining 1 tablespoon (15ml) oil over medium-high heat until shimmering. Add garlic and onion and cook, stirring frequently, until softened and golden brown in color, about 3 minutes.\nSerious Eats / Rezel Kealoha\nAdd reserved fried pork, puréed chicken livers (if using), soy sauce, calamansi juice, and chiles, and mix until well combined.\nSerious Eats / Rezel Kealoha\nIncrease heat to high and bring to a boil. Break eggs directly into pan, spacing them evenly around perimeter. Lower heat to maintain a simmer, cover, and cook, without stirring, until egg whites are opaque and yolks are runny but turning yellow on the edges, about 3 minutes.\nSerious Eats / Rezel Kealoha\nAdd mayonnaise and scallion and mix with pork and eggs until fully combined. Serve immediately with cooked white rice and calamansi halves.\nSerious Eats / Rezel Kealoha\nSpecial Equipment\n12-inch cast iron skillet with lid\n,\nblender\n,\nwok\n,\nDutch oven\nor stockpot, rimmed baking sheet, wire rack\nNotes\nFeel free to use any one of these cuts of pork alone or in a combination.\nCalamansi is difficult to source fresh in the US, but occasionally Filipino groceries located in California or Florida will have them. You can also buy frozen calamansi juice from a well-stocked Asian or Filipino market; it has a better flavor than bottled options. If you're not able to find calamansi, substitute by following a formula of one part freshly squeezed lemon juice to one-half part freshly squeezed lime juice to one-quarter part granulated sugar (by volume).\nMake-Ahead and Storage\nSisig can be refrigerated in an airtight container for up to 5 days. Leftovers make a great addition to\nfried rice\n.\nFilipino\nPork\nEggs\nPork Shoulder\nSnacks & Appetizers"
}