{
  "url": "https://www.seriouseats.com/skillet-fried-mac-and-cheese-from-zingermans",
  "image_url": "https://www.seriouseats.com/thmb/UGVWDR2o7iNfC2kj-W69x3iujQs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__10__20121010-225210-cook-the-book-skillet-fried-mac-and-cheese-88a576c013c142d7b6e4fb95dded732f.jpg",
  "tags": [
    "Pasta Mains",
    "Vegetarian Mains",
    "Stovetop Pasta",
    "Mac & Cheese"
  ],
  "title": "Skillet Fried Mac and Cheese from Zingerman's Roadhouse",
  "full_text": "Skillet Fried Mac and Cheese from Zingerman's Roadhouse\nClose\nJump to recipe\nCook\n30 mins\nActive\n30 mins\nTotal\n30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\npound\nmacaroni\n2\ntablespoons\nunsalted butter\n3\ntablespoons chopped\nonion\n1\nbay leaf\n1\ntablespoon\nall-purpose flour\n3/4\ncup\nwhole milk\n, warmed\n2\ntablespoons\nheavy cream\n, warmed\n1/2\nteaspoon\nDijon mustard\n8\nounces\nraw milk cheddar\n, grated\nSalt\nand freshly ground black pepper\n1\ntablespoon\nolive oil\nDirections\nBring a pot of salted water to a boil over high heat. Cook the pasta until it is al dente. Drain the pasta, run it under cold water, and return it to the pot.\nHeat the butter in a saucepan over medium-low heat. Add the onion and bay leaf, and cook, stirring frequently, for 3 to 5 minutes, or until the onion softens. Stir in the flour and cook, stirring constantly, for 1 minute, or until the mixture turns slightly beige, is bubbly, and appears to have grown in volume. Increase the heat to medium, and slowly whisk in the warm milk and cream. Bring to a boil, whisking frequently. Reduce the heat to low, stir in the mustard, and simmer the sauce for 2 minutes.\nAdd the cheese to the sauce by 1/2-cup measure, stirring until the cheese melts before making another addition. Remove and discard the bay leaf. Pour the sauce over the pasta, and stir well. Season to taste with salt and pepper.\nHeat a skillet over medium-high heat until it is very hot. Add the olive oil, swirling to coat. Add the macaroni, and allow it to cook for 3 minutes, or until a crust forms. Scrape the bottom of the crust with a metal spoon, and cook for another 3 minutes. Do not stir often. Cook until about 15 to 20 percent of the mixture is golden brown. Serve hot.\nPasta Mains\nVegetarian Mains\nStovetop Pasta\nMac & Cheese"
}