{
  "url": "https://www.seriouseats.com/skordalia-greek-garlic-potato-spread-dip-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ESVX1eBeW0QL5VryAnP-erVYhMg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160802-scordalia-greek-potato-dip-vicky-wasik-8-2fe9c8ffa0b14e4a83e4381aa58924d1.jpg",
  "tags": [
    "Dips",
    "Greek",
    "Garlic",
    "Russet Potatoes",
    "Mediterranean"
  ],
  "title": "Skordalia (Greek Garlic and Potato Spread)",
  "full_text": "Skordalia (Greek Garlic and Potato Spread)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n35 mins\nTotal\n35 mins\nServes\n10\nto 12 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n2\nmedium\nrusset potatoes\n(about\n1\npound\n;\n453\ng\n), peeled and cut into 3/4-inch cubes\nKosher salt\n3\nounces\nwhole blanched\nalmonds\n(\n1/2\ncup\n;\n85\ng\n)\n4 to 6\nmedium\ncloves\ngarlic\n(see notes)\n1/4\ncup\nplus\n2\ntablespoons\n(\n90\nml\n) white wine vinegar and/or\nfresh lemon juice\n(from about\n2\nlemons\n; see notes)\n3/4\ncup\n(\n180\nml\n) extra-virgin\nolive oil\nMinced flat-leaf parsley\n, for garnish\nWarmed pita\nand/or bread, for serving\nDirections\nPreheat oven to 350°F (180°C). Set cubed potatoes in a colander and rinse under cold water until water runs clear. Transfer to a large saucepan and cover with cold water by at least 2 inches. Season water with salt until it is\nsalty like tears\n. Bring water to a boil over high heat, then reduce heat to medium-low and simmer until a knife easily pierces potatoes with no resistance, 10 to 15 minutes. Drain potatoes in colander, then rinse with hot running water for 30 seconds.\nMeanwhile, in a food processor, combine almonds, garlic, 2 tablespoons (30ml) cold water, and wine vinegar and/or lemon juice. Process until garlic and almonds are reduced to a paste. Season with salt.\nSpread potatoes in an even layer on a rimmed baking sheet and transfer to oven until excess moisture has evaporated and surface of potatoes is dry and looks chalky, about 6 minutes.\nUsing a potato ricer or a food mill with the finest disk, mash potatoes into a large mixing bowl. Alternatively, thoroughly mash potatoes with a potato masher in a large mixing bowl.\nStir in olive oil and almond-garlic mixture until thoroughly incorporated. If skordalia looks like it's breaking slightly (i.e., if the oil does not fully incorporate to form a homogeneous mixture), stir in more cold water, 1 tablespoon at a time, beating well, until mixture is emulsified. Season with salt, then garnish with parsley and serve immediately with warm pita or bread, or chill until ready to serve.\nSpecial Equipment\nRimmed baking sheet\n;\nfood processor\n;\npotato ricer\n,\nfood mill\n, or potato masher\nNotes\nSkordalia is meant to be strongly garlicky, which is what about 6 cloves will give you, but if you want it a little less intense, you can choose to use 5 or 4 cloves instead. I like the combination of fresh lemon juice with white wine vinegar, but if you have to choose only one, I'd recommend the sharper acidic flavor of the wine vinegar in this dish.\nDips\nGreek\nGarlic\nRusset Potatoes\nMediterranean",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/skordalia-greek-garlic-and-potato-spread.webp?"
}