{
  "url": "https://www.seriouseats.com/slab-apple-pie-recipe-8747416",
  "image_url": "https://www.seriouseats.com/thmb/dvioLhaiTw8l_PClrAqXGZQKxZc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241002-SEA-AppleSlabPie-Fred-Hardy-Hero-57-59f90fc14fd6402a80a455c9852c79a6.jpg",
  "tags": [
    "The Latest",
    "Fruit",
    "Desserts",
    "Thanksgiving Desserts",
    "Fall Desserts"
  ],
  "title": "Apple Slab Pie",
  "full_text": "Apple Slab Pie\nClose\nJump to recipe\nPrep\n60 mins\nCook\n60 mins\nMacerating, Chilling, Cooling Time\n4 hrs\nTotal\n6 hrs\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough:\n957\ng\nall-purpose flour\n(33 3/4 ounces; 7 1/2 cups), plus more for dusting\n680\ng\ncold\nunsalted butter\n(24 ounces; 6 sticks), cubed\n50g\ngranulated sugar\n(\n1 3/4\nounces\n; 1/4 cup)\n9\ng\n(1 tablespoon) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or same weight\n1 1/2\ncups\n(355ml)\nice water\n, plus more as needed\nFor the Filling:\n12\nlarge\ntart baking\napples\n(6 pounds; 2.7kg), such as Granny Smith, peeled, cored, and chopped into 1/2-inch pieces (about 14 cups chopped), see notes\n160g\nlight brown sugar\n(about\n5 3/4\nounces\n; 3/4 cup)\n1 1/2\nteaspoons\nground cinnamon\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\ncardamom\n1/2\nteaspoon\nground ginger\n1/4\nteaspoon\nground nutmeg\n32g\ncornstarch\n(about\n1\nounce\n; 4 tablespoons)\nTo Finish\n1\nlarge\negg\n1\nteaspoon\nwater\n34g\nturbinado sugar\n(about\n1 1/4\nounces\n; 3 tablespoons)\nDirections\nFor the Dough:\nIn the bowl of a food processor, combine about half of the flour and half of the butter. Pulse until butter pieces are slightly larger than pea-sized, about 8 pulses. Transfer mixture to a large bowl. Repeat with remaining flour and butter, then add to bowl. Sprinkle sugar and salt over top and, using your hands, toss mixture, pinching and flattening any larger pieces of butter you encounter. Add ice water and, using your hands or a flexible spatula, stir to form a shaggy dough. (The dough should still look a little dry and crumbly, but hold together when squeezed. If necessary, add up to 1/4 cup additional water, 1 tablespoon at a time, until dough comes together.) Divide mixture in half (about 36 ounces or 1020g each). Portion each half of dough into a 1-inch thick rectangle and wrap tightly with plastic wrap. Using a rolling pin, press and roll to press dough into all corners of the plastic wrap. Chill until firm, at least 2 hours or up to 2 days. (Note: If you don’t have a food processor, you can make the crust by hand by cutting the butter into flour.)\nSerious Eats / Fred Hardy\nFor the Filling:\nIn a large bowl, toss chopped apples with sugar, cinnamon, salt, cardamom, ginger, and nutmeg, tossing with hands to evenly coat. Macerate at room temperature until apples have slightly softened, about 2 hours, stirring occasionally.  Sprinkle cornstarch on macerated apple mixture, and toss to combine. Adjust oven rack to middle position; set a baking stone on rack. Preheat oven to 375°F (190ºC) for at least 30 minutes.\nSerious Eats / Fred Hardy\nOn a lightly floured work surface, roll one half of dough into a 18- by 23-inch rectangle, about 1/8-inch thick. Pick up dough by carefully and loosely rolling dough around rolling pin and transfer to a 13- by 18-inch rimmed baking sheet. Unroll dough evenly over pan. Gently lift and press dough into corners. Using scissors or kitchen shears, trim edge so that it overhangs by 1-inch. Refrigerate, uncovered, until ready to use.\nSerious Eats / Fred Hardy\nLightly flour work surface and roll second half of dough out into a 18- by 23-inch rectangle, about 1/8-inch thick. Using a sharp knife or pastry wheel, cut dough into 10 strips, each about 1 1/2 inches wide.\nSerious Eats / Fred Hardy\nRemove prepared pie shell from fridge and pour filling over chilled dough. Arrange into an even layer, drizzling any remaining juices over top. Top filling with prepared dough strips and arrange strips in a diagonal lattice pattern, trimming and discarding any excess. Fold overhang inwards over itself, and crimp edges decoratively, as desired. If dough feels warmed and is no longer firm, transfer pie to refrigerator or freezer; chill until firm, about 15 minutes.\nSerious Eats / Fred Hardy\nTo Finish\n: In a small bowl, beat egg and water to combine. Using a pastry brush, brush egg wash evenly over lattice and crimped edges. Sprinkle turbinado sugar over lattice.\nSerious Eats / Fred Hardy\nPlace baking sheet directly on preheated baking stone in preheated oven. Bake until filling is bubbling and dough is deep golden brown, 50 to 60 minutes. Transfer to a wire rack to cool, about 2 hours. Serve warm or at room temperature.\nSerious Eats / Fred Hardy\nSpecial Equipment\nFood processor, two large bowl, baking stone, rolling pin, 13- by 18-inch rimmed baking sheet, scissors or kitchen shears, sharp knife or pastry wheel, pastry brush\nNotes\nIf using an apple variety on the sweeter side, such as Red Delicious, you may want to reduce sugar to 1/2 cup (3 1/2 ounces; 100g).\nBaking stones can be purchased online and at cookware stores. If you don’t own a baking stone, bake pie on the lowest rack in your oven instead: Adjust oven rack to lowest position before preheating oven.\nMake-Ahead and Storage\nDough can be made and refrigerated, wrapped tightly in plastic, up to 2 days in advance.\nDough can be tightly wrapped in plastic and frozen up to 3 months in advance. Thaw overnight in fridge before using.\nThe finished pie can be stored, loosely covered with plastic wrap, at room temperature for up to 2 days or refrigerated in an airtight container for up to 4 days. Sliced pie can be wrapped tightly in plastic and frozen for up to 3 months. Thaw overnight in fridge and reheat as needed.\nThe Latest\nFruit\nDesserts\nThanksgiving Desserts\nFall Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/apple-slab-pie.webp?"
}