{
  "url": "https://www.seriouseats.com/slow-cooker-meatballs-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rsCABETC4v-UnlpymzMQf9T9jUE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__01__20150112-slow-cooker-meatball-recipe-1-0c526a9721e5440dac8b2c32d55e523b.jpg",
  "tags": [
    "Meatballs",
    "Slow Cooker",
    "Ground Beef",
    "Pork",
    "Tomato"
  ],
  "title": "Tender and Juicy Slow-Cooker Meatballs Recipe",
  "full_text": "Tender and Juicy Slow-Cooker Meatballs Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n6 hrs 20 mins\nActive\n60 mins\nTotal\n6 hrs 50 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nslices\nwhite bread\n, crusts removed, roughly torn\n1/3\ncup\nbuttermilk\n, plus more as needed\n1\nlarge\nonion\n, minced (about\n1 1/2\ncups\n), divided\n12\ncloves\ngarlic\n,\nfinely minced\n, divided\n2\nounces\nParmigiano-Reggiano\n, grated, plus more for serving\n1/2\ncup\nloosely packed\nfresh parsley leaves\n, minced\n4\nteaspoons\n(\n18\ng\n)\nkosher salt\nFreshly\nground black pepper\n2\nlarge\neggs\n2\nteaspoons\ndried oregano\n, divided\n1\npound\nground beef\n(at least 25% fat)\n1 1/4\npounds\nground pork\n(at least 25% fat)\n1/4\ncup\nextra-virgin olive oil\n3\n(\n28-ounce) cans\nwhole peeled tomatoes\n, crushed by hand\n1/2\nteaspoon\nred pepper flakes\n1\nsprig\nfresh basil\nCooked pasta\n, for serving\nDirections\nIn the bowl of a stand mixer, combine bread with buttermilk, tossing to coat. Let stand, tossing occasionally, until bread is completely moist, about 10 minutes. Squeeze bread between your fingers or mash with a spoon to make sure there are no dry spots. Add half of onion, 8 cloves of minced garlic, Parmigiano-Reggiano, parsley, salt, pepper, egg, and half of oregano to bread/buttermilk mixture.\nSerious Eats / Vicky Wasik\nSet mixer bowl in stand mixer and attach paddle. Starting at low speed and gradually increasing to medium-high speed, beat bread mixture until thoroughly blended, stopping to scrape down sides as necessary. Add 1/3 each of the beef and pork and beat at medium-high speed until thoroughly blended with bread mixture.\nSerious Eats / Vicky Wasik\nRemove bowl from stand mixer and add remaining beef and pork. Using a clean hand, gently mix meatball mixture, tearing apart ground meat with your fingers, just until ground beef and pork and thoroughly distributed throughout; avoid mixing any more than is necessary for even distribution.\nSerious Eats / Vicky Wasik\nPreheat broiler and set oven rack in upper position. Line a rimmed baking sheet with aluminum foil. Set aside 6 ounces of meatball mixture. Form remaining meatball mixture into golfball-sized balls and arrange on prepared baking sheet; you should be able to make about 16. Broil meatballs until browned on top, about 7 minutes (browning times can vary dramatically, depending on oven broiler strength). Transfer meatballs to a plate, cover with plastic wrap, and refrigerate until ready to use.\nHeat oil in a large Dutch oven over medium-high heat until shimmering. Add remaining meat mixture and cook, stirring, until no longer pink, about 3 minutes. Add remaining onion and garlic and cook, stirring, until softened, about 5 minutes. Add remaining oregano and pepper flakes and cook, stirring, for 30 seconds. Add tomatoes and bring to a simmer. Season with salt.\nSerious Eats / J. Kenji Lopez-Alt\nTransfer tomato sauce and basil sprig to slow cooker. Cook on low heat for 6 to 10 hours. Gently fold meatballs into mixture for last 30 minutes of cooking. Serve with pasta and Parmesan cheese.\nSerious Eats / J. Kenji Lopez-Alt\nNotes\nFor an even more streamlined version, do not broil the meatballs: drop them into the sauce raw directly from the refrigerator and cook without stirring for the first 15 minutes. Fold gently to redistribute, then continue cooking for the remaining 15 minutes.\nSpecial Equipment\nStand mixer\n, slow cooker\nMeatballs\nSlow Cooker\nGround Beef\nPork\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tender-and-juicy-slow-cooker-meatballs-recipe.webp?"
}