{
  "url": "https://www.seriouseats.com/slow-roasted-beef-tenderloin-recipe",
  "image_url": null,
  "tags": [
    "Roasted Beef",
    "Tenderloin Steak",
    "Beef Mains",
    "Christmas Dinners",
    "Christmas"
  ],
  "title": "Slow-Roasted Beef Tenderloin",
  "full_text": "Slow-Roasted Beef Tenderloin\nJump to recipe\nPrep\n25 mins\nCook\n2 hrs 10 mins\nActive\n30 mins\nChilling Time\n12 hrs\nTotal\n14 hrs 35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncenter-cut trimmed beef tenderloin\n,\n2\nto\n3\npounds\n(\n900\ng\nto\n1.4\nkg\n; see note)\nKosher salt\nand\nfreshly ground black pepper\n4\ntablespoons\n(\n57\ng\n)\nunsalted butter\n4\nsprigs\nthyme\n1\nshallot\n, roughly sliced\nFinely minced chives\n, for serving\nCoarse sea salt\n, such as\nfleur de sel\nor\nMaldon\n, for serving\n1\nrecipe\nHorseradish Cream Sauce\n, for serving\nDirections\nThe Day Before:\nUsing butcher's twine, tie tenderloin at 1-inch intervals using\nbutcher's knots\n. Season generously with salt and pepper. Transfer to a wire rack set in a foil-lined rimmed baking sheet and refrigerate uncovered at least overnight and up to 2 nights.\nSerious Eats / J. Kenji López-Alt\nWhen Ready to Cook:\nAdjust oven rack to center position and preheat oven to 225°F (107°C). Place baking sheet with rack and tenderloin in oven and roast until internal temperature registers 120 to 125°F (49 to 52°C) on an instant-read thermometer, 2 to 3 hours. Remove from oven and set aside at room temperature for 10 minutes. Cut and remove twine.\nSerious Eats / J. Kenji López-Alt\nTo Finish Under the Broiler:\nAdjust rack to 6 inches from broiler element and preheat broiler to high. Heat butter, swirling, in a medium skillet over high heat until foaming subsides and butter turns a light nutty brown. Add thyme and shallots and stir until crackling stops. Pour butter mixture over tenderloin and spread with a spoon until all surfaces are coated. Remove shallots from top surface of meat. Place pan with tenderloin under broiler and broil, turning every 30 seconds, until meat is well browned on all sides and internal temperature registers 125°F (52°C) for rare or 130°F (54°C) for medium-rare, about 2 minutes total. Proceed to step 5.\nSerious Eats / J. Kenji López-Alt\nTo Finish on the Stovetop:\nHeat butter, swirling, in a medium skillet over high heat until foaming subsides and butter turns a light nutty brown. Add tenderloin, shallots, and thyme and cook, turning occasionally and spooning hot butter and aromatics over roast, until meat is well browned on all sides and internal temperature registers 125°F (52°C) for rare or 130°F (54°C) for medium-rare, about 1 1/2 minutes.\nTransfer tenderloin to a cutting board and allow to rest for 5 minutes. Slice into 1/2-inch slices, sprinkle with chives and coarse sea salt, and serve with Horseradish Cream Sauce.\nSpecial Equipment\nWire cooling rack\n,\nRimmed baking sheet\n,\nProbe thermometer\nNotes\nFor best results, season and trim the meat and allow it to rest at least overnight uncovered in the refrigerator to improve seasoning, browning, and texture. A center-cut beef tenderloin is also called a chateaubriand. Ask your butcher for it, or buy a whole tenderloin and\ntrim it yourself\n, reserving the ends for another use. Plan on 1/2 pound of meat per person.\nRoasted Beef\nTenderloin Steak\nBeef Mains\nChristmas Dinners\nChristmas"
}