{
  "url": "https://www.seriouseats.com/smashed-potato-tart-recipe-11713997",
  "image_url": "https://www.seriouseats.com/thmb/Fso1tVEkTo5JeHngrWVBTCqdVAs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250410-SEA-SmashedPotatoTart-JordanaShearaPhotography-hero-f23198bcaea74f38b958d830ce81ab75.jpg",
  "tags": [
    "Breakfast & Brunch",
    "The Latest",
    "Recipes",
    "Easter",
    "Vegetarian Breakfast & Brunch"
  ],
  "title": "Vegetable Tart With Smashed Potato Crust",
  "full_text": "Vegetable Tart With Smashed Potato Crust\nClose\nJump to recipe\nPrep\n15 mins\nCook\n70 mins\nCooling Time:\n10 mins\nTotal\n95 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(\n680\ng\n)\nbaby gold or yellow potatoes\n, halved (or larger medium-starch yellow potatoes, such as Yukon Golds, cut into 1 1/2-inch pieces\n8\ncups\n(\n1.9\nL\n)\nwater\n5 1/2\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt use half as much by volume\n1\nteaspoon\nbaking soda\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, divided\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\n, divided\n8\nounces\nleeks\n, thinly sliced and rinsed well (about\n2\ncups\nsliced)\n8\nounces\nasparagus\n, trimmed and cut into 1-inch pieces\n1\nteaspoon\nfresh thyme\nleaves\n1\ngarlic\nclove\n, minced or grated\n1/4\nteaspoon\nfreshly\nground black pepper\n2\nlarge\neggs\n1\nounce\ncream cheese\n, room temperature\n1/4\ncup\n(\n60\nml\n)\nheavy cream\n4\nounces\ngrated fontina cheese\n(about\n1\ncup\ngrated)\n2\nounces\ncrumbled goat cheese\n(about\n1/2\ncup\ncrumbled)\n2\ntablespoons\nchopped\nfresh parsley\n, plus more for garnish\n1\ntablespoon\nchopped fresh\nchives\n, plus more for garnish\nSour cream\nor creme fraîche for serving (optional)\nDirections\nAdjust oven rack to bottom position and preheat oven to 425℉ (220℃).\nIn a large pot, add potatoes, water, 4 teaspoons salt, and baking soda, and heat over high heat until boiling. Add potatoes and cook, lowering heat to maintain simmer, until potatoes are tender when pierced with a fork or knife, 12 to 16 minutes. Drain potatoes then return to pot and heat over medium heat, gently tossing occasionally, until potatoes are dry, about 1 minute. Remove from heat and set aside for 5 minutes.\nSerious Eats /Jordana Sheara Photography\nWhile potatoes cool, in a large skillet, heat 1 tablespoon oil and 1 tablespoon butter over medium-high heat until butter is melted and no longer foams, about 2 minutes. In a 9-inch tart pan with a removable bottom or springform pan, use a spatula to scrape melted butter and oil into pan and use a pastry brush to brush evenly on the bottom and sides of pan (see notes). Add warm potatoes in an even layer. Use the back of a greased measuring cup or bottom of a mug to smash potatoes into an even layer, being sure to press potatoes up the sides of tart pan; make sure there are no gaps in the potato layer (use your fingers if needed). Transfer tart pan to a baking sheet. Brush 1 tablespoon oil evenly over top of potato crust and sprinkle with 1/2 teaspoon salt. Bake until golden brown and slightly crispy, about 40 minutes.\nSerious Eats /Jordana Sheara Photography\nMeanwhile, in now-empty large skillet, heat remaining 1 tablespoon oil and butter over medium heat until butter is melted. Add leeks and cook, stirring occasionally and adjusting heat as needed to prevent scorching, until very soft and just starting to brown, about 10 minutes.\nSerious Eats /Jordana Sheara Photography\nPush leeks to edge of skillet and add asparagus, thyme, garlic, black pepper, and remaining 1/2 teaspoon salt to center of skillet. Cook, occasionally stirring asparagus mixture in the center of skillet, until asparagus is just tender, 2 to 4 minutes. Stir asparagus into leeks until all vegetable are well combined. Remove from heat and set aside.\nSerious Eats /Jordana Sheara Photography\nIn a medium bowl, whisk together eggs, cream cheese, and heavy cream until smooth. Set aside until potatoes are finished cooking.\nSerious Eats /Jordana Sheara Photography\nWhen potato crust has finished cooking, remove from oven and reduce oven temperature to 400℉ (205℃). Sprinkle fontina cheese evenly over par-cooked potato crust. Spread cooked leek mixture evenly over fontina.\nSerious Eats /Jordana Sheara Photography\nSprinkle goat cheese, parsley, and chives evenly over vegetables, then pour the egg mixture on top. Gently shake tart pan to ensure egg mixture evenly covers vegetables. Bake until eggs are just cooked through and set, 16 to 20 minutes (center will still be slightly soft and jiggly). Transfer tart pan to a wire rack and let cool for 10 minutes. Run a sharp knife along edges of tart pan to loosen potato crust away from pan. Carefully remove the edge of the tart pan. Before serving, sprinkle with parsley and chives. Serve warm or at room temperature with sour cream or crème fraîche.\nSerious Eats /Jordana Sheara Photography\nSpecial Equipment\n9-inch tart pan with removable bottom or springform pan, large skillet, pastry brush, rimmed baking sheet\nNotes\nThis recipe can be made in a 9-inch pie pan instead of a tart pan. Simply follow the recipe as written, but instead of removing the tart from the pie dish after cooking, simply cut slices out of the pie pan.\nMake-Ahead and Storage\nI enjoy this recipe best served hot or warm right of the oven; however, it’s also nice served at room temperature.\nLeftovers can be stored in an airtight container in the refrigerator for up to 3 days. Reheat in tart pan set on a rimmed baking sheet in a 350℉ (175℃) oven until warmed through. Note that the potato crust will not be as crispy when reheated.\nBreakfast & Brunch\nThe Latest\nRecipes\nEaster\nVegetarian Breakfast & Brunch",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/vegetable-tart-with-smashed-potato-crust.webp?"
}