{
  "url": "https://www.seriouseats.com/smashed-potatoes-tonnato-sauce-recipe-11733019",
  "image_url": "https://www.seriouseats.com/thmb/faX8diuWvzeAwlhU9oehkH6zSN8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250513-SEA-SmashedDoubleSaucePotatoes-AmandaSuarez-hero-5274af70d4394a2ab9d68406b947882e.jpg",
  "tags": [
    "Potatoes",
    "The Latest",
    "Recipes",
    "Sides"
  ],
  "title": "These Crispy Smashed Potatoes Are a Hot Mess—and That's the Point",
  "full_text": "These Crispy Smashed Potatoes Are a Hot Mess—and That's the Point\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Potatoes:\n2\npounds\n(\n900\ng\n) small\nyellow or gold potatoes\n(see notes)\nKosher salt\n3\nor\n4\nsprigs\nfresh thyme\nExtra-virgin olive oil\n, for pan-frying\nFor the Tonnato Sauce:\n1\nlarge\negg\n1/4\ncup\n(\n60\nml\n)\nfresh lemon juice\n(from\n2\nwhole\nlemons\n), divided\n2\nanchovy\nfillets\n(about\n1/4\nounce\n;\n7\ng\n)\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n1\nteaspoon\n(\n5\ng\n)\ndrained capers\n1/2\ncup\n(\n120\nml\n)\nvegetable oil\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n4\nounces\n(\n113\ng\n)\noil-packed tuna\n, drained\nKosher salt and freshly ground black pepper\nFor the Parsley Sauce:\n1\nounce\n(\n30\ng\n)\nflat-leaf parsley\nleaves and tender stems\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\nKosher salt\nFor Serving:\n1/4\ncup\npitted olives\n, such as Taggiasca or Gaeta (see notes)\nAbout\n2\ntablespoons\ndrained and minced\nQuick-Pickled\nRed Onion\nAbout\n2\ntablespoons\nchopped\nCalabrian chiles in oil\nor other jarred chiles in oil (see notes)\nDirections\nFor the Potatoes:\nIn a large pot, cover potatoes with cold water, season heavily with salt, and add thyme. Bring to a boil over high heat , then reduce heat to a gentle simmer and cook until potatoes are completely tender, about 10 minutes after a boil is achieved (poke a potato with a sharp knife or cake tester to test for doneness). Drain in a colander set in the sink and let rest for 10 minutes to dry and cool slightly.\nSerious Eats / Amanda Suarez\nWorking with one potato at a time, place potato on cutting board and smash firmly with the bottom of a heavy skillet to a thickness of about 1/2 inch. Transfer to a large plate or tray as you work.\nSerious Eats / Amanda Suarez\nIn a large nonstick or cast iron skillet, heat about 1/4 inch of olive oil over medium heat until shimmering. Add as many potatoes as will fit in a single layer. Cook, shaking pan occasionally, until bottom side is deep golden brown, about 6 minutes. Carefully flip with a thin metal spatula and cook until second side is golden brown and crisp, about 5 minutes longer. Transfer to a paper towel-lined plate and allow to drain.\nSerious Eats / Amanda Suarez\nContinue cooking potatoes in batches, adding more oil as necessary, until all potatoes are cooked. Potatoes can then be left aside until ready to serve.\nSerious Eats / Amanda Suarez\nWhile the potatoes are boiling, make the Tonnato Sauce:\nPlace egg, 2 tablespoons (30ml) lemon juice, anchovies, mustard, and capers in a blender or food processor and, with the processor or blender running, slowly drizzle in vegetable oil followed by the olive oil until oil is fully emulsified and a mayonnaise has formed.\nSerious Eats / Amanda Suarez\nTurn off processor or blender and scrape down sides of cup using a rubber spatula, then add tuna and remaining 2 tablespoons (30ml) lemon juice. Process or blend just until tuna is thoroughly incorporated into a smooth sauce, 15 to 30 seconds. Avoid over-blending, as this can cause the sauce to become grainy. Transfer tonnato sauce to a medium bowl and season with salt and pepper. Rinse out processor or blender jar.\nSerious Eats / Amanda Suarez\nFor the Parsley Sauce:\nIn the rinsed processor or blender, combine parsley with oil and blend until a fairly smooth sauce forms. Season with salt.\nTo Serve:\nOn a large platter, spread a generous layer of tonnato sauce all over. Arrange potatoes on top (if they've cooled and you want to serve them warm, you can reheat them in a 400°F oven for about 6 minutes). Spoon some generous spoonfuls of parsley sauce on top along with a scattering of the olives, minced pickled onions, and chiles in oil. Serve. (Note, you will have leftovers of the sauces.)\nSerious Eats / Amanda Suarez\nNotes\nAny small, creamy potato can work here, including Yukon Golds, yellow potatoes, red potatoes, and more.\nFeel free to substitute any chile-oil-type product or oily chile paste in place of the Calabrian chiles called for here; this recipe is flexible and can handle many substitutions.\nYou will have extra of the sauces. Save them for whatever you want—spoon them onto other vegetable dishes, roast chicken, fish, pork, or other meats, use them in sandwiches and salads, and more.\nMake-Ahead and Storage\nThe potatoes can be boiled and then cooled and refrigerated up to 2 days in advance. Once smashed and pan-fried, they can be held for a couple hours before reheating in a hot oven and serving.\nThe tonnato sauce and parsley oil can be refrigerated in airtight containers for up to 3 days.\nPotatoes\nThe Latest\nRecipes\nSides"
}