{
  "url": "https://www.seriouseats.com/smashed-sunchokes-with-thyme-butter",
  "image_url": "https://www.seriouseats.com/thmb/0Chc-8R8s0kwsoQENvdz8lAqbuM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190529-smashed-sunchokes-vicky-wasik-10-6ac7010efc6547df8bafefbfac270c53.jpg",
  "tags": [
    "Vegetable Sides",
    "Spring Sides",
    "Stovetop",
    "Easter"
  ],
  "title": "Smashed Sunchokes With Thyme-Butter",
  "full_text": "Smashed Sunchokes With Thyme-Butter\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n10 mins\nCooling Time\n5 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nsunchokes\n, rinsed and trimmed of any dark spots\nKosher salt\n1 1/2\ntablespoons\n(\n20\nml\n)\ncanola\nor other neutral\noil\n2\ntablespoons\n(\n1\nounce\n;\n30\ng\n)\nunsalted butter\nLarge\npinch\nfreshly picked thyme leaves\nFlaky salt\n, such as Maldon, for serving\nDirections\nIn a medium saucepan, cover sunchokes with 1 inch cold water. Season generously with salt (the water should taste nicely salted, as if you were seasoning soup). Set over high heat and bring to a boil, then reduce heat to maintain a gentle simmer. Cook until paring knife inserted into a sunchoke meets little resistance, about 10 minutes; be careful not to overcook.\nDrain sunchokes using fine-mesh strainer or colander. When cool enough to handle, place sunchokes on work surface or cutting board. Working 1 sunchoke at a time, use the bottom of a heavy skillet to press firmly on each sunchoke until it is flattened but still in one piece; take care not to press so hard that the sunchokes break apart.\nSerious Eats / Vicky Wasik\nIn a large cast iron skillet, heat oil over medium heat until shimmering. Add sunchokes in a single layer and cook without moving until well browned, about 3 minutes. Flip sunchokes, then add butter to the pan and allow to melt. Add half of thyme to the melted butter and continue to cook, spooning butter over sunchokes, until browned on the second side, about 3 minutes longer.\nSerious Eats / Vicky Wasik\nTransfer sunchokes to a serving plate and spoon the thyme butter on top. Garnish with remaining freshly picked thyme leaves and sprinkle with flaky salt. Serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n12-inch cast iron skillet\n,\nfine-mesh strainer\n,\nsaucepan\nMake-Ahead and Storage\nThe sunchokes can be boiled up to 1 day in advance, then drained, pressed flat, and refrigerated in an airtight container until ready to use. They will re-warm during the searing and basting step.\nRead More\nGet to Know Sunchokes, a.k.a. Jerusalem Artichokes\nVegetable Sides\nSpring Sides\nStovetop\nEaster"
}