{
  "url": "https://www.seriouseats.com/smoked-turkey-breast-recipe-8745482",
  "image_url": "https://www.seriouseats.com/thmb/0KmWIlROri2Q0-QTx0U-6NBeo6E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241106-SEA-Smoked-Turkey-Breast-Lozano_hero-56dd84afd22a42809888c8e6cf5dbded.jpg",
  "tags": [
    "The Latest",
    "Mains",
    "Turkey Breast",
    "Christmas",
    "Thanksgiving"
  ],
  "title": "Smoked Turkey Breast",
  "full_text": "Smoked Turkey Breast\nClose\nJump to recipe\nPrep\n20 mins\nCook\n60 mins\nRefrigeration and Resting Time\n12 hrs 30 mins\nTotal\n13 hrs 50 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n5\n- to 7\n-\npound\nwhole, bone-in, skin-on\nturkey breast,\nthawed\n2\ntablespoons\ndark brown sugar\n2\ntablespoons\n(18g) Diamond Crystal\nkosher salt\n; for Mortan’s kosher salt, use the same amount by weight\n2\nteaspoons\nfreshly\nground black pepper\n2\nteaspoons\nbaking powder\nNeutral\noil\nor melted butter\nfor\nbrushing turkey\nFour\nroughly\n3-inch large chunks of\nwood\nor 2 cups wood chips (preferably hickory), soaked in water for 15 minutes if using chips (see notes)\nDirections\nPat turkey dry with paper towels. In a bowl, mix brown sugar, salt, and pepper. Loosen skin from turkey and rub entire turkey, under and over skin, with salt mixture. Rub baking powder all over turkey exterior. Transfer turkey breast to a wire rack set inside a large plate, platter, or rimmed baking sheet and refrigerate, uncovered, for at least 12 hours or up to 2 days.\nSerious Eats / Robby Lozano\nWhen ready to grill:\nUsing a skewer or toothpick, pierce turkey skin lightly all over, then brush lightly with oil.\nSerious Eats / Robby Lozano\nPrepare a foil collar to stabilize the turkey:\nFold an 18- by 12-inch sheet of aluminum foil lengthwise, then fold 2 more times in the same orientation to make a folded piece of foil that measures 12-inch long by roughly 2 1/4 inches wide, set aside.\nSerious Eats / Robby Lozano\nFor a Charcoal Grill:\nOpen bottom vent of grill. Fill large chimney starter 3/4 with charcoal briquettes (about 4 quarts), light, and burn until top coals edges are lightly covered with gray ash.\nSerious Eats / Robby Lozano\nPlace a 13 by 9-inch disposable aluminum roasting pan in center of grill. Pour 1 quart unlit charcoal briquettes on one side of grill’s edge next to empty pan, and 1 quart unlit coals along the other side. Pour half of hot coals into pile over the unlit coals on one side of grill and the remaining lit coals on the other side, leaving the empty pan in the center.\nSerious Eats / Robby Lozano\nCarefully pour 1 quart water into the empty foil pan. Scatter wood chips or wood chunks evenly over coals on both sides of the pan. Set cooking grate in place, cover (open lid vent halfway), and let grill heat for 5 minutes (grill temperature should register about 350℉;175℃.)\nSerious Eats / Robby Lozano\nFor a Gas Grill:\nDo not use wood chunks for a gas grill. Instead, seal the soaked and drained wood chips in a foil packet roughly 5 by 3 inches long, cut three 2-inch long vents into the top, and place directly over the primary burner. Turn all burners to high and close lid, keeping grill covered until wood chips begin to smoke, about 15 minutes. Leave primary burner on high and turn off all other burners.\nFor Smoking the Turkey:\nClean and oil cooking grate. Place turkey, breast side up, on cooking grate, centered over the drip pan if using a charcoal grill or on the cooler side of the grill if using a gas grill. To help stabilize the turkey, wrap the prepared foil collar around the inside bottom of the turkey breast, along the grills plates, wrapping it snugly into the turkey to hold the turkey breast in place upright.\nSerious Eats / Robby Lozano\nClose grill lid (leaving vents halfway open for a charcoal grill), and cook until skin is well browned and crisp and thickest part of meat registers 155℉ (68℃) on an instant-read thermometer, 60 to 90 minutes. Grill temperature may fluctuate and drop by up to 50℉ (10℃) during cooking. For a charcoal grill, adjust vents as needed to maintain grill temperature close to 350℉ (175℃); for a gas grill, adjust the knobs as needed to maintain this temperature.\nSerious Eats / Robby Lozano\nWearing grill mitts, transfer breast to cutting board and let rest for 30 minutes. Carve and serve.\nSpecial Equipment\ncharcoal grill, gas grill, or smoker; aluminum foil; one (13 by 9 inch) disposable aluminum pan if using a charcoal grill\nNotes\nUse a hardwood like oak, hickory, or mesquite or a semi-hard fruit wood like apple, cherry, or pecan wood for smoking. Avoid soft woods like cedar or pine.\nIf using a charcoal smoker, nestle unlit charcoal briquettes into lit briquettes with additional wood as needed to maintain cooking temperature around 350℉. If using a pellet smoker, do not add wood chunks, instead follow manufacturer’s instructions for using pellets.\nMake-Ahead and Storage\nLeftover turkey can be refrigerated in an airtight container for up to 5 days.\nThe Latest\nMains\nTurkey Breast\nChristmas\nThanksgiving"
}