{
  "url": "https://www.seriouseats.com/smoked-honey-mint-chip-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/liGhh5jcOiVA1J_z9t5SHkDqORc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__07__20140701-smoky-honey-mint-chocolate-chip-ice-cream-vicky-wasik-1-3ad25ce4efb344fb9bfd57436a1f89fd.jpg",
  "tags": [
    "Ice Cream",
    "Smoking",
    "Mint"
  ],
  "title": "Smoked Honey Mint Chip Ice Cream Recipe",
  "full_text": "Smoked Honey Mint Chip Ice Cream Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n4 hrs 35 mins\nActive\n2 hrs\nChurning/Freezing Time\n8 hrs 30 mins\nTotal\n13 hrs 15 mins\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Smoked Cream:\n4\ncups\nhickory or\nmesquite wood chips\n, soaked in water for at least 30 minutes\n1\nquart\nheavy cream\nFor the Ice Cream:\n1 1/2\ncups\nheavy cream\n1\ncup\nwhole milk\n1\nbunch\nfresh\nmint leaves\n6\negg yolks\n1/2\ncup\nsugar\n1/4\ncup\nhoney\n1/4 to 1/2\nteaspoon\nkosher salt\n2 1/2\nounces\ndark chocolate\n, chopped very fine and chilled in freezer\nDirections\nFor the Smoked Cream:\nSet up your smoker with 1/2 cup wood chips for low-temperature (about 150°F) smoking following the manufacturer's instructions.\nFill a shallow disposable aluminum baking pan with enough ice to come halfway up pan, and just enough water to nearly cover ice. Nest a smaller shallow disposable aluminum baking pan with at least 2-quart capacity into the ice bath. Set pans in smoker and add 1 quart of cream to smaller pan.\nClose smoker, adjusting vents to maintain as low a temperature as possible, and smoke until cream develops a strong, but not overpowering, smoky flavor, about 1 1/2 to 2 hours; replenishing wood chips 1/2 cup at a time as needed, and stirring cream occasionally. Monitor temperature of cream: If an instant-read thermometer registers above 60°F, discard ice bath and replace with a fresh one. Pour cream into an airtight container and refrigerate.\nFor the Ice Cream:\nBlend smoked cream with fresh cream to taste, starting with 1/2 cup smoked cream and 1/2 cup fresh cream and adding more of each to taste, until volume totals 2 cups and smoky flavor is pleasant and not overpowering. Reserve additional smoked and fresh creams for another use.\nCombine diluted smoked cream with milk in a heavy-bottomed saucepan and bring to a simmer over medium heat. Remove from heat, add mint, cover, and let steep until dairy tastes very minty, 2 to 2 1/2 hours.\nWhisk together egg yolks, sugar, and honey in a cleaned heavy-bottomed saucepan. Strain cream mixture into saucepan, pressing on leaves with a spoon or ladle to expel all liquid, and whisk to combine, then place over medium-low heat. Cook, stirring frequently, until ice-cream base reaches 170°F or until a finger swiped across the back of the spoon leaves a clean line.\nPour ice-cream base through a fine mesh strainer into an airtight container, stir in salt, and chill in an ice bath or refrigerator until it registers no more than 45°F on an instant-read thermometer, at least 4 hours and up to overnight. Churn according to manufacturer's instructions, adding chocolate during last 30 seconds of churning. Transfer ice cream to airtight container and chill in freezer for at least 4 to 5 hours before serving.\nSpecial equipment\nIce cream machine, smoker, disposable aluminum baking pans (one with at least a 2-quart capacity, the other larger)\nThis Recipe Appears In\nThe Best Sweet Use for Your Smoker? Smoked Ice Cream\nIce Cream\nSmoking\nMint"
}