{
  "url": "https://www.seriouseats.com/smores-icebox-cake-recipe-8683662",
  "image_url": "https://www.seriouseats.com/thmb/zqYFDMt_gXSnPmU_WJO8JJV4K4w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240724-SEA-SmoresIceBoxCake-AmandaSuarez-hero-ae6dee0f7df94cf99eab40e09b2e5be2.jpg",
  "tags": [
    "Summer Desserts",
    "The Latest",
    "Chocolate",
    "Desserts",
    "Summer"
  ],
  "title": "S'mores Icebox Cake",
  "full_text": "S'mores Icebox Cake\nClose\nJump to recipe\nPrep\n30 mins\nCook\n40 mins\nChilling Time\n3 hrs 30 mins\nTotal\n4 hrs 40 mins\nServes\n8\nMakes\n1 9- by 4-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chocolate Mousse:\n198g\ndark chocolate\n, coarsely chopped (\n7\nounce\ns; 1 1/4 cups), between 64 and 70% cacao\n3/4\ncup\n(180ml)\nheavy cream\n3\nlarge\neggs\n(150g), separated\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nespresso\npowder (optional)\n50g\ngranulated sugar\n(\n1 3/4\nounces\n; 1/4 cup)\nFor the Whipped Cream:\n1\ncup\n(240ml)\nheavy cream\n1\ntablespoon\n(15g) superfine or\ngranulated sugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Cookie Layers:\n20\ngraham crackers\n(about\n3 3/4\nounces\n; 107g), homemade or store-bought\n1/4\ncup\n(60ml)\nbrewed coffee\nFor the Italian Meringue:\n4 large\negg whites\n, at room temperature (about\n5\nounces\n; 140g)\n200\ng\ngranulated sugar\n(7 ounces; 1 cup)\n1/2\ncup\n(120ml)\nwater\nDirections\nFor the Chocolate Mousse:\nIn a large heatproof mixing bowl, combine chocolate and heavy cream. Set it over a saucepan filled with 1-inch barely simmering water and heat, stirring occasionally, until chocolate is fully melted, about 10 minutes. Whisk until homogeneous, then remove from heat and set on a heatproof work surface.\nSerious Eats / Amanda Suarez\nOnce chocolate mixture is warm to the touch, whisk in 3 egg yolks until well combined. Set aside.\nSerious Eats / Amanda Suarez\nMeanwhile, in the bowl of a stand mixer fitted with the whisk attachment, combine egg whites, salt, and espresso powder. Whisk on medium speed until egg whites begin to foam. Slowly and steadily stream in sugar. Continue to whisk until meringue is glossy and reaches medium-stiff peaks, about 8 minutes. Set aside.\nSerious Eats / Amanda Suarez\nAdd 1/4 of the meringue to the chocolate mixture and gently fold until thoroughly combined. Add remaining meringue and continue to gently fold until meringue is almost entirely incorporated, being careful not to overmix. Transfer to large bowl; set aside in refrigerator. Wash and dry mixing bowl.\nSerious Eats / Amanda Suarez\nFor the Whipped Cream:\nIn the now-clean bowl of a stand mixer fitted with the whisk attachment, combine cream, sugar, and salt. Whip on medium-high speed until medium-stiff peaks form, about 2 minutes. (Alternatively, combine cream, sugar, and salt in a large mixing bowl. Using a hand mixer fitted with the whisk attachment, beat on medium speed until medium stiff peaks form, about 3 minutes.) Set aside.\nSerious Eats / Amanda Suarez\nTo Assemble:\nLine a 9- by 4-inch loaf pan with plastic wrap. Using a flexible spatula or offset spatula, spread about 1/2 cup (75g) of chocolate mousse on the bottom. Cover surface with 1 layer of graham crackers; you may have to break the cookies up to get them to fit snugly. Gently press them into mousse. Using a pastry brush, brush graham crackers generously with coffee. Using a flexible or offset spatula, evenly spread 1/2 cup (50g) whipped cream across crackers.\nSerious Eats / Amanda Suarez\nTop whipped cream with another layer of crackers and brush with coffee. Using a flexible or offset spatula, evenly spread 1/2 cup of chocolate mousse across crackers. Repeat layering, alternating crackers, mousse and whipped cream as needed, ending with a layer of graham crackers brushed with coffee. (You should have 4 Graham cracker layers.)\nSerious Eats / Amanda Suarez\nCover tightly with plastic wrap and refrigerate until cake is cohesive and chilled, at least 6 hours and up to 24 hours.\nSerious Eats / Amanda Suarez\nLine a 9- by 13- inch rimmed baking sheet with foil. Remove plastic from top of cake and invert cake onto rimmed baking sheet. Gently peel away remaining plastic, and transfer to freezer until firm enough to slice, about 1 hour or up to 1 week.\nSerious Eats / Amanda Suarez\nMeanwhile, prepare the Italian meringue:\nIn the bowl of a stand mixer fitted with the whisk attachment, begin whisking egg whites on low speed. Meanwhile, in a small saucepan, combine sugar and water. Bring to a boil over medium-high heat and cook until sugar syrup registers 240ºF (115ºC) on an instant-read or candy thermometer, about 4 minutes. (Remove from heat immediately once sugar syrup reaches temperature.)\nSerious Eats / Amanda Suarez\nIncrease mixer speed to medium and mix until soft peaks form. With the mixer running on medium speed, carefully and slowly drizzle the hot sugar syrup into the bowl along the side, avoiding hitting the whisk attachment. Increase speed to high and whip until stiff peaks form and meringue is no longer hot, about 10 minutes.\nSerious Eats / Amanda Suarez\nRemove cake from freezer. Using a flexible or offset spatula, frost cake with Italian meringue, using the back of a spoon or spatula to make swooshes. Using a blowtorch, torch meringue 1- to 2- inches away from the surface of the meringue until evenly browned. (To toast meringue in the oven, see notes.) Hold both ends of the foil and gently transfer cake to a cutting board. Wiggle a chef’s knife or long offset spatula under the cake to loosen it from the foil and gently pull foil to remove.\nSerious Eats / Amanda Suarez\nUsing a hot knife, slice cake into 8 pieces and serve. (For cleaner cuts, run knife under warm water and dry knife with a clean kitchen towel before portioning each slice.)\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWhisk, stand mixer, 9- by 4-inch loaf pan, pastry brush instant read thermometer, flexible or offset spatula, butane blowtorch\nNotes\nIf you don’t feel like making chocolate mousse from scratch, you can substitute with store-bought chocolate pudding, but the resulting icebox cake will likely be sweeter.\nIf you don’t own a blowtorch, you can toast the meringue in the oven. However, it is crucial that the icebox cake is fully frozen before you frost it with meringue, otherwise the mousse and cream will melt. Adjust oven rack to middle position and preheat oven to 500ºF (260ºC). After coating the cake with meringue, transfer rimmed baking sheet with icebox cake to oven and bake until meringue is golden brown, about 5 minutes.\nIf you don’t feel like making Italian meringue, you can substitute with store-bought marshmallow fluff and torch it for a similar result.\nMake-Ahead and Storage\nThe unfrosted icebox cake can be frozen for up to 1 week before slicing and serving. Proceed with step 10 when ready to serve.\nSliced portions can be refrigerated in an airtight container for up to 3 days.\nSummer Desserts\nThe Latest\nChocolate\nDesserts\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/smores-icebox-cake.webp?"
}