{
  "url": "https://www.seriouseats.com/smores-chocolate-marshmallow-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/IU6fXSCqIn7uXohCHpv4HKofKPg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120223-pieoftheweek-smorespie-primary-06367d170bff409781398fe7cf166fe9.jpg",
  "tags": [
    "Pies",
    "Pie Dough",
    "Chocolate"
  ],
  "title": "S'mores Pie Recipe",
  "full_text": "S'mores Pie Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n60 mins\nChilling Time\n3 hrs 20 mins\nTotal\n3 hrs 45 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n15\ngraham crackers\n, finely ground to crumbs in the food processor\n1/2\nteaspoon\nsalt\n3\ntablespoons\nsugar\n2\nounces\nmelted\nbutter\nFor the Filling:\n4\nounces\nbittersweet chocolate\n, melted\n17\nounces\nwhole milk\n5\nounces\ngranulated sugar\n, divided\n1/2\nteaspoon\nsalt\n1.4\nounces\ncornstarch\n1\negg\n3\negg yolks\nFor the Topping:\n1\negg white\n1\npinch\ncream of tartar\n1\npinch\nsalt\n2\nteaspoons\ngelatin powder\n1/4\ncup\ncold\nwater\n7\nounces\ngranulated sugar\n2.6\nounces\nlight corn syrup\n2.6\nounces\nwater\nDirections\nFor the Crust:\nCombine all ingredients for crust in the food processor. Pulse until completely combined. Pour contents into a spring form pan and press with your fingers to form a crust that comes up 2 inches around the edge. Chill in refrigerator until ready to use.\nFor the Filling:\nMelt chocolate and set aside.\nWhisk together half of sugar and cornstarch. In a separate bowl, whisk together eggs and yolks. Combine two mixtures and whisk until egg mixture is smooth and light, about 1 minute.\nPlace milk, other half of sugar, and salt in a medium saucepan. Bring milk to a simmer and temper eggs with hot milk mixture in small additions, whisking constantly.\nAdd mixture back to saucepan and set over medium heat, whisking constantly. Mixture will begin to thicken; continue to whisk. When it begins bubbling, whisk for an additional 2 minutes, then remove from heat. Whisk in chocolate, then pour mixture into prepared crust and press plastic wrap directly on top. Chill for 3 hours, until set.\nFor the Topping:\nWhen you are ready to serve, combine egg white, salt, and cream of tartar in the bowl of a stand mixer fitted with a whisk attachment and whisk until frothy. Bloom gelatin in the 1/4 cup of water and set aside.\nCombine sugar, corn syrup, and water in a medium sized saucepan over medium heat. Bring the mixture to 240°F. Immediately whisk in the bloomed gelatin (careful, it will sputter), then turn the mixer up to high speed and slowly pour the hot mixture down the side of the bowl. Whisk on high until the mixture becomes light, gooey, and thick.\nPipe or spoon over chilled pie. Brulée top with a culinary torch or under the broiler in the oven. Serve immediately.\nSpecial equipment\n8-inch springform pan, culinary torch, candy thermometer\nPies\nPie Dough\nChocolate"
}