{
  "url": "https://www.seriouseats.com/smothered-turkey-wings",
  "image_url": "https://www.seriouseats.com/thmb/YzKtC2nI4kUxcKZ_GNjlyiKvd0M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20201102-smothered-turkey-wings-jillian-atkinson-593dc7ba3bcd4fe09d9dfa85f204d9bf.jpg",
  "tags": [
    "Turkey",
    "Soul Food & Southern",
    "Turkey Mains",
    "Fall Mains",
    "Thanksgiving Turkeys"
  ],
  "title": "Smothered Turkey Wings",
  "full_text": "Smothered Turkey Wings\nClose\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs\nActive\n45 mins\nBrining and Cooling Time\n3 hrs 30 mins\nTotal\n5 hrs 40 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Brine:\n1/4\ncup\nplus\n2\ntablespoons\n(\n2\nounces\n;\n55\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\n1\ntablespoon\n(\n1/2\nounce\n;\n15\ng\n)\nlight brown sugar\n1\ntablespoon\nwhole black peppercorns\n2\nbay leaves\n6\nwhole\nturkey wing\nflats or\n3\nwhole\nturkey wings\nsplit into flats and drums (about\n3\npounds\n/\n1.3\nkg\ntotal; see note)\n1\nmedium\nshallot\n(\n3/4\nounce\n;\n20\ng\n), cut in half\n5\nsprigs\nfresh thyme\n1\nlarge sprig\nfresh rosemary\nFor the Braise:\n3 1/2\ntablespoons\n(\n50\nml\n) vegetable, canola, or other neutral\noil\n, divided\n1\nmedium\n(\n8-ounce\n;\n225 g\n)\nyellow onion\n, thinly sliced\n1\nlarge\n(\n5-ounce\n;\n140 g\n)\ncarrot\n, peeled and thinly sliced crosswise into rounds\n1\ncelery\nrib\n(about\n2\nounces\n;\n55\ng\n), thinly sliced on the bias\n2 1/2\ntablespoons\nall-purpose flour\n2 1/2\ncups\nhomemade\nchicken stock\nor\nlow-sodium\nbroth, plus more if needed\n1\nteaspoon\ndried\nsage\npowder\n1/2\nteaspoon\nfreshly\nground black pepper\n1/2\nteaspoon\ngranulated garlic\n1/2\nteaspoon\nonion powder\n1/4\nteaspoon\nsmoked paprika\nKosher salt\nDirections\nFor the Brine:\nIn a large mixing bowl, prepare an ice bath. In a 2-quart saucepan, stir together 1 quart (1L) water with salt, brown sugar, peppercorns, and bay leaves over medium heat until brine reaches a gentle simmer and salt and sugar have dissolved. Set saucepan in ice bath, making sure it doesn't cause an overflow, and stir brine until cooled to room temperature. In a large zipper-lock bag, add turkey wings, shallot, thyme, and rosemary. Carefully pour cooled brine on top, seal, pushing out any excess air, and refrigerate for at least 3 and up to 8 hours.\nDrain wings, discarding brine and aromatics. Dry wings well with paper towels. Set aside.\nFor the Braise:\nPreheat oven to 350°F (175°C). In a large Dutch oven, heat 1 tablespoon (15ml) oil over medium-high heat until shimmering. Working in batches, cook wings, turning, until golden brown on both sides, about 7 minutes. Transfer wings to a tray or platter and set aside.\nLower heat to medium and add onion, carrot, and celery to Dutch oven and cook, stirring, until onion is translucent and carrots and celery have softened slightly, about 4 minutes. Transfer vegetables to a heatproof bowl or plate.\nAdd remaining 2 1/2 tablespoons (35ml) oil to Dutch oven. Stir in flour and cook, stirring, until flour is a little darker than the color of peanut butter, about 10 minutes (the timing can vary here, so be sure to follow the color indication).\nWhisk in stock in 1/2-cup increments, whisking well between additions to ensure a smooth texture, until all the liquid has been added. Bring to a low boil, then whisk in sage, black pepper, granulated garlic, onion powder, and smoked paprika. Season very lightly with salt. Remove from heat.\nIn a baking dish large enough to hold the wings in one layer, spread vegetables in an even layer. Arrange wings on top in an even layer, top side down, then pour the pan gravy on top until it comes halfway up the wings (this should be all of the gravy); if there's not enough, add enough additional stock to bring the liquid halfway up the wings.\nCover baking dish tightly with aluminum foil, then bake, turning once halfway through so wings are top side up, until turkey wings are fork-tender, about 1 hours 15 minutes. Turn oven up to 375°F (190°C) and remove foil from baking dish. Return wings to oven and cook until gravy has thickened to a spoon-coating consistency and wings have darkened slightly, about 15 minutes longer. Season gravy with additional salt, if needed, and let rest 10 minutes.\nServe smothered wings with their gravy on rice, mashed potatoes, or as desired.\nSpecial Equipment\nDutch oven\n,\nbaking dish\nNotes\nTurkey wings can vary significantly in size depending on the size of the turkeys they come from, so while this recipe calls for 6 turkey wing parts (either all flats, or a mix of flats and drums) to feed approximately 3 to 4 people, you may need more or fewer if the wings available to you yield a different number per pound. Include the wing tips if you have them.\nMake-Ahead and Storage\nThe smothered wings can be refrigerated in their sauce for up to 5 days. Reheat before serving.\nRead More\nRed Wine–Braised Turkey Legs Recipe\nRoast Turkey in Parts Recipe\nBraised Turkey Jjim with Bacon, Shiitakes, and Chestnuts Recipe\nTurkey\nSoul Food & Southern\nTurkey Mains\nFall Mains\nThanksgiving Turkeys"
}