{
  "url": "https://www.seriouseats.com/snowball-cookies-recipe-8762422",
  "image_url": "https://www.seriouseats.com/thmb/6pWrW1oM5slGaltidZY-hG9MhbU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20151110-snowball-cookies-vicky-wasik-af8615d2015c419a968715381abd7d28.jpg",
  "tags": [
    "Cookies",
    "Almonds",
    "Desserts",
    "Christmas Desserts",
    "Winter Desserts"
  ],
  "title": "Perfect Snowball Cookies",
  "full_text": "Perfect Snowball Cookies\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nFreezing and Cooling Time:\n80 mins\nTotal\n2 hrs\nServes\n24 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nslivered almonds\n(4 1/2 ounces; 130g) (see note)\n1 scant cup\nall-purpose flour\n(\n4 1/2\nounces\n; 128g)\n1/2\nteaspoon\nbaking soda\n1/4\nteaspoon\nDiamond Crystal kosher\nsalt\n; for table salt, use half as much by volume\n4\nounces\nunsalted butter\n, softened (113g; 1 stick)\n45\ng\ngranulated sugar\n(1 1/2 ounces; 3 tablespoons)\n1\nteaspoon\nvanilla extract\n200\ng\nconfectioners' sugar\n(7 ounces; 1 1/2 cups)\nDirections\nAdjust oven rack to center position and preheat the oven to 325°F (160ºC). Spread the almonds out on a pie plate and toast until golden, about 8 minutes. Let cool, then transfer the nuts to a mini food processor and pulse until finely chopped. Transfer to a small bowl and whisk in the flour, baking soda, and salt.\nSerious Eats / Vicky Wasik\nIn the bowl of a standing electric mixer fitted with the paddle attachment, beat the butter with the granulated sugar and vanilla until creamy, about 4 minutes. On low speed, add the nut mixture and beat until evenly combined, scraping up the bottom and sides of the bowl once or twice, about 1 minute.\nSerious Eats / Vicky Wasik\nLine a large sturdy baking sheet with parchment paper. Scoop level tablespoons of the dough into balls and gently roll. Arrange the balls 1 inch apart and freeze until just firm, about 10 minutes. Bake until lightly golden on top and deep golden on the bottom, about 22 minutes.\nSerious Eats / Vicky Wasik\nPlace the cookie sheet on a rack to cool for 10 minutes. Put the confectioners' sugar into a shallow bowl. Working with no more than 2 cookies at a time, roll them in the confectioners' sugar. Return them to the baking sheet and let them cool completely, undisturbed, until the glaze is set, about 1 hour. Sift the confectioners' sugar to remove any crumbs and re-roll the cooled cookies. Store cookies in an airtight container between sheets of waxed paper for up to 2 weeks.\nSerious Eats / Vicky Wasik\nNotes\nToasted pecans, walnuts, or hazelnuts can be used in place of almonds.\nSpecial Equipment\nMini food processor, stand mixer, baking sheet, wire rack\nMake Ahead and Storage\nCookies can be stored in an airtight container at room temperature for up to two weeks.\nCookies\nAlmonds\nDesserts\nChristmas Desserts\nWinter Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/perfect-snowball-cookies.webp?"
}