{
  "url": "https://www.seriouseats.com/sodium-citrate-baked-mac-and-cheese",
  "image_url": null,
  "tags": [
    "American",
    "Soul Food & Southern",
    "Vegetarian Sides",
    "Baked Pasta",
    "Cheddar Cheese"
  ],
  "title": "Creamy Baked Mac and Cheese",
  "full_text": "Creamy Baked Mac and Cheese\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nActive\n30 mins\nResting Time\n15 mins\nTotal\n90 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1\npound\n(\n450\ng\n) elbow\nmacaroni\n5\ntablespoons\n(\n75\ng\n)\nunsalted butter\n, divided\n4\nteaspoons\nsodium citrate\n(\n20\ng\n), see notes\n1 1/2\npounds\ngrated\nsharp cheddar cheese\n(\n680\ng\n;\n6\ncups\n), see notes\n1\nteaspoon\n(\n5\nml\n)\nhot sauce\n, such as Frank's RedHot\n1/2\nteaspoon\nmustard powder\n1/4\nteaspoon\ngarlic powder\n8\nounces\ngrated Gruyère\ncheese (\n225\ng\n;\n2\ncups\n), see notes\n1\ncup\npanko bread crumbs\n(\n2 1/2\nounces\n;\n72\ng\n)\nDirections\nPreheat oven to 400°F (204°C). In a medium pot of salted boiling water, cook elbow macaroni until just shy of al dente, about 2 minutes less than cooking time indicated on package. Drain, then transfer pasta to a large mixing bowl and toss with 2 tablespoons (30g) butter until butter is melted and pasta is evenly coated. Set aside.\nIn a large saucepan, bring 3 cups (720ml) water to a simmer. Whisk in sodium citrate until fully dissolved. While maintaining a gentle simmer, add cheddar cheese in small increments, whisking constantly to incorporate each addition before adding the next. When all the cheese is added and the sauce is smooth and glossy, whisk in hot sauce, mustard powder, and garlic powder. Season with salt, if necessary.\nSerious Eats / Vicky Wasik\nScrape cheese sauce into pasta and mix until evenly coated. Let cool slightly, then add grated Gruyère and mix well. Scrape pasta into a greased 9- by 13-inch baking dish and smooth surface into an even layer.\nAdd panko to a small mixing bowl. Melt remaining 3 tablespoons butter, then add to panko and mix until evenly coated. Season with salt. Scatter panko all over surface of mac and cheese in an even layer. Bake on top rack of oven until browned and bubbling, about 45 minutes (ovens can vary; check often to prevent top from burning).\nLet mac and cheese rest 15 minutes, then serve. Leftover mac and cheese can be refrigerated for up to 5 days; it reheats surprisingly well in the microwave or oven.\nSpecial Equipment\n9- by 13- inch baking dish\nNotes\nFood-grade sodium citrate is available online. Buy it once, then have a supply for making awesome cheese sauce and cheese dip for years—you won't regret having it in your pantry.\nFor the cheese, any semi-firm cheese, such as cheddar, Swiss, Gruyère, Fontina, or Jack, can work here; feel free to use whichever appeals to you.\nMake-Ahead and Storage\nCasserole can be assembled through the end of step 3, then covered and stored in the refrigerator for up to five days before baking. Increase baking time by 15 minutes if refrigerated.\nRead More\nClassic Baked Macaroni and Cheese Casserole With Cheddar and Gruyère\nAmerican\nSoul Food & Southern\nVegetarian Sides\nBaked Pasta\nCheddar Cheese"
}