{
  "url": "https://www.seriouseats.com/soft-chewy-flour-tortillas-recipe",
  "image_url": "https://www.seriouseats.com/thmb/vrzxZp6pX1VhSZz_qN_G16KTVv8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150409-soft-and-chewy-flour-tortillas-joshua-bousel-51fdd4eb84904d919252ec11f96c5cf4.jpg",
  "tags": [
    "Bread",
    "Southwestern & Tex Mex",
    "Sides"
  ],
  "title": "How to Make Flour Tortillas At Home Recipe",
  "full_text": "How to Make Flour Tortillas At Home Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n20 mins\nResting Time\n25 mins\nTotal\n50 mins\nServes\n8 tortillas\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nall-purpose flour\n1 1/2\nteaspoons\nbaking powder\n1 1/2\nteaspoons\nkosher salt\n3\ntablespoons\nlard\nor vegetable shortening\n3/4\ncups\nwarm\nwater\n(approximately 110°F/43°C)\nDirections\nWhisk together flour, baking powder, and salt in a medium bowl. Rub lard into flour mixture using your fingertips until mixture resembles coarse crumbs. Add warm water and work dough with hands until completely combined and no dry flour is left in bowl.\nTurn dough out onto a lightly floured work surface and knead until smooth, about 1 minute. Cover with a damp cloth or plastic wrap and let rest for 10 minutes. Divide dough into 8 equal pieces; roll each piece of dough into a ball. Cover dough balls with a damp cloth or plastic wrap and let rest an additional 15 minutes.\nPreheat cast iron skillet, griddle, or comal to 500°F (260°C). Place one ball of dough on a lightly floured surface and pat down into a flat disc. Using a rolling pin, roll dough out to an 8-inch round. Place dough in skillet and cook until bubbles form on top side and bottom side has brown spots, 30-60 seconds. Flip tortilla and cook until second side develops brown spots, 30-60 seconds longer. Transfer tortilla to a plate and cover with clean dish cloth. Repeat with remaining balls of dough. Serve immediately while still warm.\nNotes\nThe tortillas are best eaten while fresh and still warm. They can be stored in the refrigerator and reheated individually in a hot skillet or wrapped together in foil and placed in a warm oven for reuse, though they won't be as good as when fresh.\nSpecial Equipment\nRolling pin\n,\ncast iron skillet\nBread\nSouthwestern & Tex Mex\nSides",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-make-flour-tortillas-at-home-recipe.webp?"
}