{
  "url": "https://www.seriouseats.com/soft-and-crunchy-peanut-butter-cookies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Z3mwq14Y8w9JDo9osMJlslMTl8k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20151111-soft-crunchy-peanut-butter-cookies-vicky-wasik-1-efeb7496b2d44f4496876661a7122211.jpg",
  "tags": [
    "Cookies",
    "Peanut Butter",
    "Christmas Cookies"
  ],
  "title": "Soft and Crunchy Peanut Butter Cookies Recipe",
  "full_text": "Soft and Crunchy Peanut Butter Cookies Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\n25 mins\nCooling Time\n15 mins\nTotal\n60 mins\nServes\n36 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 2/3\ncups\nall-purpose flour\n(\n13 1/3\nounces\n;\n385\ng\n)\n1\nteaspoon\n(\n4\ng\n)\nbaking soda\n1/2\nteaspoon\n(\n2\ng\n)\nbaking powder\n1/4\nteaspoon\n(\n1\ng\n)\nkosher salt\n8\nounces\nunsalted butter\n(\n2\nsticks\n;\n225\ng\n), at room temperature\n1\ncup\n(\n240\nml\n)\ncrunchy peanut butter\n1\ncup\npacked\nlight brown sugar\n(\n7 1/2\nounces\n;\n215\ng\n)\n3/4\ncup\n(\n5 1/4\nounces\n;\n150\ng\n)\ngranulated sugar\n, plus\n1/2\ncup\n(\n3 1/2\nounces\n;\n100\ng\n) for rolling\n2\nlarge\neggs\n1 1/2\ncups\nwhole roasted peanuts\n(\n5\nounces\n;\n140\ng\n)\nDirections\nPreheat oven to 350°F (180°C). Adjust oven racks to upper-middle and lower-middle positions. Line 2 baking sheets with parchment paper. In a large bowl, whisk together flour, baking soda, baking powder, and salt.\nIn a stand mixer fitted with the paddle attachment, beat butter at medium-high speed until creamy, about 2 minutes. Add peanut butter and beat until well combined, about 1 minute. Add light brown sugar and 3/4 cup granulated sugar and beat for 3 minutes. Add eggs, one at a time, beating until incorporated after each addition. Lower mixer speed to low and add flour in 2 parts, scraping down the bottom and side of the bowl with a rubber spatula after each addition. Add peanuts and mix just until evenly distributed.\nPour remaining 1/2 cup sugar into a small bowl. Scoop the dough with a 1-ounce (2-tablespoon) ice cream scoop and roll each scoop into a smooth ball. (If the dough is too soft to handle, refrigerate for 10 to 15 minutes.) Roll each ball in sugar to coat lightly. Place sugared balls on prepared baking sheets, leaving about 1 1/2 inches between them. You will have dough left over after filling up the 2 baking sheets; keep it refrigerated.\nSerious Eats / Vicky Wasik\nPress down on each ball twice with the tines of a fork, making a crisscross pattern.\nSerious Eats / Vicky Wasik\nBake cookies until golden brown and starting to crisp at the edges, 12 to 14 minutes, rotating pans front to back and top to bottom halfway through baking. Transfer baking sheets to cooling racks and let cookies cool on sheets for 3 minutes, then, transfer cookies directly to cooling racks. Cool completely. When baking sheets have cooled completely, repeat steps 3, 4, and 5 with remaining cookie dough. Store cookies in an airtight container or zipper-lock bag at room temperature for up to 5 days.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nrimmed baking sheets\n,\nwire racks\nRead More\nThe Serious Eats Guide to Cookie Styles\nChewy Peanut Butter Chocolate Chip Cookies\nPeanut Butter Oat Cookies\nPeanut Butter Coconut Cookies\nPolvorones de Cacahuate (Mexican Peanut Shortbread Cookies)\nCookies\nPeanut Butter\nChristmas Cookies"
}