{
  "url": "https://www.seriouseats.com/somali-sambusas-fried-pockets-stuffed-with-spiced-beef-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uH7bd29axQMkAPNawGQG65znndk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110322-143436-somali-sambusas-d43b62f93e53409b9575031baf8ad00b.jpg",
  "tags": [
    "African",
    "East African",
    "Frying",
    "Ground Beef"
  ],
  "title": "Somali Sambusas Recipe | Cook the Book",
  "full_text": "Somali Sambusas Recipe | Cook the Book\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nCooling Time\n10 mins\nTotal\n55 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nVegetable oil\n1\nmedium\nonion\n, finely chopped\n1/2\npound\n85% lean ground beef\n2\ntablespoons\ndried parsley\n1\nteaspoon\ncurry powder\n, plus more to taste\n1\ngarlic\nclove\n, minced\n1\nteaspoon\nkosher salt\n1/2\nteaspoon\nfreshly\nground black pepper\n1\npackage\negg roll wrappers\nWater\n, for sealing\nDirections\nIn a large skillet, heat 1 tablespoon oil over medium heat. Add the onion and cook about 4 minutes, stirring occasionally, until soft. Stir in the beef, parsley, curry powder, garlic, salt, and pepper, and cook about 5 minutes, stirring to break up lumps, until the meat is no longer pink. Taste and add more curry powder if you want. Transfer the meat mixture to a medium bowl and cool to room temperature. Wipe out the skillet.\nLine a baking sheet with parchment paper. Cut each egg roll wrapper in half diagonally. Working with one triangle at a time, lightly brush the edges of the wrapper with water. Fold the long side of the triangle in half, pinching the edge to seal and form a little cup.\nPlace a generous tablespoon of the meat mixture into the cup, then pull the open flap of the wrapper over the cup, pressing to seal. As each sambusa is finished, place it on the baking sheet. When the sheet is full, cover the sambusas with another piece of parchment paper and continue layering with finished sambusas.\nLine a platter with several layers of paper towels. In the skillet, heat about 1 inch of oil until a deep-frying thermometer reads 365°F to 375°F, or a pinch of flour bubbles and sizzles in the oil. Add half of the sambusas to the oil and cook for 2 to 4 minutes, turning once, until golden brown on both sides. using tongs or a skimmer, transfer the sambusas to the paper-towel-lined platter to drain briefly. Repeat with the remaining sambusas. Serve.\nAfrican\nEast African\nFrying\nGround Beef",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/somali-sambusas-recipe-cook-the-book.webp?"
}