{
  "url": "https://www.seriouseats.com/sonoran-hot-dogs-recipe-8672996",
  "image_url": "https://www.seriouseats.com/thmb/T8nK_afq3JeGFArDCPfaRw_X3Jk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240702-Sonoran-Hot-Dogs-JackieAlpers-hero-c79321d993f743ffad19f0eca65ee671.jpg",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Southwestern & Tex Mex",
    "Sausages"
  ],
  "title": "Sonoran Hot Dog Recipe",
  "full_text": "Sonoran Hot Dog Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nTotal\n60 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Toppings:\n6\njalapeño\nchiles\n(8 ounces; 225g), washed, stemmed, and coarsely chopped\n1/4\nteaspoon\nkosher salt\n; for table salt use half as much by volume\nYellow\nmustard\nMayo\nnna\nise\n2\ntablespoons\nunsalted butter,\ndivided\n2 cups (16 ounces;\n454\ng)\ndiced white onion\n, divided\n1\ncup\n(8 ounces; 227g),\ncanned pinto beans\n(from one 15.5-ounce can beans), drained and rinsed\nFor the Stuffed Bacon-Wrapped Chiles and Hot Dogs:\n6\ny\nellow Güero\n(Caribe)\nchiles\nor banana peppers or Hungarian wax peppers, washed and stems retained\n2\nounces\n(57g) Oaxaca or mozzarella\nstring cheese\n, pulled into long shreds\n12\nto 18\nstrips\nuncooked thin-sliced\nbacon\n, any variety, divided\n6\nskinless\nhot dogs\n,\nany variety\nFor Assembling:\n1\ntablespoon\nbutter\n6\nbolillo-style\nhot dog buns\n( see notes)\n8 ounces tomatoes,\ndiced\n(about\n1\ncup)\n, squeezed to remove excess moisture\nDirections\nFor preparing the toppings:\nIn a blender, blend the jalapeños and salt on high power, scraping down the sides of the bowl as needed, into a smooth purée, about 1 minute. If needed, add water, 1 tablespoon at a time, to help the chiles catch the blade to blend fully. Transfer to a small bowl or squeeze bottle; set aside. Transfer the yellow mustard and mayonnaise to squeeze bottles if not already packaged in them. Set aside ¾ cup raw diced white onion. Refrigerate until ready to use.\nSerious Eats / Jackie Alpers\nIn a 12 inch cast-iron skillet, melt 2 tablespoons butter over medium heat. Once melted, cook 1 1/2 cup onion, stirring frequently, until softened and starting to brown, 5 to 7 minutes. Stir in pinto beans and cook until warmed through, 1 to 2 minutes. Cover and keep warm until ready to use.\nSerious Eats / Jackie Alpers\nFor the stuffed bacon-wrapped chiles and hot dogs:\nUsing a paring knife, leave stem intact, and cut slit lengthwise down 1 side of each chile. Gently pry open chiles, remove seeds if desired, and stuff each chile with pieces of Oaxaca or string cheese. Wrap each stuffed chile with 1 strip of bacon, spiraling from end to end, and overlapping slightly to cover the chile, and making sure the ends of the bacon slices are opposite the cut opening of the chile.\nSerious Eats / Jackie Alpers\nWrap each hot dog with 1 strip bacon, spiraling from end to end, and stretching and overlapping slightly until hot dog is completely wrapped and bacon seams end up on same side. A second piece of bacon may be needed to adequately envelop the hot dog.\nSerious Eats / Jackie Alpers\nFor baking in the oven:\nAdjust the oven rack to middle position and preheat the oven to 400°F (190°C). Line a rimmed baking sheet with aluminum foil and set a wire rack into the prepared tray; set aside. Arrange the bacon-wrapped hot dogs and stuffed chiles bacon seam–side down on the prepared sheet tray and bake, flipping both hot dogs and chiles halfway through, until the bacon is well browned on both the hot dogs and the chiles, 25 to 35 minutes.\nSerious Eats / Jackie Alpers\nFor baking in the air fryer:\nPreheat a 6-quart air fryer to 375°F (205ºC) for 5 minutes. Working in batches, carefully transfer the bacon-wrapped hot dogs and stuffed chiles into the preheated air fryer basket, bacon seam–side down, leaving 1/2-inch space between each one. Place basket in preheated air fryer and cook until bacon is well browned, flipping halfway through, 10 to 12 minutes. Transfer to a rimmed baking sheet and hold warm in a 200℉ oven while air frying the remaining hots dogs and chiles.\nFor Assembling:\nUsing a serrated paring knife, split each roll vertically down the side, leaving about 1/4-inch uncut at either end and without piercing the bottom of the bun and gently pry open, forming a bun “boat.” In a 10-12” cast-iron skillet or double burner griddle, melt 1 tablespoon butter over medium heat. Working in batches, toast the buns until well browned on all sides, 2 to 5 minutes. Transfer to a platter and let cool slightly, about 3 minutes, then spoon 2 to 3 tablespoons of cooked onion and bean mixture down the center of each cut bun.\nSerious Eats / Jackie Alpers\nNestle a hot dog into each bun, then top with 1 tablespoon of the remaining raw chopped onion and 2 tablespoons diced tomatoes. Spoon or squirt a stripe of the prepared jalapeño sauce and yellow mustard vertically down the middle. Squirt a zigzag of mayonnaise down the length of each hot dog. Serve immediately with a grilled bacon-wrapped chile on the side.\nSerious Eats / Jackie Alpers\nSpecial Equipment\nBlender, 1-3\nfood-safe squeeze bottles\n, 6-quart capacity\nAir fryer\nor 1 rimmed baking sheet lined fitted with a wire baking rack, One 12” cast-iron skillet or double burner griddle\nNotes\nLook for bolillos in well-stocked supermarkets or Latin American bakeries; if you can't find them, substitute brioche hot dog buns.\nMake-Ahead and Storage\nThe jalapeño sauce and uncooked wrapped hot dogs/chiles can be prepared in advance and stored in airtight containers in the refrigerator for up to 3 days before cooking.\nSandwiches\nThe Latest\nSouthwestern & Tex Mex\nSausages",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sonoran-hot-dog-recipe.webp?"
}