{
  "url": "https://www.seriouseats.com/sopa-de-albondiga-colombian-meatball-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/pw69W_qDEVgGDEkeel3u4VqLAyI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__01__20150108-sopa-de-albondigas-colombian-meatball-soup-potatoes-18-7fa3343ded8448908e05a229b6a74b89.jpg",
  "tags": [
    "Soups",
    "Colombian",
    "Stovetop",
    "Ground Beef",
    "Quick Dinners"
  ],
  "title": "Sopa de Albóndigas (Colombian-Style Meatball Soup) Recipe",
  "full_text": "Sopa de Albóndigas (Colombian-Style Meatball Soup) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n45 mins\nTotal\n60 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmall bunch\ncilantro\n, divided\n1 1/2\nquarts\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\ntablespoons\nWorcestershire sauce\n, plus more to taste\nKosher salt\n1\ntablespoon\nextra-virgin olive oil\n1/2\nsmall\nonion\n, finely chopped\n1\nRoma tomato\n, finely chopped\n1\nlarge\nrusset potato\n(about\n8\nounces\n), peeled and cut into thin matchsticks with a mandoline\n2\ncups\nvegetable\nor\ncanola oil\n2\nslices\nwhite bread\n, crusts removed, roughly torn (about\n1\nounce\n)\n1\nlarge\negg\n2\ntablespoons\nheavy cream\n3/4\npound\nground beef chuck\n2\ntablespoons\nchopped capers\nDirections\nPick 1/2 cup cilantro leaves and set aside. Combine broth, remaining cilantro stems and leaves, and Worcestershire sauce in a large saucepan and bring to a boil. Season to taste with salt and more Worcestershire sauce. Reduce heat to lowest setting, cover, and keep warm.\nHeat olive oil over medium heat in a small saucepan. Add onion and cook, stirring, until softened but not browned, about 5 minutes. Add tomato, cover with water, bring to a simmer and cook, stirring occasionally, until completely soft and reduced to a thick purée, about 10 minutes. Season to taste with salt. Transfer to a wide, shallow bowl and place in refrigerator.\nRinse sliced potatoes under cold running water until liquid runs clear. Transfer to a kitchen towel or paper towels and dry thoroughly. Heat vegetable oil in a medium saucepan over high heat until shimmering. Add half of potato sticks and cook, stirring, until crisp but not darkly browned, about 5 minutes. Transfer to a paper towel-lined bowl with a wire mesh spider and season with salt. Repeat with second batch of potatoes.\nCombine bread, egg, and heavy cream in the bowl of a food processor. Process until a smooth paste is formed, about 30 seconds. Add beef, capers, and a 1 1/2 teaspoons of kosher salt and process until completely smooth and homogenous, about 2 minutes. Add onion and tomato mixture and process until smooth, about 30 seconds longer. With wet hands, form mixture into 3/4-inch balls (you should have about 24 balls).\nRemove cilantro from pot of stock and discard. Add meatballs and cook until they float and a meatball cut in half is no longer pink in the center, about 4 minutes. Use a slotted spoon or wire mesh spider to transfer meatballs to a bowl. Skim fat from top of soup and pour soup through a fine mesh strainer into a clean pot. Serve immediately, dividing meatballs between warmed serving bowls, ladling soup on top, topping with fried potatoes and remaining picked cilantro leaves.\nSpecial equipment\nfood processor\n,\nmandoline\nThis Recipe Appears In\nHow to Make Colombian-Style Sopa de Albóndigas (Meatball Soup)\nSoups\nColombian\nStovetop\nGround Beef\nQuick Dinners"
}