{
  "url": "https://www.seriouseats.com/sopa-de-albondigas-de-pollo-chicken-meatball-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/_hcaveZbT8j73dRfs-sydZ6xUww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/sopa-de-albondigas-de-pollo-chicken-meatball-soup-photo-10-Fred-Hardy-09-de882d8c9cea4d40a2a4f3bbdf6436fa.JPG",
  "tags": [
    "Soups",
    "Central American",
    "Stovetop Chicken",
    "Chicken Mains"
  ],
  "title": "Sopa de Albóndigas de Pollo (Nicaraguan Chicken Meatball Soup)",
  "full_text": "Sopa de Albóndigas de Pollo (Nicaraguan Chicken Meatball Soup)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n50 mins\nActive\n60 mins\nCooling Time\n15 mins\nTotal\n80 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken Soup:\n1\n(\n4-pound\n;\n1.8\nkg\n)\nchicken\n,\ncut into\n8\npieces\n(backbone reserved)\n1\nmedium\nyellow onion\n(\n8 ounces\n;\n227 g\n), peeled and quartered\n1\nmedium\ngreen bell pepper\n(\n7 ounces\n;\n198 g\n), stemmed, seeded, and quartered\n5\nmedium\ngarlic\ncloves\n, peeled and smashed\n1\nsour orange\n, split in half (see notes)\n1/2\ncup\npacked\nculantro\n(\n3/4\nounce\n;\n21\ng\n; see notes)\n1/4\ncup\npacked fresh\nmint leaves\n3\nquarts\n(\n3\nL\n) cold\nwater\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or same weight\n2\nteaspoons\nwhole\nblack peppercorns\nFor the Chicken Meatballs:\n1\nmedium\nyellow onion\n(\n8 ounces\n;\n227 g\n), coarsely chopped (about\n1 3/4\ncups\n)\n1/2\nstemmed and seeded\nmedium\ngreen bell pepper\n, coarsely chopped (about\n3/4\ncup\n)\n4\nmedium\ngarlic\ncloves\n, peeled\n2\nteaspoons\nachiote paste\nor powdered annatto\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n2\ncups\ncorn masa mix (\n8\nounces\n;\n227\ng\n), such as\nMaseca\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by weight\n1/2\ncup\nculantro\n(\n3/4\nounce\n;\n21\ng\n), finely chopped (see notes)\n1/4\ncup\nfresh\nmint leaves\n, finely chopped\n2\ntablespoons\n(\n30\nml\n) sour\norange juice\n(see notes)\nFresh herbs,\nsuch as torn culantro, cilantro, and/or mint, for ganish\nDirections\nFor the Chicken Soup:\nPlace chicken pieces and backbone in large Dutch oven or large soup pot. Add onion, pepper, garlic, sour orange, culantro, and mint. Cover with water; stir in salt and black pepper. Bring to a boil over high heat. Reduce heat to medium and simmer, skimming surface occasionally, until chicken is cooked through, about 15 minutes. Using a slotted spoon, transfer chicken pieces to large plate. When cool enough to handle, use paper towels to remove chicken skin; discard. Shred chicken finely. Strain broth into a large bowl. Discard solids and return broth to Dutch oven.\nSerious Eats / Fred Hardy\nFor the Chicken Meatballs:\nIn the bowl of a food processor, pulse onion, bell pepper, and garlic cloves until mixture is a fine paste, 15 to 20 one-second pulses. In a large skillet, melt butter over medium heat. Add onion mixture and annatto and cook, stirring occasionally, until most of the liquid has evaporated and mixture has cooked down into a thick paste, 5 to 7 minutes. Transfer to a large bowl.\nSerious Eats / Fred Hardy\nAdd corn masa mix, 1 teaspoon salt, 1 1/2 cups (355ml) strained broth, culantro, mint, sour orange juice, and half the shredded chicken. Stir until thoroughly combined. To test seasoning, form a single 1/2-inch ball of dough. Bring broth to simmer over medium-low heat. Cook dumpling until it floats to surface, 4 to 5 minutes. Taste and add additional salt to masa mixture if needed.\nSerious Eats / Fred Hardy\nUsing lightly oiled hands, shape dough into 1 1/2–inch balls (you should have about 30). Working in 2 batches, add shaped meatballs to simmering broth. Cook until meatballs float to surface, about 8 minutes. Transfer cooked meatballs to a plate, then repeat with remaining meatballs, setting all cooked meatballs on plate as they are ready. Add remaining shredded chicken to broth to heat through, about 1 minute. If serving immediately, divide meatballs between bowls (about 4 meatballs per bowl) and ladle broth over. Serve, garnished with herbs.\nSerious Eats / Fred Hardy\nSpecial Equipment\nDutch oven or large soup pot, strainer, slotted spoon, paper towels, food processor\nNotes\nIf you can't find sour oranges, substitute with 2 tablespoons orange juice and 1 tablespoon lime juice when making the broth. For the meatball portion, substitute sour orange juice with 1 tablespoon orange juice and 2 teaspoons lime juice.\nCulantro\nis an herb commonly used in Latin America and the Caribbean—it is sometimes referred to as serrated coriander and is available in some Latin American markets. Its flavor is similar to cilantro, but much more pungent. If you can't find it, substitute with cilantro leaves and tender stems.\nMake Ahead and Storage\nIf preparing ahead or storing leftovers, combine meatballs and broth into one container to prevent meatballs from drying out; cover and refrigerate up to 1 day.\nSoups\nCentral American\nStovetop Chicken\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sopa-de-albndigas-de-pollo-nicaraguan-chicken-meatball-soup.webp?"
}