{
  "url": "https://www.seriouseats.com/sopa-de-lima-yucatan-mexican-lime-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/9lylUmOSkIlUH1_hNa6zTmenGl4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__05__20160505-sopa-de-lima-22-a78c408efb60416d8b6e36b45e3977fa.jpg",
  "tags": [
    "Turkey",
    "Mexican",
    "Braised & Stewed Chicken",
    "Chicken Breast",
    "Lime"
  ],
  "title": "Sopa de Lima (Yucatán-Style Lime Soup) Recipe",
  "full_text": "Sopa de Lima (Yucatán-Style Lime Soup) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nActive\n40 mins\nTotal\n60 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nwhole\nlimes\n, plus\n1\nmore\nlime\nfor garnish\n1\ngrapefruit\n1\nlarge\nwhite or\nyellow onion\n(about\n8 ounces\n;\n225 g\n), unpeeled\n1\npound\n(\n450\ng\n) bone-in, skin-on split chicken or\nturkey breasts\n(about\n1\nwhole\nchicken breast\nor\n1/2\nsmall\nturkey breast\n)\n8\nlarge\ncloves garlic\n, unpeeled, divided\n4\ndried Turkish bay leaves\n3\nwhole\ncloves\n1\n(3-inch) piece\ncinnamon stick\n, preferably Mexican canela\n5\nwhole\nallspice berries\n15\nwhole\nblack peppercorns\nLarge\npinch\ndried Mexican oregano\n1\nquart\n(\n960\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n2\nRoma tomatoes\n6\ntablespoons\n(\n90\nml\n)\nvegetable oil\n, divided\n1\nHungarian wax\npepper\n(or\n1\nsmall\ngreen bell pepper\n), finely minced\nKosher salt\n6\nsmall\ncorn tortillas\n, cut into strips\nSmall\nbunch\nfresh\ncilantro leaves\n, roughly chopped\nDirections\nUse a vegetable peeler to remove four 2-inch strips of lime zest and two 2-inch strips of grapefruit zest. Juice limes and grapefruit, setting aside 2 tablespoons of each juice. (Reserve remaining juice for another purpose.) Set aside zests and juice.\nFor the Broth:\nSplit onion in half from pole to pole and set one half aside. Place other half in a large saucepan. Add chicken or turkey, 4 garlic cloves, bay leaves, cloves, cinnamon, allspice, peppercorns, and oregano. Add chicken broth and top up with water until all ingredients are submerged. Heat over medium heat until gently simmering. Reduce heat until broth is steaming-hot, but not bubbling. Cook, turning chicken occasionally, until center of chicken registers 150°F (66°C) on an instant-read thermometer, about 30 minutes. Remove from heat.\nSerious Eats / J. Kenji López-Alt\nUsing tongs, carefully remove chicken from broth and transfer to a bowl. Strain broth through a fine-mesh strainer into a heatproof container and add lime zests and grapefruit zests. (There should be at least 1 quart of broth; if not, adjust with water.) Set aside to steep.\nMeanwhile, for the Sofrito:\nThread remaining 4 garlic cloves onto a metal skewer and roast over the direct heat of a gas flame, turning, until garlic is charred on all surfaces, about 3 minutes total. Set aside. Using tongs, roast tomatoes over the flame until their skins bubble and peel black, about 30 seconds. Alternatively, roast garlic in a dry skillet over medium-high heat, tossing constantly, until charred on most surfaces. Remove garlic and add tomatoes and roast, turning constantly, until blistered all over.\nSerious Eats / J. Kenji López-Alt\nPeel garlic and tomatoes and discard skins. Finely mince both. Finely mince remaining onion half. Heat 2 tablespoons (30ml) vegetable oil in a large saucepan over medium heat. Add garlic, tomatoes, pepper, and minced onion, season with a pinch of salt, and cook, stirring frequently, until sofrito is completely softened but not browned, about 10 minutes.\nRemove lime and grapefruit zests from broth and discard. Pour broth into pot with sofrito. Add reserved lime and grapefruit juice and season broth to taste with salt.\nFor the Tortilla Strips:\nCombine remaining 1/4 cup (60ml) oil and tortilla strips in a nonstick or cast iron skillet. Heat over medium heat, stirring and tossing frequently, until tortilla strips are mostly crisp all over, about 3 minutes. Transfer tortilla strips to a paper towel–lined plate to drain.\nSerious Eats / J. Kenji López-Alt\nTo Serve:\nShred chicken or turkey meat into bite-size strips with your fingers or two forks. Discard bones and skin. Divide meat evenly between serving bowls and top with hot broth. Add a small handful of tortilla strips and sprinkle with cilantro. Cut half of final lime into wheels and remaining half into wedges. Add lime wheels to soup and serve immediately with wedges on the side.\nSpecial Equipment\nInstant-read thermometer\n,\nfine-mesh strainer\n,\nmetal skewer\nRead More\nCold-Start Your Way to the Tenderest Poached Chicken\nReal-Deal Tortilla Soup Recipe\nTurkey\nMexican\nBraised & Stewed Chicken\nChicken Breast\nLime",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sopa-de-lima-yucatn-style-lime-soup-recipe.webp?"
}