{
  "url": "https://www.seriouseats.com/sopaipillas-chilean-fried-pastries-recipe-7974824",
  "image_url": "https://www.seriouseats.com/thmb/1tByg7GSt0b8bKSJSW9GLjFIJ_U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230927-SEA-Sopaipilla-EstudioComo-hero-43fc1046f98b454581773f6394f686a0.jpg",
  "tags": [
    "Pastries",
    "The Latest",
    "Frying",
    "South American Cuisines"
  ],
  "title": "Sopaipillas (Chilean Fried Pastries)",
  "full_text": "Sopaipillas (Chilean Fried Pastries)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n90 mins\nResting Time\n40 mins\nTotal\n2 hrs 45 mins\nServes\n6\nto 8\nMakes\n26 each\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sopaipilla Dough:\n1 medium butternut squash, (about 2 pounds; 900g), halved lengthwise and seeded 2 teaspoons (10ml) vegetable or other neutral oil\n3 1/2 cups (1 pound; 455g) all-purpose flour\n2 1/4 teaspoons(10g) baking powder\n1 tablespoon (10g) Diamond Crystal kosher salt; if using table salt, use half as much by volume\n3 ounces (85g) vegetable shortening, melted and warm\n3 to 6 tablespoons (45-90ml) warm water\n2 quarts (2L) vegetable or other neutral oil, for frying\nFor Sopaipillas Pasadas (Sweet Sopaipillas):\n14 ounces (400g) chancaca, panela, or piloncillo (see notes)\n1 1/2 ounces (45g) granulated sugar\nFour 2-inch pieces (5g) orange peel\n4 to 5 sticks (5g) whole Mexican cinnamon (Ceylon)\n2 cloves\n1 1/2 ounces (45g) cornstarch stirred into 1 1/2 fluid ounces (45ml) water to form a slurry\nFor Sopaipillas with Pebre:\n4 medium ripe tomatoes (about 18 ounces; 510g), peeled, seeded, and finely diced (see notes)\n1 small white onion (about 4 ounces; 115g), finely diced\n1 medium fresh ají cristal hot pepper (or any other spicy and citrusy yellow hot pepper such as lemon drop or hot yellow banana peppers), deveined, seeded, and finely diced\n1/4 packed cup finely chopped fresh cilantro leaves and tender stems\n1 small clove garlic, finely diced\n1/4 cup (60ml) extra-virgin olive oil\n2 tablespoons (30ml) Chilean hot sauce, such as\nají pebre\n, or any other mild hot sauce, such as sriracha\n2 tablespoons (30ml) white wine vinegar or apple cider vinegar\n1/4 teaspoon\nmerken\n(optional, see notes)\nSalt, to taste\nDirections\nFor the Sopaipilla Dough:\nAdjust oven rack to middle position and preheat oven to 400°F (205°C).\nOn a rimmed baking sheet, brush butternut squash with oil and place cut side down on baking sheet. Roast, flipping squash to cut side up halfway through, until tender and golden brown at edges, about 45 minutes. Let cool slightly, about 5 minutes.\nSerious Eats / Estudio Como\nScoop 8 ounces cooked squash flesh and transfer to a food processor, high powered blender, or immersion blender jar. Save remaining roasted squash for another use. Process squash, scraping down sides of processor bowl as needed, until completely smooth, about 2 minutes.\nSerious Eats / Estudio Como\nIn a large bowl, whisk flour, baking powder, and salt until combined. Using a wooden spoon, stir in squash puree and melted shortening until combined and some lumps form.\nSerious Eats / Estudio Como\nStir in warm water, 1 tablespoon at a time, until a rough ball forms (total added water may range from 3 to 6 tablespoons).\nSerious Eats / Estudio Como\nTransfer dough to a clean work surface and gently knead by hand until dough feels smooth but still firm, 1 to 2 minutes; do not over-knead the dough. Wrap in plastic wrap and let rest on counter for 15 minutes.\nSerious Eats / Estudio Como\nUnwrap and transfer sopaipilla dough to a lightly floured work surface. Using a rolling pin, roll dough into a 16-inch circle, about 1/4-inch thick. Using a 3-inch round cutter, cut circles from the dough.Transfer dough rounds to a parchment-lined baking sheet. Dough scraps may be gathered together, rerolled to a 1/4-inch thickness, and cut into more rounds. You should have about 26 dough rounds total.\nSerious Eats / Estudio Como\nUsing a fork, prick each dough round three times (making sure to poke all the way through the dough as this reduces dough from puffing too much while frying).\nSerious Eats / Estudio Como\nSet wire rack in a rimmed baking sheet. Line rack with a double layer of paper towels. In a large Dutch oven, heat oil over medium-high heat to 350°F (175°C). Gently place 5 sopaipillas in hot oil. Cook, adjusting burner as necessary to maintain oil temperature around 350°F (175°C) degrees, until golden brown on undersides, about 2 minutes. Using a spider skimmer, gently flip sopaipillas and fry until second sides are browned, about 2 minutes. Transfer sopaipillas to prepared rack. Return oil to 350°F and repeat with remaining sopaipillas in batches of 5 at a time.\nSerious Eats / Estudio Como\nFor Sopaipillas Pasadas:\nIn a large pot, stir together chancaca, granulated sugar, orange peels, cinnamon sticks, cloves and 1 1/2 quarts (1.4L) water. Bring to a boil over high heat, then reduce heat to low and simmer, stirring occasionally, until chancaca is dissolved.\nSerious Eats / Estudio Como\nWhisk cornstarch slurry to remix. Return syrup to a boil over high heat and pour cornstarch slurry into boiling syrup while whisking. Simmer, stirring occasionally, until thickened, about 2 minutes. Remove from heat.\nSerious Eats / Estudio Como\nTransfer fried sopaipillas to the hot syrup. Soak sopaipillas until softened to desired consistency, 15 to 90 minutes (see notes). Return to a simmer before serving in individual bowls. Serve 2 to 4 sopaipillas per person with additional hot syrup ladled over top.\nSerious Eats / Estudio Como\nFor\nSopaipillas with Pebre:\nIn a medium bowl, stir together all the pebre ingredients and season with salt to taste. Let stand at room temperature until flavors meld and vegetables begin to soften, about 20 minutes.\nServe pebre alongside freshly fried and crispy sopaipillas.\nSerious Eats / Estudio Como\nSpecial Equipment\nRolling pin, 3-inch round cutter (any cookie cutter, pasta cutter, or sturdy drinking glass ranging in size from 2 1/2 to 4 1/2 inches will work in this recipe), spider skimmer, Dutch oven\nNotes\nChancaca is made from raw sugar and molasses from sugar beets, whereas panela and piloncillo are made from just raw cane sugar. While all 3 are very close in flavor, chancaca is much darker in color.\nFor the sopaipillas pasadas, the final soaking time in Step 12 is a large range to reflect personal preference of how softened you choose the fried pastry to be. Some prefer their sopaipillas lightly soaked, while others will soak them overnight, until the sopaipillas almost dissolve into the syrup. Find your own preferred level.\nIf you can’t find good tomatoes in the middle of the winter, do as we do in Chile and replace tomatoes with diced green onions or leeks: a perfect pebre de invierno\n.\nMerken is a smoky, spicy seasoning made by the indigenous Mapuche people in central-southern Chile. If unable to find, just omit from the recipe.\nMake-Ahead and Storage\nDough can be made up to 4 hours ahead, covered with plastic wrap, and kept at room temperature until ready to use. Alternatively, dough can be wrapped in plastic and refrigerated for up to 2 days. Bring dough to room temperature before shaping.\nCut sopaipilla dough rounds can be frozen while still raw, then stored flat in freezer bags or containers, separated by parchment paper. Thaw completely before frying.\nSyrup can be cooked through step 10 and refrigerated in an airtight container for up to 1 week. When ready to use, bring to a simmer in a large pot and continue with the cornstarch slurry in Step 11.\nPebre can be refrigerated in an airtight container for up to 1 day.\nPastries\nThe Latest\nFrying\nSouth American Cuisines",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sopaipillas-chilean-fried-pastries.webp?"
}