{
  "url": "https://www.seriouseats.com/sorrentinos-recipe-7486450",
  "image_url": "https://www.seriouseats.com/thmb/tiTEJEaMnEt_S3RlaoR6yTOHHGE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230428-SEA-Sorrentinos-KevinVaughn-hero-53a2c46c7b594cf59c6ae12b9014194e.jpg",
  "tags": [
    "South American",
    "The Latest",
    "Pastas",
    "Vegetarian",
    "Mushrooms"
  ],
  "title": "Sorrentinos",
  "full_text": "Sorrentinos\nClose\nJump to recipe\nPrep\n45 mins\nCook\n70 mins\nResting Time\n2 hrs\nTotal\n3 hrs 55 mins\nServes\n2\nto 3\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pasta Dough:\n140\ng\n(\n3/4\ncup\n;\n5\nounces\n)\nsemolina\n, plus more for dusting\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table or fine sea salt, use half as much by volume\n3\nlarge\negg yolks\n25\nml\n(\n1\ntablespoon\nplus\n2\nteaspoons\n) room-temperature\nwater\nFor the Filling:\n14\nounces\n(\n400\ng\n) king\noyster mushrooms\n, cut into 1/4-inch cubes\n1/2\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n2\nteaspoons\n(\n10\nml\n)\ntoasted sesame oil\n6\nsprigs\nthyme\n, leaves picked and minced\n4\nsprigs\nsage\n, leaves picked and minced\n2\nsprigs\nrosemary\n, stems discarded and needles minced\n1\nteaspoon\nSpanish\npaprika\nKosher salt\n4\nlarge\nleeks\n(about\n10 ounces\n;\n280 g\neach), washed well of any sand or grit, white part finely diced, green parts reserved for another use\n8\nounces\n(\n227\ng\n) low-moisture\nmozzarella\n, shredded\n3 1/2\nounces\n(\n100\ng\n)\nParmigiano-Reggiano\n, grated\n1/4\nteaspoon\nred pepper flakes\n1/4\nteaspoon\ngrated\nnutmeg\nFor the Sauce:\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n4\nmedium\ncloves garlic\n, minced\n3\nsprigs\nfresh\nrosemary\n, bent in half and tied together with kitchen twine\n1\n(\n14-ounce\n;\n397 g) can\nwhole\npeeled tomatoes\nwith their juices, crushed by hand\n1 1/2\ncups\n(\n355\nml\n)\nheavy cream\nDirections\nFor the Pasta Dough:\nIn a large bowl, combine semolina and salt. Form a well in the center about 4 inches wide. Pour egg yolks into well and, using a fork, beat thoroughly, then gradually begin incorporating the semolina into the eggs until a moist crumble forms. Gradually add water while using your hands to combine until a uniform, soft dough is formed. Wrap in plastic and let rest at room temperature for 1 hour 30 minutes.\nSerious Eats / Kevin Vaughn\nUnwrap dough and set on a semolina-floured work surface. Using a semolina-floured rolling pin, flatten dough into an oblong shape about 1/2 inch thick. Set pasta maker to widest setting and pass dough through. Place the sheet of dough on a lightly floured work surface. Fold both ends in so that they meet at the center of the dough, and then fold the dough in half where the end points meet, trying not to incorporate too much air into the folds. Using the rolling pin, flatten dough to 1/2 inch thick. Pass the dough through the pasta rollers at the widest setting, then repeat the process 12 more times, dusting with semolina, as necessary—after roughly 6 passes through the rollers, dusting with more semolina will not be necessary.\nSerious Eats / Kevin Vaughn\nNarrow the setting by 1 notch and pass dough through, then run it through again. Continue passing the dough through the rollers, reducing the thickness by 1 setting each time until the pasta sheet is about 1mm thick (this is the third-to-last setting on many pasta rollers, but may not be the same on all). The dough should be elastic and slightly translucent but durable. Transfer dough to a large zipper-lock bag, gently folding to fit, and let rest 30 minutes.\nSerious Eats / Kevin Vaughn\nRemove dough from bag, unfold, and cut in half. Return one dough sheet to zipper-lock bag. Spread other dough sheet on a clean work surface, and, using a 3.5-inch round cookie cutter, cut out as many dough rounds as possible. Repeat with other sheet of dough. Transfer pasta rounds to zipper-lock bag to prevent from drying and set aside. (You should have 24 rounds of pasta; if you don't, if you don't, re-roll dough scraps and cut more circles.)\nSerious Eats / Kevin Vaughn\nFor the Filling:\nWhile the dough is resting in Step 1, make the filling. Combine king oyster mushrooms, olive oil, sesame oil, thyme, sage, rosemary, and Spanish paprika in a medium mixing bowl and, using your hands, toss until evenly coated. Cover and let stand 20 minutes.\nSerious Eats / Kevin Vaughn\nHeat a 12-inch cast iron or stainless-steel skillet over medium-high heat until almost smoking. Add mushrooms and their marinade along with a large pinch of salt and cook, stirring frequently with a wooden spoon, until moisture has evaporated and mushrooms are deeply browned, about 12 minutes.\nSerious Eats / Kevin Vaughn\nStir in leeks along with a pinch of salt, and cook, stirring occasionally, until leeks are translucent, about 8 minutes. Transfer mushrooms and leeks to a large bowl and stir in mozzarella, Parmigiano-Reggiano, red pepper flakes, and nutmeg. Cover and refrigerate until ready to use.\nSerious Eats / Kevin Vaughn\nFor the Sauce:\nIn a medium saucepan, heat olive oil and garlic over medium heat, stirring constantly, until very lightly golden, about 30 seconds. Add rosemary and cook until fragrant, about 30 seconds. Add tomato passata, increase heat to medium-high, and bring mixture to a simmer. Reduce heat to medium-low and cook, stirring occasionally, until tomato sauce has reduced and thickened into a chunky salsa, about 20 minutes. Stir in cream, bring to a gentle simmer, then turn off heat. Discard rosemary sprigs and set sauce aside.\nSerious Eats / Kevin Vaughn\nTo Form and Cook:\nDust a rimmed baking sheet with a thin coating of semolina flour and set aside. Form filling mixture into roughly 2-tablespoon balls (slightly larger than a golf ball), then press into a puck shape. Transfer filling pucks to a separate baking sheet or platter.\nSerious Eats / Kevin Vaughn\nArrange 12 pasta rounds on a clean work surface. Set a filling puck in the center of each round. Using a finger moistened with water, very lightly wet the edge of each pasta round, then top with the remaining pasta rounds. Slowly working your way around each sorrentino, press and stretch the top dough rounds to make the edges meet with bottom dough rounds. Press down gently on each filling to remove air bubbles, then press edges to seal. Place on floured baking sheet.\nSerious Eats / Kevin Vaughn\nPreheat oven to 400°F (200°C). Bring a large pot of salted water to a boil over high heat. Spoon 1/2 cup of sauce into a large casserole dish, spreading in an even layer.\nSerious Eats / Kevin Vaughn\nAdd sorrentinos to boiling water, stirring gently with a slotted spoon to prevent sticking. Cook until sorrentinos float to the surface, about 1 to 1 1/2 minutes. Using the slotted spoon, transfer sorrentinos to casserole dish, then spoon remaining sauce on top. Bake until sauce reduces slightly and begins to brown around the edges, 10-20 minutes. Serve immediately.\nSerious Eats / Kevin Vaughn\nSpecial Equipment\nKitchen scale, rolling pin, pasta roller, 3.5-inch round cookie cutter\nMake-Ahead and Storage\nSorrentinos freeze well. Lightly dust a tray with semolina or flour, add sorrentinos being sure that they are not touching one another, and freeze. Once frozen, transfer to a zipper-lock bag, pressing out air as you seal, and return to freezer.\nSouth American\nThe Latest\nPastas\nVegetarian\nMushrooms",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sorrentinos.webp?"
}