{
  "url": "https://www.seriouseats.com/soup-dumplings-xiao-long-bao-recipe",
  "image_url": "https://www.seriouseats.com/thmb/4sQ_PSwAk3NI3DiLwFkA0dESLIo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Soup_Dumplings_hero-AntonisAchilleos-4de81e0b74dd4e7690aea42918eb97ef.JPG",
  "tags": [
    "Chinese",
    "Chicken",
    "Pork",
    "Shrimp",
    "Snacks & Appetizers"
  ],
  "title": "Soup Dumplings (Xiao Long Bao) Recipe",
  "full_text": "Soup Dumplings (Xiao Long Bao) Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n3 hrs\nActive\n60 mins\nChilling and Resting Time\n8 hrs 30 mins\nTotal\n11 hrs 55 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n3\npounds\n(\n1.4\nkg\n)\nchicken backs\nor wings\n1/2\npound\n(\n8 ounces\n;\n225 g\n)\nChinese ham\nor slab bacon\n6\nscallions\n(\n4\nounces\n;\n115\ng\n), whites separated, greens roughly chopped\n1\n(\n1-inch) knob\nfresh\nginger\n(\n1/2\nounce\n;\n15\ng\n)\n1\ntablespoon\nwhite\npeppercorns\n10\ncups\n(\n2.4\nL\n)\nwater\nKosher salt\nFor the Filling:\n1/3\npound\n(\n150\ng\n)\nground pork\n1/4\npound\n(\n115\ng\n)\nraw shrimp\n, peeled\n2\nteaspoons\nsoy sauce\n1\ntablespoon\nShaoxing wine\n2\nteaspoons\nsugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt,\nplus more as needed; for table salt, use half as much by volume\nFor the Dough:\n2\ncups\n(\n9\nounces\n;\n255\ng\n)\nall-purpose flour\n1\ncup\n(\n235\nml\n) boiling\nwater\nFor Cooking:\nNapa cabbage leaves\nDirections\nCombine chicken bones, ham, scallion whites, half of scallion greens, ginger, and white peppercorns in a stockpot and cover with cold water. Bring to a boil over high heat, reduce to a simmer, and simmer, uncovered, for 2 1/2 hours. Line a fine-mesh strainer with cheesecloth, and set over a large heatproof bowl. Carefully pour bone broth through strainer into bowl until the liquid has been strained. Discard solids in strainer. Season to taste with salt, cover, and refrigerate until set into a semi-firm jelly, at least 8 hours. Scrape off the fat that sets on top of the chilled bone broth and discard.\nSerious Eats / Antonis Achilleos\nMeanwhile, combine pork, shrimp, soy sauce, wine, sugar, 1 teaspoon salt, and remaining scallion greens in a food processor. Process until a fine paste is formed, about 12 to 15 one-second pulses. Refrigerate until ready to use.\nSerious Eats / Antonis Achilleos\nMeanwhile, place flour in the bowl of a food processor. With machine running, slowly drizzle in water until a cohesive dough is formed (you probably won't need all the water). Allow dough to ride around processor for 30 seconds. Form into a ball using floured hands and transfer to a bowl. Cover with a damp towel and let rest for at least 30 minutes.\nSerious Eats / Antonis Achilleos\nWhen broth is gelled, transfer filling mixture to a bowl along with 1 1/2 cups of jellied broth (save the rest for another use). Beat or whisk it in until homogenous. Season with salt. Keep filling well chilled.\nSerious Eats / Antonis Achilleos\nDivide dough into 4 sections. Roll each section into a 6-inch long log. Cut each section into 10 equal pieces and roll each into a 10 gram ball, making 40 balls total. On a well-floured work surface, roll each ball into a round, flat wrapper, 3 1/2- to 4-inches in diameter. Using a roller, gradually roll the edges of the wrapper towards the center to create thinner edges and a thicker center. Stack wrappers and keep under plastic until all of them are rolled out.\nSerious Eats / Antonis Achilleos\nTo form dumplings, place 1 tablespoon of filling in the center of a wrapper. Moisten the edges of the wrapper with a wet fingertip or a pastry brush. Pleat edges of the wrapper repeatedly, pinching the edge closed after each pleat until the entire dumpling is sealed in a cinched purse shape. Pinch and twist top to seal. Transfer sealed dumplings to a lightly floured wooden or parchment-lined board.\nSerious Eats / Antonis Achilleos\nPlace a bamboo steamer over a wok with 2 inches of water. Place over medium-high heat until simmering. Line steamer with napa cabbage leaves and place dumplings directly on leaves. Steam until cooked through, 10 to 12  minutes. Serve immediately, being careful not to break them.\nSerious Eats / Antonis Achilleos\nSpecial Equipment\nFood processor\n, steamer insert or\nbamboo steamer\nRead More\nBeyond Potstickers: Around the World in Dumplings\n17 Recipes for a Homemade Dumpling Feast\nChinese Fried Pork and Cabbage Dumplings (Guo Tie) With Homemade Wrappers\nSerious Entertaining: A Dim Sum-Inspired Chinese Food Party\nChinese\nChicken\nPork\nShrimp\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/soup-dumplings-xiao-long-bao-recipe.webp?"
}