{
  "url": "https://www.seriouseats.com/sourdough-rye-crackers-with-coriander-and-fennel",
  "image_url": "https://www.seriouseats.com/thmb/cb42lL-2lnAad5VifYtJWx59XYQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__07__20200716-sourdough-discard-crackers-tim-chin2-335c335335734eb4927bd9940f75e0eb.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Sourdough Breads",
    "Rye"
  ],
  "title": "Sourdough Rye Crackers With Coriander and Fennel Recipe",
  "full_text": "Sourdough Rye Crackers With Coriander and Fennel Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n60 mins\nActive\n25 mins\nChilling and Cooling Time\n60 mins\nTotal\n2 hrs 15 mins\nServes\n48 servings\nMakes\n3 half-sheet pans of crackers\nCook Mode\n(Keep screen awake)\nIngredients\n3/4\ncup\n(\n3 3/4\nounces\n;\n105\ng\n)\nall-purpose flour\n3/4\ncup\n(\n3\nounces\n;\n85\ng\n)\nrye flour\n1/3\ncup\n(\n65\ng\n)\nsugar\n1 1/2\nteaspoons\n(\n6\ng\n)\nkosher salt\n1/2\ncup\nsourdough starter\n(\n4 1/4\nounces\n;\n120\ng\n)\n1/4\ncup\n(\n60\nml\n)\nsparkling white wine\n, such as Champagne or Cava (see note)\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n1\ntablespoon\nwhole coriander seeds\n, cracked\n1\ntablespoon whole\nfennel seeds\n, cracked\nFlaky sea salt\n, such as Maldon\nDirections\nIn a large bowl, whisk all-purpose flour, rye flour, sugar, and salt until combined, about 60 seconds. Using a silicone spatula, stir in starter, champagne, and olive oil until mixture is smooth and combined, 1 to 2 minutes. Using clean hand, gently knead dough and form into round ball. Cover dough with plastic wrap and refrigerate for 30 minutes or up to 2 days.\nAdjust oven rack to middle position and heat oven to 325°F (160°C). Remove dough from refrigerator. Divide dough into 3 equal portions. Working with one portion of dough at a time (keep other portions in the refrigerator), place dough between 2 sheets of parchment paper sized to fit rimmed half-sheet pan. Using rolling pin, roll dough until it fills dimensions of parchment and measures roughly less than 1/16th inch (1.5mm) in thickness.\nSerious Eats / Tim Chin\nSlide parchment with rolled dough onto rimmed half-sheet pan. Gently peel off top layer of parchment and reserve as bottom parchment layer of next batch. Sprinkle dough with coriander, fennel seeds, and flaky salt. Bake until deep golden brown and uniform in color, 16 to 20 minutes, rotating baking sheet halfway through baking. Let cool until crisp and no longer hot to touch. Gently peel off cracker sheet from parchment and break into large pieces. Discard used parchment.\nRepeat rolling and baking with remaining two portions of dough and additional parchment paper as needed. Crackers can be stored in airtight container at room temperature for up to 5 days.\nSpecial Equipment\nRimmed half-sheet pan\n, rolling pin, parchment paper\nNotes\nThe sparkling wine adds flavor and needed carbonation to the cracker dough; small single-serving cans of sparkling wine can be a good option here if you don't want to open a whole bottle. Sparkling cider can work as well.\nMake-Ahead and Storage\nCrackers can be stored in an air-tight container at room temperature for up to 5 days.\nRead More\nSourdough Starter\nThe Science of Sourdough Starters\nThe Best Flour for Sourdough Starters\nSnacks & Appetizers\nSourdough Breads\nRye",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sourdough-rye-crackers-with-coriander-and-fennel-recipe.webp?"
}