{
  "url": "https://www.seriouseats.com/sourdough-starter",
  "image_url": "https://www.seriouseats.com/thmb/fgjOLqNYDIYQmC1eSDssqP024TQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__05__20200512-sourdough-starter-5050rye-full-jar-tim-chin-0931479ce7464ad989fefcfb14654cf0.jpg",
  "tags": [
    "Yeast Breads"
  ],
  "title": "Sourdough Starter Recipe",
  "full_text": "Sourdough Starter Recipe\nClose\nJump to recipe\nPrep\n60 mins\nFermentation Time\n336 hrs\nTotal\n337 hrs\nCook Mode\n(Keep screen awake)\nIngredients\n600\ng\n(21 ounces)\nunbleached all-purpose\n, bread, or whole grain flour (such as whole wheat or rye flour), or a mix\n600\ng\nbottled, filtered, or de-chlorinated\nwater\nDirections\nNote: Since starters can develop at drastically different rates, it’s nearly impossible to offer a strict recipe. This is a rough outline of the process, based on testing and expert input (for another very detailed template for sourdough starters, check out\nKristen Dennis’s starter tutorial\n. Note that while this and the following steps list specific days on which feeding frequency and ratios change, you may need to make those changes on different days and in different ways, based on the observed activity of your starter, as described above in the sections on adjusting your starter schedule and ratio.\nDay 1, Morning:\nClean two 8-ounce glass jars (or other 8-ounce containers) with soap and hot water, rinsing well (if you want, you can also run the jars through the dishwasher or boil them in water for 1 minute to further sterilize them). Combine 10g (1/3 ounce) flour and 10g (1/3 ounce) water in one cleaned container, and, using a small rubber spatula, stir together until smooth. Cover loosely with lid and store between 70-80°F (21-27°C) for 48 hours. Alternatively, cover with cheesecloth by cutting a square large enough to cover container and secure with rubber band.\nDay 3, Morning:\nMeasure 10g (1/3 ounce) starter into a second clean container. Add 10g (1/3 ounce) flour and 10g (1/3 ounce) water, and stir together until smooth, for a feeding ratio of 1:1:1. Discard remaining starter; clean and, if desired, sterilize used container.\nDay 4, Morning:\nLook for signs of activity, noting height gain, texture, bubbles, or smells. Repeat Step 2.\nDay 4, Night:\nRepeat Step 2. You will be feeding twice a day at a ratio of 1:1:1.\nDays 5-7:\nRepeat Step 3 each day, feeding twice a day at 1:1:1 ratio (10g starter, 10g flour, 10g water).\nDay 8, Morning:\nMeasure 10g (1/3 ounce) starter into cleaned container. Stir in 10g (1/3 ounce) flour and 10g (1/3 ounce) water until smooth. Discard remaining starter; clean and, if desired, sterilize used container.\nDay 8, Night:\nMeasure 8g (1/4 ounce) starter into cleaned container. Stir in 16g (1/2 ounce) flour, and 16g (1/2 ounce) water until smooth, for a feeding ratio of 1:2:2. Discard remaining starter; clean and, if desired, sterilize used container.\nDay 9, Morning:\nMeasure 8g (1/4 ounce) starter into cleaned container. Stir in 16g (1/2 ounce) flour, and 16g (1/2 ounce) water until smooth, for a feeding ratio of 1:2:2. Discard remaining starter; clean and, if desired, sterilize used container.\nDay 9, Night:\nRepeat feeding. Discard remaining starter; clean and, if desired, sterilize used container. (If starter is rising and falling predictably and exhibits strong sour aroma, begin collecting discarded starter in a separate container and storing in the refrigerator to use in supplemental recipes that call for discarded sourdough starter.) You will be feeding twice per day at a ratio of 1:2:2.\nDays 10-12:\nContinue Step 6. Attach rubber band every night after feeding to mark the starting (low) level of starter so you can observe height gain the following morning.\nDay 13, Morning:\nMeasure 5g (1/8 ounce) starter into cleaned container. Stir in 15g (1/2 ounce) flour, and 15g (1/2 ounce) water until smooth, for a feeding ratio of 1:3:3 (or 1:4:4 if using ounces). Discard remaining starter; clean and, if desired, sterilize used container.\nDay 13, Night:\nRepeat feeding at 1:3:3 (or 1:4:4 if using ounces). Discard remaining starter; clean and, if desired, sterilize used container.\nDay 14 and beyond:\nRepeat Step 8. If starter triples in volume reliably in 12-hour period over several days, it has matured.\nSpecial Equipment\nTwo 8-ounce containers such as Ball or Weck glass jars;\nrubber or silicone mini spatula\n;\ndigital scale\n; rubber bands;\ncheesecloth (for covering jar tops; optional)\n; notebook (for tracking your progress; optional)\nMake-Ahead and Storage\nSee the maintenance section above for storage information.\nRead More\nThe Science of Sourdough Starters\nHow to Ferment Sourdough Properly\nHow to Make a Sourdough Bread Loaf Recipe\nWhat to do With Sourdough Discard\nYeast Breads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sourdough-starter-recipe.webp?"
}