{
  "url": "https://www.seriouseats.com/sour-cream-and-chive-biscuits-recipe-11707884",
  "image_url": "https://www.seriouseats.com/thmb/5nsJQORKBmb-RvmB9UG9P6F_vWU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250213-SEA-SourCreamandChiveBiscuits-JenCausey-Beauty1-28-a4914c3b0da749349609be0c33bb77a8.jpg",
  "tags": [
    "Baking",
    "The Latest",
    "Vegetarian",
    "Sour Cream",
    "Biscuits"
  ],
  "title": "Sour Cream and Chive Biscuits",
  "full_text": "Sour Cream and Chive Biscuits\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nChilling and Cooling Time\n15 mins\nTotal\n60 mins\nServes\n8\nMakes\n8 (2 1/2-inch) biscuits\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nall-purpose flour\n(\n226\ng\n; about\n1 3/4\ncups\n), plus more for dusting\n1\nounce\ncornstarch\n(\n28\ng\n;\n1/4\ncup\n)\n2 1/2\nteaspoons\n(\n11\ng\n)\ngranulated sugar\n1 1/2\nteaspoons\n(\n5\ng\n)\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1 1/2\nteaspoons\n(\n6\ng\n)\nbaking powder\n1/4\nteaspoon\nbaking soda\n1\nteaspoon\n(\n3\ng\n)\ngarlic powder\n(see notes)\n5\nounces\ncold\nunsalted butter\n(\n140\ng\n;\n10\ntablespoons\n), cut into 1/2-inch cubes\n1/2\nounce\nfinely chopped fresh\nchives\n(\n14\ng\n;\n1/4\ncup\n), see notes\n2 3/4\nounces\ncold\nsour cream\n(\n77\ng\n;\n1/3\ncup\n)\n2 3/4\nounces\ncold whole milk\n(\n77\ng\n;\n1/3\ncup\n)\n1\nlarge\negg\n, beaten\nSoftened\nbutter\n, for serving\nDirections\nAdjust oven rack to middle position, and preheat oven to 425°F (220ºC). Line a 13- by 18-inch rimmed baking sheet with parchment paper; set aside.\nIn a large bowl, whisk together flour, cornstarch, sugar, salt, baking powder, baking soda, and garlic powder. Using a pastry blender or two forks, cut in butter until mixture is crumbly and butter is pea-sized. Stir in chives until combined.\nSerious Eats / Jen Causey\nIn a small bowl, whisk sour cream and milk to combine. Stir sour cream mixture into flour mixture just until combined and dry ingredients are evenly moistened. Using clean hands, gently press and fold flour mixture in bowl until dough just holds together.\nSerious Eats / Jen Causey\nTurn out dough onto a clean, lightly floured surface; using your hands or a rolling pin, gently press or roll dough into a rough 9- by 5-inch rectangle. Fold rectangle into thirds like a business letter. (Dough may still be a bit crumbly at this point but will come together. If you are struggling to lift and fold the dough, use a bench scraper to help fold the dough.) Repeat process one more time, very lightly flouring surface or dough if needed; press or roll dough to 3/4-inch thickness.\nSerious Eats / Jen Causey\nUsing a floured 2 1/2-inch round cutter, cut dough into 8 biscuits, rerolling and cutting scraps once, if needed; very lightly flour surface or top of dough only if needed to prevent sticking. Arrange biscuits on prepared baking sheet, spacing them at least 1 inch apart. Freeze, uncovered, until firm, 10 minutes. (If your freezer is too small for a 13- by 18-inch rimmed baking sheet, you can chill dough on parchment-lined plates, then transfer to prepared baking sheet once biscuits are firm.)\nSerious Eats / Jen Causey\nBrush tops of chilled dough with egg. Bake until tops are golden brown and biscuits are cooked through, 15 to 17 minutes. Set baking sheet on a wire rack, and let cool for 5 minutes. Serve warm with softened butter.\nSerious Eats / Jen Causey\nSpecial Equipment\n13- by 18-inch rimmed baking sheet, parchment paper, whisk, rolling pin, bench scraper, 2 1/2-inch round cutter, pastry brush, wire rack\nNotes\nOnion powder can be used in place of garlic powder, if desired.\nMake-Ahead and Storage\nThese biscuits are enjoyed fresh. Once cooled, leftovers can be stored in an airtight container at room temperature for up to 3 days.\nTo freeze biscuits, place them on a parchment-lined rimmed baking sheet and freeze. When frozen solid, transfer biscuits to a large zip-top bag or airtight container and freeze for up to 1 month.\nBaking\nThe Latest\nVegetarian\nSour Cream\nBiscuits"
}