{
  "url": "https://www.seriouseats.com/sous-vide-barbecue-smoked-bbq-brisket-texas-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PGF9iPCHyOIRdWvvXRgoACf8gJA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__07__20160801-sous-vide-brisket-guide-35-460f78a538054fc69bd97f2e16b4bd74.jpg",
  "tags": [
    "Sous Vide Beef",
    "Grilled Beef",
    "Smoked Beef",
    "Brisket"
  ],
  "title": "Sous Vide Smoked Brisket",
  "full_text": "Sous Vide Smoked Brisket\nClose\nJump to recipe\nPrep\n15 mins\nCook\n26 hrs\nActive\n60 mins\nResting Time\n3 hrs\nTotal\n29 hrs 15 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nounces\ncoarsely ground black\npeppercorns\n(about\n1/3\ncup\n;\n55\ng\n); see notes\n2 1/4\nounces\nkosher salt\n(about\n1/4\ncup\n;\n65\ng\n)\n1/4\nounce\n(\n10\ng\n) pink salt, such as Prague Powder\nCuring Salt\n(optional; see note)\n1\nflat-cut\nor point-cut\nbrisket\n, about\n5\npounds\n(\n2.25\nkg\n); see note\n1/4\nteaspoon\nliquid smoke\n, such as Wright's Liquid Smoke (optional; see note)\nDill pickles\n, sliced yellow onion, and white bread, for serving\nDirections\nCombine pepper, salt, and pink salt (if using) in a small bowl. Rub two-thirds of mixture evenly over surface of brisket. Reserve remaining one-third of mixture. Slice brisket in half crosswise in order to fit into large vacuum bags.\nSerious Eats / J. Kenji López-Alt\nPlace each brisket half in a vacuum bag. (Fold over the top of each bag while you add brisket so that no rub or juices get on the edges of bags, which can weaken the seal.) Add 4 drops (about 1/8 teaspoon) liquid smoke, if using, to each bag. Seal bags using a vacuum sealer and let rest for 2 to 3 hours in the refrigerator.\nSet your precision cooker to 135°F (57°C) for brisket with a tender, steak-like texture, or 155°F (68°C) for more traditionally textured brisket that falls apart when you pull at it. Add brisket to water bath and cover it with a lid, aluminum foil, or\nping pong balls\n. Cook for 24 to 36 hours at 155°F or 36 to 72 hours at 135°F. Allow cooked brisket to cool at least to room temperature before proceeding (an ice bath can speed up this process). Brisket can be stored in the refrigerator at this stage for up to 1 week before finishing.\nSerious Eats / J. Kenji López-Alt\nTo Finish on the Grill:\nLight 1/2 chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes.\nClean and oil grilling grate\n.\nRemove brisket from bags and carefully blot dry with paper towels. (Liquid from bags can be added to your\nfavorite barbecue sauce\nand simmered down to provide extra flavor.) Rub reserved salt and pepper mixture into surface of brisket. Place brisket on cooler side of grill, fat cap up. Add 4 to 5 hardwood chunks to hotter side of grill. (If using a gas grill, wrap wood chunks loosely in aluminum foil before placing over hotter side of grill.) Cover and allow brisket to smoke, adjusting vents to maintain a temperature between 275 and 300°F (135 and 149°C) and adding 2 to 3 wood chunks twice during cooking. Smoke until a deep, dark bark has formed, about 3 hours. Continue with step 7.\nSerious Eats / J. Kenji López-Alt\nTo Finish in the Oven:\nAdjust oven rack to lower-middle position and preheat oven to 300°F (150°C). (If your oven has a convection setting, turn it on and adjust heat to 275°F/135°C instead.) Remove brisket from sous vide bags and carefully blot dry with paper towels. (Liquid from bags can be added to your\nfavorite barbecue sauce\nand simmered down to provide extra flavor.) Rub reserved salt-and-pepper mixture into surface of brisket. Place brisket on a wire rack set in a rimmed baking sheet, fat cap up, and place in oven. Roast until a deep, dark bark has formed, about 2 hours. Continue with step 7.\nSerious Eats / J. Kenji López-Alt\nTransfer brisket to a cutting board and tent with foil. Allow to rest until the temperature drops to between 145 and 165°F (63 and 74°C), about 30 minutes. Slice against the grain into thin strips and serve with white bread, dill pickles, and sliced onion.\nSpecial Equipment\nSous vide precision cooker\n,\nspice grinder\n(see note),\nvacuum sealer\n,\ngrill\nand hardwood chunks (if finishing on the grill),\nwire rack\nand\nrimmed baking sheet\n(if finishing in the oven)\nNotes\nYou can\ngrind pepper in a pepper mill,\na\nfood processor\n, or a\nblade grinder\n, but the easiest way to get a consistent coarse grind in bulk is to use a\nburr grinder\n.\nIf you'd like a pink smoke ring for a more traditional look, use pink curing salt, available from spice stores or Amazon.\nLiquid smoke can be used to add smoke flavor to the beef if you're not planning on smoking it outdoors.\nI strongly recommend using a brisket with the fat cap intact and plenty of intramuscular marbling. A fully trimmed flat-cut brisket will come out relatively dry compared with an untrimmed cut.\nRecommended Sous Vide Barbecue Brisket Temperatures\nTemp and Time\nResult\n135°F for 36 to 72 hours\nFirm and meaty, like a tender steak\n155°F for 24 to 36 hours\nExtra moist, with a traditional texture\nRead More\nBarbecue Brisket Recipe\nSous Vide Smoked Beef Chuck Recipe\nSous Vide Barbecue Pork Ribs Recipe\nSous Vide Barbecue Pulled Pork Shoulder Recipe\nSous Vide Beef\nGrilled Beef\nSmoked Beef\nBrisket",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sous-vide-smoked-brisket.webp?"
}