{
  "url": "https://www.seriouseats.com/sous-vide-chicken-breast-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uCi92mQQeP3CKhoHVJQoJbYOvzs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__07__20150610-sous-vide-chicken-guide-36-42733f4219314610861f38f537484f7f.jpg",
  "tags": [
    "Sous Vide Chicken",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Chicken Breast",
    "Chicken Mains"
  ],
  "title": "Sous Vide Chicken Breast",
  "full_text": "Sous Vide Chicken Breast\nClose\nJump to recipe\nPrep\n10 mins\nCook\n95 mins\nActive\n20 mins\nTotal\n105 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nbone-in, skin-on chicken breast\nhalves\nKosher salt\nand\nfreshly ground black pepper\n4\nsprigs\nthyme\nor\nrosemary\n(optional)\nDirections\nPreheat a water bath to desired final temperature using a sous vide cooker, according to the chart below. Season chicken generously with salt and pepper. Place chicken in zipper-lock bags or vacuum bags and add thyme or rosemary sprigs, if using.\nIf Using Zipper-Lock Bags:\nRemove air from zipper-lock bags by closing bags, leaving the last inch of the top unsealed. Slowly lower into preheated water bath, sealing bag completely just before it fully submerges. Cook according to the chart below.\nIf Using Vacuum Bags:\nSeal according to manufacturer's instructions. Add bagged chicken to preheated water bath and cook according to the chart below.\nTo Finish in a Pan:\nTurn on your vents and open your windows. Remove chicken from water bath and bag. Discard herbs, if using. Carefully pat chicken dry with paper towels. Heat the oil in a heavy cast iron or stainless steel skillet over medium-high heat until shimmering. Gently lay chicken in skillet, skin side down, using your fingers or a set of tongs. Hold chicken down flat in pan with a flexible metal spatula or your fingers (be careful of splattering oil). Cook until golden brown and crisp, about 2 minutes. Remove from pan and let rest until cool enough to handle, about 2 minutes. Remove bones with your fingertips. Slice chicken and serve.\nTo Finish on the Grill:\nLight one half chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate. Remove chicken from water bath and bag. Discard herbs, if using. Carefully pat chicken dry with paper towels. Gently lay chicken on hot side of grill, skin side down. Cook until nicely marked, about 2 minutes. Rotate 90 degrees and cook until chicken is marked again and skin is crisp, about 1 1/2 minutes longer. Remove from grill and let rest until cool enough to handle, about 2 minutes. Remove bones with your fingertips. Slice chicken and serve.\nSpecial Equipment\nSous vide precision cooker\nNotes\nSous-Vide Chicken Breast Temperature and Timing Chart\nTexture\nTemperature\nTiming Range\nVery soft and juicy when served hot\n140°F (60°C)\n1 1/2 to 4 hours\nTender and juicy: Ideal for chicken salad when served cold, slightly stringy when served hot.\n150°F (66°C)\n1 to 4 hours\nTraditional, juicy, firm, and slightly stringy, served hot\n160°F (71°C)\n1 to 4 hours\nRead More\nThe Food Lab's Complete Guide to Sous Vide Chicken Breast\nSous Vide Chicken\nDairy-free Mains\nGluten-free Mains\nChicken Breast\nChicken Mains"
}