{
  "url": "https://www.seriouseats.com/sous-vide-pork-ribs-recipe-food-lab",
  "image_url": "https://www.seriouseats.com/thmb/Omlu6IT-0rpmk8WE05iSfS8IqO8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__08__20150730-anova-sous-vide-rib-guide-food-lab68-j-kenji-lopez-alt-3a8181cad15d4dbc93037b66c0f209da.jpg",
  "tags": [
    "Sous Vide Pork",
    "Barbecue",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Grilling"
  ],
  "title": "Sous Vide Barbecue Pork Ribs Recipe",
  "full_text": "Sous Vide Barbecue Pork Ribs Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n13 hrs\nActive\n60 mins\nMarinating Time\n4 hrs\nTotal\n17 hrs 10 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spice Rub:\n1/3\ncup\npaprika\n1/3\ncup\ndark brown sugar\n1/4\ncup\nkosher salt\n1\nteaspoon\nPrague Powder #1\n(optional; see note)\n2\ntablespoons\nwhole\nyellow mustard seed\n1\nteaspoon\nfreshly ground black pepper\n2\ntablespoons\ngranulated\ngarlic powder\n1\ntablespoon\ndried oregano\n1\ntablespoon\nwhole coriander seed\n1\nteaspoon\nred pepper flakes\nFor the Sauce (if making sauced ribs)\n1\nmedium\nyellow onion\n, grated on the large holes of a\nbox grater\n1 1/2\ncups\n(\n360\nml\n)\nketchup\n2\ntablespoons\n(\n30\nml\n)\nspicy brown mustard\n1/3\ncup\n(\n80\nml\n)\ndark molasses\n1/4\ncup\n(\n60\nml\n)\nWorcestershire sauce\n1/4\ncup\n(\n60\nml\n)\napple cider vinegar\n3/4\nteaspoon\n(\n3\nml\n) Wright’s or Colgin\nliquid hickory smoke\nFor the Ribs:\n2\nwhole racks\nSt. Louis–cut\npork ribs\nAbout\n3/4\nteaspoon\n(\n3\nml\n) Wright’s or Colgin\nliquid hickory smoke\nDirections\nFor the Spice Rub:\nWorking in batches, combine the paprika, brown sugar, salt, Prague Powder (if using), mustard seed, black pepper, garlic powder, oregano, coriander seed, and red pepper flakes in a\nspice grinder\nand reduce to a fine powder.\nSerious Eats / J. Kenji López-Alt\nFor the Sauce (if using):\nCombine 3 tablespoons spice rub, grated onion, ketchup, mustard, molasses, Worcestershire sauce, vinegar, and liquid smoke in a medium saucepan and whisk to combine. Bring to a bare simmer and cook until reduced and thickened, about 20 minutes. Set aside.\nSerious Eats / J. Kenji López-Alt\nPrepare the Ribs\n:\nRemove the papery membrane on the back of the ribs, using a paper towel or kitchen towel to grip it and pulling it away in one piece. Divide each rack of ribs into three to four portions, with three to four ribs per portion, by cutting through the meat in between the ribs. Rub ribs generously on all sides with the remaining spice rub mixture. (Set aside 3 tablespoons spice rub if making dry-style ribs.)\nSerious Eats / J. Kenji López-Alt\nPlace individual portions of rubbed ribs in vacuum bags. (Fold over the top of each bag while you add the ribs so that no rub or pork juices get on the edges of the bags, which can weaken the seal.) Add 4 drops (about 1/8 teaspoon) liquid smoke to each bag. Seal the bags, transfer to refrigerator, and let rest for 4 to 12 hours.\nSerious Eats / J. Kenji López-Alt\nWhen Ready to Cook:\nSet your precision cooker to 145°F (63°C) for extra-meaty ribs or 165°F (74°C) for more traditionally textured ribs.\nSerious Eats / J. Kenji López-Alt\nAdd ribs to the water bath and cover it with a lid, aluminum foil, or\ntable tennis balls\n. Cook for 36 hours at 145°F or 12 hours at 165°F. Transfer cooked ribs to a large bowl of water filled with ice to chill thoroughly. Ribs can be stored in the refrigerator at this stage for up to 5 days before finishing.\nSerious Eats / J. Kenji López-Alt\nTo Finish Dry-Style in the Oven:\nRemove ribs from vacuum bags and carefully pat dry with paper towels. Rub with remaining 3 tablespoons spice rub. Adjust oven racks to upper and lower-middle positions and preheat oven to 300°F (150°C). Line 2 rimmed baking sheets with aluminum foil and place a wire rack in each. Divide ribs evenly on racks, facing meat-side up. Transfer ribs to oven and cook until a crusty bark has formed, about 40 minutes. Serve.\nSerious Eats / J. Kenji López-Alt\nTo Finish Dry-Style on the Grill:\nRemove ribs from vacuum bags and carefully pat dry with paper towels. Rub with remaining 3 tablespoons spice rub. Light one-half chimney full of charcoal (about 2 1/2 quarts of coals). When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium heat setting, cover, and preheat for 10 minutes. Scrape the grill grates clean with a grill scraper, then oil the grates by holding an oil-dipped kitchen towel or paper towels in a set of tongs and rubbing them over the grates 5 to 6 times. Place the ribs, meat-side up, over the cooler side of the grill. Cover and cook until ribs are heated through and dry to the touch, about 15 minutes. Transfer ribs to hotter side of grill and continue grilling, turning occasionally, until a crusty bark has formed, about 10 minutes. Serve.\nTo Finish Sauced Ribs in the Oven:\nRemove ribs from vacuum bags and carefully pat dry with paper towels. Adjust oven racks to upper and lower-middle positions and preheat oven to 300°F (150°C). Line 2 rimmed baking sheets with aluminum foil and place a wire rack in each. Divide ribs evenly on racks, meat-side up. Transfer ribs to oven and cook until surface is sizzling and ribs are heated through, about 20 minutes. Brush ribs with sauce and return to oven for 10 minutes. Remove from oven, brush with another layer of sauce, and return to oven until sauce is dried and sticky, about 10 minutes longer. Remove ribs from oven, paint with one last layer of sauce, and serve, passing extra sauce at the table.\nTo Finish Sauced Ribs on the Grill:\nRemove ribs from vacuum bags and carefully pat dry with paper towels. Light one-half chimney full of charcoal (about 2 1/2 quarts of coals). When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium heat setting, cover, and preheat for 10 minutes. Scrape the grill grates clean with a grill scraper, then oil the grates by holding an oil-dipped kitchen towel or paper towels in a set of tongs and rubbing them over the grates 5 to 6 times. Place the ribs, meat-side up, over the cooler side of the grill. Cover and cook until ribs are heated through and dry to the touch, about 15 minutes. Brush ribs with a layer of sauce and transfer ribs to hotter side of grill. Cover and cook until sauce is mostly dry, about 7 minutes. Brush with a second layer of sauce, cover, and cook until second layer is sticky, about 5 minutes longer. Remove ribs from grill, paint with one last layer of sauce, and serve, passing extra sauce at the table.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nSous vide precision cooker\n,\nspice grinder\n, vacuum sealer,\ncharcoal\nor\ngas grill\n(if finishing on the grill),\n2 rimmed baking sheets and 2 wire racks\n(if finishing in the oven)\nNotes\nPrague Powder #1, a curing salt, can be added to give the ribs a red \"smoke\" ring. You can order it online.\nSous Vide Pork\nBarbecue\nDairy-free Mains\nGluten-free Mains\nGrilling"
}