{
  "url": "https://www.seriouseats.com/sous-vide-turkey-breast-crispy-skin-recipe-thanksgiving",
  "image_url": "https://www.seriouseats.com/thmb/aZjwo_UjuXF9GKZqv2yXHDYRJcc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20181022-sous-vide-turkey-breast-crispy-skin-26-liz-clayman-c6a148dd6318416fbca2b9f6b3f0d951.jpg",
  "tags": [
    "Sous Vide",
    "Turkey Breast",
    "Turkey Mains",
    "Fall Mains",
    "Thanksgiving Dinner"
  ],
  "title": "Sous Vide Turkey Breast With Crispy Skin",
  "full_text": "Sous Vide Turkey Breast With Crispy Skin\nClose\nJump to recipe\nPrep\n15 mins\nCook\n2 hrs 45 mins\nActive\n60 mins\nCooling Time\n20 mins\nTotal\n3 hrs 20 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Turkey:\n1\nlarge\nwhole skin-on,\nbone-in turkey breast\n(about\n5\npounds\n;\n2.2\nkg\n)\nKosher salt\nand freshly ground black pepper\nFor the Gravy:\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n1\nlarge\nonion\n, roughly chopped\n1\nlarge\ncarrot\n, peeled and roughly chopped\n2\nribs\ncelery\n, roughly chopped\n1 1/2\nquarts\n(\n1.4\nL\n)\nhomemade\nor\nstore-bought\nlow-sodium chicken stock\n2\nbay leaves\n1\nteaspoon\n(\n5\nml\n)\nsoy sauce\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n1/4\ncup\n(\n40\ng\n)\nall-purpose flour\nDirections\nCarefully remove turkey skin in a single piece and set aside. Using a sharp boning knife, remove breast meat from breastbone. Set breastbone aside. Season turkey generously with salt and pepper on all sides. Place 1 breast half, cut side facing up, on a work surface. Place second breast half facedown, so the fat end aligns with the skinny end of the first breast half. Gently form into an even cylinder.\nSerious Eats / Liz Clayman\nTie turkey breast at 1-inch intervals using butcher's twine. Transfer to a zipper-lock bag. Turkey can be refrigerated for up to 5 days before proceeding.\nSerious Eats / Liz Clayman\nHeat a sous vide water bath to 145°F (63°C), or to desired temperature according to chart above and in the notes section. With bag open, slowly lower bagged turkey into water, letting water pressure squeeze air out of bag until just the seal remains above the waterline. Seal bag completely. Let turkey cook for 2 1/2 hours (or according to chart). Meanwhile, make the crispy skin and gravy.\nSerious Eats / Liz Clayman\nFor the Crispy Skin:\nAdjust oven rack to center position and preheat oven to 400°F (200°C). Spread skin evenly over a piece of parchment paper set in a rimmed baking sheet. Season generously with salt and pepper. Place a second sheet of parchment on top and carefully squeeze out any air bubbles using the side of your hand. Place a second rimmed baking sheet on top and transfer to oven.\nSerious Eats / Liz Clayman\nRoast until skin is deep brown and crisp (it will crisp further on cooling), 30 to 45 minutes. Allow to cool and set aside at room temperature. Turkey skin can be roasted in advance, cooled completely, then stored, loosely covered, at room temperature for up to 3 days. To re-crisp, place in a hot oven for a few minutes just before serving.\nSerious Eats / J. Kenji López-Alt\nFor the Gravy:\nUsing a cleaver, chop breastbone into 1-inch chunks. In a medium saucepan over high heat, heat oil until smoking. Add breastbone, onion, carrot, and celery and cook, stirring occasionally, until well browned, about 10 minutes total. Add stock, bay leaves, and soy sauce. Bring to a boil, then reduce to a simmer. Simmer for 1 hour, then strain through a fine-mesh strainer. You should have a little over 1 quart (900ml) of fortified stock; if not, add water or more chicken stock to equal 1 quart. Discard solids and set stock aside.\nSerious Eats / Liz Clayman\nIn a medium saucepan over medium heat, melt butter. Add flour and cook, stirring constantly, until golden brown, about 3 minutes. Whisking constantly, add fortified broth in a thin, steady stream. Bring to a boil, reduce to a simmer, and cook until thickened and reduced to about 3 cups (720ml). Season to taste with salt and pepper. Keep warm.\nSerious Eats / Liz Clayman\nWhen turkey is cooked, remove from water bath and unseal bag. Carefully remove butcher's twine. Cut into 1/4- to 1/2-inch slices for serving. Fan slices out on a warmed serving platter or cutting board. Break skin into serving-sized pieces and add to platter, along with a pitcher of gravy. Serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nSous vide immersion circulator\n,\n2 rimmed baking sheets\n,\nfine-mesh strainer\n, butcher's twine\nNotes\nSous Vide Turkey Temperatures and Times\nFinal Result\nBath Temp\nCore Temp\nCook Time After Reaching Core Temp\nApprox. Total Cook Time\nVery pink, soft, extra moist\n132°F (56°C)\n130°F (55°C)\n2 hours\n4 hours\nPale pink, soft, moist\n138°F (59°C)\n136°F (58°C)\n1 hour\n3 hours\nWhite, tender, moist\n145°F (63°C)\n143°F (62°C)\n16 minutes\n2 1/2 hours\nWhite; traditional roast texture\n152°F (67°C)\n150°F (66°C)\n4 minutes\n2 hours\nMake-Ahead and Storage\nThe cooked turkey can be chilled in an ice bath and stored in the refrigerator for up to a week. Reheat it in a 130°F (55°C) water bath for about an hour before serving.\nRead More\nHow to Cook Sous Vide Chicken Breast\nHerb-Roasted Turkey Breast and Stuffing Recipe\nTurkey Porchetta Recipe\nDeep-Fried Sous Vide Turkey Porchetta (Turchetta) Recipe\nSous Vide\nTurkey Breast\nTurkey Mains\nFall Mains\nThanksgiving Dinner",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sous-vide-turkey-breast-with-crispy-skin.webp?"
}