{
  "url": "https://www.seriouseats.com/sous-vide-buffalo-chicken-wings",
  "image_url": null,
  "tags": [
    "Sous Vide Chicken",
    "Fried Chicken",
    "Chicken Wings",
    "Chicken Mains",
    "Snacks & Appetizers"
  ],
  "title": "Sous Vide Buffalo Chicken Wings Recipe",
  "full_text": "Sous Vide Buffalo Chicken Wings Recipe\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 15 mins\nActive\n60 mins\nChilling Time\n8 hrs\nTotal\n10 hrs 25 mins\nServes\n4\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\npounds\n(\n1.8\nkg\n)\nchicken wings\n, cut into drumettes and flats, wing tips removed and saved for stock or discarded\nKosher salt\n8\ntablespoons\nunsalted butter\n(\n1\nstick\n;\n110\ng\n)\n1\ncup\n(\n235\nml\n)\nFrank's RedHot Sauce\n3\nquarts\n(\n2.8\nL\n) peanut or\ncanola oil\nBlue cheese dressing\n, for serving\nCelery sticks\n, for serving\nDirections\nSet Up the Immersion Circulator:\nSet up an immersion circulator and preheat the water bath to either 160°F (71°C) if you want fall-off-the-bone wings or 165°F (74°C) if you want juicy and tender wings that still retain some springiness.\nMeanwhile, season wings all over with salt. Place wings in zipper-lock bags (you may need multiple bags to easily hold all the wings). Alternatively, slide wings into vacuum bags and seal according to vacuum-sealer manufacturer's instructions. If using zipper-lock bags, seal using the\nwater-displacement method\n. Add bagged wings to immersion circulator and cook for 2 hours if cooking at 160°F or 1 hour if cooking at 165°F.\nSerious Eats / Joel Russo\nRemove wings from bags and pat dry; discard juices. Arrange wings on wire racks set on rimmed baking sheets and refrigerate, uncovered, for 8 hours or up to 2 days.\nSerious Eats / Joel Russo\nWhen ready to serve, in a small saucepan, combine butter and Frank's and cook over medium-low heat, stirring occasionally, until butter is completely melted. Transfer to a large bowl.\nMeanwhile, in a wok or Dutch oven, heat oil to 400°F (205°C). Working in small batches, carefully add chicken and cook, stirring and flipping occasionally while adjusting heat to maintain a temperature of 375 to 400°F (190 to 205°C), until golden brown and crisp, about 3 minutes per batch. Using a spider or slotted spoon, transfer wings to paper towels to drain. When all the wings have been fried, transfer to bowl with sauce, toss to coat, and serve with blue cheese dressing and celery.\nSerious Eats / Joel Russo\nSpecial Equipment\nImmersion circulator\n,\nwok\nor\nDutch oven\n,\nwire rack\nMake-Ahead and Storage\nYou can cook the wings sous vide up to 2 days in advance. Keep them uncovered on the wire rack in the fridge until ready to fry.\nSous Vide Chicken\nFried Chicken\nChicken Wings\nChicken Mains\nSnacks & Appetizers"
}