{
  "url": "https://www.seriouseats.com/sous-vide-pork-chops-recipe",
  "image_url": null,
  "tags": [
    "Sous Vide Pork",
    "Pork Chop",
    "Pork Mains"
  ],
  "title": "Sous Vide Pork Chops",
  "full_text": "Sous Vide Pork Chops\nJump to recipe\nPrep\n5 mins\nCook\n75 mins\nActive\n20 mins\nResting Time\n5 mins\nTotal\n85 mins\nServes\n4 pork chops\nCook Mode\n(Keep screen awake)\nIngredients\n4\nbone-in pork rib chops\n, 1 1/2 inches thick each (about\n2 1/2\npounds\n;\n1.1\nkg\ntotal)\nKosher salt\nand freshly ground black pepper\n2 to 4\ntablespoons\n(\n30 to 60\nml\n)\nvegetable\n, canola, or rice bran\noil\n, divided (optional)\n4\ntablespoons\n(\n60\nml\n)\nbutter\n, divided (optional)\n8\nsprigs\nthyme\nor rosemary, divided (optional)\n4\ngarlic\ncloves\n, divided (optional)\n2\nshallots\n, thinly sliced, divided (optional)\nDirections\nPlace an immersion circulator in a water bath and set the circulator to the desired final temperature according to the chart above. Allow the water bath to come to temperature. Season pork chops generously with salt and pepper (see notes). Place in vacuum-seal or zipper-lock bags. Seal bags (see notes) and place in water bath for time recommended in chart above.\nSerious Eats / J. Kenji López-Alt\nTo Finish in a Pan:\nTurn on your vents and open your windows. Remove pork from water bath and bag and carefully pat dry with paper towels. Add 2 tablespoons vegetable, canola, or rice bran oil to a heavy cast iron or stainless steel skillet, place it over the hottest burner you have, and preheat skillet until it starts to smoke. Using your fingers or a set of tongs, gently lay two pork chops in skillet. If desired, add 1 tablespoon butter; for a cleaner-tasting sear, omit butter at this stage. Carefully lift and peek under pork as it cooks to gauge how quickly it is browning. Let it continue to cook until the crust is deep brown and very crisp, about 45 seconds.\nSerious Eats / J. Kenji López-Alt\nFlip pork chops. If desired, add 1 more tablespoon butter, along with half of the thyme, rosemary, garlic, and/or shallots. Spoon butter over pork chops as they cook, if using. Continue cooking until second side is browned, about 45 seconds longer.\nSerious Eats / J. Kenji López-Alt\nWhen pork is browned, pick it up with a pair of tongs, rotate it sideways, and make sure to brown the edges as well. Transfer cooked pork chops to a wire rack set over a rimmed baking sheet. Discard aromatics. Repeat with remaining pork chops, butter, and aromatics, adding additional oil to skillet if necessary. Let chops rest for 3 to 5 minutes.\nSerious Eats / J. Kenji López-Alt\nJust before serving, reheat the drippings in the pan until sizzling-hot, then pour them over pork chops in order to re-crisp their exteriors. Serve immediately.\nSerious Eats / J. Kenji López-Alt\nTo Finish on the Grill:\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil the grilling grate\n.\nSerious Eats / Vicky Wasik\nRemove pork chops from water bath and bag and carefully pat dry with paper towels. Place pork chops directly over the hot side of the grill and cook, turning every 15 to 30 seconds, until a deep, rich crust has formed, 1 1/2 to 2 minutes total. If the fire threatens to flare up as pork chops drip fat into it, suffocate the fire by closing the grill lid until the flames die out. Alternatively, transfer pork chops to the cooler side of the grill using a set of long tongs until the flames subside. Do not allow pork chops to become engulfed in flames. Transfer cooked pork chops to a cutting board or serving platter and serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nSous vide precision cooker\n,\nwire rack and rimmed baking sheet\n(if finishing on the stovetop),\ncharcoal\nor\ngas grill\n(if finishing on the grill)\nNotes\nIf you plan to leave the uncooked pork chops in bags for more than a few hours before cooking, skip the seasoning step and instead season them just before searing.\nTo seal a zipper-lock bag, use the displacement method: Place pork chops in bag, then seal it almost entirely closed. Next, slowly lower the bagged chops into a pot or bowl of water, letting the water pressure press out air through the top of the bag. Once most of the air is out of the bag, carefully seal the bag just above the waterline. If bag is properly sealed, it should sink.\nRead More\nSous Vide Cooking: How to Get Started\nSous Vide Steak Guide\nThe Best Sous Vide Containers\nAir-Fryer Pork Chops\nPerfect Pan-Seared Pork Chops\nSous Vide Pork\nPork Chop\nPork Mains"
}