{
  "url": "https://www.seriouseats.com/sous-vide-pork-tenderloin-recipe",
  "image_url": null,
  "tags": [
    "Sous Vide Pork",
    "Gluten-free Mains",
    "Pork Loin",
    "Pork Mains"
  ],
  "title": "Sous Vide Pork Tenderloin",
  "full_text": "Sous Vide Pork Tenderloin\nJump to recipe\nPrep\n5 mins\nCook\n70 mins\nActive\n20 mins\nResting Time\n5 mins\nTotal\n80 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\npork tenderloin\n, about\n1\npound\n(\n450\ng\n)\nKosher salt\nand freshly ground black pepper\n6 to 8\nsprigs\nfresh herbs, such as\nfresh thyme\n, oregano, or rosemary, divided (optional)\n2\ngarlic\ncloves\n, divided (optional)\n2\nsmall\nshallots\n, sliced, divided (optional)\n1\ntablespoon\n(\n15\nml\n)\nvegetable\n, canola, or rice bran\noil\n1\ntablespoon\n(\n15\ng\n)\nunsalted butter\nDirections\nUsing a sous vide immersion circulator, preheat a water bath to the desired finishing temperature according to the chart above.\nSeason pork generously with salt and pepper. Place in sous vide bags along with half of herbs, garlic, and shallots (if using) and distribute evenly. Seal bags and place in water bath for time recommended in chart.\nSerious Eats / J. Kenji López-Alt\nTo Finish:\nTurn on your vents and open your windows. Remove pork from water bath and bag. Discard aromatics from bag; reserve liquid from bag if making optional pan sauce (see notes). Carefully pat pork dry with paper towels. Add vegetable, canola, or rice bran oil to a heavy cast iron or stainless steel skillet, place it over the hottest burner you have, and preheat skillet until it starts to very lightly smoke. Lay pork in skillet, using your fingers or a set of tongs. Cook, turning occasionally, until browned on most sides, about 2 minutes total.\nSerious Eats / J. Kenji López-Alt\nWhen pork is mostly browned, add butter and reserved half of garlic, shallots, and herbs (if using) and cook, tilting pan and using a spoon to baste pork with the flavorful butter, until pork is well browned on all sides, about 30 seconds longer.\nSerious Eats / J. Kenji López-Alt\nTransfer pork to a rack set in a rimmed baking sheet and pour the drippings on top. Allow to rest for 1 to 2 minutes, then slice and serve.\nSpecial Equipment\nImmersion circulator\n,\nrimmed baking sheet\n,\nwire rack\nNotes\nIf you'd like a simple sauce with your pork, add one tablespoon of minced shallot to the skillet and sauté until aromatic, about 15 seconds. Add a cup of dry white wine or vermouth and let it reduce by half. Add a dollop of whole grain mustard, the liquid reserved from the sous vide bag, and a tablespoon of butter. Swirl until the sauce is emulsified, and season to taste with salt and pepper.\nRead More\nEasy Pan-Roasted Pork Tenderloin With Bourbon-Soaked Figs Recipe\nHoney and Thyme Roasted Pork Loin Recipe\nSous Vide Pork Chops Recipe\nGrilled Pork Tenderloin Recipe\nGingery Roast Pork with Thyme Recipe\nSous Vide Pork\nGluten-free Mains\nPork Loin\nPork Mains"
}