{
  "url": "https://www.seriouseats.com/sous-vide-double-cut-pork-chops-recipe",
  "image_url": "https://www.seriouseats.com/thmb/hggOncU2F5FcFlzZ375v38C_G1Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__09__20130922-sous-vide-pork-chop-striped-bass-egg-10-0ddab9f0ca2d4d7d9c1413217d19f742.jpg",
  "tags": [
    "Pork Mains",
    "Sous Vide Pork",
    "Pork Chop"
  ],
  "title": "Sous Vide Double-Cut Pork Chops Recipe",
  "full_text": "Sous Vide Double-Cut Pork Chops Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nActive\n10 mins\nResting Time\n5 mins\nTotal\n60 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ndouble-cut bone-in\npork\nrib chop\n, about\n1 1/4\npounds\ntotal\nKosher salt and freshly ground black pepper\n1\ntablespoon\ncanola or\nvegetable oil\n2\ntablespoons\nunsalted butter\nDirections\nAdjust sous vide immersion circulator to 135°F (57°C) for medium-rare or 140°F (60°C) for medium. Alternatively, fill a large beer cooler with hot water and use a kettle of boiling water to adjust heat to 3°F above suggested target temperatures (138°F/59°C for medium-rare and 143°F/62°C for medium). Season pork chop generously with salt and pepper. Seal in food saver-style vacuum packer. Alternatively, place in a heavy-duty zipper lock bag and seal, leaving a 1-inch section unsealed. Slowly lower into sous vide cooker, pressing out air as you go. Seal bag completely just before the seal goes under water to completely remove air from bag.\nCook pork chop in sous vide cooker for at least 45 minutes and up to 4 hours. Alternatively, place in cooler and seal for 45 minutes. Remove from cooker or cooler and carefully pat dry on paper towels.\nSerious Eats / J. Kenji López-Alt\nHeat oil and butter in a small skillet over high heat until foaming has subsided and butter begins to brown and smoke slightly. Add pork and cook, turning occasionally, until well-browned on both sides, about 4 minutes total, lowering heat if butter turns black or smokes excessively. Using tongs, lift chop and hold sideways against skillet, pressing firmly until all the edges are browned and fat is crisped, about 2 minutes longer.\nSerious Eats / J. Kenji López-Alt\nTransfer pork to cutting board and let rest for 2 minutes. Serve as-is, or carve before serving.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nSous vide immersion circulator\nNotes\nTo seal a zipper-lock bag, use\nthe displacement method\n: Place pork chop in bag, then seal it almost entirely closed. Next, slowly lower the bagged chop into a pot or bowl of water, letting the water pressure press out air through the top of the bag. Once most of the air is out of the bag, carefully seal the bag just above the waterline. If bag is properly sealed, it should sink.\nPork Mains\nSous Vide Pork\nPork Chop"
}