{
  "url": "https://www.seriouseats.com/sous-vide-pork-shoulder-chashu-recipe",
  "image_url": "https://www.seriouseats.com/thmb/3QCyIwknPF1STYAqZzc6eB-xEcc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181113-homemade-ramen-light-broth-chintan-shoyu-vicky-wasik-27-a91162d8d7d646b08cefe955acf36965.jpg",
  "tags": [
    "Pork Shoulder",
    "Japanese",
    "Sous Vide Pork",
    "Pork Mains"
  ],
  "title": "Sous Vide Pork Shoulder Chashu Recipe",
  "full_text": "Sous Vide Pork Shoulder Chashu Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 hrs 5 mins\nActive\n20 mins\nMarinating Time\n24 hrs\nTotal\n44 hrs 10 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nounce\n(\n14\ng\n)\nkosher salt\n(see notes)\n1/2\nounce\n(\n14\ng\n)\ngranulated sugar\n(see notes)\n1\nwhole\npork shoulder roast\n(about\n2\npounds\n;\n900\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n1\ntablespoon\n(\n15\nml\n)\nmirin\nDirections\nCombine salt and sugar in a small bowl and mix thoroughly.\nPlace pork shoulder roast in a zip-top bag. Pour salt-sugar mixture into bag and massage mixture evenly into meat. Seal bag, trying to avoid leaving much air inside. Place bag in refrigerator for 24 hours. Roughly every 8 hours, massage bag and flip it over to ensure even distribution of the cure.\nSet up an immersion circulator and preheat a water bath to 145°F (63°C).\nRemove roast from zip-top bag and place on a cutting board. Discard liquid in bag and blot roast completely dry. Using kitchen twine, tie roast at 1/2-inch intervals to form a neat cylinder.\nPlace roast back in zip-top bag and add soy sauce and mirin. Seal bag using the\nwater-displacement method\n. Alternatively, if using a vacuum sealer, transfer the roast to a sealable vacuum bag, add soy sauce and mirin, and seal.\nPlace bagged roast in water bath and cook for 20 hours.\nRemove bag and place in an ice bath to chill roast thoroughly. Remove roast from bag and blot dry.\nIf Finishing Under the Broiler:\nPlace roast on a rimmed baking sheet. Adjust oven rack so that the roast will be about 1 inch away from the broiler element. Preheat broiler to high. When broiler is hot, place roast under broiler, turning frequently, until exterior is charred, about 5 minutes.\nIf Finishing With a Handheld Torch:\nTurn on torch and char exterior of roast on all sides.\nThe roast can be sliced and served immediately, or sliced and stored for future use (see Make-Ahead and Storage, below).\nSpecial equipment\nImmersion circulator\n, kitchen twine,\nrimmed baking sheet\nor handheld torch\nNotes\nThe amount of salt-sugar cure should be adjusted if you're using a pork roast that's slightly larger or slightly smaller than 2 pounds. Use 3% of the weight of the pork roast in salt-sugar cure mixture.\nIf you'd like to cook the pork to a different temperature, the cooking time will have to be adjusted accordingly. As a general rule, if you're using a lower temperature, the pork must cook for a longer time; if you're using a higher temperature, the pork will cook for a shorter time.\nMake-Ahead and Storage\nOnce cooked, sous vide chashu that has been tightly wrapped in plastic will keep for 1 week in the refrigerator. If sliced into portions, tightly wrapped, and placed in a freezer bag, sous vide chashu will keep for 3 months, with only slight degradation in quality.\nThis Recipe Appears In\nHow to Make Pork Shoulder\nChashu\nfor Ramen\nPork Shoulder\nJapanese\nSous Vide Pork\nPork Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sous-vide-pork-shoulder-chashu-recipe.webp?"
}