{
  "url": "https://www.seriouseats.com/sous-vide-turkey-legs-recipe-5210218",
  "image_url": "https://www.seriouseats.com/thmb/7RiAK12m_c6ltcYkGoT9io6tGeQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_9024-52dbbec19b33493cbee4a0f182878a5f.jpg",
  "tags": [
    "Turkey Guides",
    "Thanksgiving Turkeys",
    "Thanksgiving"
  ],
  "title": "Sous Vide Turkey Legs",
  "full_text": "Sous Vide Turkey Legs\nClose\nJump to recipe\nPrep\n10 mins\nCook\n24 hrs 15 mins\nTotal\n24 hrs 25 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4 to 4 1/2\npounds\n(\n1.8 to 2\nkg\n)\nturkey legs\n, number will vary by size\nKosher salt and freshly ground black pepper\n6\nsprigs\nfresh thyme\nDirections\nSet up an immersion circulator and preheat the water bath to 150°F (66°C).\nSeason turkey legs all over with salt and pepper. Set thyme sprigs on bottom sides of legs. Place turkey legs into two separate vacuum bags and seal according to vacuum-sealer manufacturer's instructions. Alternatively, seal turkey legs in two 1-gallon\nzipper-lock bags using the water displacement method\n.\nTim Chin\nFully submerge turkey legs in water bath and cook for 24 to 30 hours. Make sure to cover top of container with plastic wrap or custom lid to prevent evaporation and to keep temperature consistent. If bags float, weigh them down by placing a wet kitchen towel on top or by\nusing binder clip\n.\nTim Chin\nRemove turkey from water bath and transfer to refrigerator to chill. The turkey legs can be kept refrigerated within the sealed bag for up to 1 week. If using right away, remove turkey from bags and pat surface dry with paper towels; discard thyme.\nTim Chin\nTo serve:\nIf using immediately, heat 1 tablespoon oil in 12-inch skillet over medium-high heat until shimmering. Working with one turkey leg at a time, sear on all sides until skin is crispy and golden brown, about 6 minutes (gently turn or prop up turkey leg with a spoon or tongs to get even browning all over). If serving after refrigeration: Remove turkey from bag, wipe away any congealed fat or solids, and pat dry with paper towels; discard thyme. Cook turkey legs skin side up in a 450°F (230°C) oven or broil until the meat is heated through and the skin is browned and crispy, about 7 minutes.\nTim Chin\nSpecial Equipment\nImmersion circulator\n,\nvacuum sealer\n, vacuum bags or zipper-lock bags.\nNotes\nWe do not recommend using pre-brined turkey; the resulting meat will be over-cured and excessively salty.\nThis recipe can easily be scaled up or down for any number of turkey legs you want to make.\nMake-Ahead and Storage\nSous vide turkey legs can be refrigerated in their sealed bag for up to one week.\nTurkey Guides\nThanksgiving Turkeys\nThanksgiving",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sous-vide-turkey-legs.webp?"
}