{
  "url": "https://www.seriouseats.com/sous-vide-carnitas-crispy-mexican-style-pulled-pork-recipe",
  "image_url": "https://www.seriouseats.com/thmb/oIx1gUmj2qL-vC18K513cfTOkII=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__01__20160101-carnitas-cochinita-pibil-sous-vide-recipe41-1afe4672448a49db9c8426d9d11c26bf.jpg",
  "tags": [
    "Sous Vide Pork",
    "Mexican",
    "Pork Shoulder",
    "Pork Mains",
    "Tacos"
  ],
  "title": "Sous Vide Carnitas for Tacos (Crispy Mexican-Style Pulled Pork) Recipe",
  "full_text": "Sous Vide Carnitas for Tacos (Crispy Mexican-Style Pulled Pork) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n8 hrs 10 mins\nActive\n30 mins\nCooling Time\n30 mins\nTotal\n8 hrs 50 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\npounds\n(\n1.8\nkg\n)\nboneless pork shoulder\n, cut into 2-inch-thick slabs\n1\nmedium\nonion\n, roughly chopped\n6\nmedium\ncloves garlic\n1\nstick\ncinnamon\n, broken into\n3\nto\n4\npieces\n2\nbay leaves\n1\nmedium\norange\n, peel intact\nKosher salt\nTo Serve:\nWarm corn tortillas\nLime wedges\nChopped white onion\nand\nfresh cilantro leaves\nCharred salsa verde\nor other salsa\nDirections\nCombine pork, onion, garlic, cinnamon stick, and bay leaves in a large bowl. Split orange into quarters and squeeze juice into bowl before adding rest of orange. Season generously with kosher salt and toss to combine.\nSerious Eats / J. Kenji López-Alt\nTransfer contents to a vacuum bag and seal (see note).\nSerious Eats / J. Kenji López-Alt\nWhen ready to cook, use a sous vide immersion circulator to preheat a water bath to the desired temperature according to\nthe chart above\n.\nSerious Eats / J. Kenji López-Alt\nAdd bag to water bath and cook for recommended time according to chart above. Make sure to top water up occasionally as it evaporates, and keep bag completely submerged. If bag floats, weigh it down by placing a wet kitchen towel on top of it. Alternatively,\nuse a heavy-duty binder clip\nto attach a metal spoon or knife to bottom of bag as a weight.\nSerious Eats / J. Kenji López-Alt\nWhen meat is cooked, remove from water bath. If you are cooking the pork in advance and don’t plan to serve it the same day, cool pork to room temperature directly in the bag or chill in an ice bath, then transfer bag to refrigerator or freezer (pork can be refrigerated for up to 5 days, or frozen for up to 2 months). If finishing the carnitas the same day, transfer contents of bag to a large bowl. Pick out chunks of meat with a set of tongs and transfer them to a rimmed baking sheet. (Discard aromatics and excess liquid, or reserve liquid and blend it in with your salsa.) When it is cool enough to handle, shred meat roughly using 2 forks or your fingers. Spread evenly over baking sheet.\nSerious Eats / J. Kenji López-Alt\nWhen ready to serve, adjust an oven rack to 3 inches below the broiler element and preheat broiler to high. Place pork under broiler and cook, using a spoon to flip pieces occasionally, until meat is browned and crisp on most sides, about 10 minutes total. Alternatively, working in batches, heat carnitas in a cast iron or nonstick skillet over medium heat, turning occasionally, until crisp, about 10 minutes.\nSerious Eats / J. Kenji López-Alt\nServe carnitas with warm tortillas, lime wedges, chopped onion and cilantro, and salsa.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nSous vide immersion circulator\n,\nvacuum sealer\n,\nrimmed baking sheet\nNotes\nI recommend sealing the pork in a vacuum seal bag for this recipe, but you can also use heavy-duty zipper-lock bags by double-bagging the meat and using\nthe water displacement method\nto remove air.\nMake-Ahead and Storage\nPork can be cooked in advance. Follow recipe through step 4, and once pork has finished cooking, remove from water bath and cool to room temperature directly in the bag or chill in an ice bath. Once completely cooled, transfer bag to refrigerator or freezer. Cooked pork can be refrigerated for up to 5 days or frozen for up to 2 months. Rewarm by returning bag to a water bath set to 165°F (74°C) for 1 hour and then proceed with step 5.\nRead More\nA Guide to American Taco Styles\nHomemade Tacos Al Pastor\nCharcoal-Grilled Al Pastor Skewers\nBeef Barbacoa\nEasy One-Pot Chicken Tinga (Spicy Mexican Shredded Chicken)\nSous Vide Pork\nMexican\nPork Shoulder\nPork Mains\nTacos"
}