{
  "url": "https://www.seriouseats.com/sous-vide-tuna-recipe",
  "image_url": "https://www.seriouseats.com/thmb/N_vZayV1UT8Bbx1u0VB0L9t3PJ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__08__20160827-sous-vide-tuna-41-77b48f9e66044d98921fd1230b581a25.jpg",
  "tags": [
    "Sous Vide Seafood",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Tuna",
    "Seafood Mains"
  ],
  "title": "Sous Vide Tuna Recipe",
  "full_text": "Sous Vide Tuna Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n65 mins\nActive\n15 mins\nMarinating Time\n30 mins\nTotal\n100 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\n(\n10- to 12-ounce\n)\ntuna steaks\n(about 1 1/2 to 2 inches thick;\n280 to 320 g\neach) (see notes)\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nAromatics such as\nfresh thyme\n, dill, parsley, thinly sliced shallots, and/or citrus zest (optional)\n1/2\ncup\n(\n70\ng\n;\n2.5\nounces\n) black or white\nsesame seeds\n(optional; for searing)\n2\ntablespoons\n(\n10\nml\n)\nvegetable oil\n, if serving seared\nDirections\nSeason tuna generously with salt and pepper on all sides.\nSerious Eats / J. Kenji López-Alt\nPlace tuna in a single layer in a gallon-size zipper-lock bag, or in 2 individual quart-size bags. Add olive oil to bag, or divide it between smaller bags, and turn tuna to coat. Add aromatics to bags, if using. Close bags, place in refrigerator, and let tuna rest for at least 30 minutes or up to overnight.\nSerious Eats / J. Kenji López-Alt\nUsing your precision cooker, preheat a water bath according to the chart above. Remove the air from the zipper-lock bags using the\nwater displacement method\n: Seal bag almost all the way, leaving about an inch open. Slowly lower bag into water bath, holding the opened end above the water level. As bag is lowered, the water pressure should force air out of it. Just before it is fully submerged, seal bag completely. Use a rack, or clip bag to the side of cooking vessel using a binder clip to prevent it from moving excessively.\nSerious Eats / J. Kenji López-Alt\nCook 30 to 45 minutes for steaks 1-inch thick or less, or 45 minutes to an hour for steaks between 1 and 2 inches. Carefully remove tuna from bags and transfer to a double layer of paper towels. Discard aromatics and gently blot top of tuna with more paper towels.\nTuna cooked to 105°F has a pleasantly firm yet sashimi-like texture.\nSerious Eats / J. Kenji López-Alt\nFor Sashimi- or Canned-Tuna-Style Fish:\nWrap tuna in plastic wrap and chill in refrigerator for at least 2 hours and up to overnight. Serve rare tuna like sashimi, or well-done tuna in place of canned tuna in any recipe.\nTo Sear:\nSeason tuna aggressively with freshly ground black pepper, or place sesame seeds in a shallow plate and roll tuna steaks to coat on all sides.\nSerious Eats / J. Kenji López-Alt\nHeat vegetable oil in a large cast iron, carbon steel, or nonstick skillet over high heat until lightly smoking. Carefully add tuna and cook, without moving, until golden, 30 to 45 seconds. Carefully flip and cook for an additional 30 to 45 seconds. Using tongs, hold tuna upright to sear edges all around. Transfer to paper towels to blot off excess oil, then serve immediately, serving one large steak for every 2 guests.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nSous vide precision cooker\n;\nlarge cast iron, carbon steel, or nonstick skillet\nNotes\nMany types of tuna are dangerously overfished, and I strongly advise doing some research on the type of tuna you are buying before purchase. The Monterey Bay Aquarium's\nSeafood Watch\nwebsite is a great place to start.\nRead More\nHow to Shop for Sustainable Seafood\nSous Vide Cooking: How to Get Started\nGrilled Tuna Steaks Recipe\nSeared Tuna with Niçoise Vegetables and Garlic Butter Recipe\nSous Vide Seafood\nDairy-free Mains\nGluten-free Mains\nTuna\nSeafood Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sous-vide-tuna-recipe.webp?"
}