{
  "url": "https://www.seriouseats.com/sous-vide-duck-confit-recipe",
  "image_url": null,
  "tags": [
    "Sous Vide",
    "Duck",
    "Duck Mains"
  ],
  "title": "Sous Vide Duck Confit Recipe",
  "full_text": "Sous Vide Duck Confit Recipe\nJump to recipe\nPrep\n10 mins\nCook\n36 hrs 10 mins\nActive\n15 mins\nTotal\n36 hrs 20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nduck\nlegs\nKosher salt\nand freshly ground black pepper\n4\nmedium cloves\ngarlic\n, minced\n4\nsprigs\nthyme\nDirections\nSet up an\nimmersion circulator\nand preheat the water bath to 155°F (68°C).\nSeason duck all over with salt and pepper. Rub garlic onto the meaty side of each leg and set a thyme sprig on top. Slide duck legs into vacuum bags and seal according to vacuum-sealer manufacturer's instructions. Alternatively, seal duck legs in a\nzipper-lock bag using the water displacement method\n,\nAdd sealed duck to water bath and cook for 36 hours. Make sure to top water up occasionally as it evaporates, and keep bag completely submerged. If bag floats, weigh it down by placing a wet kitchen towel on top of it.\nSerious Eats / Vicky Wasik\nRemove duck from water bath and transfer to refrigerator to chill. The duck can be kept refrigerated within the sealed bag for up to 1 week.\nWhen ready to use, remove duck from bag and scrape away thyme sprigs and excess fat and juices. Use duck confit according to any recipe you have; it can be cooked in a 450°F (230°C) oven or broiled until the meat is heated through and the skin is browned and crispy, about 7 minutes.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nImmersion circulator\n,\nvacuum sealer\n(optional)\nNotes\nThis recipe can easily be scaled up or down for any number of duck legs you want to make.\nMake-Ahead and Storage\nAfter being cooked sous vide, the duck can be kept refrigerated, within its sealed bag, for up to 1 week.\nRead More\nTraditional Duck Confit\nKoji Duck Confit\nCrispy Duck Confit With Mixed Bitter Greens Salad\nCrispy Koji Duck Confit With Garlicky Duck-Fat Rice and Umeboshi\nSous Vide\nDuck\nDuck Mains"
}