{
  "url": "https://www.seriouseats.com/sous-vide-salmon-recipe",
  "image_url": null,
  "tags": [
    "Sous Vide Seafood",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Salmon",
    "Seafood Mains"
  ],
  "title": "Sous Vide Salmon Recipe",
  "full_text": "Sous Vide Salmon Recipe\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nActive\n15 mins\nResting Time\n30 mins\nTotal\n90 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nsalmon fillets\n(5 to 6 ounces; 140 to 170g each)\nKosher salt\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\nAromatics\nsuch as\nfresh thyme\n,\ndill\n,\nparsley\n,\nthinly sliced shallots\n, and/or\ncitrus zest\n(optional)\n2\nteaspoons\n(\n10\nml\n)\nvegetable oil\n, if serving seared\nDirections\nSeason salmon generously with salt on all sides.\nSerious Eats / J. Kenji López-Alt\nPlace salmon in a single layer in a gallon-size zipper-lock bag, or in batches in quart-size bags. Add olive oil to bag or divide it between the smaller bags. Add aromatics to bags, if using. Close bags, place in refrigerator, and let salmon rest for at least 30 minutes or up to overnight.\nSerious Eats / J. Kenji López-Alt\nUsing an immersion circulator, preheat a water bath according to the chart above and in notes section. Remove the air from the zipper-lock bags using the\nwater displacement method\n: Seal bag almost all the way, leaving about an inch open. Slowly lower bag into water bath, holding the opened end above the water level. As bag is lowered, the water pressure should force air out of it. Just before it is totally submerged, seal bag completely. Use a rack, or clip bag to the side of cooking vessel using a binder clip, to prevent it from moving excessively. Cook 30 to 45 minutes for fillets 1 inch thick or less, or 45 minutes to an hour for fillets between 1 and 2 inches.\nSerious Eats / J. Kenji López-Alt\nCarefully remove salmon from bags (it will be very delicate) and transfer to a double layer of paper towels. Discard aromatics and gently blot top of salmon with more paper towels.\nSerious Eats / J. Kenji López-Alt\nTo Serve Immediately:\nCarefully peel away skin and discard. Serve salmon immediately with the freshly skinned side down for better presentation.\nSerious Eats / J. Kenji López-Alt\nTo Serve Cold:\nTransfer salmon to refrigerator uncovered and allow it to chill completely. Store in a sealed container for up to a few days and serve cold in sandwiches or salads, stirred into pasta, or on top of rice bowls.\nSerious Eats / J. Kenji López-Alt\nTo Sear:\nHeat vegetable oil in a cast iron, carbon steel, or nonstick skillet over medium-high heat until shimmering. Carefully add salmon skin-side down and cook, pressing gently on fillets with the back of a flexible fish spatula to help maintain pan contact, until skin is browned and crisp, 1 to 1 1/2 minutes. Carefully flip and cook for an additional 15 seconds. Transfer to paper towels to blot off excess oil, then serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nSous vide immersion circulator\n;\nfish spatula\n;\ncast iron\n,\ncarbon steel\n, or\nnonstick skillet\nNotes\nSous Vide Salmon Cooking Temperatures\nTexture\nTemperature\nLike firm sashimi\n105°F (41°C)\nSoft and buttery\n110°F (43°C)\nTranslucent and starting to flake\n115°F (46°C)\nVery moist, tender, and flaky\n120°F (49°C)\nFirm, moist, and flaky\n130°F (54°C)\nRead More\nCrispy Pan-Seared Salmon Fillets Recipe\nOne-Skillet Salmon With Curried Leeks and Yogurt-Herb Sauce Recipe\nGrilled Salmon Fillets Recipe\nQuick and Easy Air-Fryer Salmon Recipe\nSous Vide Seafood\nDairy-free Mains\nGluten-free Mains\nSalmon\nSeafood Mains"
}