{
  "url": "https://www.seriouseats.com/southeastern-indiana-fried-chicken-with-gravy-recipe-8754090",
  "image_url": "https://www.seriouseats.com/thmb/rcJpoFC-R-QIAA1syXgJpTHbobo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241121-SEA--SoutheasternIndianaStyleFriedChickenwithSkilletGravy-QiAi-Hero1-12-2b865a1c3d7c422f8458de80f8727cf9.jpg",
  "tags": [
    "Fried Chicken",
    "The Latest",
    "American"
  ],
  "title": "Indiana Fried Chicken",
  "full_text": "Indiana Fried Chicken\nClose\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nMakes\n12 pieces\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsmall\nwhole chicken\n(as close to 3 pounds as possible)\n1\ntablespoon\nDiamond Crystal\nkosher salt\n,\nplus more to taste; for table salt use half as much by volume\n2 1/2\ntablespoons\ncoarse\nground black pepper\n, such as McCormick, or freshly ground pepper, if necessary, plus more to taste\n4\ncups\n(2 pounds)\npure, non-hydrogenated lard\n2\ncups\nall-purpose flour\n(9 ounces; 255g)\n1 1/2\ncups\n(355ml)\nhomemade chicken stock\nor store bought\nlow-sodium chicken broth\n1\nteaspoon\nsoy sauce\n1/2\nteaspoon\napple cider vinegar\nColeslaw\n,\nmashed potatoes\n,\nbraised green beans\n,\nand\nwarm dinner rolls\n, for serving\nDirections\nUsing a sharp knife, cut the chicken into 12 pieces: 2 breasts split into 2 bone-in pieces each, 2 thighs, 2 drumsticks, 2 wings, and 2 back pieces. You can follow this\nchicken butchering guide\nfor everything but the back pieces. After removing the legs, use kitchen shears to remove the back, including the ribs, and then split it in half crosswise. Trim off wing tips and discard or reserve for stock.\nSerious Eats / Qi Ai\nSerious Eats / Qi Ai\nAdd chicken pieces to a large bowl, season with salt and coarse ground black pepper, and toss the chicken until evenly coated.\nSerious Eats / Qi Ai\nIn a 12-inch cast-iron skillet or a large Dutch oven, add lard and heat over medium-high heat until it reaches 360℉ (180℃), 7 to 10 minutes. (Lard has a smoke point of 370℉ (185℃), so be careful not to go much higher than the recommended temperature.)\nSerious Eats / Qi Ai\nWhile the lard is heating, dredge each piece of seasoned chicken in flour, taking care to coat it thoroughly. Shake off any excess and transfer chicken to a large plate. Reserve flour.\nSerious Eats / Qi Ai\nOnce lard reaches 360℉ (180℃), carefully place the chicken pieces in the hot lard, skin-side-down. The pan will be crowded, but they should fit in a single layer, with a little bit of overlap. (An important note: If you’re using a chicken larger than 3 pounds, you should fry in two batches.) Increase heat to high.\nSerious Eats / Qi Ai\nFry chicken until golden brown on the skin side, adjusting the heat as needed to keep the temperature of the lard between 300 to 325°F (149 to 163℃), 8 to 10 minutes. Flip and cook until the chicken is browned on the other side and cooked through; breasts should reach 160°F, and the thighs and drumsticks 175°F, 5 to 10 minutes.\nSerious Eats / Qi Ai\nUsing tongs, carefully transfer chicken pieces as they finish cooking to a wire rack set over a baking sheet, to drain excess lard. Let chicken rest for 10 minutes before eating.\nSerious Eats / Qi Ai\nWhile chicken rests, carefully use a fine-mesh strainer to strain lard into a heatproof bowl or container, leaving the “crumbs” or “drippings” (browned bits of flour) and a thin slick of lard on the bottom of strainer. Dump the solids from the strainer back into the skillet.\nSerious Eats / Qi Ai\nWhisk 2 tablespoons of the remaining dredging flour into the drippings until combined to form a roux. Cook over medium heat, stirring constantly until flour is cooked through and smells lightly nutty, 2 to 3 minutes.\nSerious Eats / Qi Ai\nSlowly pour in chicken stock, whisking continuously to prevent lumps. Once stock is fully incorporated, bring to a boil, then reduce the heat to maintain a simmer. Cook gravy, whisking occasionally, until thickened, about 5 minutes.\nSerious Eats / Qi Ai\nRemove gravy from heat, then whisk in in soy sauce and vinegar. Season to taste with salt and pepper if needed. (The drippings and soy sauce will add seasoning, so you should only need a modest amount of salt and pepper, if any.)\nSerious Eats / Qi Ai\nServe chicken with coleslaw, mashed potatoes, green beans, and dinner rolls, or other simple sides. Pour gravy over the mashed potatoes and/or serve it alongside the chicken in a small bowl or large ramekin.\nSerious Eats / Qi Ai\nSpecial Equipment\n12-inch cast iron skillet or large Dutch oven, fine-mesh strainer, tongs\nMake-Ahead and Storage\nThis chicken should be enjoyed immediately for best results. Store any leftovers in an airtight container in the refrigerator for up to 3 days.\nFried Chicken\nThe Latest\nAmerican",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/indiana-fried-chicken.webp?"
}