{
  "url": "https://www.seriouseats.com/south-american-cheesy-bread-recipe",
  "image_url": "https://www.seriouseats.com/thmb/32oA7IFzkGTwLDxkNL6fmFMG9gs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__11__20171102-cunapes-cheesy-bread-vicky-wasik-18-180a3c6d2f48453fb01c158d9c55fe5f.jpg",
  "tags": [
    "Quick Breads",
    "South American",
    "Cheddar Cheese",
    "Christmas Sides"
  ],
  "title": "Cuñapes/Pão de Queijo (South American Cheesy Bread) Recipe",
  "full_text": "Cuñapes/Pão de Queijo (South American Cheesy Bread) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n20 mins\nChilling Time\n8 hrs\nTotal\n8 hrs 35 mins\nServes\n18 rolls\nCook Mode\n(Keep screen awake)\nIngredients\n320\ng\n(about\n2 1/4\ncups\n)\nsour tapioca starch\n(see notes)\n8\ng\n(\n2\nteaspoons\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same by weight\n4\ng\n(\n1\nteaspoon\n)\nbaking powder\n160\ng\n(\n2/3\ncup\n)\nwhole milk\n, cold or scalded\n30\ng\n(\n2\ntablespoons\n)\nunsalted butter\n, melted\n2\nlarge\neggs\n100\ng\n(\n3 1/2\nounces\n)\nsharp cheddar cheese\n, chopped\n160\ng\n(\n5.7\nounces\n)\nGrana Padano\ncheese, chopped\nDirections\nIn a large mixing bowl, combine tapioca starch, salt, baking powder, milk, butter, and eggs (for an evenly textured bread use scalded milk; for pops of crusty cheese use cold milk—the choice is yours). Using your hands, knead dough until thoroughly combined, about 2 minutes.\nSerious Eats / Vicky Wasik\nAdd chopped cheddar and Grana Padano to the dough. Knead gently to evenly distribute the cheeses while allowing some larger chunks of cheese to remain, about 2 minutes.\nCover the tapioca dough with plastic wrap pressed directly onto the dough's surface. Refrigerate overnight to allow the starch to fully hydrate.\nPreheat the oven to 375°F (190°C) and adjust oven rack to the center position. Remove tapioca dough from refrigerator and roll into 2-inch balls using the palms of your hands. Make an indentation in the bottom of each roll using the back of a wooden spoon or your thumb.\nSerious Eats / Vicky Wasik\nOn a parchment-lined rimmed baking sheet, arrange the rolls leaving 1 inch of space between them. Bake until puffed and golden brown, about 20 minutes, rotating the pan once during baking. Alternatively, freeze the rolls on the sheet tray until hard, then transfer to a zipper-lock bag to store in the freezer. Bake from frozen as directed above.\nSpecial Equipment\nScale\n, rimmed baking sheet\nNotes\nThis dough feels very different than dough made with wheat flour. After mixing, it appears both runny and thick at the same time, and brittle and dry after the overnight rest. If it's your first time making it, I strongly recommend using a scale until you get accustomed to the texture of the dough. After that, feel free to eyeball quantities, try different cheeses, and add seasonings. As long as the texture of the dough is right, you'll end up with great results every time.\nQuick Breads\nSouth American\nCheddar Cheese\nChristmas Sides"
}