{
  "url": "https://www.seriouseats.com/southern-tomato-pie-recipe-8682897",
  "image_url": "https://www.seriouseats.com/thmb/6NhniFEZGsFZWYybASj728m3EwU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240627-SEA-TomatoPie-Glaze-beauty-18158-SEA-492111386d4d404a80a370c2727c9932.jpg",
  "tags": [
    "The Latest",
    "Tomato",
    "Savory",
    "Baking",
    "Soul Food & Southern"
  ],
  "title": "Cheesy Southern Tomato Pie",
  "full_text": "Cheesy Southern Tomato Pie\nClose\nJump to recipe\nPrep\n10 mins\nCook\n80 mins\nResting and Cooling Time\n2 hrs 30 mins\nTotal\n4 hrs\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1\nhalf recipe\neasy pie dough\nor store-bought refrigerated\npie dough\n, shaped in a 9-inch pie plate as written in the easy pie dough recipe, and chilled for at least 2 hours\n1 1/2\npound\n(\n680\ng)\nheirloom\ntomatoes\nsuch a Cherokee purple, Pruden’s purple, Brandywine, or Amana orange, sliced crosswise into 1/4-inch thick slices\n1\nteaspoon\nDiamond Crystal\nkosher salt\n, divided; for table salt use half as much by volume\n1\ntablespoon\n(\n15\nml)\nextra-virgin olive oil\n1\nmedium\n(\n8 ounces\n) Vidalia or other sweet\nyellow onion\n, thinly sliced\n3/4\ncup\n(180\nml)\nmayonnaise\n(such as Duke’s)\n3\nounces\n(\n85\ng\n) yellow sharp\ncheddar cheese\n, shredded (about\n3/4\ncup\n)\n3\nounces\n(\n85\ng\n) aged white\ncheddar cheese\n, shredded (about\n3/4\ncup)\n2\nteaspoons\ndijon mustard\n1/2\nteaspoon\ngarlic powder\n1/4\nteaspoon\nfreshly\nground black pepper\n1\nlarge\negg\n, lightly beaten\n4\nounces\n(\n113\ng\n) low-moisture\nmozzarella cheese\n, shredded (about\n1\ncup\n), divided\nFresh\nbasil leaves\n, torn, for garnish\nDirections\nPlace tomato slices on a wire rack-lined rimmed baking sheet; season both sides of tomatoes with 1/2 teaspoon of the salt. Let sit for 15 minutes. Pat dry with paper towels. Flip and continue to let sit, patting dry with paper towels and turning every 15 minutes, until a generous amount of liquid has released, about 1 hour.\nSerious Eats / Morgan Hunt Glaze\nMeanwhile, adjust oven rack to middle position and preheat oven to 400°F(205℃). Lightly prick chilled pie shell all over bottom in 1/2-inch intervals. Line pie shell with a double layer of a 14-inch square pieces of parchment paper or aluminum foil, loosley folding over the edges to prevent burning. Fill with pie weights, dried beans, or granulated sugar. Transfer to a parchment or foil-lined rimmed baking sheet and bake until the crust begins to brown around the edges, 10 to 15 minutes. Remove from oven and carefully remove liner and pie weights from par-baked crust and bake the now uncovered crust until the bottom is baked through and set,and just beginning to turn golden brown, about 2 to 5 minutes. Set aside and let cool, about 30 minutes.\nSerious Eats / Morgan Hunt Glaze\nWhile crust cools, in a large stainless-steel skillet, heat oil over medium-high heat until shimmering. Add onion and 1/2 teaspoon salt and cook, stirring occasionally, until browned and softened, 10 to 15 minutes, adding 1 to 2 tablespoons of water if onions start to stick to skillet or get too dark. Transfer to a paper towel-lined plate, and set aside.\nSerious Eats / Morgan Hunt Glaze\nIn a medium bowl, stir together mayonnaise, yellow cheddar, white cheddar, mustard, garlic powder, pepper, egg, and 3/4 cup (3 ounces) of the mozzarella until well combined. Spread half of the mayonnaise mixture (about 1 cup) over the bottom of the cooled pie crust. Pat tomatoes dry one last time, and arrange half of the tomato slices in a single layer on top of mayonnaise mixture (tomatoes should be snug but not overlapping). Scatter half of the cooked onions over the tomatoes. Spread the remaining half of mayonnaise mixture over onions and tomatoes. Layer remaining tomato slices and onions over mayonnaise mixture. Sprinkle with the remaining 1/4 cup (1 ounce) mozzarella.\nSerious Eats / Morgan Hunt Glaze\nBake the tomato pie until the cheese is melted and top is puffed and browned, 35 to 45 minutes. If edges of the crust darken too quickly, place aluminum foil or a pie shield around crust edges to prevent burning. Let cool on a wire rack for at least 1 hour before slicing. Garnish with basil, and serve warm or at room temperature.\nSerious Eats / Morgan Hunt Glaze\nSpecial Equipment\n9-inch pie plate, rolling pin, wire rack, rimmed baking sheet\nMake-Ahead and Storage\nThe Latest\nTomato\nSavory\nBaking\nSoul Food & Southern"
}