{
  "url": "https://www.seriouseats.com/soy-sauce-braised-chicken-thighs-recipe-8737800",
  "image_url": "https://www.seriouseats.com/thmb/_Ie5UkETyiqUscWM5sxEOHTyZLQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241029-SoyBraisedChicken-AmandaSuarez-hero-0aedc780d6ea47a8adffd9cd8b7a778d.jpg",
  "tags": [
    "Chicken Thighs",
    "The Latest",
    "Chicken",
    "Chicken Legs",
    "Chinese"
  ],
  "title": "Soy Sauce–Braised Chicken Thighs",
  "full_text": "Soy Sauce–Braised Chicken Thighs\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nBrining Time (Optional)\n8 hrs\nTotal\n8 hrs 50 mins\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nMSG\n, such as Aji-no-moto\n1 1/2\nteaspoon\nfive spice powder\n, divided\n6 tablespoons\ndark brown sugar\n(about\n3 1/2\nounces\n; 90g), divided\n1/4\nteaspoon\nground\nwhite pepper\n2\npounds\n(906g) bone-in, skin-on\nchicken thighs\n2\ntablespoons\n(30ml) neutral\noil\n, such as vegetable\n8\nscallions\n(\n5 1/2\nounces\n; 150g), green and white parts cut into 2-inch segments\nOne 2-inch piece\nginger\n(1 ounce;\n30\ng\n), peeled and thinly sliced\n5\nmedium\ncloves\ngarlic\n(25g)\n3\nstar anise\nOne\n2-inch piece cassia bark or\ncinnamon stick\n1/4\ncup\n(60ml)\nlight soy sauce\n1/4\ncup\n(60ml) Shaoxing\nwine\n1 1/2\ncups\n(355ml)\nwater\nDirections\nIn a small bowl, whisk together salt, MSG, 1/2 teaspoon five spice powder, 3 tablespoons dark brown sugar, and ground white pepper to combine. Set aside.\nSerious Eats / Amanda Suarez\nUsing a paper towel, pat chicken thighs dry. Season chicken generously on all sides with salt mixture. Transfer to a wire rack set in a rimmed 13- by 18-inch baking sheet and refrigerate, uncovered, at least 8 hours and up to 72. (If skipping dry brine, rub chicken with spice mixture in step 1 and proceed with step 3 of recipe.)\nWhen ready to cook, adjust oven rack to middle position and preheat to 300ºF (150ºC). Using paper towels, pat chicken dry.\nIn a large cast iron or carbon steel skillet set over medium heat, heat vegetable oil until shimmering. Working in batches if necessary, add chicken, skin-side-down, and cook without moving until well-browned and crispy, 4 to 6 minutes. Flip chicken and cook lightly on second side, about 2 minutes. Transfer chicken to a large plate and set aside.\nSerious Eats / Amanda Suarez\nReduce heat to medium-low. Add scallions, ginger, garlic, 1 teaspoon five spice powder, and 3 tablespoons dark brown sugar and cook, stirring, until vegetables are softened and starting to brown, 3 to 5 minutes. Add star anise, cassia bark or cinnamon stick, soy sauce, Shaoxing wine, and water, and bring to a simmer over medium heat.\nSerious Eats / Amanda Suarez\nReturn chicken to pan skin-side-up, leaving the skin above the liquid but submerging most of the meat. Transfer skillet to oven and cook uncovered until chicken is cooked through and tender and registers at least 175ºF (79ºC), about 30 minutes.\nSerious Eats / Amanda Suarez\nRemove pan from oven. Serve with rice and vegetables, if desired.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nWire rack, 13- by 18-inch rimmed baking sheet, cast iron or carbon steel skillet, instant read thermometer\nNotes\nThe cooked chicken can be refrigerated in an airtight container for up to 3 days, but the skin will lose its crispiness. Once cooled, the cooked chicken and the sauce can be frozen together in an airtight container for up to 1 month. Let thaw in the fridge overnight.\nTo reheat chicken, microwave until warmed through, about 1 1/2 minutes.\nChicken Thighs\nThe Latest\nChicken\nChicken Legs\nChinese",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/soy-saucebraised-chicken-thighs.webp?"
}