{
  "url": "https://www.seriouseats.com/spaghetti-pomodoro-crudo-raw-tomato-sauce",
  "image_url": "https://www.seriouseats.com/thmb/ou1coX3xvvI7lsVZFDADVZJlDYQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-Spaghetti-al-Pomodoro-Crudo--Amanda-Suarez-HERO-5dda9340bb1c4b90ac556108ea12b3d4.JPG",
  "tags": [
    "Italian",
    "Vegan Mains",
    "Vegetarian Mains",
    "Stovetop",
    "Spaghetti, Bucatini, & Linguine"
  ],
  "title": "Spaghetti al Pomodoro Crudo (Spaghetti With No-Cook Raw Tomato Sauce) Recipe",
  "full_text": "Spaghetti al Pomodoro Crudo (Spaghetti With No-Cook Raw Tomato Sauce) Recipe\nClose\nJump to recipe\nCook\n10 mins\nActive\n20 mins\nMarinating Time\n15 mins\nTotal\n25 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\npounds\n(\n565\ng\n)\nsummer-ripe tomatoes\n(about\n7\nplum\ntomatoes\n; see notes), cut into 3/4-inch dice\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\n2 to 4\nmedium\ncloves garlic\n(about\n1/2 to 1\nounce\n;\n15-30\ng\n), finely minced by hand\n25\nfresh\nbasil leaves\n(\n25\ng\n), torn into small pieces\nKosher salt\n1\npound\n(\n450\ng\n)\ndried spaghetti\nDirections\nIn a large mixing bowl, stir together tomatoes, olive oil, garlic (use fewer cloves if you want a more mild garlic flavor, and more if you welcome a stronger one), and basil. Season with 1/2 teaspoon salt, stir to combine, and let stand for at least 15 minutes and up to 30 minutes.\nMeanwhile, in a pot of salted boiling water, cook spaghetti until al dente. Using tongs, transfer pasta to tomato mixture, reserving pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water, then transfer to bowl with tomatoes. Stir well to dress pasta with tomato mixture. If pasta becomes too dry, add reserved pasta cooking water in 1/4 cup (60ml) increments as needed to dress the pasta. Season with salt to taste. Transfer to individual serving bowls, and serve.\nNotes\nVirtually any\nvariety of tomato\nwill work for this recipe, whether fleshy plums, juicy beefsteaks, heirlooms, or cherries; what's most important is that they be fully ripe. If using larger tomatoes, core them before dicing.\nMake-Ahead and Storage\nThis pasta is best made right before serving, though it's pretty tasty at room temperature as leftovers. Leftovers can be refrigerated in an airtight container for up to 2 days.\nItalian\nVegan Mains\nVegetarian Mains\nStovetop\nSpaghetti, Bucatini, & Linguine"
}