{
  "url": "https://www.seriouseats.com/spaghetti-cacio-e-pepe-recipe",
  "image_url": null,
  "tags": [
    "Pasta Mains",
    "Italian",
    "Vegetarian Mains",
    "Stovetop Pasta",
    "Spaghetti, Bucatini, & Linguine"
  ],
  "title": "Cacio e Pepe (Spaghetti With Black Pepper and Pecorino Romano)",
  "full_text": "Cacio e Pepe (Spaghetti With Black Pepper and Pecorino Romano)\nJump to recipe\nCook\n20 mins\nActive\n10 mins\nTotal\n20 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ntablespoons\n(\n60\nml\n)\nextra-virgin olive oil\n, divided\n1\nteaspoon\ncoarsely ground black pepper\n, to taste\n1/2\npound\n(\n225\ng\n)\nspaghetti\nKosher salt\n, to taste\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n2\nounces\nPecorino Romano cheese\n(about\n1\ncup\n;\n55\ng\n), very finely grated on a Microplane or the smallest holes of a box grater, plus more for serving\nDirections\nHeat 3 tablespoons olive oil and about a teaspoon of black pepper in a medium skillet over medium-low heat until ingredients are fragrant and pepper is barely starting to sizzle, about 1 minute. Set aside.\nSerious Eats / Julia Estrada\nPlace spaghetti in a large skillet and cover with water. Season with a small pinch of salt, then bring to a boil over high heat, prodding spaghetti occasionally with a fork or wooden spoon to prevent it from clumping. Cook until spaghetti is al dente (typically about 1 minute less than the package recommends). Transfer 2 to 3 tablespoons of pasta cooking water to the skillet with the olive oil/pepper mixture. Stir in butter. Using tongs, lift spaghetti and transfer it to the oil/butter mixture.\nSerious Eats / Julia Estrada\nAdd cheese and remaining tablespoon olive oil to the skillet and stir with a fork until cheese is completely melted. Add a few more tablespoons of pasta water to the skillet to adjust consistency, reheating as necessary until the sauce is creamy and coats each strand of spaghetti. Season to taste with salt and more black pepper. Serve immediately, passing extra grated cheese and black pepper at the table.\nSerious Eats / Julia Estrada\nPasta Mains\nItalian\nVegetarian Mains\nStovetop Pasta\nSpaghetti, Bucatini, & Linguine"
}