{
  "url": "https://www.seriouseats.com/spaghetti-squash-slaw-recipe-8730998",
  "image_url": "https://www.seriouseats.com/thmb/oExpLaJBrZtSiEzF8Q5-yf12vws=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211115-Spaghetti-Squash-Slaw-Mint-Hazelnuts-Pomegranate-Jillian-Atkinson_Hero_1-546cab60c94f42b6b71281ad444410ac.jpg",
  "tags": [
    "Winter Squash",
    "Salads",
    "Vegetarian",
    "Vegan",
    "Gluten-free Salads"
  ],
  "title": "The Surprising Method for Delicious Spaghetti Squash Every Single Time",
  "full_text": "The Surprising Method for Delicious Spaghetti Squash Every Single Time\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nCooling and Assembly Time\n60 mins\nTotal\n100 mins\nServes\n4\nto 6 Servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne 3 1/2-pound (1.6kg) spaghetti squash\n1/2 cup (120ml) extra-virgin olive oil, plus more for drizzling on squash\nKosher salt\n1/2 cup (2 1/2 ounces; 70g) hazelnuts, roughly chopped\n1/8 teaspoon cayenne pepper\n1 teaspoon (5ml) apple cider vinegar\n1/2 cup (3 ounces; 85g) pomegranate seeds, plus more for garnish\n15 fresh mint leaves, roughly torn, plus more for garnish\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (200°C). Line a rimmed baking sheet with aluminum foil and set aside. Using a large knife, trim off stem end of spaghetti squash. Cut squash in half lengthwise, then scrape out and discard seeds. Arrange, cut side up, on prepared baking sheet. Drizzle lightly with olive oil, and rub all over until evenly coated. Season with salt.\nJillian Atkinson\nRoast squash until its flesh can be pierced with a fork without much resistance but the squash retains an al dente texture, about 35 minutes. Set aside to cool to room temperature.\nJillian Atkinson\nMeanwhile, combine 1/2 cup olive oil and hazelnuts in a medium skillet. Set over medium heat and cook, stirring frequently, until nuts are lightly toasted and fragrant, about 4 minutes. Stir in cayenne and remove from heat.\nJillian Atkinson\nWhen squash has cooled, use a fork to shred flesh into spaghetti-like strands, transferring them to a serving bowl as you go. Discard skins.\nJillian Atkinson\nStir in toasted hazelnuts and the oil along with the apple cider vinegar and pomegranate seeds. Season with salt, then stir in mint. Garnish with additional pomegranate seeds and mint leaves and serve right away.\nJillian Atkinson\nMake-Ahead and Storage\nThe squash can be roasted up to 3 days in advance; once cooled, wrap tightly with plastic and refrigerate until ready to shred and assemble the salad. The hazelnuts can be toasted in the olive oil up to 3 days in advance; let cool, then refrigerate in an airtight container until ready to use. The salad should be assembled just before serving, otherwise the pomegranate seeds and mint will darken and lose their freshness.\nWinter Squash\nSalads\nVegetarian\nVegan\nGluten-free Salads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-surprising-method-for-delicious-spaghetti-squash-every-single-time.webp?"
}