{
  "url": "https://www.seriouseats.com/spaghetti-allo-scoglio-mixed-seafood-spaghetti",
  "image_url": "https://www.seriouseats.com/thmb/UnQ-J1oxaULCVLVdyV5nVSZnwR0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210301-Spaghetti-Allo-Scoglio-Tim-Chin-20-639123ce316c4dbc8c3f30984295d5fa.jpg",
  "tags": [
    "Spaghetti, Bucatini, & Linguine",
    "Italian",
    "Pastas",
    "Seafood Mains",
    "The Latest"
  ],
  "title": "Spaghetti allo Scoglio (Spaghetti With Mixed Seafood)",
  "full_text": "Spaghetti allo Scoglio (Spaghetti With Mixed Seafood)\nClose\nJump to recipe\nCook\n30 mins\nActive\n30 mins\nPurging Time\n60 mins\nTotal\n90 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1\npound\n(\n450\ng\n)\nfresh small clams\n, such as\nlittlenecks\n,\nManilas\n, or\ncockles\n, scrubbed\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, divided, plus extra for drizzling\n3\nmedium\nshallots\n, thinly sliced (about\n4 1/4\nounces\n;\n120\ng\n)\n4\ngarlic\ncloves\n(\n20\ng\n), minced\n1/2\nteaspoon\nred pepper flakes\n1\ncup\n(\n240\nml\n)\ndry white wine\n1\npound\n(\n450\ng\n)\nmussels\n,\nscrubbed and debearded\n(see note)\n1\n(\n8\n-\nounce\n;\n240\nml)\nbottle\nclam juice\n12\nounces\n(\n340\ng\n)\ndried spaghetti\n,\nspaghettoni\n, or\nlinguine\n8\nounces\n(\n225\ng\n)\nlarge shrimp\n, peeled, deveined, and halved crosswise\n8\nounces\n(\n225\ng\n)\ncleaned squid\n, bodies sliced into 1/2-inch-thick rings, small tentacles left whole, larger ones halved (see note)\n8\nounces\n(\n225\ng\n)\ncherry tomatoes\n, halved\n1/2\ncup\n(\n30\ng\n)\nchopped fresh parsley leaves and tender stems\n2\ntablespoons\n(\n30\nml\n)\nfresh lemon juice\nfrom\n1/2\nmedium\nlemon\nDirections\nFill a large bowl with cold water and stir in enough salt to make it salty like the sea (a 3% salt solution, by weight, is a good ratio). Add clams and let stand for 30 minutes. Lift clams from bowl and discard sandy water. Rinse out bowl and repeat this purging process until clams no longer release sand into the water (usually 2 to 3 purging cycles). Discard any clams that are gaping open and refuse to close when tapped. Set clean clams aside.\nHeat 3 tablespoons (45ml) oil in a deep 12-inch skillet over medium-high heat until shimmering. Add shallots, season lightly with salt, and cook, stirring occasionally, until shallots start to soften, about 5 minutes. Add garlic and red pepper flakes and cook, stirring constantly, until fragrant, about 30 seconds.\nAdd wine and clams, increase heat to high, cover, and cook, shaking pan frequently, for 4 minutes. Uncover and, using tongs, transfer any clams that have opened to a medium bowl; cover bowl with foil to keep warm. Add mussels to skillet, cover, and continue to cook, shaking pan frequently and uncovering to stir and check shellfish every 45 seconds, until clams and mussels have all opened, 3 to 4 minutes longer. Using tongs, quickly transfer shellfish to bowl, and cover; leave aromatics and liquid in pan. Discard any clams or mussels that do not open.\nAdd clam juice and 2 cups (475ml) water to skillet and bring mixture to a boil over high heat. Add spaghetti and cook, stirring constantly for the first 30 seconds to prevent noodles from sticking and then stirring occasionally, until pasta begins to have some flexibility and is softened on the exterior, but well shy of al dente and still uncooked in the center, about 3 minutes less than the package directions. Add water in 1/4 cup (60ml) increments as needed to ensure pasta cooks evenly and doesn't stick to the bottom of the pan.\nMeanwhile, pull meat from about half of the clam shells and half of the mussel shells; discard empty shells and return shucked clams and mussels to bowl with remaining shell-on shellfish. Cover to keep warm.\nWhen pasta is just softened on the exterior, add shrimp and squid to skillet. Continue to cook over high, stirring and tossing, until shrimp and squid are just cooked through, 2 to 4 minutes.\nAdd tomatoes and all of the mussels and clams, along with any accumulated juices, and continue to cook over high, stirring and tossing constantly, until all of the seafood is heated through, pasta is al dente, and sauce is creamy and coats the pasta, about 1 minute; add more water, 2 tablespoons (30ml) at a time, if sauce over-reduces and becomes dry or greasy. Remove from heat, add parsley and lemon juice, and toss rapidly to incorporate. Season with salt to taste.\nTransfer to a large serving bowl or divide between individual serving bowls, arranging shell-on mussels and clams on top of pasta. Drizzle with remaining 1 tablespoon (15ml) oil, and serve.\nSpecial Equipment\n12-inch skillet with lid\nNotes\nSmall clams, such as littlenecks, Manilas, and cockles work best for this dish. Larger clams, such as cherrystones ,will take longer to cook and their meat will have to be chopped before being added to the spaghetti.\nExamine mussels before using. Discard cracked mussels or open mussels that don't close when tapped with another mussel. Farm-raised mussels are generally quite clean when sold, but they can still have grit and beards that need to be removed. Remove grit by scrubbing mussels well under cold running water, and remove beards (they look like wisps of hair coming out from between their shells) by grabbing them and pulling toward the hinge-end of the mussels; discard the beards once removed. For more information, view our\ndetailed guide to cleaning and debearding mussels\n.\nFor the squid, this recipe can be made with just bodies (tubes), or a combination of bodies and tentacles.\nMake-Ahead and Storage\nThis dish is best enjoyed immediately.\nSpaghetti, Bucatini, & Linguine\nItalian\nPastas\nSeafood Mains\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/spaghetti-allo-scoglio-spaghetti-with-mixed-seafood.webp?"
}