{
  "url": "https://www.seriouseats.com/spaghetti-and-meatballs-recipe-8729264",
  "image_url": "https://www.seriouseats.com/thmb/i8nub1EAGqdzY1cQNK3H5Zif1_g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__01__20210118-spaghetti-meatballs-vicky-wasik-25-1-43c661c3cb6d495f8d730e6ac817cebf.jpg",
  "tags": [
    "Pastas",
    "Tomato Sauces",
    "Ground Beef",
    "Pork"
  ],
  "title": "Ya Gotta Break a Few Balls for the Best Spaghetti and Meatballs. (Seriously.)",
  "full_text": "Ya Gotta Break a Few Balls for the Best Spaghetti and Meatballs. (Seriously.)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n70 mins\nTotal\n90 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Meatballs and Sauce:\n2 1/2 ounces (75g) fresh, crustless\nwhite bread\n, cut into 1/2-inch\ncubes\n(about\n2\nunpacked\ncups\n)\n1/2\ncup\n(120ml)\nwhole milk\n1 medium\nyellow onion\n(8-ounces;\n225\ng\n) , minced\n6\nmedium\ncloves garlic\n(about 1 ounce; 30g), finely minced\n1 1/2\nounces\n(45g)\nParmigiano-Reggiano\n, grated\n3\nounces\n(85g)\npancetta\n, finely minced\n3\nlarge\negg yolks\n1/3\ncup\nloosely packed\nflat-leaf parsley\nleaves and tender stems (3/4 ounce; 20g), minced\n2\nteaspoons\nDiamond Crystal\nkosher salt\n(8g); for table salt use half as much by volume or the same weight\n1/2\nteaspoon\nfreshly\nground black pepper\n3/4\nteaspoon\ndried oregano\n3/4\nteaspoon\nground fennel seed\n1\npound\n(450g)\nground beef\n(at least 25% fat; see note)\n1/2\npound\n(225g)\nground pork\n(at least 25% fat; see note)\n3\ntablespoons\n(45ml)\nextra-virgin olive oil\n2\nquarts\n(2L)\ntomato sauce\n, such as\nQuick and Easy Italian-American Red Sauce\nTo Finish 4 Servings of Spaghetti and Meatballs:\n1\npound\n(450g)\nspaghetti\nKosher salt\n2\nounces\n(55g) finely grated\nParmigiano-Reggiano\n, plus more for sprinkling\nDirections\nFor the Meatballs and Sauce:\nIn the bowl of a stand mixer (see notes below for instructions if not using a stand mixer), combine bread with milk, tossing to coat. Let stand, tossing occasionally, until bread is completely moist, about 10 minutes. Squeeze bread between your fingers or mash with a spoon to make sure there are no dry spots.\nAdd onion, garlic, Parmigiano-Reggiano, pancetta, egg yolks, parsley, salt, pepper, oregano, and fennel to bread mixture.\nSet mixer bowl in stand mixer and fit with paddle attachment. Starting at low speed and gradually increasing to medium-high, beat bread mixture until thoroughly blended, stopping to scrape down sides as necessary. Add 1/3 each of the beef and pork and beat at medium-high speed until thoroughly blended with bread mixture.\nRemove bowl from stand mixer and add remaining beef and pork. Using a clean hand, gently mix meatball mixture, teasing apart ground meat with your fingers, just until ground beef and pork are thoroughly mixed in and no pockets of unincorporated meat remain; avoid mixing any more than is necessary for even distribution.\nLine a rimmed baking sheet with parchment paper. Using clean hands, roll meatball mixture into 32 golf ball-sized balls (1 ounce/30g each); there will be some meatball mixture left over.\nIn a large enameled Dutch oven, heat olive oil over medium heat until shimmering. Working in 2 batches, add meatballs and cook, turning occasionally with a thin metal spatula, until browned on several sides, about 2 minutes per side. Transfer browned meatballs back to parchment-lined baking sheet and repeat with remaining meatballs.\nAdd reserved meatball mixture to Dutch oven and cook, stirring and breaking up large chunks with a wooden spoon, until cooked through and beginning to brown, about 5 minutes.\nAdd tomato sauce, stirring and scraping up any browned bits. Bring to a simmer over medium-high heat. Add seared meatballs back to Dutch oven, return sauce to a simmer, then lower heat to maintain a gentle simmer. Cook until meatballs are fully cooked through, about 10 minutes.\nTo Finish 4 Servings of Spaghetti and Meatballs:\n[Note: The following instructions are for 4 servings; see serving tips above for other ways to portion and serve the pasta and sauce]:\nSpoon half the sauce and meatballs into a large skillet or sauté pan; set remaining sauce and meatballs aside to cool to room temperature, then refrigerate or freeze in an airtight container.\nIn a pot of salted, boiling water, cook spaghetti, stirring frequently to prevent sticking, until just shy of al dente, about 2 minutes less than package recommends.\nUsing tongs, transfer spaghetti directly into simmering sauce along with 1/4 cup (60ml) pasta cooking water, and stir to combine. Cook, stirring constantly, until pasta is al dente and sauce has thickened so it coats noodles and isn't watery, 2 to 3 minutes. Remove from heat.\nAdd Parmigiano-Reggiano, stirring well to emulsify into sauce. If tomato sauce is too thick, adjust consistency as needed with additional pasta water.\nDivide spaghetti and meatballs between individual serving bowls, and serve, passing more grated cheese at the table.\nSpecial equipment\nStand mixer\n,\n5 1/2-quart Dutch oven\nNotes\nIt can be difficult to guarantee the fat percentage of pre-ground meat, but a higher-fat mix of about 25% is one of the keys to juicy and tender meatballs, so do your best to track down ground beef and pork from a meat counter or butcher that can get you the meat ground to your specifications. Similarly, the meat should be a fine or medium grind, not coarse, so make sure to confirm a proper grind when buying. Of course you can control all of this by grinding the meat yourself using cuts like beef chuck and pork shoulder, both of which will get you in the ballpark of the fat percentage you need; if you do grind the meat yourself, you can save time by running the pancetta through the grinder too (just make sure it's nice and cold before grinding).\nA stand mixer is able to quickly and powerfully combine all of the meatball ingredients, but you don't have to use one. If making the meatballs without a stand mixer, follow all of the instructions, but use clean hands to thoroughly mix and squish everything together until very well combined.\nMake-Ahead and Storage\nThe cooked meatballs and sauce can be refrigerated in an airtight container for up to 5 days, and frozen for up to 1 month. Reheat gently on the stovetop before serving.\nPastas\nTomato Sauces\nGround Beef\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ya-gotta-break-a-few-balls-for-the-best-spaghetti-and-meatballs-seriously.webp?"
}