{
  "url": "https://www.seriouseats.com/spaghetti-all-assassina-8733170",
  "image_url": "https://www.seriouseats.com/thmb/zyUFyusIMeWQoYdOsjJm9nDmj_I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241024-spaghettiallassasina-AmandaSuarez13-d76f630503a04d26bb37ad4a712010d1.jpg",
  "tags": [
    "Spaghetti, Bucatini, & Linguine",
    "The Latest",
    "Italian"
  ],
  "title": "Spaghetti All'Assassina",
  "full_text": "Spaghetti All'Assassina\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\n(355ml) store-bought or homemade\ntomato passata\n(see notes)\nKosher salt\n1/2\ncup\n(118ml)\nextra-virgin olive oil\n, plus more as needed\n3\nmedium\ncloves\ngarlic\n, crushed\n1\nteaspoon\ndried\nchile flakes\nor about 1 tablespoon thinly sliced hot red chiles\n1\ntablespoon\ntomato paste\n1/2\npound\n(226g) dried\nspaghetti\nStracciatella cheese\n, for garnish (optional)\nDirections\nIn a 4-cup measuring cup, dilute tomato passata with water to total 2 1/2 cups. Season sauce lightly with salt.\nSerious Eats / Amanda Suarez\nIn a 12-inch cast iron, carbon steel, or nonstick skillet (see headnote above to decide which you want to use), heat oil with garlic and chiles over medium-high heat until sizzling and garlic has turned light golden; remove garlic with a slotted spoon, if desired. Stir in tomato paste and cook for 30 seconds, then pour in enough diluted tomato sauce to just cover the bottom of skillet, increase heat to high, and bring to a boil.\nSerious Eats / Amanda Suarez\nAdd spaghetti, spreading it out to cover skillet bottom, sprinkle lightly with salt, and cook until liquid is mostly absorbed. Add more tomato sauce to just cover spaghetti and continue to cook, using a thin metal spatula (unless using a nonstick pan, in which case use silicone) to occasionally rotate pasta top to bottom and while moving it around to prevent excessive adhering of strands. Continue to cook the spaghetti in this way, cooking sauce down between additions before adding the next, until pasta is al dente, about 10 minutes (cooking times are approximate and will depend on how much sauce is added in each increment and other factors); continue to stir, scrape, and toss spaghetti occasionally throughout this process while allowing sauce to reduce and pasta and sauce to brown lightly in spots.\nSerious Eats / Amanda Suarez\nOnce pasta is al dente, allow sauce to reduce one final time, and continue to cook over high heat until browned an lightly charred; scrape and toss pasta and allow to brown and char again. Once pasta is nicely crisped and charred in several spots, toss one final time with a glug of fresh olive oil, and season with salt to taste if necessary.\nSerious Eats / Amanda Suarez\nTransfer to plates and serve, topping with stracciatella, if desired.\nSerious Eats / Amanda Suarez\nNotes\nIn pace of tomato passata, you can also use a blender to puree a can of whole peeled tomatoes with their juices, then dilute 1 1/2 cups of that with water to equal 2 1/2 cups diluted tomato sauce.\nSpecial Equipment\n12-inch nonstick, cast iron, or carbon steel skillet\nSpaghetti, Bucatini, & Linguine\nThe Latest\nItalian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/spaghetti-allassassina.webp?"
}