{
  "url": "https://www.seriouseats.com/spaghetti-puttanesca-pasta-week-capers-olives-anchovies-recipe",
  "image_url": null,
  "tags": [
    "Italian",
    "Spaghetti, Bucatini, & Linguine",
    "Anchovies",
    "Pasta Mains",
    "Quick Dinners"
  ],
  "title": "Spaghetti Puttanesca (Spaghetti With Capers, Olives, and Anchovies)",
  "full_text": "Spaghetti Puttanesca (Spaghetti With Capers, Olives, and Anchovies)\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nTotal\n20 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\n(\n90\nml\n)\nextra-virgin olive oil\n, divided\n4\nmedium\ngarlic cloves\n, thinly sliced or finely chopped by hand (see notes)\n4\nto\n6\nanchovy\nfillets\n, finely chopped (\n1 1/2\nto\n2\ntablespoons\n)\nLarge pinch\nred pepper flakes\n1/4\ncup\ncapers\n, drained and chopped (about\n2\nounces\n;\n60\ng\n) (see note)\n1/4\ncup\nchopped pitted black olives\n(about\n2\nounces\n;\n60\ng\n) (see note)\n1\ncup\n(\n225\ng\n)\nwhole peeled tomatoes\n, preferably San Marzano, roughly broken up by hand (about\n1/2\na\n14-ounce\ncan\n)\n1 (\n5-ounce\n;\n140 g\n)\ncan oil-packed tuna\n(optional)\nKosher salt\n8\nounces\n(\n225\ng\n)\ndried spaghetti\n1\nsmall handful\nminced fresh parsley leaves\n1\nounce\n(\n30\ng\n)\nfinely grated Pecorino Romano\nor Parmesan cheese, plus more for serving\nFreshly ground black pepper\nDirections\nIn a medium skillet, combine 4 tablespoons (60ml) oil, garlic, anchovies, and red pepper flakes. Cook over medium heat until garlic is very lightly golden, about 5 minutes. (Adjust heat as necessary to keep it gently sizzling.) Add capers and olives and stir to combine.\nSerious Eats / J. Kenji López-Alt\nAdd tomatoes, stir to combine, and bring to a bare simmer. If using, stir in canned tuna, flaking it gently with a fork. Remove from heat.\nSerious Eats / J. Kenji López-Alt\nMeanwhile, in a 12-inch skillet, 12-inch sauté pan, or large saucepan of lightly salted boiling water, cook spaghetti until just shy of al dente, about 2 minutes less than package directions.\nSerious Eats / Melissa Hom\nUsing tongs, transfer pasta to sauce. Alternatively, drain pasta through a colander, reserving 1 cup of the cooking water. Add drained pasta to sauce.\nSerious Eats / J. Kenji López-Alt\nAdd a few tablespoons of pasta water to sauce and set over medium-high heat to bring pasta and sauce to a vigorous simmer. Cook, stirring and shaking the pan and adding more pasta water as necessary to keep sauce loose, until pasta is perfectly al dente, 1 to 2 minutes longer. (The pasta will cook more slowly in the sauce than it did in the water.) Remove from heat and stir in remaining olive oil, parsley, and cheese. Season with salt and pepper (be generous with the pepper and scant with the salt—the dish will be plenty salty from the other ingredients). Serve immediately with more grated cheese at the table.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\n12-inch skillet\n,\nlarge sauté pan\n, or\nlarge saucepan\n;\nmedium skillet\n;\ntongs\nNotes\nI don't recommend using a Microplane, grater, or garlic press in this dish, as the garlic will end up burning before it can really flavor the oil. This is one of those instances where\nthe method of mincing really does matter\n.\nCheck out our guide on\nhow to chop capers and olives\nfor detailed instructions.\nRead More\nPasta al Tonno (Pasta With Tomatoes and Tuna) Recipe\nRoman-Style Spaghetti Alla Carrettiera (Tomato, Tuna, and Mushroom Pasta) Recipe\nPasta Burro e Alici (Pasta With Creamy Anchovy-Butter Sauce Recipe\nPasta c'Anciuova e Muddica Atturrata (Sicilian Pasta With Anchovies and Toasted Breadcrumbs) Recipe\nCreamy Bean Dip With Roasted Tomato Puttanesca Salad Recipe\nItalian\nSpaghetti, Bucatini, & Linguine\nAnchovies\nPasta Mains\nQuick Dinners"
}