{
  "url": "https://www.seriouseats.com/spaghetti-alla-nerano-zucchini-pasta-recipe-11734961",
  "image_url": "https://www.seriouseats.com/thmb/A0pUyaAwVn0d0H0jejPS3REQ0tU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250511-SpaghettiallaNarano-Qi-Ai-hero-horizontal-angled-A-60ade0bd04824acf878b6372be7b4f54.jpg",
  "tags": [
    "Spaghetti, Bucatini, & Linguine",
    "The Latest",
    "Recipes",
    "Pastas",
    "Zucchini & Yellow Squash"
  ],
  "title": "How to Make That Famous Amalfi Zucchini Pasta Beloved by Stanley Tucci",
  "full_text": "How to Make That Famous Amalfi Zucchini Pasta Beloved by Stanley Tucci\nClose\nJump to recipe\nPrep\n15 mins\nCook\n35 mins\nTotal\n50 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/2\npounds\nzucchini\n(\n1.15\nkg\n; about\n5\nmedium\n), sliced crosswise into 1/4-inch thick rounds, room temperature\n3\ncups\n(\n720\nml\n)\nneutral oil\nsuch as canola oil\n1\ncup\nplus\n3\ntablespoons\n(\n285\nml\n)\nolive oil\n, divided\n1 1/2\nteaspoons\nplus\n2\ntablespoons\nDiamond Crystal kosher salt\n, divided, plus more to taste; for table salt use half as much by volume\n1\npound\ndried\nspaghetti\n3\ncloves\ngarlic\n, finely minced or grated\n3\nounces\nCaciocavallo\nor Pecorino Romano cheese, finely grated\nFreshly ground\nblack pepper\nto taste\n1/4\ncup\nsmall fresh\nbasil leaves\nfor garnish\nDirections\nLine a rimmed baking sheet with a triple layer of paper towels and set aside. Pour neutral oil and 1 cup olive oil into a large Dutch oven or large heavy-bottomed pot (oil should measure about 1-inch deep). Heat oil over medium heat to 350°F (175°C). Carefully place 1/3 of the zucchini rounds into oil and fry until light golden brown, 6 to 8 minutes, stirring often to avoid zucchini sticking together or to the bottom of the pan. Use a spider skimmer or slotted spoon to transfer fried zucchini to prepared lined baking sheet. Return oil to 350°F (175°C) and repeat frying remaining 2 batches of zucchini. Sprinkle fried zucchini evenly with 1/2 teaspoon kosher salt (do not over salt at this point). Let cooking oil cool completely before disposing or storing. At this point, you can proceed with step 2 immediately or cool and refrigerate the zucchini for up to 1 day before continuing with the recipe.\nSerious Eats / Qi Ai\nBring a large pot of water to a boil over high heat. Add remaining 2 tablespoons salt, return to a boil, then add spaghetti and cook until pasta is softened on the exterior, but well shy of al dente and still uncooked in the center (about 3 minutes less than the package directions). Reserve 2 cups of cooking water, then drain pasta in a colander.\nSerious Eats / Qi Ai\nIn a large high-sided skillet, heat remaining 3 tablespoons olive oil over medium heat until shimmering. Add garlic and cook, stirring often, until fragrant but not beginning to brown, about 1 minute. Add half of the fried zucchini and use a wooden spoon to mash it into a paste with garlic. Add par-cooked pasta and 1 1/4 cups of reserved cooking water, and remaining 1 teaspoon salt and cook, stirring vigorously, until sauce is emulsified and spaghetti is al dente, 3 to 5 minutes. If sauce reduces too much before pasta has finished cooking, add more reserved pasta water to skillet in 1/4-cup increments.\nSerious Eats / Qi Ai\nRemove skillet from heat, add the grated cheese, and stir rapidly to combine. Adjust sauce consistency as desired with more pasta water. Sauce should be fluid and coat the spaghetti easily, but not be runny. Season to taste with salt and pepper. Transfer to a serving bowl and arrange remaining fried zucchini rounds and basil over top. Serve.\nSerious Eats / Qi Ai\nSpecial Equipment\nLarge Dutch oven or large heavy-bottomed pot, spider skimmer or large slotted spoon, large high-sided skillet, wooden spoon\nMake-Ahead and Storage\nThe zucchini can be fried (step 1), cooled, and refrigerated in an airtight container for up to 1 day before proceeding with the recipe. Briefly warm zucchini in a large skillet with 1 tablespoon oil over high heat until warmed through, about 2 minutes before proceeding with recipe.\nLeftovers can be refrigerated in an airtight container for up to 5 days.\nSpaghetti, Bucatini, & Linguine\nThe Latest\nRecipes\nPastas\nZucchini & Yellow Squash",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-make-that-famous-amalfi-zucchini-pasta-beloved-by-stanley-tucci.webp?"
}