{
  "url": "https://www.seriouseats.com/spanish-style-garlic-shrimp-gambas-al-ajillo-recipe",
  "image_url": null,
  "tags": [
    "Shrimp",
    "Spanish",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Stovetop Seafood"
  ],
  "title": "Gambas al Ajillo (Spanish-Style Garlic Shrimp)",
  "full_text": "Gambas al Ajillo (Spanish-Style Garlic Shrimp)\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nActive\n30 mins\nTotal\n30 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\ncloves\ngarlic\n1\npound\nlarge shrimp\n, peeled, shells reserved\n1/2\ncup\nextra-virgin olive oil\nKosher salt\n1/4\nteaspoon\nbaking soda\nPinch\nred pepper flakes\n, or\n1\n(\n1-inch) piece\ndried guajillo chile\n1 1/2\nteaspoons\nsherry vinegar\n2\ntablespoons\nchopped fresh parsley leaves\nDirections\nFinely mince 4 garlic cloves and place in large bowl. Smash 4 cloves under the flat side of a knife and place in a large skillet. Thinly slice remaining four garlic cloves and set aside.\nSerious Eats / Julia Estrada\nAdd shrimp to bowl with minced garlic. Add 3 tablespoons olive oil, 3/4 teaspoon kosher salt, and baking soda. Toss to combine thoroughly and set aside at room temperature.\nSerious Eats / Julia Estrada\nAdd shrimp shells to skillet with smashed garlic and add remaining olive oil and pepper flakes. Set over medium-low to low heat and cook, stirring and tossing occasionally, until shells are deep ruby red, garlic is pale golden brown, and oil is intensely aromatic, about 10 minutes. Oil should be gently bubbling the whole time. When ready, strain through a fine-mesh strainer into a small bowl, tossing and pressing the shrimp shells to extract as much oil as possible. Discard shells and garlic.\nSerious Eats / Julia Estrada\nReturn flavored oil to skillet and heat over medium-high heat until shimmering. Add sliced garlic and cook, stirring constantly, until pale golden brown, about 1 minute. Add shrimp and cook, tossing and stirring constantly until shrimp are barely cooked through, about 2 minutes. Add sherry vinegar and parsley and toss to combine. Season to taste with salt. Serve immediately.\nSerious Eats / Julia Estrada\nShrimp\nSpanish\nDairy-free Mains\nGluten-free Mains\nStovetop Seafood"
}