{
  "url": "https://www.seriouseats.com/spicy-tomato-tonnato-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/V8-6hoGOeFMCYa_8fSotACggzag=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190809-tomato-tonnato-salad-vicky-wasik27-5b81150503784471bcbae4f73f73c068.jpg",
  "tags": [
    "Dairy-free Salads",
    "Gluten-free Salads",
    "No-Cook Salads",
    "Tuna",
    "Tomato"
  ],
  "title": "Summer Tomato Salad With Spicy Tonnato",
  "full_text": "Summer Tomato Salad With Spicy Tonnato\nClose\nJump to recipe\nPrep\n15 mins\nActive\n15 mins\nTotal\n15 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spicy Tonnato:\n1\nripe\nbeefsteak tomato\n(about\n10\nounces\n;\n285\ng\n)\nKosher salt\n1\nlarge egg\n2\ntablespoons\n(\n30\nml\n)\nfresh lemon juice\n(from\n1\nwhole\nlemon)\n2\nanchovy\nfillets\n(about\n1/4\nounce\n;\n7\ng\n)\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n1\nteaspoon\n(\n5\ng\n)\ncapers\n, drained\n1/2\ncup\n(\n120\nml\n)\nvegetable oil\n4\nounces\n(\n113\ng\n) oil-packed\ntuna\n, such as Ortiz, drained\n1 to 2\ntablespoons\n(\n15 to 30\ng\n) Turkish\nhot pepper paste\n(see notes), plus more if desired\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\nFor the Salad:\n2\npounds\n(\n900\ng\n) mixed ripe\ntomatoes\n(see notes)\nToasted black\nsesame seeds\nand coarse sea salt, for serving (optional)\n15 to 20\nfresh\nbasil leaves\n, large leaves torn and small leaves left whole\nDirections\nFor the Spicy Tonnato:\nUsing a sharp\nchef's knife\nor\nserrated knife\n, slice off the very bottom of the tomato. Place a box grater in a medium bowl. Rub cut face of tomato over large holes of box grater, using the flat palm of your hand to move the tomato back and forth. The flesh should be grated off while the skin remains intact in your hand. Discard skin and season tomato pulp lightly with kosher salt to taste. Transfer tomato pulp to a\nliquid measuring cup\nand set aside along with the bowl (no need to wash it).\nSerious Eats / Vicky Wasik\nPlace egg, lemon juice, anchovies, mustard, and capers in the bottom of an immersion blender cup or another tall-sided container that just fits the head of your immersion blender. Pour vegetable oil on top and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and turn it on high speed. Do not pulse or move the head. As mayonnaise forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified; this should take between 30 and 45 seconds.\nSerious Eats / Vicky Wasik\nTurn off blender and remove from blender cup. Scrape down sides of cup using a rubber spatula, then add tuna, 2 tablespoons (30ml) reserved tomato pulp, and pepper paste. Return blender head to blender cup and blend just until ingredients are thoroughly incorporated into a smooth sauce, 15 to 30 seconds.\nSerious Eats / Vicky Wasik\nTaste sauce and adjust the level of heat to your liking with more pepper paste. Check the consistency of the sauce as well; it should be looser than regular mayonnaise, but still thick enough to coat a spoon (somewhere between crème fraîche and stirred whole-milk yogurt). Gradually blend in remaining tomato pulp, stopping if the sauce starts to get too runny; reserve any remaining pulp. Avoid over-blending the sauce, as this can cause it to become grainy.\nSerious Eats / Vicky Wasik\nTransfer sauce to reserved bowl and slowly drizzle in olive oil while whisking constantly to emulsify. Season to taste with kosher salt. Refrigerate sauce until ready to serve.\nFor the Salad:\nUsing a sharp chef's knife or serrated knife, cut tomatoes into an assortment of slices, wedges, and bite-size pieces.\nUsing a large spoon, spread tonnato in an even layer on a large serving plate or individual serving plates. Arrange tomatoes on top of tonnato and spoon any remaining tomato pulp over them. Sprinkle sesame seeds and sea salt (if using) over tomatoes, followed by basil leaves. If not using sea salt, season tomatoes with kosher salt. Serve immediately.\nSpecial Equipment\nBox grater,\nimmersion blender\nNotes\nTurkish pepper paste (biber salçasi) is made by roasting, puréeing, and dehydrating (traditionally via sun-drying) sweet or hot Turkish peppers. You can find both sweet and hot pepper pastes at Turkish markets or online. Korean gochujang, or even sriracha, can also be substituted for Turkish pepper paste. (If using sriracha, you may have to use less tomato pulp in the tonnato to keep it from becoming too runny.)\nThis salad is meant to celebrate peak tomato season, and won't be nearly as good if made with out-of-season tomatoes. The amount of tomato for the salad can easily be adjusted to accommodate the number of people you are serving.\nThis recipe makes about 1 1/2 cups of tonnato, which will leave you with extra sauce if you're serving four people.\nMake-Ahead and Storage\nThe salad is best enjoyed immediately. The tonnato can be made ahead and refrigerated in an airtight container for up to three days.\nRead More\nSummer Tomato Tonnato Salad\nDairy-free Salads\nGluten-free Salads\nNo-Cook Salads\nTuna\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/summer-tomato-salad-with-spicy-tonnato.webp?"
}