{
  "url": "https://www.seriouseats.com/spicy-spring-sicilian-pizza-recipe",
  "image_url": "https://www.seriouseats.com/thmb/UTE4pHNT6m2WK4sEcVepZ-cpuB4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/spicy-spring-sicilian-pizza-recipe-hero-EDIT-961f7058dcca46a1a057962a4f359b90.jpg",
  "tags": [
    "Pizza",
    "Italian-American",
    "Savory",
    "Mains"
  ],
  "title": "Sicilian Pizza With Pepperoni and Spicy Tomato Sauce Recipe",
  "full_text": "Sicilian Pizza With Pepperoni and Spicy Tomato Sauce Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n35 mins\nActive\n30 mins\nRising Time\n2 hrs\nTotal\n2 hrs 50 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dough (see note):\n500\ng\nbread flour\n(\n17.5\nounces\n; about\n3 1/2\ncups\n)\n14\ng\nkosher salt\n(\n0.5\nounce\n; about\n1\ntablespoon\n); for table salt use same weight or half as much by volume\n6\ng\ninstant\nor\nrapid-rise yeast\n(\n0.25\nounce\n; about\n1 1/2\nteaspoons\n)\n20\ng\nextra-virgin olive oil\n(\n0.70\nounce\n;\n2\ntablespoons\n), plus\n40\ng\n(\n1.4\nounces\n;\n1/4\ncup\n) for the baking pan\n325\ng\nroom-temperature water\n(\n11.5\nounces\n; about\n1\ncup\nplus\n7\ntablespoons\n)\nFor the Sauce:\n20\ng\nextra-virgin olive oil\n(\n0.70\nounce\n;\n2\ntablespoons\n)\n9\nmedium\ncloves garlic\n(\n45\ng\n), roughly chopped\n1\ntablespoon\ndried oregano\n2\nteaspoons\nred pepper flakes\n, or more to taste\n1\n(28-ounce; 800g) can\nwhole peeled tomatoes\n1\nteaspoon\nsugar\nKosher salt\nTo Assemble and Bake:\n1\npound\n(\n450\ng\n)\nsliced deli-style mozzarella cheese\n12\nounces\n(\n325\ng\n)\nnatural-casing pepperoni\n, cut into 1/8-inch-thick slices\n4\nounces\n(\n115\ng\n)\nground Pecorino Romano cheese\nDirections\nTo Make the Dough in a Food Processor (recommended):\nCombine flour, salt, yeast, 20g olive oil, and water in the bowl of a food processor fitted with the blade or dough blade attachment. Process until a dough that rides around the blade forms, then continue processing for 30 seconds. Continue with Step 4 below.\nSerious Eats / Julia Estrada\nTo Make the Dough in a Stand Mixer:\nCombine flour, salt, yeast, and 20g olive oil in the bowl of a stand mixer. Whisk to combine. Fit mixer with dough hook attachment. Add water to mixer and mix on medium speed until dough comes together and no dry flour remains. Increase speed to medium-high and mix until dough is stretchy and smooth, about 6 minutes. The dough should stick to the bottom of bowl, but pull away from the sides. Continue with Step 4 below.\nSerious Eats / Julia Estrada\nTo Make the Dough Using the No-Knead Method:\nCombine flour, salt, and yeast in a large bowl. Whisk to combine. Add 20g olive oil and water and stir by hand until dough comes together and no dry flour remains. Cover bowl tightly with plastic wrap and let rest at room temperature for 12 to 24 hours. Continue with Step 4 below.\nPour remaining 40g olive oil into a 13- by 18-inch rimmed baking sheet and spread over entire inner surface with your hands. Transfer dough to baking sheet and turn in oil until thoroughly coated. Spread gently with your hands. (It will not stretch to fill the pan; this is fine.) Cover baking sheet with plastic wrap and allow to rise at room temperature until dough has slackened and started to spread out toward the edges of the pan, 2 to 3 hours. Carefully remove plastic wrap from pizza dough. Using oiled hands, and working as gently as possible to maintain air bubbles, push and stretch dough into the corners of the pan by pressing out from the center, lifting each corner, and stretching it beyond the edge of the pan. It should pull back until pan is just filled with dough. Set aside for 20 to 30 minutes while you make the sauce.\nFor the Sauce:\nHeat olive oil in a large saucepan over medium heat until shimmering. Add garlic, oregano, and red pepper flakes and cook, stirring, until softened and aromatic, about 1 minute. Add tomatoes and juices from the can. Using a pastry cutter or a potato masher, break up tomatoes into fine chunks. Stir in sugar. Bring to a bare simmer and allow to cook for about 15 minutes to let flavors meld. Season to taste with salt. Set aside and allow to cool slightly.\nSerious Eats / Julia Estrada\nThirty minutes before baking, adjust oven rack to lower position and preheat oven to 550°F (290°C).\nSerious Eats / Julia Estrada\nTo Assemble and Bake:\nShingle slices of mozzarella cheese evenly over surface of pizza. Spoon sauce on top of cheese and spread with the back of a spoon. (You will not need all the sauce; use as much as you like, but be sparing.) Spread pepperoni slices evenly over surface. Sprinkle with half of Romano cheese. Transfer to oven and bake until pepperoni is crisp and curled and bottom of pizza is golden brown when you peek by lifting the corner with a thin spatula, about 10 minutes. With some ovens, you may need to loosely tent the top of the pizza with aluminum foil and continue baking until the bottom is golden and crisp.\nSerious Eats / Julia Estrada\nRemove pizza from oven. Sprinkle with remaining half of Romano cheese, use a pizza wheel to cut it into slices, and serve immediately.\nSerious Eats / Julia Estrada\nSpecial Equipment\nFood processor (recommended) or stand mixer, rimmed baking sheet, pizza wheel\nNotes\nAll dough quantities are given in mass measurements. For best results, I strongly recommend using a precise scale, set to either grams or ounces, to weigh out dough ingredients. If using a food processor, you can place the food processor bowl directly on the scale and tare it, then add the ingredients directly to it.\nPizza\nItalian-American\nSavory\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sicilian-pizza-with-pepperoni-and-spicy-tomato-sauce-recipe.webp?"
}