{
  "url": "https://www.seriouseats.com/spicy-chicken-noodle-soup-with-lime-and-ginger-recipe",
  "image_url": "https://www.seriouseats.com/thmb/BVwG8tmpWpcPq6uHjlCvxtPbmMM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120320-chicken-noodle-soup-3-1f91f1d17d884676bbd3e35179a07fcd.jpg",
  "tags": [
    "Soups",
    "Whole Chicken",
    "Noodles",
    "Ginger",
    "Quick Dinners"
  ],
  "title": "Spicy Chicken Noodle Soup With Lime and Ginger Recipe",
  "full_text": "Spicy Chicken Noodle Soup With Lime and Ginger Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nActive\n30 mins\nCooling Time\n10 mins\nTotal\n95 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole small chicken\n,\n2 1/2 to 3\npounds\n3\nquarts\nwater\n4\nounces\nsmoked ham\n, ham hock, or bacon\n1\n(\n3-inch) knob\nginger\n, roughly chopped\n4\nwhole\ngarlic cloves\n, smashed\n1\nstalk\nfresh lemongrass\n, dry outer leaves, pale yellow/green section only, chopped fine\n1\nsmall bunch\ncilantro\n, leaves and stems reserved separately\n1\nsmall bunch\nmint\n, leaves and stems reserved separately\n6\nscallions\n, greens and whites reserved separately, greens sliced thin\n1\nmedium\nyellow onion\n, finely sliced (about\n1\ncup\n)\n2\nmedium\ncarrots\n, finely sliced (about\n1\ncup\n)\n1\nsmall head\nNapa cabbage\n, finely sliced (about\n2\ncups\n)\n1\nThai bird chile\n, very finely sliced (see note)\n1\ncup\ndried egg noodles\nor rice noodles or\n8\nounces\nfresh ramen-style\nJapanese\nor Chinese wheat\nnoodles\n3\ntablespoons\nfish sauce\n1/4\ncup\njuice\nfrom\n2 to 3\nlimes\n1\ntablespoon\nsoy sauce\nKosher salt\nto taste\nDirections\nUsing a sharp knife and following the bone, remove the breasts from the chicken carcass. Discard skin and set breasts aside. Remove legs from chicken and set aside. Using a heavy knife or cleaver, roughly chop the body into fine pieces. Transfer the chicken body and legs to a large saucepan. Add ham, ginger, garlic, lemongrass, cilantro stems, mint stems, and scallion whites. Cover with water and bring to a simmer over high heat. Reduce to low and simmer, skimming scum from surface and topping up with hot water as necessary, until rich and flavorful, about 45 minutes total. Add chicken breasts to pot for last 10 minutes of cooking.\nStrain broth through a fine mesh strainer into a 2 quart liquid measuring cup. Remove cooked chicken legs and breasts to a plate and set aside. Discard remaining solids. Add enough hot water to broth to equal two quarts. Rinse pot and return broth to it. Add onion, carrots, cabbage, and Thai chile and bring to a simmer. Cook until vegetables are tender, about 15 minutes longer, adding noodles in for last 5 minutes of cooking time (or according to package directions).\nMeanwhile, when chicken is cool enough to handle, roughly shred breast and leg meat into bite-sized pieces, discarding skin and bones.\nWhen noodles and vegetables are soft, add fish sauce, lime juice, soy sauce, and shredded chicken to pot. Season to taste with salt (if necessary). Serve immediately, garnishing each bowl with picked mint leaves, cilantro leaves, and scallion greens.\nNotes\nMake sure to carefully wash your cutting board and hands after chopping the Thai chile. You can use 1 jalapeño or 1 serrano chile in place of the Thai chile.\nRead More\nKhao Piak Sen (Lao Chicken Noodle Soup) Recipe\nReal-Deal Khao Soi Gai (Northern Thai Coconut Curry Noodle Soup with Chicken) Recipe\n30-Minute Pressure Cooker Pho Ga (Vietnamese Chicken Noodle Soup) Recipe\nThe Ultimate Chicken Noodle Soup Recipe\nSoups\nWhole Chicken\nNoodles\nGinger\nQuick Dinners"
}