{
  "url": "https://www.seriouseats.com/spicy-carrot-and-ginger-soup-with-harissa",
  "image_url": "https://www.seriouseats.com/thmb/W1XuezdF1P9VrnlCK9czO3uwXE8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/053123_SpicyCarrotGingerSoupwithHarissa-MPPSoupsAndStews-MorganGlazeHunt-e75d662b647b4f84b97bdae0d8fbd75c.jpg",
  "tags": [
    "Soups",
    "Moroccan",
    "Vegan Mains",
    "Vegetarian Mains",
    "Carrots"
  ],
  "title": "Spicy Carrot and Ginger Soup With Harissa",
  "full_text": "Spicy Carrot and Ginger Soup With Harissa\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\ntablespoons\nextra-virgin olive oil\n, divided\n1\nmedium\nleek\n, white and pale green parts only, finely sliced (about\n1/2\ncup\n)\n1\nsmall\nonion\n, chopped (about\n1\ncup\n)\n2\ncloves\ngarlic\n, thinly sliced (about\n2\nteaspoons\n)\n1\n(\n2-inch) knob\nof\nginger\n, peeled and finely chopped\n1\nteaspoon\nground cumin seeds\n1/2\nteaspoon\nground coriander\n1 to 2\ntablespoons\nharissa paste\n(see notes)\n2 1/2\npounds\ncarrots\n, peeled and roughly chopped\n1 1/2\nquarts\nlow-sodium\nhomemade or store-bought vegetable or\nchicken broth\n(see notes)\nKosher salt\n1/4\ncup\npine nuts\n2\ntablespoons chopped\nfresh parsley leaves\n1\ntablespoon\nzest\nand\n2\ntablespoons\njuice\nfrom\n1\nlemon\nDirections\nHeat 2 tablespoons olive oil in a large saucepan over medium heat until shimmering. Add leeks, onions, garlic, and ginger, and cook, stirring frequently, until vegetables are softened but not browned, about 5 minutes. Add cumin, coriander, and harissa paste and cook, stirring constantly, until fragrant, about 1 minute. Add carrots and stir to coat in spice mixture. Add broth (see note), season with a pinch of salt, bring to a boil, reduce to a bare simmer and cook, stirring occasionally, until carrots are completely tender, about 20 minutes.\nMeanwhile, heat 2 tablespoons olive oil in a small skillet over medium heat until shimmering. Add pine nuts, reduce heat to low, and cook, tossing and stirring constantly, until fragrant and nutty brown, about 10 minute. Transfer to a bowl. Let cool for a few moments, then stir in parsley, lemon zest, and a pinch of salt.\nWhen carrots are tender, transfer half of soup to a blender. Start blender on lowest speed and slowly increase speed to high. With blender running, slowly drizzle in remaining 2 tablespoons extra-virgin olive oil. Transfer soup to a clean pot, pressing it through a fine mesh strainer or chinois if desired. Repeat with remaining soup and 2 more tablespoons olive oil. When all the soup is puréed, season to taste with salt and whisk in lemon juice.\nServe soup immediately, topped with pine nut and parsley mixture.\nSpecial equipment\nBlender\nThis Recipe Appears In\nHow to Make Creamy Vegetable Soups Without a Recipe\nSoups\nMoroccan\nVegan Mains\nVegetarian Mains\nCarrots"
}