{
  "url": "https://www.seriouseats.com/spicy-steamed-nduja-mussels",
  "image_url": "https://www.seriouseats.com/thmb/K242bMB_sAtpZ0jjsS-S3LnCpBE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200114-nduja-mussels-13-d88b2d85680340a6a95dfdb7c3656ef0.jpg",
  "tags": [
    "Seafood Mains",
    "Stovetop Seafood",
    "Mussels",
    "Quick Dinners"
  ],
  "title": "Spicy Steamed Mussels With 'Nduja Recipe",
  "full_text": "Spicy Steamed Mussels With 'Nduja Recipe\nClose\nJump to recipe\nCook\n20 mins\nActive\n10 mins\nTotal\n20 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Mussels:\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n2\nlarge\nshallots\n(\n3\nounces\n;\n85\ng\n), thinly sliced\n2\ngarlic\ncloves\n(\n10\ng\n), thinly sliced\nKosher salt\n2\nounces\n(\n1/4\ncup\n;\n60\ng\n)\n'nduja\n(see note)\n1\ncup\n(\n240\nml\n)\ndry white wine\n2\npounds\n(\n900\ng\n)\nmussels\n,\nscrubbed and debearded\n(see note)\n1/4\ncup\n(\n15\ng\n)\nchopped fresh flat-leaf parsley leaves\n1\ntablespoon\n(\n15\nml\n)\nlemon juice\nand\n1\nteaspoon\n(\n2\ng\n) finely\ngrated zest\nfrom\n1\nlemon\nFor Serving:\n1\nloaf\nrustic sourdough bread\n, thickly sliced, drizzled with olive oil, and broiled until heavily toasted\nDirections\nIn a large saucepan, heat oil over medium heat until shimmering. Add shallots and garlic, season lightly with salt, and cook, stirring frequently, until softened but not brown, 5 to 7 minutes.\nAdd 'nduja and, using a wooden spoon, break it into pieces and stir vigorously to combine with shallots and garlic. Continue to cook, stirring frequently, until fat from 'nduja separates and shallots and garlic are stained red and fully coated with 'nduja, 3 to 5 minutes longer. Add wine, increase heat to high and bring to a boil.\nAdd mussels, stir, cover, and cook, shaking pan constantly and peeking every 30 seconds to stir. Cook just until all the mussels are open, 2 to 4 minutes. Remove from heat, and using tongs, quickly transfer mussels to a warmed heatproof serving bowl. Cover mussels with saucepan lid to keep warm. Add parsley, lemon juice, and zest to saucepan and stir to combine. Taste the liquid, and adjust seasoning with salt if needed.\nFor Serving:\nRemove lid from the serving bowl, and pour contents of saucepan over mussels. Serve immediately, passing toasted bread at the table along with a large empty bowl for collecting spent mussel shells.\nSpecial equipment\n3-quart stainless steel saucier with lid\nNotes\n'Nduja is a spicy spreadable pork sausage that originates from the southern Italian region of Calabria. In the US, it can be purchased at specialty shops that carry salumi/charcuterie, Italian markets, or online from producers like\nTempesta Artisan Salumi\n. Look for 'nduja made with just 4 ingredients: pork, Calabrian chilies, salt, and lactic acid.\nExamine mussels before using. Discard cracked mussels or open mussels that don't close when tapped with another mussel. Farm-raised mussels are generally quite clean when sold, but they can still have grits and beards that need to be removed.\nRemove grit by scrubbing mussels well under cold running water, and remove beards (that look like wisps of hair coming out from between their shells) by grabbing them and pulling toward the hinge-end of the mussels; discard the beards once removed. For more information, view our\ndetailed guide to cleaning and debearding mussels\n.\nMake-Ahead and Storage\nSteamed mussels are best enjoyed immediately.\nThis Recipe Appears In\nA Guide to\n'Nduja\n: Italy's Funky, Spicy, Spreadable\nSalume\nSeafood Mains\nStovetop Seafood\nMussels\nQuick Dinners"
}