{
  "url": "https://www.seriouseats.com/spicy-mexican-shrimp-pasta-recipe-11749996",
  "image_url": "https://www.seriouseats.com/thmb/7Gj9eK1_oUVmu7QFq9wV8GwKpsU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250605-SEA-mexicanshrimppasta-shrirepp-HERO-490f38add46f47a997d747e290b6ac9b.jpg",
  "tags": [
    "Pasta Mains",
    "The Latest",
    "Recipes",
    "Mains",
    "Shrimp"
  ],
  "title": "Shrimp Scampi Meets Salsa Verde in This Weeknight-Friendly Pasta",
  "full_text": "Shrimp Scampi Meets Salsa Verde in This Weeknight-Friendly Pasta\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nTotal\n40 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\njumbo shell-on shrimp\n(16 to 20 count), peeled and deveined, shells reserved\n1\nteaspoon\nDiamond Crystal kosher salt\n, plus more to taste; for table salt, use half as much by volume\n1/4\nteaspoon\nbaking soda\n8\ntablespoons\n(\n114\ng\n)\nunsalted butter\n10\nmedium\ncloves\ngarlic\n(\n50\ng\n)\n5\nserrano\nchiles\n(\n50\ng\n), stemmed, deveined, and seeded if desired (see notes)\n1\npound\ndried\nlinguine\nor fettuccine\n2\nteaspoons\ngrated\nlime zest\nplus\n2\ntablespoons\n(\n30\nml\n) lime juice from\n1\nwhole\nlime\n, divided\n1\nloosely packed\ncup\nfresh\ncilantro leaves\n, minced\nDirections\nCut shrimp in half crosswise. In a large bowl, toss shrimp with 1 teaspoon kosher salt and baking soda. Refrigerate for 15 minutes or up to 1 hour.\nSerious Eats/ Shri Repp\nMeanwhile, in a large skillet, add butter and reserved shrimp shells and heat over medium-low heat. Cook, stirring occasionally, until butter is melted and bubbling and shells are bright orange, 7 to 10 minutes. In a fine-mesh strainer set over a bowl, strain butter with shells. Discard shells and return shrimp-infused butter to skillet.\nSerious Eats/ Shri Repp\nIn a mortar and pestle, smash serranos and garlic into a rough paste; alternatively, finely mince by hand. Set aside.\nSerious Eats/ Shri Repp\nIn a large pot of salted boiling water, cook pasta, stirring frequently for first 30 seconds to prevent sticking, until pasta is just shy of al dente (about 2 minutes less than package directions). Drain pasta, reserving 2 cupscooking water.\nSerious Eats/ Shri Repp\nReturn skillet with butterto medium heat. Add shrimp and cook, stirring occasionally, until cooked through, about 2 minutes. Using tongs, transfer shrimp to a bowl or plate.\nSerious Eats/ Shri Repp\nReduce heat to medium-low and add crushed serranos and garlic. Cook, stirring frequently, until mixture softens and is aromatic, 3 to 5 minutes.\nSerious Eats/ Shri Repp\nRemove pan from heat. Stir in lime juice.\nSerious Eats/ Shri Repp\nAdd pasta and 1 1/2 cups reserved cooking water, set over high heat, and cook, stirring and tossing rapidly, until pasta is al dente and sauce is slightly thickened and noodles are glossy, 2 to 3 minutes. Add additional pasta water, a few tablespoons at a time, if needed, to evenly coat the pasta.\nSerious Eats/ Shri Repp\nAdd cooked shrimp, lime zest, and cilantro and toss to combine. Season with salt to taste. Serve immediately.\nSerious Eats/ Shri Repp\nSpecial Equipment\nLarge skillet, large pot, fine-mesh strainer, mortar and pestle, zester\nNotes\nThe heat of serrano chiles varies greatly. It's best to sample a small piece before you cook and adjust accordingly.\nMake-Ahead and Storage\nThis pasta is best enjoyed immediately, but leftovers can be refrigerated in an airtight container for up to 4 days.\nPasta Mains\nThe Latest\nRecipes\nMains\nShrimp"
}