{
  "url": "https://www.seriouseats.com/spicy-mexican-fried-chicken-wings-recipe-8779237",
  "image_url": null,
  "tags": [
    "Snacks & Appetizers",
    "The Latest",
    "Game Day",
    "Fried Chicken",
    "Super Bowl"
  ],
  "title": "Crispy Mexican Fried Chicken Wings",
  "full_text": "Crispy Mexican Fried Chicken Wings\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nBrining Time\n4 hrs\nTotal\n4 hrs 25 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spice Mix:\n16\nchiles\nde árbol,\nstems\nand seeds removed\n10\npuya or guajillo\nchiles\n, stems and seeds removed (see notes)\n3\ndried\nhabanero chiles,\nstems and seeds removed (optional, see notes)\n2\ntablespoons\nchicken bouillon\npowder such as Knorr brand\n2\ntablespoons\ngarlic powder\n1\ntablespoon\nonion powder\n1\ntablespoon\ncumin seeds\n1\ntablespoon\ncoriander seeds\n1\ntablespoon\ndried Mexican\noregano\n1 1/2\nteaspoons\nsugar\nFor the Chicken:\n3\npounds (1.35Kg)\nchicken wings,\ncut at joints, wing tips discarded or reserved for another use\n1 1/2\ncups\n(\n360\nml\n) pickled serrano or\njalapeño brine\n(from two 12-ounce cans pickled serranos or jalapeños); see notes\n3\ncups\n(720\nml)\nbuttermilk\n1 1/2\ncups\nall purpose flour\n(\n6.75\nounces\n;\n190\ng\n)\n1 1/2\ncups\nmasa harina\n(\n6\nounces\n;\n171\ng\n)\n2\nquarts\n(\n1.9\nL\n)\nneutral oil\nsuch vegetable or canola for frying\nDirections\nWorking in batches, wearing gloves, crumble árbol, puya, and habanero chiles with your fingertips into a spice grinder so chiles fit into grinder. Add chicken bouillon powder, garlic powder, onion powder, cumin seeds, coriander seeds, dried oregano, and sugar. Grind until chiles are finely ground. (Alternatively a mortar and pestle may be used to grind the mixture.) Set aside in a small heatproof bowl.\nSerious Eats / Lorena Masso\nIn a zip-top bag, combine chicken wings and pickled chile brine. Refrigerate for at least 4 hours and up to 8 hours.\nSerious Eats / Lorena Masso\nSet a wire rack in a rimmed baking sheet; set aside. In a large bowl, whisk flour and masa harina to combine. In a medium bowl, add buttermilk. Remove wings from pickle brine, shake excess liquid back into the bag, transfer wings to buttermilk, and toss to coat.\nSerious Eats / Lorena Masso\nWorking with 1 wing at a time, transfer to flour mixture, turning to thoroughly coat in flour and pressing to adhere, then shake off excess flour mixture and transfer dredged wings to prepared wire rack. Let wings rest on wire rack at room temperature for at least 15 or up to 30 minutes.\nSerious Eats / Lorena Masso\nWhen ready to fry, set a separate wire rack in a rimmed baking sheet and line with paper towels. Add oil to large Dutch oven or stock pot. Heat over medium-high heat until oil reaches 150℉ (65℃), then carefully transfer 3/4 cup of hot frying oil to spice mix blend in bowl. Whisk to combine; set aside.\nSerious Eats / Lorena Masso\nContinue to heat oil until it reaches 350℉ (175℃). Fry 1/3 of the wings, adjusting temperature as needed to maintain oil around 350℉ (175℃), until chicken is crispy, deep golden brown, and registers 175℉ (80°C) on an instant-read thermometer, 6 to 9 minutes. Using a spider skimmer or slotted spoon, transfer to prepared rack. Repeat with the remaining 2 batches of wings, keeping cooked chicken warm in a 200℉ (95°C) oven while frying remaining wings.\nSerious Eats / Lorena Masso\nAdd fried wings to a large bowl. Whisk chili oil to recombine and pour over the wings. Gently toss until wings are thoroughly coated. Serve.\nSerious Eats / Lorena Masso\nSpecial Equipment\nDigital instant-read thermometer or candy/frying thermometer, large Dutch oven or stock pot, spice grinder or mortar and pestle, spider or large slotted spoon for removing wings from hot oil\nNotes\nDried habaneros are available at many Latin grocery markets. If unavailable, you may substitute with an equal number chiltepin chiles or just bump up the amount of chiles de árbol to a total of 20. Or prefer your wings less spicy, it’s OK to just omit them.\nThe unused pickled serranos or jalapeños can be reserved in an airtight container in the fridge to use for sandwiches or tacos.\nMake-Ahead and Storage\nThe wings can be brined for up to 8 hours ahead of frying them.\nThe fried wings are best eaten immediately and do not store well, but leftovers can be safely stored for up to 3 days in a tightly sealed container in the refrigerator.\nSerious Eats / Lorena Masso\nSnacks & Appetizers\nThe Latest\nGame Day\nFried Chicken\nSuper Bowl"
}