{
  "url": "https://www.seriouseats.com/spiced-potato-gratin-recipe-8775602",
  "image_url": "https://www.seriouseats.com/thmb/veFaXA-k4ezlfIFJjMkcB8Sme7Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250115-SpicePotatoGratin-DeliStudios-hero-f3416b8f955e42fe84ca8f74990b0539.jpg",
  "tags": [
    "Potatoes",
    "The Latest",
    "Sides",
    "Vegetarian Sides",
    "Vegetarian"
  ],
  "title": "Spiced Potato Gratin",
  "full_text": "Spiced Potato Gratin\nClose\nJump to recipe\nPrep\n5 mins\nCook\n85 mins\nResting Time\n10 mins\nTotal\n100 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n) neutral\noil\n, such as vegetable or canola\n1\nsmall\nyellow onion\n(about\n4\nounces\n;\n113\ng\n), thinly sliced\n1/2\nteaspoon\ncumin seeds\n2\nmedium\ncloves garlic\n(10g), minced\n1/2\nteaspoon\ncayenne pepper\n1\nteaspoon\nground turmeric\n1/2\nteaspoon\nground Kashmiri\nchile\npowder\n1/2\nteaspoon\nsmoked paprika\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n3\nmedium\nrusset potatoes\n(\n1 3/4\npounds\n;\n800\ng\n), peeled and cut into 1/4-inch slices\n4\nlarge\nripe\nplum tomatoes\n(\n454\ng\n;\n16\nounces\n), cut into 1-inch pieces\n1\ntablespoon\nunsalted butter\n(\n1/2\nounce\n;\n14\ng\n)\n1\ntablespoon\n(\n8\ng\n)\nall-purpose flour\n1\ncup\n(\n240\nml\n)\nwhole milk\n4\nounces\nGruyère\n(\n120\ng\n; about\n1 1/2\ncups\n), finely shredded\n1\nteaspoon\ngarlic powder\nDirections\nAdjust oven rack to middle position and preheat oven to 350ºF (175ºC.)\nIn a 12-inch cast iron or stainless-steel skillet, heat oil over medium heat until shimmering. Add onions and cumin seeds and cook, stirring often, until onions are softened and beginning to brown, about 8 minutes. Add the garlic, cayenne, turmeric, Kashmiri chile powder, smoked paprika, and salt, and cook, stirring frequently, until fragrant, about 1 minute.\nSerious Eats / Deli Studios\nAdd potatoes and toss to evenly coat in spices, taking care to separate any slices that are sticking together. Add the tomatoes and stir to combine. Reduce heat to medium-low and cook, covered, stirring halfway through, until tomatoes soften and potatoes are cooked through and tender, about 15 minutes. Remove from heat; set aside.\nSerious Eats / Deli Studios\nIn a small saucepan, melt butter over medium-low heat. Whisk in flour and cook, stirring, until mixture begins to bubble, 1 to 2 minutes. Whisk in milk gradually and cook, stirring often, until mixture thickens, about 3 minutes. Stir in cheese, allowing it to melt slightly, about 1 minute. Add cheese mixture to potatoes, gently tossing to evenly coat. Transfer to a 8- by 8-inch baking dish, and gently press potatoes into an even layer then cover tightly with foil.\nSerious Eats / Deli Studios\nSet baking dish on a rimmed baking sheet and bake until potatoes are tender and tomatoes are jammy, about 35 minutes. Remove foil and cook gratin until beginning to brown and sauce has thickened, 10 to 15 minutes. Turn the oven broiler on high and return gratin to the oven; cook until the top is golden brown and crisp, 5 to 7 minutes. (Watch gratin closely as broilers vary greatly in strength and can quickly burn unattended food.) Remove from oven and let rest for 10 minutes before serving.\nSerious Eats / Deli Studios\nSpecial Equipment\n12-inch\ncast iron\nor\nstainless steel skillet\n, 8- by 8-inch baking dish\nMake-Ahead and Storage\nThe gratin can be prepared through step 4 one day in advance. Let cool, cover, and refrigerate. When ready to cook, proceed with step 5 of the recipe.\nThe finished gratin and leftovers can be refrigerated in an airtight container for up to 4 days. Reheat in the microwave or in an oven-proof dish at 400ºF (205ºC) until heated through, about 10 minutes.\nPotatoes\nThe Latest\nSides\nVegetarian Sides\nVegetarian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/spiced-potato-gratin.webp?"
}