{
  "url": "https://www.seriouseats.com/spicy-shrimp-and-green-apple-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/gXpSmQUdUAeiHzSS-TY_Oc1pZSA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120528-207510-Spicy-Shrimp-Green-Apple-Salad-Recipe-cce721ffc927415bb9b50b08a579fc6b.jpg",
  "tags": [
    "Vegetable Sides",
    "Thai",
    "Apple",
    "Shrimp"
  ],
  "title": "Spicy Shrimp and Green Apple Salad",
  "full_text": "Spicy Shrimp and Green Apple Salad\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nActive\n30 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nquarts\nwater\n2\ntablespoons\nsalt\n1 1/2\npounds\nlarge or\njumbo shrimp\n(21-25 count), peeled and deveined\n3\nmedium\n-sized on-the-vine\ntomatoes\n2 large shallots or\n1/2\na\nlarge\nred onion\n2\nlarge\nGranny Smith apples\n1\nlime yields\nfresh\nlime juice\n, to taste\n1\ntablespoon\nfish sauce\n, to taste\n1\nteaspoon\ndried\nred pepper flakes\n, to taste\n1 1/2\ncups\nplain roasted\ncashews\n, preferably unsalted\n1/3\ncup\nmint leaves\n, torn into small pieces by hand\nDirections\nPut water and salt in a large pot and bring to a boil. Reduce heat so water is steaming but no longer boiling. If you have a thermometer, make sure water registers somewhere between 160 and 180 ̊ F (71 and 82 ̊ C) which is ideal for poaching shrimp. (For those needing help on the proper way to poach shrimp, see this\nvideo demo\nby Chef Michael Pardus of the Culinary Institute of America.)\nPoach shrimp until flesh just turns opaque. This should take no more than one minute; drain, place shrimp in a large mixing bowl, and set aside.\nTrim tops off tomatoes, and cut into 1/2-inch wedges; add to shrimp.\nPeel shallots (or red onion) and slice lengthwise very thinly and add to shrimp bowl.\nCore and halve apples, and slice lengthwise into 1/8-inch slices. Working with 4-5 slices at a time, arrange apple slices into neat stacks and cut into matchsticks, about 1/8 inch in width. Add apple matchsticks to shrimp bowl.\nSeason to taste with lime juice, fish sauce, and dried red pepper flakes; toss. The exact amounts of these ingredients cannot be given, because it all depends on how tart or sweet the apples and tomatoes are as well as your heat tolerance. The overall flavor of the salad should be predominantly sour, then salty, with a tinge of sweetness from the fruits. Start with less lime juice and fish sauce than you think prudent as you can always add more. (It's good to have about 1/4 cup of fish sauce and 3-4 limes on hand just so you know you have enough ingredients to work with even though you may not need to use all of them. Also, take into consideration whether your cashews are salted or not. If they are, go easy on the fish sauce.)\nAdd cashews and mint leaves; toss salad again. Serve immediately as a stand-alone salad or an entrée with steamed rice.\nNotes\nDried red pepper flakes are used here as a way of introducing at least one smoky/spicy element to the dish, but fresh chiles would work too. You can also grill the shrimp, as opposed to poaching them, just to get a nice smoky char in which case finely-chopped fresh Thai bird's eye chiles are recommended as a replacement for the dried red pepper.\nRead More\nSom Tam Thai (Central Thai-Style Green Papaya Salad)\nA Guide to Thai-Style Salads\nPlump and Tender Shrimp Cocktail\nVegetable Sides\nThai\nApple\nShrimp"
}