{
  "url": "https://www.seriouseats.com/spicy-nduja-tomato-sauce",
  "image_url": null,
  "tags": [
    "Italian",
    "Stovetop Pasta",
    "Tomato Sauces",
    "Pasta Mains",
    "Quick Dinners"
  ],
  "title": "Pasta With Spicy 'Nduja-Tomato Sauce Recipe",
  "full_text": "Pasta With Spicy 'Nduja-Tomato Sauce Recipe\nJump to recipe\nCook\n45 mins\nActive\n15 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n2\nlarge\nshallots\n(about\n3\nounces\n;\n90\ng\n), thinly sliced\nKosher salt\n1\n(\n24.5-ounce\n;\n700 g) bottle\ntomato passata\n(see note)\n4\nounces\n(\n1/2\ncup\n;\n115\ng\n)\n'nduja\n(see note)\n1\npound\n(\n450\ng\n)\ndried ziti\n, candele (broken into 3-inch pieces), or other short tubular pasta\n2\nounces\n(\n60\ng\n) finely grated\nPecorino Romano cheese\nDirections\nIn a large skillet, heat olive oil over medium heat until shimmering. Add shallots, season lightly with salt, and cook, stirring frequently with a wooden spoon, until shallots are softened but not browned, 5 to 7 minutes.\nAdd passata, and make sure to use up all of the tomato in the bottle by adding 1/4 cup (60ml) water to the empty bottle, screwing on the lid, shaking the contents, and then adding tomato-water mixture to the skillet. Bring to simmer, season lightly with salt, and cook, stirring occasionally until sauce is slightly thickened, 12 to 15 minutes.\nSerious Eats / Vicky Wasik\nAdd 'nduja, and use wooden spoon to break up and stir into sauce. Cook, stirring constantly, until 'nduja is fully emulsified and incorporated in sauce, about 1 minute.\nSerious Eats / Vicky Wasik\nMeanwhile, in a pot of salted boiling water, cook pasta until just softened on the exterior, but well shy of al dente, and still uncooked in the center (about 3 minutes less than the package directs). Using a spider skimmer, transfer pasta to sauce, along with 1/2 cup (120ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water.\nSerious Eats / Vicky Wasik\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce is thickened and coats noodles, about 2 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed. Remove from heat, add half of grated cheese, and stir rapidly to incorporate. Season with salt to taste. Serve immediately, passing remaining grated cheese at the table.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge\nskillet\nor straight-sided\nsauté pan\n,\nspider skimmer\nNotes\n'Nduja\nis a spicy spreadable pork salume that originates from the southern Italian region of Calabria. In the US, it can be purchased at specialty shops that carry salumi/charcuterie, Italian markets, or online from producers like\nTempesta Artisan Salumi\n. Look for 'nduja made with just four ingredients: pork, Calabrian chiles, salt, and lactic acid.\nJarred passata\n(tomatoes that have been briefly simmered and passed through a food mill) can be found in the canned tomato aisle in supermarkets or Italian markets. If you can’t find passata, you can substitute crushed or whole canned tomatoes (roughly crush whole tomatoes by hand before cooking).\nMake-Ahead and Storage\nThis pasta is at its best when enjoyed immediately, but it does keep well for leftovers, too. It can be refrigerated in an airtight container for up to 3 days. The 'nduja tomato sauce can be made separately through step 3 and refrigerated in an airtight container for up to one week, or frozen for up to 1 month.\nRead More\nA Guide to 'Nduja: Italy's Funky, Spicy, Spreadable Salume\nEasy Stovetop\n'Nduja\nMac and Cheese\nFake 'Nduja Recipe\nRagú Napoletano (Neapolitan-Style Italian Meat Sauce Recipe)\nSalumi 101: Your Guide to Italy's Finest Cured Meats\nItalian\nStovetop Pasta\nTomato Sauces\nPasta Mains\nQuick Dinners"
}