{
  "url": "https://www.seriouseats.com/spiced-okra-with-tomatoes",
  "image_url": "https://www.seriouseats.com/thmb/UWdA3HjAaJfT2WSU5OkSJZ6LOWA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__04__20200408-spiced-okra-sho-spaeth-2-57bf0dae6c2d4a44ada1075690389574.jpg",
  "tags": [
    "Indian",
    "Dairy-free Sides",
    "Gluten-free Sides",
    "Vegan Sides",
    "Vegetarian Sides"
  ],
  "title": "Spiced Okra With Tomatoes Recipe",
  "full_text": "Spiced Okra With Tomatoes Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n15 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spice Mix:\n1\ntablespoon whole\ncumin seeds\n1\ntablespoon\nwhole\ncoriander seeds\n2\npods\ngreen cardamom\n(optional)\n1\nwhole\ndried habanero\n(optional) (see notes)\nFor the Okra:\n2\ntablespoons\n(\n30\nml\n) neutral cooking\noil\n, such as\ncanola\n1\nmedium\nyellow onion\n, diced\nKosher salt\n2\nmedium\ncloves garlic\n, minced\n1\n(1-inch)\npiece\nginger\n(\n1/2\nounce\n;\n15\ng\n), smashed and minced\n1/2\nteaspoon\ntomato paste\n1\ncup\n(\n240\nml\n)\nwater\n1/2\ncup\n(\n120\nml\n)\ntomato sauce\n,\nhomemade\nor store-bought (see notes)\n1\n(14-ounce)\nbag\nfrozen okra pods\n(see notes)\nCilantro leaves and tender stems\n, for garnish\nLime wedges\n, for serving\nDirections\nFor the Spice Mixture\n: Combine cumin, coriander, cardamom (if using), and dried habanero (if using) in a small saucepan and set over medium heat. Toast spices until fragrant, about 2 minutes. When cool enough to handle, remove cardamom pods, then place remaining spices in spice grinder or mortar. Using fingers, crack open cardamom pods and remove seeds contained within; discard hull. Add cardamom seeds to other spices. Using spice grinder or mortar and pestle, grind spices to fine powder. Set aside.\nFor the Okra\n: Heat canola oil in Dutch oven or 3-quart saucepan over medium heat until shimmering. Add onions and salt and cook, stirring occasionally with a wooden spoon, until onions are golden and just starting to brown, about 15 minutes.\nStir in garlic and ginger and cook until fragrant, about 30 seconds. Stir in tomato paste, stir and cook until paste has colored the contents of the pot a reddish-brown, about 1 minute. Mound onions, ginger, and garlic in center of pot and add spice mixture directly on top (this is to guard against scorching the spices). Stir together, then cook until spices are bloomed and mixture is very fragrant, 30 seconds to 1 minute. Add water and stir, scraping bottom of pot with wooden spoon to dislodge any stuck-on bits. Add tomato sauce and okra and stir to break up frozen okra. (Okra pieces should be just submerged in the liquid; if not, add more water to cover them). Bring contents of pot to a boil, reduce heat to low, and simmer, stirring occasionally, until okra is tender, most of excess liquid has cooked off, and okra is thickly coated in sauce, 10-15 minutes. Top with cilantro and serve immediately as part of a larger meal with rice or\nparatha\n, passing lime wedges alongside.\nSpecial Equipment\nDutch oven\nor 3-quart saucepan\nNotes\nIf you prefer to use a less spicy dried chile pepper, you can substitute one dried chile arbol or dried Kashmiri red chile. You can also omit the chile pepper entirely.\nMy local stores all carry Montana Frozen Baby Okra, which I like a lot because the okra come as diminutive but whole pods. You can use whatever frozen okra is available to you, but keep in mind cut okra will lend the sauce okra's characteristic sliminess, which isn't a bad thing, necessarily. Whole pods will not.\nFor the tomato sauce, if you don't have any on hand, you can also use tomato purée, like\npassatta\n, or you can blitz a can of whole peeled tomatoes using an immersion blender or blender.\nMake-Ahead and Storage\nIn an airtight container in the refrigerator, this okra dish keeps for about one week.\nIndian\nDairy-free Sides\nGluten-free Sides\nVegan Sides\nVegetarian Sides"
}