{
  "url": "https://www.seriouseats.com/spiced-eggplant-tomato-mustard-seed-side-dish-recipe",
  "image_url": "https://www.seriouseats.com/thmb/AqiVe3BAxZA9Jl1WoZPPRUGJiyw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__09__20180827-curried-eggplant-MHT-12-5618b4c6659e4ce18c7e78c1890174ea.jpg",
  "tags": [
    "Eggplant",
    "South Asian",
    "Gluten-free Sides",
    "Vegetarian Sides",
    "Tomato"
  ],
  "title": "Spiced Eggplant With Tomato and Mustard Seeds Recipe",
  "full_text": "Spiced Eggplant With Tomato and Mustard Seeds Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n30 mins\nDrain\n60 mins\nTotal\n115 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(about\n900\ng\n)\nbaby eggplant\nor\nJapanese eggplant\n2\ntablespoons\nplus\n1\nteaspoon\n(\n30\ng\n)\nkosher salt\n, divided\n1/4\ncup\nghee\n,\nbutter\n, or\ncoconut oil;\neither refined or virgin coconut oil is fine (\n2\nounces\n;\n55\ng\n)\n1\nteaspoon\nblack mustard seeds\n1\nteaspoon\ncumin seeds\n1/2\nteaspoon\nturmeric\n2\nteaspoons\nKashmiri red chile powder\n(or\n1\nteaspoon\ncayenne\n)\n3\ntablespoons\ntomato paste\n(\n1 1/2\nounces\n;\n45\ng\n)\n1\ntablespoon\nlight brown sugar\n1\ntablespoon\ndistilled white vinegar\n2\nteaspoons\nmustard oil\n(see note)\n2\n-\ninch\nchive sections\n,\npicked cilantro leaves\n, or\nthinly sliced scallions\n, for garnish (optional)\nDirections\nIf using baby eggplants, cut each eggplant in half lengthwise. If using Japanese eggplants, slice crosswise at a sharp angle into 1-inch-thick pieces. Score the cut sides of the eggplant in a crosshatch pattern using the tip of a sharp chef's knife or paring knife. Toss eggplant with 2 tablespoons kosher salt and set aside to drain in a colander set over the sink or a large bowl for 1 hour.\nRinse excess salt off eggplant and gently pat dry with a clean kitchen towel or paper towels. Adjust an oven rack to the center position and preheat oven to 500°F (260°C). Line a rimmed baking sheet with parchment or foil.\nIn a small skillet over medium heat, melt ghee, butter, or coconut oil until liquefied. Add mustard seeds, cumin seeds, turmeric, and Kashmiri red chile powder. Fry spices, stirring frequently, until mustard seeds pop, about 2 minutes. Add tomato paste, brown sugar, vinegar, remaining 1 teaspoon kosher salt, and 1/4 cup water. Cook until mixture turns brick-red, about 5 minutes.\nIn a large bowl, toss eggplant and spice mixture together until evenly coated. Spread eggplant evenly across rimmed baking sheet, dolloping on any spice mixture left behind in the bowl. Cover baking sheet with a sheet of foil or with a second inverted rimmed baking sheet. Place in oven and bake until eggplant is tender, about 15 minutes. Uncover and bake until charred and blackened in some spots, 5 to 10 minutes longer.\nDrizzle with mustard oil and garnish with chives, cilantro, or scallions, if desired. Serve right away.\nNotes\nMustard oil is banned for human consumption in the US, but its harm is up for debate. It’s a traditional ingredient used in a lot of Indian and Bengali cooking, and I feel comfortable consuming it in small quantities. If you’d rather avoid it, you can get a similar punch by whisking 1/2 teaspoon Colman’s dry mustard powder into 1 tablespoon of any neutral oil.\nSpecial Equipment\nChef's knife\n, mixing bowl,\nrimmed baking sheet\nThis Recipe Appears In\nSpicy, Sweet, Tart, and Savory, This Eggplant Side Goes With Any Meal\nEggplant\nSouth Asian\nGluten-free Sides\nVegetarian Sides\nTomato"
}