{
  "url": "https://www.seriouseats.com/spicy-chile-lemonade-recipe-8647824",
  "image_url": "https://www.seriouseats.com/thmb/J5hTLY12nqvfBoEy3-bk2nVq-ks=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240513-SpicyLemonades-AmandaSuarez-hero-1db91765c7e74716a81558967e55089a.jpg",
  "tags": [
    "Non-Alcoholic Drinks",
    "The Latest",
    "Lemon"
  ],
  "title": "Spicy Chile Lemonade",
  "full_text": "Spicy Chile Lemonade\nClose\nJump to recipe\nPrep\n15 mins\nCook\n0 mins\nMacerating Time\n3 hrs\nTotal\n3 hrs 15 mins\nServes\n6\nto 8 servings\nMakes\n1 quart lemonade concentrate\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\n(\n1.3\nkg\n)\nlemons\n(\n10 to 14\nmedium\nlemons\n)\n6\nounces\n(\n170\ng\n)\nmedium-hot fresh red chiles\n, such as red finger chiles, cayenne peppers, or Fresno peppers, stemmed and minced (see notes)\n14\nounces\nsugar\n(\n2\ncups\n;\n400\ng\n)\n24\nounces\ncold\nwater\n(\n3\ncups\n;\n700\nml\n)\nDirections\nBring lemons to room temperature, then roll firmly against the counter to soften their rinds. Halve and juice; pour juice into a sealable container and refrigerate. Cut rinds into 1-inch chunks. Toss with minced chiles and sugar in a large nonreactive mixing bowl, cover tightly with plastic, and let stand at room temperature, stirring once every 45 minutes or so, until sugar has completely dissolved, about 3 hours. (You can let the mixture stand up to 12 hours, if desired.)\nNote:\nChiles can vary in heat intensity, as can one's tolerance. We found 6 ounces of a medium-hot chile like a red finger chile worked well, but you may require more or less depending on your chiles and tastes. If in doubt, start with less, then taste the syrup as it develops, adding more chiles if the heat isn't sufficient and macerating longer to pull out their flavor and heat.\nSerious Eats / Amanda Suarez\nAdd water and 8 ounces (1 cup) of reserved lemon juice (see note). Stir well, then strain through a nonreactive fine-mesh strainer or piece of cheesecloth into a glass or ceramic container, pressing to express liquid; discard solids. At this point, the concentrated chile-lemonade can be refrigerated for up to 1 week.\nSerious Eats / Amanda Suarez\nWhen ready to serve, pour lemonade over ice and adjust to taste with additional water or lemon juice, depending on personal preference; bear in mind, though, that the lemonade will be diluted as the ice melts. (You will likely have some fresh lemon juice left over, which can be\nreserved for another use\n, though exactly how much you have will depend on how much you added to adjust the lemonade.)\nSerious Eats / Amanda Suarez\nSpecial Equipment\nCheesecloth or nonreactive fine-mesh strainer, 2-quart pitcher\nNotes\nHow much chile you use will depend heavily on your tolerance for heat and the type of chile you use. In our testing, about 6 ounces of medium-hot red finger chiles (about 8 chiles) produced a lemonade with a good, but not oppressive heat. Depending on your taste and chiles, you may want to use more or less for hotter or milder effect. You can also use smaller red chiles such as Thai bird's eye, but keep in mind that you may need to use less of hotter chiles like those. If in doubt, start with less and taste the lemon-chile syrup as it develops; you can always add more but can not remove the chiles if they're too much.\nWe prefer a tart lemonade, made by adding 8 ounces (1 cup) of reserved lemon juice to the lemon rind syrup. If you prefer your lemonade sweeter, start with 6 ounces and taste before adding more.\nMake-Ahead and Storage\nThe concentrated chile-lemonade can be refrigerated in an airtight container for up to 1 week.\nNon-Alcoholic Drinks\nThe Latest\nLemon",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/spicy-chile-lemonade.webp?"
}