{
  "url": "https://www.seriouseats.com/spinach-feta-gnudi-mushroom-broth-5193642",
  "image_url": "https://www.seriouseats.com/thmb/MUQpKIdcPk4DXB06LsK12vfnrv4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210713-gnudi-vicky-wasik-seriouseats-34-e755286247da4365a4642da96f094da6.jpg",
  "tags": [
    "Pastas",
    "Spinach",
    "Stovetop Pasta",
    "Ricotta",
    "Feta Cheese"
  ],
  "title": "Spinach and Feta Gnudi in Mushroom-Saffron Broth",
  "full_text": "Spinach and Feta Gnudi in Mushroom-Saffron Broth\nClose\nJump to recipe\nPrep\n25 mins\nCook\n44 mins\nTotal\n69 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n4\ntablespoons\n(\n2\nounces\n;\n55\ng\n)\nunsalted butter\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n4\ngarlic\ncloves\n, finely minced\n2\nteaspoons\nAleppo pepper\n1 1/2\nteaspoons\nfreshly ground black pepper\nPinch\nsaffron threads\n1\nteaspoon\nmushroom bouillon\n, such as Better Than Bouillon Mushroom Base\nKosher salt\nFor the Gnudi:\n15\nounces\n(\n430\ng\n)\nwhole milk ricotta\n4\nounces\n(\n115\ng\n)\nfeta\n10\nounces\n(\n285\ng\n)\nfresh baby spinach\n(see note)\nKosher salt\n1\nlarge\negg\nplus\n2\nlarge\nyolks\n1/4\ncup\nall-purpose flour\n(\n1 1/4\nounce\n;\n35\ng\n), plus\n2\ncups\n(\n9\nounces\n;\n255\ng\n) for coating the gnudi\n1\nteaspoon\ngrated lemon zest\nfrom\n1\nlemon\n1\nteaspoon\nfreshly ground black pepper\nFor Serving:\n2\ntablespoons\nthinly sliced chives\n1/2\nounce\n(\n15\ng\n)\nfinely grated Parmesan\nDirections\nFor the Sauce:\nIn a 2-quart saucier or medium saucepan, melt butter over medium heat. Continue to cook, swirling pan frequently, until milk solids turn golden brown and butter smells nutty, 4 to 5 minutes. Add olive oil, garlic, Aleppo pepper, black pepper, and saffron. Cook, stirring constantly, until fragrant, 30 to 45 seconds. Add mushroom bouillon and 2 cups (475ml) water and whisk to combine. Bring to a boil, season with salt to taste, then remove from heat and set aside.\nSerious Eats / Vicky Wasik\nFor the Gnudi:\nLine a fine-mesh strainer with a double layer of cheesecloth and set it over a large bowl. Add ricotta to center of cheesecloth, gather together the corners of the cheesecloth, and twist the ends and squeeze with your hands to express as much extra liquid as possible. Transfer drained ricotta to a large bowl and set aside; you should have about 10 ounces (280g) after draining. Discard accumulated liquid, but do not discard cheesecloth. Once again, line fine-mesh strainer with the same double layer of cheesecloth and set it over the now-empty large bowl; set aside.\nSerious Eats / Vicky Wasik\nIf feta is packaged in brine, drain well. Set feta between layers of dry paper towels or a clean kitchen towel and squeeze firmly to remove as much liquid as possible (you should have about 3 1/4 ounces/90g feta after squeezing).\nSerious Eats / Vicky Wasik\nIn a medium or large pot of salted boiling water, cook spinach until completely tender, about 1 minute. Using a slotted spoon or spider, transfer spinach to a heatproof bowl and allow to cool slightly. Squeeze with a clean hand to remove excess water, then transfer spinach to a work surface and finely chop.\nSerious Eats / Vicky Wasik\nTransfer spinach to prepared strainer, gather together the corners of the cheesecloth, and twist and squeeze tightly to remove as much water as possible (you should have about 2 3/4 ounces/75g cooked, drained spinach).\nSerious Eats / Vicky Wasik\nAdd spinach, feta, egg and yolks, 1/4 cup flour, lemon zest, pepper, and 1 1/2 teaspoons kosher salt (if using table salt, use half as much by volume) to bowl with ricotta. Using a fork, mix until well combined and no dry flour remains (the final gnudi dough should weigh 19 3/4 ounces/560g).\nSerious Eats / Vicky Wasik\nReturn the pot of water to a boil. Place remaining 9 ounces (255g) flour in a rimmed baking sheet. Set a separate rimmed baking sheet next to the one with flour. Using a tablespoon measure, measure out 2-tablespoon (1 1/4-ounce; 35g) portions of dough and transfer to an empty baking sheet (you should have about sixteen 2-tablespoon portions). Using your hands, roll each 2-tablespoon portion of dough into a smooth 3/4-inch (2cm) ball.\nSerious Eats / Vicky Wasik\nTransfer dough balls to flour and gently toss to evenly coat; wipe the empty baking sheet clean. Working in batches, gently lift dough balls and shake off excess flour, then set on the cleaned baking sheet.\nSerious Eats / Vicky Wasik\nTransfer half the dough balls to boiling water and cook until gnudi float, about 5 minutes, then cook for 1 minute longer. Using a slotted spoon, remove 1 gnudi ball from water and cut in half to check for doneness: It should be firm but tender in the center. If it's not, cook for about 1 1/2  minutes longer. Alternatively, you can measure the temperature at the core of the gnudi ball using an instant-read thermometer: the gnudi are done when the thermometer registers 160°F (70°C). Using a slotted spoon or spider, transfer cooked gnudi to a platter and repeat with remaining gnudi.\nSerious Eats / Vicky Wasik\nTo Serve:\nRewarm broth, then divide evenly among warmed serving bowls. Add cooked gnudi, sprinkle with chives and Parmesan, then serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFine-mesh strainer, whisk, Microplane zester, slotted spoon.\nNotes\nFrozen spinach can be substituted for fresh spinach. If using frozen spinach, skip the boiling process. Instead, start with 8 ounces (225g) frozen spinach, wrap it in a clean kitchen towel or double layer of paper towels, and squeeze very firmly to remove any excess moisture. You should end up with about 2 3/4 ounces (75g) spinach, ready to be mixed into the dough.\nSome feta, especially feta that is sold in a brine, can have extra liquid that can harm the gnudi dough. We recommend sandwiching the feta between clean towels and pressing firmly to absorb any excess moisture to ensure gnudi dough that's sufficiently dry.\nPastas\nSpinach\nStovetop Pasta\nRicotta\nFeta Cheese"
}