{
  "url": "https://www.seriouseats.com/spritz-cookies-butter-cookie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ZphWvApToPq7Jfn0068CI8SaRwc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20151110-spritz-cookies-vicky-wasik-001-055141d6d30b416c8c7c16f125f676be.jpg",
  "tags": [
    "Cookies",
    "Baking",
    "Christmas Cookies"
  ],
  "title": "Spritz Butter Cookies Recipe",
  "full_text": "Spritz Butter Cookies Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n10 mins\nActive\n45 mins\nCooling Time\n5 mins\nTotal\n40 mins\nServes\n40 small cookies\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nunsalted butter\n, softened (\n2\nsticks\n;\n225\ng\n)\n7\nounces\ngranulated sugar\n(about\n1\ncup\n;\n200\ng\n)\nSeeds scraped from\n1\nvanilla bean\n1\nteaspoon\n(\n5\ng\n)\nkosher salt\n1/4\nteaspoon\n(\n1 to 2\ng\n) ground\ncardamom\n(optional)\n1\negg\n11 1/2\nounces\nall-purpose flour\n, sifted (about\n2 1/4\ncups\n;\n325\ng\n)\n(see notes)\nSanding sugar\n, sugar decorations, and candied fruits for decorating (optional)\nDirections\nPreheat the oven to 375°F (190°C) (see note). In the bowl of a stand mixer fitted with the paddle attachment, cream butter, sugar, vanilla bean seeds, salt, and cardamom on high speed, stopping often to scrape down the sides, until the mixture is light and fluffy, about 7 minutes total. Add the egg and beat again, stopping often to scrape down the sides and beater, until light and fluffy, 5 to 7 minutes.\nStop the mixer and add the sifted flour all at once. Mix on the lowest speed just until the flour starts to incorporate with the butter mixture, 15 to 30 seconds. Stop the mixer and finish the job by hand using a large rubber spatula or wooden spoon. Take care to only mix until the dough is homogeneous.\nPress the dough into the tube of the cookie press, turning the tube as you go for even distribution of dough (see note). Screw in the desired pattern and pipe quickly onto the surface of cool, clean metal baking sheets (do not use nonstick trays, silicone liners, or parchment paper). Work quickly and rhythmically; try not to stop as you pipe out the cookies. If you are not satisfied with the shape, scrape them off the pan with an offset spatula and reload the dough.\nSprinkle with decorations, if desired, and bake for 5 to 7 minutes for small cookies, 7 to 9 minutes for larger ones, turning halfway through. Spritz cookies are traditionally baked to a pale golden-blond color, but baking until a bit darker yields a crispy cookie with toffee notes. Watch the cookies carefully for browning at the edges if you are aiming to make a lighter cookie. Remove from the oven and allow them to cool on their baking sheets for 5 minutes before loosening with an offset spatula and transferring to a cooling rack. Cool completely before serving. The cookies will keep in an airtight container for up to 3 days.\nSpecial Equipment\nStand mixer\n,\ndigital scale\n(recommended),\nrimmed baking sheets\n,\nwire cooling rack\n, spritz cookie press (see note)\nNotes\nSpritz cookies are very delicate and the mixing process is light. Sifting the flour beforehand ensures that you won't have dry spots in the finished cookies and makes mixing easier, resulting in a tender cookie.\nTo get really pretty cookies, which is sort of the point of making spritz, the cookie press is essential. It not only gives you a uniform shape each time, but its clicking action helps you dose out the dough in uniform amounts.\nFollow the manufacturer's instructions for assembling your dough press, as they vary a bit from model to model. When filling the tube with the dough, the goal is to try to eliminate air pockets, which can cause unevenly piped cookies. Using a spatula, press the dough into the tube, and rotate the tube as you fill it, so there's no one side of the tube getting more pressure than the other.\nSqueeze the handle for one click to dispense the dough, then pull the press up and away at a right angle.\nBe sure that you've preheated the oven to 375°F (190°C) before putting the cookies in. Baking them in a cooler oven will cause them to melt and lose their shape.\nDon’t re-use baking sheets without washing them and drying them thoroughly.\nCookies\nBaking\nChristmas Cookies"
}