{
  "url": "https://www.seriouseats.com/spring-vegetables-salad-with-poached-egg",
  "image_url": null,
  "tags": [
    "Spring Salads",
    "Dairy-free Salads",
    "Vegetarian Salads",
    "Poached Eggs",
    "Stovetop Vegetables"
  ],
  "title": "Spring Vegetable Salad With Poached Egg and Crispy Bread Crumbs Recipe",
  "full_text": "Spring Vegetable Salad With Poached Egg and Crispy Bread Crumbs Recipe\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n30 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\nfava beans\nin their pods or\n4\nounces\nshucked fava beans (\n120\ng\nshucked beans)\n12\nounces\nEnglish peas\nin their pods or\n4\nounces\nshucked peas (\n120\ng\nshucked peas)\nKosher salt\n8\nounces\nasparagus\n, woody ends removed, stalks cut on a sharp bias at 1-inch intervals pieces (\n225\ng\n)\n6\nounces\nsnap peas\n, strings removed, sliced on a sharp bias into 1/2-inch slices (\n170\ng\n)\n8\nounces\nbroccolini\n, woody ends removed, cut on a sharp bias at 1-inch intervals pieces (\n170\ng\n)\n6\nounces\nstale hearty\nbread\n, crusts removed (\n170\ng\n)\n3\ntablespoons\nunsalted butter\n(\n25\ng\n)\n2\ntablespoons\nminced\nshallot\n, divided (about\n1\nsmall\n;\n30\ng\n)\n2\ntablespoons\nminced\nfresh parsley\nleaves\n2\ntablespoons\nminced fresh\nchives\nFreshly\nground black pepper\n1\ntablespoon\n(\n15\nml\n)\njuice\nand\n2\nteaspoons\n(\n5\ng\n)\nzest\nfrom\n1\nwhole\nlemon\n3\ntablespoons\nextra-virgin olive oil\n(\n45\nml\n)\n4\npoached eggs\nDirections\nIf using fava beans and peas in their pods, shuck the beans and peas from their pods, keeping them separate. Discard the pods. Bring a large pot of salted water to a boil and prepare an ice bath. Working with one vegetable at a time, blanch the favas, peas, asparagus, snap peas, and broccolini in the boiling water for 1 minute, transfer to the ice bath to cool, then transfer to a paper towel-lined tray and pat dry. Remove and discard the skins from each individual fava bean. Set vegetables aside.\nTear bread into small pieces and transfer to the bowl of a food processor, mini-chopper, or blender. Pulse until reduced to fine breadcrumbs.\nHeat butter in a small skillet over medium heat until melted, then add breadcrumbs and cook, stirring and tossing frequently, until golden brown and crisp, about 5 minutes. Add half of shallots and cook, stirring, until fragrant, about 30 seconds. Remove from heat, add half of parsley and half of chives, and toss to combine. Season mixture to taste with salt and pepper.\nSerious Eats / J. Kenji López-Alt\nIn a large bowl, whisk together lemon juice, lemon zest, and remaining shallot, parsley, and chives. Slowly drizzle in olive oil, whisking constantly. Add blanched vegetables, toss to combine, and season to taste with salt and pepper. Divide vegetables between 4 serving plates or bowls, making a small indentation to place the egg.\nSerious Eats / J. Kenji López-Alt\nTransfer poached eggs to skillet with breadcrumbs and turn them carefully to coat in crumbs. Place eggs on top of salad and spoon any remaining crumbs on top. Serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nFood processor\nor\nblender\nRead More\nSpring Vegetable and Arugula Salad With Labne and Cucumbers\nSpring Salad of Asparagus, Ramps, Snap Peas, and Peas\nPea, Olive, and Preserved Lemon Salad\nSnap Pea Salad With Mint and Tahini-Harissa Dressing\nEasy Fava Bean and Carrot Salad With Ricotta\nWarm Farro Salad With Asparagus, Peas, and Feta\nSpring Salads\nDairy-free Salads\nVegetarian Salads\nPoached Eggs\nStovetop Vegetables"
}