{
  "url": "https://www.seriouseats.com/squash-eggplant-tomatoes-stew-baked-egg",
  "image_url": "https://www.seriouseats.com/thmb/xDqMVPcmxIgNh5tEE4wIERmYj_U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2013__09__20130827-squash-eggplant-zucchini-eggg-hash-3-903e3f95da4548d2aca0eada2eada8fe.jpg",
  "tags": [
    "Baked Eggs",
    "Gluten-free Breakfast & Brunch",
    "Eggplant",
    "Zucchini & Yellow Squash",
    "Quick Breakfast"
  ],
  "title": "Eggplant, Squash, and Cherry Tomato Hash With Baked Eggs Recipe",
  "full_text": "Eggplant, Squash, and Cherry Tomato Hash With Baked Eggs Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n40 mins\nActive\n45 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nItalian eggplants\n, sliced in half and cut into 1/2-inch disks\n1/2\ncup\nextra virgin olive oil\nKosher salt\nand\nfreshly ground black pepper\n1\nmedium\nsummer squash\n, sliced in half and cut into 1/4-inch disks\n1\nmedium\nzucchini\n, sliced in half and cut into 1/4-inch disks\n1\nmedium\nonion\n, cut in half and cut into 1/4-inch slices\n2\nmedium\ncloves garlic\n, thinly sliced\n1\npint\ncherry tomatoes\n, split in half\n4\neggs\n2\ntablespoons\nsliced chives\nHot sauce\nor\nchile paste\nfor serving\nDirections\nTo Cook Eggplant in the Microwave:\nSeason eggplant slices lightly on both sides with salt. Place double layer of paper towels or clean kitchen towel on a large plate and lay single layer of eggplant slices on top. Top with 2 more layers of paper towels or clean kitchen towel. Top with second large plate and place another layer of paper towels and eggplant on top. Top with third large plate. Microwave on high power until eggplant is easily compressed, about 3 minutes (be careful, plates will be hot). Press eggplant slices firmly between paper towels until compressed, then set aside on a large plate. Repeat the microwaving and pressing steps until all eggplant slices are compressed. Continue with step 3. Adjust oven rack to upper-middle position and preheat oven to 400°F (200°C).\nTo Cook Eggplant in Oven:\nAdjust oven rack to center position and preheat oven to 375°F (190°C). Line a rimmed baking sheet with a double layer of paper towels. Spread eggplant slices over towels in a single layer and top with a second layer of paper towels. Top with a second rimmed baking sheet. Bake until eggplant slices are easily compressed, about 30 minutes. Remove from oven and press down on top tray to compress slices. Let cool, then transfer eggplant to a large plate and continue with step 3. Adjust oven rack to upper-middle position and increase heat to 400°F (200°C).\nHeat 1/4 cup olive oil in a large non-stick or cast iron skillet over high heat until shimmering. Add eggplant, season to taste with salt and pepper, and cook, stirring and tossing occasionally, until well browned, about 3 minutes. Return to large plate.\nAdd additional 2 tablespoons oil to skillet and heat until shimmering. Add squash and zucchini slices, season to taste with salt and pepper, and cook, tossing occasionally, until well browned, about 5 minutes.\nAdd remaining 2 tablespoons oil to skillet and heat until shimmering. Add onions, season to taste with salt and pepper, and cook, stirring, until onions are softened and just beginning to brown, about 5 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add tomatoes and cook, stirring, until they soften, about 5 minutes. Return eggplant, zucchini, and squash to skillet.\nTo complete, divide mixture between 4 individual oven-safe serving dishes. Create a well in the center of each one and break an egg into it. Bake until egg is barely set but yolk is still soft, about 6 minutes. Alternatively, leave mixture in large skillet, create 4 wells, break an egg into each, and bake until eggs are barely set but yolks are still soft, about 6 minutes. Season eggs with salt and pepper and sprinkle with chives. Serve immediately with hot sauce or chile paste.\nSpecial Equipment\nLarge non-stick or cast iron skillet, three large plates, paper towels or clean kitchen towels\nRead More\n24 Delicious Eggplant Recipes That Everyone Will Love\n24 Zucchini Recipes for Your Summer Bounty\nBaked Eggs\nGluten-free Breakfast & Brunch\nEggplant\nZucchini & Yellow Squash\nQuick Breakfast"
}