{
  "url": "https://www.seriouseats.com/stained-glass-windows-no-bake-chocolate-marshmallow-logs",
  "image_url": "https://www.seriouseats.com/thmb/k3XVI6DStOEYgyPCJAzr9ZN7HEg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111214-183732-stained-glass-window-954ca5d13b6947ab9e2ea75aeb262fc4.jpg",
  "tags": [
    "Candy",
    "Chocolate",
    "Christmas Candies"
  ],
  "title": "Stained Glass Windows Recipe",
  "full_text": "Stained Glass Windows Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n5 mins\nActive\n20 mins\nCooling and Chilling Time\n2 hrs 5 mins\nTotal\n2 hrs 15 mins\nServes\n20 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n1\nstick\n)\nunsalted butter\n2\ncups\nsemi-sweet\nchocolate chips\nor\n12\nounces\nbest quality\ndark chocolate\n, finely chopped\n1\nteaspoon\nvanilla extract\n1\nbag\n(\n10.5\nounces\n) colored\nmini marshmallows\n(see notes)\nDirections\nIn a large bowl, combine butter and chocolate. Microwave on high for approximately 45 seconds. Stir then repeat at 20-second intervals until the mixture is fully melted and smooth. Stir in vanilla until thoroughly combined.\nLet chocolate cool for a few minutes until it is cool to the touch, but hasn't hardened. Fold in marshmallows and stir to completely coat marshmallows in chocolate.\nSpoon mixture in shape of a log down the center of a sheet of wax paper about 24 inches in length (see notes). Roll up sides of wax paper and twist the ends to tighten and seal. Refrigerate for at least 2 hours to set. Cut in 1/3 inch slices and serve. Keep in the refrigerator, covered.\nSpecial Equipment\nWax paper\nNotes\nTraditionally these are made with multi-colored mini marshmallows, which can be difficult to find in New York. (I tried no less than four grocery stores and three drug stores and came up empty-handed.) You can always order them online. If time is of the essence, use regular mini marshmallows, or substitute, as I did, 2/3 of a bag of large red and green Christmas marshmallows (cut down to mini marshmallow size) and 1/3 of a bag of regular mini marshmallows.\nYou can line the wax paper with shredded coconut or very finely chopped nuts if desired before adding the chocolate mixture, and sprinkle with additional topping before the mixture is rolled up.\nRead More\nVampire Mouth Marshmallow Sandwich Cookies\nGrilled Banana Boats With Peanut Butter, Chocolate, and Marshmallows\nHomemade Swiss Miss With Mini Marshmallows\nChocolate Marshmallow Peeps\nCandy\nChocolate\nChristmas Candies"
}