{
  "url": "https://www.seriouseats.com/steamed-buns-grilled-shrimp-sriracha-mayo-recipe",
  "image_url": null,
  "tags": [
    "Grilled Shrimp",
    "Chinese",
    "Seafood Mains",
    "Snacks & Appetizers",
    "Summer Mains"
  ],
  "title": "Steamed Buns With Grilled Shrimp and Sriracha Mayonnaise Recipe",
  "full_text": "Steamed Buns With Grilled Shrimp and Sriracha Mayonnaise Recipe\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n30 mins\nChilling Time\n60 mins\nTotal\n80 mins\nServes\n6 servings\nMakes\n12 buns\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Shrimp:\n24\nlarge\nshrimp\n, shelled and deveined\n1/4\nteaspoon\nbaking soda\n1 1/2\nteaspoons\n(\n8\ng\n)\nkosher salt\n, plus more to taste\n1/2\nteaspoon\n(\n3\ng\n)\nsugar\n2\nmedium\ncloves garlic\n, minced, divided\n2\ntablespoons\n(\n30\nml\n) canola or\nvegetable oil\n, divided\n1\nsmall\nhot red\nchile\n, such as Thai bird, thinly sliced\n2\nscallions\n, thinly sliced\nFreshly ground black pepper\nFor the Sriracha Mayonnaise:\n1\ntablespoon\n(\n15\nml\n)\nsriracha\n, plus more to taste\n5\ntablespoons\n(\n75\nml\n) store-bought or\nhomemade\nmayonnaise\n1\nteaspoon\n(\n5\nml\n)\njuice\nfrom\n1\nlime\nTo Assemble:\n12\nChinese folded steamed buns\n, steamed in a steamer or in the microwave until tender (see note)\n1\nrecipe\nquick-pickled cucumbers with rice vinegar\n1\ncup\nfinely\nshredded green cabbage\nDirections\nFor the Shrimp:\nCombine shrimp, baking soda, salt, and sugar in a medium bowl and toss to coat. Thread shrimp onto sets of 2 skewers, alternating heads to tails and pushing shrimp so that they are nestled snugly together. Place 6 shrimp on each set of 2 skewers. Lay skewers on top of a baking dish so that shrimp are suspended above bottom of dish. Transfer to refrigerator and allow to rest for 1 hour. Meanwhile, combine half of garlic and half of oil in a small bowl. Combine remaining garlic, oil, chile, and scallions in a large bowl. Set aside.\nSerious Eats / J. Kenji López-Alt\nMeanwhile, for the Sriracha Mayonnaise:\nCombine sriracha, mayonnaise, and lime juice in a small bowl and stir. Add more sriracha until desired level of spiciness is achieved. Cover and refrigerate.\nWhen shrimp are ready to grill, brush both sides with first garlic/oil mixture.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\ngrilling grate.\nPlace shrimp directly over hot side of grill and cook, turning occasionally, until shrimp are just cooked through and well charred, 4 to 5 minutes total. Transfer shrimp to a cutting board.\nCarefully remove skewers from shrimp and transfer to bowl with garlic/oil/chile/scallion mixture. Toss to coat. Season to taste with salt and pepper and serve immediately.\nTo Assemble:\nSpread 1 1/2 teaspoons (7ml) sriracha mayonnaise on the bottom of each bun. Top with pickles and shredded cabbage. Top with 2 shrimp each and close buns. Serve immediately.\nSpecial Equipment\nGrill\n,\nbamboo skewers\nsoaked in water for 30 minutes\nNotes\nChinese-style folded steamed buns can be found in the refrigerated section of Chinese grocery stores. To heat, line a bamboo steamer with perforated parchment paper or spray with nonstick spray. Arrange buns in a single layer without letting them touch and place steamer over a wok or pot of simmering water. Steam until heated through, about 2 minutes. Alternatively, place buns on a microwave-safe plate and cover with a damp towel. Microwave in 30-second intervals until heated through, about 1 minute total.\nRead More\nTaiwanese Pork Belly Buns (Gua Bao)\nSous Vide Pork Belly Buns With Pork Braise Mayonnaise and Pickled Cucumbers\nSteamed Buns With Tempura King Oyster Mushrooms and Agave Miso Mayonnaise\nGrilled Shrimp Rolls\nVietnamese Grilled Shrimp Summer Rolls\nGrilled Shrimp\nChinese\nSeafood Mains\nSnacks & Appetizers\nSummer Mains"
}