{
  "url": "https://www.seriouseats.com/steamed-mussels-thai-coconut-chili-curry-broth-recipe",
  "image_url": "https://www.seriouseats.com/thmb/PPifZd9MobkQClAThMgNCF6MhtU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__10__20141026-mussels-how-to-food-lab-thai2-300e64a898fb4934a3cd3cbab619eeb3.jpg",
  "tags": [
    "Mussels",
    "Thai",
    "Dairy-free Mains",
    "Stovetop Seafood",
    "Coconut Milk & Cream"
  ],
  "title": "Steamed Mussels With Thai-Style Coconut-Curry Broth Recipe",
  "full_text": "Steamed Mussels With Thai-Style Coconut-Curry Broth Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n20 mins\nTotal\n15 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nsprigs\ncilantro\n, leaves and stems roughly chopped and reserved separately\n4\nmedium\ncloves garlic\n, thinly sliced\n2\nsmall\nshallots\n, thinly sliced\n1/2\nteaspoon\nwhole\ncoriander seeds\n1/2\nteaspoon\ndried Thai chiles or\nred chile flakes\n1\nteaspoon\nzest\nplus\n1\ntablespoon\njuice\nfrom\n1\nlime\n(plus additional limes for serving)\nKosher salt\n1\n(\n15-ounce) can\ncoconut milk\n(do not shake before opening)\n1\ntablespoon\nvegetable or\ncanola oil\n1\ntablespoon\nThai green curry paste\n1\ntablespoon\nbrown or\npalm sugar\n1\ntablespoon\nfish sauce\n, plus more to taste\n2\npounds\nmussels\n(see notes)\n1\nsmall\nThai or\nserrano\nchile\n, thinly sliced\nDirections\nCombine cilantro stems, half of garlic, half of shallot, coriander seeds, dried chile, lime zest and a small pinch of kosher salt in a mortar and pestle. Pound and grind until a smooth paste is formed.\nScoop 2 tablespoons of thick cream from the top of the can of coconut milk and add to a large saucepan. Add oil and heat over medium heat until shimmering and sputtering. Add remaining garlic and shallots, pounded aromatic paste, and the store-bought (or homemade) curry paste. Cook, stirring and scraping the paste around the bottom of the pan until very aromatic, about 4 minutes. Add remaining contents of coconut milk can, sugar, and fish sauce. Bring to a simmer and cook until rich and aromatic, about 3 minutes. Season to taste with more fish sauce as desired.\nAdd mussels, stir, cover, and cook, shaking pan constantly and peeking every 30 seconds to stir. As soon as all the mussels are open, stir in chopped cilantro leaves, fresh chile, and lime juice. Serve immediately, with additional limes at the table.\nSpecial Equipment\nMortar and pestle\n,\nblender\nNotes\nI strongly advise using a good mortar and pestle for making the curry paste, though in a pinch a blender will do. To make in a blender, add aromatics and curry paste to the blender along with a tablespoon of water. Blend on high speed, scraping down sides and adding water as necessary until a paste is formed.\nExamine mussels before using. If they're gritty or have lots of beards (it'll look like bits of hair coming out from between their shells), scrub them well under cold water and pull out the beards by grabbing them and pulling towards the hinge-end of the mussels. (More on\ncleaning and debearding mussels here\n.) Farm-raised mussels are generally quite clean when they are sold.\nWhen examining, discard cracked mussels or open mussels that don't close when tapped with another mussel.\nMussels\nThai\nDairy-free Mains\nStovetop Seafood\nCoconut Milk & Cream"
}