{
  "url": "https://www.seriouseats.com/steak-sandwich-roasted-tomato-creamy-anchovy-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/s1A8F0ayix7bs21qP7Z3mTL2r1c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__06__20160524-steak-sandwich-vicky-wasik-12-7d2e712d5e9f4dcfbdf8fbfd0afa4500.jpg",
  "tags": [
    "Stovetop Beef",
    "Steaks",
    "Parmesan",
    "Endive, Radicchio & Chicories",
    "Tomato"
  ],
  "title": "Steak Sandwiches With Roasted Tomatoes, Parmesan, and Radicchio Recipe",
  "full_text": "Steak Sandwiches With Roasted Tomatoes, Parmesan, and Radicchio Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n70 mins\nActive\n30 mins\nCooling and Infusing Time\n25 mins\nTotal\n105 mins\nServes\n4 sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(\n340\ng\n)\ncherry tomatoes\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n, plus more for drizzling\n1\nteaspoon\n(\n3\ng\n) minced\nfresh thyme leaves\nKosher salt\nand freshly ground black pepper\n1/2\nmedium\nred onion\n(\n5\nounces\n;\n150\ng\n), thinly sliced\n2\ntablespoons\n(\n30\nml\n)\nred wine vinegar\n, plus more for pickling onion\n1\npound\n(\n450\ng\n) boneless beef\nsteak,\nsuch as\nhanger\n, skirt, tri-tip, tenderloin, or strip (see note)\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1/2\ncup\n(\n120\nml\n)\nmayonnaise\n1/2\ncup\n(\n120\nml\n)\nsour cream\n5\noil-packed anchovy\nfillets\n, drained and roughly chopped\n2\nounces\n(\n55\ng\n)\nParmigiano-Reggiano cheese\n,\n1\nounce\ngrated and\n1\nounce\nshaved with a vegetable peeler, divided\n4\nounces\nradicchio\n(about\n1/2\na medium\nhead\n;\n225\ng\n), cored and thinly sliced\n1\nhandful\npicked\nflat-leaf parsley leaves\n(about\n1/4\ncup\n, packed)\n4\nlarge slices\ncountry bread\n, halved and drizzled with olive oil, then lightly toasted\nDirections\nPreheat oven to 350°F (175°C). Place tomatoes on a rimmed baking sheet and drizzle with olive oil, tossing to lightly coat. Transfer to oven and roast, stirring and scraping occasionally, until tomatoes have burst and juices have concentrated to a syrupy consistency, about 1 hour. Let cool slightly, then scrape into a small mixing bowl. Stir in 1 tablespoon (15ml) olive oil along with the vinegar and thyme. Season with salt and pepper and set aside.\nMeanwhile, place onion in a small nonreactive container and add just enough vinegar to cover. Let stand until onion slices are bright pink and tender, at least 15 minutes and up to 1 hour.\nPat steak dry with a paper towel and season generously with salt and pepper. Heat vegetable oil over high heat in a medium oven-safe stainless steel, cast iron, or carbon steel skillet until lightly smoking. Add steak and cook, turning occasionally, until steak is well browned on both sides and an instant-read thermometer registers 125°F (50°C) at the thickest part; timing will depend on thickness of steak. (If steak is more than 1 inch thick, you may need to transfer it to the oven after browning to finish cooking.) Let rest at least 5 minutes (you can let the steak cool fully if desired).\nUsing a mini food processor, an immersion blender, or a countertop blender, combine mayonnaise, sour cream, anchovy fillets, and grated Parmesan and blend thoroughly to make a creamy, pourable sauce; if sauce is very thick, loosen slightly with a tablespoon or two of water. Season with salt and pepper and keep refrigerated.\nIn a medium bowl, toss radicchio with parsley and season with salt.\nArrange toasted bread slices on a work surface. Spread tomato jam on half of bread. Thinly slice steak against the grain and arrange on top of tomato jam. Drizzle steak with anchovy-Parmesan sauce, then top with radicchio salad, shaved Parmesan cheese, and drained rapid-pickled onions. (Reserve any remaining pickled onions for another use.) Close sandwiches and serve.\nSpecial equipment\nRimmed baking sheet; oven-safe skillet; instant-read thermometer; mini food processor, countertop blender, or immersion blender\nNotes\nThis recipe will work with a variety of boneless steak cuts. (It will also work with a bone-in cut, but you'll have to account for the bone weight.) Choose steaks that are at least one inch thick to get the best browning without overcooking the interior.\nThis Recipe Appears In\nFor Great Steak Sandwiches, Think Beyond the Steak\nStovetop Beef\nSteaks\nParmesan\nEndive, Radicchio & Chicories\nTomato"
}