{
  "url": "https://www.seriouseats.com/steak-corn-salad-tomatillo-ancho-chili-vinaigrette-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MCFvODMBS4q9atpoXOIXjhQmpos=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140915-steak-corn-tomatillo-salad-recipe-8-7bd1176fdeee461f9ed2f4c78d76fe9f.jpg",
  "tags": [
    "Skirt Steaks",
    "Tomatillo",
    "Quick Salads",
    "Summer Salads"
  ],
  "title": "Steak and Corn Salad With Tomatillos and Ancho-Chili Vinaigrette Recipe",
  "full_text": "Steak and Corn Salad With Tomatillos and Ancho-Chili Vinaigrette Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nActive\n45 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nstrip steak\n1/4\ntsp\nsalt and freshly ground black pepper\n2\ntablespoons\nchili powder\n3\nclove\ncloves garlic\n1/4\ncup\nextra virgin olive oil\n1\ntablespoon\njuice\nfrom\n1\nlime\n1\ntablespoon\nunsalted butter\n3\ncups\ncorn kernels\n1/2\ncup\nthinly sliced\nwhite onion\n(about\n1/2\nof a\nmedium\nonion\n)\n4\nmedium\ntomatillos\n1\nsmall\nserrano\nchili, thinly sliced\n1/4\ncup\nroughly chopped\nfresh cilantro\nleaves and tender stems\n1/4\ncup\ncotija cheese\nDirections\nSeason steak generously with salt and pepper. Rub with half of chili powder, half of garlic, and 2 teaspoons olive oil. Set aside.\nCombine remaining chili powder, remaining garlic, 2 tablespoons oil, and lime juice in a large bowl and whisk to combine. Season to taste with salt and pepper. Set aside.\nHeat 1 teaspoon oil and the butter in a large cast iron or stainless steel skillet over high heat, swirling, until butter has started to brown. Add steak and cook, turning occasionally, until well browned and center registers 120°F on an instant read thermometer, about 6 minutes, turning down heat if butter is smoking excessively. Transfer meat to a paper towel-lined plate and set aside.\nMeanwhile, wipe out the skillet with paper towels. Heat remaining tablespoon oil over high heat until lightly smoking. Add corn and cook without moving until well charred on first side, about 2 minutes. Scrape up charred corn from bottom of pan with a stiff spatula, toss, and char again. Repeat until corn is well charred on multiple surfaces, about 10 minutes total.\nTransfer corn to bowl with dressing and allow to cool slightly. Thinly slice beef against the grain and add to bowl with corn. Add onion, tomatillos, sliced chili, cilantro, and cotija cheese. Toss to combine and season to taste with salt and pepper. Serve immediately.\nSpecial equipment\nLarge cast iron or stainless steel skillet\nThis Recipe Appears In\nEver Try Your Tomatillos Raw? This Steak, Tomatillo, and Corn Salad With an Ancho Vinaigrette May Just Convince You\nSkirt Steaks\nTomatillo\nQuick Salads\nSummer Salads"
}