{
  "url": "https://www.seriouseats.com/steak-diane-recipe-8787746",
  "image_url": "https://www.seriouseats.com/thmb/n4G9i9FO21_GrpqZ5YzbjIXKS0c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250206-SteakDiane-AmandaSuarez-19-f223095aedcb44ae873a7c20efc2f8d0.jpg",
  "tags": [
    "Tenderloin Steak",
    "The Latest",
    "Beef Mains",
    "Valentine's Day",
    "New Years"
  ],
  "title": "Steak Diane",
  "full_text": "Steak Diane\nClose\nJump to recipe\nPrep\n40 mins\nCook\n13 mins\nTotal\n53 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\nTwo\n6- to 8\n-\nounce\ncenter-cut\nfilets mignon,\n1 1/2 to 2 inches thick, trimmed (see notes)\nKosher\nsalt\nand\nfreshly ground black pepper\n1\ntablespoon\n(\n15\nml\n) neutral\noil\nsuch as canola or vegetable oil\n4\ntablespoons\n(56\ng\n)\nunsalted butter,\ncut into 4 pieces, divided\n1/2\nmedium\nshallot\n(about\n1 1/2\nounces\n;\n42\ng)\n, minced\n3/4\ncup\n(\n180\nml)\nhomemade beef stock\nor\nhomemade chicken stock\nor store-bought low-sodium\nchicken broth\n(see notes)\n1\nteaspoon\npowdered gelatin,\nif using store-bought broth (see notes)\n1/4\ncup\n(60\nml\n)\ncognac\n2\nteaspoons\n(10\nml)\nWorcestershire sauce\n1\ntablespoon\nminced fresh\nchives\n1\nteaspoon\nDijon mustard\nDirections\nPat steaks dry with paper towels. Season liberally with salt. Allow to rest at room temperature for at least 40 minutes and up to 2 hours. Alternatively, place on a plate or on a wire rack over a baking sheet in the refrigerator for up to 24 hours.\nSerious Eats / Amanda Suarez\nIf using store-bought broth\n, in a liquid measuring cup combine stock and cognac and sprinkle gelatin over the top. Set aside.\nIn a 10-inch stainless steel, cast iron, or carbon steel skillet, heat oil over high heat until smoking. Season steaks all over with pepper, add to pan, and cook, flipping with tongs every 2 minutes until well browned on all sides (including edges, which you can sear by holding steaks sideways with tongs) and the internal temperature has reached 110°F (43°C) for rare or 130°F (54°C) for medium (steak will continue to cook for a bit afterward), 6 to 12 minutes total, depending on thickness. Transfer steaks to a plate; set aside while preparing sauce. Do not wipe skillet.\nSerious Eats / Amanda Suarez\nIn now-empty skillet, reduce heat to low and melt 1 tablespoon butter. Add shallot and cook until translucent, about 1 minute. Remove skillet from heat and add stock or broth (or gelatin mixture if using store-bought broth), cognac, Worcestershire, and any accumulated meat juices from plate. Return skillet to medium-high heat and bring to boil, scraping up any browned bits. Cook until reduced to 1/2 cup, 5 to 7 minutes.\nSerious Eats / Amanda Suarez\nOff heat, whisk in half of chives, mustard, and remaining 2 tablespoons butter, until fully incorporated. Transfer filets to individual serving plates and spoon sauce over top. Sprinkle with remaining chives and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n10-inch stainless-steel, cast iron, or carbon steel skillet, tongs\nNotes\nAn equivalent total weight of bone-in or boneless ribeye or strip steak, porterhouse, T-bone, tenderloin, hanger, or flank steak can be used in place of filet mignon. Try to get steaks at least 1 1/2 inches thick. If using a thinner cut of steak, shorten cooking time accordingly.\nIf using store-bought broth, add 1 teaspoon powdered gelatin to the broth and cognac and let sit while cooking the steaks. The gelatin will add body to the broth and final sauce that store-bought broth lacks.\nMake-Ahead and Storage\nThe steak and sauce are best enjoyed right away.\nTenderloin Steak\nThe Latest\nBeef Mains\nValentine's Day\nNew Years"
}