{
  "url": "https://www.seriouseats.com/steak-tartare-beef-recipe-8709496",
  "image_url": null,
  "tags": [
    "Tenderloin Steak",
    "The Latest",
    "French",
    "Steaks"
  ],
  "title": "Classic Steak Tartare",
  "full_text": "Classic Steak Tartare\nJump to recipe\nPrep\n20 mins\nCook\n0 mins\nTotal\n20 mins\nServes\n2\nto 4 servings\nMakes\n4 ounces\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\n(113g)\nbeef tenderloin\n(see notes)\n2\ntablespoons\n(30g)\nhomemade mayonnaise\nKosher salt\nand freshly\nground black pepper\nExtra-virgin olive oil\n, as needed\nRed or white wine vinegar\n, as needed\nDijon mustard\n, as needed\n1/2 teaspoon Worcestershire sauce or\n3\ndrops\nfish sauce\n(optional)\n4\nteaspoons\nvery finely minced\nshallot\n(from 1 shallot)\n1\nteaspoon\nfinely minced\nchives\n1\nteaspoon\nfinely minced\nflat-leaf parsley\nleaves and tender stems\n1\nteaspoon\nfinely minced\ncornichons\n, plus whole cornichons for serving\n2\nteaspoons\ndrained\ncapers\n1\nlarge\negg yolk\n(optional, see notes)\nToasts\n, for serving\nDirections\nOn a very clean work surface and using a sharp knife, slice beef into thin slices no thicker than 1/4 inch. Then cut into thin 1/4- or 1/8-inch stips. Cut strips crosswise into a fine mince. Transfer to a mixing bowl.\nSerious Eats / Amanda Suarez\nAdd mayonnaise and season with salt and pepper to taste, stirring well to combine thoroughly. If needed add additional olive oil, vinegar, and/or mustard in very small increments to adjust flavor to taste (depending on your mayonnaise, you may not need any, or you may find the beef needs a little more to get the flavor just right). If desired, mix in the drops of fish sauce.\nSerious Eats / Amanda Suarez\nAdd shallot, chives, parsley, cornichon, and capers and stir until thoroughly combined.\nSerious Eats / Amanda Suarez\nMound steak tartare on a serving plate (you can use a ring mold to make a perfect circle, if desired). Top with egg yolk, if using, and serve right away with toasts and additional cornichons on the side.\nSerious Eats / Amanda Suarez\nNotes\nIf you're especially concerned about food safety but are still determined to eat steak tartare, you can further reduce the chances of illness by searing the whole tenderloin in a smoking hot, lightly oil skillet, making sure to give several seconds of full contact to the hot pan to every surface of the meat; if done quickly and over very high heat, this will kill bacteria on the surface of the meat while leaving the interior of the beef fully raw.\nSimilarly, you can attempt to\npasteurize your eggs\nat home before topping the tartare with the yolk (and before making the mayonnaise). The whites will thicken and be slightly cloudy after this heat treatment, so just remove them before setting the yolk on the tartare.\nNeither process is foolproof, but each is better than doing nothing.\nSerious Eats / Peyton Beckwith\nTenderloin Steak\nThe Latest\nFrench\nSteaks"
}