{
  "url": "https://www.seriouseats.com/steamed-leaf-wrapped-winter-squash",
  "image_url": "https://www.seriouseats.com/thmb/QGimwSQh_ImxFLdKblr1MSmGkKo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20201106-lotus-leaf-squash-tim-chin-3-aeb38ef1bb0c4a1ba78112af65ba19ca.jpg",
  "tags": [
    "Sides",
    "Stovetop",
    "Pork",
    "Shiitake Mushroom",
    "Winter Squash"
  ],
  "title": "Leaf-Wrapped Winter Squash With Pork and Shiitakes Recipe",
  "full_text": "Leaf-Wrapped Winter Squash With Pork and Shiitakes Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nActive\n15 mins\nSoaking Time\n60 mins\nTotal\n2 hrs 15 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ndried lotus\nleaves\nor\n2\n(2-foot)\nsheets\nparchment paper\n2\nounces\n(\n55\ng\n)\ndried shiitake mushrooms\n, hydrated in boiled water until softened, drained and water reserved, then cut into 1/2-inch pieces\n3\ntablespoons\n(\n45\nml\n)\nsoy sauce\n2\ntablespoons\n(\n30\nml\n)\noyster sauce\n1\ntablespoon\n(\n15\nml\n)\nsesame oil\n1\ntablespoon\n(\n8\ng\n)\ncornstarch\n1/2\nteaspoon\nwhite pepper\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n8\nounces\n(\n225\ng\n)\nground pork\n1\nmedium\nclove garlic\n, minced\n2\ntablespoons\n(\n30\nml\n)\nShaoxing wine\n1\n(\n2- to 2 1/2-pound; 900 gram\n) winter\nsquash\n, such as\nbutternut\nor honeynut, peeled, seeded, and cut into 1/2-inch pieces\n1\nteaspoon\n(\n6\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume or the same weight\nDirections\nIn a large, heatproof container, cover leaves with hot water, weighing leaves down with a plate if necessary to keep them submerged, and soak until soft and pliable, at least 1 hour. (Skip this step if using parchment paper.)\nIn a small bowl, whisk together 6 tablespoons (90ml) reserved mushroom water, soy sauce, oyster sauce, sesame oil, cornstarch, and pepper until smooth and combined; set aside.\nIn a wok or 12-inch skillet, heat vegetable oil over high heat until smoking. Add pork and cook, stirring occasionally and making sure to break up any large chunks, until well browned, 6 to 8 minutes. Reduce heat to medium, stir in mushrooms and cook until heated through, about 2 minutes longer. Stir in garlic and cook until fragrant, about 30 seconds. Stir in wine and cook until slightly evaporated, about 30 seconds longer. Stir in sauce mixture and cook until liquid is glossy and thickened, about 1 minute.\nIn a large bowl, stir together pork mixture, squash, and salt until well combined and squash is coated.\nIf Using Lotus Leaves:\nDrain lotus leaves and pat dry with paper towels. Arrange each lotus leaf on a small shallow bowl or plate, with matte side facing up. Divide squash mixture between both lotus leaves, spooning to form an even mound. Working with one leaf at a time, fold each side of leaf over the top to form square package; flip package in bowl so that stem side is facing up.\nIf Using Parchment Paper:\nArrange each piece parchment paper on a small shallow bowl or plate. Divide squash mixture between both pieces of parchment, spooning to form an even mound. Working with one piece of parchment at a time, fold each side over the top to form square package; flip package in bowl so that folded sides are on the bottom.\nTo Steam:\nBring water to boil in a clean wok with stacking bamboo steamers or another steamer setup large enough to hold one package in its bowl at a time (if using a wok with stacking bamboo steamers, you can cook both packages at once; if using a different steamer setup, you may need to cook one package at a time, or you'll have to set up two side-by-side steamers to cook both at once). Steam squash packages in their bowls until squash is soft and cooked through but not mealy, about 45 minutes (you can use a cake tester, bamboo skewer, or instant-read thermometer probe to pierce the package and test the texture of the squash, which should offer no resistance); be sure to check water level occasionally, topping up with more boiling water if needed to prevent steamer from going dry. Remove packages from steamer. Cut small opening in packages and serve.\nSpecial Equipment\nWok\nwith stacking bamboo steamers or other steamer setup.\nMake-Ahead and Storage\nThe packages can be formed and refrigerated one day in advance before steaming in Step 7. For a thicker sauce consistency, you can use an equal amount of tapioca starch.\nSides\nStovetop\nPork\nShiitake Mushroom\nWinter Squash",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/leaf-wrapped-winter-squash-with-pork-and-shiitakes-recipe.webp?"
}