{
  "url": "https://www.seriouseats.com/steak-frites-recipe-8729192",
  "image_url": "https://www.seriouseats.com/thmb/JCn3FxU6t5KLkgozRMre5jLVzv8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241016-SteakFrites-AmandaSuarez-00-9ee48032a63f448da9db43ebc6f501b5.jpg",
  "tags": [
    "Beef Mains",
    "The Latest",
    "Russet Potatoes"
  ],
  "title": "Perfect Steak Frites",
  "full_text": "Perfect Steak Frites\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nResting Time\n40 mins\nTotal\n95 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Steak:\nTwo 1-\npound (\n450g) each bone-in or boneless ribeye o\nr strip steaks,\n1 1/4 to 1 1/2 inches thick, trimmed (see notes)\nKosh\ner\nsalt\n1\ntablespoon\n(15ml)\nneutral oil\nsuch a vegetable or canola oil\nFreshly\nground\nblack pepper\n2\ntablespoons\n(30g)\nbutter\nA few\nthyme\nsprigs\nand sliced shallots (optional)\nFor the Frites:\n2\npounds\nrusset potatoes\n(900g; about 4 large potatoes), peeled and cut lengthwise into 1/2-inch by 1/2-inch fries (keep raw potato sticks submerged in a bowl of water after cutting)\n3\ntablespoons\ndistilled\nwhite vinegar\nKos\nher\nsalt\n6\ncups\n(1.4L)\nneutral oil,\nsuch as peanut, vegetable or canola, for frying\n1/4\ncup\nstrained\nrendered beef\nfat from cooking the steaks or bacon or duck fat for frying, optional\nFor the Green Peppercorn Sauce:\n2\ntablespoons\n(28g)\nunsalted butter\n3\ntablespoons\ndrained, rinsed green\npeppercorns\npacked in brine (see notes)\n2\ntablespoons\n(21g) minced\nshallot\n, from about 1 medium shallot\n1\ntablespoon\n(8g)\nall-purpose flour\n1 1/2\ncups\n(260ml) homemade\nbeef stock\nor homemade chicken stock or store-bought low-sodium chicken broth\n1/4\ncup\n(60ml)\nbrandy\n1\nthyme\nsprig\n3/4\ncup\n(180ml)\nheavy cream\nKosher\nsalt\nto taste\nDirections\nFor the Steaks:\nPat steaks dry with paper towels. Season liberally with salt. Allow to rest at room temperature for at least 40 minutes and up to 2 hours. Alternatively, place on a plate or on a rack over a baking sheet in the refrigerator for up to 24 hours. Remove from refrigerator at least 40 minutes before cooking.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Frites:\nIn a 6-quart Dutch oven, add potatoes, distilled white vinegar, 3 quarts (2.8L) water, and 3 tablespoons (36g) salt. Bring to a boil over high heat and boil until potatoes are just beginning to soften and bend slightly, but not fully cooked, about 7 minutes. Drain and spread into an even layer on a wire rack set in a rimmed baking sheet and blot dry with paper towels; set aside while cooking the steaks.\nSerious Eats / Amanda Suarez\nTo Cook the Steaks:\nIn a large stainless-steel, cast iron, or carbon steel skillet, heat oil over high heat until smoking. Season steaks with pepper, add to pan, and cook, flipping with tongs every 2 minutes until well browned on all sides (including edges, which you can sear by holding steaks sideways with tongs) and the internal temperature has reached 110°F (43°C) for rare or 130°F (54°C) for medium (steak will continue to cook for a bit afterward), 6 to 12 minutes depending on thickness.\nSerious Eats / Amanda Suarez\nAdd butter and optional aromatics to pan and continue to cook, flipping often, for an additional 2 minutes. Remove from pan and let rest in a warm place for at least 5 minutes before serving. Pour off all but 1 tablespoon remaining beef fat from pan and set pan aside (do not wash).\nSerious Eats / Amanda Suarez\nTo Fry the Potatoes:\nOnce steaks are cooked and set aside, combine the blanched potatoes, oil, and strained 1/4 cup beef fat, bacon or duck fat (if using) in a large Dutch oven. Cook over high heat until oil is bubbling vigorously, about 5 minutes (oil temperature will hover around 245℉/118℃). Reduce heat to medium-high and continue to cook, without stirring, until potatoes are limp but exteriors are beginning to firm,12 to 15 minutes (during this stage, oil should quickly but gently bubble around the fries; lower heat if bubbling too vigorously).\nSerious Eats / Amanda Suarez\nUsing a thin metal spatula or cooking chopsticks, very gently scrape under and between potatoes to loosen them and prevent sticking. Continue to cook, gently stirring to prevent sticking, until light golden and crisp, 5 to 10 minutes longer. Using a skimmer or large slotted spoon, transfer fries to a paper towel-lined plate or rimmed baking sheet. Season liberally with salt.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Green Peppercorn Sauce:\nWhile the fries are cooking, add butter to reserved fat in steak pan and melt over medium-low heat. Add peppercorns and shallot and cook, stirring frequently, until shallot is softened, 3 to 5 minutes. Add flour and cook, stirring constantly, until fully combined and no lumps or raw flour smell remains, 2 minutes. Increase heat to medium and whisk in broth and brandy and a sprig of thyme. Bring to boil. Cook, whisking occasionally, until mixture reduces to 11/2 cups, 12 to 15 minutes.\nSerious Eats / Amanda Suarez\nAdd cream and cook, whisking occasionally, until reduced to 2 cups, about 10 minutes. Remove thyme sprig and season with salt and pepper to taste.\nSerious Eats / Amanda Suarez\nTo Serve:\nIf needed, reheat steaks under a preheated broiler, 1 to 2 minutes per side, and return sauce to the heat to warm through. Serve steaks with fries and green peppercorn sauce.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-inch cast iron, carbon steel, or stainless-steel skillet, large Dutch oven, spider skimmer\nNotes\nAn equivalent weight of porterhouse, T-bone, tenderloin, hanger, or flank steak can be used in place of ribeye steak. Try to get steaks at least one-and-a-half inches thick. If using a thinner cut of steak, shorten cooking time accordingly.\nMake sure to use European-style or French-style green peppercorns and not Thai-style green peppercorns as the flavor of the brine is slightly different.\nMake-Ahead and Storage\nThe sauce is best enjoyed right away, but it can be refrigerated in an airtight container for up to 2 days. Gently reheat in a saucepan over low heat on the stove top, whisking constantly before serving.\nBeef Mains\nThe Latest\nRusset Potatoes"
}