{
  "url": "https://www.seriouseats.com/steamed-buns-simmered-daikon-shiitake-pickled-mung-bean-recipe",
  "image_url": "https://www.seriouseats.com/thmb/e1yJjdazfEiIOWjRveWCJnPBhKg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130225-vegan-steamed-buns-3-411de0f9ec294df6bad86d7348dd4253.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Chinese",
    "Vegan Snacks & Appetizers",
    "Shiitake Mushroom",
    "Quick Snacks"
  ],
  "title": "Steamed Buns With Simmered Daikon and Shiitake, Pickled Bean Sprouts, and Spicy Mayonnaise (Vegan) Recipe",
  "full_text": "Steamed Buns With Simmered Daikon and Shiitake, Pickled Bean Sprouts, and Spicy Mayonnaise (Vegan) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n50 mins\nActive\n20 mins\nTotal\n60 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nOne\n6-inch piece\ndaikon radish\n, about\n2\ninches wide\n, peeled\n1\ncup\nsake\n1/4\ncup\nmirin\n(see note)\n3\ntablespoons\nsoy sauce\n2\ntablespoons\nplus\n1/2\ncup\nsugar\n, divided\n1\ncup\nwater\n, divided\n1\nsmall piece\nkombu\n(dried sea kelp, optional)\n12\nfresh shiitake mushroom\ncaps\n, each about\n1 1/2\ninches wide\n1/2\npound\nmung bean sprouts\n1/2\ncup\nrice wine vinegar\nKosher salt\n1\njalapeño\npepper\n, split in half\n1/2\ncup\nhomemade\nor store-bought\nvegan mayonnaise\n1/4\ncup\nchile-garlic sauce\n, such as\nsriracha\n12\nChinese sandwich-style steamed buns\n(bao)\n4\nscallions\n, very thinly sliced on an extreme bias, stored in a bowl of cold water in the fridge\n1/2\ncup\npicked\nfresh cilantro leaves\nDirections\nCut daikon into twelve 1/2-inch slices. Combine sake, mirin, soy, 2 tablespoons sugar, 1/2 cup water, and kombu (if using) in a medium saucepan. Add daikon slices and shiitake. Bring to a boil over high heat. Reduce to a bare simmer. Cover and cook, turning and rotating daikon occasinally until daikon is completely tender and colored all the way through, about 30 minutes. Transfer daikon and mushrooms to a paper towel-lined plate to drain. Return remaining liquid to a gently boil over medium heat and cook until reduced to 1/4 cup, about 10 minutes. Set aside.\nWhile daikon is cooking, place mung bean sprouts in a medium bowl. Combine vinegar, remaining 1/2 cup water, remaining 1/2 cup sugar, 1 teaspoon kosher salt, and jalapeño in a medium saucepan. Bring to a boil over high heat, stirring to dissolve sugar. Pour hot liquid over bean sprouts, then place a clean, lint-free paper towel or kitchen towel directly on the surface of the liquid, pressing down until it is completely saturated and keeps the bean sprouts submerged. Set aside to cool.\nCombine mayonnaise and chile-garlic sauce in a blender and blend until smooth. Transfer to a bowl and set aside.\nWhen daikon and shiitake are cooked, place steamed buns on a plate and cover with a damp paper towel. Microwave on high power until hot, about 1 minute. Spread spicy mayonnaise in each steamed bun, then add a slice of simmered daikon and a shiitake, a drizzle of the reduced simmering liquid, some pickled mung bean sprouts, sliced scallions, and cilantro leaves. Close sandwiches and serve with extra miso mayonnaise on the side for dipping.\nNotes\nMirin is a sweet Japanese rice wine that can be found in most supermarkets or Asian grocers. If unavailable, substitute an extra quarter cup of sake and sugar.\nMake-Ahead and Storage\nExcess mung bean sprouts can be stored submerged in pickling liquid in a sealed container in the refrigerator for up to 1 month. Extra mayonnaise can be stored in a sealed container in the refrigerator for up to 2 weeks.\nThis Recipe Appears In\nThe Vegan Experience: Two Steamed Bun Variations To Knock Your Socks Off\nSerious Entertaining: A Dim Sum-Inspired Chinese Food Party\nSnacks & Appetizers\nChinese\nVegan Snacks & Appetizers\nShiitake Mushroom\nQuick Snacks",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/steamed-buns-with-simmered-daikon-and-shiitake-pickled-bean-sprouts-and-spicy-mayonnaise-vegan-recipe.webp?"
}