{
  "url": "https://www.seriouseats.com/sticky-toffee-pudding-recipe-8714674",
  "image_url": "https://www.seriouseats.com/thmb/e0dx3yC_fanwLdTtuxf8R1sF6Nw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240918-SEA-StickyToffeePudding-AmandaSuarez-hero-3ba44b96a3da4c8aa11db26c8099a4bc.jpg",
  "tags": [
    "Cakes",
    "The Latest",
    "Desserts",
    "British"
  ],
  "title": "Sticky Toffee Pudding",
  "full_text": "Sticky Toffee Pudding\nClose\nJump to recipe\nPrep\n10 mins\nCook\n70 mins\nTotal\n80 mins\nServes\n15\nMakes\n1 9- by 13-inch cake\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pudding:\n454g pitted\nMedjool dates\n(16 ounces; about\n3\ncups\n)\n2\ncups\n(480ml)\nwater\n2\nteaspoons\nbaking soda\n454\ng\nall-purpose flour\n(16 ounces; 3 1/2 cups), plus more for dusting\n2\nteaspoons\nbaking powder\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n140\ng\nunsalted butter\n(5 ounces; 10 tablespoons), plus more for greasing, at room temperature\n454\ng\ngranulated sugar\n(16 ounces; 2 1/4 cups)\n5\nlarge\neggs\n, at room temperature\n2\nteaspoons\nvanilla extract\nFor the Sauce:\n454\ng\nunsalted butter\n(1 pound; 4 sticks)\n454\ng\ndark brown sugar\n(1 pound; 2 1/4 cups)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nvanilla extract\n1\ncup\n(240ml)\nheavy cream\nVanilla ice cream\nor whipped cream, for serving (optional)\nDirections\nAdjust oven rack to middle position and preheat to 350ºF (175ºC). Grease a 9- by 13-inch baking pan with butter, then dust with all-purpose flour, shaking out excess.\nSerious Eats / Amanda Suarez\nIn a medium saucepan, combine dates with water. Bring to a boil over high heat. Remove from heat, add baking soda and salt, and let sit until dates have softened and mixture has slightly cooled, stirring occasionally, about 15 minutes. (The mixture will bubble up—this is fine and normal.)\nSerious Eats / Amanda Suarez\nUsing an immersion blender, carefully purée date mixture until smooth. (Alternatively, transfer date mixture to a food processor or blender and blend until smooth.)\nSerious Eats / Amanda Suarez\nIn a medium bowl, whisk flour and baking powder to combine; set aside.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the paddle attachment, beat butter, sugar, and vanilla on medium-high speed until well combined and fluffy, 2 to 3 minutes, pausing to scrape the bowl and beater as needed with a flexible spatula. (It will be light yellow and won’t be as creamy as when you beat butter for a cake.) Reduce speed to low and add eggs one at a time, letting each fully incorporate before adding the next, scraping down as needed.\nSerious Eats / Amanda Suarez\nStop mixer and add flour. Mix on low speed until just combined, about 1 minute. Add dates and their liquid and mix on low speed until fully incorporated, 30 seconds to 1 minute, using a flexible spatula to scrape down the sides of the bowl as needed.\nSerious Eats / Amanda Suarez\nUsing a flexible spatula, scrape batter into prepared pan and bake until cake has risen, darkened slightly, and a skewer inserted comes out clean, about 1 hour.\nSerious Eats / Amanda Suarez\nRemove from oven and cool on a wire rack until cake is warm to the touch but no longer hot, about 30 minutes.\nSerious Eats / Amanda Suarez\nFor the Sauce:\nAbout 10 minutes before you plan to serve the cake, in a medium saucepan, melt butter over medium heat. Add sugar and vanilla extract, whisking until smooth and sugar has dissolved, 4 to 6 minutes. Remove from heat and whisk in heavy cream to incorporate. Pour over cake and serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n9- by 13-inch baking pan, medium saucepan, immersion blender, stand mixer, whisk, flexible spatula\nNotes\nThis recipe can be prepared using an electric mixer.\nMake-Ahead and Storage\nThe cake can be wrapped tightly in plastic or stored in an airtight container at room temperature for up to 3 days. The sauce can be refrigerated in an airtight container for up to 5 days and can be reheated in a saucepan on the stove over medium heat or in the microwave until warmed through.\nThe cake can be wrapped tightly and frozen for up to 1 month. Place wrapped cake in fridge to thaw overnight.\nCakes\nThe Latest\nDesserts\nBritish"
}