{
  "url": "https://www.seriouseats.com/sticky-toffee-pudding-with-port-toffee-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/thThxwcVw-ncvXGcbcLOMO-KzX8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__12__20111213-127677-LTE-Prune-Toffee-Pudding-PRIMARY-1d0b794498394f75b720402a39664ce9.jpg",
  "tags": [
    "Bread Pudding"
  ],
  "title": "Sticky Toffee Pudding with Port Toffee Sauce Recipe",
  "full_text": "Sticky Toffee Pudding with Port Toffee Sauce Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nActive\n30 mins\nCooling Time\n20 mins\nTotal\n85 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pudding:\n5\ntablespoons\nunsalted butter\n, melted\n8\nounces\n(about\n1 1/4\ncups\n) pitted\nprunes\n, quartered\n1\ncup\ntawny port\n2\nteaspoons\npure vanilla extract\n1 1/4\ncups\nall-purpose flour\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nsalt\n3/4\ncup packed\ndark brown sugar\n1/2\nteaspoon\nfinely grated\nlemon zest\n2\nlarge\neggs\nFor the Port Toffee Sauce:\n8\ntablespoons\nunsalted butter\n3/4\ncup packed\ndark brown sugar\n2/3\ncup\nheavy cream\n3\ntablespoons\ntawny port\n2\ntablespoons\nmild molasses\n1\nteaspoon\nlemon juice\n1/8\nteaspoon\nsalt\n1/2\ncup\nchopped roasted and\nsalted pistachios\n(optional)\nMaldon salt\n(optional)\nDirections\nFor the Pudding:\nAdjust oven rack to middle position and heat oven to 350°F (175°C). Grease a 9-inch round baking pan with 1 tablespoon butter. Set pan in large roasting pan lined with clean kitchen towel. Bring kettle or medium saucepan of water to boil over high heat.\nBring prunes and port to boil over medium-high heat in small saucepan. Reduce heat to medium-low and simmer until liquid is slightly reduced and prunes are plump, 8 to 10 minutes. Stir in vanilla. Remove from heat and cool slightly, about 10 minutes.\nIn medium bowl, whisk together flour, baking powder, baking soda, and salt.\nPulse prunes, cooking liquid, brown sugar, and lemon zest in food processor until ground to a paste. Add eggs and pulse several times until thoroughly combined. With machine running, pour in remaining 4 tablespoons melted butter.\nTransfer prune mixture to large bowl. With rubber spatula, fold in flour mixture.\nScrape batter into prepared pan. Add enough boiling water to reach about halfway up sides of pan. Cover roasting pan tightly with aluminum foil.\nBake until tester inserted in center of cake comes out with moist crumbs attached, 40 to 50 minutes. Immediately remove pan from water bath and set on wire rack (keep covered).\nFor the Port Toffee Sauce:\nMelt butter in medium saucepan over medium heat.\nAdd brown sugar and salt and whisk until smooth. Continue to cook, stirring occasionally, until sugar is dissolved and mixture looks puffy, 3 to 4 minutes. Slowly pour in cream, port, and molasses and whisk to combine. Reduce heat to medium-low and simmer until frothy, about 3 minutes. Stir in lemon juice.\nPoke cake with paring knife or skewer, then, pour toffee sauce over pudding and spread evenly with rubber spatula. Allow to cool slightly, about 10 minutes, then scoop out portions and sprinkle with (optional) pistachios and Maldon salt.\nSpecial Equipment\n9-inch round baking pan\n, foil,\nroasting pan\n,\nfood processor\n,\nsmall saucepan\n,\nrubber spatula\n,\nmedium saucepan\nMake-Ahead and Storage\nLeftovers can be covered and refrigerated for up to 3 days; be sure to microwave portions until heated through prior to serving.\nBread Pudding"
}