{
  "url": "https://www.seriouseats.com/stir-fried-clams-with-xo-sauce",
  "image_url": "https://www.seriouseats.com/thmb/weGNc4z5WgwjA--98axFvh-8WeY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190411-clams-xo-sauce-vicky-wasik-11-2c338129989e45d0ab5eee40ef9094b7.jpg",
  "tags": [
    "Hors D'Oeuvres",
    "Clams",
    "Chinese",
    "Seafood Stir-Fry"
  ],
  "title": "Stir-Fried Clams With XO Sauce Recipe",
  "full_text": "Stir-Fried Clams With XO Sauce Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nPurging Time\n30 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n2\npounds\n(\n900\ng\n)\nfresh small clams\n, such as littlenecks, Manilas, or cockles (about\n3\ndozen\nlittlenecks or\n4\ndozen\nManilas or cockles)\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n4\nmedium\ngarlic cloves\n(\n20\ng\n), thinly sliced\n2\nmedium\nscallions\n(\n40\ng\n), white and green parts divided and thinly sliced\n1\n(1-inch)\npiece\n(\n1/2\nounce\n;\n15\ng\n)\nfresh ginger\n, peeled and thinly sliced\n1\nfresh green or red Thai\nchile\n, stemmed and thinly sliced\n1/2\ncup\n(\n120\nml\n)\nShaoxing wine\n(see notes)\n1/4\ncup\n(\n75\ng\n)\nXO sauce\nDirections\nFill a large bowl with cold water and stir in enough salt to make it salty like the sea (a 3% salt solution, by weight, is a good ratio). Add clams and let stand 30 minutes. Lift clams from water and discard purging water; if there is sand in the bottom of the bowl, rinse it out and repeat this process until clams no longer release sand into the water (usually 2 to 3 purging cycles). Discard any clams that are gaping open and refuse to close when prodded.\nIn a large skillet or wok, heat vegetable oil over medium heat until shimmering. Add garlic, white scallion parts, ginger, and Thai chili, and cook, stirring frequently, until vegetables are lightly golden and just begin to soften, about 5 minutes.\nAdd clams and Shaoxing wine, cover, and increase heat to high. Cook, checking every 30 seconds or so and transferring clams as they open to a large heatproof serving bowl, until all clams have opened, about 5 minutes. Taste the cooking liquid for seasoning; if it is especially salty, add water, 1 tablespoon at a time, until the salinity is brought back into balance.\nAdd XO sauce to skillet, and stir until XO is heated through and well-incorporated. Spoon sauce over the clams, and then scatter reserved green scallion parts over top. Serve immediately.\nSpecial equipment\nLarge skillet or\nwok\nNotes\nDry sherry, or in a pinch even a dry white wine, can be substituted for Shaoxing wine.\nMake-Ahead and Storage\nThe clams can be purged and stored in the refrigerator up to 1 day in advance. The rest of the recipe comes together very quickly and, as with most fresh shellfish dishes, is best enjoyed immediately.\nThis Recipe Appears In\nHow to Make XO Sauce, the Cook’s Condiment\nHors D'Oeuvres\nClams\nChinese\nSeafood Stir-Fry"
}