{
  "url": "https://www.seriouseats.com/stovetop-butter-chicken",
  "image_url": "https://www.seriouseats.com/thmb/epm2_EgrEYkC2gAnQhNXkXiO9aI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__02__20200218-butter-chicken-vicky-wasik-43-90ccaa987e1245e986ced9f67a97126b.jpg",
  "tags": [
    "Indian",
    "Pressure Cooked Chicken",
    "Chicken Thighs",
    "Tomato",
    "Tomato Sauces"
  ],
  "title": "Butter Chicken Recipe",
  "full_text": "Butter Chicken Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n80 mins\nActive\n30 mins\nTotal\n95 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor Marinating the Chicken:\n1\ntablespoon\nkasuri methi (fenugreek leaves) or, alternatively,\n2\nteaspoons\nfenugreek seeds\n(see note)\n1/4\ncup\n(\n60\nml\n)\nplain Greek yogurt\n,\nstore-bought\nor\nhomemade\n1\ntablespoon\ngaram masala\n, store-bought or\nhomemade\n2\nteaspoons\nDiamond Crystal\nkosher salt\n(if using table salt, use half as much)\n1\nteaspoon\nkala namak (\nblack salt\n) (optional, see note)\n1\n(\n1-inch) piece\nfresh ginger\n(\n1/2\nounce\n;\n14\ng\n), peeled and finely grated\n2\npounds\n(\n900\ng\n)\nboneless, skinless chicken thighs\n(about\n4\n), cut into bite-size, 1-inch pieces\nFor the Makhani Sauce:\n1\ntablespoon\nplus\n2\nteaspoons\nkasuri methi (fenugreek leaves) or, alternatively,\n1\ntablespoon\nfenugreek seeds\n(see note)\n2\nwhole\ndried chiles de arbol\n(see note)\n1\npod\nbrown\ncardamom\nor, alternatively,\n1\npod\ngreen cardamom\n(see note)\n1\nwhole\nclove\n1\ntablespoon\ngaram masala\n, store-bought or\nhomemade\n1\ntablespoon\nDiamond Crystal\nkosher salt\n(if using table salt, use half as much by volume or the same by weight)\n1\n(\n28-ounce\n;\n800 g\n) can\nwhole fire-roasted tomatoes\nwith their juices (see note)\n1\nounce\n(\n28\ng\n)\nraw cashews\n(about\n12 to 15\n)\n1 1/4\ncups\nwater\n(\n295\nml\n), divided\n2\ntablespoons\n(\n30\nml\n)\ncanola oil\nor other neutral-flavored oil\n1\nmedium\nwhite onion\n, peeled and cut into 1/2-inch dice\n1/4\nteaspoon\nbaking soda\n1\n(1-inch) piece\nof\nginger\n(\n1/2\nounce\n;\n14\ng\n), peeled and thinly sliced\n4\nmedium cloves\ngarlic\n, smashed and roughly chopped\n1/2\ncup\n(\n120\nml\n)\nheavy cream\n, plus more for drizzling\n4\ntablespoons\n(\n60\ng\n)\nunsalted butter\n, cut into\n4\npieces\nWarm\nlong-grain rice\n, for serving\nDirections\nTo Marinate the Chicken:\nIn a small skillet, toast fenugreek leaves (or fenugreek seeds, if using) over medium heat, tossing them constantly, until quite fragrant, about 30 seconds. Transfer toasted leaves to spice grinder or mortar and pestle and grind to fine powder. Set aside.\nIn the center of a rimmed baking sheet, create a roughly 9- by 13-inch aluminum-foil boat with 1-inch sides, and set aside. (Alternatively, if you have a 1/4 rimmed baking sheet, use that instead, omitting foil.) In a medium mixing bowl, stir together yogurt, garam masala, salt, black salt, grated ginger, and ground fenugreek leaves.\nSerious Eats / Vicky Wasik\nAdd chicken thigh pieces to bowl and, using clean hands, toss with marinade until evenly coated. Transfer chicken to prepared baking sheet, arranging pieces in a single, even layer in the aluminum-foil boat.\nSerious Eats / Vicky Wasik\nFor the Makhani Sauce:\nAdd fenugreek leaves (or seeds, if using), chiles de arbol, brown cardamon (or green cardamom, if using), and clove to small skillet and place it over medium heat. Toast, tossing frequently, until spices are quite fragrant, about 1 to 2 minutes. Transfer spices to spice grinder or mortar and pestle along with garam masala and salt and grind to a fine powder. Set aside. (See the note section for instructions on a shortcut spice mix using pre-ground spices.)\nIn a small, microwave-safe bowl, combine cashew nuts and 1/4 cup (60ml) water. Microwave on high until cashews look plump and have softened slightly, about 1 minute. Set aside.\nSerious Eats / Vicky Wasik\nIn a Dutch oven, heat canola oil over medium-high heat until shimmering. Add onions and baking soda and, using a wooden spoon, stir to coat onions in oil and distribute baking soda. Cook, stirring occasionally, until onions have completely broken down, most of their moisture has cooked off, and they begin to brown, 14 to 17 minutes. If at any point onions seem to be browning too quickly or unevenly, add a tablespoon (15ml) of water and scrape up any brown bits that form on the bottom of the pot.\nReduce heat to medium low. Add ginger and garlic to pot and cook, stirring constantly, until quite fragrant, about 1 minute. Using a wooden spoon, push onions into center of pot to form a mound. Add ground spice mixture to the mounded onions to prevent spices from scorching. Cook, stirring constantly, until onions are coated in spices and mixture is very fragrant, about 30 seconds. Add cashews and their soaking liquid, scraping up any bits stuck to the bottom of the pot. Add tomatoes and their juices plus 1 cup (240ml) water and, using the back of wooden spoon, crush tomatoes.\nBring to a boil, then reduce heat to maintain gentle simmer. Cook, stirring occasionally, until tomatoes are completely broken down and liquid has reduced, about 40 minutes.\nMeanwhile, adjust oven rack to about 3 inches below broiler element and preheat broiler on high. Transfer chicken to broiler. Cook, checking the chicken frequently to ensure it's not burning, until chicken is charred in spots and is fully cooked through, about 14 minutes (time will vary depending on the strength of the broiler). Remove chicken from broiler and set aside.\nSerious Eats / Vicky Wasik\nUsing an immersion blender and off the heat, blend contents of Dutch oven until completely smooth, about 2 minutes. Alternatively, transfer contents of pot to blender and blend until completely smooth, about 2 minutes. Add butter and cream, and blend until completely smooth and emulsified, about 2 minutes. At this point, you may remove 1 1/2 (360ml) cups of sauce and reserve it for another use.\nSerious Eats / Vicky Wasik\nTo Finish:\nAdd reserved broiled chicken along with any juices in the sheet pan to sauce and stir until chicken is well incorporated and warmed through. Ladle chicken and sauce into serving bowl and drizzle with additional heavy cream. Serve immediately with rice alongside.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nDutch oven\n;\nspice grinder\n;\nimmersion blender\nor\nblender\n.\nNotes\nIf you cannot find kala namak, or black salt, you can substitute a 1/2 teaspoon of Diamond Crystal kosher salt. (Read more about black salt in our\nguide to salt\n).\nIf you'd prefer to forego toasting and grinding the spices yourself, you can use pre-ground spices. You can substitute 1 tablespoon of ground fenugreek for the 2 teaspoons of fenugreek called for in the marinade, and 1 tablespoon plus 1 teaspoon of ground fenugreek for the 1 tablespoon of fenugreek seeds called for in the sauce; you can substitute 1/4 teaspoon of ground cardamom for the 1 green cardamom pod called for in the sauce; you can substitute 1/8 teaspoon of ground clove for the 1 clove called for in the sauce; you can substitute 1/2 teaspoon of cayenne pepper for the chile de arbol (more, if you like it spicier).\nBrown cardamom is sometimes called black cardamom, but note that it's not the same as Chinese black cardamom (also sometimes called red cardamom).\nFire-roasted whole canned tomatoes are preferred, but plain whole canned tomatoes can be used as well.\nMake-Ahead and Storage\nSealed in an airtight container, butter chicken will keep for up to a week in the refrigerator.\nRead More\nFloyd Cardoz's Butter Chicken (Chicken Tikka Makhani)\nThe Best Chicken Tikka Masala\nIndian Village (Gavthi) Chicken Curry\nKerala-Style Chicken (Nadan Khozi Curry)\nGrilled Naan\nIndian\nPressure Cooked Chicken\nChicken Thighs\nTomato\nTomato Sauces"
}