{
  "url": "https://www.seriouseats.com/strawberry-icebox-cake-recipe-8686143",
  "image_url": "https://www.seriouseats.com/thmb/wv3g9G18hAoDrEdqbJy5tae3nx0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240730-SEA-StrawberryIceboxCake-AmandaSuarez-hero-238a002f7ddd4ed185fcf31c472c2285.jpg",
  "tags": [
    "The Latest",
    "Summer Desserts",
    "Desserts",
    "Vegetarian",
    "Summer"
  ],
  "title": "Strawberry Icebox Cake",
  "full_text": "Strawberry Icebox Cake\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nChilling Time\n7 hrs\nTotal\n7 hrs 45 mins\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Strawberry Compote:\n1 1/2 pound (\n680\ng\n) fresh or frozen hulled\nstrawberries\n, quartered\n3 tablespoons\ngranulated sugar\n(1 1/2 ounces;\n45\ng\n)\n1\ntablespoon\n(15ml)\nlemon juice\nfrom 1 medium lemon\nFor the Whipped Cream:\n1 1/2\ncups\n(355ml)\nheavy cream\n1 1/2\nteaspoons\nvanilla\npaste (see notes)\n1\ntablespoon\n(7g)\npowdered sugar\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nTo Assemble:\n40 vanilla wafers, such as\nNilla wafers\n(\n4 1/2\nounces\n; 128g)\n6\nlarge\nfresh strawberries\n, hulled and halved lengthwise (see notes)\nDirections\nFor the Strawberry Compote:\nIn a large bowl, toss strawberries with sugar to evenly coat. Let sit until juices begin to pool at the bottom of the bowl, about 15 minutes. Using a colander or fine-mesh sieve, drain strawberries. In a medium saucepan, combine strained macerated strawberries, sugar, and lemon juice. Bring to a simmer over medium heat and cook, stirring occasionally, until strawberries are soft but still intact and beginning to become saucy, about 15 minutes.\nSerious Eats / Amanda Suarez\nIn a large bowl, set up an ice bath by filling it about halfway with a combination of cold water and ice. Transfer strawberry compote to a medium bowl; place bowl on ice bath to chill until cool to the touch, about 30 minutes.\nFor the Whipped Cream:\nIn the bowl of a stand mixer fitted with the whisk attachment, whip heavy cream, vanilla paste, powdered sugar, and salt on medium-high speed until medium-stiff peaks form, about 2 minutes. (Alternatively, combine heavy cream, vanilla paste, powdered sugar, and salt in a large mixing bowl, and, using a hand mixer fitted with the whisk attachment, beat on medium speed until medium stiff peaks form, about 3 minutes.)\nSerious Eats / Amanda Suarez\nTo Assemble:\nLine a 9- by 4-inch loaf pan with plastic wrap. Using a flexible spatula or offset spatula, evenly spread 1/2 cup (50g) whipped cream on the bottom. Cover surface with 8 vanilla wafers and gently press into the whipped cream. Along the perimeter of the pan, gently place strawberry halves, hulled side up and cut side flush to the sides of the pan, on top of the wafer-layer by pressing the cut side of the strawberries against the plastic-lined sides. (You should be able to fit about 5 halves on each side, with 1 half on each end of the loaf.)\nSerious Eats / Amanda Suarez\nSpoon 1/4 cup (48g) compote over vanilla wafers and around the strawberry halves. Top compote with 1/2 cup whipped cream, another layer of 8 wafers, followed by 1/4 cup (48g) compote. Repeat twice more, until you have 4 layers in total. Top with a thin layer of whipped cream. Press plastic wrap against surface of whipped cream and refrigerate until vanilla wafers have softened, at least 6 hours and up to 24 hours.\nSerious Eats / Amanda Suarez\nLine a 9- by 13-inch rimmed baking sheet with parchment. Remove plastic from top of cake and invert icebox cake onto lined baking sheet. Transfer to freezer until firm enough to slice, about 1 hour or up to 1 week.\nSerious Eats / Amanda Suarez\nRemove cake from freezer. Hold both ends of the parchment paper and lift to transfer cake to cutting board. Wiggle a large offset spatula under the cake to separate it from the parchment paper, then gently pull to remove it. Allow cake to soften slightly at room temperature for 5 minutes.\nSerious Eats / Amanda Suarez\nUsing a hot knife, slice cake into 8 pieces and serve. (For cleaner cuts, run knife under warm water and carefully dry knife with a clean kitchen towel before portioning each slice.) If not serving immediately, place slices on a rimmed baking sheet lined with parchment and keep frozen until ready to serve. When ready to serve, remove cake from freezer and transfer onto serving plates; allow cake to soften slightly for 10 minutes before serving.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFine mesh sieve, stand mixer or hand mixer, 9- by 4-inch loaf pan, plastic wrap, 9- by- 13-inch rimmed baking sheet, parchment paper, large offset spatula, knife\nNotes\nVanilla extract can be substituted for vanilla paste, but its flavor won’t be quite as robust.\nThe number of strawberries you use will depend on the size of your strawberries; if you have small or medium strawberries, you may have to use 8 to 10 strawberries to fully line the perimeter of the pan.\nMake-Ahead and Storage\nThe frozen, whole icebox cake can be frozen for up to 1 week before slicing and serving.\nSliced icebox cake can be frozen on a rimmed baking sheet lined with parchment and tightly wrapped with plastic for up to 5 days.\nThe Latest\nSummer Desserts\nDesserts\nVegetarian\nSummer",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/strawberry-icebox-cake.webp?"
}