{
  "url": "https://www.seriouseats.com/stracciatella-gelato-sweet-cream-chocolate-chip",
  "image_url": "https://www.seriouseats.com/thmb/memc-SxUemIwHLxyRKxI2OkSpoM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__06__20180628-stracciatella-vicky-wasik-14-3e403e46701f4e1bb0c662167c790698.jpg",
  "tags": [
    "Ice Cream",
    "Summer Desserts",
    "Italian",
    "Chocolate",
    "Valentine's Day"
  ],
  "title": "Stracciatella Gelato (Sweet Cream Chocolate Chip) Recipe",
  "full_text": "Stracciatella Gelato (Sweet Cream Chocolate Chip) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n25 mins\nChurning/Freezing Time\n7 hrs 30 mins\nTotal\n7 hrs 45 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n9 1/4\nounces\nplain or very lightly toasted\nsugar\n(about\n1 1/3\ncups\n;\n265\ng\n)\n1 1/4\nounces\ncornstarch\n(about\n1/4\ncup\n;\n35\ng\n)\n1/2\nteaspoon\nplus\n1/8\nteaspoon\n(\n2.5\ng\n) Diamond Crystal\nkosher salt\n, or more to taste; for table salt, use about half as much by volume or the same weight\n20\nounces\nbest quality\nwhole milk\n, preferably grass-fed, divided (about\n2 1/2\ncups\n;\n565\ng\n)\n8\nounces\nbest quality\nheavy cream\n, preferably grass-fed (about\n1\ncup\n;\n225\ng\n)\n2\nounces\nbest quality\nchocolate, between 60-75% cocoa solids\n, preferably single origin, see note (about\n1/3\ncup\n;\n55\ng\n)\n1/2\nounce\nrefined coconut oil\n(about\n1\nheaping\ntablespoon\n;\n15\ng\n)\nDirections\nWhisk sugar, cornstarch, and salt together in a 3-quart saucier. When no lumps of cornstarch remain, add exactly 14 ounces of the milk (about 1 2/3 cups; 396g) and whisk to combine. Cook over medium heat, whisking constantly but not vigorously, until it begins to simmer. This will take about 6 minutes, if the process seems to be moving slowly, simply turn up the heat. When the mixture comes to a boil, set a timer and continue cooking and whisking for exactly 1 minute. This ensures the cornstarch is fully hydrated.\nImmediately transfer mixture to a large bowl, then whisk in the remaining milk and cream. Bearing in mind that the gelato will taste substantially less sweet once frozen, season with an additional pinch of salt, if desired. Cover and refrigerate the gelato base until cold, thick, and no warmer than 40°F (4°C), about 3 hours (this process can be sped along with an ice bath if time is of the essence; in that case, a stainless steel bowl will help cool the base even faster).\nIn a microwave-safe bowl, melt the chocolate with a few 15-second bursts at normal power, pausing to stir well between each addition. Add the coconut oil, and continue stirring until fully melted. For fine chips that partially homogenize into the gelato, cool to about 90°F (32°C) before use. For larger, chunkier pieces that remain slightly more distinct, cool to about 70°F (21°C) instead. For homogeneous, custom pieces that do not dissolve into the gelato, pour the warm chocolate mixture onto a sheet of parchment with a plate or cutting board underneath, and spread to your desired thickness; freeze until solid and very cold, about 15 minutes, then crumple the parchment to break the chocolate into whatever size pieces you prefer.\nChurn the gelato base in an ice cream maker according to the manufacturer’s directions. Meanwhile, place a quart-sized container and flexible spatula in the freezer. When gelato looks fluffy and thick, add the cooled and melted chocolate, or the pre-made chocolate chips, and churn until well combined. Shut off the machine and, using the chilled spatula, scrape gelato into the chilled container. Cover with plastic wrap pressed directly against the surface of the gelato, and freeze until thick enough to scoop, about 4 hours.\nGelato is typically served at about 16°F (-9°C), but most American freezers run at 0°F (-18°C). For the most authentic presentation, soften gelato to 16°F in the refrigerator before serving. In a squat container, like a yogurt tub or a square storage container, this will take about 45 minutes. The timing will vary substantially depending on the size, shape, and material of the container (such as a metal loaf pan or glass baking dish), so check on the gelato frequently to ensure it does not melt.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n3-quart stainless steel saucier\n,\nice cream maker\n, non-reactive, freezer-safe container or 2-quart\nbaking dish\nNotes\nSingle-origin chocolates truly shine in stracciatella; look for this style in specialty stores and boutiques, well-stocked supermarkets like Whole Foods, or shop online. My favorites from recipe testing include Kokoa Kamili (Tanzania), Maya Mountain (Belize), Costa Esmerelda (Ecuador), and Tumaco (Columbia) from Dandelion chocolate, along with Atlantic Forest (Brazil) and Dark Blend (Brazil) from Harper Macaw.\nRead More\nRaspberry Ripple Goat's-Milk Gelato\nLemon Mascarpone Gelato\nWhat's the Difference Between Gelato and Ice Cream?\nIce Cream\nSummer Desserts\nItalian\nChocolate\nValentine's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/stracciatella-gelato-sweet-cream-chocolate-chip-recipe.webp?"
}