{
  "url": "https://www.seriouseats.com/strawberry-shortcake-recipe-7556950",
  "image_url": null,
  "tags": [
    "Strawberry",
    "The Latest",
    "Desserts",
    "Summer"
  ],
  "title": "Strawberry Shortcake",
  "full_text": "Strawberry Shortcake\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nMacerating and Chilling Time\n95 mins\nTotal\n2 hrs 15 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Strawberries:\n1 3/4\npounds\n(\n800\ng\n)\nstrawberries\n(about\n35\nmedium-large\nberries\n), hulled and cut into 3/4-inch pieces\n1/2\ncup\ngranulated sugar\n(\n3.5\nounces\n;\n100\ng\n)\n1\ntablespoon\n(\n15\nml\n)\nfresh lemon juice\nFor the Shortcakes:\n2 1/2\ncups\nall-purpose flour\n(\n11.3\nounces\n;\n320\ng\n), plus more for dusting\n1/4\ncup\nplus\n2\nteaspoons\ngranulated sugar\n(\n2\nounces\n;\n60\ng\n)\n1\ntablespoon\n(\n12\ng\n)\nbaking powder\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n10\ntablespoons\ncold\nunsalted butter\n(\n5\nounces\n;\n140\ng\n), cut into 3/4-inch cubes\n1 1/8\ncups\n(\n265\nml\n) cold\nheavy cream\n, plus more for brushing the shortcakes\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\nDemerara sugar\n, for sprinkling\nFor the Whipped Cream:\n1 1/2\ncups\n(\n360\nml\n)\nheavy cream\n2\ntablespoons\n(\n20\ng\n)\nconfectioners' sugar\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\nFor Serving (optional):\nConfectioners' sugar\nand/or\nDemerara sugar\nFresh mint\nor basil leaves\nWhole\nstrawberries\nDirections\nFor the Strawberries:\nIn a large bowl, combine diced strawberries, granulated sugar, and lemon juice and stir until well combined. Cover bowl, transfer to refrigerator, and let macerate, stirring periodically, for at least 1 hour and up to 8 hours.\nSerious Eats / Amanda Suarez\nMeanwhile, for the Shortcakes:\nUsing a fine-mesh strainer, sift flour into a large bowl, then add sugar, baking powder, and salt. Whisk for 30 seconds to combine.\nAdd butter and, using your fingertips, press the butter into the dry ingredients until mixture resembles coarse bread crumbs with some pea-sized pieces of butter remaining.\nSerious Eats / Debbie Wee\nIn a measuring cup, stir together heavy cream and vanilla extract. Form a well in the center of the flour mixture, then pour cream into the well. Using a wooden spoon, stir until a shaggy dough forms, about 30 seconds (you might still see some crumbly flour bits in the bottom of the bowl, that's okay).\nSerious Eats / Debbie Wee\nTurn dough and any unincorporated flour out onto a lightly floured work surface. Using your hands, pat dough into a mound; this should only take 10-15 seconds as the goal is not to knead, but to gently bring the dough together. Gently pat dough into a rectangle approximately 5- by 7.5-inches in size and about 1 inch thick.\nSerious Eats / Debbie Wee\nUsing a 2.5-inch round biscuit cutter, punch out dough into circles; for the cleanest cuts, try to press directly down instead of twisting the cutter and periodically wipe the cutter clean with a dry towel. Using a floured metal spatula, transfer dough circles to a parchment-lined rimmed baking sheet, allowing 2-3 inches between the cakes. Bring dough scraps together with your hands and repeat the process. Transfer baking sheet to the refrigerator and chill for 30 minutes.\nSerious Eats / Debbie Wee\nWhile shortcakes chill, preheat oven to 400°F (205°C). Once chilled, use a pastry brush to brush tops of cakes with cold heavy cream, then sprinkle lightly with Demerara sugar. Bake until shortcakes are slightly risen, golden brown, and slightly cracked on top, 15 to 18 minutes. Allow shortcakes to cool on baking sheet for 5 minutes, then transfer to a wire rack and allow to cool until slightly warm while you prepare the whipped cream.\nSerious Eats / Debbie Wee\nFor the Whipped Cream:\nTo a large metal mixing bowl or the bowl of a stand mixer fitted with the whisk attachment, add cold heavy cream and whip on medium-high speed until soft peaks form, about 4 minutes. Use a fine-mesh strainer to sift in confectioners' sugar, then add vanilla extract. Whip on high speed until just combined, about 10-15 seconds.\nSerious Eats / Debbie Wee\nTo Assemble:\nUsing a serrated knife, slice each shortcake in half horizontally. Place bottom halves on dessert plates. Top each with a spoonful of macerated strawberries and a dollop of whipped cream, followed by the top half of the shortcake. Top with another spoonful of berries and another dollop of whipped cream.\nSerious Eats / Debbie Wee\nIf desired, dust with confectioners' sugar and/or sprinkle with extra Demerara sugar (for more crunch), and garnish with fresh herbs and/or whole strawberries. Serve immediately.\nSerious Eats / Debbie Wee\nSpecial Equipment\nPastry brush, wire whisk, serrated knife, 2.5-inch round metal cutter, metal spatula, rimmed half-sheet pan, wire rack, parchment paper, fine-mesh strainer, stand- or hand-mixer.\nSerious Eats / Debbie Wee\nNotes\nRefrigerate the cubed butter until you are ready to incorporate it into the flour mixture. Do not let the butter sit at room temperature or it will become too soft.\nFlour countertop as sparingly as possible. A generously floured countertop can add too much extra flour to the dough, resulting in dry shortcakes.\nIf your rimmed half-sheet pan does not fit in the refrigerator, you can chill the circles on a smaller parchment-lined plate or tray, then transfer to prepared sheet for baking.\nA hot oven is very important, so preheat it for the entire 30 minutes the shortcakes are chilling. However, do not begin preheating until shortcakes are in the refrigerator: This is to prevent butter from softening, as the kitchen must stay as cool as possible while working with the dough.\nMake-Ahead and Storage\nStrawberries should macerate in the refrigerator for at least 1 hour. If desired, the strawberry mixture can be prepared up to 8 hours in advance.\nShortcakes are best enjoyed on the day they are made, and ideally while still slightly warm.\nBake the cakes no more than 4-6 hours in advance, and don't assemble the finished dessert until you are ready to serve.\nStrawberry\nThe Latest\nDesserts\nSummer"
}