{
  "url": "https://www.seriouseats.com/strawberry-pretzel-salad-recipe-11728220",
  "image_url": null,
  "tags": [
    "Recipes",
    "Summer Desserts",
    "Desserts",
    "Dessert Bars",
    "Summer"
  ],
  "title": "The Retro Strawberry Dish That's a Staple at My Potlucks",
  "full_text": "The Retro Strawberry Dish That's a Staple at My Potlucks\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nCooling and Chilling Time\n4 hrs 50 mins\nTotal\n5 hrs 45 mins\nServes\n12\nto 15\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n7\nounces\npretzel twists\n(\n200\ng\n; about\n5\ncups\n)\n1/3\ncup\n(\n2.5\nounces\n;\n67\ng\n)\ngranulated sugar\n12\ntablespoons\n(\n6\nounces\n;\n170\ng\n)\nunsalted butter\n, melted\nFor the Filling:\n16\nounces\n(\n454\ng\n) plain, full-fat\ncream cheese\n5 1/4\nounces\ngranulated sugar\n(about\n3/4\ncup\n;\n150\ng\n)\n3/4\nounce\nfresh juice\nfrom\n1\nlemon\n(about\n4 1/2\nteaspoons\n;\n20\ng\n)\n1/4\nteaspoon\nvanilla extract\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use a pinch\n1 1/2\ncups\n(\n340\ng\n)\nheavy cream\nFor the Jello Topping:\n1 1/2\ntablespoons\n(\n0.5\nounce\n;\n15\ng\n) unflavored\npowdered gelatin\n2 1/3\ncups\n(\n550\nml\n)\nwater\n, divided\n1\ntablespoon\n(\n15\nml\n)\nlemon juice\n3/4\ncup\n(\n5.5\nounces\n;\n150\ng\n)\ngranulated sugar\n3\ncups\nstrawberries\n(about\n1\npound\n;\n454\ng\n), halved and divided\nDirections\nAdjust oven rack to center and preheat oven to 325ºF (163ºC).\nFor the Crust:\nIn the bowl of a food processor, pulse together pretzels and granulated sugar until sandy; there may be some small pretzel chunks, that’s okay. Using a silicone spatula, transfer pretzel mixture to a 9- by 13-inch baking dish. Pour the melted butter over the pretzel mixture, tossing to evenly coat the crumbs in butter, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup. Keep pressing until the crumbs form a compact, even layer across the bottom of the baking dish. Bake for 15 minutes, until it smells sweet, buttery, and slightly toasted. Set aside to cool for 20 minutes.\nSerious Eats / Amanda Suarez\nFor the Filling:\nIn the bowl of a stand mixer fitted with a paddle attachment, combine cream cheese, sugar, lemon juice, vanilla, and salt. Mix at low speed to form a thick paste, then increase to medium speed until soft and smooth.\nSerious Eats / Amanda Suarez\nScrape bowl and beater with a flexible spatula, then switch to whisk attachment and pour in cream. Mix at low speed to combine, then increase to high and whip until the mixture can hold stiff peaks, 3 to 5 minutes.\nSerious Eats / Amanda Suarez\nScrape filling into prepared crust and, using an offset spatula, spread into an even layer. Press plastic wrap against the surface to prevent a skin from forming and refrigerate while you prepare the jello topping.\nSerious Eats / Amanda Suarez\nFor the Jello Topping:\nIn a small bowl, bloom the gelatin by whisking it together with 1/3 cup cool water. Set aside. (It will solidify into a gelled disc, that’s okay.)\nSerious Eats / Amanda Suarez\nIn a small saucepan set over medium-low heat, whisk together 2 cups water with the lemon juice and sugar and simmer until dissolved. Reduce heat to low, add 2 cups strawberries to the saucepan, and simmer until the berries soften and the syrup turns red, about 15 minutes. Strain the liquid through a fine-mesh sieve into a medium bowl, discarding or reserving the cooked strawberries for another use, and stir in the gelatin until dissolved. Set aside to cool to room temperature, about 30 minutes.\nSerious Eats / Amanda Suarez\nWhen the syrup has cooled, remove the plastic wrap from the cream cheese layer. Preferably with the baking dish still in the fridge, pour the syrup over the cream cheese mixture and arrange the remaining halved strawberries, cut side down, so that they are submerged in the jello mixture (adding the liquid strawberry mixture and sliced strawberries with the baking dish in the fridge avoids having to transport it while still liquid, which can cause sloshing and cloud the jello; if that's not possible, you can add the top layer and strawberries out of the fridge, but carry it very carefully to reduce movement). Refrigerate until fully set, about 4 hours.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nFood processor, 9- by 13-inch baking dish, stand mixer, whisk, small saucepan, fine-mesh sieve\nNotes\nThe syrup is a bright shade of red, but if you’d like a more vivid color, feel free to add in a drop or two of red food coloring.\nMake-Ahead and Storage\nThe strawberry pretzel salad can be made in advance and refrigerated for up to 3 days in a sealed container or loosely covered with plastic wrap.\nSerious Eats / Amanda Suarez\nRecipes\nSummer Desserts\nDesserts\nDessert Bars\nSummer"
}