{
  "url": "https://www.seriouseats.com/strawberry-pavlova-recipe-11742464",
  "image_url": "https://www.seriouseats.com/thmb/RTYi5-YWPL53AQ-o9ayfoWdFNtQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250529-SEA-StrawberryPavlova-QiAi-Beauty1-29-3cfb1e98360548a98f717fb59f05a264.jpg",
  "tags": [
    "Recipes",
    "Fruit",
    "Gluten-free Desserts",
    "Summer Desserts",
    "Gluten-free"
  ],
  "title": "This Dreamy Summer Dessert Is Perfect for Strawberry Lovers",
  "full_text": "This Dreamy Summer Dessert Is Perfect for Strawberry Lovers\nClose\nJump to recipe\nPrep\n50 mins\nCook\n59 mins\nCooling Time:\n2 hrs\nTotal\n3 hrs 49 mins\nServes\n8\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n300\ng\ngranulated sugar\n(\n10 1/2\nounces\n;\n1 1/2\ncups\n)\n2\ntablespoons\ncornstarch\n(about\n1/2\nounces\n;\n16\ng\n)\n6\nlarge\negg whites\n2\nteaspoons\ncream of tartar\nPinch\nsalt\n4\nteaspoons\nvanilla extract\n57\ng\nalmond flour\n(\n2\nounces\n;\n1/2\ncup\n)\n43\ng\nsliced almonds\n(\n1 1/2\nounces\n;\n1/2\ncup\n)\n1 1/2\npounds\n(\n680\ng\n)\nstrawberries\n, hulled and sliced (\n4\ncups\nsliced)\n2\ncups\n(\n480\nml\n)\nheavy cream\n3\ntablespoons\nconfectioners’ sugar\n(about\n1\nounce\n;\n28\ng\n), plus for dusting\n1/8\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nDirections\nAdjust oven rack to middle position and preheat to 275°F (135°C). Line a rimmed 13- by 18-inch baking sheet with parchment paper; set aside. In a medium bowl, whisk cornstarch and sugar; set aside.\nSerious Eats / Qi Ai\nIn the bowl of a stand mixer fitted with the whisk attachment or using a hand mixer and a large bowl, beat egg whites with cream of tartar and salt on medium speed until light, fluffy, and soft peaks form, about 5 minutes. With the mixer still running on medium, gradually add sugar and cornstarch mixture, 1/4 cup at a time, beating for 30 seconds after each addition. Continue beating until meringue is thick, glossy, and holds firm peaks when you lift the whisk, 8 to 12 minutes longer. Using a flexible spatula, scrape bottom and sides of the bowl. With the mixer running on medium speed, drizzle in vanilla extract, and continue beating on medium until fully incorporated. Gently fold almond flour into meringue until incorporated.\nSerious Eats / Qi Ai\nScrape meringue onto center of prepared baking sheet. Using a flexible spatula or the back of a spoon, spread and smooth meringue from center outward into a 9-inch disc, creating a rim that is about 1/4-inch higher around the edges.\nSerious Eats / Qi Ai\nPlace in oven and immediately reduce temperature to 225°F (110°C). Bake until meringue is dry and pale beige, about 1 1/2 hours. Turn oven off and allow meringue to cool in the oven with the door closed, at least 2 hours and up to 16.\nSerious Eats / Qi Ai\nTo Assemble:\nIn the clean bowl of a stand mixer fitted with the whisk attachment or using a hand mixer and a large bowl, beat heavy cream, confectioners’ sugar, and salt on medium speed until soft peaks form, 2 to 3 minutes.\nSerious Eats / Qi Ai\nCarefully peel parchment away from bottom of meringue, and transfer meringue to a cake stand or large platter. Spoon whipped cream into depression of the meringue, followed by the sliced strawberries. Top with sliced almonds and dust with confectioners’ sugar. Serve immediately.\nSerious Eats / Qi Ai\nSpecial Equipment\n13- by 18-inch rimmed\nbaking sheet\n, parchment paper,\nstand mixer\nor\nhand mixer\n,\ncake stand\nor large platter\nMake-Ahead and Storage\nOnce cooled, the meringue can be made and stored in an airtight container, ideally with a silica packet, for up to 5 days at room temperature but may soften as it sits. The pavlova should be eaten immediately.\nRecipes\nFruit\nGluten-free Desserts\nSummer Desserts\nGluten-free"
}