{
  "url": "https://www.seriouseats.com/strawberry-cheesecake-bars-recipe-11719300",
  "image_url": "https://www.seriouseats.com/thmb/ir6n0v4H3-Fuv18glWIcW8B8fWc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250212-SEA-StrawberryCheesecakeBars-JenCausey-Beauty1-64-4f0a284237bc47578c6edd263a701999.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Baking",
    "Strawberry",
    "Desserts"
  ],
  "title": "The Strawberry Cheesecake Bars I’m Bringing to All My Potlucks This Year",
  "full_text": "The Strawberry Cheesecake Bars I’m Bringing to All My Potlucks This Year\nClose\nJump to recipe\nPrep\n20 mins\nCook\n55 mins\nCooling Time:\n6 hrs 5 mins\nTotal\n7 hrs 20 mins\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\nCooking spray\n, see notes\n8 1/2\nounces\ngraham cracker crumbs\n(\n240\ng\n;\n2\ncups\n), see notes\n1 3/4\nounces\ngranulated sugar\n(\n50\ng;\n1/2\ncup\n)\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n4\nounces\nunsalted butter\n(\n113\ng\n;\n8\ntablespoons\n), melted\nFor the Filling:\n12\nounces\nchopped fresh\nstrawberries\n(\n340\ng\n;\n2\ncups\n)\n4\nteaspoons\n(\n12\ng\n)\ncornstarch\n9 1/2\nounces\ngranulated sugar\n(\n267\ng\n;\n1 1/3\ncups\n), divided\nThree\n8-ounce\npackages\ncream cheese\n(\n24\nounces\n;\n680\ng\n), at room temperature\n8\nounces\ngoat cheese\n(\n226\ng\n; about\n1\ncup\n), at room temperature\n3/4\nounces\nall-purpose flour\n(\n24\ng;\n3\ntablespoons\n)\n1\nteaspoon\nlemon zest\nplus\n1/2\ntablespoon\nfresh\njuice\nfrom\n1\nmedium\nlemon\n2\nteaspoons\nvanilla extract\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n4\nlarge\neggs\n(\n7\nounces\n;\n200\ng), at room temperature\nHot\nwater\nDirections\nAdjust oven rack to middle position, and preheat oven to 375°F (190ºC). Using baking spray with flour, evenly coat a 9- by 13-inch baking pan. Line bottom and sides with parchment paper, leaving a 2-inch overhang on 2 sides; set aside.\nSerious Eats / Jen Causey\nPrepare the Crust:\nIn a medium bowl, stir cracker crumbs, sugar, and salt to combine. Stir in melted butter until moistened; scrape into prepared baking pan. Spread into an even layer; using a flat-bottomed drinking glass or measuring cup, firmly press until crumbs form a compact, even layer across the bottom of the pan. Bake until fragrant and lightly golden brown, about 10 minutes. Let cool on a wire rack while preparing filling, about 30 minutes. Reduce oven temperature to 325°F (160ºC).\nSerious Eats / Jen Causey\nFor the Filling\n: In a small saucepan, combine strawberries, cornstarch, and 1/3 cup (67g) of the sugar. Cook over medium heat, stirring often, until strawberries begin to break down and mixture is thickened, about 5 minutes. Remove from heat; let cool for 30 minutes, stirring occasionally.\nSerious Eats / Jen Causey\nMeanwhile, in the bowl of a stand mixer fitted with a paddle attachment, beat cream cheese and goat cheese on medium speed until smooth and creamy, 1 to 2 minutes, scraping down sides of bowl as needed. Add flour, lemon zest and juice, vanilla, salt, and remaining 1 cup (200 g) sugar; beat on low speed until just combined, about 15 seconds. Increase mixer speed to medium, and beat until well combined, 1 to 2 minutes, scraping down sides of bowl as needed. With mixer on low speed, add eggs, one at a time, mixing until just combined after each addition; mixture should be slightly thickened and smooth. Set aside until ready to use. (Alternatively, an electric hand mixer can be used to prepare filling.)\nSerious Eats / Jen Causey\nPour filling into cooled crust, and place baking pan in a large roasting pan. Using a tablespoon, drop small dollops of cooled strawberry mixture on top of cream cheese mixture. Using a butter knife, offset spatula, or skewer, gently swirl into filling, taking care to avoid cutting into the crust.\nSerious Eats / Jen Causey\nPlace roasting pan in oven, and, using a large spouted measuring cup or kettle, carefully add hot water until it reaches 1 inch up sides of baking pan. Bake until edges are set, top looks dry, and center is almost fully set, 40 to 50 minutes. Using oven mitts or kitchen towels, carefully remove baking pan from roasting pan, and let cool on wire rack until room temperature, about 1 hour, 30 minutes. Cover and refrigerate until chilled, at least 4 hours or up to 12 hours. Run an offset spatula around the sides to separate from edges, and using parchment overhang as handles, carefully remove cheesecake from pan. Using a sharp knife, slice bars into twelve 3-inch squares, and serve. (For cleaner cuts, run knife under warm water, and dry knife with a clean kitchen towel before portioning each slice.)\nSerious Eats / Jen Causey\nSpecial Equipment\n9- by 13-inch baking pan, flat-bottomed drinking glass or measuring cup, wire rack, stand mixer or hand mixer, large roasting pan, large spouted measuring cup or kettle, oven mitts or kitchen towels\nNotes\nIf you don’t have cooking spray, you can lightly grease the pan with unsalted butter or neutral oil, such as canola or vegetable.\nTo make your own graham crackers: In the bowl of a food processor, grind 16 whole graham crackers (240 grams) until finely ground, or place graham crackers in a gallon-size zip-top bag, seal tightly, and crush crackers with a rolling pin.\nSour cream can be substituted for goat cheese.\nFor pink cheesecake bars, fold cooled strawberry mixture into cheesecake batter until well-incorporated.\nMake-Ahead and Storage\nThe batter can be made ahead and refrigerated in an airtight container for up to 1 week. Let batter come to room temperature before baking.\nThe bars can be refrigerated in an airtight container for up to 5 days.\nThe Latest\nRecipes\nBaking\nStrawberry\nDesserts"
}