{
  "url": "https://www.seriouseats.com/strawberry-cupcakes-recipe-11683714",
  "image_url": "https://www.seriouseats.com/thmb/-DHRMpGQUXmgJgPDC2xC1YCHsos=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250213-SEA-StrawberryCupcakes-JenCausey-Beauty1-22-9d74cf3e250d4224b442c27e98466b51.jpg",
  "tags": [
    "Strawberry",
    "The Latest",
    "Cakes",
    "Desserts"
  ],
  "title": "Strawberry Cupcakes",
  "full_text": "Strawberry Cupcakes\nClose\nJump to recipe\nPrep\n40 mins\nCook\n20 mins\nCooling Time:\n40 mins\nTotal\n100 mins\nServes\n12\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cupcakes:\n6 3/4\nounces\nall-purpose flour\n(\n192\ng\n;\n1 1/2\ncups\n)\n1\nteaspoon\nbaking powder\n1/4\nteaspoon\nbaking soda\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n4\nounces\nunsalted butter\n(\n113\ng\n;\n1\nstick\n), at room temperature\n5 1/4\nounces\ngranulated sugar\n(\n150\ng\n;\n3/4\ncup\n)\n1\nlarge egg\n, at room temperature\n2\nteaspoons\nvanilla extract\n2\nounces\nsour cream\n(\n60\ng\n;\n1/4\ncup\n), at room temperature\n2\nounces\nwhole milk\n(\n60\ng\n;\n1/4\ncup\n), at room temperature\n3\nounces\nfinely chopped fresh\nstrawberries\n(\n85\ng\n;\n1/2\ncup\n)\nFor the Strawberry Frosting:\n6\nounces\nunsalted butter\n(\n170\ng\n;\n12\ntablespoons\n), at room temperature\n1/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nvanilla extract\n12\nounces\nunsifted\nconfectioners’ sugar\n(\n340\ng\n;\n3\ncups\n)\n3\ntablespoons\nheavy cream\n(\n1 1/2\nounces\n;\n45\ng\n)\n2\ntablespoons\n(\n10\ng\n)\ncrushed freeze-dried strawberries\nTo Garnish:\nHalved\nfresh strawberries\nCrushed freeze-dried\nstrawberries\nDirections\nAdjust oven rack to middle position, and preheat to 350°F (175ºC). Line a 12-cup muffin pan with paper liners; set aside.\nFit a piping bag\nwith desired piping tip for frosting; set aside.\nSerious Eats / Jen Causey\nPrepare the Cupcakes:\nIn a medium bowl, whisk flour, baking powder, baking soda, and salt together; set aside. In the bowl of a stand mixer fitted with the paddle attachment, beat butter on medium speed until creamy, stopping to scrape down sides of bowl as needed, 2 to 3 minutes. Add sugar and beat on medium speed until light and fluffy, about 3 minutes. With mixer on low speed, add egg and vanilla, and beat until just combined, about 15 seconds.\nSerious Eats / Jen Causey\nSerious Eats / Jen Causey\nIn a spouted measuring cup, stir together sour cream and whole milk. With mixer on low speed, gradually add flour mixture, alternating with sour cream mixture, and beat until just combined after each addition, about 1 minute. Using a flexible spatula, fold in strawberries until evenly combined, about 15 seconds. Evenly divide batter between prepared muffin cups, about 1/4 cup (about 2 ounces; 57g) each. Clean and dry mixer bowl. (Alternatively, batter can be prepared in a large bowl with an electric hand mixer.)\nSerious Eats / Jen Causey\nSerious Eats / Jen Causey\nBake until a cake tester or wooden pick inserted into center comes out clean, about 20 minutes. Let cupcakes cool in tray on a wire rack for 10 minutes. Remove cupcakes from tray; let cool completely on wire rack, about 30 to 45 minutes.\nSerious Eats / Jen Causey\nMeanwhile, prepare the frosting\n: In the now-clean bowl of a stand mixer fitted with the whisk attachment, beat butter and salt on medium speed until pale and creamy, about 5 minutes, stopping to scrape down sides of bowl as needed. Beat in vanilla until just combined. With mixer on low speed, gradually add confectioners' sugar, and beat until combined, about 1 to 2 minutes. Scrape down sides of bowl. Add cream and crushed freeze-dried strawberries, and beat on medium speed until fluffy and combined, about 1 to 2 minutes. Transfer frosting to prepared piping bag. Set aside at room temperature until ready to use.\nSerious Eats / Jen Causey\nPipe frosting on top of each cooled cupcake until completely covered. (Alternatively, use an offset spatula to spread frosting on top of each cupcake until completely covered.) Garnish with strawberry halves and crushed freeze-dried strawberries.\nSerious Eats / Jen Causey\nSpecial Equipment\n12-cup\nmuffin tray\n, paper liners, piping bag and piping tip or offset spatula,\nstand mixer\n,\nwire rack\nMake-Ahead and Storage\nFrosted cupcakes without the fresh and dried strawberry garnish can be stored in an airtight container at room temperature for up to 3 days or refrigerated for up to 1 week. If refrigerating, let cupcakes come to room temperature before serving.\nUnfrosted cupcakes can be tightly wrapped in plastic and frozen for up to 3 months. Thaw for 4 to 8 hours overnight at room temperature.\nStrawberry\nThe Latest\nCakes\nDesserts"
}