{
  "url": "https://www.seriouseats.com/strawberry-frosting-recipe",
  "image_url": "https://www.seriouseats.com/thmb/fSVjEzIlK7EO39x6fhkX2wePng4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__03__20190226-freeze-dried-fruit-buttercream-strawberry-vicky-wasik-10-1b9fbc56b58b4e5bbc2ed4a1de251a5a.jpg",
  "tags": [
    "Desserts",
    "Gluten-free Desserts",
    "Stovetop",
    "Strawberry"
  ],
  "title": "Strawberry Frosting (Swiss Buttercream) Recipe",
  "full_text": "Strawberry Frosting (Swiss Buttercream) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\n35 mins\nTotal\n35 mins\nServes\n48 servings\nMakes\n6 heaping cups\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\negg whites\n(\n2/3\ncup\n;\n170\ng\n), from\n5 to 6\nlarge\neggs\n11\nounces\nsugar\n(about\n1 2/3\ncups\n;\n310\ng\n) (see notes)\n3/4\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; use half as much if iodized\n1/4\nteaspoon\ncream of tartar\n20\nounces\nunsalted butter\n(\n5\nsticks\n;\n565\ng\n), softened to about 65°F (18°C)\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\n1\nteaspoon\nrose water\n(optional)\n1/8\nteaspoon\nChinese five-spice powder\nUp to\n2 1/2\nounces\nfreeze-dried strawberries\n(volume will vary;\n70\ng\n)\nUp to\n1\nounce\nelderflower liqueur\n, or other flavorful liquids (about\n2\ntablespoons\n;\n30\ng\n), optional\nDirections\nFill a wide pot with at least 1 1/2 inches of water, with a thick ring of crumpled tinfoil placed on the bottom to act as a \"booster seat\" that will prevent the bowl from touching the bottom of the pot. Place over high heat until steaming-hot and adjust temperature to maintain a gentle simmer. Combine egg whites, sugar, salt, and cream of tartar in the bowl of a stand mixer.\nSet over steaming water, stirring and scraping constantly with a flexible spatula, until egg whites hold steady at 185°F (85°C). This should take only 10 to 12 minutes, so if mixture seems to be moving slowly, simply turn up the heat. Once ready, transfer to a stand mixer fitted with a whisk attachment and whip at high speed about 10 minutes, until meringue is glossy, stiff, and cool to the touch, around 90°F (32°C).\nWith mixer still running, add butter, 1 or 2 tablespoons at a time. Initially, the volume of the meringue may decrease; it may even seem soupy along the way, but as the cool butter is added, the mixture will begin to thicken and cool. In the end, buttercream should be thick, creamy, and soft, but not runny, around 72°F (22°C). Mix in vanilla extract, rose water (if using), and five-spice powder on low speed until well-combined. Re-whip a few seconds more; if problems arise, consult the troubleshooting guide below.\nTroubleshooting:\nIf warmer than 74°F (23°C), the buttercream will be soft and loose; pop it in the fridge for 15 minutes and re-whip to help it thicken and cool. If colder than 68°F (20°C), the buttercream will be firm and dense, making it difficult to spread over cakes and slow to melt on the tongue, creating a greasy mouthfeel; to warm, briefly set over a pan of steaming water, just until you see the edges melting slightly. Re-whip to help it soften and warm. Full troubleshooting guide and video\nhere\n.\nOnce the buttercream's texture has been properly adjusted, grind the freeze-dried strawberries in a food processor until powdery and fine, with no visible chunks of fruit. Add this powder to the frosting, and re-whip until well-combined; reduce speed to low and drizzle in the liqueur or other liquids. Scrape the bowl and whisk attachment and whip 1 minute more, to ensure no unmixed trace of strawberry powder remains. Use immediately or transfer to an airtight container and refrigerate until needed, up to 1 week. The flavor will intensify slightly over the course of 24 hours. Thaw chilled buttercream to about 72°F (22°C) and re-whip before use. This recipe works well with any cake, especially a\nstrawberry layer cake\n.\nSpecial Equipment\n3-quart stainless steel saucier\n,\nDigital thermometer\n,\nStand mixer\n,\nFood processor\nNotes\nThis recipe will work equally well with other types of freeze-dried fruit, although some may require sifting to remove pesky seeds. With other fruits, the type of spice and liqueur may need to be adjusted. For example, blueberry pairs well with coriander and limoncello; cherry can be highlighted by amaretto; mango works well with cardamom and tequila; banana is intensified by ground cloves and rum. Let your own intuition and cravings be your guide, or consult a book like the\nThe Flavor Thesaurus\nfor more ideas on flavor pairings.\nMake-Ahead and Storage\nIn an airtight container, the buttercream can be refrigerated up to 1 week or frozen for a month. Thaw chilled buttercream to about 72°F (22°C), and re-whip before use.\nThis Recipe Appears In\nHow to Make Swiss Meringue Buttercream Frosting\nHow to Rescue Swiss Buttercream, No Matter the Problem\nHow to Crumb-Coat a Layer Cake\nHow to Make a Cake Like BraveTart: The Complete Guide\nHow to Make Vibrant, Flavorful Fruit Frostings\nDesserts\nGluten-free Desserts\nStovetop\nStrawberry"
}