{
  "url": "https://www.seriouseats.com/strawberry-fruit-roll-up-recipe",
  "image_url": "https://www.seriouseats.com/thmb/aNpFLdEVpMAHokLas17SF5RCb2w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__02__20120221star610-2ea8b78fcd7145f4a2888ff59376ac01.jpg",
  "tags": [
    "Candy",
    "American",
    "Strawberry"
  ],
  "title": "Strawberry Fruit Roll-Ups Recipe",
  "full_text": "Strawberry Fruit Roll-Ups Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n6 hrs 10 mins\nActive\n30 mins\nCooling Time\n60 mins\nTotal\n7 hrs 25 mins\nMakes\n16 roll-ups\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\ndried pears\nor apple, roughly chopped\n24\nounces\napple juice\n, divided\n12\nounces\nsugar\n6\nounces\ncorn syrup\n1.2\nounces\n(\n1\nbag\n)\nfreeze dried strawberries\nor other fruit\n1\nounce\nlemon juice\n3/4\nounce\ncoconut oil\n, or other neutral flavored oil\n1/2\nteaspoon\nrose flower\nwater\nA few drops of\nfood coloring\n(optional)\nDirections\nFor the Fruit Purée:\nCombine chopped dried fruit with 12 ounces of apple juice, sugar and corn syrup in a medium pot. Bring to a simmer and cook until fruit has become tender and the mixture has become extremely dry and thick.\nMeanwhile, in the bowl of a food processor, pulse freeze-dried strawberries until reduced to a powder.\nWhen fruit has finished cooking, add the mixture to the strawberry powder in food processor bowl. Pulse until chunky. Add remaining apple juice, lemon juice, coconut oil, rose flower water, and food coloring, if using. Processes continuously until mixture has become quite smooth and no large chunks remain.\nFor the most authentic Fruit Roll-Ups, pass this fruit mixture through a food mill or a sieve and discard any solids that won't pass through (about 3 ounces). It'll take some elbow grease, but you'll be rewarded with some freakishly smooth roll-ups.\nTo Dry the Roll-Ups:\nPreheat oven to 150°F (65°C), or as low as your oven will go. Line two sheet pans with silicon mats (I've read microwave-safe plastic wrap works too, but I haven't tested that myself). Pour half the mixture into each and spread into an even, thin layer with an offset spatula.\nDry roll-ups in the oven for 6 to 10 hours. I know that's a big window, but all ovens differ wildly in how low of a temperature they can achieve. The time it takes will depend on your lowest oven temperature and roll-up preferences. In any event, you want to dry the fruit purée until it is perfectly dry to the touch and not at all squishy when pressed firmly. You should be able to peel up a corner and tug gently without the roll-up tearing.\nCut and Store the Roll-Ups:\nWhen the fruit purée has dried adequately, remove from oven and cool to room temperature. Use a knife to loosen fruit sheets from the edges of the pan. Press a sheet of parchment or wax paper against the surface of fruit and invert onto a cutting board. Peel off plastic wrap or silicon from the bottom.\nIf you want to make shapes for \"pull outs,\" use the tip of a knife to gently score each sheet into 8 square portions (this will prevent you from stamping shapes that will accidentally get cut in half when you portion out the roll-ups). Next, use a cookie cutter to stamp various shapes, but do not remove them.\nNext, whether you're making pull outs or not, place a fresh sheet of plastic wrap over the exposed fruit. Use the tip of a chef's knife to cut through plastic wrap, fruit and parchment, dividing each fruit sheet into 8 squares. For Fruit by the Foot, just cut each large sheet into 8 long strips instead. Either way, roll them up and store in an airtight container for about one week at room temperature.\nSpecial Equipment\nFood processor\n, sieve, silicon mat\nRead More\nHow to Make Vibrant, Flavorful Fruit Frostings\nUse Freeze-Dried Fruit for the Most Vibrant, Flavorful No-Churn Ice Cream\nCandy\nAmerican\nStrawberry"
}