{
  "url": "https://www.seriouseats.com/stuffing-flavored-potato-chip-food-lab",
  "image_url": "https://www.seriouseats.com/thmb/lvtKJRTps2X1pYo066rNJHRLxXU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__11__20131112-stuffing-chips-10-7f45ec2ff2094a18b88aa4e602dde14a.jpg",
  "tags": [
    "Snacks & Appetizers",
    "American",
    "Frying",
    "Russet Potatoes",
    "Quick Snacks"
  ],
  "title": "Stuffing-Flavored Potato Chips Recipe",
  "full_text": "Stuffing-Flavored Potato Chips Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n45 mins\nTotal\n35 mins\nMakes\n4 quarts of potato chips\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\nrusset potatoes\n(about\n3\nlarge\n), scrubbed clean\n1/2\ncup\nloosely packed pale yellow celery leaves taken from the inside of\n1 to 2\nheads\ncelery\n1/2\ncup\nloosely packed fresh\nsage leaves\n2\ntablespoons\nfresh rosemary\nleaves\n1\ntablespoon\npowdered instant\nchicken bouillon\n1\ntablespoons\nground\nsage\n1\ntablespoon\ncelery seed\n1\nteaspoons\nfreshly\nground black pepper\n2\nteaspoons\nground\nmarjoram\n2\nteaspoons\nonion powder\n1\nquart\npeanut oil\nDirections\nSlice potatoes into 1/16th- to 1/8th-inch slices on a mandoline slicer into a large bowl. Cover with cold water, drain, and repeat until water is clear (about 4 changes). Keep potatoes submerged in cold water and set aside.\nFinely mince celery leaves, sage leaves, and rosemary leaves and transfer to a small bowl. Add chicken bouillon, celery seed, black pepper, marjoram, and onion powder and whisk to combine. Set aside.\nHeat peanut oil in a large wok, deep fryer, or Dutch oven to 350°F. Line a large bowl with paper towels and have ready. Working in four batches, remove potato chips from water and spin dry in a salad spinner. Add to oil one chip at a time, working quickly, until all chips are in the oil. Temperature will drop. Adjust heat to maintain temperature between 275 and 300°F (chips should bubble vigorously). Cook, agitating and flipping chips occasionally with a large metal spider until bubbles reduce to a faint trickle, removing chips as they finish cooking and transferring to the paper towel-lined bowl. Sprinkle each batch with 1/4 of seasoning mixture while still hot, tossing to coat, and transfer to a large bowl to cool. Repeat until all chips are cooked and coated.\nChips can be served immediately or allowed to cool and stored in sealed zipper-lock bags or containers at room temperature for up to 1 week.\nSpecial equipment\nMandoline-style slicer and a deep fryer, wok, or a Dutch oven\nThis Recipe Appears In\nThe Food Lab: How to Make Stuffing-Flavored Potato Chips\nSnacks & Appetizers\nAmerican\nFrying\nRusset Potatoes\nQuick Snacks"
}