{
  "url": "https://www.seriouseats.com/stuffed-roasted-pork-loin-recipe-8763065",
  "image_url": "https://www.seriouseats.com/thmb/dJNCyk_-RflUlK1FULYmebCBVxs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241205-SEA-StuffedPorkLoin-AmandaSuarez-Hero1-59-09eeea29526e488ca9562a045d7c47ae.jpg",
  "tags": [
    "Pork Mains",
    "The Latest",
    "Roasted Pork",
    "Roasts"
  ],
  "title": "This Easy (Reverse-Seared!) Stuffed Pork Loin Is an Instant Holiday Classic",
  "full_text": "This Easy (Reverse-Seared!) Stuffed Pork Loin Is an Instant Holiday Classic\nClose\nJump to recipe\nPrep\n25 mins\nCook\n105 mins\nRefrigeration and Resting Time\n80 mins\nTotal\n3 hrs 30 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1/3 cup (\n80\nml)\nextra-virgin olive oil\n1\nteaspoon\nlemon zest plus 3 tablespoons (45ml)\nlemon juice\nfrom 1 lemon\n6\nmedium\ngarlic\ncloves\n, minced\n2 teaspoons (\n8\ng)\ncaraway seeds\n1/4\nteaspoon\nred pepper flakes\n4\nteaspoons chopped\nfresh rosemary\n3 ounces\n(85\ng)\npancetta,\nroughly chopped\n1/3\ncup\ndried cherries\n, roughly chopped\nOne\n3-\npound (\n1.7kg) boneless center-cut\npork loin roast,\nfat cap trimmed to about 1/4-inch thickness\n2\ntablespoons\nchopped flat-leaf\nparsley leaves\nand tender stems\n2teaspoons\n(10\nml)\nDijon mustard\nDirections\nPosition roast fat side up. Using a sharp boning or slicing knife and making long, steady strokes, slice pork loin along its full length parallel to and 1/3 of its height from the work surface, stopping 1/2 inch before edge. Open up flap; you should now have a thin rectangle of pork that is thicker on one side than the other. Keeping knife parallel to work surface and starting from the inside edge, cut through thicker portion of pork along its full length and halfway up its height from the work surface try to keep the knife level with the first cut and make sure to stop once more about 1/2 inch from the edge of pork. Open up this flap; you should now have a larger rectangle of pork that is roughly evenly thick. If uneven, use meat pounder to even out (covering with plastic wrap can help prevent the meat from tearing during pounding). Sprinkle 1 tablespoon kosher salt over both sides of roast (1/2 tablespoon per side) and rub into meat to adhere. Set roast fat cap side down on cutting board.\nSerious Eats / Amanda Suarez\nIn a 10-inch skillet, combine oil, lemon zest, garlic, caraway seeds, and pepper flakes. Cook over medium-low heat, stirring frequently, until garlic is sizzling, about 3 minutes. Add rosemary and cook for 30 seconds. Strain mixture through fine-mesh strainer set over bowl, pushing on garlic-rosemary mixture to extract oil. Set oil aside and let garlic-rosemary mixture cool. Wipe skillet clean and set aside for later use.\nSerious Eats / Amanda Suarez\nIn a food processor, process pancetta until a smooth paste forms, 20 to 30 seconds, scraping down sides of bowl as needed. Add garlic-rosemary mixture and cherries and continue to process until mixture is combined but still chunky with pieces of cherries and rosemary still visible, 10 to 20 seconds longer; scrape down sides of bowl as needed.\nSerious Eats / Amanda Suarez\nSpread pancetta mixture evenly all over inside of roast, leaving a 1/4-inch border on all sides. Roll roast (keeping fat on outside) back into its original shape and tie with twine at 1-inch intervals. Set wire rack in rimmed baking sheet and spray with nonstick cooking spray. Set roast fat side up on prepared rack and refrigerate uncovered for at least 1 hour or up to 2 days.\nSerious Eats / Amanda Suarez\nAdjust oven rack to middle position and heat oven to 275℉ (135℃). Transfer roast to oven and cook until meat registers 135℉ (60℃), 1 1/2 to 2 hours. Remove roast from oven and let rest for 20 minutes.\nSerious Eats / Amanda Suarez\nPat roast dry with paper towels. In the now-cleaned 10-inch skillet, heat 2 tablespoons reserved infused oil over high heat until just smoking. Brown roast well on all sides, 4 to 6 minutes. Transfer roast to carving board and remove twine.\nSerious Eats / Amanda Suarez\nWhisk lemon juice, parsley, and mustard into bowl with the remaining reserved infused oil. Slice roast into thin slices and serve, passing sauce separately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n10-inch skillet, fine-mesh strainer, food processor, sharp boning knife, butcher’s twine, wire rack, rimmed baking sheet, nonstick cooking spray\nMake-Ahead and Storage\nThe assembled and tied raw loin can be refrigerated for up to 2 days before roasting.\nPork Mains\nThe Latest\nRoasted Pork\nRoasts"
}