{
  "url": "https://www.seriouseats.com/sturdy-royal-icing-gingerbread-house-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rnWvyL_muUuE1cJ0QMmjMAXFdLA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__10__20161017-royal-icing-vicky-wasik2-8b4a0faa2864405ab042c36c8245c899.jpg",
  "tags": [
    "Christmas Cookies",
    "Christmas Desserts"
  ],
  "title": "Gingerbread House Icing",
  "full_text": "Gingerbread House Icing\nClose\nJump to recipe\nPrep\n5 mins\nActive\n5 mins\nTotal\n5 mins\nServes\n6 servings\nMakes\n2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\nounce\negg white\n(\n2\ntablespoons\n;\n28\ng\n) from\n1\nlarge\negg\n12\nounces\npowdered sugar\n(\n3\ncups\n;\n340\ng\n), divided\nDirections\nIn the bowl of a stand mixer fitted with a paddle attachment, combine egg white with\nhalf\nthe powdered sugar. Mix at low speed until sugar disappears into a paste, then gradually sprinkle in the rest. Increase speed to medium and beat until smooth and light, about 2 minutes. If too stiff, thin icing with a few drops of water. Use immediately; keep covered tightly in plastic to prevent icing from drying in bowl. Royal icing can be kept in an airtight container at room temperature up to 12 hours.\nFor Coloring:\nTo dye royal icing with gel paste (see note), divide into as many bowls as you wish to have colors. Cover each tightly with plastic. Working with 1 bowl at a time, add 1 drop gel paste to a batch of icing, then stir until fully incorporated before adjusting color with more gel. Cover bowls tightly when not in use.\nSpecial Equipment\nYou'll need\nspecial equipment\nto complete this project, including a\nstand mixer\nand a\ndisposable pastry bag\n.\nNotes\nTo dye royal icing, concentrated gel paste works better than liquid food coloring because it's more vibrant and won't alter the consistency of the icing. I love Americolor's 12-piece coloring kit, packaged in squeeze bottles so you never have to worry about making a mess.\nRead More\nConstruction Gingerbread Recipe\nBraveTart's House of Horror: How to Make a Super-Spooky Halloween Gingerbread House\nAll of the Gear You Need to Make Your Own Gingerbread House\nA Royal-Icing Tutorial: Decorate Christmas Cookies Like a Boss\nChristmas Cookies\nChristmas Desserts"
}