{
  "url": "https://www.seriouseats.com/succotash-corn-bean-and-vegetable-stew",
  "image_url": "https://www.seriouseats.com/thmb/_Nbd67XrWXdaIIce8i4C-x8NjQo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__07__20180706-succotash-vicky-wasik-20-6c553736289d4312938efd57bdb1af99.jpg",
  "tags": [
    "North American",
    "American",
    "Gluten-free Sides",
    "Roasted Vegetables",
    "Beans"
  ],
  "title": "Succotash (Corn, Bean, and Vegetable Stew) Recipe",
  "full_text": "Succotash (Corn, Bean, and Vegetable Stew) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n60 mins\nResting Time\n5 mins\nTotal\n40 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\n(\n170\ng\n)\nPoblano peppers\n(about\n3\nsmall\nor\n2\nmedium\n)\n1\nounce\n(\n30\ng\n) thinly sliced\nbacon\n6\ntablespoons\n(\n90\ng\n)\nunsalted butter\n1\nmedium\nonion\n(about\n6 ounces\n;\n170 g\n), finely diced\n2\nmedium\ncloves garlic\n, minced\n5\npounds\nfresh corn in the husk\n(about\n6 to 7\nears\n), shucked,\nkernels cut and cobs scraped of any corn milk\n1 (\n6-ounce\n;\n170 g\n) medium\nred\n(or orange or yellow)\nbell pepper\n, stemmed, seeded, and finely diced\n12\nounces\n(\n340\ng\n)\nsummer squash\n(about\n4\nsmall\nyellow squash\nand/or zucchini), finely diced\n2\ncups\nfrozen and/or cooked fresh or dried\nbeans\n(about\n12\nounces\n;\n340\ng\n), such as red kidney, cranberry, or\nlima\n(see note)\n1/2\ncup\n(\n120\nml\n) reserved bean-cooking\nwater\n(if using canned beans, substitute plain water)\nKosher salt\nand freshly ground black pepper\nSmall handful\nfresh basil leaves\n, torn\nDirections\nUsing a broiler with the rack set in the highest position, or working directly over a gas flame, char Poblano peppers, rotating them frequently, until skin is blistered and black all over. Transfer to a heatproof bowl, cover with plastic, and let stand for 5 minutes. Using paper towels, rub charred skin off peppers. Stem and seed peppers, finely dice the flesh, and reserve.\nIn a large Dutch oven, heat bacon over medium heat, stirring, until fat has rendered and bacon is beginning to brown, about 5 minutes. Add butter and stir until melted. Add onion and garlic and cook, stirring, until starting to soften, about 3 minutes.\nSerious Eats / Vicky Wasik\nAdd corn kernels and any corn milk you were able to express, along with bell pepper and summer squash. Cook, stirring, until vegetables have become tender, about 10 minutes.\nSerious Eats / Vicky Wasik\nStir in beans and reserved bean liquid (or water), as well as the reserved Poblano pepper. Season with salt and pepper. Continue cooking, stirring, until succotash is heated through and a buttery glaze coats the vegetables, about 5 minutes.\nSerious Eats / Vicky Wasik\nAdd basil leaves, remove from heat, and serve. Succotash can be refrigerated for up to 5 days. When ready to serve, you can rewarm it if desired, or serve it at room temperature.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nDutch oven\nNotes\nA mixture of at least two different types of beans produces succotash with a more interesting combination of textures, colors, and flavors. The easiest approach is to use frozen beans, such as limas, or drained canned beans, adding them to the pot as they are. For the very best results, cooking beans from scratch is the way to go. For dried beans, follow\nour instructions here\n, then drain and add to the pot; reserve some of the cooking liquid for the recipe. For fresh shelling beans (available at farmers markets in the summer), follow the same instructions as for dried beans, but skip the presoaking step. You will need about 1 1/2 pounds (680g) fresh shelling beans in the pod to yield 12 ounces (340g) once shelled and cooked. (To be safe, grab 2 pounds of shelling beans.) For dried beans, about 1/2 pound (225g) dried should yield more than enough cooked beans.\nRead More\nThe Serious Eats Guide to Corn\nThe Serious Eats Guide to Beans\nBroad Beans with Dill Butter\nSautéed Corn With Chorizo, Cilantro, and Lime Juice\nCharred Corn and Zucchini Tacos\nNorth American\nAmerican\nGluten-free Sides\nRoasted Vegetables\nBeans"
}