{
  "url": "https://www.seriouseats.com/sugo-finto-tuscan-vegetable-ragu",
  "image_url": "https://www.seriouseats.com/thmb/eETLY-GG8vWxauDymXQ9AcR90Tg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210307-sugo-finto-tim-chin-677d8112f9354159a6531a07a74443d6.jpg",
  "tags": [
    "Italian",
    "Pastas",
    "The Latest"
  ],
  "title": "Pasta al Sugo Finto (Pasta With Tuscan Vegetable Ragù) Recipe",
  "full_text": "Pasta al Sugo Finto (Pasta With Tuscan Vegetable Ragù) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n30 mins\nTotal\n65 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nloosely packed\ncup\n(\n1/2\nounce\n;\n15\ng\n)\nfresh parsley\nleaves and tender stems\n4\nmedium\ngarlic cloves\n(\n20\ng\n)\n6\nmedium\nfresh sage leaves\n2\nsprigs\nfresh rosemary\n, leaves removed and stems discarded\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\n, divided\n1\nmedium\n(\n8-ounce\n;\n225 g\n)\nyellow onion\n, cut into small dice\nKosher salt\n8\nounces\n(\n225\ng\n)\ncarrots\n, peeled and cut into small dice (about\n4\nsmall\ncarrots\n)\n2\ncelery ribs\n(\n4\nounces\n;\n115\ng\ntotal), trimmed and cut into small dice\n1/4\nteaspoon\nred pepper flakes\n1/2\ncup\n(\n120\nml\n)\ndry red wine\n2\ncups\n(\n500\ng\n;\n475\nml\n)\ntomato passata\n(see note)\n1\npound\n(\n450\ng\n)\ndried spaghetti\nalla chitarra, bucatini, or spaghetti\nFinely grated Pecorino Romano cheese\n, for serving (optional)\nDirections\nPile parsley, garlic, sage, and rosemary on a cutting board. Using a chef’s knife, rock back and forth through the garlic and herbs to mince together into a coarse paste. Set aside.\nIn a large Dutch oven, heat 2 tablespoons (30ml) oil over medium heat until shimmering. Add onion, season lightly with salt, cover, and cook until softened and translucent but not browned, about 10 minutes, lowering heat as needed to prevent browning. Stir in carrots, celery, and red pepper flakes and cook, uncovered, stirring frequently, until vegetables begin to soften, about 5 minutes.\nAdd garlic-herb mixture to vegetables and cook, stirring frequently, until fragrant, 2 to 3 minutes.\nStir in wine, and use a wooden spoon to scrape up any brown bits from the bottom and sides of the pot. Cook until wine is reduced by half, 2 to 3 minutes. Stir in passata and 1 cup (240ml) water.\nBring sauce to a simmer, and cook, stirring occasionally and adjusting heat as needed to maintain a simmer, until thickened to a saucy consistency, just slightly thicker than the original consistency of the passata, about 30 minutes.\nMeanwhile, in a pot of salted boiling water, cook pasta until just shy of al dente (about 2 minutes less than the package directs). Using tongs, transfer pasta to sauce, along with 1/4 cup (60ml) pasta cooking water. Alternatively, drain pasta using a colander or fine-mesh strainer, making sure to reserve at least 1 cup (240ml) pasta cooking water.\nIncrease heat to high and cook, stirring and tossing rapidly, until pasta is al dente and sauce coats noodles, 1 to 2 minutes, adding more pasta cooking water in 1/4 cup (60ml) increments as needed to adjust consistency of sauce. Remove from heat and stir in remaining 2 tablespoons (30ml) oil until fully incorporated. Season with salt. Divide between individual serving bowls, sprinkle with cheese, and serve.\nSpecial Equipment\nDutch oven\nNotes\nSugo finto is traditionally eaten with fresh pici, a fresh pasta that's rolled by hand into long, thick, and chewy noodles. Dried spaghetti alla chitarra work best as a store-bought substitute.\nJarred passata (tomatoes that have been briefly simmered and passed through a food mill) can be found in the canned tomato aisle in supermarkets or Italian markets. If you can’t find passata, you can substitute with an equal amount by weight of whole peeled tomatoes that have been quickly blended with an immersion blender, passed through a food mill, or crushed by hand (hand-crushed tomatoes won't produce the same smoothness as passata).\nMake-Ahead and Storage\nThe finished sauce can be made in advance and refrigerated in an airtight container for up to 1 week, or frozen for up to 3 months. Reheat gently on the stovetop before serving.\nItalian\nPastas\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/pasta-al-sugo-finto-pasta-with-tuscan-vegetable-rag-recipe.webp?"
}