{
  "url": "https://www.seriouseats.com/sukuma-wiki-kenyan-sauteed-collard-greens-recipe-8637473",
  "image_url": "https://www.seriouseats.com/thmb/JFBeQXgJR0TBjPNgazsF6D2z0kQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240423-SEA-SukumaWiki-AmandaSuarez-13-8e0d68cde28941c88cf6cb45b95a2e80.jpg",
  "tags": [
    "Vegetable Sides",
    "The Latest",
    "Sides",
    "Stovetop Vegetables",
    "East African"
  ],
  "title": "Sukuma Wiki (Kenyan Sautéed Collard Greens With Tomatoes and Ginger)",
  "full_text": "Sukuma Wiki (Kenyan Sautéed Collard Greens With Tomatoes and Ginger)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nTotal\n30 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\ncollard greens\n(about\n2\nbunches\n), washed thoroughly, patted dry, and thick central stems removed (see notes)\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\nor\navocado oil\n1/2\nmedium\nyellow onion\n(\n4\nounces\n;\n115\ng)\n, thinly sliced\n2\nplum tomatoes\n(about\n8\nounces\n;\n225\ng\ntotal), cored and diced\n1\n(1-inch) piece\nfresh peeled\nginger\n(\n15\ng\n), finely sliced into matchsticks\nKosher Salt\nDirections\nWorking in batches stack a few stemmed collard leaves on a cutting board, placing the larger leaves at the bottom. Roll the leaves tightly and slice them into thin strips, approximately 1/8 inch wide. (Make sure they are not too thin, as they may clump together during cooking.)\nSerious Eats / Amanda Suarez\nIn a large skillet or sauté pan, heat oil over medium-high heat until shimmering. Add sliced onion and cook until softened and lightly browned, about 5 minutes.\nSerious Eats / Amanda Suarez\nAdd tomatoes and ginger and season lightly with salt. Cook, stirring often, until tomatoes have released most of their water, about 5 minutes.\nSerious Eats / Amanda Suarez\nAdd collards to the pan and season with salt. Cook, lowering the heat as needed to avoid scorching, until collards have softened but retain a vibrant green color and slightly crunchy texture, 8 to 10 minutes. Or, if desired, cook until collards are fully softened and have darkened in color, 15 to 25 minutes total. Season with salt to taste. Serve.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nLarge skillet or sauté pan\nNotes\nIf you can’t find collard greens, kale is the next best choice. I have used both curly and lacinato kale. They are a bit more finicky to chop due to the shape of their leaves, but they are closer in flavor to the original than other dark leafy greens such as Swiss chard, which is too bitter for this dish.\nVegetable Sides\nThe Latest\nSides\nStovetop Vegetables\nEast African"
}