{
  "url": "https://www.seriouseats.com/suman-filipino-steamed-sticky-rice-cakes-7152847",
  "image_url": "https://www.seriouseats.com/thmb/GVJKwMB09tQJ-Agz9GBC51uclso=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230301-Suman-VickyWasik-hero-069eb9089d2444359f435e031bff411e.jpg",
  "tags": [
    "Filipino",
    "The Latest",
    "White Rice",
    "Southeast Asian",
    "Desserts"
  ],
  "title": "Suman (Filipino Steamed Sticky Rice Cakes)",
  "full_text": "Suman (Filipino Steamed Sticky Rice Cakes)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n75 mins\nSoaking and Cooling Time\n8 hrs 35 mins\nTotal\n10 hrs 10 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n455\ng\n)\nwhite sticky rice\n, such as Filipino malagkit (see note)\n1\npacket\nfresh or frozen\nbanana leaves\n, defrosted and cut into eight 10-inch squares (see note)\n1\n(\n13.5-ounce\n;\n400 ml) can\ncoconut milk\n1/4\ncup\n(\n50\ng\n)\ngranulated sugar\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nNonstick cooking spray\n, for the baking sheet\nFor Serving (Optional):\nMuscovado sugar\nCut ripe mangos\nDirections\nIn a small bowl, combine rice and 1 quart (945ml) water. Using your hands, massage rice to make sure water gets in between each grain, then cover bowl with plastic wrap, and let soak at room temperature for 8 hours.\nSerious Eats / Vicky Wasik\nUsing a fine-mesh strainer, drain rice, discarding the soaking water. In a 4-quart pot, combine rice with coconut milk, sugar, and salt. Cook over medium heat, stirring constantly to prevent it from sticking and scorching on the bottom, until rice is al dente, about 10 minutes.\nSerious Eat / Vicky Wasik\nSpray a rimmed baking sheet with cooking spray, then transfer rice mixture to prepared baking sheet, spread it in an even layer, and let cool completely. Once cool, slice into sixteen 1- by 4-inch rectangular rice cakes. Set aside.\nSerious Eats / Vicky Wasik\nWash banana leaf squares with cold water then pat dry with paper towels. Working with one square at a time, hold banana leaf with tongs about 2 inches above the medium-high flame of a gas burner, turning every 3 to 5 seconds, until soft and pliable, about 15 seconds. Transfer to a plate and repeat with remaining banana leaves. Alternatively spread the banana leaf squares on a baking sheet and bake for 2 minutes at 500°F (260°); this stp is to help make the banana leaves more liable so they don't crack when folded.\nSerious Eats / Vicky Wasik\nOn a clean work surface, position one banana leaf square so it resembles a diamond with a point facing you. Set 2 rice cakes, one on top of another, horizontally in the center of the leaf. Starting with the point closest to you, fold the leaf up and over the rice cakes, tucking it in slightly underneath the top side of the rice cakes so that the rice cakes are tightly wrapped.\nSerious Eats / Vicky Wasik\nFold the right and left points of the leaf over the rice cakes like an envelope (they will overlap), then roll the rice cakes up towards the top point, stopping about 2 inches short of the top point. Fold the top point in towards the center, then finish rolling to form a perfectly rectangular packet. Use butcher's twine to tie suman at each end. Repeat with remaining banana leaf squares and rice cakes.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nFill a large pot with about 4 inches water and place the steamer insert inside (make sure water doesn't come above steamer floor). Cover and bring to a boil over high heat. Carefully arrange suman in steamer in a single even layer, cover, and steam for 1 hour, adjusting heat to maintain a good steam level and adding boiling water as needed to prevent steamer from going dry. Transfer suman to a wire rack and let cool slightly, 10 to 15 minutes.\nSerious Eats / Vicky Wasik\nTo serve, remove twine, transfer still-warm suman to individual plates, and serve with muscovado sugar and mango (if using).\nSerious Eats / Vicky Wasik\nSpecial Equipment\n4-quart pot, rimmed baking sheet, steamer, butcher's twine\nNotes\nIf you can’t find Filipino long-grain (malagkit) sticky rice, you can use short-grain sticky rice (a.k.a. glutinous or sweet rice). There are several varieties of sweet glutinous rice that can be used as a substitute.\nFresh or frozen banana leaves can be purchased at Asian markets and online. To store unused fresh banana leaves, wrap tightly in plastic, transfer to a zipper-lock bag, and freeze for up to 3 months. If using frozen banana leaves, defrost in the refrigerator overnight before using.\nIf your steamer is not large enough to fit all the suman, you can either steam in batches, set up two side-by-side steamers to cook the suman at once, or use a stacking bamboo steamer.\nMake-Ahead and Storage\nSteamed suman can be refrigerated in an airtight container for up to 1 week or frozen for up to 3 months. To reheat in the microwave, cover with a damp paper towel and microwave for 1 minute.\nFilipino\nThe Latest\nWhite Rice\nSoutheast Asian\nDesserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/suman-filipino-steamed-sticky-rice-cakes.webp?"
}