{
  "url": "https://www.seriouseats.com/summer-vegetable-tian-ratatouille-recipe",
  "image_url": "https://www.seriouseats.com/thmb/nIED3m7EQNRp_SNTyJ62jImeIH0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__08__20150812-tian-daniel-gritzer-11-57d6b7a66a514c0bac0d0d5761a12f98.jpg",
  "tags": [
    "Vegetables",
    "Dairy-free Sides",
    "Vegan Sides",
    "Vegetarian Sides",
    "Eggplant"
  ],
  "title": "Provençal Tian (Eggplant, Zucchini, Squash, and Tomato Casserole) Recipe",
  "full_text": "Provençal Tian (Eggplant, Zucchini, Squash, and Tomato Casserole) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nActive\n90 mins\nCooling Time\n5 mins\nTotal\n70 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nAbout\n1/2\ncup\nextra-virgin olive oil\n, divided\n3/4\npound\nzucchini\n(about\n2\nmedium\n), ends trimmed and thinly sliced crosswise between 1/8 and 1/4 inch thick\nKosher salt\n3/4\npound\nsummer squash\n(about\n2\nmedium\n), ends trimmed and thinly sliced crosswise between 1/8 and 1/4 inch thick\n3/4\npound\nJapanese eggplant\n(about\n2\n), ends trimmed and thinly sliced crosswise between 1/8 and 1/4 inch thick\n3\nmedium\ncloves garlic\n, crushed\n1/4\ncup\nchopped\nyellow onion\n(from\n1\nsmall\nonion\n)\n1\n(\n28-ounce) can\nwhole peeled tomatoes\n, crushed by hand\n1\nteaspoon\nchopped\nfresh oregano\nor marjoram leaves\nFreshly ground black pepper\nDirections\nIn a large skillet, heat 2 tablespoons olive oil over high heat until shimmering. Working in batches and being sure not to crowd the pan, add zucchini, season with salt, and cook, turning, until just tender and browned in spots, about 4 minutes per batch. Add more oil as needed to prevent pan from drying out, and adjust heat as needed throughout to maintain a very hot, but not heavily smoking, pan. Transfer each batch to a baking sheet and spread in an even layer to cool, then transfer cooled slices to a second baking sheet or plate. Repeat with remaining zucchini, squash, and eggplant until all vegetables are lightly browned.\nSerious Eats / Daniel Gritzer\nIn a medium saucepan, heat 2 tablespoons olive oil over medium heat until shimmering. Add garlic and onion and cook, stirring, until softened, about 4 minutes. Add crushed tomatoes, bring to a simmer, and cook, stirring and adjusting heat to maintain simmer, for 15 minutes. Blend to a smooth purée with a hand blender or in a countertop blender, then add marjoram or oregano. Season with salt and pepper.\nIn an earthenware, ceramic, or glass baking dish, spoon just enough sauce to cover bottom of dish in a thin, even layer. Arrange sautéed vegetable slices in an alternating layered pattern (see notes) on top of sauce until entire dish is filled. Spoon a thin layer of sauce on top of vegetables; reserve remaining sauce for another use.\nSerious Eats / Daniel Gritzer\nWhen ready to bake, preheat oven to 450°F (230°C). Bake until tian is fully heated through and lightly browned on top, about 15 minutes. Serve.\nSpecial Equipment\nEarthenware, ceramic, or glass\ncasserole or baking dish\n(about 2-quart capacity; see note);\nrimmed baking sheets\n;\nblender\nor\nimmersion blender\n;\nmandoline slicer\nNotes\nThe exact size and shape of the baking dish are flexible. The vegetables should be layered more tightly in a smaller dish and spaced more widely apart in a larger one. In round dishes, it's best to layer the vegetables in a circular pattern; in rectangular dishes, they should be layered in rows.\nRead More\nProvençal Ratatouille\nGrilled Ratatouille\nSummer Ratatouille with Pasta\nYellow Squash Casserole Recipe\nVegetables\nDairy-free Sides\nVegan Sides\nVegetarian Sides\nEggplant"
}