{
  "url": "https://www.seriouseats.com/sunday-supper-double-fried-chicken-with-lemons-jalapenos-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5mtfznMtuIOslaHNjfc1huKtmAQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__052712-208074-Sunday-Supper-Double-Fried-Chicken-35b09b33c24b4623a677d5781728bb67.jpg",
  "tags": [
    "Chicken Mains",
    "Frying"
  ],
  "title": "Double-Fried Chicken With Lemons and Jalapenos Recipe",
  "full_text": "Double-Fried Chicken With Lemons and Jalapenos Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n35 mins\nActive\n40 mins\nMarinating Time\n8 hrs\nTotal\n9 hrs\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nlarge\nchicken\ncut into\n8\npieces (about\n4 to 5 pounds\n)\n4\ncups\nbuttermilk\n3 1/2\ntablespoons\nold bay seasoning\n, divided use\n1\ntablespoon\ntabasco sauce\n2\ntablespoons\nworcestershire sauce\n1\ngallon\npeanut oil\n13.5\nounce\ncanister (about\n3\ncups\n)\nWondra\n1/2\ntablespoon\nfreshly\nground black pepper\n1\ntablespoon\npaprika\n1\nlemon\n, very thinly sliced and seeds removed\n2\njalapenos\n, sliced into 1/2” coins\nkosher salt\nDirections\nPlace chicken pieces, buttermilk, 1 1/2 tablespoons Old Bay, Tabasco and Worcestershire in a resealable bag. Seal tightly and shake to combine. Refrigerate at least eight hours and up to 12 hours.\nPreheat oil to 325°F in a wok, deep-fryer, or Dutch oven. In a large bowl, combine Wondra, remaining 2 tablespoons Old Bay seasoning, pepper and paprika.\nWhen oil comes to temperature, remove one thigh at a time, using tongs. Shake off excess liquid from marinade and dredge in flour on all sides. Shake off extra flour and dredge again, gently dropping pieces into hot oil one at a time. As the oil returns to temperature, repeat the dredging process with drumsticks. Now, add drumsticks to the fryer, too, and cook all four pieces for eight minutes, until nearly cooked through. Remove thighs and drumsticks and drain on paper towels. Repeat process with breasts, cooking for 7 minutes, and wings, cooking for 6 minutes.\nWhile the chicken rests, toss lemons and jalapenos in the remaining flour mixture. Add them to oil and quickly fry until golden and crisp (2 to 3 minutes). Remove from oil and drain on paper towels.\nWhen oil reaches 325°F again, return all chicken to fryer. Fry until it becomes a perfect, golden brown, another 2 to 4 minutes.\nRemove chicken from oil, drain on papers towels and allow to cool slightly. Serve family-style, topping with fried lemons, fried jalapenos and a sprinkle of salt.\nSpecial equipment\nDutch oven with thermometer or deep fryer\nChicken Mains\nFrying"
}