{
  "url": "https://www.seriouseats.com/super-thick-chocolate-chip-cookie-recipe",
  "image_url": null,
  "tags": [
    "Cookies",
    "Baking",
    "Chocolate"
  ],
  "title": "Levain Bakery-Style Super-Thick Chocolate Chip Cookies Recipe",
  "full_text": "Levain Bakery-Style Super-Thick Chocolate Chip Cookies Recipe\nJump to recipe\nPrep\n25 mins\nCook\n25 mins\nActive\n15 mins\nChilling Time\n12 hrs\nTotal\n12 hrs 50 mins\nServes\n8 6-ounce cookies\nCook Mode\n(Keep screen awake)\nIngredients\n4\nounces\nunsalted\nAmerican\nbutter\n(about\n1/2\ncup\n;\n113\ng\n), softened to about 65°F (18°C)\n4\nounces\nlight brown sugar\n(about\n1/2\ncup\n, firmly packed;\n113\ng\n)\n3 1/2\nounces\nwhite sugar\n, preferably well toasted (about\n1/2\ncup\n;\n100\ng\n)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight (plus more for sprinkling, if desired)\n1 3/4\nteaspoons\nbaking powder\n1\nteaspoon\nbaking soda\nPinch\nof\ngrated nutmeg\n2\nlarge\neggs\n(about\n3 1/2\nounces\n;\n100\ng\n), straight from the fridge\n10\nounces\nall-purpose flour\n(about\n2 1/4\ncups\n, spooned;\n283\ng\n), such as Gold Medal\n15\nounces\nassorted\nchocolate chips\n(about\n2 1/2\ncups\n;\n425\ng\n), not chopped chocolate; see note\n8 1/2\nounces\nraw walnut pieces or lightly toasted\npecan pieces\n(shy\n1 3/4\ncups\n;\n240\ng\n)\nDirections\nTo Prepare the Dough:\nCombine butter, light brown sugar, white sugar, vanilla extract, salt, baking powder, baking soda, and nutmeg in the bowl of a stand mixer fitted with a paddle attachment.\nMix on low to moisten, then increase speed to medium and beat until soft, fluffy, and pale, about 8 minutes; halfway through, pause to scrape bowl and beater with a flexible spatula. With mixer running, add eggs one at a time, letting each incorporate fully before adding the next. Reduce speed to low, then add the flour all at once. When flour is incorporated, add chocolate chips and nuts and keep mixing until dough is homogeneous.\nSerious Eats / Vicky Wasik\nDivide dough into 8 equal portions (about 6 ounces/170g each) and round each into a smooth ball. Wrap in plastic and refrigerate at least 12 hours before baking; if well protected from air, the dough can be kept in the fridge up to 1 week (see Make-Ahead and Storage).\nSerious Eats / Vicky Wasik\nTo Bake:\nAdjust oven rack to middle position and preheat to 350°F (180°C). Line an aluminum half-sheet pan with parchment paper. When the oven comes to temperature, arrange up to 4 portions of cold dough on prepared pan, leaving ample space between them to account for spread. If you like, sprinkle with additional salt to taste.\nBake until cookies are puffed and lightly brown, about 22 minutes, or to an internal temperature of between 175 and 185°F (79 and 85°C). The ideal temperature will vary from person to person; future rounds can be baked more or less to achieve desired consistency.\nSerious Eats / Vicky Wasik\nCool cookies directly on baking sheet until no warmer than 100°F (38°C) before serving. Enjoy warm, or within 12 hours; these cookies taste best when freshly baked (see Make-Ahead and Storage).\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nrimmed baking sheet\n,\ndigital thermometer\n(optional)\nNotes\nThis recipe works best with commercial chocolate chips, as the increased surface area of chopped chocolate can disrupt the structure of the dough. For the best flavor, try blending several supermarket brands with different cocoa percentages. For more information, see our\nguide to buying chocolate chips\n.\nMake-Ahead and Storage\nThe portioned cookie dough can be wrapped tightly in plastic and refrigerated for up to 1 week. Alternatively, the portions can be individually wrapped, then placed in a freezer-safe zip-top bag and frozen for up to 6 months. Thaw frozen dough to 40°F (4°C), unwrap, and bake as directed.\nThese cookies taste best when freshly baked, but leftovers may be stored in an airtight container at room temperature up to 2 days; rewarm briefly in a 350°F (180°C) oven before serving.\nRead More\nThe Food Lab's Chocolate Chip Cookies\nVegan Chocolate Chip Cookies\nQuick and Easy Chocolate Chip Cookies\nMalted Chocolate Chip-Pecan Cookies\nCookies\nBaking\nChocolate"
}