{
  "url": "https://www.seriouseats.com/super-simple-friday-night-meatballs-recipe",
  "image_url": "https://www.seriouseats.com/thmb/jCEQR8j9KVffV1SOLvbm3ARGyWs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140721-meatballs-carinaromano-e6cc30f2eabe4443a7f45291e5d2ea1d.jpg",
  "tags": [
    "Meatballs",
    "Italian",
    "Stovetop Beef",
    "Ground Beef",
    "Tomato"
  ],
  "title": "Super-Simple Friday Night Meatballs Recipe",
  "full_text": "Super-Simple Friday Night Meatballs Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n90 mins\nActive\n45 mins\nTotal\n110 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n2\n(\n28-ounce) cans\npeeled whole tomatoes\n2\ntablespoons\n(\n30\nml\n)\nextra-virgin olive oil\n6 to 8\ncloves\nminced garlic\n(about\n2\ntablespoons\n)\n1\n(\n6-ounce) can\ntomato paste\nKosher salt\nand freshly ground black pepper\nFor the Meatballs:\n4\nslices\nbread\n, crusts removed\n2\neggs\n2\npounds\n(\n900\ng\n)\n80/20 ground beef\n1 1/2\ntablespoons\nadobo seasoning\n(such as Goya); see note\n1/2\ncup\nminced\nfresh parsley leaves,\ndivided\nKosher salt\nand freshly ground black pepper\nOlive oil\n, for frying\nPasta and\ngrated parmesan cheese\n, for serving\nDirections\nFor the Sauce:\nCrush tomatoes by hand, with a food mill, or in a food processor to form a very rough purée. Heat oil in a large Dutch oven over medium heat until shimmering. Add garlic and cook, stirring, until softened but not browned, about 1 minute. Add tomato paste and cook, stirring, until fragrant, about 1 minute longer. Add crushed tomatoes, bring to a simmer, cover, and reduce heat to low. Season lightly with salt and pepper. Meanwhile, make the meatballs.\nFor the Meatballs:\nTear bread into rough chunks and pulse in the food processor until reduced to fine crumbs. Transfer to a large bowl. Add eggs and mix with your hands until combined. Add beef, adobo seasoning, and half of parsley. Combine mixture with your hands, working bread crumbs into meat until meat mixture can form a ball that holds together when tossed back into the bowl. Do not over-mix.\nPlace a small amount of mixture on a microwave-safe plate and microwave on high until cooked, about 20 seconds. Taste and add salt and/or pepper to mixture to taste. Using wet hands, form mixture into balls of roughly 2 tablespoons each, about 1 1/2 to 2 inches across. Place balls on a large parchment- or wax paper–lined tray as you work.\nAdd enough oil to a large cast iron or stainless steel sauté pan to form a thin layer across the bottom. Heat over medium-high heat until shimmering. Add as many meatballs as will fit in a single layer and cook until well browned on first side. Gently turn balls with tongs or a thin metal spatula and continue cooking and turning until well browned on all sides. As meatballs finish browning, add them to the pot of sauce and replace them with raw meatballs. Continue, adding more oil as necessary, until all meatballs are browned and in the sauce.\nSimmer over low heat for 1 hour. Season to taste with salt and pepper and stir in remaining fresh parsley. Serve with pasta and grated parmesan cheese.\nSpecial Equipment\nFood processor\n,\ncast iron\nor stainless steel\nsauté pan\n,\nDutch oven\n,\nrimmed baking sheet\nMake-Ahead and Storage\nThe meatballs can be frozen after frying and before they're added to the sauce. After browning, transfer to a parchment-lined plate or baking sheet. Place in freezer until balls are fully frozen, then transfer to a zipper-lock bag. Sauce can be frozen separately in a zipper-lock bag. To finish, thaw sauce and transfer to a pot. Add meatballs and simmer for at least 1 hour. Alternatively, transfer thawed sauce and meatballs to a slow cooker. Set to \"keep warm\" and allow to cook for 8 hours.\nRead More\nThe Best Italian-American Meatballs\nSpaghetti and Meatballs\nTender and Juicy Slow-Cooker Meatballs\n10 Ways to Host a Better Potluck\nSerious Entertaining: How To Throw a Pizza Party\nTacos de Canasta (Basket Tacos for a Party or Potluck)\nMeatballs\nItalian\nStovetop Beef\nGround Beef\nTomato"
}