{
  "url": "https://www.seriouseats.com/sweet-and-spicy-grilled-chicken-sandwiches-recipe",
  "image_url": "https://www.seriouseats.com/thmb/fNdRA4tRAXyAnPFH3ZO5bvxpvIk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__05__20130522-253268-sweet-and-spicy-chicken-sandwiches-55744396878b4fbdbd1e0e2ffb467aa1.jpg",
  "tags": [
    "Sandwiches",
    "Grilled Chicken",
    "Chicken Breast",
    "Memorial Day"
  ],
  "title": "Sweet and Spicy Grilled Chicken Sandwiches Recipe",
  "full_text": "Sweet and Spicy Grilled Chicken Sandwiches Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nActive\n75 mins\nRest Time\n20 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Brine:\n2\nquarts\ncold\nwater\n1/3\ncup\nkosher salt\n2\ntablespoons\ngranulated sugar\n2\ntablespoons\ndark brown sugar\n4\nbreast\nboneless chicken breasts\nFor the Barbecue Glaze:\n3/4\ncup\nketchup\n1/4\ncup\napple juice\n1/4\ncup\ncider vinegar\n3\ntablespoons\njalapeño jam\n2\ntablespoons\nmaple syrup\n2\ntablespoons\nhoney\n2\ntablespoons\ndark brown sugar\n2\ntablespoons\nmolasses\n1\ntablespoon\nWorcestershire sauce\n1\ntablespoon\nhot sauce\n1\nteaspoon\nsalt\n1/2\nteaspoon\ncayenne pepper\n1/2\nteaspoon\ngarlic powder\nFor the Bacon Rub:\n1\ntablespoons\nsugar\n1\nteaspoon\nchili powder\n1/8\nteaspoon\ncumin\n1/8\nteaspoon\ncayenne pepper\n6\nslices\nthick-cut bacon\nTo Assemble:\n4\nslices\nprovolone cheese\n4\npotato rolls\n2\ntablespoons\nbutter\n, softened\n2\nRoma tomatoes\n, sliced into 1/4-inch rounds\n1\nred onion\n, thinly sliced\n4\nleaves\nred leaf lettuce\n, washed and dried\nDirections\nPlace one chicken breast in a resealable plastic bag or between two pieces of plastic wrap. Using a meat pounder, rolling pin, or small skillet, pound chicken breast into an even thickness about 3/4-inches in height. Repeat with remaining 3 breasts.\nTo make the brine:\nIn a medium bowl whisk together water, salt, white sugar, and brown sugar until solids are dissolved. Place chicken breasts in brine and refrigerate for 30 minutes. Remove chicken from brine and pat dry with paper towels. Place chicken back in fridge until ready to grill.\nTo make the glaze:\nWhisk together ketchup, apple juice, cider vinegar, jalapeño jam, maple syrup, honey, dark brown sugar, molasses, Worcestershire sauce, hot sauce, salt, cayenne pepper, and garlic powder in a medium saucepan. Bring to a boil over medium heat, reduce heat to low and simmer until sauce has slightly thickened, about 15 minutes. Remove from heat.\nTo make the bacon rub:\nMix together sugar, chili powder, cumin, and cayenne in a small bowl. Lay bacon out on a plate and sprinkle with rub on both side.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean\nand\noil\nthe grilling grate. Lay bacon on cool side of the grill, cover, and cook until crisp, about 10 minutes, flipping halfway through. Remove to a plate and break bacon strips in half.\nPlace chicken over hot side of grill and cook until well browned, 3 to 5 minutes. Flip and continue to cook until second side is browned. Move chicken to cool side of grill and brush all over with barbecue glaze. Top each chicken breast with one slice of provolone cheese. Cover and continue to cook until cheese has melted and meat register 160°F on an instant read thermometer inserted into the center of breast, about 5 minutes more. Transfer chicken to a plate and let rest for 5 minutes.\nLightly butter cut sides of potato rolls. Place rolls over hot side of grill, cut side down, until lightly toasted, about 1 minute; transfer to a tray. Top each bun with a chicken breast, tomato, onion, lettuce, and bacon and serve immediately with remaining barbecue glaze.\nSpecial equipment\ngrill\nSandwiches\nGrilled Chicken\nChicken Breast\nMemorial Day"
}