{
  "url": "https://www.seriouseats.com/sweet-potato-pie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/GUeRalDDHIb5krstFs_EgJ37xzI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__11__20161101-sweet-potato-pie-vicky-wasik-13-d295b177644f4936ae0b54a6431350ff.jpg",
  "tags": [
    "Thanksgiving Desserts",
    "Thanksgiving Desserts",
    "Sweet Potatoes",
    "Custards, Mousses & Puddings",
    "Thanksgiving Sweet Potatoes"
  ],
  "title": "Silky Sweet Potato Pie Recipe",
  "full_text": "Silky Sweet Potato Pie Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n100 mins\nActive\n60 mins\nCooling Time\n20 mins\nTotal\n2 hrs 10 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n16\nounces\nsweet potatoes\n(\n3 1/3\ncups\n;\n455\ng\n) from\n2\nmedium\nsweet potatoes, peeled, roughly diced (see notes)\n1\nvanilla bean\n, split and scraped, seeds reserved for whipped cream topping\n2 or 3\ncinnamon\nsticks\n(about\n6\ninches\ntotal)\n1\nwhole\nnutmeg\n(see notes)\n26\nounces\nmilk\n(\n3 1/4\ncups\n;\n740\ng\n), any percentage will do\n6\nounces\nheavy cream\n(\n3/4\ncup\n;\n170\ng\n)\n7\nounces\nwhite or\nlightly toasted\nsugar\n(\n1\ncup\n;\n195\ng\n)\n1\ntablespoon\nground cinnamon\n1\nteaspoon\nfreshly grated\nnutmeg\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; use half as much if iodized table salt\n1/2\nounce\nvanilla extract\n(\n1\ntablespoon\n;\n14\ng\n)\n3\nlarge\neggs\nOld-fashioned flaky pie crust\n, prepared as for a\nblind-baked pie\nBrown sugar whipped cream\n(optional)\nDirections\nIn a 3-quart stainless steel saucier, combine sweet potatoes, empty vanilla pod, cinnamon sticks, whole nutmeg, milk, cream, and sugar. If you have a scale, write down the weight of the saucier and combined ingredients so you can precisely measure the reduction.\nBring to a boil over high heat, then adjust to medium-low and maintain a gentle simmer (higher heat may cause the milk to curdle). Scrape frequently with a flexible spatula to prevent milk solids from building up around the side, and simmer until sweet potatoes are fall-apart tender and dairy has condensed into a thick sauce, about 55 minutes. The saucier should weigh 19 ounces (535g) less than when you started. (Alternatively, total volume, including cooked sweet potato, should be 3 2/3 cups when finished.)\nAdjust oven rack to lower-middle position and preheat to 350°F (177°C). Remove vanilla bean and spices from saucier and purée sweet potato and dairy mixture with an immersion blender until smooth. (If needed, transfer to a smaller container to avoid splashing.) Whisk in ground cinnamon, grated nutmeg, salt, and vanilla, followed by eggs. If you like, strain through a fine-mesh strainer before pouring into prepared pie crust.\nBake pie until gently set in the middle with an internal temperature of 195°F (91°C), about 40 minutes. Cool at least 20 minutes before slicing with a chef's knife, pausing to wipe the blade clean as needed. If desired, serve with dollops of brown sugar whipped cream. Wrapped in plastic, sweet potato pie will keep for up to 3 days at cool room temperature.\nSpecial Equipment\n3-quart stainless steel saucier\n,\nimmersion blender\n,\nlarge fine-mesh strainer\n(optional),\ndigital thermometer\nNotes\nI love the bright color of garnet yams in this recipe—don't worry, despite the name, they're actually sweet potatoes—but any true sweet potato will do. This recipe will not work with butternut squash or pumpkin, both of which develop an unpalatable vegetal quality with boiling.\nEven if you're not a big fan of nutmeg, you'll be surprised at how well it pairs with the sweet potato custard, coaxing out a sense of brightness and cutting through the dairy fat. In the quantities used here, it has a fresh, almost herbaceous flavor, owing to its high levels of myristicin, an essential oil common to parsley and dill.\nThanksgiving Desserts\nThanksgiving Desserts\nSweet Potatoes\nCustards, Mousses & Puddings\nThanksgiving Sweet Potatoes"
}