{
  "url": "https://www.seriouseats.com/sweet-potato-apple-pie-recipe-8746610",
  "image_url": "https://www.seriouseats.com/thmb/r8mV__eOj9aG64FFhF_cTz8knI0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20201031-sweet-potato-apple-pie-vicky-wasik-24-1df4e173161c4807b08536ef76bca455.jpg",
  "tags": [
    "Pies",
    "Fall",
    "Thanksgiving Desserts",
    "Fall Desserts",
    "Thanksgiving"
  ],
  "title": "Sweet Potato and Apple Crumble Pie",
  "full_text": "Sweet Potato and Apple Crumble Pie\nClose\nJump to recipe\nPrep\n20 mins\nCook\n80 mins\nMacering and Cooling Time\n5 hrs 15 mins\nTotal\n6 hrs 55 mins\nServes\n8\nto 10\nMakes\n1 9-inch pie\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crumble:\n3\nounces\nall-purpose flour\n(about 1/2 cup; 85g), such as Gold Medal\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/2\nteaspoon\nground cinnamon\n1/4\nteaspoon\nground Chinese five-spice powder\n2\nounces\n(1/2 cup; 60g)\nsliced almonds\n2\nounces\n(1/4 cup; 60g)\ngranulated sugar\n2\nounces\n(1/4 cup; 60g)\nlight brown sugar\n2\ntablespoons\n(4g)\nfresh thyme leaves\n3\nounces\n(6 tablespoons; 85g)\nunsalted butter\n, melted\nFor the Filling:\n6\nounces\n(3/4 cup; 170g)\nlight brown sugar\n1\nteaspoon\n(4g) Diamond Crystal\nkosher salt\n; for table salt, use the same weight or half as much by volume\n3/4\nteaspoon\nground cinnamon\n3/4\nteaspoon\nground Chinese five-spice powder\n1/4\nteaspoon ground\nwhite pepper\n4 medium tart apples (about 2 pounds;\n900\ng\n), such as\nGranny Smith\n(see note)\n2\nmedium\nsweet potatoes\n(about 1 1/2 pounds; 680g)\n1\nounce\ntapioca starch\n(1/4 cup, spooned; 25g), such as Bob's Red Mill\nOld-fashioned flaky pie dough\n, rolled and chilled per directions for a single-crusted pie\nDirections\nFor the Crumble:\nIn a medium heatproof bowl, combine all-purpose flour, salt, cinnamon, and five-spice powder.\nIn a blender, quickly pulse almonds until roughly chopped, about 5 seconds. Add to flour mixture.\nIn the same blender, combine granulated sugar, brown sugar, and thyme. Process until thyme is finely chopped and evenly incorporated into sugar (the mixture should resemble wet sand), about 30 seconds. Add to bowl with flour mixture, then whisk together until well combined, about 30 seconds.\nPour melted butter over flour mixture. Using a flexible spatula, thoroughly mix until no dry flour remains and a damp, crumbly meal has formed, about 1 minute. Set aside.\nFor the Filling:\nIn a 1-gallon zipper-lock bag, combine brown sugar, salt, cinnamon, five-spice powder, and white pepper.\nPeel, quarter, and core apples. Slice each quarter lengthwise into 1/2-inch thick wedges (you should have about 20 ounces/565g of sliced apples, measuring about 5 rounded cups). Add sliced apples to bag, seal, and shake until coated. Macerate at room temperature, flipping the bag occasionally to distribute the syrup, until apples have lost a third of their volume, at least 3 hours. The apples can be held up to 8 hours in the refrigerator.\nMeanwhile, peel then quarter sweet potatoes lengthwise. Slice each quarter crosswise into 1/2-inch thick wedges (you should have about 20 ounces/565g of sliced sweet potatoes, measuring about 4 rounded cups).\nPlace sweet potatoes in a 3-quart saucepan and cover with cold water. Bring to a boil over high heat, then reduce heat to low to maintain a simmer. Cook until sweet potatoes are tender enough to be pierced with a knife, but not completely cooked through, about 5 minutes. Drain sweet potatoes and run under cold water until cooled to stop cooking. Set aside to let cool to room temperature, about 15 minutes.\nAdjust oven rack to lower-middle position and preheat to 400°F (204°C).\nWhen apples are ready, add sweet potatoes and tapioca starch to bag, reseal, and toss to combine. Pour sweet potato and apples, along with accumulated syrup, into the prepared pie shell, gently pressing the slices into a flattish mound.\nEvenly distribute crumble topping over pie filling, breaking up any large chunks with your fingers.\nPlace pie on a parchment-lined half-sheet tray. Bake to an internal temperature of around 195°F (91°C) in the very center, about 1 hour 15 minutes (if crumble topping starts to darken beyond chestnut brown in color, loosely cover pie with aluminum foil for remainder of baking time).\nTransfer pie to a wire rack and let cool to room temperature, about 1 hour. Slice and serve.\nSpecial Equipment\nblender\n, flexible spatula,\n3-quart stainless steel saucier\n,\nhalf-sheet tray\n,\nwire rack\nNotes\nTart green baking apples, such as Granny Smiths, hold their shape nicely when baked, which complements the texture of the sweet potatoes and keeps the filling sturdy and thick. Not all types of apples can be substituted here, as some varieties may break down more rapidly in the oven, or not cook through in the allotted time.\nMake-Ahead and Storage\nThe crumble topping can be prepared in advance, then transferred to a zipper-lock bag. Lay flat in the refrigerator until chilled (this prevents it from solidifying into a block), then keep refrigerated in an upright position until needed for up to 1 month.\nThe sweet potatoes can be par-cooked and then refrigerated in an airtight container for up to 3 days before adding to macerated apples and continuing with the recipe.\nWrapped tightly in foil, the baked pie will keep for up to 3 days at room temperature. Warm leftovers in a 350°F (177°C) oven to restore crumble, crust, and filling.\nPies\nFall\nThanksgiving Desserts\nFall Desserts\nThanksgiving"
}