{
  "url": "https://www.seriouseats.com/sweet-tart-duck-breasts-with-fresh-cherry-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-sweqWiGKsnypnHbduibtQI5H60=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__20120118-fiaf-duck-cherry-sauce-primary-d3ddfd3713ff44879d6414269174283b.jpg",
  "tags": [
    "Duck Mains",
    "French",
    "Roasting",
    "Duck",
    "Cherry"
  ],
  "title": "Sweet-Tart Duck Breasts With Fresh Cherry Sauce",
  "full_text": "Sweet-Tart Duck Breasts With Fresh Cherry Sauce\nClose\nJump to recipe\nPrep\n5 mins\nCook\n55 mins\nActive\n10 mins\nResting Time\n25 mins\nTotal\n85 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\n(5- to 6-ounce)\nduck breasts\nCoarse sea salt\n, such as Maldon\n2\nteaspoons\nolive oil\n1\nsmall\nshallot\n, finely diced\n1/2\ncup\ndry red wine\n1/4\ncup\nlow-sodium chicken stock\n7\nounces\nBing cherries\n, pitted, stemmed, and halved\n1\ntablespoon\nbalsamic vinegar\n10\ntwists\non the\nblack pepper\nmill\n1\nteaspoon\nhoney\n, preferably orange flower\n1/2\ntablespoon\nvery cold\nunsalted butter\nDirections\nTake duck breasts out of the fridge 15 minutes before cooking. Preheat the oven to 400°F (205°C). Score skin on top of the breasts in a crosshatch fashion, being careful to score only the fat and not the flesh beneath it. Season duck on all sides with salt.\nPreheat an ovenproof nonstick skillet on medium heat. Place the duck, skin-side-down, in the hot pan and leave it alone for 10 to 12 minutes, until the skin is golden brown and the fat has rendered.\nTake the pan off the heat, and turn the duck breasts over so the bottom of the breasts are coated in the rendered duck fat. Pour the excess fat into a heat-proof container, and keep for frying potatoes.\nTurn the breasts skin-side-up, transfer pan to the oven, and cook for 10 minutes. The internal temperature will be about 135°F (57°C). Let the duck breasts rest on a cutting board for 10 minutes before slicing.\nTo make the cherry sauce, heat a small nonstick skillet over medium-low heat. Add olive oil and the shallot. Cook for 1 minute, just to soften the shallot. Add wine, stock, and cherries. Bring mixture to a boil. Add balsamic vinegar, salt to taste, and pepper. Reduce the heat to medium-low, and simmer for 20 minutes.\nRemove a 1/4 cup combination of liquid and cherries and purée in a mini food processor. Return the puréed mixture to pan with the rest of the sauce, and stir in honey and cold butter.\nSlice the duck. Pour the sauce onto a serving plate, and arrange the slices of duck on top. Finish with salt and pepper to taste. Serve with tender greens lightly dressed with lemon juice and olive oil, or\nrich and creamy puréed potatoes\n.\nSpecial Equipment\nNonstick skillet\n,\nmini food processor\n,\ninstant-read thermometer\nRead More\nPan-Seared Duck Breast With Orange Pan Sauce Recipe\nSeared Duck Breast With Prosciutto, Sage, and Peaches Recipe\nCrispy Duck with Blackberry Gastrique, Roasted Pearl Onions, and Israeli Couscous Recipe\nDuck Mains\nFrench\nRoasting\nDuck\nCherry",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sweet-tart-duck-breasts-with-fresh-cherry-sauce.webp?"
}