{
  "url": "https://www.seriouseats.com/sweet-potato-casserole-marshmallow-recipe",
  "image_url": null,
  "tags": [
    "Sweet Potatoes",
    "Thanksgiving Sweet Potatoes",
    "Vegetable Sides",
    "Thanksgiving Side Dishes",
    "Christmas Sides"
  ],
  "title": "Sweet Potato Casserole With Marshmallows Recipe",
  "full_text": "Sweet Potato Casserole With Marshmallows Recipe\nJump to recipe\nPrep\n10 mins\nCook\n2 hrs 35 mins\nActive\n40 mins\nCooling Time\n30 mins\nTotal\n3 hrs 15 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\npounds\n(\n2.8\nkg\n) moist\nsweet potatoes\n, such as ruby or garnet yams (about\n6\nlarge\npotatoes\n; see note)\n8\ntablespoons\nunsalted butter\n(\n1\nstick\n;\n115\ng\n)\n8\nsprigs\nfresh thyme\nand/or sage\n1\n(4-inch) knob\npeeled\nfresh ginger\n, finely grated (about\n1\ntablespoon\n;\n15\ng\n)\n1/4\ncup\n(\n60\ng\n) buttermilk or\nsour cream\nKosher salt\n2\ncups\nmini marshmallows\n(\n3\nounces\n;\n90\ng\n) (see note)\nDirections\nAdjust oven rack to center position. Place 2 large sheets of heavy-duty aluminum foil on a work surface. Working with one sheet at a time, place half of potatoes in center. Fold up foil and crimp edges to seal tightly. Repeat on second sheet with rest of potatoes. Transfer pouches to a rimmed baking sheet and place in oven. Set oven to 300°F (149°C). Roast until a thin skewer inserted into potatoes goes in with no resistance, about 2 hours. Remove from oven and set aside until cool enough to handle.\nSerious Eats\nMeanwhile, melt butter in a medium saucepan over medium-low heat, swirling gently until particles are pale golden brown and smell nutty. Add herb sprigs; herbs may cause brown butter to splatter at first, so take care. Swirl herbs in brown butter off-heat until frizzled. Set aside.\nSerious Eats\nPeel sweet potatoes and discard skins. Add flesh to a large bowl or the bowl of a stand mixer. Beat with the whisk attachment or with a handheld mixer until smooth and fluffy, about 2 minutes. Strain brown butter into potatoes, discarding frizzled herbs. Beat in ginger, then beat in buttermilk or sour cream. Season to taste with salt.\nSerious Eats\nWhen ready to finish dish, preheat oven to 375°F (190°C). Scrape potatoes into a 2-quart baking dish, smoothing surface with a rubber spatula. Bake until heated through, about 30 minutes. Increase oven temperature to 475°F (246°C) and top with mini marshmallows. Bake until marshmallows are melted and lightly browned, about 3 minutes (keep an eye on them, as they can brown and then burn very quickly). Serve.\nSerious Eats\nSpecial Equipment\n2-quart oven-safe baking dish,\nrimmed baking sheet\n,\nstand mixer\nor handheld mixer.\nNotes\nSweet potatoes can be made even sweeter if you pre-treat them in a water bath to activate their enzymes. To do this with a sous vide–style circulator, set your circulator for 150°F (66°C). Place the sweet potatoes in the water bath and let circulate for 2 to 4 hours before proceeding with the recipe. To do it with a beer cooler, fill your cooler with water at 170 to 175°F (77 to 79°C). Add the potatoes, cover, and let rest for 2 to 4 hours before proceeding. Most marshmallows are not vegetarian, since they contain gelatin; if you want to ensure this recipe is vegetarian, make sure to buy vegetarian marshmallows.\nThis recipe can be scaled down by half. To do it: Divide all ingredients by two, except for the marshmallows, which should be kept at the 2 cups listed; use 1 large sheet of aluminum foil instead of 2. Bake the casserole in an 8-inch skillet.\nMake-Ahead and Storage\nMashed sweet potatoes can be refrigerated for up to 5 days. To store and reheat, transfer sweet potatoes to a heavy-duty zipper-lock bag with the air pressed out. Reheat by completely submerging zipper-lock bag in a pot full of hot (not boiling) water, removing the bag occasionally to squeeze contents around, until fully reheated, about 30 minutes. Or, reheat with a sous vide–style circulator set at 150°F (66°C).\nSweet Potatoes\nThanksgiving Sweet Potatoes\nVegetable Sides\nThanksgiving Side Dishes\nChristmas Sides"
}