{
  "url": "https://www.seriouseats.com/sweet-potato-sausage-jeon",
  "image_url": "https://www.seriouseats.com/thmb/WZGnEr4fP5k6hMG7ns2KWhLBRHs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20201015-banchan-thanksgiving-sweet-potato-jeon-yangyeom-dipping-sauce-vicky-wasik-12-2923db4d02bd4cd9ad416e0092f336a0.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Winter",
    "Fall Snacks & Appetizers",
    "Sausages",
    "Sweet Potatoes"
  ],
  "title": "Sweet Potato and Sausage Jeon With Yangnyeom Dipping Sauce Recipe",
  "full_text": "Sweet Potato and Sausage Jeon With Yangnyeom Dipping Sauce Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nActive\n40 mins\nTotal\n45 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Yangnyeom Dipping Sauce:\n2\ntablespoons\n(\n24\ng\n)\ntoasted sesame seeds\n4\ngarlic\ncloves\n(\n20\ng\n)\n1 1/2\nteaspoons\n(\n4\ng\n)\nwhole black peppercorns\n1/4\ncup\nplus\n1\ntablespoon\n(\n75\nml\n)\nwater\n3\ntablespoons\n(\n45\nml\n)\nsoy sauce\n2\ntablespoons\n(\n16\ng\n)\ngochugaru\n2\nteaspoons\n(\n10\nml\n)\nfish sauce\n4\nscallions\n(\n60\ng\n), thinly sliced\n2\ntablespoons\n(\n30\nml\n)\ntoasted sesame oil\nFor the Jeon:\n2 1/2\nounces\n(\n1/2\ncup\n;\n70\ng\n)\nall-purpose flour\n7\nounces\n(\n200\ng\n)\nsweet potato\n, peeled and grated on largest holes of a box grater (about\n1 1/2\ncups\n)\n6\nounces\n(\n170\ng\n)\nhot Italian sausage\n, casing removed\n5\nlarge\neggs\n(\n250\ng\n), divided\n4\nscallions\n(\n2\nounces\n;\n60\ng\n), thinly sliced\n2\ntablespoons\n(\n6\ng\n)\nfinely chopped fresh sage leaves\n2\ntablespoons\n(\n30\ng\n)\nmayonnaise\nVegetable oil\nfor frying\nDirections\nFor the Yangnyeom Dipping Sauce:\nUsing a mortar and pestle, grind sesame seeds into a coarse powder, with some seeds left whole, about 30 seconds. Transfer to a small bowl, and set aside.\nAdd garlic and peppercorns to now-empty mortar, and pound to a coarse paste, about 1 minute. Stir in ground sesame seeds, water, soy sauce, gochugaru, and fish sauce. Once mixture is well-combined, stir in scallions and sesame oil. Yangnyeom can be used right away, or refrigerated in an airtight container for up to 1 week; bring to room temperature before serving. If you do not own a mortar and pestle you can make the yangnyeom by coarsely grinding sesame seeds in a spice grinder, mincing the garlic with a knife, grinding the pepper with a pepper mill, and stirring all ingredients together in a bowl.\nSerious Eats / Vicky Wasik\nFor the Jeon:\nIn a shallow dish or bowl, whisk together 4 eggs and mayonnaise until homogenous; set aside. Place flour in a separate shallow dish, and set aside. In a medium bowl, combine sweet potato, sausage, 1 egg, scallions, and sage. Using clean hands, massage ingredients together until well-combined and mixture becomes slightly tacky and sticky, about 1 minute. Form mixture into 12 patties that are roughly 2 inches in diameter and 1/2-inch-thick (each patty should weigh about 1 1/2 ounces; 45g each).\nSerious Eats / Vicky Wasik\nSet a wire rack in a rimmed baking sheet, and line with a double layer of paper towels. In a large cast iron skillet, heat 1/8 inch oil over medium-high heat to 375°F (190°C). Working one at a time, dredge patties in flour, shake off excess flour, and transfer to a large plate or rimmed baking sheet. Coat 6 patties in egg mixture, allow excess to drip off, and carefully add to skillet. Cook until golden brown on bottom, 2 to 3 minutes. Flip patties and cook until golden brown on second side and sausage is cooked through, 2 to 3 minutes longer. Using a slotted spatula, transfer to prepared baking sheet to drain. Repeat coating and cooking process with remaining 6 patties, adding oil as needed to maintain 1/8-inch depth and returning oil 375°F (190°C) before adding patties to skillet.\nSerious Eats / Vicky Wasik\nIf serving right away, divide jeon between individual serving plates and serve, passing yangnyeom at the table. If making jeon in advance, discard paper towels from draining cooked jeon, cover baking sheet loosely with plastic, and refrigerate for up to 2 days. Reheat jeon on same baking sheet, uncovered, in a 350°F (177°C) oven until heated through, 5 to 10 minutes.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nWire rack\n, rimmed baking sheet,\nlarge cast iron skillet\nMake-Ahead and Storage\nYangnyeom dipping sauce can be made ahead and refrigerated in an airtight container for up to 1 week; bring to room temperature before serving. Jeon can be cooked in advance, and refrigerated, covered, for up to 2 days. Reheat on a wire rack set in a rimmed baking sheet in a 350°F (177°C) oven until heated through, 5 to 10 minutes.\nThis Recipe Appears In\nCelebrate the Sides With a Korean-American Banchan Thanksgiving\nSnacks & Appetizers\nWinter\nFall Snacks & Appetizers\nSausages\nSweet Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sweet-potato-and-sausage-jeon-with-yangnyeom-dipping-sauce-recipe.webp?"
}