{
  "url": "https://www.seriouseats.com/sweet-noodle-kugel-recipe-8760419",
  "image_url": "https://www.seriouseats.com/thmb/UgLm5JzIRiNp_xNuhz4YZqjqBns=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241211-SEA-NoodleKugel-AmandaSuarez-Hero2-91-5a7ddf92dbce49f88d3d536288567f43.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Sides"
  ],
  "title": "Sweet Noodle Kugel",
  "full_text": "Sweet Noodle Kugel\nClose\nJump to recipe\nPrep\n5 mins\nCook\n85 mins\nTotal\n90 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\nOne 12-ounce (\n340\ng\n) package\ndried egg noodles\n(wide, medium, or fine, depending on your preference)\n5\nlarge\neggs\n1\ncup\nsugar\n(7 ounces; 198g)\n4\ntablespoons\n(60g) unsalted\nbutter\n, melted, plus more for greasing the baking dish (or use nonstick cooking spray to grease)\n2\ncups\nfull-fat\nsour cream\n, cottage cheese, or cream cheese, or any combination (1 pound; 454g)\n3/4\ncup\n(177g) half-and-half or\nwhole milk\n1/2\nteaspoon\nground cinnamon\n3/4 cup (\n135\ng\n)\nraisins\nDirections\nPreheat oven to 325°F (160°C) and set rack in middle position. In a pot of lightly salted water, boil egg noodles until very tender, about 2 minutes longer than package directions. Drain and rinse with cold water to cool.\nSerious Eats / Amanda Suarez\nMeanwhile, in a large mixing bowl, whisk together eggs, sugar, butter, sour cream (and/or cottage or cream cheese), half-and-half (or milk), cinnamon, and 1/2 teaspoon salt until thoroughly combined (note that cream cheese is the most difficult to whisk in given how dense it is, and will require some smashing in addition to the whisking; it's fine if tiny bits are left (they will melt in during baking) but try not to have any large clumps; cottage cheese will blend well but the curds will remain, which many of us like). Stir in noodles and raisins until well combined.\nSerious Eats / Amanda Suarez\nGrease a 3-quart baking dish or casserole dish with butter or nonstick cooking spray, then scrape noodles and custard mixture into prepared baking dish or casserole dish, spreading noodles around in an even layer and pressing down slightly to submerge most of them. If you want a more tender custard with less crispy noodles and edges, set baking dish in a larger vessel such as a large roasting pan, then pour boiling water about 3/4 of the way up the sides of the baking dish. If you want crispier noodles and edges, set baking dish on a rimmed baking sheet.\nSerious Eats / Amanda Suarz\nCarefully transfer to oven and bake until custard is puffed and fully set, about 1 hour. Remove from oven and let cool slightly before cutting into portions and serving. The cooled kugel is also delicious at room temperature or even chilled from the fridge.\nSerious Eats / Amanda Suarez\nMake Ahead and Storage\nThe kugel can be served after baking, or allowed to cool to room temperature before serving. It can be refrigerated in an airtight container (or covered in plastic in the baking dish) for up to 5 days; it is tasty chilled from the fridge (though the crispy noodles will be less crisp and more chewy like that) or can be gently reheated and re-crisped in a moderate oven.\nSpecial Equipment\n9- by 13-inch baking dish or other 3-quart casserole or baking dish (or divide among smaller vessels like ramekins).\nDesserts\nThe Latest\nSides"
}