{
  "url": "https://www.seriouseats.com/sweet-potato-sage-fried-egg-taco-recipe",
  "image_url": null,
  "tags": [
    "Fried Eggs",
    "Eggs",
    "Sage",
    "Sweet Potatoes",
    "Breakfast & Brunch"
  ],
  "title": "Sweet Potato, Sage, and Fried Egg Tacos",
  "full_text": "Sweet Potato, Sage, and Fried Egg Tacos\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n30 mins\nTotal\n20 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nextra-virgin olive oil\n, divided\n1\nlarge\nsweet potato\n, cut into 1/4- to 1/2-inch dice (about\n3/4\npound\n)\nKosher salt\nand freshly ground black pepper\n2\nmedium\ngarlic cloves\n, minced (about\n2\nteaspoons\n)\n2\ntablespoons\nminced fresh sage leaves\n4\nwarm\nsoft corn\ntortillas\n(use\n8\ntortillas\nand double them if using store-bought machine-made tortillas)\n4\nlarge\neggs\n2\ntablespoons\nMexican-style crema\n(see note)\nHot sauce\n, to taste\n1\nlarge\nradish\n, thinly sliced\nChopped fresh cilantro leaves\n1\nlime\n, cut into wedges\nDirections\nHeat 2 tablespoons oil in a large non-stick or cast iron skillet over medium-high heat until shimmering. Add sweet potato, season with salt and pepper, and cook, stirring and tossing frequently, until softened and lightly browned on all sides, about 8 minutes. Add garlic and sage and cook, stirring constantly, until fragrant, about 30 seconds. Transfer mixture to a bowl, cover, and keep warm.\nWipe out skillet and add remaining tablespoon oil. Heat over medium-high heat until shimmering and swirl to coat. Add eggs, season with salt and pepper and fry until whites are just set but yolks are still runny, about 2 minutes.\nMeanwhile, place tortillas on a warm serving dish and divide sweet potato mixture evenly between them. Top each with a fried egg. Drizzle with crema and hot sauce, garnish with radishes and cilantro, and serve immediately with lime wedges.\nSpecial Equipment\nLarge cast iron skillet\nor large nonstick skillet\nNotes\nIf you can't find Mexican crema, substitute with sour cream thinned out with milk or heavy cream until a light, pourable consistency is reached.\nRead More\nFried-Avocado Tacos With Chipotle Cream, Cabbage, and Pickled Onions\nCrunchy Fried Fish Tacos\nBetter Than Chipotle Beef Barbacoa\nFried Eggs\nEggs\nSage\nSweet Potatoes\nBreakfast & Brunch"
}