{
  "url": "https://www.seriouseats.com/sweet-chinese-mooncakes-with-walnut-red-bean",
  "image_url": "https://www.seriouseats.com/thmb/2oWQFYqIAEWMhvkqDIgnURDoFJ4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__09__20150919-midautumnfeast-fiona-reilly-20150919-midautumnfeast-mooncakes1-fiona-reilly-deb0b536954340a5a3ae2c417488518a.jpg",
  "tags": [
    "Desserts",
    "Chinese",
    "Beans",
    "Walnuts",
    "Fall Desserts"
  ],
  "title": "Sweet Mooncakes With Spiced Walnut and Red Bean Filling Recipe",
  "full_text": "Sweet Mooncakes With Spiced Walnut and Red Bean Filling Recipe\nClose\nJump to recipe\nPrep\n25 mins\nCook\n30 mins\nActive\n2 hrs\nCooling and Chilling Time\n2 hrs\nTotal\n2 hrs 55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Golden Sugar Syrup:\n10 1/2\nounces\ngranulated sugar\n3/4\ncup\nwater\n2 1/2\ntablespoons\nfresh juice\nfrom\n1\nmedium\nlemon\nFor the Walnut Filling:\n3 1/2\nounces\nwalnuts\n(about\n3/4\ncup\n)\n1 3/4\nounces\ngranulated sugar\n(about\n1/4\ncup\n)\n1\nteaspoon\nChinese five-spice powder\n1\nteaspoon\nground cinnamon\n2\ntablespoons\nbutter\n, melted\n2\ntablespoons\nall-purpose flour\n2\ntablespoons\nwater\nFor the Pastry:\n3\ntablespoons\nvegetable oil\n2 1/2\nounces\ngolden sugar syrup\n1/4\nteaspoon\nbaking soda\nmixed with\n2\nteaspoons\nwater\n5\nounces\nall-purpose flour\n(approximately\n1\ncup\n)\nFor Assembly:\n7\nounces\nred bean paste\n1\nlarge\negg\nbeaten with\n2\nteaspoons\nwater\nDirections\nFor the Golden Sugar Syrup:\nAdd sugar, water, and lemon juice to a saucepan. Bring to a boil over high heat. Reduce heat to low and simmer until color begins to turn golden, about 5 minutes. Remove from heat and allow to cool completely.\nFor the Walnut Filling:\nPulse walnuts in food processor until finely chopped. Combine walnuts with sugar, five spice powder, cinnamon, melted butter, and water, stirring to combine. Store in refrigerator until needed.\nFor the Pastry:\nCombine vegetable oil, golden sugar syrup, and baking soda mixture in a large mixing bowl. Add flour and mix, kneading until a soft dough forms. The dough should not be sticky; add additional flour in small increments if necessary. Wrap in plastic and refrigerate for 1 hour.\nTo assemble mooncakes:\nLine baking tray with parchment paper. Divide walnut mixture into 1 ounce portions, roll into balls, and refrigerate until ready. Divide red bean paste into 1 3/4 ounce portions. If too sticky to handle, add a small amount of flour and combine until soft but not too sticky. Roll into balls and set aside. Divide pastry dough into 1 3/4 ounce portions, roll into balls and set aside.\nUsing a rolling pin, roll 1 red bean paste ball into a disk about 3 inches in diameter. Place 1 ball walnut mixture into center of disk and bring edges up and over to cover completely. Gently roll into a sphere. Repeat with remaining portions.\nRoll 1 pastry ball into a disk about 4 inches in diameter. Place walnut and red bean ball in center of disk. Bring edges up over ball to cover completely. If pastry tears, patch with small piece of dough. Gently roll into a sphere. Repeat with remaining portions.\nDust mooncake mold with flour, and tap out excess. Place sphere in enter of mold, smoothest side down. There should be a 1/4 inch gap between sphere and edges of mold.\nGently press down on sphere until it fills the mold. Turn mold upside down and hit edge hard until mooncake starts to dislodge. Gently ease mooncake out of mold and place on parchment-lined baking tray. Repeat steps 7 and 8 with remaining spheres.\nTo Bake:\nAdjust oven racks to lower and upper middle positions and preheat oven to 400°F. Bake mooncakes for 6 minutes.\nRemove mooncakes from oven and reduce heat to 350°F. Allow to mooncakes cool for 15 mins.\nBrush mooncakes with egg glaze and return to oven. Bake for 6 minutes. Remove and allow to cool for 15 minutes. Glaze with second coat of egg wash. Return to oven for a final 6 minutes, until the mooncakes turn a deep golden brown.\nRemove from oven and allow to cool completely before serving. To serve, cut mooncakes into small wedges. They can be kept in an airtight container for up to three days.\nSpecial equipment\nMoon cake mold, ideally 120 to 130 grams volume\nNotes\nMooncake molds are available in various sizes and depths. I use a traditional large wooden mold with a 130-gram volume, but plastic press molds will work as well.\nThis Recipe Appears In\nHow to Host a Chinese Mid-Autumn Festival Feast\nDesserts\nChinese\nBeans\nWalnuts\nFall Desserts",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sweet-mooncakes-with-spiced-walnut-and-red-bean-filling-recipe.webp?"
}