{
  "url": "https://www.seriouseats.com/tacos-al-pastor-recipe",
  "image_url": null,
  "tags": [
    "Cinco de Mayo",
    "Grilled Pork",
    "Mexican",
    "Roasted Pork",
    "Pineapple"
  ],
  "title": "Homemade Tacos Al Pastor",
  "full_text": "Homemade Tacos Al Pastor\nJump to recipe\nPrep\n40 mins\nCook\n4 hrs 40 mins\nActive\n30 mins\nChilling Time\n6 hrs\nTotal\n11 hrs 20 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork:\n2\nwhole\nancho chiles\n, seeds and stems removed\n2\nwhole\npasilla\nor\nguajillo chiles\n, seeds and stems removed\n1/2\ncup\nhomemade\nor\nstore-bought low-sodium chicken stock\n2\nteaspoons\nvegetable oil\n1\nteaspoon\ndried Mexican oregano\n1\nteaspoon\ndried ground cumin\nseed\n1\ntablespoon\nachiote powder\nor\npaste\n1\nchipotle chile packed in adobo sauce\n, plus\n2\nteaspoons\nsauce from can\n1/4\ncup\ndistilled white vinegar\n2 1/2\nteaspoons\nkosher salt\n2\nteaspoons\nsugar\n3\ncloves\ngarlic\n2\npounds\nboneless blade-end loin\nor\nsirloin pork roast\n8\nounces\n(\n1/2\npound\n)\nsliced bacon\nTo Finish and Serve:\n1\nsmall\npineapple\n, peeled, cored, and cut into quarters lengthwise\n32\nto\n48\ncorn tortillas\n,\nheated and kept warm\n1\nmedium\nwhite onion\n, finely diced (about\n1\ncup\n)\n1/2\ncup\nfinely minced fresh cilantro leaves and tender stems\n1\ncup\nbasic salsa verde\nor your favorite\nsalsa\n3\nto\n4\nlimes\n, cut into\n8\nwedges\neach\nDirections\nPlace chiles in a large saucepan over medium high heat and cook, turning chiles occasionally, until puffed, pliable, lightly browned in spots, and very aromatic, about 5 minutes. Add chicken stock (it should boil immediately), then pour contents of pan into a small bowl. Cover loosely and set aside.\nSerious Eats / Melissa Hom\nWipe out saucepan, add oil, and return to medium-high heat until oil is shimmering. Add cumin, oregano, and achiote and cook, stirring frequently, until aromatic but not browned, about 30 seconds. Add chipotle chile and sauce and cook until aromatic, about 30 seconds longer. Add vinegar, salt, and sugar and remove from heat.\nSerious Eats / Melissa Hom\nScrape contents of saucepan into a blender along with garlic and chiles with their soaking liquid. Blend on high speed until completely smooth, about 1 minute, scraping down sides as necessary. Set sauce aside to cool slightly.\nSerious Eats / Melissa Hom\nUsing a very sharp chef's knife or slicing knife, slice pork sirloin as thin as possible. If necessary, place meat in freezer for 15 minutes to firm it up. Split the sides of a heavy duty zipper-lock bag. Place one slice of meat inside bag and pound with the bottom of a heavy 8-inch skillet or a meat pounder until less than 1/4-inch thick. Transfer to a large bowl. Repeat with remaining meat.\nSerious Eats / Melissa Hom\nAdd marinade to bowl and toss with hands until every piece of meat is evenly coated in marinade.\nSerious Eats / Melissa Hom\nLine the bottom of a disposable aluminum loaf pan with a layer of bacon. Add a layer of thin-sliced marinated meat. Continue layering in bacon and meat until all the meat is used. (It may pile above the pan a little bit. This is ok.) Cover tightly with plastic wrap and refrigerate for at least 4 hours and up to 36.\nSerious Eats / Melissa Hom\nTo cook indoors\n: Preheat the oven to 275°F. Uncover aluminum loaf pan and place on a foil-lined rimmed baking sheet. Transfer to oven and cook until meat is completely tender (It will drip lots of fat), about 4 hours. Remove from oven, allow to cool slightly, cover with aluminum foil, and refrigerate for at least 2 hours and up to overnight.\nSerious Eats / Melissa Hom\nTo cook outdoors\n: Light half a chimney of charcoal and allow to preheat until coals are mostly covered in gray ash. Spread out under one half of coal grate, and place cooking grate on top. Alternatively, set one set of burners on a gas grill to low and leave the remaining burners off. Unwrap aluminum loaf pan and place directly over cooler side of grill, placing a drip pan underneath if desired. Cover grill and cook until loaf registers 180 to 190°F in the center, about 4 hours, adding more coals to grill or adjusting burners as necessary to maintain an air temperature of around 275°F for the duration of cooking. Remove from grill, allow to cool slightly, cover with aluminum foil, and refrigerate at least 2 hours and up to overnight.\nTo Serve:\nPreheat oven to 350°F. Remove cooked meat from aluminum tray, scraping off any fat or jellied juices from its sides. Use a spoon to collect fat and juices from tray, reserving each separately. Using a sharp chef's knife or slicing knife, slice meat as thinly as possible to create fine shavings of meat and fat. Transfer to a bowl.\nSerious Eats / Melissa Hom\nIf fat from meat is solid, heat gently in the microwave or in the oven until melted. Transfer pineapple pieces to a rimmed baking sheet lined with aluminum foil. Brush with fat. Transfer to oven and roast until completely tender, about 25 minutes. Remove from oven and allow to cool slightly.\nSerious Eats / Melissa Hom\nAbout 10 minutes before pineapple is done roasting, transfer meat and 1 tablespoon of fat to a large cast iron or non-stick skillet. Heat over medium-high heat, stirring occasionally, until meat crisps and deeply browns in spots. Add any reserved juices and toss to combine, allowing it to cook until reduced to a moist glaze. Transfer meat to a warmed serving bowl.\nSerious Eats / Melissa Hom\nChop roasted pineapple into large chunks. Serve meat and pineapple immediately with warmed tortillas, onion, cilantro, salsa, and lime wedges. Meat will be very moist and should be packed into double-stacked tortillas for serving.\nSerious Eats / Melissa Hom\nSpecial Equipment\nBlender\n, disposable aluminum loaf pan\nRead More\nTacos Árabes (Pita-Wrapped, Cumin-Marinated-Pork Tacos)\nTacos de Castacán Con Queso (Yucatecan Pork Belly and Cheese Tacos)\nNo-Waste Tacos de Carnitas With Salsa Verde\nCinco de Mayo\nGrilled Pork\nMexican\nRoasted Pork\nPineapple"
}