{
  "url": "https://www.seriouseats.com/taco-soup-recipe-8776983",
  "image_url": "https://www.seriouseats.com/thmb/a3lbx58mw73G0LFRJ-5Mg9ubTQ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250102-SEA-TacoSoup-FredHardy-Hero-31-41aab51cc4484633b8441931d8c980f9.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Mains",
    "Southwestern & Tex Mex",
    "Ground Beef"
  ],
  "title": "Taco Soup",
  "full_text": "Taco Soup\nClose\nJump to recipe\nCook\n75 mins\nTotal\n75 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Soup:\n1\nsmall\nyellow onion\n(6\nounces;\n170\ng\n), peeled\nTwo\n5- to 6-inch\nCubanelle\nchiles\nor\nbanana peppers\n(3\nounces\neach;\n85\ng\neach)\n4\nmedium\ngarlic cloves\n, unpeeled\n2\nsmall\njalapeño peppers\n(\n2\nounces\n;\n60\ng)\n, divided\nTwo\n14.5-ounce (\n41\n1g\n)\ncans\nfire-roasted diced tomatoes,\nundrained, divided\n2\ntablespoons\n(3\n0ml)\nneutral cooking oil such as vegetable or\ncanola oil\n2 1/2\ntablespoons\nh\nomemade taco seasoning\nor store-bought\ntaco seasoning\n(\n21\ng\n)\n1 1/2\npounds\n(\n680\ng)\nground beef,\n93% lean\n2\ntablespoons\n(\n30\nml)\ntomato paste\n5\ncups\n(\n1.2\nL)\nhomemade chicken stock\nor store bought lower-sodium\nchicken broth\nTwo\n15.5-ounce\n(\n439\ng\n)\ncans pinto beans\n, drained and rinsed\n1\ncup\nfrozen corn\n(5\nounces\n;\n140\ng\n)\n1/2\ncup\ncrushed\ntortilla chips\n(\n1\nounce\n;\n30\ng\n), plus whole chips for topping\n2\nteaspoons\nDiamond Crystal\nkosher salt,\ndivided, plus more to taste; for table salt, use half as much by volume\nFor the Salsa:\n10\nounces\nfresh tomatoes\n(\n285\ng;\nabout\n3\nmedium\n), seeded and chopped\n(1\ncup)\n1/4\ncup\nchopped\nfresh cilantro\n(1 ounce; 29g)\n1\ntablespoon\n(1\n5ml)\nfresh\nlime juice\nfrom 1 lime\n6\nounces\n(170\ng)\nmedium\nCheddar cheese\n, shredded (about\n1 1/2\ncups)\nDirections\nFor the Soup:\nHalve onion. Cut 1 onion half through root end to create two quarters. Set aside remaining onion half.\nSerious Eats / Fred Hardy\nHeat a large cast-iron skillet over high until hot and just smoking. Place the 2 onion quarters, Cubanelle chiles or banana peppers, garlic, and 1 of the jalapeños in hot skillet; cook, turning occasionally, until onion, garlic, and chiles are blistered and charred in spots, 3 to 8 minutes for garlic and onions and 5 to 10 minutes for chiles. Use tonga to transfer to a plate as they finish cooking; set aside, and let cool slightly, about 10 minutes.\nSerious Eats / Fred Hardy\nPeel garlic and discard skins. Remove and discard stems, skins, and seeds from chiles. Transfer the charred onion, peeled garlic, and peeled chiles to a blender, along with 1 can of the tomatoes. Process until smooth, about 30 seconds; set aside.\nIn a large Dutch oven, heat oil over medium heat until shimmering. Add taco seasoning; cook, stirring constantly, until fragrant and sizzling, about 45 seconds. Add ground beef, and increase heat to high. Cook, stirring and breaking up meat with a wooden spoon, until browned, about 3 to 6 minutes. Add tomato paste; cook, stirring constantly, until tomato paste fully coats and slightly thickens beef mixture, about 1 to 2 minutes. Stir in stock, puréed chile-garlic mixture, beans, corn, crushed tortilla chips, 1 1/2 teaspoons of the salt, and remaining 1 can tomatoes. Bring to a simmer over medium-high heat; reduce heat to medium, and cook, maintaining a simmer and stirring occasionally, until flavors meld, about 10 minutes. Season with additional salt to taste, if desired.\nSerious Eats / Fred Hardy\nFor the Salsa:\nWhile soup is simmering, adjust oven rack to middle position and preheat broiler in oven. Chop the remaining onion half to equal 1/4 cup; finely chop remaining jalapeño chile to equal 1 tablespoon. (Reserve any remaining onion and jalapeño chile for another use.) In a small bowl, stir together measured chopped onion, jalapeño chile, fresh tomatoes, cilantro, lime juice, and remaining 1/2 teaspoon salt.\nSerious Eats / Fred Hardy\nUsing a ladle, divide soup evenly among 6 broiler-safe soup bowls, and place on a rimmed baking sheet. Top each bowl with a few whole tortilla chips and 1/4 cup cheese. Broil until cheese is melted, about 2 minutes. Top with prepared tomato-chile salsa before serving.\nSerious Eats / Fred Hardy\nSpecial Equipment\nLarge cast iron skillet, blender, large Dutch oven, 6 broiler-safe soup bowls\nMake-Ahead and Storage\nThe soup can be cooked through step 4, cooled and refrigerated in an airtight container for up to 4 days. To serve soup, reheat until simmering on the stovetop, then continue with step 4 in the recipe.\nSoups\nThe Latest\nMains\nSouthwestern & Tex Mex\nGround Beef"
}