{
  "url": "https://www.seriouseats.com/tacu-tacu-peruvian-rice-and-beans-cake-recipe-7229046",
  "image_url": "https://www.seriouseats.com/thmb/trUkovmZBP-USomb_AoJFXcLYQg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230308-SEA-TacuTacu-AmandaSuarez-14-c35f9084c37743989224a64c046d1091.JPG",
  "tags": [
    "The Latest",
    "White Rice",
    "Beans",
    "Stovetop Beans",
    "Rice & Grains"
  ],
  "title": "Tacu Tacu (Peruvian Rice and Bean Cake)",
  "full_text": "Tacu Tacu (Peruvian Rice and Bean Cake)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n3 hrs 50 mins\nSoaking Time\n8 hrs\nTotal\n12 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beans:\n1\npound\n(\n454\ng\n)\nmayocoba beans\n(also known as canary and peruano)\nKosher salt\n1\ntablespoon\n(\n15\nml\n) vegetable or other\nneutral oil\n1\nrasher\nthick-cut bacon\n, sliced into 1/4-inch pieces (optional)\n1\nsmall\nred onion\n(about\n6\nounces\n;\n170\ng\n), finely diced\n1\ntablespoon\n(\n15\nml\n)\nachiote paste\n1\ntablespoon\n(\n15\nml\n)\nají amarillo paste\n1/2\nteaspoon\ndried oregano\nFor the Rice:\n1\ntablespoon\n(\n15\nml\n) vegetable or other\nneutral oil\n2\nmedium\ncloves garlic\n, finely minced\n1\ncup\nlong-grain rice\n(\n6 1/2\nounces\n;\n185\ng\n), well rinsed and drained\n1 1/4\ncups\n(\n296\nml\n)\nwater\nKosher salt\nFor the Zarza:\n1\nsmall\nred onion\n(about\n6\nounces\n;\n170\ng\n), thinly sliced\n1\nají amarillo\npepper\n, stemmed, seeded, and julienned (optional)\n1/4\ncup\nroughly chopped cilantro\nleaves and tender stems\nJuice\nof\n1\nlime\nExtra-virgin olive oil\n, for drizzling\nSalt\nand freshly ground black pepper\nPinch\nground cumin\nFor One Tacu Tacu Cake:\n1\ncup\ncooked beans\nwith their creamy liquid\n1 to 1 1/2\ncups\ncooked rice\n2\ntablespoons\n(\n30\nml\n) vegetable or other\nneutral oil\nDirections\nFor the Beans:\nIn a large bowl, cover beans with at least 2 inches cold water. Stir in 2 teaspoons salt and let soak at room temperature for at least 8 and up to 24 hours.\nTransfer beans and their soaking liquid to a large pot, then top up with enough water to cover by about 2 inches. Bring to a boil, then reduce heat and cook at a simmer, stirring occasionally, until beans are very soft and creamy and enough have broken down that the cooking liquid has thickened to a creamy glaze, about 3 hours; add additional water, if needed at any point, to prevent the beans from becoming overly dry. Season with salt, if needed.\nSerious Eats / Amanda Suarez\nIn a small skillet, heat oil over medium heat. Add bacon (if using), and cook, stirring, until fat begins to render, about 2 minutes. Add onion and cook, stirring, until onion has softened, about 5 minutes. Stir in achiote paste, ají amarillo paste, and dried oregano, and cook for 2 minutes. Stir onion mixture into beans. Set aside.\nSerious Eats / Amanda Suarez\nFor the Rice:\nIn a 2-quart saucepan, heat oil and garlic over medium heat until garlic is fragrant and has lost its raw smell but not browned, about 1 minute. Add rice and cook, stirring, until coated in oil and heated through, 1 to 2 minutes. Add water, bring to a boil, then cover, reduce heat to low, and cook until water is absorbed and rice is tender, 15 minutes. Fluff rice, season lightly with salt, then cover and let stand for 10 minutes.\nSerious Eats / Amanda Suarez\nFor the Zarza:\nIn a small bowl, toss sliced onion with the ají amarillo pepper, and cilantro. Just before serving, toss with lime juice, a few drops of olive oil, salt and pepper, and ground cumin.\nSerious Eats / Amanda Suarez\nFor One Tacu Tacu Cake:\nIn a small bowl, stir together beans with their creamy cooking liquid and rice; how much rice you add will depend on how thick the bean cooking liquid has become (the thicker it is, the less rice you will need to thicken it) and personal preference. In an 8- or 10-inch nonstick skillet, heat oil over medium-high heat until shimmering. Add rice-and-bean mixture, press into a flat, round shape, and cook, using a spatula to press and pack the mixture into a thick disc shape, until tacu tacu is browned on first side, about 6 minutes.\nSerious Eats / Amanda Suarez\nFlip tacu tacu (either by inverting a plate over the skillet, flipping the tacu tacu onto the plate, and the sliding it back into the skillet, or by launching it into the air and catching it back in the skillet, if you're confident in your flipping skills). Continue to cook, using the spatula to press the tacu tacu into a disc shape. Slide tacu tacu onto a plate and serve with zarsa and any sides of your choice (such as a fried egg, fried plantains, a seared or fried steak, or some leftover stew). Repeat with remaining rice and beans, if desired, to make more tacu tacu as desired.\nSerious Eats / Amanda Suarez\nMake-Ahead and Storage\nThe beans and rice can be made ahead and refrigerated separately for up to 5 days (that it, after all, what normally happens with the leftovers used to make tacu tacu).\nThe Latest\nWhite Rice\nBeans\nStovetop Beans\nRice & Grains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tacu-tacu-peruvian-rice-and-bean-cake.webp?"
}