{
  "url": "https://www.seriouseats.com/taiwanese-deep-fried-squid-balls-recipe-5218071",
  "image_url": "https://www.seriouseats.com/thmb/HYIGI-vDzwbWAulUaSJ0cxwxtKI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220228-deep-fried-squid-balls-vicky-wasik-24-b74bb5adc4dd4e0299479c26b9dd0969.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Fried Seafood",
    "Squid",
    "The Latest"
  ],
  "title": "Taiwanese Deep-Fried Squid Balls Recipe",
  "full_text": "Taiwanese Deep-Fried Squid Balls Recipe\nClose\nJump to recipe\nPrep\n60 mins\nCook\n60 mins\nChilling Time:\n4 hrs\nTotal\n6 hrs\nServes\n3\nto 4 servings\nMakes\n15 large squid balls\nCook Mode\n(Keep screen awake)\nIngredients\n12\nounces\n(340g)\ncleaned squid bodies\n(about 4 medium squid), cut into 1-inch squares, divided\n2 1/3\nounces\n(75g) skinless fatty pork belly or\npork fatback\n, cut into 1-inch cubes\n1 1/2\nteaspoons\n(6g)\ngranulated sugar\n3\nteaspoons\n(9g) Diamond Crystal\nkosher salt\n, plus more to taste; for table salt use half the volume or the same weight\nScant\n1/2\nteaspoon\nground white pepper\n, plus more to taste\n1/4 cup plus 3 tablespoons (\n55\ng\n) sweet potato or\ntapioca starch\n1\nounce\n(28g)\nice\n(about 1 ice cube)\n6\ncups\npeanut, canola, or other\nneutral oil\n, for deep-frying\nDirections\nRinse the squid under running water, then pat dry with paper towels.\nSerious Eats / Vicky Wasik\nMince 1 ounce of the squid, transfer to an airtight container, and refrigerate.\nSerious Eats / Vicky Wasik\nIn a medium bowl, thoroughly mix the remaining squid with the pork, sugar, salt, and ground white pepper. Cover tightly and freeze until partially frozen, about 2 hours.\nSerious Eats / Vicky Wasik\nIn a high-powered blender or food processor, combine the partially frozen pork and squid mixture with sweet potato starch and ice and process on high-speed, scraping down the sides as necessary, until it forms a smooth, sticky, shiny paste, about 3 minutes; it should be completely smooth with no visible lumps of squid or pork or shards of ice.\nSerious Eats / Vicky Wasik\nTransfer the paste to a large bowl or container and stir in the refrigerated minced squid until evenly incorporated. Cover and refrigerate for at least 2 or up to 8 hours.\nSerious Eats / Vicky Wasik\nBring a large pot of water to a simmer over medium-low heat until tiny bubbles begin to break on the surface of the water. Turn off the heat. Using wet (preferably latex-gloved) hands, grab a handful of the paste and squeeze it up through a hole formed by your index finger and thumb (like making the \"okay\" gesture) until a golf-ball size ball forms, then squeeze to pinch the ball off and release into the water; make sure to squeeze tightly when shaping the balls to minimize air pockets. Alternatively, using a wet spoon, scoop out golf-ball-size portions of the squid paste mixture and, using a second wet spoon, gently form into a rough ball shape before releasing into the water. When all the squid balls are in the water, turn the heat up to high and bring to a rolling boil, then lower the heat to maintain a brisk simmer and cook until balls are completely cooked through, about 5 minutes. Drain the squid balls in a colander and shake to dry. Transfer to a paper towel–lined plate and thoroughly pat dry with additional paper towels (it’s important to dry the squid balls as much as possible to avoid splattering when frying). Let air-dry for 15 minutes before frying.\nSerious Eats / Vicky Wasik\nIn a wok or Dutch oven, heat oil over high heat until it reaches 375°F (190°C). Using a spider-skimmer, carefully lower half of the squid balls into the oil. The oil temperature should drop when you add the squid balls; adjust the heat to maintain a frying temperature of 350°F (175°C). Deep-fry, stirring often and carefully breaking apart any balls that have stuck together, until balls are beige and slightly crisp around the edges, about 4 minutes; be careful, as squid balls can pop and spatter during frying. Transfer squid balls to paper towels to drain and repeat with remaining balls.\nSerious Eats / Vicky Wasik\nReturn oil to 375\n°\nF (190°C), then add half of the fried squid balls back to oil and fry a second time, maintaining a temperature of 350\n°\nF (175°C), until squid balls turn a light golden brown, about 2 minutes. Transfer squid balls to fresh paper towels to drain and repeat with remaining squid balls.\nSerious Eats / Vicky Wasik\nSeason squid balls with ground white pepper and additional salt, if desired. Serve hot.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nWok\n, high-powered\nblender\nor\nfood processor\n, spider-skimmer\nMake-Ahead and Storage\nDeep-fried squid balls can be frozen in a freezer bag for up to 3 months. Reheat in an oven set at 400°F (200°C) or in a microwave.\nSnacks & Appetizers\nFried Seafood\nSquid\nThe Latest\nThe Wok\nWhy The Wok?\nEssays & Profiles\nWok Recipes\nWok Skills 101\nWok Skills 102\nThe Wok Gear Guide\nThe Importance of the Wok\nQ&A: Grace Young & Her Woks\nFrom China: The Future of the Wok\nSan Francisco's Iconic Wok Shop\nExcerpt: The Science of Woks\nDim Sum–Style Steamed Pork Ribs\nTofu With Peas and Silky Egg\nSichuan Stir-Fried Potatoes\nChinese Scrambled Eggs With Tomato\nTaiwanese Deep-Fried Squid Balls\nThai Chicken and Curry Stir-Fry\nJapanese Shrimp in Chili Sauce\nStir-Frying\nDeep-Frying\nBraising\nSteaming\nSmoking\nPassing-Through\nEssential Knife Skills for Wok Cooking\nSetting Up a Wok Cooking Station\nHow to Season Your Wok\nHacking Wok Hei at Home\nBest Flat-Bottomed Woks\nThe Best Torches for Wok Hei\nThe Full Wok Accessory Guide\nOutdoor Wok Burners Picks"
}