{
  "url": "https://www.seriouseats.com/taiwanese-master-braise-recipe-11686462",
  "image_url": "https://www.seriouseats.com/thmb/thntZH9IgVhATgn3nfDQFOZoMhQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250224-SEA-Taiwanese-Braising-Liquid-TwoBites-hero-35cea81279424470a1c665622a4e6f82.jpg",
  "tags": [
    "Beef",
    "The Latest",
    "Stovetop Beef",
    "East Asian",
    "Asian"
  ],
  "title": "Taiwanese Braising Liquid",
  "full_text": "Taiwanese Braising Liquid\nClose\nJump to recipe\nPrep\n30 mins\nCook\n3 hrs 45 mins\nSoaking and Chilling Time\n2 hrs 30 mins\nTotal\n6 hrs 45 mins\nServes\n5\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n2\nounces\n(\n60\ng\n) dried\nkombu\n, cut into eight 3- by 5-inch pieces\n2\npounds\nboneless\nbeef shanks\n(\n32\nounces\n;\n906\ng\n)\n7\nounces\n(\n198\ng\n) extra-firm\ntofu\n, cut into 1/2-inch wide strips\n5\nhard boiled eggs\n, peeled\n1\ncup\n(\n240\nml\n)\nsoy sauce\n, such as Kimlan or Kikkoman\n6\ntablespoons\nTaiwanese soy paste or\noyster sauce\n(\n1 1/2\nounce\n;\n42\ng\n)\n6\ntablespoons\n(\n45\nml\n) Taiwanese rice wine, also known as mijiu or cooking\nsake\n60\ng\ngranulated sugar\n4\nmedium\ncloves garlic\n(about\n3/4\nounce\n;\n20\ng\n), peeled and smashed\n4\nwhole\nscallions\nTwo\n1-inch pieces\nfresh ginger\n(about\n3/4\nounce\n;\n20\ng\n), unpeeled and sliced\n4\nstar anise\nTwo\n2-inch long\ncinnamon sticks\n2\ndried tangerine or mandarin\norange peel\ns, each about the size of a quarter\nTo Serve:\nToasted sesame oil\nFresh cilantro\nDirections\nIn a large bowl, cover dried kombu with water, and soak until pliable, about 30 minutes. Lift kombu out of the bowl; reserve liquid for another use. (See notes below for suggestions on using the reserved liquid.) If rehydrated kombu pieces are more than 12 inches (30 cm) long, cut each in half cross-wise. Lay kombu pieces on cutting board, roll each piece tightly, and pierce a toothpick through each roll to secure; set aside.\nSerious Eats / Two Bites\nIn a large pot, combine beef shanks with enough water to cover. Bring water to a boil over high heat, then reduce heat to medium and simmer until the beef lightens in color, about 5 minutes. Using a colander, drain beef shanks, and rinse beef under cool running water to rid meat of any scum. Set aside.\nSerious Eats / Two Bites\nUsing a toothpick, cake tester, or skewer, poke multiple holes all the way through each strip of tofu. (There’s no such thing as too many holes, but aim for about 10 per strip. The holes will help the bean curd absorb the braising liquid.)\nSerious Eats / Two Bites\nIn a large pot, bring 10 cups (2.4L) water to a rolling boil over high heat. Add the soy sauce, soy paste or oyster sauce, rice wine, sugar, garlic, scallions, ginger, star anise, cinnamon, and tangerine peels, followed by the beef.\nSerious Eats / Two Bites\nCover and bring to a boil. Reduce heat to medium-low and gently simmer, turning the beef occasionally to ensure it’s exposed to the braising liquid on all sides, until beef is tender and a knife can easily pierce the meat with little to no resistance, 2 to 3 hours. Remove from heat.\nSerious Eats / Two Bites\nUsing tongs, carefully place beef shank in a large food-safe container. Add enough braising liquid to keep the beef submerged; leave remaining braising liquid in the pot. (You may have to cut the beef shank in half and store it in two separate containers.) Let cool to room temperature, about 40 minutes, then cover and refrigerate.\nSerious Eats / Two Bites\nAdd rehydrated kelp and bean curd to the pot with the remaining braising liquid. Cover and slowly simmer over low heat until the kelp is tender but still chewy, about 30 minutes. Using tongs, carefully remove kelp and place in a medium food-safe container; set aside. Let cool, about 40 minutes, then refrigerate.\nSerious Eats / Two Bites\nRemove braising liquid from heat and add eggs. Let braising liquid cool, uncovered, to room temperature, 1 to 2 hours, then remove eggs and tofufrom the pot and set aside on plate. Using a fine-mesh sieve, strain braising liquid into a large, clean bowl. Discard solids; reserve the liquid.\nSerious Eats / Two Bites\nRemove kelp from refrigerator and uncover container. Lightly dress kelp with 1/4 cup braising liquid. (The kelp should only be lightly dressed with the braising liquid; it might disintegrate if soaked in it for too long.) In a separate medium container, combine the bean curd and eggs, and top with enough braising liquid to cover completely.\nSerious Eats / Two Bites\nRefrigerate beef shanks, kelp, bean curd, and eggs until fully chilled, about 2 hours. Refrigerate or freeze excess braising liquid in an airtight container.\nSerious Eats / Two Bites\nTo Serve:\nThinly slice beef shank against the grain into 1/4-inch slices. Remove the toothpicks from the kelp, and cut kelp cross-wise into strips that are 1-inch (2 1/2-cm) thick. Slice the bean curd into 1/2-inch (1-cm) thick pieces. Halve eggs. Arrange ingredients neatly on a serving platter. Spoon a bit of the braising liquid all over, then drizzle with sesame oil to taste. Garnish with cilantro.\nSerious Eats / Two Bites\nSpecial Equipment\nLarge pot, tongs, fine-mesh sieve, food-safe containers, toothpicks\nNotes\nThis dish is typically served at room temperature or cold. Leftover kombu soaking liquid can be used as stock for soups.\nMake-Ahead and Storage\nOnce strained and cooled, the braising liquid can be refrigerated in an airtight container for up to 1 week or frozen for 3 months.\nBeef\nThe Latest\nStovetop Beef\nEast Asian\nAsian"
}