{
  "url": "https://www.seriouseats.com/taiwanese-oyster-omelet-recipe",
  "image_url": "https://www.seriouseats.com/thmb/jnE0BBjDp4Wub-0totZnHabR9eQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__09__20130927-taiwan-eats-oyster-omelet-finished-85f523c6e91846b1be9ce2ace79b50a6.jpg",
  "tags": [
    "Breakfast & Brunch",
    "Stovetop Eggs",
    "Scrambled Eggs",
    "Oysters",
    "Snacks & Appetizers"
  ],
  "title": "Taiwanese Oyster Omelet Recipe",
  "full_text": "Taiwanese Oyster Omelet Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n10 mins\nTotal\n15 mins\nServes\n1\nto 2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Sauce:\n1/4\ncup\nketchup\n1/4\ncup\nrice vinegar\n1\ntablespoon\nsugar\n1\ntablespoon\nsoy sauce\n1/2\nteaspoon\nred miso paste\n1\nteaspoon\ncornstarch\n1/2\ncup\ncold\nwater\nFor the Omelet:\n2\neggs\n1/4\nteaspoon\nsalt\nPinch\nground white pepper\n1\nteaspoon\nsweet potato starch\n(see note)\n1/4\ncup\ncold\nwater\n1\ntablespoon\nvegetable, peanut, or\ncanola oil\n3 to 4\nraw oysters\n1\nscallion\n, chopped\n1/4\ncup\ncelery leaves\n, roughly torn or chopped\nDirections\nFor the Sauce:\nCombine ketchup, vinegar, sugar, soy sauce, and miso paste in a small saucepan over medium-low heat. Cook, stirring, until sugar dissolves, about 2 minutes. In a separate bowl, whisk together cornstarch with 1/2 cup cold or room-temperature water. Whisk cornstarch mixture into ketchup mixture and cook, stirring, until bubbling and thickened, about 1 minute. Remove from heat and set aside.\nFor the Omelet:\nCombine eggs, salt, and white pepper in a medium bowl and whisk lightly. Combine sweet potato starch and 1/4 cup cold or room-temperature water in a small bowl and mix thoroughly.\nHeat the oil in a medium non-stick skillet over medium-high heat until shimmering. Add the oysters and cook, stirring, for 30 seconds. Add the egg mixture and cook, pushing in the edges occasionally and tilting the pan to let raw eggs run under the omelet, continuing to cook until most of the eggs are cooked but top surface is still moist. Mix the sweet potato starch mixture once more and pour it over the eggs, letting it run across the surface and spill over the edges slightly. Place the scallions and celery greens on top of omelet. Reduce heat to medium-low and cover the pan briefly to allow the greens to slightly wilt, about 1 minute.\nLoosen the omelet by poking at its sides and giving it a shake to ensure that it moves easily. Carefully flip omelet using two spatulas or by thrusting the pan forward and jerking it back. Cook on second side until eggs are set, just a few seconds. Invert the omelet onto a serving dish. Ladle the sauce generously over it, and serve immediately.\nSpecial Equipment\n8-inch nonstick skillet, 3-quart saucier\nNotes\nPre-shucked oysters can be used in place of live ones. Sweet potato starch can be found in most Asian grocery stores or can be ordered online from Amazon.\nRead More\nLu Rou Fan (Taiwanese Meat Sauce with Rice)\nTaiwanese Pork Belly Buns (Gua Bao)\nTaiwanese Deep-Fried Squid Balls\nBreakfast & Brunch\nStovetop Eggs\nScrambled Eggs\nOysters\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/taiwanese-oyster-omelet-recipe.webp?"
}