{
  "url": "https://www.seriouseats.com/taiwan-eats-turkey-rice-with-or-without-leftovers-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Yqp3Dp5KTs7akZJfZ4s4nNLvQRg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/taiwan-eats-turkey-rice-with-or-without-leftovers-recipe-photo-06-1-FredHardy-be49c29d3a184275b60ab7bb9f793b7e.jpg",
  "tags": [
    "Turkey Mains",
    "Asian",
    "Rice & Grains",
    "Turkey"
  ],
  "title": "Taiwanese Turkey Rice Recipe",
  "full_text": "Taiwanese Turkey Rice Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n70 mins\nActive\n45 mins\nCooling Time\n15 mins\nTotal\n90 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n)\nbone-in turkey pieces\n, such as the breast or legs, breasts cut through the bone into large chunk, legs divided into drumsticks and thighs (see note)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\n1/2\nteaspoon\nwhite pepper\n, divided\n1/4\ncup\n(\n60\nml\n)\nvegetable oil\n2\nshallots\n(\n85\ng\n), thinly sliced\n1/2\ncup\n(\n120\nml\n)\nwater\n1\nteaspoon\n(\n4\ng\n)\nsugar\n1\nteaspoon\n(\n5\nml\n)\nsoy sauce\n1\ntablespoon\n(\n7\ng\n) Sichuan\npeppercorns\nFresh cilantro\nleaves, for garnish\nCooked white rice\n,\nfor serving\nDirections\nRub the turkey with 1/4 teaspoon each of the salt and white pepper. Choose a large pot with a lid, such as a Dutch oven, and place a steamer rack inside. Fill the pot with 2 cups (475ml) of water. Place the turkey on a dish that fits inside the pot and sits atop the steamer rack. (In order to save the turkey drippings, the turkey should not be placed directly on a rack with holes.) Bring water to a boil, then reduce to a simmer and cover the pot. Steam the turkey until its internal temperature close to the bone reaches 180°F (82°C), about 30 minutes. Let cool. Reserve the juices and drippings.\nSerious Eats / Fred Hardy\nOnce the turkey meat has cooled, pull the meat into bite-size shreds by hand and discard the bones and skin.\nSerious Eats / Fred Hardy\nHeat the vegetable oil in a small pot over medium-high heat until shimmering. Add the sliced shallots and cook, stirring, until golden brown, about 3 minutes. Transfer immediately to a paper towel-lined plate. Reserve the cooking oil.\nSerious Eats / Fred Hardy\nCombine the shallot cooking oil with 1/2 cup (120ml) of reserved juices and drippings from the steamed turkey. Add water, sugar, soy sauce, Sichuan peppercorns, and remaining 1/4 teaspoon each of salt and white pepper. Add half of the fried shallots, saving the rest for garnish. Whisk mixture over medium heat to dissolve sugar. Bring to a gentle boil and simmer, uncovered until sauce is reduced by half, about 30 minutes. Strain sauce and discard solids.\nSerious Eats / Fred Hardy\nTo serve, scoop rice into individual serving bowls and top with a mound of the shredded turkey meat. Spoon the sauce over each bowl. Finish with the fried shallots and cilantro for garnish.\nSerious Eats / Fred Hardy\nSpecial Equipment\nDutch oven\n, steamer rack\nNotes\nTo prepare this dish using leftover Thanksgiving turkey meat, skip step 1 and substitute the raw turkey with 2 cups packed, pre-roasted turkey meat and 1/2 cup (120ml) of its reserved drippings.\nTurkey Mains\nAsian\nRice & Grains\nTurkey"
}