{
  "url": "https://www.seriouseats.com/taiwan-eats-braised-cabbage-dried-shrimp-chilies-shiitake-mushroom-recipe",
  "image_url": "https://www.seriouseats.com/thmb/AyIlF6h3Ye_eE3YM9yjnMg-wWjQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__02__021014-taiwan-eats-braised-cabbage-finished-b4bce0f5fb244c2fa4f0bdf6f7cf8732.jpg",
  "tags": [
    "Chinese",
    "Braised & Stewed Vegetables",
    "Shrimp",
    "Cabbage",
    "Shiitake Mushroom"
  ],
  "title": "Taiwanese Braised Cabbage With Dried Shrimp, Chiles, and Shiitake Mushrooms Recipe",
  "full_text": "Taiwanese Braised Cabbage With Dried Shrimp, Chiles, and Shiitake Mushrooms Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n10 mins\nSoaking Time\n30 mins\nTotal\n50 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4 to 5\ndried shiitake\nmushrooms\n2\ntablespoons\ndried baby shrimp\n1\nhead\nTaiwanese cabbage\n(or substitute with green or Savoy cabbage), about\n2\npounds\n(see notes)\n2\ntablespoons\nvegetable, peanut, or\ncanola oil\n3\nmedium\ncloves garlic\n, minced (about\n1\ntablespoon\n)\n2\nsmall\n,\nfresh red chiles\n, such as Thai chiles, thinly sliced\n1/4\nteaspoon\nwhite pepper\nKosher salt\nDirections\nSoak dried shiitake mushrooms in 2 cups water until all mushrooms are soft throughout, about 20 minutes. Reserve soaking liquid (strain out any crumbs or solids at the bottom if necessary). Squeeze out mushrooms and remove stems. Slice caps thinly and set aside.\nSoak dried baby shrimp in just enough water to cover until slightly soft and moist, about 10 minutes. Drain and set aside.\nSlice cabbage head in halves, then quarters. Cut out tough stem portions and discard. Coarsely shred remaining leaves.\nHeat oil in a large pan or wok with a lid over medium-high heat. Add garlic, chiles, dried shrimp, and sliced shiitake mushrooms. Stir until very fragrant, about 1 minute.\nAdd cabbage to pan along with white pepper and a pinch of salt. Toss occasionally, until its volume has decreased slightly and oil and other ingredients are incorporated throughout, 1 to 2 minutes.\nPour in reserved soaking liquid from mushrooms and stir. Cover pan, reduce heat slightly, and cook at a steady simmer for 5 to 6 minutes. Check on the dish; once leaves are fully wilted and translucent, remove lid. Taste and season with salt as desired. Remove from heat and serve immediately.\nNotes\nLook for Taiwanese cabbage, with its broad, flattened heads and softer, sweet leaves, in Asian produce markets.\nChinese\nBraised & Stewed Vegetables\nShrimp\nCabbage\nShiitake Mushroom"
}