{
  "url": "https://www.seriouseats.com/taiwanese-pork-chop-recipe-8774522",
  "image_url": "https://www.seriouseats.com/thmb/tXyykOHsm91XgN9WGAG8XoDx9b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250114-TaiwaneseBraisedPorkChops-DeliStudios-09-da5c8f61c4b240fe903285d2a7fe0307.jpg",
  "tags": [
    "Pork",
    "The Latest",
    "Braised & Stewed Pork",
    "East Asian"
  ],
  "title": "Taiwanese Fried and Braised Pork Chops",
  "full_text": "Taiwanese Fried and Braised Pork Chops\nClose\nJump to recipe\nPrep\n20 mins\nCook\n25 mins\nMarinating Time\n2 hrs\nTotal\n2 hrs 45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork Chop:\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n, such as Kikkoman or Kimlan\n1\ntablespoon\n(\n15\nml\n) Taiwanese\nrice wine\n(michiu) or cooking sake\n1 1/2\nteaspoons\ngranulated sugar\n1\nteaspoon\ntoasted sesame oil\n1/4\nteaspoon\nwhite pepper\n1/4\nteaspoon\nfive-spice powder\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nmedium\nclove\ngarlic\n(\n5\ng\n), minced\n1\nlarge\negg white\n4\nsmall\nboneless pork loin\nchops (about\n3 to 4\nounces\n; 85 to 113g each)\n4\ncups\n(946ml) canola or\nsoybean oil\n1\ncup\nthick\nsweet potato starch\n(about\n5 3/4\nounces\n;\n160\ng\n), see notes\n2\ncups\n(475ml)\nwater\n1/4\ncup\nplus\n1\ntablespoon\n(\n75\nml\n)\nsoy sauce\n, such as Kikkoman or Kimlan\n1\ntablespoon\n(\n15\nml\n) Taiwanese\nrice wine\n(michiu) or cooking sake\n1\ntablespoon\ngranulated sugar\n(about\n1/2\nounce\n;\n15\ng\n)\nOne\n1-inch piece\nfresh ginger\n(\n10\ng\n), unpeeled and sliced 1/2-inch thick\n3\nmedium\ncloves garlic\n(\n15\ng\n), peeled and smashed\n2\nscallions\n1\nstar anise\n1\ndried tangerine or mandarin\norange peel\n, about the size of a quarter (optional), see notes\n1/4\nteaspoon\npeppercorns\n(optional)\nTo Serve:\nCooked short-grain\nwhite rice\nDirections\nIn a large bowl, whisk soy sauce, rice wine, sugar, sesame oil, white pepper, five-spice powder, salt, garlic, and egg white to combine; set aside.\nSerious Eats / Deli Studios\nPlace one pork chop on a clean cutting board and, using the ridged side of a meat mallet or blunt side of a Chinese cleaver, pound pork chops gently to 1/2-inch thickness. Set aside and repeat with remaining pork chops.\nSerious Eats / Deli Studios\nAdd pork chops to the soy sauce mixture, massaging and tossing the pork to evenly coat with marinade. Cover tightly with plastic wrap or a lid and refrigerate for at least 2 hours or up to 8 hours.\nSerious Eats / Deli Studios\nWhen ready to cook, set a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels; set aside. Heat oil in a wok or medium-size Dutch oven over medium-high heat until oil reaches 350˚F (175˚C) on an instant-read or fryer thermometer.\nSerious Eats / Deli Studios\nIn a wide, shallow dish, add sweet potato starch. Working with 1 pork chop at a time, dredge both sides in sweet potato starch, pressing gently to adhere. Gently shake off excess sweet potato starch and transfer to a large plate. Repeat with remaining chops.\nSerious Eats / Deli Studios\nUsing tongs, add 2 pork chops to hot oil, gently sliding them in as close to the oil’s surface as possible to minimize splashing. Cook until pork is light golden brown, about 2 minutes, adjusting heat as needed to maintain an oil temperature of 350°F (175°C). Using tongs, transfer pork to prepared baking sheet. Using a skimmer or ladle, remove any leftover crumbs from oil. Repeat with the remaining pork chops.\nSerious Eats / Deli Studios\nIn a medium pot, combine water, soy sauce, rice wine, sugar, ginger, garlic, scallions, star anise, tangerine or mandarin peel (if using), and Sichuan peppercorns (if using). Bring to a boil over high heat. Reduce heat to low and allow liquid to slow to a gentle simmer. Using tongs, carefully add 2 deep-fried pork chops, handling gently to ensure breading does not fall off. Cover and simmer until the pork chop is fully cooked and registers 145˚F (63˚C) on an instant thermometer, 4 to 8 minutes. Gently remove chop and set aside. Repeat with the remaining pork chops. Serve with cooked white rice.\nSerious Eats / Deli Studios\nSpecial Equipment\nMeat mallet or Chinese cleaver, wire rack, rimmed baking sheet, wok or Dutch oven, instant-read thermometer, tongs\nNotes\nThick sweet potato starch can be purchased at most Chinese supermarkets. It is coarser than the finely ground kind, helping to create the right kind of crunchy coating on this pork; look for brands that specify between thick and thin sweet potato starch on the label to make sure you have the right type. If you can only find thin, you can use a spray bottle or your hands to lightly dampen the starch, then toss it with your hands so that it clumps up and creates small beads.\nMake-Ahead and Storage\nOnce cooled, the pork chops can be refrigerated in an airtight container for up to 3 days. The chops can be eaten cold, at room temperature, or warm. If you would like to serve them warm, reheat in the microwave until warmed through.\nPork\nThe Latest\nBraised & Stewed Pork\nEast Asian"
}