{
  "url": "https://www.seriouseats.com/tam-khao-pod-kai-kem-corn-salad-with-salted-duck-egg-5205245",
  "image_url": "https://www.seriouseats.com/thmb/3v8wOI1zuF0hUurn_EUWB-iRpDg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210928-tam-khao-pod-thai-corn-salad-vicky-wasik-26-b0443b39085f429287742837177e3914.jpg",
  "tags": [
    "Thai",
    "Corn",
    "Salads",
    "The Latest"
  ],
  "title": "Tam Khao Pod Kai Kem (Thai Corn Salad With Salted Duck Egg)",
  "full_text": "Tam Khao Pod Kai Kem (Thai Corn Salad With Salted Duck Egg)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nCooling Time\n5 mins\nTotal\n25 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n240\nml\n)\nfull-fat coconut milk\n, such as Aroy-D (see note)\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1/2\nteaspoon\ngranulated sugar\n3\nears\nfresh\ncorn\n, shucked\n1\ncooked\nsalted duck egg\n(\n45\ng\n) (see note)\n2\nsmall\ngarlic cloves\n2 to 3\nfresh red or green\nThai chiles\n, stemmed (see note)\n1\ntablespoon\n(\n8\ng\n)\ndried shrimp\n(see note)\n1\ntablespoon\n(\n25\ng\n)\npalm sugar\n, softened (see note)\n4\ncherry tomatoes\n(about\n2\nounces\n;\n60\ng\n)\n2\nlong beans\n(about\n1\nounce\n;\n30\ng\n), ends trimmed, cut crosswise into 1-inch pieces\n2\ntablespoons\nplus\n2\nteaspoons\n(\n40\nml\n) fresh\nlime juice\nfrom\n2\nlimes\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\nCooked\njasmine\nor\nsticky rice\n, for serving\nDirections\nIn a medium Dutch oven, combine coconut milk, salt and granulated sugar. Bring to a boil over medium-high heat, stirring occasionally to help dissolve salt and sugar. Add corn, and use tongs to turn ears until evenly coated on all sides with coconut milk. Reduce heat to medium, cover, and cook, checking and turning occasionally with tongs, until corn is tender, about 6 minutes. Transfer corn to a cutting board and allow to cool slightly; remove coconut milk mixture from heat and reserve.\nVicky Wasik\nOnce corn is cool enough to handle, working with one ear at a time, use a sharp knife to cut kernels off of cob in large planks, rotating ear 90 degrees onto freshly cut side between cuts. Do your best to keep corn pieces as large as possible and not separate into individual kernels. Repeat with remaining ears of corn; discard cobs, and set corn aside.\nVicky Wasik\nUsing a sharp knife, halve salted duck egg lengthwise, cutting through the shell. Scoop egg out of the shell with a spoon; discard shell. Using clean hands, crumble egg into small pieces, and set aside.\nVicky Wasik\nIn a clay or wooden mortar and pestle, combine garlic and chiles and pound to a very coarse paste, about 30 seconds. Add palm sugar and dried shrimp and pound until slightly broken down, about 20 seconds. Add tomatoes and long beans, and pound lightly until beans are lightly crushed and tomatoes have released some of their juices but are still mostly intact, about 15 seconds. Take care not to over-pound; you want the ingredients to maintain their integrity and texture. Add fish sauce and lime juice, and using the pestle, stir in a circular motion, applying gentle pressure to the mortar to fully dissolve the palm sugar, about 15 seconds.\nVicky Wasik\nAdd reserved corn and salted duck egg. Using a large spoon, mix gently to combine, while doing your best to keep corn in large clusters (some of the corn will break down into individual kernels, and that’s fine). Transfer to a serving plate and drizzle with 1/4 cup (60ml) of reserved coconut milk mixture. Serve immediately with cooked jasmine or sticky rice.\nVicky Wasik\nSpecial Equipment\nDutch oven\n,\nclay\nor wooden mortar and pestle\nNotes\nWhen purchasing coconut milk, look for versions like this one from Aroy-D that have \"100% coconut milk\" as the only listed ingredient, rather than those made with coconut extract and water.\nYou can adjust the spiciness of this salad to suit your taste by reducing or increasing the amount of fresh Thai chiles in the recipe.\nDried shrimp can be found in Asian markets and also online.\nPalm sugar can be found in Southeast Asian markets, as well as some nationwide supermarkets like HMart, and also online. At room temperature, palm sugar is a solid mass and needs to be softened so that it can be incorporated into the dressing. You can soften palm sugar in the following ways by microwaving it at full power in a microwave-safe bowl for approximately 15 seconds. If you can't find palm sugar, you can substitute with 1 teaspoon (5g) granulated sugar.\nCooked\nsalted duck eggs\nare used in Chinese and Southeast Asian cuisines, and can be found In Asian markets or online. In the States, they are usually sold fully cooked, in-shell, and individually vacuum sealed. They provide a savory, salty punch to this dish. If you can’t find salted duck eggs, increase the amount of fish sauce in the dressing to 3 tablespoons (45ml).\nMake-Ahead and Storage\nThis dish is best enjoyed immediately.\nThai\nCorn\nSalads\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tam-khao-pod-kai-kem-thai-corn-salad-with-salted-duck-egg.webp?"
}