{
  "url": "https://www.seriouseats.com/tamales-de-pollo-con-salsa-verde-chicken-with-green-salsa-tamales-recipe-8649768",
  "image_url": "https://www.seriouseats.com/thmb/WAmij19fywn4ZoWFpZ_pOrYmHus=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240512-Chicken-Tamales-Filling-Lorena-Masso39-SEA--50c5cf060e154b1995ae55757ffc3c11.jpg",
  "tags": [
    "Chicken Mains",
    "The Latest",
    "Mexican",
    "Chicken Thighs",
    "Cornmeal"
  ],
  "title": "Tamales de Pollo con Salsa Verde (Tamales with Chicken and Green Salsa)",
  "full_text": "Tamales de Pollo con Salsa Verde (Tamales with Chicken and Green Salsa)\nClose\nJump to recipe\nPrep\n25 mins\nCook\n3 hrs 40 mins\nCooling and Soaking Time\n65 mins\nTotal\n5 hrs 10 mins\nServes\n25\nMakes\n25 tamales\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken, Broth, and Chicharrónes:\n6\n(\n5- to 7-ounce\n) bone-in\nchicken thighs,\nskin removed and reserved (about\n2 1/2\npounds\n;\n1.1\nkg)\nKosher salt and freshly ground black pepper\n1/2\nlarge\nwhite onion\n, peeled and quartered (\n5\nounces\n;\n142\ng)\n1\nlarge\ncarrot,\npeeled, trimmed, and halved crosswise (\n6\nounces\n;\n170\ng\n)\n5\nmedium\ncloves garlic\n(\n25\ng)\n, peeled\n1\nwhole\nbay leaf\nFor the Sauce:\n4\nserrano\nchiles\n, stems removed\n1\nplum\ntomato\n, halved (\n6\nounces\n;\n170\ng\n)\n2\ntomatillos,\nhusks removed, halved (\n4\nounces;\n113\ng\n)\n1\ncup\nfresh\ncilantro leaves\nand tender stems\n3\nmedium\ncloves garlic\n(\n15\ng\n), peeled\n1 1/2\nteaspoons\nblack\npeppercorns\n1/2\nteaspoon\ndried oregano\n1/2\nteaspoon\nground coriander\n1/2\nteaspoon\ncumin seeds\nKosher salt\nFor the Tamales:\n25\nlarge\ndried\ncorn husks\n, each measuring about 8 or 9 inches long by 6 inches wide (\n6\nounces\n;\n170\ng\n) (see notes)\n1\ncup\nlard,\nvegetable shortening, or duck fat (\n6\nounces\n;\n170\ng\n), softened\n3 1/3\ncups\nmasa harina\n(\n12 3/4\nounces;\n361\ng\n)\n1 1/4\nteaspoon\n(\n6\ng\n)\nbaking powder\n1/2\nteaspoon\nDiamond Crystal\nkosher salt;\nif using table salt use half as much by volume\n2\ncups\n(\n475\nml\n) homemade chicken, pork, or beef\nbroth\nor store-bought low-sodium chicken broth (see notes)\nDirections\nFor the chicken, broth, and chicharrónes:\nGenerously season the chicken with salt and pepper. In a large stock pot or large Dutch oven, add the chicken, onion, carrot, garlic, and bay leaf. Add water until the mixture is submerged by 3 inches. Bring to a simmer and cook until chicken is fork-tender, 45 minutes to 1 hour. Using tongs or a slotted spoon, transfer the chicken to a cutting board and let cool slightly, about 15 minutes.\nSerious Eats/Lorena Masso\nOnce chicken is cool enough to handle, remove and discard the bones, then shred the chicken into bite-size pieces and transfer to a large bowl. Reserve the meat and the broth separately.\nSerious Eats/Lorena Masso\nMeanwhile, cut the reserved chicken skin into 1/2 inch pieces. Transfer the cut skin to a medium saucepan, cover with water until just submerged, and bring to a gentle simmer, stirring occasionally, over medium-high heat. Continue to cook, lowering heat as needed to maintain a gentle simmer, stirring occasionally until the skin is crisp and golden, 40 to 60 minutes. When crisping the chicken skin, monitor the heat level closely to maintain a gentle simmer to avoid hot fat splatter and to ensure even browning of the skin. Using a spider skimmer or slotted spoon, transfer the crisped chicken skin to a paper towel–lined plate. Season lightly with salt, add to the bowl with the meat, and gently toss to combine, breaking up any pieces of chicharrón that have clumped together. Cool the rendered chicken fat and reserve.\nSerious Eats/Lorena Masso\nFor sauce:\nAdjust oven rack to upper-middle position and preheat the oven broiler. In a bowl, toss serranos, tomato, and tomatillos in 2 tablespoons of the reserved rendered chicken fat. Transfer to an aluminum foil–lined baking sheet. Broil until well charred, flipping the vegetables halfway through, about 5 minutes total.\nSerious Eats/Lorena Masso\nIn a blender jar, add the charred vegetables, fresh cilantro, garlic, black peppercorns, oregano, coriander, cumin, and 1/2 cup of the reserved chicken broth. Season with salt to taste.\nSerious Eats/Lorena Masso\nPour the blended sauce over the chicken mixture and toss to thoroughly combine. Season with salt and pepper to taste. At this point, the filling can be cooled down then refrigerated in an airtight container for up to 5 days or frozen for up to 3 months. Alternatively set the filling aside and continue with the tamales below.\nSerious Eats/Lorena Masso\nFor the tamales:\nIn a large bowl, add corn husks and cover with hot water; soak until pliable, 20 to 30 minutes. Make sure they are fully submerged by weighing them down with a heavy plate, if needed.\nSerious Eats/Lorena Masso\nMeanwhile, in a stand mixer, using the paddle attachment, beat the lard (or other listed fat if using) on medium speed until smooth, light and airy, about 4 minutes (see notes). Stop mixer, use a spatula to scrape down sides of the mixer bowl, and add masa harina and baking powder. Start mixer on low speed and gradually increase speed to medium and mix until well combined, about 1 minute.\nSerious Eats/Lorena Masso\nWith the mixer running, slowly drizzle in broth or water, until well combined and dough forms, about 5 minutes. Dough should be moist , smooth, and spongy in texture.\nSerious Eats/Lorena Masso\nTo test dough for seasoning, flatten a small piece of dough between your fingers, then microwave on high power until cooked through, about for 15 seconds. Taste and add salt by returning to stand mixer or kneading in by hand, if needed.\nSerious Eats/Lorena Masso\nRemove husks from water and pat dry with a clean kitchen towel. Working with 1 husk at a time, lay flat on work surface, cupped side up. Using a small offset spatula, back of spoon, or bench scraper, spread about 2 tablespoons (32g) of the prepared masa into a thin layer across the center of the wrapper, leaving a 1-inch border from the wide open end of the wrapper and from both sides, and leaving bottom 2-inches of the narrow tail end empty. You should have a roughly 4-inch by 4-inch flat square of dough (see notes). If necessary, remove any excess masa using a small offset spatula or butter knife.\nSerious Eats/Lorena Masso\nSpread 2 tablespoons of  the prepared filling down the center of the dough in a vertical line running the direction of the tapered tail to the open top.\nWith the corn husk’s tapered tail end facing you, fold 1 long side of the corn husk over the filling, stopping and pressing in the middle. Fold the other long side of the husk over the filling, meeting the other folded husk in the middle. Make sure both folded husk edges overlap slightly for a secure closure. Tuck the unfilled tapered tail up to create a secure pouch with 1 open end. Repeat with remaining corn husks, masa, and filling.\nSerious Eats/Lorena Masso\nFit a large pot or Dutch oven with a steamer basket, removing feet from the steamer basket if pot is short. Fill pot with water until water just touches bottom of basket and bring to a boil. Gently stand tamales in the basket with open ends facing up and seam sides facing out. Cover and steam, checking water level and adding additional water as needed, until tamales easily separate from husks, 60 to 90 minutes. Rest the tamales in the steamer basket, uncovered and off heat, until firm, about 20 minutes.Carefully Transfer to a platter. Open and serve.\nSerious Eats/Lorena Masso\nSpecial Equipment\nBlender, stock pot or large Dutch oven, steamer basket\nNotes\nThe unused chicken broth can be saved and used for making masa for tamales.\nFor easier cutting, the chicken skin can be placed on a plate and frozen until firm, about 15 minutes before slicing.\nWhen crisping the chicken skin, monitor the heat level closely to maintain a gentle simmer to avoid hot fat splatter and to ensure even browning of the skin.\nThis recipe can be doubled to fill 50 tamales.\nMasa harina is available in the Latin foods aisle at most grocery stores. I like to use Maseca and Masienda brands. Maseca is more widely available, while Masienda usually needs to be ordered online. I tested this recipe with both brands and found they were interchangeable in the recipe when measured by weight.\nIt’s easiest to use large corn husks that measure about 8 inches long by 6 inches wide at the open end; if the husks are small, you may need to use two per tamal by shingling them as needed to hold all of the filling. If you do use corn husks that are different from this recommended size, you may need to adjust the amount of masa needed and the dimensions for each tamal. The most important thing for proper shaping is to be sure to spread the masa into a very thin layer.\nMake-Ahead and Storage\nThe filling can be refrigerated in an airtight container for up to 5 days or frozen for up to 3 months.\nThe rendered chicken fat from making the\nchicharrónes\ncan be cooled and refrigerated in an airtight container for up to 2 weeks or frozen for up to 3 months.\nAny unused chicken broth can be refrigerated in a tightly sealed container for up to 5 days or frozen for up to 3 months.\nThe filling can be refrigerated in an airtight container for up to 5 days or frozen for up to 3 months.Uncooked assembled tamales can be refrigerated for up to 2 days or frozen for up to 1 month. When cooking frozen tamales, steam them for an additional 15 minutes.\nCooked tamales can be refrigerated for up to 4 days or frozen for up to 6 months. Refrigerated tamales can be reheated in the corn husks by steaming, microwaving, or grilling. Frozen tamales should not be thawed before steaming.\nRead More\nTamales Rojos de Puerco (Red Pork Tamales) Recipe\nTamales With Green Chili and Pork Recipe\nChicken Mains\nThe Latest\nMexican\nChicken Thighs\nCornmeal",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tamales-de-pollo-con-salsa-verde-tamales-with-chicken-and-green-salsa.webp?"
}