{
  "url": "https://www.seriouseats.com/tandoor-style-grilled-chickens-tandoori-cornish-hens-recipe",
  "image_url": "https://www.seriouseats.com/thmb/U_vFiw41FzWnvJsgYFR9QxUWM_k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__08__20110803-grilled-tandoori-chicken-tikka-indian-primary-d08b14e94b5a469fb06ccf745849f1a2.jpg",
  "tags": [
    "Chicken Mains",
    "Grilled Chicken",
    "Whole Chicken"
  ],
  "title": "Tandoor-Style Grilled Chickens or Cornish Hens Recipe",
  "full_text": "Tandoor-Style Grilled Chickens or Cornish Hens Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n60 mins\nMarinating and Resting Time\n4 hrs 5 mins\nTotal\n4 hrs 35 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nCornish game hens\n, about\n1 1/2-pounds each\n(see notes)\n2\ntablespoons\ntoasted\nground cumin\n2\ntablespoons\ntoasted\npaprika\n1\ntablespoon\ntoasted\nground coriander seeds\n1\nteaspoon\nground turmeric\n1/2\nteaspoon\ncayenne pepper\n1\ntablespoon\nachiote\nor a few drops\nred food coloring\n(optional)\n8\ncloves\ngarlic\n, grated on a microplane grater\n2\ntablespoons\nfresh ginger\n, grated on a microplane grater\n2\ncups\nyogurt\n1/2\ncup\nlemon juice\n1/4\ncup\nkosher salt\nThinly sliced\nraw onion\n1/2\ncup\nroughly chopped cilantro\nleaves\n2\nlemons\nor\nlimes\n, cut into wedges\nDirections\nUsing sharp kitchen shears, remove the backs from the Cornish hens.\nPeel skin off of hens, then using a sharp knife, make deep incisions at 1-inch intervals all over the flesh.\nLay hen with breasts facing up. Press down firmly on center of breasts until wishbone cracks and they lie flat. Arrange legs so that they are pointing up towards the top of the breast. Use 2 long metal or wooden skewers to secure legs and breasts in place. Place in a large rimmed baking dish.\nCombine cumin, paprika, coriander, turmeric, cayenne, achiote, garlic, ginger, yogurt, lemon juice, and salt in a large bowl and whisk to combine. Pour marinade all over cornish hens, using hands to coat every surface. Cover loosely and refrigerate, allow to marinate for at least 4 hours and up to 8, turning occasionally.\nIgnite a large chimney starter full of charcoal\nand allow to burn until all coals are ignited. Spread coals evenly under one side of grill and set grill grate in place. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nBrush grill grates clean\n.\nWipe excess marinade off of hens then place meaty-side down directly over the coals. Cover partially and allow to cook until deeply charred on first side, 7 to 10 minutes. Flip and continue cooking until hens register 145°F (63°C) in the thickest part of the breast and 165 to 170°F (74 to 77°C) in the legs, about 5 minutes longer (for larger chickens, transfer to cooler side of grill, cover, and continue cooking until desired temperature is reached).\nRemove hens to a large cutting board, tent loosely with foil, and allow to rest for 5 minutes. Remove skewers and using a heavy knife or cleaver, chop each hen into 8 serving-sized pieces. Serve immediately with onions, cilantro, lime wedges, and freshly grilled naan.\nSpecial Equipment\nCharcoal grill\n,\nchimney starter\n,\ninstant-read thermometer\n,\n8 metal skewers\n,\nkitchen shears\nNotes\nSmall chickens can be used in place of the Cornish hens. After initial charring steps on the grill, transfer chicken to cooler side of grill and cook covered until center of breast registers 140 to 145°F (60 to 63°C) on an instant-read thermometer.\nRead More\nHow to Get Started Grilling\nThe Food Lab's Grilled Chicken World Tour: 5 Recipes to Rock Your Backyard Bird\nGrilled Naan Recipe\nChicken Mains\nGrilled Chicken\nWhole Chicken",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tandoor-style-grilled-chickens-or-cornish-hens-recipe.webp?"
}