{
  "url": "https://www.seriouseats.com/tang-yuan-recipe-8767314",
  "image_url": "https://www.seriouseats.com/thmb/S_KYr55taWqLrVl5E5YC7W8uEqg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/glutinous-rice-balls-tang-yuan-092722-hero-1_1-3f92a23b9a3345b3bb27c081a9f6c015.JPG",
  "tags": [
    "Desserts",
    "Chinese",
    "Lunar New Year"
  ],
  "title": "The Sweet, Chewy Dessert I Make Every Lunar New Year",
  "full_text": "The Sweet, Chewy Dessert I Make Every Lunar New Year\nClose\nJump to recipe\nPrep\n30 mins\nCook\n15 mins\nTotal\n45 mins\nServes\n6\nto 8 servings\nMakes\n15\nto 20 rice balls\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n2\ntablespoons\nroasted and ground sesame seeds\n, peanuts, almonds, or cashews\n2\ntablespoons\ngranulated\nsugar\n(1 ounce; 30g)\n2\ntablespoons\n(30ml) lard or\ncoconut oil\nFor the Dumpling Skin:\n150\ng\nglutinous rice flour\n(5 1/4 ounces; 1 1/2 cups)\n15g regular rice flour or\ntapioca starch\n(about 1/2 ounce;\n2\ntablespoons\n)\n133\nto 148\ng\n(9 to 10 tablespoons) boiling\nwater\nDirections\nTo Make the Filling:\nIn a mortar and pestle, grind seeds or nuts to a fine but not powdery consistency. In a small saucepan, melt the lard over low heat. In a small bowl, stir lard together with the sugar and ground nuts. Chill mixture in the refrigerator or freezer for a few minutes before use.\nSerious Eats / Jen Causey\nTo Make the Skin:\nIn a medium heatproof bowl, whisk glutinous rice flour and regular rice flour (or tapioca flour) to combine. Add the water, starting with 9 tablespoons (133g) and adding an additional 1 tablespoon (15g) if necessary, to make a soft but non-sticky dough. Divide the dough in half. Working on a surface dusted with rice flour, roll each half into a cylinder about 1 1/2 inches thick and, using a knife or a bench scraper, cut the dough into segments about 1 inch wide; dust with more glutinous rice flour as needed to prevent sticking.\nSerious Eats / Jen Causey\nTo Make the Dumplings:\nTake one piece of dough and make an indent with your thumb to flatten it. Place the filling into the indent and draw the sides of the dough up to enclose it. Roll it gently between your palms to make a smooth ball. Lay the dumplings on a tray dusted with glutinous rice flour until you are ready to cook them. They can also be refrigerated or frozen.\nSerious Eats / Jen Causey\nTo Cook the Dumplings:\nFill a large pot with water and bring to a boil. Add the dumplings and gently stir to prevent sticking at the bottom of the pot. Simmer for 15 minutes, taking care not to let the water boil vigorously or else the dumpling skins will tear. The dumplings are done when the skins are almost translucent. Ladle the dumplings into soup bowls along with the cooking water.\nSerious Eats / Jen Causey\nSpecial Equipment\nSaucepan\n, knife or bench scraper,\nlarge pot\nRead More\nThe Serious Eats Field Guide to Chinese Pastries\nPumpkin Glutinous Rice Balls in Sweetened Coconut Cream (Bua Loi Fak Thong) Recipe\nDesserts\nChinese\nLunar New Year",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-sweet-chewy-dessert-i-make-every-lunar-new-year.webp?"
}