{
  "url": "https://www.seriouseats.com/tanghulu-recipe-8771810",
  "image_url": "https://www.seriouseats.com/thmb/6KNDK4coRGKrWNj7gEDEloatA3E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241212-SEA-Tanghulu-MelatiCitrawireja-Hero1-06-fea932f1bfe84b149a4b5e47f7734bde.jpg",
  "tags": [
    "Desserts",
    "The Latest",
    "Gluten-free Desserts",
    "Chinese",
    "Gluten-free"
  ],
  "title": "Tanghulu (Sugar-Glazed Skewered Fruit)",
  "full_text": "Tanghulu (Sugar-Glazed Skewered Fruit)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nTotal\n20 mins\nMakes\n8 skewers\nCook Mode\n(Keep screen awake)\nIngredients\n24\nhulled small strawberries and/or green\ngrapes\n, washed and dried (see notes)\n1/2\ncup\n(\n120\nml\n)\ntap water\n1\ncup\ngranulated sugar\n(\n7\nounces\n;\n200\ng\n)\n1/4\nteaspoon\nlemon juice\nfrom 1 medium lemon\nDirections\nThread 2 to 3 strawberries, grapes, or a combination of fruits onto each skewer, leaving enough room to hold the skewer at the bottom; set aside. Line a rimmed baking sheet with parchment paper; set aside.\nMelati Citrawireja\nIn a small saucepan, combine water, granulated sugar, and lemon juice. Bring water and sugar mixture to a boil over medium-high heat, 10 to 15 minutes. Do not stir the liquid at any point during this process, as it may cause the sugar to seize and become grainy. Using a wet pastry brush, gently brush away any sugar crystals that have formed on the side of the pan. The syrup will begin to bubble quickly and look like agitated dish soap.\nMelati Citrawireja\nWhen syrup registers 302ºF (150ºC) on an instant-read thermometer and is lightly golden, remove the pot from  heat. When bubbles have subsided, tilt the pot to its side and, working quickly, holding 1 skewer by the end, carefully dip the fruit into the syrup, using a spoon to drape syrup over the fruit if necessary, rotating the skewer and letting the excess syrup drip off. (If your kitchen is cold, keep pot over low heat to prevent syrup from cooling and hardening.)\nMelati Citrawireja\nPlace skewer onto prepared baking sheet; repeat with remaining skewers. Let candied fruit cool and harden, about 3 minutes. Enjoy within an hour or two.\nMelati Citrawireja\nSpecial Equipment\n5 to 8 wooden or reusable\nmetal skewers\n, instant-read or candy thermometer\nNotes\nOpt for tart, just-ripe strawberries and green grapes. The sourness of the fruit balances out the sugar. Avoid using very ripe strawberries, as the heat of the syrup will start to cook the berries and cause them to weep.\nIf you are working in a really hot and humid environment and your sugar isn’t hardening, you can dunk the skewers in an ice-water bath after dipping them in the sugar syrup to help the sugar crystallize.\nMake-Ahead and Storage\nCandied strawberries need to be eaten within a couple of hours. Their high moisture content makes the sugar coating sticky if left too long. Grapes are a bit more resilient and may last overnight in the fridge stored in an airtight container.\nDesserts\nThe Latest\nGluten-free Desserts\nChinese\nGluten-free",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tanghulu-sugar-glazed-skewered-fruit.webp?"
}