{
  "url": "https://www.seriouseats.com/tartiflette-recipe-5217300",
  "image_url": "https://www.seriouseats.com/thmb/ZYr0KaBpOLEMMyg8AN00OwdNeXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220201-tartiflette-vicky-wasik-33-1387b0975ce0466d86c83ea6a8f75cd9.jpg",
  "tags": [
    "Potatoes",
    "French",
    "The Latest"
  ],
  "title": "Tartiflette",
  "full_text": "Tartiflette\nClose\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nTotal\n85 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 1/4\npounds\n(1kg)\nYukon Gold potatoes\nKosher salt\n3\nfresh thyme sprigs\n1/4\npound\n(115g) slab or\nthick-cut bacon\n, cut into 1/4-inch lardons\n1 to 2\ntablespoons\n(15 to 30g)\nunsalted butter\n, only if needed\n2 medium (8-ounce;\n225\ng\n)\nyellow onion\ns, thinly sliced\nFreshly\nground black pepper\n1/2\ncup\n(120ml)\ndry white wine\n1/2\ncup\n(120ml) heavy cream or\ncrème fraîche\n1 pound (\n450\ng\n)\nReblochon-style soft-rind cheese\n(see headnote for suggested cheeses)\nDirections\nPeel potatoes and cut into 1/2-inch thick rounds. In a large pot, cover potatoes with cold water. Season generously with salt, add thyme, and bring to a gentle simmer over medium heat. Cook at a bare simmer until potatoes are just tender and can easily be pierced with a paring knife, about 25 minutes. Discard thyme, drain potatoes, return to pot, and set aside.\nSerious Eats / Vicky Wasik\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). In a 10-inch cast iron or stainless-steel skillet, heat bacon over medium-high heat until fat begins to render. Lower heat to medium and continue to cook, stirring occasionally, until fat is mostly rendered and bacon is cooked but not crisp, about 5 minutes. If there is excessive rendered fat, drain off all but 1/4 cup (60ml); conversely, if the bacon is lean and didn't release much fat, add 1 to 2 tablespoons (15 to 30g) butter. Add onions, season with salt and pepper, and cook, stirring frequently, until onions have softened but not browned, about 8 minutes.\nSerious Eats / Vicky Wasik\nAdd white wine and cook, stirring, until wine has almost fully cooked off, 1 to 2 minutes. Scrape bacon-onion mixture into pot with potatoes and toss gently to thoroughly combine.\nSerious Eats / Vicky Wasik\nScrape potato mixture back into cast-iron skillet or into a 3-quart (3L) baking dish. Add cream or crème fraîche (the latter is thicker, so you can dollop it around in that case).\nSerious Eats / Vicky Wasik\nCut cheese into roughly 1/2-inch-thick slabs. You can do this by cutting the cheese wheels in half to make half-moons; halve wheels through the equator; or slice crosswise into thick planks. Arrange cheese on top of potatoes, rind side up. Set skillet or baking dish on top of a rimmed baking sheet and bake until the cheese is melted and bubbling and lightly browned on top, about 40 minutes.\nSerious Eats / Vicky Wasik\nServe, scooping tartiflette from the skillet or baking dish onto individual serving plates.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n10-inch\ncast iron\nor\nstainless steel skillet\n, 3-quart baking dish (optional)\nMake-Ahead and Storage\nTartiflette is best enjoyed immediately. The casserole can be prepared in advance through step 4 and held at room temperature for up to 2 hours before being topped with cheese and baked. Leftovers can be refrigerated in an airtight container for up to 3 days.\nRead More\nPommes Aligot (Cheesy Mashed Potatoes)\nClassic Rich and Silky Potatoes Gratin (Scalloped Potatoes)\nPommes Anna\nThe Stinky World of Washed Rind Cheese\nPotatoes\nFrench\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tartiflette.webp?"
}