{
  "url": "https://www.seriouseats.com/tarte-tatin-recipe-7113652",
  "image_url": "https://www.seriouseats.com/thmb/MBkSm8bWRnHW2QqsCkJ0K4yUhic=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230227-SEA-TarteTatin-AmandaSuarez-hero-54353d97767b4d88b6468153449ed70e.JPG",
  "tags": [
    "Desserts",
    "The Latest",
    "French",
    "Apple"
  ],
  "title": "Tarte Tatin",
  "full_text": "Tarte Tatin\nClose\nJump to recipe\nPrep\n20 mins\nCook\n50 mins\nCooling Time\n70 mins\nTotal\n2 hrs 20 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(\n14-ounce;\n397 g) package\nthawed\npuff pastry\n3\nquarts\n(\n2.8\nliters\n) boiling\nwater\n8\nmedium-large\nPink Lady or\nGranny Smith apples\n(about\n3\npounds\n;\n1.3\nkg\n)\n3\nteaspoons\n(\n15\nml\n)\napple cider vinegar\n, divided\n1\ncup\n(\n200\ng\n)\ngranulated sugar\n8\ntablespoons\n(\n113\ng\n)\nunsalted butter\n, cubed\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\nFlaky sea salt\n, for garnish\nCrème fraiche\nor whipped cream, for serving (optional)\nDirections\nAdjust oven rack to lower-middle position and place a rimmed baking sheet on it (this is to catch any drips when the tarte Tatin bakes). Preheat oven to 400ºF (205ºC). On a well-floured work surface, roll 1 sheet of thawed puff pastry into a circle roughly 11-inches in diameter. Using a fork or a docking tool, prick the dough all over to dock, then place on a rimmed baking sheet lined with parchment, loosely cover with plastic, and refrigerate while you prepare the tarte Tatin filling.\nSerious Eats / Amanda Suarez\nPeel, core, and quarter the apples. Place in a large bowl and toss with 1 1/2 teaspoons apple cider vinegar, then pour boiling water over the prepared apples. Cover and set aside at room temperature for 10 minutes. Using a slotted spoon, transfer apples to a rimmed baking sheet lined with a cooling rack and let stand until cool, about 10 minutes. Pat dry with paper towels if needed.\nSerious Eats / Amanda Suarez\nIn a 10-inch stainless-steel or nonstick skillet (see note) set over medium heat, melt 1/2 cup granulated sugar until it begins to melt and caramelize. Add the remaining 1/2 cup granulated sugar and stir, using a clean, dry silicone spatula, until all the sugar dissolves and becomes an amber color, 3 to 5 minutes. Whisk in butter, 1 teaspoon vanilla extract, and the remaining 1 1/2 teaspoons apple cider vinegar, and cook, whisking constantly, until the caramel bubbles, thickens slightly, and turns a butterscotch color, about 3 minutes. (The caramel will spit and look like it wants to seize, but keep going—the sugars will melt and loosen up as it continues to cook.)\nSerious Eats / Amanda Suarez\nRemove from heat and, using tongs and working one apple quarter at a time, add apple quarters, turning each piece to coat all over in the caramel and arranging them rounded side down to build a ring around the circumference of the skillet. Once the first ring is complete, repeat with additional apple quarters, dipping them into the caramel in the center and forming a second ring, also rounded side down, directly on top of the first, but positioned to fill the spaces between the apples in the first ring.\nSerious Eats / Amanda Suarez\nWhen the second ring is complete, dip remaining apple quarters into the caramel in the center, turning to coat, then fill in the center hole with 2 layers of apple quarters, all rounded side down (it is possible you will have a couple apple quarters left over that won't fit). Gently press down with a silicone spatula to ensure all the apples on the bottom layer come into contact with the caramel.\nSerious Eats / Amanda Suarez\nReturn the pan to medium heat; bring caramel to a simmer, then reduce the heat to low and cook until the caramel has darkened slightly and is bubbling around the edges and the apples on the bottom are just beginning to become tender but still retain their shape, about 5 minutes.\nSerious Eats / Amanda Suarez\nTop the apples with the prepared dough, tucking the edges down around the fruit. Gently press down on the pastry to flatten the apples underneath as much as possible. Transfer skillet to the oven and bake until the pastry is golden and the apples are bubbling around the sides, 20 to 25 minutes.\nSerious Eats / Amanda Suarez\nRemove from the oven and cool until pan is still slightly warm but cool enough to touch, 1 to 2 hours (don't let the pan fully cool, as that could cause the caramel to thicken such that the tarte Tatin won't release when flipped). Cover the pan with a large dinner plate or platter, then carefully and quickly flip. Remove the pan. Garnish with flaky salt. Serve with a dollop of crème fraiche or whipped cream, if desired.\nSerious Eats / Amanda Suarez\nNotes\nI do not recommend using a cast-iron skillet—its color will make it difficult for you to gauge how dark your caramel is.\nIf using a non-stick skillet, I recommend using a silicone whisk to prevent scratching your pan.\nSpecial Equipment\n2 rimmed baking sheets, cooling rack, 10-inch stainless-steel or non-stick skillet (you could also use a 10-inch stainless-steel-lined copper skillet)\nMake-Ahead and Storage\nThe apples can be prepared and left to dry on the cooling rack for up to 3 hours.\nThe tarte Tatin is best served the day it’s made; the longer it sits, the soggier the pastry will get.\nDesserts\nThe Latest\nFrench\nApple"
}