{
  "url": "https://www.seriouseats.com/teh-tarik-sweet-and-frothy-malaysian-milk-tea-recipe-8374366",
  "image_url": "https://www.seriouseats.com/thmb/m2ruDO0vyzeBN_JeYmenYUfoujs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231026-TehTarik-MichelleYip-11-d085b8f9a05b4e13b2ad5f38f2896481.jpg",
  "tags": [
    "Teas",
    "The Latest",
    "Stovetop"
  ],
  "title": "Teh Tarik (Sweet and Frothy Malaysian Milk Tea)",
  "full_text": "Teh Tarik (Sweet and Frothy Malaysian Milk Tea)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nTotal\n20 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n475\nml\n)\nwater\n1 1/2\nteaspoons\n(\n6\ng\n) loose leaf\nblack tea\n, preferably Ceylon\n7\nounces\n(\n200\nml\n) evaporated creamer or\nheavy cream\n(see notes)\n3\ntablespoons\n(\n45\nml\n)\ncondensed milk\n, divided, plus more as needed\nDirections\nPack tea leaves into a tea filter bag or tea ball infuser.\nSerious Eats / Michelle Yip\nIn a medium saucepan, bring the water to a boil over high heat. Add tea bag and continue to boil until the color of the tea is a rich amber, about 2 minutes.\nSerious Eats / Michelle Yip\nPour evaporated creamer (or heavy cream) and 1 tablespoon condensed milk (if using evaporated creamer) or 1 1/2 tablespoons condensed milk (if using heavy cream) into the tea and continue to boil, occasionally swirling the pan gently, for 2 minutes. Remove from heat.\nSerious Eats / Michelle Yip\nRemove and discard the tea bag. Pour half of the tea into a kole, second saucepan or a large heatproof measuring cup.\nSerious Eats / Michelle Yip\nAdd 1 tablespoon of condensed milk to each mug. Working with one saucepan (or measuring cup) and mug at a time, pour the tea from the saucepan into the mug. Then pour the tea from the mug back into the saucepan. Continue to do this at least three more times, lifting the pouring vessel higher and higher each time to \"stretch\" or \"pull\" the tea during each transfer; the tea should become frothy. Finish with the tea in the mug, then repeat the pulling process with the second vessel of tea and mug. Serve hot. (see notes)\nSerious Eats / Michelle Yip\nSpecial Equipment\nTea filter bag or\ntea ball infuser\nNotes\nThe recipe can be scaled if desired, but remember to pull the tea one mug at a time for maximum froth.\nEvaporated creamer can be difficult to find in the United States. From our tests, heavy cream (about 38% fat) is the best substitute we could find, but if you use it, you should increase the condensed milk by about 1/2 tablespoon (1 1/2 teaspoons) in step 3.\nIf the drinker prefers their drink sweeter, add another 1/2 to 1 tablespoon of condensed milk to their mug and pull the tea again several times to mix.\nThe vessels that are usually used to pull tea in a mamak shop (and widely available for home use as well) is a steel mug locally called a kole.  If a kole is unavailable, you can get the same results with a a second saucepan, heatproof measuring cup, regular mug, or combination of.\nMake-Ahead and Storage\nTeh tarik keeps in the fridge for at least 2 days, though the frothy bubbles will dissipate. You can enjoy it cold from the fridge, or pull the tea again to create the froth before drinking.\nRead More\nHow to Make Chai\nThe Best Teas You Can Buy Online\nTeas\nThe Latest\nStovetop",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/teh-tarik-sweet-and-frothy-malaysian-milk-tea.webp?"
}