{
  "url": "https://www.seriouseats.com/tender-beef-barbacoa-chipotle-tacos-recipe",
  "image_url": "https://www.seriouseats.com/thmb/wOtKW0xFrwHXNvY3viU2KbwbbB4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120423-barbacoa-tacos-primary-7c9e3e5a760641dda7ad3e1436ae9c8b.jpg",
  "tags": [
    "Braised & Stewed Beef",
    "Mexican",
    "Beef Chuck",
    "Beef Mains",
    "Tacos"
  ],
  "title": "Better Than Chipotle Beef Barbacoa",
  "full_text": "Better Than Chipotle Beef Barbacoa\nClose\nJump to recipe\nPrep\n5 mins\nCook\n4 hrs 40 mins\nActive\n45 mins\nTotal\n4 hrs 45 mins\nServes\n6\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\ndried New Mexico\n, costeño, or choricero\nchile\n, seeds and stem removed (see note)\n1\nwhole\nchile ancho\nor pasilla, seeds and stem removed (see note)\n1\nwhole\nchile negro\n, seeds and stem removed (see note)\n1\nquart\nlow sodium\nstore-bought or\nhomemade\nchicken stock\n, divided\n3\ntablespoons\nvegetable or\ncanola oil\n, divided\n1\npound\noxtails\nKosher salt\nand freshly ground black pepper\n1\nsmall\nonion\n, finely sliced\n6\nmedium cloves\ngarlic\n, smashed\n2\nteaspoons\nground cumin\n1/2\nteaspoon\nground cloves\n2\nteaspoons\ndried oregano\n4\nchipotle\nchiles\npacked in adobo\n, roughly chopped, with\n2\ntablespoons\nadobo sauce\n1/4\ncup\napple cider vinegar\n2\nteaspoons\nfish sauce\n1\nwhole\nchuck-eye roast\n(about\n4\npounds\n), or\n4\npounds\nboneless shortribs\n2\nwhole\nbay leaves\nWarm\ncorn tortillas\n,\nonions\n,\ncilantro\n,\nsalsa\n,\nlimes\n, and other condiments for serving\nDirections\nAdjust oven rack to lower-middle position and preheat oven to 275°F (135°C). Add dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with an intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside. Alternatively, place dried chiles on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl. Add 2 cups chicken broth, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside.\nMeanwhile, heat 1 tablespoon oil in now-empty Dutch oven over high heat until shimmering. Season oxtails all over with salt and pepper, and cook, turning occasionally, until well-browned on all sides, about 8 minutes total. Remove oxtails and set aside. Reduce heat to medium.\nAdd remaining 2 tablespoons oil and heat until shimmering. Add onion and garlic and cook, stirring frequently, until deep brown and onion is just starting to char on the edges, about 10 minutes. Add cumin, cloves, and oregano and cook, stirring constantly, until fragrant, about 30 seconds. Add chipotle chiles, vinegar, and remaining chicken broth. Scrape up browned bits from bottom of pan, simmer until reduced by about half, then transfer entire contents to the jar of a blender.\nAdd soaked chiles and their liquid to the blender along with fish sauce. Start blender on low and slowly increase speed to high. Purée until smooth, about 1 minute. Set aside.\nPlace beef chuck in Dutch oven. Add oxtails, bay leaves, and sauce. Bring to a boil over high heat. Place lid on pot slightly cracked, then transfer to oven. Cook, turning beef occasionally, until completely tender and a cake tester or metal skewer inserted into meat shows little to no resistance, about 4 hours. Discard bay leaves and oxtails (meat from oxtails can be eaten if desired). Transfer chuck to a large plate. Return Dutch oven to stovetop and cook, stirring frequently, over medium-high heat until liquid is reduced to about 1 1/2 cups, about 5 minutes.\nBeef can be cut and served immediately, but for best flavor, transfer beef to a sealed container along with liquid and refrigerate up to 5 days. When ready to serve, slice beef against the grain into 1 1/2- to 2-inch slices, then shred into large chunks with fingers or two forks. Return beef to a pot along with the sauce. Bring to a simmer and cook, gently stirring and folding until beef is hot, tender, and coated in sauce. Season to taste with salt. Serve immediately, piling the beef into warm corn tortillas with onions, cilantro, salsa, limes, or other condiments as desired. Alternatively, serve as-is with rice, noodles, grits, or cornbread.\nSpecial Equipment\nDutch oven\nor\nstockpot\n,\nblender\nNotes\nLook for\ndried chiles\nin a large supermarket or Latin market. If you can't find these exact chiles, any combination of mild, fruity and bright-tasting chiles will do, such as guajillo or Colorado.\nMake-Ahead and Storage\nBarbacoa can be stored in its liquid for up to 5 days in the refrigerator. The flavor should improve with time. Reheat gently on the stovetop or the microwave. Serve with store-bought or\nhomemade corn tortillas\n, and make sure to\nreheat them right!\nRead More\nBirria de Res (Beef Birria) Recipe\nCarne Adovada (New Mexico-Style Pork With Red Chiles) Recipe\nNo-Waste Tacos de Carnitas With Salsa Verde Recipe\nChile Verde With Pork Recipe\nKabab Halla (Egyptian Braised Beef With Onions) Recipe\nBraised & Stewed Beef\nMexican\nBeef Chuck\nBeef Mains\nTacos"
}