{
  "url": "https://www.seriouseats.com/tender-lamb-brochettes-with-thyme-and-haricot-verts-recipe",
  "image_url": "https://www.seriouseats.com/thmb/SBu_WxhyUHAVO7bJRIns9mxX99o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120729LambBrochette3-82f22c31f3b3451ab7e3c3aa2bcc0600.jpg",
  "tags": [
    "Quick Dinners",
    "Lamb Mains"
  ],
  "title": "Tender Lamb Brochettes with Thyme and Haricots Verts Recipe",
  "full_text": "Tender Lamb Brochettes with Thyme and Haricots Verts Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n10 mins\nTotal\n30 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\nof\nlamb loin\n, cut into 1-inch discs\nKosher salt and freshly ground black pepper\n1\ntablespoon\nolive oil\n1\ncup\nlow sodium homemade or store-bought beef broth\n2\ntablespoons\nfresh thyme leaves\n4\nteaspoons\ncold unsalted butter\n11\nounces\nof\nharicots verts\n, trimmed\nDirections\nBring a stockpot of water to a boil. Skewer the lamb onto the bamboo skewers, leaving a little space between each piece of lamb, and season with salt and pepper. Heat olive oil in a large skillet over high heat until shimmering. Add lamb and cook, turning occasionally, until center of largest pieces register 125 to 130°F on an instant read thermometer and lamb is well browned on all sides, about 3 minutes total. Transfer to a large plate and tent with aluminum foil. Let rest for 10 minutes.\nMeanwhile, add beef stock and thyme to hot skillet, using a wooden spoon to scrape browned bits off bottom of pan. Allow to come to a boil, then remove from heat and whisk in 1 tablespoon of cold butter. Set aside.\nAdd beans to boiling water and cook until tender but still bright green, about 3 minutes. Drain. Return to the pot with the remaining teaspoon of butter, and stir to coat. Serve with the lamb and thyme sauce.\nSpecial equipment\n2 bamboo skewers, soaked in water for 30 minutes\nThis Recipe Appears In\nSerious Entertaining: Easter In a Flash\nQuick Dinners\nLamb Mains"
}