{
  "url": "https://www.seriouseats.com/tepache-mexican-fermented-pineapple-drink-recipe-6824136",
  "image_url": "https://www.seriouseats.com/thmb/16kmpUNvPlDJjp8-GaRbEdhNBC0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221205-Tepache-AmandaSuarez-92-a879e2ed83854981a244a2c7e866181d.JPG",
  "tags": [
    "Drinks",
    "The Latest",
    "Mexican",
    "Pineapple",
    "Fermentation"
  ],
  "title": "Tepache (Mexican Fermented Pineapple Drink)",
  "full_text": "Tepache (Mexican Fermented Pineapple Drink)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nFermentation Time\n24 hrs\nTotal\n24 hrs 25 mins\nServes\n8\nto 10\nMakes\n2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n10\ncups\n(\n2.3\nL\n) filtered\nwater\n1\npound\n(\n455\ng\n)\npanela\nor piloncillo, roughly chopped (see note)\nSkins and cores of\n2\n-ripe\npineapples\n(about\n28\nounces\n,\n793\ng\ntotal; see note)\n2\n(3-inch) knobs\nfresh ginger\n(\n75\ng\n), washed well and cut into 1/8-inch-thick slices\n2\ncinnamon\nsticks\n(\n14\ng\n)\n1\ntablespoon\n(\n7\ng\n)\nwhole cloves\nDirections\nIn a 4-quart saucepan, bring water to a simmer over high heat. Remove from heat, add panela or piloncillo, and stir until sugar is completely dissolved. Let cool to room temperature.\nSerious Eats / Amanda Suarez\nAdd pineapple skins and cores, ginger, cinnamon sticks, and cloves to a clean 1-gallon (4L) glass jar or other nonreactive vessel. Slowly pour in the cooled sugar water, making sure the ingredients are fully submerged.\nSerious Eats / Amanda Suarez\nCover the jar with cheesecloth or a clean kitchen towel and secure with a rubber band (this keeps debris, fruit flies, and other undesirables out while still allowing air flow). Store away from direct sunlight at warm room temperature, between 70 and 78°F (21 to 25°C). Let stand, stirring once a day, until a thin layer of frothy white bubbles forms on top and you can hear a faint fizzing sound, at least 24 hours (it may take up to several days, depending on environmental conditions and other variables; if bubbles are not present by day 5, move the tepache to a warmer spot and continue to stir once a day until bubbles form). Once frothy bubbles have formed, taste the tepache; it should have a sweet, earthy, and funky flavor. If you desire a funkier flavor, you can continue to ferment 1 to 2 days longer.\nSerious Eats / Amanda Suarez\nWhen tepache has reached desired flavor, strain through a fine-mesh strainer set over a clean pitcher; discard solids. Serve the tepache at room temperature, chilled, over ice, and/or with a splash of tequila or mezcal or a fresh lime wedge.\nSerious Eats / Amanda Suarez\nTo Carbonate the Tepache (optional)\n: Thoroughly wash and dry four 16-ounce (1-pint) flip-top glass bottles. Using a funnel, fill each bottle with tepache, making sure to leave at least 3 inches of headspace. Seal bottles and store at warm room temperature, between 70 and 78°F (21 to 25°C) until you see small bubbles rising fairly rapidly to the top, even when capped; if in doubt, you can open one bottle to check the carbonation, resealing if there isn't enough fizz. Serve, or refrigerate bottled tepache for up to 5 days.\nSpecial Equipment\n1 gallon (4L) wide-mouth glass jar, cheesecloth or cotton dish towel, large rubber band\nNotes\nIf you can't find piloncillo, you can use related unrefined brown sugars like panela, jaggery, muscovado brown sugar, or even dark brown sugar. The skins and cores of overripe pineapples, which are yellow-orange to orange in color with a funky or vinegary smell, can be used if you like the extra funk.\nMake-Ahead and Storage\nTepache can be refrigerated for up to 5 days. It will continue to ferment slowly in the refrigerator; the longer you keep it, the funkier and more vinegary it will taste.\nDrinks\nThe Latest\nMexican\nPineapple\nFermentation"
}