{
  "url": "https://www.seriouseats.com/teriyaki-burgers-recipe",
  "image_url": "https://www.seriouseats.com/thmb/OmKhBa3l1p4ERF7eNXpW6siHA44=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__07__20150727-teriyaki-burger-recipe-15-248e854d2dfe445f956747b641e689d7.jpg",
  "tags": [
    "Burgers",
    "Grilled Beef",
    "Beef Mains"
  ],
  "title": "Teriyaki Burgers Recipe",
  "full_text": "Teriyaki Burgers Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n60 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\nfresh\nground beef chuck\n(about 80% lean)\nKosher salt\n2\nteaspoons\nshichimi togarashi\n(see note)\n1\ncup\nthinly sliced\nscallions\n1\nrecipe\nTeriyaki Sauce\n(I strongly advise homemade over any store-bought brand)\n4\nsoft hamburger buns\n4\ntablespoons\nmayonnaise\n, preferably\nJapanese-style\n2\ncups finely shredded\ngreen cabbage\nDirections\nForm beef into 4 patties, about 1/2 inch wider than the burger buns, with a slight depression in the center to account for bulging as they cook. Season generously with salt and togarashi and refrigerate until ready to cook. Sprinkle scallions evenly over a large plate or a cutting board.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\nthe grilling grate. Place burgers directly over hot coals, cover with vents open, and cook, turning occasionally, until burgers are well charred and burgers' centers register 110°F on an instant-read thermometer for medium rare or 120°F for medium, 5 to 7 minutes total.\nBrush burgers on both sides with teriyaki sauce and continue cooking, flipping and brushing occasionally, until they register 120°F for medium rare or 130°F for medium. Remove from grill and transfer to scallion-covered plate or cutting board. Brush with more sauce and flip burgers, brushing with sauce until well glazed and coated in scallions.\nToast burger buns over grill until well browned and crisp. Spread bottom and top buns with mayonnaise. Divide half of cabbage over bottom buns. Top with cooked burgers. Brush with more teriyaki sauce. Top with remaining cabbage, close buns, and serve.\nSpecial equipment\nInstant-read thermometer\n, grill (see our\ncharcoal\nor\ngas\ngrill recommendations)\nNotes\nShichimi togarashi\nis a Japanese chili blend that can be found in most Asian groceries or ordered online via Amazon.\nThis Recipe Appears In\nTraditional or Not, There's Technique at the Heart of Teriyaki Burgers\nBurgers\nGrilled Beef\nBeef Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/teriyaki-burgers-recipe.webp?"
}