{
  "url": "https://www.seriouseats.com/texas-style-barbecue-brisket-recipe-11744798",
  "image_url": "https://www.seriouseats.com/thmb/Y6_iuQ8Zmj18AwS6B4rLSQLsCZk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250529-SEA-TexasSmokedBrisket-VyTran-Step8-53-94cff1a808124bfb90d3df3078519a98.jpg",
  "tags": [
    "Brisket",
    "The Latest",
    "Recipes",
    "American",
    "Grilling"
  ],
  "title": "Texas-Style Brisket Doesn’t Have to Be Complicated—Here’s Proof",
  "full_text": "Texas-Style Brisket Doesn’t Have to Be Complicated—Here’s Proof\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 hrs\nRefrigeration and Resting Time:\n14 hrs\nTotal\n24 hrs 5 mins\nServes\n10\nto 12\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(10-12 pound)\nwhole\nbrisket\n(4.5 to 5.4 kg), fat cap trimmed to 1/4 inch\n1/3\ncup\n(\n45\ng\n)\nDiamond Crystal kosher salt\nor same amount by weight of any other kosher salt brand (see notes)\n2\ntablespoons\nfreshly\nground black pepper\n5\n(3-inch)\nwood chunks\n, such as oak or hickory, for smoking\n1\n(13 by 9-inch)\ndisposable aluminum pan\nDirections\nIn a small bowl, mix together salt and pepper. Coat the entire brisket in the rub and transfer to a wire rack set in a rimmed baking sheet. Refrigerate uncovered for 12 to 24 hours.\nSerious Eats / Vy Tran\nIf Using a Smoker:\nHeat and maintain the smoker temperature between 225 and 275°F (105 to 135℃) following manufacturer's guidelines and my tips in the notes below. Nestle 3 to 4 (3-inch) wood chunks into coals or heat source. Set cooking grate in place and clean and oil the cooking grate.\nWhen wood is ignited and producing smoke, set brisket on cooking grate, fat side up, and smoke until an instant-read thermometer registers 170℉ (75℃) when inserted into thickest part of the brisket, 6 to 10 hours.\nUsing kitchen towels or grilling gloves and tongs, remove the brisket from the smoker and wrap tightly with a double layer of aluminum foil, making sure the foil is airtight. Return the foil-wrapped brisket to the cooking grate, fat side up, and continue to cook until meat registers 195 to 200℉ (95℃), 3 to 6 hours. Skip to Step 11.\nIf Using a Charcoal Grill:\nOpen bottom vent of charcoal grill completely. Arrange 54 charcoal briquettes in a 2-briquette-wide C shape around perimeter of grill, overlapping the briquettes slightly so they are touching and leaving an 8-inch gap between the ends of the C. Place second layer of 27 briquettes, 1 briquette wide, in a single row centered on top of the first. The arrangement should be 2 briquettes wide by 1 high.\nSerious Eats / Vy Tran\nEvenly space 5 (3-inch) wood chunks along the length of the C. Place a disposable aluminum pan on the bottom grill grate, centered in the C, running lengthwise into gap of the C. Pour 6 cups of water into the pan.\nSerious Eats / Vy Tran\nLight chimney starter filled 1/3 of the way with charcoal briquettes (2 quarts coals total), piling briquettes on 1 side of chimney to help ignite). Once coals are partially covered with gray ash, use tongs if necessary to pour and pile the lit coals at 1 end of the C, making sure lit coals do not touch the other end of the C.\nSerious Eats / Vy Tran\nSet the cooking grate in place, then clean and oil grate. Place brisket, fat side down, directly on the cook grate, centered over the water pan, with the point end facing the gap in C. Cover the grill, position lid vent over the gap in C, and open the vent halfway. Cook, undisturbed, until the meat registers 170℉ (75℃), 4 to 7 hours.\nRemove the brisket from the grill and wrap tightly with a double layer of aluminum foil, making sure the foil is airtight. Remove the cooking grate and, starting at the still-unlit end of the C, pour about 1/2 chimney (3 quarts) of unlit briquettes about halfway around the perimeter of the grill, over the gap in C and spent coals. Carefully pour 4 cups water into the disposable pan. Return the grilling grate.\nSerious Eats / Vy Tran\nReturn the foil-wrapped brisket to the grilling grate centered above the water pan, fat side down. Cover grill and continue to cook until meat registers 195 to 200℉ (90 to 93°C), 2 to 4 hours.\nSerious Eats / Vy Tran\nFor Serving:\nLet wrapped brisket sit, fat side up, for at least 2 hours before serving. Alternatively,\ntransfer the foil-wrapped brisket to an empty insulated cooler, fat side up. Close cooler and let rest for 2 to 3 hours.\nSerious Eats / Vy Tran\nTransfer the smoked brisket to a carving board. Using a sharp slicing knife, cut against grain into 1/4-inch to 1/2-inch slices (some shredding and scraps may occur—this is fine). Serve.\nSerious Eats / Vy Tran\nSpecial Equipment\nSmoker or charcoal grill; 3-inch wood chunks, such as oak or hickory, for smoking; aluminum foil; one (13-by-9-inch) disposable aluminum pan if using a charcoal grill; insulated cooler (optional, for keeping brisket warm)\nNotes\nWe recommend Diamond Crystal kosher salt in most of our recipes because we like its clean flavor and large flakes. It's what we develop and test our recipes with, so we know it works. While it's essential that you use kosher salt in this recipe (table salt's fine grains won't cling to the meat as well), if you can't find Diamond Crystal, it's fine to use another brand of kosher salt. Just be sure to weigh it since different salts have different volumes.\nIf using a charcoal smoker, nestle unlit charcoal briquettes into lit briquettes with one additional 3-inch wood chunk as needed when the temperature starts to drop and the wood and charcoals begin to burn out, to maintain cooking temperature between 225 to 275℉. If using a pellet smoker, follow the manufacturer's instructions for using pellets; do not use wood chunks.\nMake-Ahead and Storage\nThe cooked brisket can be refrigerated in an airtight container for up to 5 days.\nBrisket\nThe Latest\nRecipes\nAmerican\nGrilling",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/texas-style-brisket-doesnt-have-to-be-complicatedheres-proof.webp?"
}