{
  "url": "https://www.seriouseats.com/texas-sheet-cake-big-gooey-fluffy-chocolate-cake-with-pecans",
  "image_url": null,
  "tags": [
    "Sheet Cake",
    "Cakes"
  ],
  "title": "Texas Sheet Cake Recipe",
  "full_text": "Texas Sheet Cake Recipe\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n60 mins\nTotal\n40 mins\nServes\n25 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n12\nounces\nlight brown sugar\n(about\n1 1/2\ncups\n, packed;\n340\ng\n)\n10\nounces\nunsalted butter\n(about\n20\ntablespoons\n;\n280\ng\n), soft but cool, about 65°F/18°C, plus more for greasing the pan\n1 3/4\nteaspoons\nbaking soda\n1\nteaspoon\n(\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\nground cinnamon\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\n4\nlarge\neggs\n(about\n7\nounces\n;\n200\ng\n), brought to about 70°F/21°C\n10\nounces\nall-purpose flour\n, such as Gold Medal (about\n2 1/4\ncups\n, spooned;\n280\ng\n)\n2\nounces\nnatural\ncocoa powder\n, not low-fat (about\n2/3\ncup\n, spooned;\n55\ng\n), plus more for dusting (see note)\n1\nounce\nmalted milk powder\n, such as Carnation (\n1/4\ncup\n;\n30\ng\n); optional\n12\nounces\ncultured low-fat buttermilk\nor kefir (about\n1 1/2\ncups\n;\n340\ng\n), brought to about 70°F/21°C , or a 50/50 blend of milk and plain yogurt\nFor the Chocolate Glaze:\n8\nounces\nmilk\n, any percentage will do (about\n1\ncup\n;\n225\ng\n)\n6\nounces\nunsalted butter\n(about\n12\ntablespoons\n;\n170\ng\n)\n7\nounces\nsugar\n(about\n1\ncup\n;\n200\ng\n)\n1 1/2\nounces\nnatural\ncocoa powder\n, not low-fat (about\n1/2\ncup\n, spooned;\n40\ng\n)\n1/4\nteaspoon\n(\n1\ng\n) Diamond Crystal\nkosher salt\n, or more to taste; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\nvanilla extract\n8\nounces\ntoasted\npecan\nhalves (about\n1 1/2\ncups\n;\n225\ng\n), or to taste, lightly crumbled or chopped\nDirections\nFor the Cake:\nAdjust oven rack to lower-middle position and preheat to 350°F (180°C). Grease a half-sheet pan, dust with cocoa, and tap out the excess.\nSerious Eats / Vicky Wasik\nCombine brown sugar, butter, baking soda, salt, cinnamon, and vanilla extract in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase to medium and cream until fluffy and light, pausing to scrape the bowl and beater halfway through, about 5 minutes. With the mixer running, add the eggs one at a time, letting each fully incorporate before adding the next and scraping the bowl as needed.\nSerious Eats / Vicky Wasik\nMeanwhile, sift together the flour, cocoa, and malted milk powder (if using). Reduce mixer speed to low and sprinkle in a third of the dry mix, followed by a third of the buttermilk. Alternate between the two, allowing each addition to roughly incorporate before adding the next. Once batter is smooth, fold with a flexible spatula to ensure it’s well mixed from the bottom up. Scrape batter into the prepared pan, then spread into an even layer.\nSerious Eats / Vicky Wasik\nBake until the cake is puffed and firm to the touch, though your finger will leave an indentation in the puffy crust, about 25 minutes.\nMeanwhile, for the Chocolate Glaze:\nWhile the cake is baking, combine the milk, butter, sugar, cocoa powder, and salt in a 2-quart stainless steel saucier. Warm over medium-low heat until the butter is melted, then increase heat to medium and bring to a boil, whisking from time to time, until the mixture is homogeneous. Continue cooking until the syrup reaches 220°F (104°C), then shut off the heat and stir in the vanilla. Cover and set aside to keep warm until the cake comes out of the oven.\nSerious Eats / Vicky Wasik\nAs soon as the cake is done, immediately pour the warm glaze on top, working slowly to prevent overflow and using an offset spatula or the back of a spoon to smooth it into an even layer. Cover all over with toasted pecans, as few or as many as you like. Enjoy warm, or let it stand at room temperature until the glaze has fully set. Wrapped in plastic, the glazed cake will keep up to 1 week at room temperature.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nStand mixer\n,\nflexible spatula\n,\nhalf-sheet pan\n,\noffset spatula\n, 2-quart\nstainless steel saucier\n,\ndigital thermometer\nNotes\nBecause cocoa powder is the primary source of flavor in both the cake and the frosting, reaching for the good stuff will make a world of difference. When it comes to chocolate, fat is flavor, and virtually all supermarket cocoa powders are low-fat, which means, conversely, that they're high in starch, giving them a dry and chalky nature. Fortunately, high-quality natural cocoas are easy and affordable to buy online.\nCheck out this guide\nto our top five brands and pick one for yourself.\nMake-Ahead and Storage\nWrapped in plastic, the glazed cake will keep up to 1 week at room temperature.\nRead More\nChocolate Skillet Cake With Milk Chocolate Frosting\nDairy-Free Chocolate Cake\nPig Pickin' Cake (Mandarin Orange Cake with Pineapple Whipped Cream Frosting)\nA Guide to Cake Frosting\nSheet Cake\nCakes"
}