{
  "url": "https://www.seriouseats.com/thai-style-beef-basil-chilies-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ArbBuA6qbiJUnllyKCWhI0ArBRI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__01__20160126-thai-beef-basil-35-kenji-ab1b59dd5a8344d2b21295fd1716a6b1.jpg",
  "tags": [
    "Beef Stir-Fry",
    "Thai",
    "Flank Steaks",
    "Hanger Steak",
    "Skirt Steaks"
  ],
  "title": "Phat Bai Horapha (Thai-Style Beef With Basil and Chiles)",
  "full_text": "Phat Bai Horapha (Thai-Style Beef With Basil and Chiles)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n15 mins\nMarinating Time\n15 mins\nTotal\n35 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nflank steak\n, skirt steak, hanger steak, or flap meat, cut into 1/4-inch-thick strips\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n, divided\n5\nteaspoons\n(\n25\nml\n) Asian\nfish sauce\n, divided\n1\nteaspoon\n(\n4\ng\n)\nwhite sugar\n4 to 6\nfresh red or green\nThai bird\nchiles\n, divided\n6\nmedium cloves\ngarlic\n, divided\n1 1/2\ntablespoons\n(\n20\ng\n)\npalm sugar\n(see notes)\n1\nsmall\nshallot\n, thinly sliced\n4\nmakrut lime leaves\n, very thinly sliced into hairs (central vein discarded), plus more for garnish (see notes)\n2\ntablespoons\n(\n30\nml\n) vegetable or\ncanola oil\n, divided\n2\ncups\npacked\nThai purple basil\n(about\n2\nounces\n;\n55\ng\n) (see notes)\nDried Thai chile flakes or\nred pepper flakes\nto taste (optional)\n1/4\ncup\nfried shallots\n(see notes)\nKosher salt\nCooked rice\n, for serving\nDirections\nCombine beef, 1 teaspoon soy sauce, 2 teaspoons fish sauce, and white sugar in a bowl. Toss to combine and set in refrigerator to marinate for at least 15 minutes and up to overnight.\nRoughly chop half of Thai chiles and garlic and place inside a stone mortar with palm sugar. Grind with pestle until a mostly smooth paste has formed. Add remaining fish sauce and soy sauce and mash in mortar to form a sauce. Set aside. Finely slice remaining garlic and chiles and combine with shallot and lime leaves in a small bowl.\nSerious Eats / J. Kenji López-Alt\nWhen ready to cook, heat 1 tablespoon oil in a wok over high heat until smoking. Add half of beef and cook, without moving, until well seared, about 1 minute. Continue cooking, while stirring and tossing, until beef is lightly cooked but still pink in spots, about 1 minute. Transfer to a large bowl. Repeat with 1 more tablespoon oil and remaining beef, transferring beef to the same bowl. Wipe out wok.\nSerious Eats / J. Kenji López-Alt\nReheat wok over high heat and add all of the beef, along with sliced garlic-chile-lime leaf mixture. Continue to cook, tossing and stirring constantly, until stir-fry is aromatic and shallots have completely softened, about 1 minute.\nSerious Eats / J. Kenji López-Alt\nAdd sauce mixture to wok and cook, tossing and stirring constantly, until completely reduced. (The beef should look moist, but there should be no liquid in the bottom of the wok.) Immediately add basil and toss to combine. Season to taste with salt and optional Thai chile or red pepper flakes. Transfer to a serving platter. Top with more makrut lime threads and fried shallots. Serve immediately with rice.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nMortar and pestle\n(see note),\nwok\nNotes\nPalm sugar is available in most Asian grocery stores. Light brown sugar or panela can be used in place of palm sugar.\nMakrut lime leaf is sold fresh or frozen in Southeast Asian specialty shops, often under the name \"kaffir\" lime leaf. (Note that \"kaffir\" is a derogatory term.) It can be omitted if you can't find it.\nHoly basil (ka-phrao, often marketed as \"krapow\" in the States) or sweet Italian basil can be used in place of purple basil.\nYou can make the crispy fried shallots yourself, or buy them: Check the dried-goods areas of most well-stocked Asian supermarkets.\nGarlic, chiles, and palm sugar can be ground in a mini food processor, chopper, or blender, but a mortar and pestle will deliver the best flavor.\nRead More\nThai-Style Marinated Flank Steak and Herb Salad Recipe\nCrying Tiger (Thai-Style Grilled Steak With Dry Chile Dipping Sauce) Recipe\nIsan-Style Thai Sliced-Steak Salad Recipe\nWok Skills 101: Stir-Frying Basics\nBeef Stir-Fry\nThai\nFlank Steaks\nHanger Steak\nSkirt Steaks",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/phat-bai-horapha-thai-style-beef-with-basil-and-chiles.webp?"
}