{
  "url": "https://www.seriouseats.com/thai-style-grilled-pork-skewers-moo-ping",
  "image_url": "https://www.seriouseats.com/thmb/uBX_NiHjV1-s9O-zRCSi73HoLq8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190618-grilled-thai-pork-skewers-vicky-wasik-13-8b3614c8f6234187abf1396973a4eeea.jpg",
  "tags": [
    "Thai",
    "Grilled Pork",
    "Pork Shoulder",
    "Snacks & Appetizers"
  ],
  "title": "Moo Ping (Thai-Style Grilled Pork Skewers) Recipe",
  "full_text": "Moo Ping (Thai-Style Grilled Pork Skewers) Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n50 mins\nActive\n30 mins\nMarinating Time\n4 hrs\nTotal\n5 hrs 30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nmedium\ngarlic cloves\n(\n20\ng\n), minced\n2\ntablespoons\n(\n15\ng\n)\nminced cilantro stems\n, plus fresh cilantro leaves for serving\n2\ntablespoons\n(\n30\ng\n)\nfinely chopped palm sugar\n(see note)\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n1\ntablespoon\n(\n15\nml\n)\noyster sauce\n1 1/2\nteaspoons\n(\n6\ng\n)\nground white pepper\n1/2\nteaspoon\n(\n2\ng\n)\nMSG\npowder (optional)\n2\npounds\n(\n900\ng\n)\npork butt\n, in one piece\n1\n(5 1/2-ounce; 160ml) can\nunsweetened coconut cream\n1\nrecipe\nThai dried chili-vinegar dipping sauce\n, for serving (optional)\nDirections\nIn a small bowl, combine garlic, cilantro stems, palm sugar, fish sauce, soy sauce, oyster sauce, white pepper, and MSG (if using), and stir until palm sugar is dissolved. Set aside.\nFreeze pork for 15 minutes and up to 30 minutes (partially freezing the pork makes it easier to slice). Using a sharp chef's knife or slicing knife, slice pork against the grain into 2-inch-long, 1-inch-wide, and 1/8-inch-thick strips. The easiest and most efficient way to do this is to start by portioning the pork butt into 2-inch-wide by 1-inch-thick pieces, and then slicing those pieces crosswise into 1/8-inch-thick strips.\nCombine pork and marinade in a large bowl, and toss until every piece of meat is evenly coated in marinade. Cover tightly with plastic wrap and refrigerate for at least 4 hours, and up to 36 hours.\nThread one piece of pork onto a skewer, piercing it through twice to secure it, then pushing meat tightly together like an accordion. Continue threading pork onto skewer, making sure meat is tightly bunched together, leaving no parts of the skewer exposed except for a 2-inch handle at the bottom, and the pointy tip at the top. Repeat skewering process with remaining pork.\nSet up grill for skewers,\nmaking sure to adjust distance between bricks to the length of your skewers.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly in the channel between the bricks.\nPlace skewers directly over hot coals, balancing on top of bricks, with handles overhanging the bricks closest to you and the tips balancing on the farther wall of bricks. Using a brush, brush pork with coconut cream. Cook, turning skewers and brushing pork with coconut cream frequently, until meat is lightly charred, and a piece of pork looks cooked through when removed and cut in half, 8 to 10 minutes; if flare-ups occur, move skewers around as needed to get them away from the flames. Transfer to serving platter and let rest for 1 to 2 minutes. Serve immediately, passing lime wedges, as well as cilantro and dipping sauce (if using), at the table.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nSpecial Equipment\nGrill\n,\nchimney starter\n, bricks,\nbamboo skewers\nNotes\nPalm sugar,\nsometimes labeled as \"coconut sugar,\" can be found at Thai markets, or online. For this recipe, an equal amount of packed light brown sugar can be substituted for palm sugar if you have trouble sourcing it.\nCoconut cream is a richer, thicker, more concentrated version of coconut milk. Find it in cans in the same aisle as canned coconut milk. It is not the same as cream of coconut, which has added sugar.\nMake-Ahead and Storage\nThe grilled skewers are best enjoyed immediately. The marinade can be made in advance, and refrigerated for up to 3 days. The pork can be marinated for up to 36 hours.\nRead More\nAdana Kebabs (Ground Lamb Kebabs)\nThai\nGrilled Pork\nPork Shoulder\nSnacks & Appetizers"
}