{
  "url": "https://www.seriouseats.com/thai-boat-noodles-with-braised-beef-recipe-8411850",
  "image_url": "https://www.seriouseats.com/thmb/gXakH5v4aQL73inRUy27o6Zh87g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-GuaydtiaaoReuuaNeuuaDtoon-AmandaSuarez-hero-2911da0056e04925adf0899435840a29.jpg",
  "tags": [
    "Noodles",
    "Stovetop Beef",
    "Beef Mains",
    "Noodle Mains",
    "Mains"
  ],
  "title": "Guaydtiaao Reuua Neuua Dtoon (Thai Boat Noodles With Braised Beef)",
  "full_text": "Guaydtiaao Reuua Neuua Dtoon (Thai Boat Noodles With Braised Beef)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n3 hrs 45 mins\nTotal\n4 hrs 15 mins\nServes\n4\nMakes\n2 1/2 quarts broth (enough for 10 bowls)\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beef Broth:\n2 1/2\npounds\n(\n1.1k\ng\n)\noxtail,\nabout\n3\nlarge\npieces\n2 1/2\npounds\n(\n1.1\nkg\n)\nbeef neck bones\nKosher salt\n1/2\ncup\n(\n120\nml\n) Thai light (thin)\nsoy sauce\n2\ntablespoons\n(\n30\nml\n) Thai dark (black)\nsoy sauce\n1/2\ncup\nrock\nsugar\n(\n2\nounces\n;\n60\ng\n)\n1/4\ncup\nbrown sugar\n(\n1 3/4\nounces\n;\n50\ng\n)\n1\n(\n3-inch\n)\ncinnamon stick\n(\n10\ng\n)\n2\nteaspoons\nSichuan\npeppercorns\n3\nstar anise\npods\n1 1/2\nteaspoons\ncoriander seeds\n1\nhead\npickled\ngarlic\n(\n1 1/4\nounces\n;\n35\ng\n), see notes\n1 1/2\nteaspoons\nwhole\nwhite peppercorns\nplus\n1 1/2\nteaspoons\nground white pepper\n, divided\n6\nsmall\nshallots\n(\n7\nounces\n;\n200\ng\n), peeled\n15\ncilantro\nroots (\n1 3/4\nounces;\n50\ng\n), see notes\n1\nhead\ngarlic\n(\n1 3/4\nounces\n;\n50\ng\n), unpeeled\n3\npandan\nleaves\n, washed\n1\nsmall\ndaikon radish\n(\n12 ounces\n;\n340 g\n), peeled and sliced into 1/2-inch rounds\n1\n(\n2-inch)\npiece fresh or frozen\ngalangal\n(\n1 1/2 ounces\n;\n42 g\n), cleaned and smashed\n2 to 3\ncubes\nred fermented\nbean curd\n(\n1 1/2\nounces\n;\n40\ng\n), see notes\n2\ntablespoons\n(\n30\nml\n) Thai fermented\nsoybean paste\n1 1/2\nteaspoons\nfive-spice powder\nFor the Roasted Chile Vinegar:\n30\nThai\ngreen chiles\n(about\n2\nounces\n;\n60\ng\n), stemmed\n2\nmedium\ncloves\ngarlic\n(\n10\ng\n), peeled\n1\n(3-inch)\npiece\ngalangal\n(\n10\ng\n), julienned\n1\ncup\n(\n120\nml\n) distilled\nwhite vinegar\n, divided\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Boat Noodle Seasoning:\n1/4\ncup\ngranulated\nsugar\n(about\n2\nounces\n;\n60\ng\n)\n1/4\ncup\n(\n60\nml\n) distilled\nwhite vinegar\n1/4\ncup\n(\n60\nml\n)\nThai fish sauce\n1/4\ncup\n(\n60\nml\n)\nroasted chile vinegar\n, from above\n4\nteaspoons\nroasted\nchile powder\n, see notes\nTo Assemble and Serve:\n1\nquart\n(\n1\nL\n)\nbeef broth\n, from above\n8\nAsian-style frozen\nbeef meatballs\n(see notes)\n4\nteaspoons\n(\n20\ng\n)\ngarlic oil\nfrom\n1\nrecipe\nCrispy Fried Garlic and Garlic Oil\n, plus\ncrispy fried garlic\nfor serving\n4\nounces\nThai thin\nrice noodles\n(vermicelli) from\n1\n(\n1-pound\n;\n454 g\n) package, such as Erawan\n1/4\ncup\n(\n60\ng\n) boat\nnoodle\nseasoning (from above), plus more for serving\n1\nheaping\ncup\nreserved warm\noxtail\nand\nbeef neck meat\n(\n8\nounces\n;\n226\ng\n), from above\n4\nsprigs\nmorning glory\n(50\ng\n), cut into 2-inch segments, then blanched just until tender in salted boiling water and immediately chilled in ice water and drained (see notes)\n2\ntablespoons\nplus\n2\nteaspoons\n(\n40\ng\n) fresh pork or\nbeef blood\n(optional; see notes)\nGround Thai\nchile flakes\n, for serving\nFish sauce\n, for serving\nRoasted chile vinegar\n, from above, for serving\nPork cracklings\n(chicharrones), for serving\nThai basil leaves,\nfor serving\nGranulated sugar\n, for serving\nDirections\nFor the Beef Broth:\nIn a large stock pot, combine oxtail and beef neck bones. Cover with 2 inches of water, set over medium-high heat, and bring to a boil; boil for 5 minutes. Strain bones into a colander, discarding the water, then carefully wash bones under cold running water, removing any bits of scum, any visible marrow in the bones, or coagulated blood. Wash pot.\nSerious Eats / Amanda Suarez\nReturn bones to the pot with 5 quarts (4.75L) water, along with a large pinch of kosher salt, the soy sauce, Thai black soy sauce, rock sugar, brown sugar, cinnamon stick, Sichuan peppercorns, star anise, coriander seeds, pickled garlic, whole white peppercorns, shallots, cilantro roots, garlic, pandan leaves, daikon radish, and galangal. Bring to a boil over high heat, then reduce heat and simmer until beef is tender and the broth is reduced by half, about 3 hours.\nSerious Eats / Amanda Suarez\nUsing a countertop or immersion blender, blend 1 cup (240ml) beef broth with the fermented beancurd and fermented soybean paste until combined. Return to stockpot, then add ground white pepper and five-spice powder. Return to a simmer and cook for 10 minutes.\nSerious Eats / Amanda Suarez\nUsing tongs, transfer oxtail and beef neck bones to a large heatproof bowl and set aside to cool. Using a fine-mesh strainer, strain broth into another large heatproof bowl; you should have about 2 quarts (2L) broth (this is more broth than you will need for the 4 servings this recipe yields; save the rest for future bowls or prepare more toppings than what is instructed in this recipe to make more than 4 bowls ).\nSerious Eats / Amanda Suarez\nWhen the oxtail and neck bones are cool enough to handle, pick the meat from the bones and discard any excess fat. You should have about 11 ounces (340g) each of oxtail and neck bone meat. Add 1/4 cup (60ml) broth to the picked meat to moisten and keep warm.\nSerious Eats / Amanda Suarez\nFor the Roasted Chile Vinegar:\nIn a medium stainless-steel or cast iron skillet set over medium heat, cook chiles until charred on both sides, about 5 minutes. Transfer chiles to the bowl of a food processor and set aside. Add garlic to the skillet and cook until well browned on both sides, about 5 minutes. Add galangal and cook, stirring constantly to prevent garlic and galangel from burning, until slightly dried out, about 3 minutes.\nSerious Eats / Amanda Suarez\nTransfer garlic and galangal to food processor along with 1/2 cup (118ml) distilled white vinegar and pulse until a fine paste forms. Transfer mixture to a medium bowl and whisk in remaining 1/2 cup (118ml) vinegar along with the salt. Set aside.\nSerious Eats / Amanda Suarez\nFor the Boat Noodle Seasoning:\nIn a medium bowl, whisk together granulated sugar, distilled white vinegar, fish sauce, roasted chile vinegar, and roasted chile powder until well-combined. Set aside.\nSerious Eats / Amanda Suarez\nTo Assemble:\nAdd 2 cups (475ml) beef broth to a 1-quart saucepan along with the beef meatballs and bring to a boil, then reduce heat to a simmer and cook, covered, until meatballs are fully heated through, about 5 minutes. Remove from heat and keep warm.\nSerious Eats / Amanda Suarez\nAdd garlic oil to a heatproof medium bowl and set aside. In a pot of boiling water, cook noodles according to package instructions. Drain noodles, then transfer to bowl with garlic oil and toss to coat. Divide noodles among 4 serving bowls.\nSerious Eats / Amanda Suarez\nAdd the 1/4 cup (60g) boat noodle seasoning to a second heatproof bowl. Using a slotted spoon, transfer meatballs to the serving bowls, then return broth to heat and bring to a bare simmer. Stir in pork or beef blood, if using; make sure broth doesn't get so hot that blood coagulates. Stir broth into bowl with boat noodle seasoning.\nSerious Eats / Amanda Suarez\nDivide reserved beef and blanched morning glory among bowls. Ladle broth over the noodles and meat and serve immediately with crispy fried garlic, boat noodle seasoning, chile flakes, fish sauce, roasted chile vinegar, pork cracklings, Thai basil leaves, and sugar alongside.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nLarge stock pot, colander, countertop or immersion blender, tongs or chopsticks, fine-mesh strainer\nNotes\nThai pickled garlic can be found\nonline\nor at Southeast Asian markets.\nThe roots of fresh coriander (a.k.a. cilantro) provide a slight herbal note to curry pastes, but unfortunately they're hard to find in the US, as they are often cut off from the stems before cilantro is brought to market, though Southeast Asian markets and local farmers markets in the summer and fall often have coriander with the roots still attached. If you can't find the herb with the roots still attached, you can use the tender stems of fresh cilantro. And, to clarify, although they are called coriander \"roots,\" Thai cooks usually also use some of the tender green stem.\nFermented beancurd\ncan be purchased online or at Asian grocery stores.\nThai roasted chile powder is made from dried Thai chiles that are dry-roasted in a pan and then ground; to make it from scratch, toast whole dried Thai chiles in a dry skillet over low heat until slightly darkened and toasted, then pulse in a spice grinder to form a powder. Some brands of store-bought Thai chile powder or flakes are made from chiles that have already been roasted; these chile powders will be visibly darker than others.\nFrozen beef balls can be purchased at Asian grocery stores.\nPork or beef blood can be found at Asian butcher counters. Make sure to buy liquid blood (often sold frozen) and not a solid block of already coagulated blood (often sold fresh).\nMorning glory is also sold as ong choy or water spinach. In a pinch, you could substitute Chinese broccoli, spinach, even broccoli rabe, though rabe will be more bitter.\nMake-Ahead and Storage\nThe beef broth and picked meat can be refrigerated separately in airtight containers for up to 5 days and frozen for up to 6 months. Reheat the picked meat with a small amount of additional broth to moisten, as needed.\nThe roasted chile vinegar can be refrigerated in an airtight container for up to 2 months.\nThe boat noodle seasoning can be refrigerated in an airtight container for up to 3 days.\nNoodles\nStovetop Beef\nBeef Mains\nNoodle Mains\nMains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/guaydtiaao-reuua-neuua-dtoon-thai-boat-noodles-with-braised-beef.webp?"
}