{
  "url": "https://www.seriouseats.com/thai-corn-fritters-recipe-11688977",
  "image_url": "https://www.seriouseats.com/thmb/y0U7266pmJ3Qr8j3eWSE6fPeFFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241223-SEA-TodManKhaoPod-FredHardy-Hero-41-514b9740bee941abb6f492bf989ecbb5.jpg",
  "tags": [
    "Corn",
    "Thai",
    "Frying"
  ],
  "title": "Tod Man Khao Pod (Thai Corn Fritters)",
  "full_text": "Tod Man Khao Pod (Thai Corn Fritters)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nTotal\n20 mins\nServes\n30 fritters\nCook Mode\n(Keep screen awake)\nIngredients\n4\nears\nof\ncorn\n(2 pounds total; 907 g) (see notes)\n1\ntablespoon (15 ml)\nThai red curry paste\n1\nlarge\negg\n3/4\ncup\nrice flour\n(about 3 1/2 ounces; 100 g)\n1\nteaspoon\nbaking powder\n1/2\ntablespoon\nDiamond Crystal kosher\nsalt; for table salt use half as much by volume\n3\nmakrut lime leaves\nor\n1/4\ncup\nThai basil leaves\n1\nquart\nvegetable oil\nfor deep-frying\nStore-bought or homemade\nThai sweet chili sauce\nDirections\nRemove corn kernels from cobs (you should have about 2 1/2 cups kernels). Pour oil to a depth of 1 inch in a wok, small Dutch oven, or large heavy-bottomed saucepan. Heat oil over medium heat to 300°F (149°C). Line a large platter or rimmed baking sheet with paper towels; set aside.\nSerious Eats / Fred Hardy\nReserve half of corn kernels and place other half in a blender or food processor along with red curry paste, egg, rice flour, baking powder, and salt; blend until just smooth and batter is loose, about 30 seconds. Transfer mixture to a medium bowl.\nSerious Eats / Fred Hardy\nStack makrut lime leaves (or basil leaves) and roll them up tightly. Slice the roll crosswise as finely as possible. Fold makrut lime leaf strips into corn batter along with reserved whole corn kernels.\nSerious Eats / Fred Hardy\nWorking in batches of about 6 at a time, drop 1 tablespoon size portions of corn batter very gently into oil. It helps to drop the batter closer to the oil’s surface to keep the fritter batter together. Do not over-fill pot. Once the fritters float to the top, continue to fry, flipping occasionally, until fritters are golden brown all over and start to darken around the edges, 3 to 4 minutes. Using a slotted spoon, transfer them to the paper towel-lined platter. Return oil temperature to 300°F (150°C) and repeat with remaining batches of fritters.\nSerious Eats / Fred Hardy\nAllow last batch of fritters to cool slightly before serving them with Thai sweet chili sauce.\nSerious Eats / Fred Hardy\nSpecial Equipment\nDutch oven\nor\nwok\nNotes\nFrozen corn kernels can also be used in this recipe. Make sure to thaw them completely and squeeze as much moisture out of them as possible.\nRead More\nThai Sweet Chili Sauce\nThai Shrimp Cakes with Sweet Chili Sauce\nTam Khao Pod Kai Kem (Thai Corn Salad With Salted Duck Egg)\nCorn\nThai\nFrying",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tod-man-khao-pod-thai-corn-fritters.webp?"
}