{
  "url": "https://www.seriouseats.com/thai-son-in-law-eggs-fried-hard-boiled-eggs-in-tamarind-sauce",
  "image_url": "https://www.seriouseats.com/thmb/59aXOTWeajMzXRhNXBP5_9vryhc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120405-200496-son-in-law-eggs-recipe-53e60be30ee5424f9fc0b6a6a0a9bc47.jpg",
  "tags": [
    "Quick Sides",
    "Fried Eggs",
    "Boiled Eggs",
    "Quick Snacks"
  ],
  "title": "Son-in-Law Eggs: Thai Fried Hard-Boiled Eggs in Tamarind Sauce Recipe",
  "full_text": "Son-in-Law Eggs: Thai Fried Hard-Boiled Eggs in Tamarind Sauce Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nlarge\nshallots\n, peeled and sliced thinly lengthwise\n1/4\ncup\nvegetable oil\n, plus more for deep frying\n8\nlarge\neggs\n, hard-boiled and peeled\n1/2\ncup\nvery finely-chopped palm sugar, packed or\n1/4\ncup\nbrown sugar\n1/4\ncup\nThai fish sauce\n2\ntablespoons\nprepared tamarind pulp\n3\ntablespoons\nwater\n2\nred jalapeño\npeppers\nor half a red bell pepper, deseeded and cut into slivers, for garnish\nFresh cilantro leaves\nfor garnish\nDirections\nAdd sliced shallots and 1/4 cup of vegetable oil to a small skillet set on low heat (it is imperative that you add the shallots to cold oil lest they burn before crisping up). Stirring constantly, cook shallots until they are golden brown and crispy. With a slotted spoon, transfer fried shallots to a paper towel-lined plate; set aside.\nAdd enough oil to a medium saucepan so that it comes up about 2 inches high. Place pot on medium-high heat. Once oil is hot, gently drop hard-boiled eggs into it. Stir eggs around to ensure even browning. Once egg exteriors are thoroughly browned, fish them out with a slotted spoon, slice them in half with a serrated knife, and arrange halved eggs on a serving platter.\nDiscard oil from the skillet in which you fried the shallots and set the skillet on medium heat. Add sugar, fish sauce, tamarind, and water to it; bring mixture to a gentle boil, stirring constantly. Once sugar has fully dissolved, check for consistency. The sauce should have the consistency of maple syrup. If at this point the sauce is still too thin, reduce it a bit more. If it is too thick, add a little more water to thin it out. Once you have the desired consistency, remove skillet from heat and pour sauce over prepared eggs.\nSprinkle fried shallots over the top of the eggs. Garnish with red pepper slivers and cilantro leaves. Serve son-in-law eggs with steamed jasmine rice.\nNotes\nIt's more traditional to use palm sugar. But if you don't have it, brown sugar can be used to create very similar results. The one component that should not be left out, however, is the fried shallots.\nRead More\nYam Khai Dao (Thai Fried Egg Salad) Recipe\nKhai Jiao (Thai-Style Omelet) Recipe\nQuick Sides\nFried Eggs\nBoiled Eggs\nQuick Snacks"
}