{
  "url": "https://www.seriouseats.com/thai-pork-noodle-soup-with-meatballs-recipe-8410350",
  "image_url": "https://www.seriouseats.com/thmb/Ah-JOhKOBSxtnzQA6SGGyDYqLIU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-GuaydtiaaoMooNamSai-AmandaSuarez-hero-3d3dc2bd66c14afb817aa7e89bba7382.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Noodles",
    "Thai",
    "Pork"
  ],
  "title": "Guaydtiaao Moo Nam Sai (Thai Clear Pork Noodle Soup With Pork Meatballs)",
  "full_text": "Guaydtiaao Moo Nam Sai (Thai Clear Pork Noodle Soup With Pork Meatballs)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n10 mins\nTotal\n30 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinated Pork and Meatballs:\n8 ounces (\n227\ng\n) boneless pork loin or boneless, skinless\npork shoulder\n, sliced 1/8-inch thick\n1 tablespoon plus 2 teaspoons (\n25\nml)\nfish sauce\n, divided\n1/4\nteaspoon\nfreshly ground\nwhite pepper,\ndivided\nPinch of kosher\nsalt\n8 ounces\n(227\ng\n)\nground pork,\npreferably 20% fat\n1\nteaspoon\n(5ml) Golden Mountain Seasoning\nSoy Sauce (see notes)\n1\nteaspoon\ngranulated sugar\nFor the Chile Vinegar:\n1\ncup\n(240ml) distilled\nwhite vinegar\nPinch\nkosher salt\n4 red\nchiles\n, such as Holland, Fresno, or Cayenne (\n2 1/2\nounces\n; 70g), stemmed and thinly sliced crosswise (see notes)\nTo Prepare and Assemble the Bowls:\n3\ncups\n(710ml)\nNam Cheua Gradook Moo\n(Thai\npork stock\n)\nOne 1\n2\n-\nounce\n(284g) package fresh egg\nwonton noodles\n2\ntablespoons\nplus 2 teaspoons (40g)\ngarlic oil\nfrom Crispy Fried Garlic, plus crispy fried garlic for serving\n4\nounces (112g)\nmung bean sprouts\n1/4\ncup\n(60ml)\nfish sauce\n, plus more for serving\n2\nscallions\n,\ngreen\nparts only, sliced into 1/4-inch pieces\n5 sprigs (\n10\ng)\ncilantro\n, cut into 1/2-inch pieces\n5\nsprigs\n(10g) Chinese\ncelery\nleaves and stalks, cut into 1/2-inch pieces\nGround\nwhite pepper,\nfor serving\nGround\nroasted\nThai\nchile flakes\n, for serving\nGranulated\nsugar\n,\nfor\nserving\nDirections\nFor the Marinated Pork and Meatballs:\nIn a mixing bowl, toss sliced pork with 2 teaspoons fish sauce (10ml), 1/8 teaspoon white pepper, and a pinch of salt until evenly coated. Set aside.\nSerious Eats / Amanda Suarez\nIn another mixing bowl, combine the minced pork, Golden Mountain Sauce, remaining 1 tablespoon fish sauce (15ml), remaining 1/8 teaspoon white pepper, and sugar. Using clean hands, vigorously stir ground pork, occasionally picking up the mixture and smacking it against the bowl, until meatball mixture is homogeneous and very sticky (it should begin to be difficult to handle), about 3 minutes.\nSerious Eats / Amanda Suarez\nIn a medium pot of boiling water, cook the marinated sliced pork, using chopsticks to separate the pieces, until just cooked through, 20 to 30 seconds. Using a wire skimmer, transfer sliced pork to a clean bowl and set aside.\nSerious Eats / Amanda Suarez\nReturn the water to a boil. Working quickly and using clean hands, pinch off about 1 tablespoon of the meatball mixture and lightly press together to form a roughly shaped ball slightly smaller than a ping pong ball, then drop into the boiling water. Repeat with remaining meatball mixture until all is in the pot. Cook until meatballs float to the top and are fully cooked through, 2 to 3 minutes. Using a wire skimmer, transfer pork balls to bowl with the sliced pork; set aside. Reserve pot of boiling water for assembly steps below.\nSerious Eats / Amanda Suarez\nFor the Chile Vinegar:\nIn a small saucepan, bring vinegar and salt to a boil over high heat. Remove from heat and add chiles. Let steep for at least 30 minutes (vinegar will be best after 1 day).\nSerious Eats / Amanda Suarez\nTo Prepare and Assemble the Bowls:\nIn a medium saucepan, bring pork stock to a boil; cover and keep hot. Return the pot of water used to cook the pork to a boil, then add the egg noodles, and cook, stirring with chopsticks to prevent sticking, according to package directions. Using a spider, transfer noodles to a large bowl. Add garlic oil to noodles and toss to coat. Divide noodles among 4 serving bowls.\nSerious Eats / Amanda Suarez\nReturn stock to a simmer, then warm bean sprouts until just heated through about 15 seconds. Using a spider, transfer bean sprouts to serving bowls. Add meatballs and sliced pork to stock and simmer until just heated through, about 15 seconds. Using a spider, divide meatballs and sliced pork among the bowls with the noodles.\nSerious Eats / Amanda Suarez\nAdd fish sauce to stock, then ladle hot pork broth over the noodle bowls and garnish with scallions, cilantro, Chinese celery, white pepper, and fried garlic. Serve immediately, allowing guests to season their bowls with fish sauce, white pepper, Thai chile flakes, sugar, and chile vinegar to taste.\nSerious Eats / Amanda Suarez\nNotes\nYou can substitute rice noodles for the egg noodles. The types that are typically served with this dish are thin rice noodles (known as sen mee), medium rice noodles (sen lek), or wide rice noodles (sen yai).\nA Holland chile and Fresno chile will have a similar mild heat level balanced with a sweet finish, while a fresh Cayenne chile will be spicier. A jalapeño chile may also be substituted in this recipe.\nIf Golden Mountain Seasoning Soy Sauce is unavailable, Maggi seasoning or Thai light soy sauce are the best substitutions.\nMake-Ahead and Storage\nThe chile vinegar can be refrigerated in an airtight container for up to 2 months.\nSoups\nThe Latest\nNoodles\nThai\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/guaydtiaao-moo-nam-sai-thai-clear-pork-noodle-soup-with-pork-meatballs.webp?"
}