{
  "url": "https://www.seriouseats.com/thai-pork-stock-recipe-8410330",
  "image_url": "https://www.seriouseats.com/thmb/IbsJLhYCwlN11yy8BlBtReCSoLw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-Thai-Pork-Stock-AmandaSuarez-hero-12c53d2dbe3045eb988d567a3f55473b.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Thai",
    "Pork"
  ],
  "title": "Nam Cheua Gradook Moo (Thai Pork Stock)",
  "full_text": "Nam Cheua Gradook Moo (Thai Pork Stock)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n2 hrs 30 mins\nTotal\n2 hrs 35 mins\nServes\n8\nMakes\n2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\n4 1/2\npounds\n(about\n2\nkg\n)\npork backbone\n, cut into 2-inch pieces (see notes)\n1 teaspoon (\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half as much by volume\n1\nsmall\ndaikon radish\n(\n13\nounces\n;\n375\ng\n), sliced into 1/2-inch rounds\n5\nmedium\nscallions\n(about\n50\ng\ntotal), white and green parts, cut into thirds\n1\nhead\ngarlic\n(\n45\ng\n), cloves separated and peeled\nOne\n2-inch piece\n(\n30\ng\n) fresh peeled\nginger\n, sliced into rounds\n5\ncilantro\nroots\nor stems (\n20\ng\n), cleaned and sliced (see note)\n1 1/2\nteaspoons\n(\n6\ng\n)\nwhite peppercorns\nDirections\nIn a large stock pot, combine pork backbone pieces with water to cover and bring to a boil over high heat. Boil for 5 minutes and then drain into a colander set in the sink. Wash the pot and bones of any excess scum.\nSerious Eats / Amanda Suarez\nReturn the pork to the cleaned stock pot, add 4 quarts water along with the salt, and bring to a simmer. Simmer for 1 hour, skimming any scum that rises to the surface. After 1 hour, add daikon, scallions, garlic, ginger, cilantro roots or stems, and white peppercorns and continue simmering until stock is reduced by half (about 2 quarts (2L)), about 1 hour longer.\nSerious Eats / Amanda Suarez\nStrain stock through a fine-mesh strainer set over a large bowl or second pot and let cool. If stock has over-reduced, add water to bring total volume to 2 quarts (2L). Let cool to room temperature then transfer to containers and refrigerate until completely chilled, about 6 hours. Skim off and remove any fat on the surface, if desired (fat can be refrigerated or frozen for another use). Refrigerate stock for up to 5 days or freeze for up to 6 months.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nLarge stock pot\n,\nfine-mesh strainer\nNotes\nAsk your butcher to cut the backbone; they will have a bandsaw that will make quick work of it. If you can't find pork backbone, neckbones are a good substitute.\nThe roots of fresh cilantro (known as coriander outside the U.S.) provide a slight herbal note to dishes but are unfortunately hard to find in the States, as they are often removed from the stems before going to market (though local farmers’ markets in the summer and fall often have cilantro with the roots still attached). Coriander roots can also be found in Southeast Asian markets. If you can't find the herb with the roots still attached, you can either replace it with an equal weight of tender stems or omit it altogether. And, to clarify, although they are called coriander \"roots,\" Thai cooks usually also use some of the tender green stems.\nMake-Ahead and Storage\nPork stock can be refrigerated for up to 5 days or frozen for up to 6 months.\nSoups\nThe Latest\nThai\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/nam-cheua-gradook-moo-thai-pork-stock.webp?"
}