{
  "url": "https://www.seriouseats.com/thai-style-fried-shallots",
  "image_url": "https://www.seriouseats.com/thmb/70SVCdgA6VBCeJvpRbvPSzSgRKk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2013__02__20201027-fried-shallots-microwave-vicky-wasik-15-8850066f12364debbb5937bae6d9f2f1.jpg",
  "tags": [
    "Condiments & Sauces",
    "Thai",
    "Onions",
    "Snacks & Appetizers"
  ],
  "title": "Fried Shallots",
  "full_text": "Fried Shallots\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nActive\n25 mins\nTotal\n25 mins\nServes\n12 servings\nMakes\n1 1/2 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n450\ng\n)\nshallots\n, peeled and sliced into 1/16-inch-thick rounds (see notes)\n2\ncups\n(\n475\nml\n)\nvegetable oil\nKosher salt\nDirections\nLine a rimmed baking sheet with a double layer of paper towels. Set a fine-mesh strainer over a large heatproof bowl or medium saucepan.\nSerious Eats / Vicky Wasik\nIf cooking on stovetop:\nCombine shallots and oil in a medium saucepan or wok. Place over high heat and cook, stirring frequently, until shallots begin to bubble, 2 to 3 minutes. Continue cooking, stirring constantly as the shallots fry to ensure even cooking, until shallots turn pale golden brown, 8 to 10 minutes longer. Working quickly, pour contents of saucepan into prepared strainer set over bowl. (Shallots will continue cooking for a brief period after draining, so do not allow them to get too dark.)\nSerious Eats / Vicky Wasik\nIf cooking in microwave:\nCombine shallots and oil in a large microwave-safe bowl, and stir with a fork to separate rounds. Microwave on high power for 5 minutes. Stir, making sure to loosen any pieces of shallot clinging to the sides of the bowl. Continue to microwave in 2-minute increments, stirring between each round, until shallots begin to turn lightly golden, 6 to 8 minutes total. Microwave in 30-second increments, stirring between each round, until evenly pale golden brown, 30 seconds to 1 minute 30 seconds longer. Working quickly, pour contents of bowl into prepared strainer set over bowl. (Shallots will continue cooking for a brief period after draining, so do not allow them to get too dark.)\nSerious Eats / Vicky Wasik\nImmediately transfer shallots to prepared baking sheet, spread them out into an even layer, and season with salt. Allow shallots to drain, then carefully lift the top layer of paper towels and roll shallots onto second layer, blotting gently with the first. Allow shallots and oil to cool to room temperature, then transfer to separate airtight containers. Store fried shallots at room temperature, and shallot oil in the refrigerator.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFine-mesh strainer\n,\nrimmed baking sheet\nNotes\nUsing a mandoline will produce the most even thickness for the sliced shallots.\nMake-Ahead and Storage\nFried shallots can be stored in an airtight container at room temperature for up to two months. Fried-shallot oil can be refrigerated in an airtight container for up to one month.\nRead More\nThe Microwave Makes Quick, Easy Work of Fried Shallots and Garlic\nDeviled Eggs With Crispy Shallots and Chiles Recipe\nSalmon Poke With Macadamia Nuts and Fried Shallots Recipe\nCondiments & Sauces\nThai\nOnions\nSnacks & Appetizers",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/fried-shallots.webp?"
}