{
  "url": "https://www.seriouseats.com/thai-style-spicy-chicken-banana-blossom-herb-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/pOqjBFJxLygEvbkwJWQbbmQ9ZUQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__08__20140728-banana-blossom-chicken-salad-kenji-539e829714fc458e8753097d1061de4e.jpg",
  "tags": [
    "Quick Salads",
    "Thai",
    "Chicken Breast"
  ],
  "title": "Thai-Style Spicy Chicken, Banana Blossom, and Herb Salad (With Lots of Fried Things) Recipe",
  "full_text": "Thai-Style Spicy Chicken, Banana Blossom, and Herb Salad (With Lots of Fried Things) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n60 mins\nCooling Time\n10 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n1\nbone-in, skin-on chicken breast half\nKosher salt\nFor the Fried Aromatics:\n1/2\ncup\nvegetable, canola, or\npeanut oil\n3\nmedium\nEuropean shallots\nor\n6 to 8\nThai shallots\n, thinly sliced (about\n1/2\ncup\n, see note)\n4\nlarge\ncloves\nstandard\ngarlic\nor\n8 to 12\ncloves\nThai garlic\n, roughly smashed in a mortar and pestle (about\n3\ntablespoons\n, see note)\n2\nstalks\nfresh lemongrass\n, outer leaves removed, pale lower 4 inches only, thinly sliced crosswise (about\n1/4\ncup\n, see note)\n4\nmakrut lime\nleaves\n, stems discarded, sliced as thinly as possible (see note)\n1/2\ncup\nraw peanuts\nFor the Dressing:\n4 to 10\nThai chiles\n, roughly chopped (see note)\n2\nlarge\ncloves\nstandard\ngarlic\n, or\n4 to 6\ncloves\nThai garlic\n, peeled, roughly chopped\n3\ntablespoons\npalm sugar\n(see note)\n2\ntablespoons\nThai fish sauce\n, plus more to taste\n2\ntablespoons\nfresh lime juice\nfrom\n2\nlimes\n, plus more to taste\n1\ntablespoon\ndried crushed Thai chile powder (or\nred chile flakes\n), plus more to taste\nFor the Salad:\n1\nbanana blossom\n1/3\ncup\nroughly chopped fresh cilantro leaves\n1/3\ncup\nroughly chopped\nmint leaves\nDirections\nFor the Chicken:\nPlace chicken in a small saucepan and cover with cold water. Season well with salt. Bring to a boil over medium-high heat, cover, and remove from heat. Let sit until an instant-read thermometer inserted into the deepest part of the chicken registers 145°F (63°C), about 15 minutes. Transfer chicken to a bowl and let stand until cool enough to handle. Discard bones and skin. Shred meat into 1- to 2-inch pieces and set aside.\nFor the Fried Aromatics:\nMeanwhile, heat oil in a large wok over high heat until shimmering. Add shallots and cook, stirring constantly, until golden brown, about 2 minutes. Quickly remove with a strainer or slotted spoon and transfer to a paper towel-lined bowl.\nRepeat frying with garlic, followed by lemongrass, and lime leaves, adding each fried aromatic to the same bowl with the shallots. Season fried aromatics with salt and toss to combine.\nAdd peanuts to oil, reduce heat to medium-low, and cook, stirring frequently, until golden brown, 3 to 4 minutes. Remove peanuts with a strainer or slotted spoon and transfer to a small bowl to cool. Set aside 2 tablespoons oil and allow to cool. Discard remaining oil.\nFor the Dressing:\nAdd Thai chiles and garlic to the bottom of a mortar and pestle. Add 1 tablespoon of palm sugar. Pound until a nearly smooth paste is formed (this will take a while, be patient). Add remaining 2 tablespoons palm sugar and pound until incorporated. Add fried peanuts and pound until roughly crushed. Add fish sauce, lime juice, and dried chiles and stir to incorporate.\nFor the Salad:\nFill a large bowl with 3 quarts of water and add 1/4 cup of vinegar. Lay a clean kitchen towel or a layer of sturdy paper towels over the top. Peel off the tough outer layer of the banana blossom's leaves and discard. Split banana blossom in half lengthwise, then, using a sharp chef's knife or mandoline, slice crosswise as thinly as possible. Immediately transfer sliced banana blossom to the bowl and lay the towel over it to keep it submerged. When ready to add to the salad, remove towel and carefully skim off and discard the tiny sliced buds (it's ok if a few of them remain). Dry sliced banana blossom on a clean kitchen towel or in a salad spinner and proceed.\nAdd shredded chicken to the bottom of a large bowl. Add the dressing and reserved frying oil and toss to incorporate. Massage the chicken, gently loosening its fibers with your fingers. Add the chopped cilantro, mint, and banana blossom and toss to combine. Reserve 2 tablespoons mixed fried aromatics and add the rest to the bowl with the salad. Toss to combine, then taste and adjust flavor with more fish sauce, lime juice, or dried chiles as necessary. Transfer to a serving bowl, top with remaining fried aromatics, and serve immediately.\nSpecial Equipment\nMortar and pestle\n,\nwok\n,\ninstant-read thermometer\n,\nchef's knife\nor\nmandoline\nNotes\nIf possible, use smaller, sweeter Thai shallots and garlic for the recipe. If using Thai garlic, the skins can be left on the individual cloves when frying. Makrut lime leaves can be found in Thai supermarkets. Fresh lemongrass can be found in most Asian markets, or some high-end Western supermarkets.\nThai chiles can vary in heat. Taste a tiny bit of your chiles before smashing and adjust the quantity accordingly. The dressing should be quite hot to balance out its sweetness. Palm sugar can be found in Thai markets. If unavailable, substitute with brown sugar.\nBanana blossom can be found in East Asian or Indian grocery stores. If unavailable, you can also make this salad with thinly shaved cabbage.\nRead More\nHow to Stock a Thai Pantry: Essential Ingredients for Your Shopping List\nQuick Salads\nThai\nChicken Breast",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/thai-style-spicy-chicken-banana-blossom-and-herb-salad-with-lots-of-fried-things-recipe.webp?"
}