{
  "url": "https://www.seriouseats.com/thai-duck-noodle-soup-recipe-8411268",
  "image_url": "https://www.seriouseats.com/thmb/Cr_5TNydTDYBDVPV6GcJnbwbxq8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-GuaydtiaaoBpetDtoon-AmandaSuarez-hero-b5d8bee296f744c180f5cf7bc1626979.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Noodles",
    "Thai",
    "Duck"
  ],
  "title": "Guaydtiaao Bpet Dtoon (Thai Duck Noodle Soup)",
  "full_text": "Guaydtiaao Bpet Dtoon (Thai Duck Noodle Soup)\nClose\nJump to recipe\nPrep\n20 mins\nCook\n3 hrs 30 mins\nCooling Time\n15 mins\nTotal\n4 hrs 5 mins\nServes\n4\nto 6\nMakes\n2 1/2 quarts\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n1\nwhole\nduck\n(about\n6 pounds\n;\n2.72 kg\n), giblets removed\n1\nmedium\nwhite onion\n(\n8\nounces\n;\n225\ng)\n, peeled and halved\n3/4\ncup\n(\n180\nml\n) Thai light (thin)\nsoy sauce\n1/2\ncup\n(\n50\ng\n) roughly chopped Chinese\ncelery roots\nor stems (see notes)\n1/2\ncup\n(\n50\ng\n)\ncilantro\nroots or stems (about\n15\nroots; see notes)\n1/4\ncup\n(\n60\nml)\nThai dark (black)\nsoy sauce\n3\ntablespoons\n(\n30\ng\n) Thai brown\nrock sugar\n(also sold as rock candy)\n3\ntablespoons\n(\n30\ng\n)\npalm sugar\n1\nhead\ngarlic\n(\n50\ng\n), unpeeled\n1\n(2-inch) piece\nfresh or frozen\ngalangal\n(\n20\ng\n)\n1\ncinnamon stick\n(about\n9\ng\n)\n2\nteaspoons\nSichuan\npeppercorns\n1 1/2\nteaspoons\nwhole black\npeppercorns\n1 1/2\nteaspoons\ncoriander seeds\n1\nteaspoon\nwhite\npeppercorns\n6\nstar anise\npods\n3\npandan\nleaves, washed\nFor the Chile Vinegar:\n1\ncup\n(\n240\nml\n) white\ndistilled vinegar\n1\npinch\nkosher salt\n4\nred\nchiles,\nsuch as Holland, Fresno, or Cayenne (\n2 1/2\nounces\n;\n70\ng\n), stemmed and sliced into rings\nFor the Bowls:\n4\nounces\n(\n113\ng\n)\nChinese broccoli,\nsliced into 1/4-inch pieces\n1\n(12-ounce) package\nthin fresh\negg noodles\n(wonton noodles)\n2\ntablespoons\nplus\n2\nteaspoons\n(\n40\ng\n)\ngarlic oil\nfrom\n1\nrecipe\nCrispy Fried Garlic and Garlic Oil\n, plus crispy fried garlic for serving\n6\nstems\nChinese celery\nincluding leaves, cut into 1/2-inch lengths\nFish sauce\n,\nThai light (thin) soy sauce\n, ground\nroasted Thai chiles\n, and\ngranulated sugar\n, for serving\nDirections\nFor the Broth:\nButcher duck (you can see\nour guide here\n) by first removing duck head and neck (if attached) and wings. Trim excess skin and fat from neck and cavity area, then remove both legs. Cut away backbone, then remove breasts from bone cage. Cut neck and backbone into roughly 3-inch pieces.\nSerious Eats / Amanda Suarez\nIn a large stock pot, add duck head and neck (if available), backbone, breastbone, and wings and cover with water by about 1 inch. Bring to a boil over high heat; boil for 5 minutes, then drain duck in colander placed in sink. Rinse duck parts under cold water, washing off as much scum as you can. Wash pot, then return duck to pot along with 4 quarts of water, the onion, light soy sauce, celery roots or stems, cilantro roots or stems, dark soy sauce, rock sugar, palm sugar, garlic, galangal, cinnamon stick, Sichuan peppercorns, black peppercorns, coriander seeds, white peppercorns, star anise, and pandan leaves. Bring to a boil, then reduce heat to low and simmer for 30 minutes.\nSerious Eats / Amanda Suarez\nAdd duck legs and continue to cook until duck meat is tender and stock is reduced by about half, about 2 hours. Add duck breasts and poach until just cooked through (about 150°F; 65°C), 7 to 10 minutes. Remove duck legs and breasts and strain broth through a fine-mesh strainer. You should have about 2 quarts of strained broth. Skim off duck fat if a more lean broth is desired.\nSerious Eats / Amanda Suarez\nWhen meat is cool enough to handle, remove bone from each duck leg while keeping the skin on. Reserve duck.\nSerious Eats / Amanda Suarez\nFor the Chile Vinegar:\nIn a small saucepan, bring vinegar and salt to a boil over high heat. Remove from heat and add chiles. Let steep for at least 30 minutes (vinegar will be best after 1 day).\nSerious Eats / Amanda Suarez\nFor the Bowls:\nIn a covered medium saucepan, warm 3 cups (710ml) of the broth over medium-low heat with the duck legs and breasts.\nIn a medium bowl, prepare an ice water bath. In a large pot of boiling salted water, blanch Chinese broccoli until slightly tender and bright green, about 15 seconds. Using a skimmer, transfer to ice water bath.\nSerious Eats / Amanda Suarez\nReturn water to a boil, add egg noodles, and cook according to package directions. Drain noodles in a colander and transfer to a large bowl. Add garlic oil and mix with chopsticks to coat.\nSerious Eats / Amanda Suarez\nRemove duck meat from broth. Slice leg meat into bite-size pieces. Slice breast meat thinly.\nSerious Eats / Amanda Suarez\nDivide noodles and then broccoli into individual bowls. Arrange duck meat in each bowl. Ladle broth into each bowl and garnish with crispy fried garlic and Chinese celery leaves and stems. Serve immediately, allowing guests to season and garnish their bowls to taste with chile vinegar, fish sauce, Thai light (thin) soy sauce, ground Thai chiles, and granulated sugar.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nNotes\nThe roots of fresh Chinese celery and coriander (a.k.a. cilantro) can be hard to find in the US, as they are often cut off from the stems before being brought to market (though local farmers markets in the summer and fall often have coriander with the roots still attached). Chinese celery and coriander roots can be found at Southeast Asian markets. If you can't find the herb with the roots still attached, you can use the stems. And, to clarify, although they are called \"roots,\" Thai cooks usually also use some of the green stems as well.\nMake-Ahead and Storage\nThe duck broth can be made ahead and refrigerated in an airtight container for up to 5 days in advance or frozen for up to 6 months. If making in advance, store the portioned duck in some of the broth.\nThe chile vinegar can be refrigerated in an airtight container for up to 2 months.\nSoups\nThe Latest\nNoodles\nThai\nDuck",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/guaydtiaao-bpet-dtoon-thai-duck-noodle-soup.webp?"
}