{
  "url": "https://www.seriouseats.com/thai-coconut-sticky-rice-mango-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zAKoiU4mF2lL9f1HfbqNknt3mrk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160323-mango-sticky-rice-vicky-wasik-5-5ec805a5a1bd4403a0d72347ec35f693.jpg",
  "tags": [
    "Desserts",
    "Thai",
    "Mango",
    "Coconut Milk & Cream",
    "White Rice"
  ],
  "title": "Khao Niao Mamuang (Thai Coconut Sticky Rice With Mango) Recipe",
  "full_text": "Khao Niao Mamuang (Thai Coconut Sticky Rice With Mango) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n60 mins\nSoaking Time\n80 mins\nTotal\n2 hrs\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\nThai sweet sticky rice\n(\n7\nounces\n;\n200\ng\n) (see notes)\n1\n(\n14-ounce\n;\n400 ml\n)\ncan full-fat coconut milk\n, blended well to incorporate fat, divided\n1/2\ncup\nsugar\n(\n3 1/2\nounces\n;\n100\ng\n), divided\nKosher salt\n2\nteaspoons\n(\n6\ng\n)\ncornstarch\n2\nAtaúlfo mangoes\n(about\n6\nounces\nor\n170\ng\neach), peeled, pitted, and sliced (see notes)\nToasted sesame seeds\n, for garnish\nDirections\nIn a large bowl, cover rice with water by several inches and let stand at room temperature 1 hour or up to overnight.\nDrain rice. Assemble a steamer, line with cheesecloth or a clean kitchen towel, and add rice, smoothing surface to form an even layer. Set over high heat, bring water in steamer to a boil, cover, and cook until rice is tender, about 20 minutes.\nSerious Eats / Vicky Wasik\nMeanwhile, in a small saucepan, bring half the coconut milk to a simmer over medium heat, stirring frequently. Whisk in 1/4 cup plus 2 tablespoons sugar and a large pinch of salt until dissolved. The coconut milk should taste salty-sweet.\nSerious Eats / Vicky Wasik\nTransfer cooked rice to a large heatproof bowl and pour coconut milk mixture on top (it will look like too much liquid). Stir well to combine, cover with plastic, and let stand until liquid is absorbed, about 20 minutes. (You can let it stand up to 2 hours at room temperature.)\nSerious Eats / Vicky Wasik\nMeanwhile, clean saucepan and add remaining coconut milk to it. Bring to a simmer over medium heat, stirring frequently. In a small bowl, combine cornstarch with a couple of teaspoons of the hot coconut milk and stir to form a slurry. Whisk cornstarch slurry into coconut milk and simmer until thickened, about 3 minutes. Whisk in remaining 2 tablespoons sugar and a large pinch of salt until dissolved. Keep coconut cream warm.\nWhen ready to serve, mound coconut rice onto plates and arrange sliced mango alongside. Drizzle coconut cream all over rice and garnish with toasted sesame seeds. Serve right away.\nSpecial Equipment\nSteamer, cheesecloth or clean kitchen towel\nNotes\nAtaúlfo mangoes are a variety from Mexico that are much better than the Tommy Atkins variety usually sold.\nThai sticky rice (also sold as \"sweet\" and \"glutinous\" rice) can be found online and at Asian groceries; other varieties of sticky short-grain rice, like sushi and risotto rice, will not work as a substitute here.\nDesserts\nThai\nMango\nCoconut Milk & Cream\nWhite Rice"
}