{
  "url": "https://www.seriouseats.com/thai-tea-cake-with-condensed-milk-custard-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/cBZ9EAeG4_ZRXxzCq3PUdvLvI9g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20120604-208699-Thai-Tea-Cake-with-Condensed-Milk-Sauce-Recipe-308889f91ae34adcab3e977185462e16.jpg",
  "tags": [
    "Cakes",
    "Thai",
    "Baking",
    "Condensed Milk"
  ],
  "title": "Thai Tea Cake with Condensed Milk Custard Sauce Recipe",
  "full_text": "Thai Tea Cake with Condensed Milk Custard Sauce Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n30 mins\nTotal\n55 mins\nServes\n12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nwhole milk\n, room temperature, divided\n2\ntablespoons\nunsweetened loose Thai tea leaves\n8\ntablespoons\n(\n1\nstick\n)\nunsalted butter\n, softened\n1 1/2\ncups\n(about\n10 1/2\nounces\n)\ngranulated sugar\n3\nlarge\neggs\n, room temperature\n2 1/4\ncups\n(about\n11 1/2\nounces\n)\nall-purpose flour\n1/2\nteaspoon\nsalt\n2\nteaspoons\nbaking powder\n6\nlarge\negg yolks\n1\n(14-ounce) can\nsweetened condensed milk\nDirections\nPlace 1 1/4 cups milk in a heat-proof bowl or glass measuring cup; microwave until warm, about 30 seconds. Add tea leaves and set aside.\nGrease 10-inch springform pan or a 13- by 9- by 2-inch pan, and line it with a piece of parchment paper; set aside. Preheat oven to 350° F.\nIn a medium bowl stir together flour, salt, and baking powder; set aside. In a large mixing bowl beat butter with an electric mixer on medium speed until fluffy, about 30 seconds. Add sugar, 1/4 cup at a time, and continue to beat until the mixture is well combined, scraping down the sides of the bowl as needed.\nAdd eggs to the butter mixture, one at a time, beating after each addition, about 1 minute total.\nStrain tea-infused milk through a fine mesh strainer. With a rubber spatula, alternately fold in flour mixture and tea-infused milk to butter mixture. Once the batter is well combined, spread it into the prepared pan, and bake until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Remove the cake from the oven and let it cool in the pan.\nMeanwhile, make the custard sauce by putting the remaining milk and condensed milk in a 1-quart heavy-bottomed pot or saucier over medium-low heat, whisking to combine. Place egg yolks in a medium mixing bowl and whisk until smooth.\nOnce the condensed milk mixture starts to boil, immediately remove the pot from heat. With one hand, slowly pour the hot milk into the yolks in thin stream. With the other hand, whisk the mixture vigorously making sure everything is well blended.\nPour the egg mixture back into the empty milk pot and put it on low heat, whisking constantly. In less than a minute, the custard sauce will thicken up. Take the pot off the heat, strain the custard through a fine-mesh strainer into a serving container, preferable one with a spout; keep covered and warm. (You should end up with approximately 2 1/2 cups of sauce.)\nServe the cake with the warm custard sauce. (If the sauce becomes too thick upon standing, thin it out with a little bit of warm milk.)\nThis Recipe Appears In\nMy Thai: Thai Tea Cake with Condensed Milk Custard Sauce\nCakes\nThai\nBaking\nCondensed Milk",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/thai-tea-cake-with-condensed-milk-custard-sauce-recipe.webp?"
}