{
  "url": "https://www.seriouseats.com/thai-sticky-rice-khao-niao",
  "image_url": "https://www.seriouseats.com/thmb/jp0wACNzzSVNDjuMCy9erCim9x0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190416-pork-shoulder-vicky-wasik-64-8da9630e1b6e4341b530888c73100d90.jpg",
  "tags": [
    "Southeast Asian",
    "Stovetop",
    "Rice & Grain Sides",
    "Thai"
  ],
  "title": "Khao Niao (Thai Sticky Rice) Recipe",
  "full_text": "Khao Niao (Thai Sticky Rice) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n10 mins\nSoaking Time\n4 hrs\nTotal\n4 hrs 40 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n28\nounces\n;\n800\ng\n)\nThai sticky rice\n(see note)\nDirections\nIn a large bowl, cover rice with cool water for at least 4 hours or up to overnight. Alternatively, to speed up the process, use hot water, and soak the rice for at least 2 hours.\nSerious Eats / Vicky Wasik\nUsing a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. Refill the bowl with cool water so that when the fine-mesh strainer is set inside it, the rice in the strainer is fully submerged under water. Using your hands, stir the rice in the strainer to release starch into the water, making it cloudy. Lift the strainer with the rice out of the bowl, and discard the soaking water. Repeat this process until the water in the bowl is mostly clear, about 3 more times. Rinsing off the excess starch in this manner ensures that the grains of rice remain separate when cooked, and don't steam into a clumpy brick.\nSerious Eats / Vicky Wasik\nAssemble a steamer (see note), filling the bottom with 1 to 2 inches of water, and lining the steamer basket with a double-layer of damp cheesecloth that has a 3-inch overhang over the sides of the basket. Transfer rice to cheesecloth-lined steamer basket, and use your hands to pat rice into an even layer. Fold overhanging cheesecloth over the rice to form a parcel, then cover with a lid.\nSerious Eats / Vicky Wasik\nBring water in steamer to a boil over high heat, place steamer basket over it, and lower heat to a steady simmer. Cook for 10 minutes, then remove lid and carefully flip parcel of rice over so that the folded up bundle is now on the bottom. Cover again with lid, and continue to cook until rice is tender, but still chewy, about 10 minutes longer. Flipping the rice halfway through cooking ensures the rice cooks evenly, and it's most important to do when you're steaming a large amount of rice at once. If you're only cooking a couple cups of rice, you can skip the flip.\nSerious Eats / Vicky Wasik\nRemove from heat, and flip bundle over once more so that the folded over parts of cheesecloth are facing you. Transfer rice to a heatproof bowl and cover it with a plate (you can discard the cheesecloth at this point, or if you used a bamboo steamer and wish to use the steamer basket as a serving vessel, keep the rice in its cheesecloth parcel and unwrap it right before serving). Let rice cool slightly for 10 to 15 minutes before serving. Serve immediately.\nSpecial Equipment\nFine-mesh strainer\n,\nsteamer\n, cheesecloth\nNotes\nThai sticky rice (also sold as \"sweet\" and \"glutinous\" rice) can be found online and at Asian markets; other varieties of sticky short-grain rice, like sushi and risotto rice, will not work as a substitute here.\nIf you don't have a bamboo steamer, you can use a stainless steel steamer insert, or even a colander. If you have a traditional Thai sticky rice steamer, which looks a bit like an oversized pour-over coffee rig with a metal jug base and a bamboo basket instead of a filter, then obviously you don't need my help and you can carry on making sticky rice as usual.\nMake-Ahead and Storage\nFinished sticky rice will stay warm for about 1 hour, if covered. Sticky rice can be reheated in the microwave; cover and heat on low power, checking every 30 seconds, until warmed through.\nRead More\nThai-Inspired Slow-Roasted Pork Shoulder Feast\nBiko (Filipino Sticky Rice Cake)\nA Comprehensive Guide to Rice Varieties\nSoutheast Asian\nStovetop\nRice & Grain Sides\nThai",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/khao-niao-thai-sticky-rice-recipe.webp?"
}