{
  "url": "https://www.seriouseats.com/thai-coconut-custard-dip-sangkhaya",
  "image_url": "https://www.seriouseats.com/thmb/5gSsCb4SOWA5MszrvmRMDIzgQZ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120326-thai-coconut-dip-e90f3bd3773e4b15a130a08a8f83dcaa.jpg",
  "tags": [
    "Dips",
    "Thai",
    "Coconut Milk & Cream"
  ],
  "title": "Sangkhaya (Thai Coconut Custard Dip)",
  "full_text": "Sangkhaya (Thai Coconut Custard Dip)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n5 mins\nActive\n5 mins\nTotal\n15 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2 to 3\nfrozen pandan\nleaves\n, thawed, rinsed, and blotted dry (see note)\n1\ncup\ncoconut milk\nor a combination of\n1/2\ncup\ncoconut milk\nand\n1/2\ncup\nwhole milk\n3\nlarge\negg yolks\n1/2\ncup\nplus\n2\ntablespoons\ngranulated sugar\n1/8\nteaspoon\nsalt\n1\ntablespoon\ncornstarch\nAbout\n6\nounces\nof\nwhite bread\n(pain de mie, brioche, sweet dinner rolls work well), cut into 1-inch cubes\nDirections\nCut pandan leaves into 1-inch pieces and place them in a blender or food processor along with coconut milk. Blend until smooth and strain. With a rubber spatula, press out as much liquid out of the mixture as possible. Hopefully, you’ll get one cup of the pandan-coconut milk mixture. If not, add more coconut milk or whole milk to the liquid so that it measures one cup.\nSerious Eats / Leela Punyaratabandhu\nIn a medium saucepan, whisk together the yolks, sugar, salt, and cornstarch until smooth. Very slowly whisk in the pandan-coconut milk mixture. Make sure there are no lumps.\nSerious Eats / Leela Punyaratabandhu\nPlace the saucepan over medium heat and slowly bring the mixture to a gentle boil, whisking constantly. In about two minutes the mixture will thicken up to the consistency of yogurt. When that happens, take the saucepan off the heat and let the custard cool.\nSerious Eats / Leela Punyaratabandhu\nIn the meantime, steam the bread cubes by placing them in a heatproof bowl, covered with a piece of plastic wrap, and microwave on high for 40 to 60 seconds. Keep the bread covered.\nOnce the dip has cooled down to slightly warmer than room temperature, transfer it to a serving bowl and serve with the steamed bread cubes.\nNotes\nPandan (or pandanus) leaves are available frozen at most Asian grocery stores. If you cannot find them, you can leave them out entirely and scent the dip with a teaspoon of vanilla extract. You can also use a teaspoon of artificial pandan extract (it comes in a small glass bottle) in place of pandan leaves, if you can find it. What you should steer clear of, however, is what is labeled \"pandan juice\" or \"pandan extract\" that comes in a can. It's too diluted; its green color is marred by oxidation; its scent is almost nonexistent; it's completely useless in this application.\nRead More\nPandan Chiffon Cake\nThai-Inspired Coconut-Pandan Rice Pudding With Fresh Mango\nHow to Make Pastry Cream (Crème Pâtissière Recipe)\nDips\nThai\nCoconut Milk & Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/sangkhaya-thai-coconut-custard-dip.webp?"
}