{
  "url": "https://www.seriouseats.com/thanksgiving-turkey-reuben-sandwich-recipe-8739771",
  "image_url": "https://www.seriouseats.com/thmb/FlkdVOaiqz_n393t5TcxBRBXWmU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20191010-leftover-turkey-reuben-sandwich-vicky-wasik-hero-a7f18588174f4a789d3430abf814ca38.jpg",
  "tags": [
    "Turkey",
    "Sandwiches",
    "Thanksgiving Turkeys",
    "Thanksgiving"
  ],
  "title": "Turkey Reuben",
  "full_text": "Turkey Reuben\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nTotal\n25 mins\nServes\n4\nMakes\n4 sandwiches\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Russian Dressing:\n1/3\ncup\n(80ml)\nmayonnaise\n2\ntablespoons\n(30ml)\nketchup\n2\ntablespoons\n(30ml)\nturkey gravy\n2\ntablespoons\n(30g) chopped dill pickles or\ndill pickle relish\n2\ntablespoons\n(30g)\nprepared horseradish\n1\ntablespoon\n(15ml)\nfresh lemon juice\n(from 1 lemon)\nKosher salt\nand freshly ground black pepper\nFor the Sandwiches:\n1\npound\n(450g) leftover\nroast turkey\n, pulled or sliced into 1/4-inch-thick pieces\n2\ntablespoons\n(30ml) homemade\nturkey\nor\nchicken\nstock, or store-bought,\nlow-sodium chicken stock\n1 1/2\ncups\n(8 ounces; 225g)\nsauerkraut\n1/4\ncup\n(3 ounces; 85g) store-bought or\nhomemade\ncranberry sauce\n5\ntablespoons\n(70g)\nunsalted butter\n, softened\n8\nslices\nrye bread\n8\nslices\n(8 ounces; 225g)\nSwiss cheese\nDirections\nFor the Russian Dressing:\nIn a small bowl, stir together mayonnaise, ketchup, gravy, pickles, horseradish, and lemon juice. Season to taste with salt and pepper, and set aside.\nFor the Sandwiches:\nPreheat oven to 350°F (175°C). Lay a sheet of aluminum foil on a rimmed baking sheet and place turkey in the center. Bring foil edges up to form walls, then add stock to turkey. Bring edges of foil together, and crimp seal foil packet. Transfer to oven to heat turkey through, about 10 minutes.\nSerious Eats / Vicky Wasik\nMeanwhile, in a small saucepan, combine sauerkraut and cranberry sauce and set over medium heat, stirring occasionally, until warmed through, about 5 minutes; cover and keep warm.\nEvenly spread butter on one side of each slice of bread. Heat a larger cast iron skillet or griddle over medium heat. Working in batches, toast bread, butter-side down, until crisp and golden brown, 3 to 4 minutes. Transfer toasted bread slices to a rimmed baking sheet, toasted-side up; allow to cool slightly.\nSerious Eats / Vicky Wasik\nFlip bread slices over, so untoasted sides are facing up. Spread Russian dressing evenly on each slice of bread. If you are finishing sandwiches on a griddle or in a skillet, layer one slice of cheese on each slice of bread. If you are finishing sandwiches in the oven, layer one slice of cheese on only four slices of bread. Divide turkey evenly over four bread slices (for oven sandwiches, use the four slices without cheese), making sure to let any excess stock drip off before arranging on bread. Divide cranberry-sauerkraut mixture evenly over turkey. Layer remaining cheese slices over cranberry-sauerkraut.\nSerious Eats / Vicky Wasik\nIf finishing sandwiches in the oven, transfer baking sheet to the oven and bake until cheese is fully melted, about 3 minutes. Close sandwiches, pressing each one together lightly. If finishing sandwiches on a griddle, close sandwiches and cook over medium heat, pressing down on sandwiches with a weight or spatula, until cheese is fully melted, about 2 minutes on each side. Serve immediately.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRimmed baking sheet\nor\n12-inch cast iron skillet\nor\nelectric griddle\n;\nChef's Press\nMake-Ahead and Storage\nThe sandwiches are best enjoyed immediately. Russian dressing can be made ahead and refrigerated in an airtight container for up to 3 days.\nTurkey\nSandwiches\nThanksgiving Turkeys\nThanksgiving",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/turkey-reuben.webp?"
}