{
  "url": "https://www.seriouseats.com/the-ultimate-patty-melt",
  "image_url": null,
  "tags": [
    "Sandwiches",
    "The Latest",
    "Stovetop Beef",
    "Burgers",
    "Quick Dinners"
  ],
  "title": "The Best Patty Melt",
  "full_text": "The Best Patty Melt\nJump to recipe\nPrep\n5 mins\nCook\n35 mins\nActive\n15 mins\nTotal\n40 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\ntablespoons\n(\n90\ng\n)\nbutter\n4\nslices\nDeli-style rye bread\n4\nslices\nAmerican cheese\n, torn into large pieces (optional; see note)\n4\nslices\nSwiss cheese\n, torn into large pieces\nKosher salt\nFreshly ground black pepper\n1/2\npound\n(\n226\ng\n)\nfreshly ground chuck\n, formed into\n2\n(\n4-ounce\n)\npatties\n, roughly the size and shape of 1 slice bread\n1\nlarge\nyellow onion\n(\n10\nounces\n;\n283\ng\n), split in half, sliced thin from pole to pole (about\n2\ncups\n)\n1/2\ncup\n(\n118\nml\n)\nwater\nDirections\nMelt 1 tablespoon butter in a 12-inch heavy-bottomed skillet over medium heat until foaming. Add 2 slices bread and swirl around pan using hand or spatula. Cook, swirling occasionally until pale golden brown, about 3 minutes. Transfer to cutting board cooked-side up. Divide American cheese evenly between slices, layering them in the center and leaving a 1/4-inch gap around the edges.\nSerious Eats / Amanda Suarez\nRepeat step 1 with remaining bread slices and Swiss cheese.\nSerious Eats / Amanda Suarez\nSeason hamburger patties on both sides with salt and pepper. Return skillet to heat to high and melt 1 tablespoon butter in skillet until light brown. Swirl to coat bottom of skillet and add both burger patties. Cook without moving until dark brown crust forms on first side, about 1 1/2 minutes, reducing heat to medium if butter begins to burn or smoke excessively. Flip burgers using spatula and cook on second side without moving until crust develops, 1 1/2 minutes longer.\nSerious Eats / Amanda Suarez\nTransfer burger patties to plate and reduce heat to medium. Add onions, 1 tablespoon butter, and 2 tablespoons water to skillet. Season with salt and pepper. Cook, stirring constantly and scraping up browned bits from bottom of skillet until water evaporates and onions start to fry and leave brown residue on bottom of pan. Add another 2 tablespoons water and continue to cook. Repeat 2 more times until water is used up and onions are soft and deep golden brown. Add collected juices from meat plate to onions and continue to cook for 30 seconds. Onions should be moist, but not dripping.\nSerious Eats / Amanda Suarez\nDivide onion mixture evenly between cheese-topped toast slices. Add burger patties to slices with American cheese and close sandwiches.\nSerious Eats / Amanda Suarez\nAdd 1 tablespoon butter to skillet. Return to medium heat and cook until butter melts. Sprinkle with salt. Swirl to coat pan and add sandwiches. Cook, swirling sandwiches around pan frequently until deep golden brown on bottom, about 5 minutes. Remove sandwiches from skillet, melt remaining tablespoon butter in pan and sprinkle with salt. Return sandwiches to skillet and cook, swirling frequently until second side is golden brown and cheese is melted. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-inch heavy-bottomed skillet\nSerious Eats / Amanda Suarez\nNotes\nThe American cheese here diverges from a classic patty melt's sole use of Swiss cheese in order to get maximum gooiness in the finished sandwich. That said, it alters the flavor of the sandwich and adds a saltier punch; whether for reasons of convenience or preference, you should feel free to use only Swiss cheese, but if you do, we recommend doubling the amount of the Swiss cheese to account for the lack of American cheese slices.\nSandwiches\nThe Latest\nStovetop Beef\nBurgers\nQuick Dinners"
}