{
  "url": "https://www.seriouseats.com/the-best-ways-to-make-whipped-cream-recipe-6755273",
  "image_url": "https://www.seriouseats.com/thmb/Nkx7nmi5D6fKrHmYkLopUwqTXrs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221205-HowToWhipCream-AmandaSuarez-26-6600ee54f8dd466f9f2f5269d24afcb6.jpg",
  "tags": [
    "Heavy Cream",
    "The Latest"
  ],
  "title": "The Best Methods for Making Whipped Cream, Explained",
  "full_text": "The Best Methods for Making Whipped Cream, Explained\nClose\nJump to recipe\nPrep\n5 mins\nTotal\n5 mins\nServes\n8\nto 12 servings\nMakes\n1\nto 2 cups, depending on method\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n235\nml\n) cold\nheavy cream\n2\nteaspoons\nsuperfine or\ngranulated sugar\n, or to taste (optional; see headnote for more guidance)\n1/2\nteaspoon\nvanilla extract\n(optional)\nSalt\n(optional)\nDirections\nFor the Hand-Whisk Method:\nIn a large wide bowl, combine cream, and, if using, sugar, vanilla extract, and a pinch of salt. Using a balloon whisk, beat cream by alternating between the following motions: moving the whisk quickly from side-to-side and in circles around the perimeter of the bowl while gently lifting. As you whisk, you’ll begin to see trails in the cream that stay put. Continue to whisk until soft peaks form; if you lift the whisk, peaks will form but immediately slump over. You can use the whipped cream at soft peaks or continue to whisk until stiff peaks form. At this point, the whipped cream will be fluffy and thick; if you lift the whisk, the peaks will stand up straight. Do not whisk beyond stiff peaks. Serve or use as desired.\nFor the Stand (or Hand) Mixer Method:\nIn the bowl of a stand mixer fitted with the whisk attachment, combine cream, and, if using, sugar, vanilla extract, and a pinch of salt. If using sugar, whisk on low speed until sugar is fully dissolved, about 30 seconds. Increase speed to medium-high; as you whisk, you’ll begin to see trails in the cream that stay put. Continue to whisk until soft peaks form, about 1 minute; if you lift the whisk, peaks will form but immediately slump over. You can use the whipped cream when at soft peaks or continue to whisk until stiff peaks form, about 10 seconds. At this point, the whipped cream will be fluffy and thick; if you lift the whisk, the peaks will stand up straight. Do not whisk beyond stiff peaks. Serve or use as desired.\nFor the Food Processor Method:\nIn the bowl of a food processor fitted with a metal blade, combine cream, and, if using, sugar, vanilla extract, and a pinch of salt. Pulse until thick and creamy like Greek yogurt, less than 1 minute (the time will vary with the horsepower of your machine). Serve or use as desired.\nFor the Whipping Siphon Method:\nIf using sugar, combine cream and sugar in a bowl, and mix until sugar is fully dissolved. Add cream, vanilla extract (if using), and a pinch of salt (if using) to the siphon canister, screw on lid, and charge with 1 nitrous oxide cartridge. Shake canister 15 times, dispense whipped cream, and serve.\nSpecial Equipment\nBalloon whisk (optional), stand mixer (optional), food processor (optional), whipping siphon (optional)\nMake-Ahead and Storage\nWhipped cream made by hand-whisking or in a stand mixer can be refrigerated in an airtight container for up to 12 hours. To store for longer, refer to the headnote for guidelines on how to stabilize whipped cream.\nWhipped cream made in a food processor can be refrigerated in an airtight container for up to 1 week.\nWhipped cream in a whipping siphon can be refrigerated for up to 10 days; shake it a few times before dispensing.\nRead More\nCrème Légère\nCream Puffs\nNo-Churn Vanilla Ice Cream\nFernet-Spiked Irish Coffee With Lemon Cream\nHeavy Cream\nThe Latest"
}