{
  "url": "https://www.seriouseats.com/the-secret-ingredient-pink-peppercorn-gougeres",
  "image_url": "https://www.seriouseats.com/thmb/ZCjhsjFuKhdReEbiePV7ESOaMvQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100411PinkPeppercornParmesanGougere610-ab9764f0e75f489ab04a036af2a979a5.jpg",
  "tags": [
    "Savory",
    "French",
    "Vegetarian Snacks & Appetizers",
    "Pastries",
    "Parmesan"
  ],
  "title": "The Secret Ingredient (Pink Peppercorn): Pink Peppercorn and Parmesan Gougères Recipe",
  "full_text": "The Secret Ingredient (Pink Peppercorn): Pink Peppercorn and Parmesan Gougères Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n55 mins\nCooling Time\n35 mins\nTotal\n100 mins\nCook Mode\n(Keep screen awake)\nIngredients\n1\nstick\nunsalted butter\n1\ncup\nwater\n1\ncup\nflour\n3\neggs\n1\ncup\ngrated\nParmigiano Reggiano\n1\ntablespoon\nfreeze-dried\npink peppercorns\n, roughly chopped\nDirections\nPreheat the oven to 400 degrees.\nIn a covered saucepot, bring the butter and water to a boil with a pinch of salt.\nWhen the water boils and the butter is fully melted, take the pan off the heat, and dump in the flour.\nReturn the pan to low heat, and stir vigorously with a wooden spoon for 30 to 45 seconds, or until the mixture comes together, and comes away from the sides of the pan. Turn the dough out into a large bowl (and soak that pot immediately to help with clean up!).\nAllow the dough to cool just slightly for a few minutes. Then, adding one egg at a time, stir the eggs into the dough with a wooden spoon. It is vigorous work, but at the end, you will have a sticky dough.\nStir in the cheese and the pink peppercorns, and fully incorporate.\nUse a medium-sized ice cream scoop to make balls of the dough. Line them up on a Silpat-lined baking sheet, leaving some room between them to allow them to puff up. Bake for 10 minutes at 400 degrees F.\nAfter 10 minutes, lower the heat to 350 degrees F, and bake another 35 to 40 minutes, until hard to the touch. Pull them out of the oven, and let them sit for 10 minutes on the baking sheet. Then, allow them to cool further on a cooling rack. Eat warm or at room temperature.\nSavory\nFrench\nVegetarian Snacks & Appetizers\nPastries\nParmesan"
}