{
  "url": "https://www.seriouseats.com/the-ultimate-beef-wellington-recipe",
  "image_url": "https://www.seriouseats.com/thmb/MLaMPV1-y_VRSpSyLuRFnpkuCzc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-ultimate-beef-wellington-recipe-step-17_edited-7d3dd38835a34be2bf320848b2d6d292.jpg",
  "tags": [
    "Roasted Beef",
    "Christmas Dinners",
    "British",
    "Christmas",
    "Tenderloin Steak"
  ],
  "title": "The Ultimate Beef Wellington Recipe",
  "full_text": "The Ultimate Beef Wellington Recipe\nClose\nJump to recipe\nPrep\n40 mins\nCook\n90 mins\nActive\n90 mins\nChilling Time\n90 mins\nTotal\n3 hrs 40 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncenter-cut\nbeef tenderloin\n, trimmed of silverskin and fat, about\n2\npounds\n(see note)\nKosher salt\nand\nfreshly ground black pepper\n2\ntablespoons\nplus\n1/2\nteaspoon\nvegetable\nor\ncanola oil\n, divided\n2\ntablespoons\nprepared horseradish\n1\ntablespoon\nDijon\n,\nspicy brown\n, or\nhot English mustard\n1\npound\nmushrooms\n(\nbutton\n,\ncremini\n,\nshiitake\n,\nportabello\n, or a\nmix\n) cleaned, trimmed, and roughly chopped\n4\ntablespoons\nunsalted butter\n2\nmedium\nshallots\n, finely diced (about\n1/2\ncup\n)\n2\nteaspoons\nfinely minced fresh thyme leaves\n1/2\ncup\nCognac\nor other\nbrandy\nor\nbarrel-aged spirit\n, such as\nbourbon\n1/2\ncup\nheavy cream\n2\nteaspoons\nsoy sauce\n4\nounces\nfresh foie gras\n(about\n2\n1/2-inch\nslabs\n, see note)\n1\nsheet\nphyllo dough\n1/4\npound\nprosciutto\n, sliced paper thin\nFlour\n, for dusting\n14\nounces\nfrozen\nor\nhomemade\npuff pastry\n, thawed (see note)\n1\negg\n, beaten\nCoarse sea salt\n, such as\nMaldon\nor\nfleur de sel\n1\nbunch\nfinely minced chives\nDirections\nUsing butcher's twine, tie tenderloin at 1-inch intervals. Trim ends of twine. Season liberally with salt and pepper.\nSerious Eats / Diana Chistruga\nHeat 2 tablespoons oil in a cast iron or stainless steel skillet over high heat until smoking. Add tenderloin and cook without moving until well-browned on first side, about 2 minutes. Rotate tenderloin and continue cooking until browned on all sides, about 10 minutes total. Transfer to a large plate.\nSerious Eats / Diana Chistruga\nCombine horseradish, mustard, and 1 teaspoon black pepper in a small bowl. When tenderloin is cool enough to handle, cut off and discard twine, then rub on all surfaces with horseradish/mustard mixture. Place in refrigerator, uncovered.\nSerious Eats / Diana Chistruga\nPlace half the mushrooms in the bowl of a food processor and pulse until very finely chopped, scraping down sides and redistributing mushrooms with spatula as necessary, about 10 short pulses. Transfer to a bowl. Repeat with remaining mushrooms.\nSerious Eats / Diana Chistruga\nHeat butter in a 12-inch skillet over medium-high heat until melted. Add mushrooms and cook, stirring occasionally, until mushrooms have exuded all their liquid and start to sizzle, about 8 minutes. Continue cooking until mushrooms begin to brown and leave browned bits stuck to bottom of pan, about 4 minutes longer. Add shallots and thyme and cook, stirring frequently, until softened, about 2 minutes.\nSerious Eats / Diana Chistruga\nAdd brandy. Scrape bottom of skillet with a silicone spatula or wooden spoon to release browned bits. Continue to cook until brandy is nearly dry, about 4 minutes. Add heavy cream and soy sauce and continue to cook, stirring frequently until mixture is thick and collects in one large mass when you shake the skillet. Season to taste with salt and pepper. Transfer to a bowl and place in the refrigerator.\nSerious Eats / Diana Chistruga\nSeason foie gras liberally with salt and pepper. Heat remaining half teaspoon oil in a small cast iron or stainless steel skillet over high heat until smoking. Add foie gras and cook without moving until well browned on first side, about 30 seconds. Carefully flip with a small offset spatula and brown second side, about 30 seconds longer. Transfer foie gras to a paper towel-lined plate. Pour rendered fat into mushroom mixture, stir to combine, and return to refrigerator. Use a sharp knife to split each piece of cooked foie gras in half horizontally. Transfer to a plate and place in refrigerator. Allow all ingredients to chill for at least 30 minutes.\nSerious Eats / Diana Chistruga\nLay a double layer of plastic wrap about 2 feet long and 1 foot wide on a cutting board. Lay phyllo dough on top of plastic wrap. Shingle prosciutto on top of phyllo to create a thin, even, overlapping layer, leaving a 2-inch border along the bottom and top of the phyllo dough. Spread mushroom mixture evenly over ham layer.\nSerious Eats / Diana Chistruga\nPlace tenderloin along the very bottom edge of the ham/mushroom layer. Place sliced foie gras evenly over top of tenderloin (see note). Carefully roll tenderloin in mushroom, ham, and phyllo, using the plastic wrap to help tighten it as you roll. Once beef is completely rolled up, re-wrap with more plastic wrap, twisting the ends to make sure roll is very tight. Return to refrigerator for at least 30 minutes.\nSerious Eats / Diana Chistruga\nDust board or countertop lightly with flour. Spread puff pastry on board and, using a rolling pin, roll it into a rectangle at least 4 inches wider than the beef roll on its shorter side.\nSerious Eats / Diana Chistruga\nUnwrap beef roll and place along very bottom edge of puff pastry with the foie gras side facing up. Brush 6 inches of puff pastry just above beef roll with beaten egg. Carefully roll the beef in the puff pastry until it is completely wrapped. You should end up with the foie gras-side facing up again, with the puff pastry seam meeting on the bottom. Trim pastry with a sharp knife.\nSerious Eats / Diana Chistruga\nFold sides of puff pastry protruding from either end of the beef roll towards the center, then fold the top flaps down. Trim off the bottom flaps carefully.\nSerious Eats / Diana Chistruga\nRoll entire beef roll over so that the bottom is facing up, then fold up the end flaps to seal completely. Roll beef back right-side up. Transfer to a plate and chill for at least 30 minutes.\nSerious Eats / Diana Chistruga\nAdjust oven rack to center position and preheat oven to 425°F (218°C). Transfer Wellington to a foil-lined baking sheet and brush all over with beaten egg. Use a sharp paring knife to score a decorative pattern in the pastry. Sprinkle liberally with coarse sea salt. Bake until pastry is golden brown and center of roast registers 110°F (43°C) for rare or 120°F (49°C) for medium-rare on an instant-read thermometer, 35 to 45 minutes. Remove from oven and allow to rest for ten minutes.\nSerious Eats / Diana Chistruga\nUse a thin metal spatula to loosen Wellington from foil, then carefully transfer to a carving board. Slice off the ends with a sharp knife. Carve Wellington, sprinkle cut surfaces with chives and more coarse salt, and serve.\nSerious Eats / Diana Chistruga\nSpecial Equipment\nButcher's twine,\ninstant-read thermometer\n,\nrimmed baking sheet\n,\nserrated knife\nNotes\nA center-cut beef tenderloin is also known as a Châteubriand. For best results, use a high-quality all-butter puff pastry, such as Dufour. Alternatively, make your own\nusing this recipe\n. Foie gras pâté can be used in place of the fresh foie gras. If using pâté, skip step 7. In step 9, spread foie gras pâté on top of tenderloin in place of sliced fresh foie gras.\nRoasted Beef\nChristmas Dinners\nBritish\nChristmas\nTenderloin Steak"
}