{
  "url": "https://www.seriouseats.com/the-best-corn-chowder-recipe",
  "image_url": "https://www.seriouseats.com/thmb/bdtn9hbcET-WdTaIYoWldqYmSeM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-the-best-corn-chowder-recipe-hero-1df17c05fc8440aeaed24085b3ab83b2.jpg",
  "tags": [
    "Soups",
    "Vegetarian Mains",
    "Corn",
    "Summer Mains"
  ],
  "title": "The Best Corn Chowder",
  "full_text": "The Best Corn Chowder\nClose\nJump to recipe\nPrep\n20 mins\nCook\n30 mins\nActive\n20 mins\nTotal\n50 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nears\ncorn\n, husks and silks removed\n1 1/2\nquarts\nlow-sodium\ncanned or homemade chicken or\nvegetable stock\n1\nbay leaf\n1\nteaspoon\nwhole fennel seeds\n1\nteaspoon\ncoriander seeds\n1\nteaspoon\nwhole black peppercorns\n4\ntablespoons\nbutter\n1\nmedium\nonion\n, finely diced (about\n1\ncup\n)\n2\nmedium\ncloves garlic\n, minced\n3\ntablespoons\nflour\n1\nto\n2\nrusset potatoes\n, peeled and cut into 1/2-inch dice (about\n1 1/2\ncups\ndiced potato\n)\nKosher salt\nand\nfreshly ground black pepper\n2\ncups\nhalf-and-half\nSugar\n3\ngreen onions\n, finely sliced\nDirections\nHold one corn cob upright in a large bowl and cut off kernels with a sharp knife. Repeat with remaining cobs and reserve kernels and cobs separately.\nSerious Eats / Qi Ai\nUse the back of a knife to scrape corn cobs into a medium saucepan to collect any milk left in the bases of the kernels. Break corn cobs in half and add to saucepan. Add chicken or vegetable stock, bay leaf, fennel seeds, coriander seeds, and whole black peppercorns. Stir to combine. Bring to a boil over high heat, reduce to just below a simmer, and let steep for 10 minutes. Strain through a fine mesh strainer and discard cobs and spices.\nSerious Eats / Qi Ai\nWhile stock infuses, melt butter in a separate 3 quart saucepan over medium-high heat. Add onion, garlic, and corn kernels, and cook, stirring frequently, until onion is softened and kernels are tender, about 7 minutes. Reduce heat if butter begins to brown. Add flour and cook, stirring constantly, for 1 minute.\nSerious Eats / Qi Ai\nStirring constantly, gradually add infused corn stock, letting mixture come to a simmer. Add potatoes and 1 teaspoon salt. Let simmer, stirring occasionally, until potatoes are tender, about 10 minutes. Add half and half and stir to combine. Soup may look broken with melted butter floating on top at this stage.\nSerious Eats / Qi Ai\nTransfer 1/4 of soup to a blender and blend on high until smooth, about 1 minute. Return to pot and whisk to combine. Alternatively, use a hand blender to blend in the pot until desired consistency is reached. Season to taste with salt, pepper, and sugar (with very fresh picked corn, sugar should not be necessary). Serve immediately, sprinkled with sliced green onions, or chill and serve cold. (Once chilled, you can adjust the texture by whisking in water a tablespoon at a time until desired consistency is reached.)\nSerious Eats / Qi Ai\nSpecial Equipment\nImmersion\nor\ncountertop blender\n,\nfine-mesh strainer\nRead More\nThe Serious Eats Guide to Corn\nPressure Cooker Corn Soup Recipe\nPressure Cooker Corn Risotto Recipe\nCreamy Corn Dip With Feta, Mint, and Tomatoes Recipe\nSweet and Savory Corn Casserole Recipe\nKorean Corn Cheese Recipe\nSoups\nVegetarian Mains\nCorn\nSummer Mains"
}