{
  "url": "https://www.seriouseats.com/the-ultimate-chicken-noodle-soup",
  "image_url": "https://www.seriouseats.com/thmb/ileDVktppwVpJWQ3BiazKDbGlMA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2017__12__20171213-chicken-soup-sohla-vicky-wasik-15-1de09f1733984b26a1a7637188a58fac.jpg",
  "tags": [
    "Soups",
    "Sous Vide Chicken",
    "Chicken",
    "Pastas",
    "Winter Mains"
  ],
  "title": "The Ultimate Chicken Noodle Soup Recipe",
  "full_text": "The Ultimate Chicken Noodle Soup Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n4 hrs 5 mins\nActive\n60 mins\nTotal\n4 hrs 20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n900\ng\n; about\n10\n)\nchicken\nwings\n1\nlarge\n(8-ounce; 225 g)\nyellow onion\n2\nboneless, skinless chicken breast\nhalves\n(about\n1\npound\n;\n450\ng\n)\nKosher salt\nand freshly ground black pepper\n1 1/2\ncups\n(\n4\nounces\n;\n115\ng\n)\ndried orecchiette pasta\n(or other shape of your choice)\n1/4\nbunch\n(\n1/2\nounce\n;\n15\ng\n)\nfresh dill\nsprigs, roughly chopped\n1\nlemon\n, cut into wedges\nDirections\nPreheat the oven to 550°F (290°C) and adjust the rack to the center position. Evenly spread the chicken wings directly on an unlined rimmed baking sheet. Roast the wings until golden brown, about 30 minutes.\nRemove wings from the oven and drain any rendered chicken fat into a heatproof dish and reserve. Pour about 1/2 cup of water on to the baking sheet and scrape up any browned bits that may be stuck to the bottom. Transfer the wings along with the water and dissolved browned bits to a 3-quart sauce pot. Cover with 1 1/2 quarts of water.\nSerious Eats / Vicky Wasik\nBring to a boil over high heat, then let boil vigorously for 15 minutes. Reduce to a simmer, then cook gently for 2 hours, adding water as needed to maintain the 1 1/2-quart volume.\nMeanwhile, preheat a sous vide cooker to 140°F (60°C). Season chicken breasts generously with salt. Place chicken in zipper-lock bags or vacuum bags and add 2 tablespoons of the reserved chicken fat. Remove air from zipper-lock bags using the\nwater displacement method\n, or use a vacuum sealer to seal the vacuum bags. Add chicken and cook for 2 hours. (See note for instructions on how to cook the chicken without using a sous vide setup.)\nHeat a 12-inch sauté pan over high heat. Peel the onion and cut crosswise into thick 1-inch slices. Char the onion slices in the hot pan until blackened on both sides. Add onions to stock and simmer an additional 1 hour.\nAfter chicken stock has simmered for a total of 3 hours, pass through a fine-mesh strainer. Discard chicken wings and onion and return stock to pot. Season with salt and pepper.\nIn a pot of\nsalted boiling water\n, cook the pasta until al dente. Drain and toss with the remaining reserved chicken fat.\nDice the chicken breasts into 1/2-inch pieces and portion into the bottom of 4 serving bowls. Add the pasta and dill to each bowl. Top with hot chicken stock. Finish with a squeeze of fresh lemon juice, to taste. Serve right away.\nSpecial Equipment\nRimmed baking sheet\n,\n3-quart sauce pot\n,\nsous vide circulator\n,\nvacuum sealer\n(optional) ,\nfine-mesh strainer\nNotes\nIf you prefer not to cook the chicken breasts sous vide, they can be poached in the chicken stock: After simmering and straining the stock, add the breasts and heat gently, using an\ninstant-read thermometer\nto keep the temperature of the stock around 150°F (65°C). Cook until the chicken breast reaches an internal temperature of 145°F (63°C).\nRead More\nClassic Chicken and Rice Soup\nEasy Chicken and Ginger Soup With Rice Cakes, Chives, and Quick-Pickled Garlic\nYum Jin Gai (Spicy Northern Thai-Style Chicken Soup)\nKhao Piak Sen (Lao Chicken Noodle Soup)\nAvgolemono Soup (Greek Lemon-Egg Chicken Soup)\nSoups\nSous Vide Chicken\nChicken\nPastas\nWinter Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-ultimate-chicken-noodle-soup-recipe.webp?"
}