{
  "url": "https://www.seriouseats.com/the-best-roast-potatoes-ever-recipe",
  "image_url": null,
  "tags": [
    "Potatoes",
    "Holidays & Seasons",
    "Thanksgiving Side Dishes",
    "Russet Potatoes",
    "Yukon Gold Potatoes"
  ],
  "title": "The Best Crispy Roast Potatoes Ever",
  "full_text": "The Best Crispy Roast Potatoes Ever\nJump to recipe\nPrep\n10 mins\nCook\n75 mins\nActive\n30 mins\nTotal\n85 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\n1/2\nteaspoon\n(\n4\ng\n)\nbaking soda\n4\npounds\n(about\n2\nkg\n) russet or\nYukon Gold potatoes\n, peeled and cut into quarters, sixths, or eighths, depending on size (see note)\n5\ntablespoons\n(\n75\nml\n)\nextra-virgin olive oil\n, duck fat, goose fat, or beef fat\nSmall handful picked\nfresh rosemary leaves\n, finely chopped\n3\nmedium cloves\ngarlic,\nminced\nFreshly ground black pepper\nSmall handful\nfresh parsley leaves\n, minced\nDirections\nAdjust oven rack to center position and preheat oven to 450°F (230°C) or 400°F (200°C) if using convection. Heat 2 quarts (2L) water in a large pot over high heat until boiling. Add 2 tablespoons kosher salt (about 1 ounce; 25g), baking soda, and potatoes and stir. Return to a boil, reduce to a simmer, and cook until a knife meets little resistance when inserted into a potato chunk, about 10 minutes after returning to a boil.\nMeanwhile, combine olive oil, duck fat, or beef fat with rosemary, garlic, and a few grinds of black pepper in a small saucepan and heat over medium heat. Cook, stirring and shaking pan constantly, until garlic just begins to turn golden, about 3 minutes. Immediately strain oil through a fine-mesh strainer set in a large bowl. Set garlic/rosemary mixture aside and reserve separately.\nSerious Eats / J. Kenji López-Alt\nWhen potatoes are cooked, drain carefully and let them rest in the pot for about 30 seconds to allow excess moisture to evaporate. Transfer to bowl with infused oil, season to taste with a little more salt and pepper, and toss to coat, shaking bowl roughly, until a thick layer of mashed potato–like paste has built up on the potato chunks.\nSerious Eats / Vicky Wasik\nTransfer potatoes to a large rimmed baking sheet and separate them, spreading them out evenly. Transfer to oven and roast, without moving, for 20 minutes. Using a thin, flexible metal spatula to release any stuck potatoes, shake pan and turn potatoes. Continue roasting until potatoes are deep brown and crisp all over, turning and shaking them a few times during cooking, 30 to 40 minutes longer.\nSerious Eats / Vicky Wasik\nTransfer potatoes to a large bowl and add garlic/rosemary mixture and minced parsley. Toss to coat and season with more salt and pepper to taste. Serve immediately.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nSpecial Equipment\nRimmed baking sheet\n,\nsmall saucepan\n,\nfine-mesh strainer\nNotes\nRusset potatoes will produce crisper crusts and fluffier centers. Yukon Golds will be slightly less crisp and have creamier centers, with a darker color and deeper flavor. You can also use a mix of the two.\nThe potatoes should be cut into very large chunks, at least 2 to 3 inches or so. For medium-sized Yukon Golds, this means cutting them in half crosswise, then splitting each half again to make quarters. For larger Yukon Golds or russets, you can cut the potatoes into chunky sixths or eighths.\nRead More\nCaesar Roast Potatoes Recipe\nCrispy Roasted Potatoes With Curry Leaf and Mustard Oil Mayonnaise Recipe\nUltra-Crispy Roast Potatoes Recipe\nAir-Fryer Roast Potatoes Recipe\nExtra-Crispy Herb-Roasted New Potatoes Recipe\nPotatoes\nHolidays & Seasons\nThanksgiving Side Dishes\nRusset Potatoes\nYukon Gold Potatoes"
}