{
  "url": "https://www.seriouseats.com/the-best-general-tsos-chicken-food-lab-chinese-recipe",
  "image_url": null,
  "tags": [
    "Chinese-American",
    "Dairy-free Mains",
    "Fried Chicken",
    "Chicken Stir-Fry",
    "Chicken Mains"
  ],
  "title": "The Best General Tso's Chicken Recipe",
  "full_text": "The Best General Tso's Chicken Recipe\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nTotal\n30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Marinade:\n1\nlarge\negg white\n2\ntablespoons\n(30ml) Chinese\ndark soy sauce\n2\ntablespoons\n(30ml)\nShaoxing wine\n(see note)\n2\ntablespoons\n(30ml) 80-proof\nvodka\n3\ntablespoons\n(24g)\ncornstarch\n1/4\nteaspoon\n(1g)\nbaking soda\n1\npound\n(455g)\nboneless, skinless chicken thighs\n, cut into 1/2- to 3/4-inch chunks\nFor the Dry Coating:\n1/2\ncup\n(64g)\nall-purpose flour\n1/2\ncup\n(64g)\ncornstarch\n1/2\nteaspoon\n(2g)\nbaking powder\n1/2\nteaspoon\n(1.5g)\nkosher salt\nTo Fry Chicken:\n1 1/2\nquarts\n(1.4 liters) peanut, vegetable, or\ncanola oil\nfor deep frying\nFor the Sauce and to Finish (see note):\n4\ntablespoons\n(50g)\ngranulated sugar\n3\ntablespoons\n(45ml) homemade or store-bought\nlow-sodium chicken stock\n3\ntablespoons\n(45ml)\ndark soy sauce\n2\ntablespoons\n(30ml)\nShaoxing wine\n(see note)\n2\ntablespoons\n(30ml) Chinese\nrice vinegar\nor distilled white vinegar\n1\ntablespoon\n(8g)\ncornstarch\n2\nteaspoons\n(10ml) peanut, vegetable, or\ncanola oil\n2\nteaspoons\n(6g)\nminced garlic\n(about 2 medium cloves)\n2 teaspoons (\n4\ng\n) minced\nfresh ginger\n(about one 1-inch piece)\n2 teaspoons (4g) minced scallion bottoms (about 1 scallion), plus\n6 to 8\nscallions\n, white parts only, cut into 1-inch lengths\n1\nteaspoon\n(5ml)\ntoasted sesame oil\n8\nsmall\ndried red\nChinese or Arbol\nchiles\n(see note)\n1\ncup, loosely packed\nsteamed white rice\nDirections\nFor the Marinade:\nBeat egg whites in a large bowl until broken down and lightly foamy. Add soy sauce, wine, and vodka and whisk to combine. Set aside half of marinade in a small bowl. Add cornstarch and baking soda to the large bowl and whisk to combine. Add chicken to large bowl and turn with fingers to coat thoroughly. Cover with plastic wrap and set aside.\nSerious Eats / Qi Ai\nFor the Dry Coat:\nCombine flour, cornstarch, baking powder, and salt in a large bowl. Whisk until homogeneous. Add reserved marinade and whisk until mixture has coarse, mealy clumps. Set aside.\nSerious Eats / Qi Ai\nTo Fry Chicken:\nHeat 1 1/2 quarts peanut, vegetable, or canola oil in a large wok or Dutch oven to 350°F (177°C) and adjust flame to maintain temperature.\nSerious Eats / Qi Ai\nWorking one piece at a time, transfer chicken from marinade to dry coat mixture, tossing in between each addition to coat chicken. When all chicken is added to dry coat, toss with hands, pressing dry mixture onto chicken so it adheres, and making sure that every piece is coated thoroughly.\nSerious Eats / Qi Ai\nLift chicken one piece at a time, shake off excess coating, and carefully lower into hot oil (do not drop it). Once all chicken is added, cook, agitating with long chopsticks or a metal spider, and adjusting flame to maintain a temperature of 325 to 375°F (163 to 191°C), until chicken is cooked through and very crispy, about 4 minutes. Transfer chicken to a paper towel-lined bowl to drain. Pour frying oil through a fine-mesh strainer set over a large heatproof bowl; allow to cool, then reserve for future frying.\nSerious Eats / Qi Ai\nFor the Sauce and to Finish:\nCombine sugar, chicken stock, soy sauce, wine, vinegar, cornstarch, and sesame oil in a small bowl and stir with a fork until cornstarch is dissolved and no lumps remain. Set aside.\nSerious Eats / Qi Ai\nCombine oil, garlic, ginger, minced scallions, and red chiles in a wok or large skillet and place over medium heat. Cook, stirring, until vegetables are aromatic and soft, but not browned, about 3 minutes. Stir sauce mixture and add to wok, making sure to scrape out any sugar or starch that has sunk to the bottom of bowl. Cook, stirring, until sauce boils and thickens, about 1 minute. Add scallion segments.\nSerious Eats / Qi Ai\nAdd chicken to sauce, then toss, folding it with a wok spatula or silicone spatula until all pieces are thoroughly coated. Serve immediately with white rice.\nSerious Eats / Qi Ai\nSpecial Equipment\nWhisk\n,\nwok\nor\nDutch oven\n(for frying) and large\nstainless-steel skillet\n(for sauce and finishing)\nNotes\nShaoxing wine can be found in most Asian markets. If unavailable, dry sherry can be used in its place. If you can't find boneless skinless chicken thighs, you can\ndebone them yourself using this guide\n. If you can't find whole dried chiles, substitute with 1/4 teaspoon crushed red pepper flakes.\nThis recipe is written to maximize efficiency with a wok: frying the chicken first, then making the sauce in the same wok (emptied of frying oil) and finally tossing it all together. This way, you only have to wash the wok once after making the full recipe. If desired, however, you can prepare the sauce in advance (up to 1 day ahead), then transfer it to an airtight container and refrigerate until ready to use; warm sauce before tossing with fried chicken right before serving.\nMake-Ahead and Storage\nIf desired, the sauce can be prepared up to 1 day in advance. Refrigerate in an airtight container, then warm before tossing with freshly fried chicken right before serving.\nRead More\nFor the Wispiest, Crispiest Deep-Fried Crusts, Grab the Vodka\nChinese-American\nDairy-free Mains\nFried Chicken\nChicken Stir-Fry\nChicken Mains"
}