{
  "url": "https://www.seriouseats.com/the-food-lab-southern-fried-chicken-recipe",
  "image_url": "https://www.seriouseats.com/thmb/xw1krLC9Yh85qx1wl5jw0BPCWHk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2015__07__20210324-SouthernFriedChicken-Andrew-Janjigian-21-cea1fe39234844638018b15259cabdc2.jpg",
  "tags": [
    "Fried Chicken",
    "Chicken",
    "Soul Food & Southern",
    "Frying",
    "Chicken Mains"
  ],
  "title": "The Best Buttermilk-Brined Southern Fried Chicken",
  "full_text": "The Best Buttermilk-Brined Southern Fried Chicken\nClose\nJump to recipe\nPrep\n85 mins\nCook\n40 mins\nActive\n45 mins\nBrining Time\n4 hrs\nTotal\n6 hrs 5 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Spice Mix:\n2\ntablespoons\npaprika\n2\ntablespoons\nfreshly ground black pepper\n2\nteaspoons\ngarlic powder\n2\nteaspoons\ndried oregano\n1/2\nteaspoon\ncayenne pepper\nFor the Buttermilk Brine:\n1\ncup\nbuttermilk\n1\nlarge\negg\nKosher salt\nFor Finishing the Chicken:\n1\nwhole\nchicken\n, about\n4\npounds\n, cut into\n10\npieces\nor\n3 1/2\npounds\nbone-in, skin-on breasts\n,\nlegs\n,\ndrumsticks\n, and/or\nwings\n1 1/2\ncups\nall-purpose flour\n1/2\ncup\ncornstarch\n1\nteaspoon\nbaking powder\n4\ncups\nvegetable shortening\nDirections\nCombine the paprika, black pepper, garlic powder, oregano, and cayenne in a small bowl and mix thoroughly with a fork.\nSerious Eats / Andrew Janjigian\nWhisk the buttermilk, egg, 1 tablespoon salt, and 2 tablespoons of the spice mixture in a large bowl. Add the chicken pieces and toss and turn to coat. Transfer the contents of the bowl to a gallon-sized zipper-lock freezer bag and refrigerate for at least 4 hours, and up to overnight, flipping the bag occasionally to redistribute the contents and coat the chicken evenly.\nSerious Eats / Andrew Janjigian\nWhisk together the flour, cornstarch, baking powder, 2 teaspoons salt, and the remaining spice mixture in a large bowl. Add 3 tablespoons of the marinade from the zipper-lock bag and work it into the flour with your fingertips. Remove one piece of chicken from the bag, allowing excess buttermilk to drip off, drop the chicken into the flour mixture, and toss to coat. Continue adding chicken pieces to the flour mixture one at a time until they are all in the bowl. Toss the chicken until every piece is thoroughly coated, pressing with your hands to get the flour to adhere in a thick layer.\nSerious Eats / Andrew Janjigian\nAdjust an oven rack to the middle position and preheat the oven to 350°F. Heat the shortening or oil to 425°F in a 12-inch straight-sided cast-iron chicken fryer or a large wok over medium-high heat. Adjust the heat as necessary to maintain the temperature, being careful not to let the fat get any hotter.\nSerious Eats / Andrew Janjigian\nOne piece at a time, transfer the coated chicken to a fine-mesh strainer and shake to remove excess flour. Transfer to a wire rack set on a rimmed baking sheet. Once all the chicken pieces are coated, place skin side down in the pan. The temperature should drop to 300°F; adjust the heat to maintain the temperature at 300°F for the duration of the cooking. Fry the chicken until it’s a deep golden brown on the first side, about 6 minutes; do not move the chicken or start checking for doneness until it has fried for at least 3 minutes, or you may knock off the coating. Carefully flip the chicken pieces with tongs and cook until the second side is golden brown, about 4 minutes longer.\nSerious Eats / Andrew Janjigian\nTransfer chicken to a clean wire rack set in a rimmed baking sheet, season lightly with salt, and place in the oven. Bake until thickest part of breast pieces registers 150°F (65.5°C) on an instant-read thermometer, and thigh/drumstick pieces register 165°F (74°C), 5 to 10 minutes; remove chicken pieces as they reach their target temperature, and transfer to a second wire rack set in a rimmed baking sheet, or a paper towel-lined plate. Season with salt to taste. Serve immediately—or, for extra-crunchy fried chicken, proceed to step 7.\nSerious Eats / Andrew Janjigian\nPlace the plate of cooked chicken in the refrigerator for at least 1 hour, and up to overnight. When ready to serve, reheat the oil to 400°F. Add the chicken pieces and cook, flipping them once halfway through cooking, until completely crisp, about 5 minutes. Transfer to a wire rack set on a rimmed baking sheet to drain, then serve immediately.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nLarge wok\nor\ncast-iron chicken fryer\n,\nrimmed baking sheet\n,\nwire rack\nRead More\nKimchi-Brined Fried Chicken Sandwich\nNashville Hot Chicken Sandwich\nExtra-Extra-Crispy Fried Chicken With Caramelized Honey and Spice\nFried Chicken\nChicken\nSoul Food & Southern\nFrying\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-buttermilk-brined-southern-fried-chicken.webp?"
}