{
  "url": "https://www.seriouseats.com/the-food-lab-buttermilk-biscuits-recipe",
  "image_url": "https://www.seriouseats.com/thmb/irRrCdS7c5Fehzr9oCD5nTs84Dc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210510-The-Food-Labs-Buttermilk-Biscuits-liz-voltz-seriouseats-16-8a0c924e4c9440088e073c67ed77d3c1.jpg",
  "tags": [
    "Biscuits",
    "Thanksgiving Side Dishes",
    "Buttermilk",
    "Breakfast & Brunch"
  ],
  "title": "The Food Lab's Buttermilk Biscuits Recipe",
  "full_text": "The Food Lab's Buttermilk Biscuits Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n20 mins\nActive\n30 mins\nCooling Time\n5 mins\nTotal\n35 mins\nServes\n8 biscuits\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\n(\n120\nml\n)\nbuttermilk\n1/2\ncup\nsour cream\n(\n4\nounces\n;\n113\ng\n)\n10\nounces\nall-purpose flour\n(\n2 1/4\ncups\n;\n284\ng\n), plus additional for dusting\n1\ntablespoon\n(\n12\ng\n)\nbaking powder\n1/4\nteaspoon\nbaking soda\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n8\ntablespoons\ncold\nunsalted butter\n(\n4\nounces\n;\n113\ng\n), cut into 1/4-inch pats, plus\n2\ntablespoons\n(\n1\nounce\n;\n28\ng\n) melted unsalted butter for brushing\nDirections\nAdjust an oven rack to the middle position and preheat the oven to 425°F (220°C). In a small bowl, whisk together the buttermilk and sour cream.\nSerious Eats / Liz Voltz\nIn the bowl of a food processor, combine flour, baking powder, baking soda, and salt and process until blended, about 2 seconds. Scatter cold butter evenly over flour and pulse until the mixture resembles coarse meal and the largest butter pieces are about 1/4-inch at their widest, about 8 times. Transfer to a large bowl.\nSerious Eats / Liz Voltz\nAdd the buttermilk mixture to the flour mixture and, using a rubber spatula, fold until just combined. Transfer the dough to a floured work surface and knead until it just comes together, adding extra flour as necessary.\nSerious Eats / Liz Voltz\nWith a rolling pin, roll the dough into a 12- by 8-inch rectangle. Using a bench scraper, fold the right third of the dough over the center, then fold the left third over so you end up with a 12- by 4-inch rectangle. Fold the top third down over the center, then fold the bottom third up so the whole thing is reduced to a 4-inch square. Press the square down and roll it out again into a 12- by 8-inch rectangle. Repeat the folding process once more. (See notes for cheddar cheese and scallion variation.)\nSerious Eats / Liz Voltz\nRoll the dough again into a 10- by 6-inch rectangle (about 1-inch thick). Using a floured biscuit cutter, cut eight 2 1/2–inch rounds out of the dough. Transfer the rounds to a parchment-lined baking sheet, spacing them about 1 inch apart. Form the dough scraps into a ball and knead gently 2 or 3 times, until smooth. Roll the dough out until it’s large enough to cut out 4 more 2 1/2-inch rounds, and transfer to the baking sheet.\nSerious Eats / Liz Voltz\nBrush the tops of the biscuits with the melted butter and bake until golden brown and well risen, about 14 minutes, rotating the pan halfway through. Allow to cool for 5 minutes and serve.\nSerious Eats / Liz Voltz\nSpecial Equipment\nFood processor\n, 2 1/2-inch\nbiscuit cutter\n,\nrolling pin\n,\nbench scraper\n,\nrimmed baking sheet\n,\nrubber or silicon spatula\n,\nparchment paper\nNotes\nTo make cheddar cheese and scallion biscuits:\nIn Step 4, sprinkle 6 ounces grated cheddar cheese and 1/4 cup sliced scallions over the 12- by 8-inch dough rectangle before folding it the second time, and continue as directed.\nRead More\nSausage Gravy\nLight and Fluffy Biscuits\nYeast-Raised Angel Biscuits\nButtermilk Drop Biscuits With Garlic and Cheddar\nQuick and Easy Drop Biscuits\nThe Serious Eats Guide to Biscuits\nBiscuits\nThanksgiving Side Dishes\nButtermilk\nBreakfast & Brunch"
}