{
  "url": "https://www.seriouseats.com/the-best-turkey-gravy-recipe",
  "image_url": null,
  "tags": [
    "Thanksgiving Turkeys",
    "Thanksgiving Side Dishes",
    "Thanksgiving",
    "Turkey",
    "Winter Sides"
  ],
  "title": "The Best Turkey Gravy",
  "full_text": "The Best Turkey Gravy\nJump to recipe\nPrep\n5 mins\nCook\n95 mins\nActive\n15 mins\nTotal\n100 mins\nServes\n24 servings\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\nTurkey neck\n,\ngizzards\n, and trimmings\n1\ntablespoon\n(\n15\nml\n)\nvegetable oil\n1\nlarge\nonion\n, roughly chopped\n1\nlarge\ncarrot\n, peeled and roughly chopped\n2\nribs\ncelery\n, roughly chopped\n1 1/2\nquarts\n(about\n1.5\nL\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\n, plus more as needed\n1\nteaspoon\n(\n5\nml\n)\nsoy sauce\n1/4\nteaspoon\nMarmite\nA few sprigs mixed herbs, such as\nfresh parsley\n,\nthyme\n, or\nrosemary\n2\nbay leaves\n3\ntablespoons\n(\n45\ng\n)\nbutter\n1/4\ncup\n(\n1 1/2\nounces\n)\nflour\nKosher salt\nand freshly ground black pepper\nDirections\nChop reserved turkey neck, gizzards, and trimmings into 1-inch chunks with a cleaver. Heat oil in a medium saucepan over medium-high heat until shimmering. Add turkey parts, onion, carrot, and celery and cook, stirring occasionally, until well browned, about 10 minutes total. Add stock, soy sauce, Marmite (if using), herbs, and bay leaves. Bring to a boil, then reduce to a simmer. Simmer for 1 hour, then strain through a fine-mesh strainer. Add any drippings from the roast turkey, then skim off excess fat.\nLiz Clayman\nYou should have a little over 1 quart of fortified stock; if not, add water or more chicken stock to equal 1 quart. Discard solids and set stock aside.\nMelt butter in a medium saucepan over medium heat. Add flour and cook, stirring constantly, until golden brown, about 3 minutes. Whisking constantly, add fortified broth in a thin, steady stream. Bring to a boil, reduce to a simmer, and cook until thickened and reduced to about 3 cups. Season to taste with salt and pepper. Gravy can be made up to 5 days in advance and stored in the refrigerator.\nLiz Clayman\nSpecial Equipment\nCleaver\n,\nfine-mesh strainer\nMake-Ahead and Storage\nYou can store gravy in an airtight container in the refrigerator for up to five days. In most cases, it will reheat nicely, either in the microwave (make sure to stir every 30 seconds to one minute to heat it evenly and prevent a skin from forming) or in a saucepan over very gentle heat (stir or whisk often). If anything does go wrong, just remember that lumps can be strained or blended out, and an overly thick gravy can be thinned with a little stock or water. An overly thin one, conversely, can be thickened by simmering briefly with a little extra cornstarch slurry.\nThanksgiving Turkeys\nThanksgiving Side Dishes\nThanksgiving\nTurkey\nWinter Sides"
}