{
  "url": "https://www.seriouseats.com/the-best-fresh-tomato-sauce-for-pasta-recipe",
  "image_url": null,
  "tags": [
    "Tomato Sauces",
    "Italian",
    "Braised & Stewed Vegetables"
  ],
  "title": "The Best Fresh Tomato Sauce",
  "full_text": "The Best Fresh Tomato Sauce\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs 15 mins\nActive\n2 hrs\nTotal\n2 hrs 45 mins\nServes\n12\nto 24 servings\nMakes\n1\nto 2 gallons of sauce, depending on the tomatoes\nCook Mode\n(Keep screen awake)\nIngredients\n10\npounds\n(\n4.5\nkg\n) ripe\nplum tomatoes\n, preferably mixed varieties (such as Romas, Amish Pastes, and San Marzanos), cut into large chunks, plus\n15\npounds\n(\n6.8\nkg\n) ripe mixed tomatoes, mostly plums with a small portion of other tomatoes (such as beefsteaks), cut into large chunks\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, plus more for greasing\n1\nlarge\nyellow onion\n, minced (see note)\n3\nmedium\ncloves garlic\n, minced (see note)\n2\nlarge sprigs\nfresh basil\n1\nsmall\ntomato plant cutting\nwith about\n5\nleaves\n(optional)\nKosher salt\nDirections\nIn a large stockpot, heat the 10 pounds plum tomatoes, covered, over high heat, stirring occasionally, until tomatoes dump their liquid. Bring to a boil in covered pot, stirring occasionally, and cook until tomatoes are softened, about 10 minutes.\nSerious Eats / Daniel Gritzer\nPreheat oven to 275°F (135°C) and grease several rimmed baking sheets and/or baking dishes with oil. Using a food mill or a stand mixer's vegetable strainer attachment, pass cooked plum tomatoes and all their liquid into a large heatproof container. Discard skins and seeds.\nSerious Eats / Daniel Gritzer\nPour plum tomato purée into rimmed baking sheets and/or baking dishes, being careful not to overfill them.\nSerious Eats / Daniel Gritzer\nCarefully transfer baking sheets and dishes to oven and bake, checking every 15 minutes and stirring once purée begins to thicken, until a thick, spreadable tomato paste forms, at least 2 hours.\nSerious Eats / Daniel Gritzer\nMeanwhile, fill the same large stockpot with remaining 15 pounds mixed tomatoes and cook, covered, over high heat, stirring occasionally, until tomatoes dump their liquid. Bring to a boil in covered pot, stirring occasionally, and cook until tomatoes are softened, about 10 minutes. (Work in batches if your pot can't hold all 15 pounds at once.)\nUsing food mill or stand mixer's vegetable strainer attachment, pass cooked mixed tomatoes and all their liquid into a large heatproof container. Discard skins and seeds. Measure out 1 quart (900ml) mixed-tomato purée and set aside.\nHeat 3 tablespoons (45ml) olive oil in a large, wide saucepan over medium heat until shimmering. Add onion and garlic and cook, stirring occasionally, until softened and sweet, about 8 minutes. Add remaining mixed-tomato purée and simmer, stirring occasionally, until reduced to a sauce-like consistency, 35 to 40 minutes.\nRemove from heat; stir in basil and tomato-plant cutting, if using; and let steep for 5 minutes. Discard basil and tomato-plant cutting. Stir in oven-dried tomato paste and reserved tomato purée and season with salt. Use as desired or freeze.\nSerious Eats / Daniel Gritzer\nSpecial Equipment\nStockpot\n,\nfood mill\nor vegetable strainer for a\nstand mixer,\nrimmed baking sheets\nand/or\nbaking dishes\nNotes\nThis recipe calls for 25 pounds of tomatoes and yields between 1 and 2 gallons of sauce, since it's not much extra effort to make a lot and summer rolls around only once a year. The sauce can be frozen for several months. If you want to make more or less sauce, the recipe can easily be scaled up or down; cooking times may change, but the method remains the same.\nThis recipe calls for sautéed onion and garlic, but you can also choose to include minced carrot and celery in the mix, or skip the sautéing step and simmer the minced raw aromatics in the sauce. Or, you can leave the aromatics out altogether and make this sauce with the tomatoes alone.\nMake-Ahead and Storage\nThe homemade tomato paste can be made separately in advance and stored for up to 1 week in the refrigerator. The finished sauce will keep in the refrigerator for about 1 week, or in the freezer for several months.\nRead More\nHow to Can Tomatoes\nQuick-Cooked Tomato Purée (Passata di Pomodoro) Recipe\nThe Best Italian-American Tomato Sauce Recipe\nQuick and Easy Italian-American Red Sauce in 40 Minutes Recipe\nTomato Sauces\nItalian\nBraised & Stewed Vegetables"
}