{
  "url": "https://www.seriouseats.com/the-worlds-best-biscuits-recipe",
  "image_url": "https://www.seriouseats.com/thmb/73Es0MrovqGn9FgsqL3fL5LkXME=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__11__20111128-181382-world-best-biscuits-3c17b1c2809c4a0494e6829071d7cdbb.jpg",
  "tags": [
    "Biscuits",
    "Breakfast & Brunch"
  ],
  "title": "Andrew Carmellini's World's Best Biscuits. End of Story.",
  "full_text": "Andrew Carmellini's World's Best Biscuits. End of Story.\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nActive\n60 mins\nTotal\n40 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Honey-Butter Topping:\n3\ntablespoons\nunsalted butter\n, cut into small pieces\n3\ntablespoons\nhoney\n1/4\nteaspoon\nsalt\nFor the Biscuits:\n4 1/2\ncups\nall-purpose flour\n, plus extra for flouring your work surface and rolling pin\n1\nteaspoon\nbaking soda\n1\ntablespoon\nplus\n2\nteaspoons\nbaking powder\n1\nteaspoon\nsalt\n2\nteaspoons\nsugar\n1\ncup\nsolid vegetable shortening\n2 1/2\ncups\nbuttermilk\nDirections\nTo make the Honey-Butter:\nBring 2 tablespoons of water to a boil in a small pot.\nSlowly whisk in the butter, piece by piece, letting each piece melt completely into the water before adding the next one. Add the honey and salt, and whisk everything together until you have a shiny, well-combined liquid.\nLet the honey butter sit in a warm area of the kitchen, or over the lowest possible flame on the stove, until you’re ready to use it. It’s important to keep it warm so it will spread easily—and the longer you let it sit, the better the honey butter will be.\nTo make the Biscuits:\nPreheat the oven to 425°F.\nIn a large bowl, sift together the flour, baking soda, baking powder, salt, and sugar. (If you don’t have a sifter, you can use a whisk.)\nAdd the vegetable shortening. Using a pastry cutter, or holding a butter knife in each hand, cut through the shortening and flour in an X-shaped motion until the shortening is mixed in. Be careful to break up any large pieces. You should end up with lots of little pebbles.\nAdd the buttermilk and use your hands to mix everything together, turning the mixture until it forms a dough. Then keep turning and kneading until you’ve got a roughly shaped ball of dough. If things get sticky, add a little bit of flour.\nFlour a board or countertop well, and turn the dough out on it.\nFlour your rolling pin, and then roll the dough out until it forms a round about 1/2 inch thick. Fold the dough round into thirds, like you’re folding a business letter. Slap the dough down hard with the palms of your hands to really bring it together, and then roll it out and fold it in again. Do this 7 times in all, skipping the folding step the seventh time. Reflour the work surface, the dough, and the rolling pin as you go.\nFlour a 3 1/2-inch round pastry cutter, and cut out as many rounds of dough as possible (you should have 8 to 10 or so). Reflour the cutter as you go. (When we make these at the restaurant, we usually bake off the leftover pieces and eat them ourselves.)\nCover a baking sheet with parchment paper, lay the biscuits on it, and put it on the middle oven rack. At about the 10-minute mark, turn the baking sheet so that all the biscuits bake evenly.\nWhen the biscuits are baked through and the tops are golden-brown (about 20 minutes), pull them out of the oven. Using a big pastry brush, coat the tops of the biscuits with the honey butter. The biscuits will be very soft and flaky inside, with just a little bit of crispness on the outside. Serve them while they’re hot.\nBiscuits\nBreakfast & Brunch"
}