{
  "url": "https://www.seriouseats.com/the-nasty-bits-how-to-make-chicharrones-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LSCRk7srweF-PsqYMp24-ueXetE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-Chicharrones-FredHardy-001-23b06c524d914932a8ae12e2be8c565a.jpg",
  "tags": [
    "Pork Belly",
    "Stovetop Pork",
    "Frying"
  ],
  "title": "How to Make Colombian-Style Chicharrones",
  "full_text": "How to Make Colombian-Style Chicharrones\nClose\nJump to recipe\nPrep\n10 mins\nCook\n95 mins\nResting Time\n2 hrs\nTotal\n3 hrs 45 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\n(\n907\ng\n) skin-on\npork belly\n, skin on\n1\ntablespoon\n(\n15\ng\n)\nbaking soda\nKosher salt\nOptional spices or seasonings of your choice, such as\ncayenne\n, sugar, and paprika, or lime juice\nDirections\nMaking chicharrones is an unavoidably messy task. Hot lard pops and spits as you fry the belly, making a mess of the surrounding kitchen area and risking burns. In our testing (see headnote above for more details), we found this issue unavoidable without seriously compromising the result, though it can be reduced with the use of a splatter guard (we really don't consider the splatter guard optional here, please use one). Make sure to wear long sleeves and other protective, kitchen-safe clothing, and take care while frying.\nPlace pork belly on a wire rack set over a rimmed baking sheet. In a small bowl, stir together baking soda with 2 teaspoons (6g) salt. Rub baking soda mixture all over pork belly, taking care to distribute mixture evenly. Chill uncovered, skin side up, in the refrigerator for at least 2 hours and up to 1 day (for best results, let pork chill at least 8 hours).\nSerious Eats / Fred Hardy\nThe next day, rinse belly in cold water and pat dry. Cut into strips, about 1 inch wide and 4 to 5 inches long. Place strips skin-side down on a cutting board and carefully slice down at 1/2-inch intervals, stopping when you reach the fat layer right below skin (do not cut through the skin). Place all segments of belly in a single layer into a 12-inch nonstick skillet or well-seasoned wok.  Pour in water until pork is mostly submerged, about 2 to 3 cups (473-710ml), though amount needed will depend on vessel dimensions.\nSerious Eats / Fred Hardy\nSet over medium-low heat and bring to a simmer. Cook, turning segments of meat occasionally, until pork is tender and much of the fat has rendered, about 1 hour. In the beginning, water will look like pork stock, but over time the water will evaporate, leaving only lard in the pan; if necessary, increase heat to medium to drive off last bit of water.\nSerious Eats / Fred Hardy\nOnce water has evaporated and only liquid lard remains in skillet, cover skillet with a splatter guard. Warning: The lard will pop and splatter; stand back and be careful to not burn yourself. Continue to cook, turning pieces occasionally as they fry, until the chicharrones are golden and crispy, 20 to 25 minutes.\nSerious Eats / Fred Hardy\nTransfer the chicharrones to a plate lined with paper towels to drain. Toss with salt to taste and your choice of seasonings. Chicharrones will remain crispy for many hours.\nSerious Eats / Fred Hardy\nSpecial Equipment\n12-inch nonstick skillet\nor\nwell-seasoned wok\n; splatter guard\nPork Belly\nStovetop Pork\nFrying",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/how-to-make-colombian-style-chicharrones.webp?"
}