{
  "url": "https://www.seriouseats.com/the-best-moules-mariniere-sailor-style-mussels-recipe",
  "image_url": null,
  "tags": [
    "Belgian",
    "French",
    "Gluten-free Mains",
    "Seafood Mains",
    "Quick Dinners"
  ],
  "title": "The Best Moules Marinières (Sailor-Style Mussels) Recipe",
  "full_text": "The Best Moules Marinières (Sailor-Style Mussels) Recipe\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nActive\n15 mins\nTotal\n30 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nunsalted butter\n1\nsmall\nleek\n, white and light green parts only, thinly sliced\n1\nsmall\nshallot\n, thinly sliced\n4\nmedium cloves\ngarlic\n, thinly sliced\n2\nbay leaves\nKosher salt\nand\nfreshly ground black pepper\n1\ncup\nhard dry cider\nor white wine\n2\npounds\nmussels\n(see notes)\n2\nto\n3\ntablespoons\nhomemade mayonnaise\n(see notes), crème fraîche, or heavy cream (optional)\n3\ntablespoons\nminced fresh parsley leaves\n1\ntablespoon\njuice\nand\n1\nteaspoon\ngrated zest\nfrom\n1\nlemon\nAdditional\nhomemade mayonnaise\nfor serving (optional, see notes)\n1\nloaf\nrustic sourdough bread\n, thickly sliced, drizzled with olive oil, and broiled until heavily toasted\nDirections\nIn a medium Dutch oven or large saucepan, melt 1 tablespoon butter over medium-low heat. Add leeks, shallot, garlic, and bay leaves. Season lightly with salt and heavily with black pepper and cook, stirring, until vegetables are very soft but not browned, about 10 minutes.\nSerious Eats / Qi Ai\nIncrease heat to high and add cider or wine. Bring to a boil and let reduce by half, about 2 minutes. Add mussels, stir, cover, and cook, shaking pan constantly and peeking every 30 seconds to stir. As soon as all the mussels are open, transfer mussels to a bowl using tongs. Place pan lid over bowl to keep mussels warm.\nSerious Eats / Qi Ai\nRemove from heat and whisk in remaining butter along with mayonnaise or crème fraîche (if using). Return mussels to pot, add parsley, lemon juice, and lemon zest, stir to combine, then transfer to a warm serving bowl. Serve immediately with additional mayonnaise (if using) and broiled bread.\nSerious Eats / Qi Ai\nNotes\nExamine mussels before using. If they're gritty or have lots of beards (it'll look like bits of hair coming out from between their shells), scrub them well under cold water and pull out the beards by grabbing them and pulling towards the hinge-end of the mussels. Farm-raised mussels are generally quite clean when they are sold.\nDiscard cracked mussels or open mussels that don't close when tapped with another mussel.\nMayonnaise is not essential for this dish, but it does add extra richness and lots of flavor, particularly if served alongside for dipping mussels into. When using mayonnaise for this dish, be sure to use fresh\nhomemade mayonnaise\n—store-bought mayonnaise will not combine with the sauce properly. I like to add extra garlic and substitute half of the canola oil for extra-virgin olive oil when making mayonnaise for mussels.\nRead More\nHow to Clean and Debeard Mussels\nTwo-Minute Aioli Recipe\nSpicy Steamed Mussels With 'Nduja Recipe\nMussels With Fennel-Saffron Broth Recipe\nMussels With Thai Red Curry Broth and Rice Noodles Recipe\nBelgian\nFrench\nGluten-free Mains\nSeafood Mains\nQuick Dinners"
}