{
  "url": "https://www.seriouseats.com/the-food-lab-black-bean-chicken-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/qs3Ex81-zN8BA5W3khz2nYvJ7mI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__01__20140113-black-bean-chicken-soup-recipe-13-da10434e96cb4861b7654b4db7d97d3e.jpg",
  "tags": [
    "Mexican",
    "Braised & Stewed Beans",
    "Black Beans",
    "Chicken",
    "Sausages"
  ],
  "title": "Black Bean Soup With Chorizo and Braised Chicken Recipe",
  "full_text": "Black Bean Soup With Chorizo and Braised Chicken Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n75 mins\nActive\n45 mins\nSoaking Time\n8 hrs\nTotal\n9 hrs 20 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\ndried black beans\nKosher salt\n2\npounds\nchicken drumsticks\nor\nthighs\nFreshly ground black pepper\n1\ntablespoons\ncanola\nor\nvegetable oil\n6\nounces\nsmoked\nMexican or\nSpanish chorizo\n, cut into 1/4-inch slices\n8\nscallions\n, finely sliced, greens and whites reserved separately\n2\nserrano\npeppers\n,\n1\nfinely chopped (about\n2\ntablespoons\n), the other thinly sliced for garnish\n4\nmedium\ncloves garlic\n, minced (about\n4\nteaspoons\n)\n2\nteaspoons\nground cumin\n2\nwhole\nchipotle peppers in adobo sauce\n, finely minced, plus\n1\ntablespoon\nsauce from can\n1 1/2\nquarts\nlow-sodium\nstore-bought or homemade\nchicken broth\n2\nbay leaves\nSliced avocado\n, for serving\nFresh cilantro leaves\n, for serving\nSour cream\nor\nMexican-style crema\n, for serving\n1\nlime\n, cut into\n8\nwedges\nDirections\nPlace black beans in a large bowl and cover with 1 gallon of water. Add 3 tablespoons salt and stir until dissolved. Cover and set aside at room temperature overnight. (See note).\nThe next day, season chicken on all sides with salt and pepper. Heat oil in a large Dutch oven or saucepot over medium-high heat until shimmering. Add chicken and cook without moving until well browned on first side, about 5 minutes. Flip chicken and cook until second side is browned, about 3 minutes longer. Remove chicken from pot with tongs and set aside on a large plate.\nAdd chorizo to pot and cook, stirring occasionally, until chorizo is crisp and starting to char, about 4 minutes. Add scallion whites, chopped Serrano, and garlic. Cook, stirring and scraping up browned bits from bottom of pan until fragrant, about 2 minutes. Add cumin and cook, stirring, until fragrant, about 30 seconds. Add chopped chipotles and their sauce and cook, stirring until fragrant, about 1 minute. Add broth and bay leaves. (If using canned beans, see note).\nDrain and rinse beans and add to pot. Nestle chicken pieces into beans. Bring to a boil, reduce to a bare simmer and cook, uncovered, stirring occasionally, until beans and chicken are tender, 45 minutes to 1 hour.\nRemove and discard bay leaves and skins from chicken. Using a ladle, carefully transfer 2 cup of beans and chorizo with liquid to a blender. Blend on high speed until completely smooth, about 1 minute. Stir mixture back into pot. (If a thicker soup is desired, repeat this process until it as thick as desired)\nServe chicken and beans with cilantro, scallion greens, lime wedges, sliced Serrano peppers, and sour cream at the table for garnish.\nThis Recipe Appears In\nThe Food Lab: Black Bean Soup With Chorizo and Braised Chicken\nMexican\nBraised & Stewed Beans\nBlack Beans\nChicken\nSausages"
}