{
  "url": "https://www.seriouseats.com/the-nasty-bits-whole-hock-pork-trotters-with-sauce-gribiche-recipe",
  "image_url": "https://www.seriouseats.com/thmb/1G-yNO_DJi-gxQzEx6KGsxUmB1A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090714-pigsfeet-0ffb84f00086481d824585bd95011f21.jpg",
  "tags": [
    "Pork",
    "Frying"
  ],
  "title": "The Nasty Bits: Whole Hock Recipe",
  "full_text": "The Nasty Bits: Whole Hock Recipe\nClose\nJump to recipe\nPrep\n65 mins\nCook\n3 hrs 10 mins\nChilling Time\n12 hrs\nTotal\n16 hrs 15 mins\nServes\n10\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the terrine:\n5\npounds\n(\n2\nlarge\nor\n3\nmedium\n)\nfresh trotters\n, including the hocks\n1\nlarge\nleek\n, de-stemmed and washed for dirt\n1\nlarge\nonion\n, peeled and washed for dirt\n2\nl\narge\nor\n3\nmedium\ncarrots\n, peeled and washed\nSalt\n2\nbay leaves\n1\nteaspoon\nblack peppercorns\n1\nsmall bunch\nof\nthyme\ntied together, or\n1/2\nteaspoon\ndried thyme\n1\nhead\ngarlic\n, split horizontally in half\n2\ntablespoons\nunsalted butter\n1\ncup\nminced shallots\n1/4\ncup\nDijon mustard\nFreshly ground black pepper\n1\ntablespoon\nplus\n1\nteaspoon\nchopped Italian parsley\nA few\ntablespoons\nall-purpose flour\n1/2\ncup\npanko crumbs\nFor the Sauce Gribiche:\n1\ntablespoon\nred wine vinegar\n1/2\ncup\nextra-virgin olive oil\n1\nteaspoon\nDijon mustard\n2\nteaspoons\neach\nchopped hard-cooked egg white\nand\negg yolk\n1\ntablespoon\nminced non pareil capers\n, preferably Spanish\n2\ntablespoons\nminced tarragon\n2\nteaspoons\nminced chives\n2\nteaspoons\nminced chervil\n1\ntablespoon\nminced cornichons\n2\nteaspoons\nminced Italian parsley\n1/4\nteaspoon\nkosher salt\n1/4\nteaspoon\ncoarse black pepper\nDirections\nPlace the hocks in a large stockpot and add water to cover. Place the pot over high heat and bring to a boil, skimming away the foam that rises to the surface. Reduce the heat and simmer for 5 minutes to remove all the impurities.\nRemove the hocks from the pot, discard the liquid, and rinse out the pot. Return the hocks to the pot and cover with cold water. Place the pot over high heat and bring to a simmer.\nAdd the leek, onion, carrots, 1 tablespoon of salt, bay leaves, peppercorns, thyme, and garlic and return the water to a simmer. Simmer for 2 to 3 hours, until the fat on the hocks is completely softened and the meat is tender and pulling away from the bone. Turn off the heat and leave the hocks in the liquid.\nMeanwhile, sweat the shallots: Melt the butter in a large sauté pan over medium heat. Add the shallots and cook for about 2 minutes to soften them. Stir in 1 teaspoon of salt and remove from the heat.\nLift the hocks from the liquid and set in a bowl or baking sheet. While they are still hot but not scalding, use your fingers or a fork to separate the meat from the skin and fat, reserving the skin. Pull the meat apart, and set aside the bones for additional simmering in the stock.\nPlace the meat in a large bowl and keep in a warm spot. Scrape the fat from the skin and discard the fat. Finely chop the skin and stir it into the meat.\nTo shape the log: Cut two sheets of heavy duty foil, or layer several sheets of regular foil. Spoon half of the mixture onto one sheet, shaping it so that it is approximately 10 inches long and 2 inches in diameter. Roll the log up into the foil. Squeeze and twist the ends to compress the meat so that it is 8 to 10 inches long and 2 to 2 1/2 inches in diameter. This mixture will make 2 logs.\nAlternatively\n, use cookie cutters or other circular rings to make individual terrines of trotters. I used a cut-up coffee cup, which worked extremely well for shaping singular terrines that were perfectly round. Refrigerate overnight, or for as long as 5 days. Either way, you will have approximately 10 to 12 servings.\nFor the Sauce Gribiche: Combine all the ingredients in a bowl, adding them in the order given. Let the sauce sit for at least 30 minutes, or refrigerate for up to a day. You will have about one cup.\nTo finish: Preheat the oven to 400°F. Depending on how many servings you need, cut each serving into a 1 1/2 inch slice if you are working from a log. Season both sides with salt and pepper and dip in flour; the flour should come up the sides of each slice. Spread a thin layer of Dijon mustard over the flour, and then dip into the panko crumbs to coat. At this point, the slices may be refrigerated for up to 30 minutes, or cooked immediately.\nHeat a few tablespoons of oil or butter in a non-stick, oven proof skillet such as cast iron. When the pan is hot, carefully add the slices and let brown for about 30 seconds on the bottom side. Since they spatter as they cook, they will be finished in the oven.\nPlace the skillet in the oven for about 4 minutes to brown the top side. Be careful not to cook it for too long, or the trotters will break up. Remove the skillet from the oven and drain the trotters on paper towels, if needed.\nTo serve, place 2 tablespoons of the Sauce Gribiche on each serving plate to accompany the trotters.\nPork\nFrying"
}