{
  "url": "https://www.seriouseats.com/the-best-matzo-balls-recipe",
  "image_url": null,
  "tags": [
    "Soups",
    "Passover",
    "Comfort Food"
  ],
  "title": "The Best Matzo Ball Soup",
  "full_text": "The Best Matzo Ball Soup\nJump to recipe\nPrep\n10 mins\nCook\n70 mins\nActive\n25 mins\nChilling Time\n30 mins\nTotal\n110 mins\nServes\n4\nto 6 servings\nMakes\n18 matzo balls\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\neggs\n, beaten\n1/4\ncup\n(\n60\nml\n)\nseltzer\nor water (see notes)\n1/4\ncup\n(\n60\nml\n)\nSchmaltz (rendered chicken fat)\nor neutral oil like vegetable or\ncanola oil\n(see notes)\n1\ncup\nmatzo meal\n(\n4\nounces\n;\n113\ng\n)\n1/8 to 1\nteaspoon\nbaking powder\n(optional; see notes)\n2 1/2\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\n1/4\nteaspoon\nfreshly ground black pepper\n3\nquarts\n(\n2.8\nL\n)\ngood-quality homemade\nchicken stock\n, divided\n1/2\ncup\nfinely diced\ncarrot\n(\n7\nounces\n;\n198\ng\n), from\n1\nlarge\ncarrot\n1/2\ncup\nfinely diced\ncelery\n(\n2 3/4\nounces\n;\n78\ng\n), from\n1\nlarge\ncelery rib\n2\nfresh dill\nsprigs\n, plus picked fresh dill fronds for garnish\nDirections\nIn a large mixing bowl, combine eggs with seltzer and schmaltz or oil. In a small bowl, stir together matzo meal with baking powder (if using), 1 1/2 teaspoon salt, and pepper. Add dry ingredients to wet ingredients and stir to combine thoroughly. Refrigerate uncovered for 30 minutes until matzo absorbs all the liquid.\nSerious Eats / Daniel Gritzer\nMeanwhile, divide stock evenly between two pots, season both with 1/2 teaspoon salt each, and bring to a simmer over medium heat. Add diced carrot, celery, and dill sprigs to one pot and simmer until just tender, about 30 minutes; discard dill and cover to keep warm.\nUsing wet hands, and re-wetting hands as necessary, form matzo-ball mixture into 1- to 1 1/2–inch balls, and add to the simmering pot of stock without the carrots and celery. When all matzo balls have been added, cover and simmer until matzo balls have expanded and cooked through, about 40 minutes. Cooked matzo balls can be kept warm in their broth until ready to serve.\nThis roughly 1-inch uncooked matzo ball will swell to nearly twice its size once cooked, absorbing all the liquid it's been cooked in. If it's water, the matzo ball will taste...watery.\nSerious Eats / Max Falkowitz\nUsing a slotted spoon, transfer matzo balls to serving bowls (you should have at least 3 per bowl); strain matzo-ball-cooking broth and save for another use. Ladle hot clear broth with carrots and celery into each bowl and garnish with dill fronds. Serve.\nSerious Eats / Daniel Gritzer\nNotes\nIf you want dense sinkers, use water and omit the baking powder. For light matzo balls that still have some substance, use seltzer but omit the baking powder. For very light matzo balls use seltzer and add anywhere from 1/8 teaspoon to 1 full teaspoon baking powder (more baking powder will yield increasingly light matzo balls, with the higher amounts making insanely light ones).\nSchmaltz will add the most flavor to the matzo balls, but takes time to prepare; neutral oils are easier but don't add flavor.\nRead More\nMatzo Showdown: Manischewitz vs. Yehuda vs. Streit's\nThree Ways to Play With Your Matzo Balls\nEinat Admony's Chicken Soup With Gondi (Iranian Chicken and Chickpea Dumplings) Recipe\nSchmaltz (Rendered Chicken Fat)\nSoups\nPassover\nComfort Food"
}