{
  "url": "https://www.seriouseats.com/the-best-chicken-parmesan-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Z_yiYNWxctI18_gQX8qe5IX1BY4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140923-chicken-parm-recipe-35-039ea51056c24f2bb71ab9943be1cd9d.jpg",
  "tags": [
    "American",
    "Chicken Cutlets",
    "Tomato",
    "Chicken Mains"
  ],
  "title": "The Best Chicken Parmesan",
  "full_text": "The Best Chicken Parmesan\nClose\nJump to recipe\nPrep\n20 mins\nCook\n40 mins\nActive\n60 mins\nMarinating Time\n4 hrs\nTotal\n5 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nboneless skinless chicken breast\nhalves\n1 3/4\ncups\nbuttermilk\n, divided\n2\nmedium cloves\ngarlic\n, minced (about\n2\nteaspoons\n)\nKosher salt\nand freshly ground black pepper\n1/2\nloaf\ncrusty\nItalian bread\n, crust removed, sliced into 1/2-inch slices\n5\nounces\ngrated Parmesan cheese\n, plus more for serving\n1 1/2\ncups\nall purpose flour\n2\nlarge\neggs\n1\nquart\nItalian-American\nred sauce\n(see notes)\n1/2\ncup\nvegetable or\ncanola oil\n10\nounces\nfresh mozzarella cheese\n, cut into 1/2-inch chunks\n2\ntablespoons\nminced\nfresh parsley\n, basil, or a mix\nDirections\nWith a sharp chef's knife, split chicken breasts in half horizontally. Working one piece at a time, place inside a plastic zipper-lock bag and pound with a meat pounder or the bottom of a skillet to an even 1/4-inch thickness. Transfer to a large bowl.\nAdd 1 1/2 cups buttermilk and minced garlic to bowl. Season with 2 tablespoons kosher salt and 1 teaspoon freshly ground black pepper. Turn chicken with hands until salt, pepper, and garlic are evenly incorporated and all the chicken is coated in buttermilk mixture. Transfer to a large zipper-lock bag, press out the air, and seal. Refrigerate for at least 4 hours and up to overnight (see note).\nMeanwhile, place bread slices on a rack set in a rimmed baking sheet. Leave out on counter for at least 4 hours and up to overnight until mostly dried.\nThe next day, break bread into rough pieces (leave the wire rack in the rimmed baking sheet) and combine with 4 ounces Parmesan cheese in the food processor. Season with black pepper. Process until bread is finely ground, about 20 seconds. Transfer mixture to a large shallow bowl or pie plate.\nPlace flour in a second shallow bowl or pie plate. Whisk eggs, 2 tablespoons buttermilk, and 1 tablespoon of the flour in a third pie plate. Drizzle remaining 2 tablespoons buttermilk over the bread crumb/Parmesan mixture and incorporate with your fingertips. The mixture should be mealy, but hold together in clumps if you squeeze it together with your hands.\nWorking one piece of chicken at a time, remove from the bag and add to flour. Turn to coat, shake off excess, and add to egg mixture. Turn to coat, letting excess drip off, and add to bread crumb mixture. Turn to coat, piling crumbs on top and pressing down firmly so a thick layer adheres. Transfer coated chicken to the wire rack and repeat with remaining chicken breasts.\nPreheat oven to 425°F. Place sauce in a medium saucepan and heat over low heat, stirring occasionally, until barely simmering. Remove from heat and set aside.\nHeat oil in a large non-stick or cast iron skillet over medium-high heat until it registers 375 to 400°F on an instant read or deep-frying thermometer. Working in batches, carefully add chicken by lowering the cutlets away from you into the oil. Add as many cutlets as will fit in one layer (2 to 3).\nCook, swirling pan gently and using a thin flexible metal spatula to loosen chicken if it sticks, until chicken is golden-brown and crisp on bottom side, about 2 minutes. Using a thin metal spatula and a fork, carefully flip chicken and cook until golden brown on second side. Transfer chicken to a paper-towel lined plate to drain and repeat with remaining chicken.\nSpoon 1/3 of sauce onto the bottom of a casserole or oven-safe serving dish. Shingle chicken pieces on top of sauce. Top with more sauce, forming a line down the center. Combine mozzarella and remaining 1 tablespoon Parmesan cheese in a large bowl and toss to coat. Lay cheese mixture over chicken in a straight line down the center.\nTransfer to the oven and cook until cheese is melted and bubbly, about 20 minutes. Remove from oven and immediately grate fresh Parmesan on top. Allow to rest for 3 minutes, top with chopped herbs, and serve immediately.\nNotes\nFor best results, let the chicken brine in the buttermilk for at least 4 hours. If pressed for time, you can cut the brining time down to 1 hour and still get good results. You can use our\nAll-Day Red Sauce\nor our\nQuick and Easy Red Sauce\nfor this recipe, or a jar of your favorite tomato sauce (we recommend Rao's). For the mozzarella, I recommend the fresh variety available in cryovack containers, not the water-packed variety (which tends to be too moist).\nSpecial Equipment\nFood processor\nAmerican\nChicken Cutlets\nTomato\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-chicken-parmesan.webp?"
}