{
  "url": "https://www.seriouseats.com/the-food-labs-perfect-grilled-ribeye-steaks",
  "image_url": "https://www.seriouseats.com/thmb/DohQC_iADRKgJPdXvcxSjsPA930=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__06__20110516-cowboy-steak-kenji-lopez-alt-bb4a825bd05b4e91b7672bc1603043a8.jpg",
  "tags": [
    "Grilled Steaks",
    "Strip Steaks",
    "Beef Mains",
    "Memorial Day",
    "4th of July"
  ],
  "title": "The Food Lab's Perfect Grilled Steaks Recipe",
  "full_text": "The Food Lab's Perfect Grilled Steaks Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n15 mins\nResting Time\n50 mins\nTotal\n75 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nlarge\nribeye\nor strip\nsteaks\n, 1 1/2 to 2 inches thick, about\n2\npounds\n(\n900\ng\n) total (see note)\nKosher salt\nand freshly ground black pepper\nDirections\nSeason steaks liberally with salt. Set on a plate and let rest for at least 40 minutes or up to 4 days. If resting longer than 40 minutes, transfer to a wire rack set in a rimmed baking sheet and refrigerate, uncovered, until ready to cook.\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes.\nClean\nand\noil\ngrilling grate. Season steak with pepper and place on cooler side of grill. Cover and cook, with all vents open, flipping and taking temperature every few minutes, until steaks register 105°F (41°C) for medium-rare or 115°F (46°C) for medium on an instant-read thermometer, 10 to 15 minutes total.\nTransfer steaks to hot side of grill and cook, flipping frequently, until a deep char has developed and internal temperature registers 125°F (52°C) for medium-rare or 135°F (57°C) for medium, about 2 minutes total. Transfer steaks to a cutting board and allow to rest for at least 5 minutes and up to 10. Carve and serve immediately.\nSpecial equipment\nCharcoal grill\n,\ninstant-read thermometer\n,\nwire rack\nand rimmed baking sheet (optional)\nNotes\nFor best results, use prime, bone-in ribeye steaks. Ask your butcher to cut them at least one and a half inches thick. Each bone-in steak should be about one pound. Boneless steaks can be used as well; they should be about 12 ounces. New York strip, porterhouse, T-bone, or tenderloin steaks can be used in place of ribeye.\nThis Recipe Appears In\nAsk The Food Lab: Do Bones Add Flavor to Meat?\nThe Food Lab's Complete Guide to Dry-Aging Beef at Home\n7 Myths About Cooking Steak That Need to Go Away\nThe Food Lab: Flip Your Steaks Multiple Times for Better Results\nAsk The Food Lab: Does Resting Under Foil Ruin Meat?\nThe Food Lab's Definitive Guide to Grilled Steak\nThe Four High-End Steaks You Should Know\nGrilled Steaks\nStrip Steaks\nBeef Mains\nMemorial Day\n4th of July",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-food-labs-perfect-grilled-steaks-recipe.webp?"
}