{
  "url": "https://www.seriouseats.com/the-fake-shack-shake-shack-burger-recipe",
  "image_url": "https://www.seriouseats.com/thmb/pvXMnCqXbgu6GFZSjPr9zrbWQmI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210607-SHAKESHACKBURGERS-JANJIGIAN-3-b2c737aa12954bd2896d92f310de33b0.jpg",
  "tags": [
    "Burgers",
    "American",
    "Stovetop Beef",
    "Beef Mains"
  ],
  "title": "The Fake Shack (or the Shack Burger at Home)",
  "full_text": "The Fake Shack (or the Shack Burger at Home)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nChilling Time\n10 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Shack Sauce:\n1/2\ncup\n(\n120\nml\n)\nmayonnaise\n1\ntablespoon\n(\n15\nml\n)\nketchup\n1\ntablespoon\n(\n15\nml\n)\nyellow mustard\n4\nslices\nkosher dill pickle\n, finely chopped\n1/4\nteaspoon\ngarlic powder\n1/4\nteaspoon\npaprika\nPinch\ncayenne pepper\nFor the Burgers:\n8\nounces\n(\n225\ng\n)\nbeef sirloin\n, trimmed of gristle, and cut into 1-inch cubes\n4\nounces\n(\n115\ng\n)\nwell-marbled beef chuck\n, trimmed of gristle, and cut into 1-inch cubes\n4\nounces\n(\n115\ng\n)\nwell-marbled beef brisket\n, fat cap intact, trimmed of gristle, and cut into 1-inch cubes\n4\npotato sandwich rolls\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n, melted\n4\ntablespoons\n(\n60\nml\n)\nShack Sauce\n, divided\n4\nleaves\ngreen leaf lettuce\n8\ncenter-cut\nslices\nripe\nplum tomatoes\n1\nteaspoon\nvegetable oil\n, divided\nKosher salt\nand freshly ground black pepper\n4\nslices\nyellow\nAmerican cheese\nDirections\nFor the Shack Sauce:\nCombine all ingredients in a countertop blender jar and blend on high until smooth, scraping down sides of blender with rubber spatula as necessary, 30 seconds to 1 minute. Transfer sauce to an airtight container and refrigerate until ready to use (sauce can be refrigerated for up to 5 days).\nSerious Eats / Andrew Janjigian\nFor the Burgers:\nPlace feed shaft, blade, and 1/4-inch die of meat grinder in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece and place in freezer for 10 minutes until meat is firm, but not frozen.\nSerious Eats / Andrew Janjigian\nCombine meat in large bowl and toss to combine. Pass meat through grinder twice. Form into 4 disks, about 2 inches tall, and 2 1/2 inches wide. Refrigerate until ready to use.\nSerious Eats / Andrew Janjigian\nOpen buns but do not split hinge. Brush lightly with butter, then toast under broiler or in toaster oven until golden brown, about 1 minute. Spread 1 tablespoon (15ml) Shack Sauce on top half of each bun (for true authenticity, squirt out of squeeze bottle into three lines, three passes on each line). Place 1 leaf lettuce and 2 slices tomato on top half of each bun.\nSerious Eats / Andrew Janjigian\nUsing wadded-up paper towel, rub inside of heavy-bottomed 12-inch skillet with 1/2 teaspoon vegetable oil, then place over medium-high heat until just beginning to smoke. Season 2 beef pucks on top side with salt and pepper, then place, seasoned side down, in skillet. Using back of heavy, flat spatula, press down on beef pucks firmly to form 4-inch round patties. Season top side with salt and pepper. Cook until crisp brown crust has formed, about 2 minutes.\nSerious Eats / Andrew Janjigian\nCarefully scrape patties from skillet, and flip. Immediately top each patty with 1 slice American cheese. Cook until cheese is melted, about 1 minute longer. Transfer patties to burger bun bottoms, and close sandwiches. Wipe out skillet and repeat cooking process with remaining 2 beef pucks. Serve immediately.\nSerious Eats / Andrew Janjigian\nSpecial Equipment\nLarge\nstainless steel skillet\n,\nheavy flat spatula\nRead More\nThe Burger Lab: What's The Best Way To Grind Beef?\nMastering the Art of Burger Blending with Eight Cuts of Beef\nThe Burger Lab: The Principles of Topping Burgers\n10 Tips for Better Burgers\nThe Ultimate Smash Cheeseburger Recipe\nBurgers\nAmerican\nStovetop Beef\nBeef Mains"
}