{
  "url": "https://www.seriouseats.com/the-best-caesar-salad-recipe",
  "image_url": null,
  "tags": [
    "Green Salads",
    "Romaine Lettuce",
    "Quick Salads",
    "Easter Appetizers"
  ],
  "title": "The Best Caesar Salad",
  "full_text": "The Best Caesar Salad\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n20 mins\nCooling Time\n10 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nplus\n1/4\ncup\n(\n105\nml\n)\nextra-virgin olive oil\n, divided\n2\nmedium cloves\ngarlic\n, minced (about\n2\nteaspoons\n)\n3\ncups\nhearty bread\n, cut into 3/4-inch cubes\n2\nounces\nfinely\ngrated parmesan cheese\n(about\n1\ncup\n), divided\nKosher salt\nand freshly ground black pepper\n1\nlarge\negg yolk\n(see note)\n1\ntablespoon\n(\n15\nml\n)\njuice\nfrom\n1\nlemon\n2 to 6\nanchovies\n(see note)\n1\nteaspoon\n(\n5\nml\n)\nWorcestershire sauce\n(see note)\n1/3\ncup\n(\n80\nml\n)\ncanola oil\n2\nheads\nromaine lettuce\n, inner leaves only, washed and carefully dried, large leaves torn into smaller pieces, smaller leaves left intact\nDirections\nAdjust oven rack to middle position and preheat oven to 375°F (190°C). In a small bowl, combine 3 tablespoons (45ml) olive oil with minced garlic and whisk for 30 seconds. Transfer to a fine-mesh strainer set over a large bowl and press with the back of a spoon to extract as much oil as possible, leaving garlic behind. Reserve pressed garlic separately. Add bread cubes to garlic oil and toss to coat.\nSerious Eats / Diana Chistruga\nAdd 2 tablespoons parmesan cheese, toss again, and season to taste with salt and pepper. Transfer to a rimmed baking sheet. Bake until croutons are pale golden brown and crisp, about 15 minutes. Remove from oven and toss with 2 more tablespoons parmesan. Allow to cool.\nSerious Eats / Diana Chistruga\nWhile croutons bake, make the dressing. Combine egg yolk, lemon juice, anchovies, Worcestershire sauce, pressed garlic, and 1/4 cup parmesan cheese in the bottom of a cup that just fits the head of an immersion blender or in the bottom of a food processor. With blender or processor running, slowly drizzle in canola oil until a smooth emulsion forms. Transfer mixture to a medium bowl. Whisking constantly, slowly drizzle in remaining 1/4 cup (60ml) extra-virgin olive oil. Season to taste generously with salt and pepper.\nSerious Eats / Diana Chistruga\nTo serve, toss lettuce with a few tablespoons of dressing, adding more if desired. Once lettuce is coated, add half of remaining cheese and three-quarters of croutons and toss again. Transfer to a salad bowl and sprinkle with remaining cheese and croutons. Serve.\nSerious Eats / Diana Chistruga\nSpecial Equipment\nImmersion blender\nor\nfood processor\n,\nfine-mesh strainer\n,\nrimmed baking sheet\nNotes\nIf you're concerned about the safety of using raw egg in this recipe (while pregnant, or just in general), you can either purchase already-pasteurized eggs, or pasteurize yours at home using a\nsous vide circulator\nset at 135°F (57°C) for two hours.\nThe amounts of Worcestershire sauce and anchovies used can be varied according to taste. This recipe will make more dressing than you need for four servings. Extra dressing can be stored in the refrigerator for up to 1 week.\nRead More\nKale Caesar Salad Recipe\nGrilled Chicken Caesar Salad Recipe\nCaesar Salad Recipes and Technique Guides to Celebrate Its 100th Birthday\nHow the Caesar Salad Changed How We Eat\nGreen Salads\nRomaine Lettuce\nQuick Salads\nEaster Appetizers"
}