{
  "url": "https://www.seriouseats.com/the-best-squash-lasagna-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/U5yAPq2DxpY91Egi2CtsDODS8qo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2014__10__20141027-pumpkin-lasagna-food-lab-32-e1827c0243994c03af3563ab7048347f.jpg",
  "tags": [
    "Italian",
    "Vegetarian Mains",
    "Baked Pasta",
    "Lasagna",
    "Kabocha Squash"
  ],
  "title": "The Best Squash Lasagna",
  "full_text": "The Best Squash Lasagna\nClose\nJump to recipe\nPrep\n25 mins\nCook\n90 mins\nActive\n60 mins\nResting Time\n5 mins\nTotal\n2 hrs\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nlarge\nkabocha squash\nor sugar pumpkin (about\n2 1/2\npounds\n), quartered, seeds discarded\n1\ntablespoon\nolive oil\nKosher salt\nand freshly ground black pepper\n1\nlarge\negg\n4\nounces\ncream cheese\n6\ntablespoons\nunsalted butter\n, divided\n2\ntablespoons\nmaple syrup\n1/4\nteaspoon\ncinnamon\n1/4\nteaspoon\nfreshly grated\nnutmeg\n, divided\n2\ncrisp baking apples such as\nGolden Delicious\n, peeled, cored, and cut into 1/2-inch dice\n1/4\ncup\nminced fresh\nsage leaves\n1\npackage\nno-boil lasagna noodles\n(\n15\nnoodles\n)\n2\nmedium\ncloves garlic\n, minced (about\n2\nteaspoons\n)\n2\ntablespoons\nflour\n2\ncups\nwhole milk\n12\nounces\nshredded\ngruyère cheese\nDirections\nAdjust oven rack to center position and preheat oven to 325°F (160°C). Toss 3 squash quarters with 1 tablespoon olive oil and coat thoroughly using your hands. Season with salt and pepper. Place in a cast iron skillet or on a foil-lined rimmed baking sheet and roast until a knife meets no resistance when poked into the flesh around the stem, about 45 minutes. Remove from oven and set aside until cool enough to handle. Increase oven temperature to 400°F (200°C).\nSerious Eats / J. Kenji López-Alt\nScrape roasted squash flesh out into the work bowl of a food processor. Add egg, cream cheese, 2 tablespoons butter, maple syrup, cinnamon, and half of nutmeg. Process until a completely smooth purée is formed. Transfer to a medium bowl and set aside.\nSerious Eats / J. Kenji López-Alt\nWhile squashes are roasting in step 1, cut remaining squash quarter into 1/2-inch dice. Melt 2 more tablespoons butter in a large skillet over high heat, swirling until foaming subsides. Add diced squash and apple and cook, tossing and stirring frequently until tender and browned on most sides, about 10 minutes. Season to taste with salt and pepper and add minced sage. Transfer to a bowl and set aside.\nSerious Eats / J. Kenji López-Alt.\nPlace lasagna noodles in a 9- by 13-inch casserole dish and cover with cold water. Set aside, agitating the noodles occasionally to make sure they aren't sticking.\nSerious Eats / J. Kenji López-Alt\nMeanwhile, heat remaining 2 tablespoons butter and garlic in a medium saucepan over medium heat. Cook, stirring, until butter has melted and garlic is fragrant, about 1 minute. Add flour and cook, whisking constantly, until flour starts to smell nutty and is pale blond, about 2 minutes. Whisking constantly, slowly add milk in a thin, steady stream. Once milk is fully incorporated, bring to a boil, whisk vigorously, then remove from heat. Add 8 ounces of gruyère and whisk until completely smooth. If any lumps remain, blend with a hand blender or in a standing blender until smooth. Add remaining 1/8 teaspoon nutmeg and season to taste with salt and pepper. Set aside.\nSerious Eats / J. Kenji López-Alt\nRemove lasagna noodles from baking dish and transfer to clean dish towels to blot excess moisture.\nSerious Eats / J. Kenji López-Alt\nSpread 1/6 of white sauce over bottom of baking dish and top with 3 lasagna noodles. Add 1/5 of squash purée and 1/4 of sautéed squash and apple mixture. Top with 1/6 of white sauce.\nSerious Eats / J. Kenji López-Alt\nRepeat with 3 more layers of noodles, squash purée, cooked squash mixture, and white sauce. At this stage, you should have used up all of the sautéed squash and still have 1/6 of the white sauce and 1/5 of the squash purée remaining. Place final three noodles on top of lasagna, top with remaining purée, remaining 4 ounces of shredded gruyère, and drizzle with remaining white sauce. Cover with aluminum foil, and transfer to oven.\nSerious Eats / J. Kenji López-Alt\nBake, covered, for 20 minutes. Remove foil and continue baking until browned and bubbly, about 15 minutes longer. Remove from oven, let rest for 5 minutes, slice, and serve.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nFood processor\n, 9- by 13-inch casserole dish\nItalian\nVegetarian Mains\nBaked Pasta\nLasagna\nKabocha Squash"
}