{
  "url": "https://www.seriouseats.com/the-best-baba-ganoush-recipe",
  "image_url": null,
  "tags": [
    "Eggplant",
    "Middle Eastern",
    "Dairy-free Sides",
    "Gluten-free Sides",
    "Dips"
  ],
  "title": "The Best Baba Ganoush",
  "full_text": "The Best Baba Ganoush\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nActive\n15 mins\nTotal\n60 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nmedium\nItalian eggplants\n(about\n2\npounds\n/\n900\ng\ntotal), pricked all over with a fork\n2\ntablespoons\n(\n30\nml\n)\nlemon juice\nfrom\n1\nlemon\n, plus more as desired\n3\nmedium\ncloves garlic\n, minced\n3\ntablespoons\n(\n45\nml\n)\ntahini\n1/3\ncup\n(\n80\nml\n)\nextra-virgin olive oil\n, plus more for serving\n1/4\ncup\nchopped fresh parsley\nleaves\nKosher salt\nDirections\nIf Using a Grill (recommended):\nPreheat a gas or charcoal grill to medium heat and place eggplants directly over heat source. Cook, turning occasionally with tongs, until eggplants are completely tender and well charred on all sides, 30 to 40 minutes. Wrap with foil and let rest 15 minutes. Continue to step 3.\nIf Using the Broiler:\nAdjust rack to 6 inches below broiler element and preheat broiler to high. Place eggplants on a foil-lined rimmed baking sheet and prick all over with a fork. Broil, turning occasionally, until charred on all sides and completely tender, about 30 minutes (timing may vary depending on broiler strength). Eggplants should be very, very tender when cooked; if eggplant is not fully tender once skin is charred all over, switch oven to 425°F and roast until fully tender (a toothpick or skewer inserted near stem and bottom ends should not meet any resistance). Remove from oven and gather up foil, crimping it around eggplants to form a sealed package. Let eggplants rest for 15 minutes. Continue to step 3.\nSerious Eats / J. Kenji López-Alt\nOpen foil package. Working with one eggplant at a time, use a sharp\nparing knife\nto slit each eggplant open lengthwise. Carefully scoop out soft flesh with a large spoon and transfer to a fine-mesh strainer set in a large bowl. Once all eggplant is scooped, pick out any stray bits of skin and blackened flesh and discard.\nSerious Eats / J. Kenji López-Alt\nTransfer eggplant to a salad spinner, distributing it evenly around the perimeter. Spin gently until all excess moisture is extracted. Discard all drippings, wipe out large bowl, and return eggplant to bowl.\nSerious Eats / J. Kenji López-Alt\nAdd lemon juice and garlic to eggplant and stir vigorously with a fork until eggplant breaks down into a rough paste, about 1 1/2 minutes. Stirring constantly and vigorously, add tahini, followed by the olive oil in a thin, steady stream. The mixture should become pale and creamy. Stir in parsley and season to taste with salt, plus more lemon juice if desired.\nSerious Eats / J. Kenji López-Alt\nTransfer to a serving bowl, drizzle with olive oil, and serve with warm pita bread or vegetables for dipping.\nSpecial Equipment\nGrill\n,\nrimmed baking sheet\n,\nfine-mesh strainer\n, paring knife, salad spinner\nMake-Ahead and Storage\nThe baba ganoush can be made ahead of time and stored in an airtight container in the refrigerator for up to four days. Let it come back to room temperature before serving.\nEggplant\nMiddle Eastern\nDairy-free Sides\nGluten-free Sides\nDips"
}