{
  "url": "https://www.seriouseats.com/the-best-french-bread-pizza-recipe",
  "image_url": null,
  "tags": [
    "Pizza",
    "Vegetarian Mains"
  ],
  "title": "The Best French Bread Pizza Recipe",
  "full_text": "The Best French Bread Pizza Recipe\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nActive\n30 mins\nTotal\n45 mins\nServes\n3\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n4\ntablespoons\n(\n60\nml\n)\nextra-virgin olive oil\n, divided\n4\ncloves\ngarlic\n, finely minced\nPinch\nred pepper flakes\n1/2\nteaspoon\ndried oregano\n1/4\ncup\n(\n15\ng\n) minced fresh parsley or\nbasil leaves\n, or a mix\nKosher salt\n1\nlarge loaf\nFrench or\nItalian bread\n(see notes), about 18 inches long and 4 inches wide, split half lengthwise and crosswise\n1\n(\n14.5-ounce\n;\n400 g) can\ncrushed tomatoes\n8\nounces\n(\n225\ng\n) freshly grated\nwhole milk mozzarella\ncheese\n2\nounces\n(\n60\ng\n) grated\nParmigiano-Reggiano\nDirections\nAdjust oven rack to upper position and preheat oven to 425°F (220°C). Heat butter and 3 tablespoons (45ml) olive oil in a medium saucepan over medium-low heat until butter is melted. Add garlic, pepper flakes, and oregano and cook, stirring occasionally, until garlic is softened but not browned, about 2 minutes. Stir in half of parsley/basil and a big pinch of salt. Remove from heat.\nSerious Eats / Mateja Zvirotic Andrijanic\nPlace bread cut-side-up on a clean work surface. Using a rimmed baking sheet, press down on bread evenly until compressed to about 2/3rds of its original height. Place bread on top of rimmed baking sheet. Using a pastry brush, brush half of garlic/butter/oil mixture evenly over cut surfaces of bread, making sure to get plenty of bits of garlic and herbs. Set aside.\nSerious Eats / Mateja Zvirotic Andrijanic\nAdd tomatoes to remaining garlic/butter/oil mixture in pan, stir to combine, increase heat to medium, bring to a simmer, then reduce heat to maintain a bare simmer. Cook, stirring occasionally, until rich and reduced, about 15 minutes. Season to taste with salt.\nSerious Eats / Mateja Zvirotic Andrijanic\nWhile sauce cooks, spread 1/4 of mozzarella evenly over surface of bread and transfer to oven. Cook until cheese is barely melted, about 8 minutes. Remove from oven and set aside until sauce is cooked.\nSerious Eats / Mateja Zvirotic Andrijanic\nSpread sauce evenly over bread, then spread remaining mozzarella on top of sauce. Transfer to oven and bake until cheese is melted and just starting to brown, about 10 minutes. Remove from oven and immediately sprinkle with Parmigiano-Reggiano, remaining parsley/basil, and remaining tablespoon extra-virgin olive oil. Allow to cool slightly and serve.\nSerious Eats / Mateja Zvirotic Andrijanic\nPizza\nVegetarian Mains"
}