{
  "url": "https://www.seriouseats.com/the-mcwhopper-burger-king-mcdonalds",
  "image_url": "https://www.seriouseats.com/thmb/70FONizAfAb3jkT46T27kMBSPTE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__09__20150903-mcwhopper-kenji-primary-5bf6eba0772242ff84ff64e409354de2.jpg",
  "tags": [
    "Burgers",
    "American",
    "Grilled Beef",
    "Ground Beef",
    "Memorial Day"
  ],
  "title": "The McWhopper Recipe",
  "full_text": "The McWhopper Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n45 mins\nTotal\n50 mins\nServes\n2 burgers\nCook Mode\n(Keep screen awake)\nIngredients\n1\nmedium\nonion\n3\ntablespoons\nmayonnaise\n1\ntablespoon\nsweet pickle relish\n2\nteaspoons\nyellow mustard\n1\ntablespoon\nketchup\n2\nteaspoons\nsugar\n1/4\nteaspoon\nMarmite\n,\nVegemite\n,\nMaggi seasoning\n, or\nsoy sauce\n1/4\nteaspoon\nground turmeric\n3\nseeded hamburger buns\n14\nounces\nfresh\nground beef chuck\nKosher salt\nand freshly\nground black pepper\n2\nslices\nAmerican cheese\n3/4\ncup\nshredded\niceberg lettuce\n6\nslices\nfresh tomato\n8\ndill pickle chips\nDirections\nFinely mince half of the onion and place on a double layer of paper towels on a microwave-safe plate and microwave for 10 minutes on low power until mostly dehydrated but not browned. Set aside.\nMeanwhile, divide remaining half onion into two pieces. Thinly slice one piece pole-to-pole and set aside.\nTake remaining quarter onion and grate it on a microplane grater or the small holes of a box grater. Transfer to a medium bowl. Add mayonnnaise, relish, mustard, ketchup, sugar, marmite, and turmeric and stir to combine thoroughly. Season to taste with freshly ground black pepper\nUsing a sharp, thin knife, carefully remove the crust from the bottom half of one of the buns and the crust from the top of its partner to form two \"center\" buns for the constructed McWhoppers. Set buns aside.\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean\nand\noil\nthe grilling grate.\nWhile grill preheats, divide ground beef into 4 even balls. Press them into very thin, even patties about 1/2 inch wider than diameter of the buns.\nSeason patties generously with salt and pepper and place directly over hot side of grill. Cover and cook until grill marks appear, about 2 minutes. Rotate patties 90 degrees and continue cooking until well-charred on first side and juices are beginning to bubble up through the top of the patties, about 2 minutes longer.\nCarefully flip patties and top two of them with a slice of American cheese. Immediately transfer the patties to the coolest part of the grill. Toast burger buns over direct heat until nicely browned. Transfer buns to a serving platter.\nTo construct burgers, spread 1/4 of sauce evenly over each bottom bun. Divide fresh onions evenly between them, then add 1/4 of shredded lettuce to each. Add tomato slices. Top with the cheese-topped beef patties followed by the center buns. Spread remaining sauce evenly over the two middle buns, top with pickles, followed by the remaining beef patties, the dehydrated onions, and more shredded iceberg. Close the burgers and serve.\nSpecial Equipment\nGrill\n,\nchimney starter\nRead More\nWhy I Love the Whopper, Mess and All\nThe Food Lab: 10 Tips for Better Burgers\nGuide to Grilling Great Burgers\nBurgers\nAmerican\nGrilled Beef\nGround Beef\nMemorial Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-mcwhopper-recipe.webp?"
}