{
  "url": "https://www.seriouseats.com/the-ultimate-turducken-recipe",
  "image_url": "https://www.seriouseats.com/thmb/FO0KdB9ff7icUCCSdZ3aGZ15Rfc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2012__10__20121027-turducken-food-lab-64-69d9fd10521346a290f3ea70061706d0.jpg",
  "tags": [
    "Thanksgiving Turkeys",
    "Roasted Chicken",
    "Roasted Turkey",
    "Whole Chicken",
    "Duck"
  ],
  "title": "The Ultimate Turducken Recipe",
  "full_text": "The Ultimate Turducken Recipe\nClose\nJump to recipe\nPrep\n60 mins\nCook\n3 hrs 20 mins\nActive\n2 hrs\nResting Time\n20 mins\nTotal\n4 hrs 40 mins\nServes\n18\nto 24 servings\nCook Mode\n(Keep screen awake)\nIngredients\nKosher salt\nand\nfreshly ground black pepper\n1\nsmall\nchicken\n(\n3 1/2\nto\n4\npounds\npre-boning;\n1.6\nto\n1.8\nkg\n), bones removed\n2\npounds\n(\n907\ng\n)\nraw bulk sausage meat\n(see notes)\n1\nduck\n(\n4\nto\n4 1/2\npounds\npre-boning;\n1.8\nto\n2\nkg\n), bones removed\n3\ntablespoons\n(\n44\nml\n)\nvegetable oil\n1\nturkey\n(\n10\nto\n13\npounds\n;\n4.5\nto\n5.9\nkg\n), carcass removed, legs and wing bones left intact\nDirections\nSeason chicken evenly on all sides with salt and pepper. Lay chicken flat, skin side down, on cutting board. Shape 12 ounces of sausage into a log roughly 2 inches in diameter and place in the center of the chicken. Lift one side of chicken and wrap tightly around sausage. Lift the other side, allowing the skin from both sides to overlap and form a seal. The chicken should now be wrapped around the sausage. Wrap tightly in several layers of plastic wrap so that chicken forms a tight cylinder (see note). Alternatively, chicken can be tightly trussed with butcher's twine.\nSerious Eats / J. Kenji Lopez-Alt\nPlace chicken inside a vacuum sealer bag and seal. Place in a large stockpot and cover with warm water. Place over medium-high heat and heat until bubbles just begin to rise from the bottom. Reduce heat to lowest setting and cook until chicken feels firm to the touch and an instant read thermometer inserted through the plastic into the center of the chicken registers 140 to 145°F, about 45 minutes.\nSerious Eats / J. Kenji Lopez-Alt\nSerious Eats / J. Kenji Lopez-Alt\nWhile chicken is cooking, season the duck on all sides with salt and pepper. Place a 36- by 12-inch piece of plastic wrap on the cutting board. Lay duck flat, skin side down, on plastic wrap. Spread remaining sausage evenly over surface of meat. When chicken is cooked, remove from bag and plastic wrap and carefully pat dry with paper towels. Place hot chicken directly on top of duck, aligned along the center. Using the plastic wrap to aid you, carefully shape the duck around the chicken. Roll into a tight cylinder in several layers of plastic wrap. Alternatively, duck can be tightly trussed with butcher's twine.\nSerious Eats / J. Kenji Lopez-Alt\nPlace chicken/duck inside a vacuum sealer bag and seal. Place in a large stockpot and cover with warm water. Place over medium-high heat and heat until bubbles just begin to rise from the bottom. Reduce heat to lowest setting and cook until Duck feels firm to the touch, about 30 minutes.\nSerious Eats / J. Kenji Lopez-Alt\nRemove duck from water. If you used a vacuum bag or plastic wrap, remove both, then tightly truss the duck with twine. Dry exterior thoroughly with paper towels.\nSerious Eats / J. Kenji Lopez-Alt\nHeat 2 tablespoons oil in a large skillet over medium-high heat until shimmering. Add duck/chicken and cook, turning occasionally, until well browned and crisp on all sides, pouring off excess rendered fat as necessary (you can reserve this fat for another use), about 15 minutes total.\nSerious Eats / J. Kenji Lopez-Alt\nAdjust oven rack to lowest position and preheat oven to 425°F. Place turkey skin-side-down on a cutting board and season exposed surface with salt and pepper. Remove twine from duck/chicken and place in the center of the turkey, aligned along the center. If necessary, trim duck/chicken roll so that is is the same length as the turkey breasts. (You can serve the excess duck/turkey as well).\nSerious Eats / J. Kenji Lopez-Alt\nCarefully lift one side of the turkey to cover the duck/chicken, then lift the other side, letting the skin overlap by at least 1 inch. Use metal or wooden skewers to secure the skin in 5 to 8 locations. Carefully transfer turkey to a V- or U-rack set in a roasting pan, seam-side down.\nSerious Eats / J. Kenji Lopez-Alt\nWith the turkey's legs facing you, place a long piece of butcher's twine behind the breasts, tucking it into the wing joints. Pull it around the breast along its base to the bottom of the breast, then allow the ends to cross over. Wrap each end around the end of the drumstick, and pull them tightly together. Loop the ends of the twine around both drumsticks a few times to secure, then tie a knot and trim the excess. Rub remaining oil all over turkey and season with salt and pepper. Transfer to oven and roast until golden brown, turkey breast meat registers at least 150°F on an instant read thermometer, and thighs registers at least 165°F, about 1 1/2 hours.\nSerious Eats / J. Kenji Lopez-Alt\nSerious Eats / J. Kenji Lopez-Alt\nSerious Eats / J. Kenji Lopez-Alt\nSerious Eats / J. Kenji Lopez-Alt\nTransfer to cutting board, carefully remove skewers, and allow to rest for 20 minutes. To carve, remove legs and wings. Split breast in half lengthwise down the center to create two boneless halves. Slice crosswise into serving slices.\nSerious Eats / J. Kenji Lopez-Alt\nSpecial Equipment\nButcher's twine, plastic wrap and/or a\nvacuum sealer\n,\nlarge stockpot\n,\nlarge roasting pan with a V-rack\n, or a\nrimmed baking sheet with a wire rack\nNotes\nYou can use whatever sausage you like for this recipe. I prefer using a sweet sage sausage because it reminds me of traditional Thanksgiving sausage stuffing. If you are concerned about the safety of cooking in plastic wrap, use butcher's twine along with heat-approved vacuum-sealed bags designed for sous-vide cookery. The most difficult part is boning out the birds, but it's not as hard as it seems.\nThanksgiving Turkeys\nRoasted Chicken\nRoasted Turkey\nWhole Chicken\nDuck",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-ultimate-turducken-recipe.webp?"
}