{
  "url": "https://www.seriouseats.com/the-best-chili-recipe",
  "image_url": "https://www.seriouseats.com/thmb/V9u0mZQAnW_upNkZj4ejM5o3Wvg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-best-chili-recipe-HERO-ca6537699d274a44a868be954b520303.JPG",
  "tags": [
    "Chili",
    "Southwestern & Tex Mex",
    "Cannellini & Kidney Beans",
    "Short Ribs",
    "Beef Mains"
  ],
  "title": "The Best Chili Ever",
  "full_text": "The Best Chili Ever\nClose\nJump to recipe\nPrep\n25 mins\nCook\n4 hrs\nActive\n2 hrs\nSoaking Time\n8 hrs\nTotal\n12 hrs 25 mins\nServes\n6\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor Chili:\n1\npound\n(\n450\ng\n)\ndried dark red kidney beans\n3\ntablespoons\n(\n26\ng\n)\nkosher salt\nor\n6\ntablespoons\ntable salt\n3\nwhole\nancho\n, pasilla, or mulato\nchiles\n, seeded and torn into rough 1-inch pieces (about\n1/2\nounce\n)\n2\nwhole\nNew Mexico red\n, California, costeño, or choricero\nchiles\n, seeded and torn into rough 1-inch pieces (about\n1/8\nounce\n)\n1\nwhole\ncascabel\n, árbol, or\npequin\nchile\n, seeded and torn in half\n1 1/2\ntablespoons\n(\n9\ng\n)\nwhole cumin seeds\n1 1/2\nteaspoons\n(\n3\ng\n)\nwhole coriander seeds\n2\nwhole\ncloves\n1\nstar anise\n5\npounds\n(\n2.3\nkg\n)\nbone-in beef short ribs\n, trimmed of silver skin and excess fat\nFreshly ground black pepper\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1\nquart\n(\n900\nml\n)\nlow-sodium chicken broth\n(preferably\nhomemade\n), divided\n1\nounce\n(\n23\ng\n)\nchopped unsweetened chocolate\n2\ntablespoons\n(\n30\nml\n)\ntomato paste\n1\ntablespoon\n(\n5\ng\n)\nextra-finely ground coffee beans\n2\nwhole\nanchovy fillets\n2\nteaspoons\n(\n10\nml\n)\nsoy sauce\n1\nteaspoon\n(\n5\nml\n)\nMarmite\n1\nlarge\nyellow onion\n, diced fine (about\n1 1/2\ncups\n)\n4\ncloves\ngarlic\n, minced (about\n1\ntablespoon\n)\n3\nfresh Thai bird chiles\nor\n1\njalapeño\n, finely chopped\n1\ntablespoon\n(\n3\ng\n)\ndried oregano\n2\nbay leaves\n1\n(\n28-ounce\n;\n794 g\n)\ncan crushed tomatoes\n1/4\ncup\n(\n60\nml\n)\ncider vinegar\n, plus more to taste\n1/4\ncup\n(\n60\nml\n)\nvodka\nor bourbon\n2\ntablespoons\n(\n28\ng\n)\ndark brown sugar\n1\ntablespoon\n(\n15\nml\n) Buffalo-style hot sauce, such as\nFrank's RedHot\n(or more to taste)\nFor Garnish (all suggestions optional):\nScallions\n, thinly sliced\nCheddar, Jack, or\nColby cheese\n, grated\nSour cream\nJalapeño or\nPoblano peppers\n, stemmed, seeded, and diced\nOnion\n, diced\nAvocado\n, diced\nSaltine\ncrackers\nFritos\nDirections\nPlace beans, the 6 tablespoons (54g) kosher salt, and 4 quarts (4L) water in a large container or bowl. Allow to soak at room temperature at least 8 hours and up to 1 day. Drain and rinse soaked beans.\nSerious Eats / Qi Ai\nAdd dried chiles to a large heavy-bottomed Dutch oven or stockpot and cook over medium-high heat, stirring frequently, until slightly darkened with an intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles, place in a small bowl, and set aside. Alternatively, place dried chiles on a microwave-safe plate and microwave on high power in 15-second increments until chiles are pliable and toasted-smelling, about 30 seconds total. Reduce the heat to medium; add the cumin, coriander, cloves, and star anise to the Dutch oven and stir, toasting until the spices become fragrant. Remove spices, cool slightly, then transfer to a spice grinder and grind into a powder. Set aside.\nSerious Eats / Qi Ai\nSeason short ribs on all sides with salt and freshly ground black pepper. Add oil to Dutch oven and heat over high heat until smoking. Add half of short ribs and brown well on all sides (it may be necessary to brown ribs in 3 batches, depending on size of Dutch oven—do not overcrowd pan), 8 to 12 minutes total, reducing heat if fat begins to smoke excessively or meat begins to burn. Transfer to a large rimmed baking sheet or plate. Repeat with remaining short ribs, browning them in the fat remaining in Dutch oven. Once all short ribs are cooked, transfer all rendered fat into a small bowl and reserve separately. Allow short ribs to cool at room temperature.\nSerious Eats / Qi Ai\nMeanwhile, return Dutch oven to medium-high heat and add 1 cup (240ml) chicken broth, using a flat wooden spoon or stiff spatula to scrape browned bits off of bottom of pan. Reduce heat until chicken broth is at a bare simmer, add toasted chiles to liquid, and cook until chiles have softened and liquid is reduced by half, 5 to 8 minutes. Transfer chiles and liquid to a blender. Add ground spices, chocolate, tomato paste, coffee, anchovies, soy sauce, and Marmite. Blend at high speed, scraping down sides as necessary, until a completely smooth purée has formed, about 2 minutes. Set chile purée aside.\nSerious Eats / Qi Ai\nTrim meat from short rib bones and hand-chop into rough 1/2-inch to 1/4-inch pieces (finer or larger, as you prefer), reserving bones separately. Add any accumulated meat juices to chile purée.\nSerious Eats / Qi Ai\nHeat 4 tablespoons (60ml) rendered beef fat (if necessary, add vegetable oil to reach 4 tablespoons) in a large Dutch oven or heavy-bottomed stockpot over medium heat until shimmering. Add onions and cook, stirring frequently, until softened but not browned, 6 to 8 minutes. Add garlic, fresh chiles, and oregano and cook, stirring frequently, until fragrant, about 1 minute. Add chile purée and cook, stirring frequently and scraping bottom of pot, until chile mixture begins to fry and leaves a coating on bottom of pan, 2 to 4 minutes. Add remaining chicken stock, chopped beef, beef bones, and bay leaves. Bring to a simmer, scraping bottom of pan to loosen browned bits. Reduce heat to lowest possible setting, add beans, and cook, with cover slightly ajar, until beans are almost tender, about 1 hour. Add crushed tomatoes and cider vinegar and cook, with cover slightly ajar, until beans and beef are fully tender and broth is rich and lightly thickened, 2 to 3 1/2 hours longer, adding water if necessary to keep beans and meat mostly submerged (a little protrusion is okay).\nSerious Eats / Qi Ai\nUsing tongs, remove and discard bay leaves and bones. (At this point, any excess meat still attached to the bones can be removed, chopped, and added back to the chili, if desired.) Add vodka (or bourbon), brown sugar, and hot sauce and stir to combine. Season to taste with kosher salt, ground black pepper, and additional vinegar.\nSerious Eats / Qi Ai\nServe immediately, or, for best flavor, allow to cool and refrigerate overnight, or up to 1 week in a sealed container. Reheat and serve with desired garnishes.\nSerious Eats / Qi Ai\nSpecial Equipment\nDutch oven\nor\nheavy-bottomed stockpot\n,\ntongs\n,\nspice grinder\n,\nblender\nRead More\nAsk The Food Lab: On Browning Ground Meat In Recipes\nPressure Cooker Chunky Beef and Bean Chili Recipe\nChili\nSouthwestern & Tex Mex\nCannellini & Kidney Beans\nShort Ribs\nBeef Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-chili-ever.webp?"
}