{
  "url": "https://www.seriouseats.com/the-best-yorkshire-pudding-popover-recipe",
  "image_url": null,
  "tags": [
    "Sides",
    "Christmas Sides",
    "British",
    "Baking",
    "Savory"
  ],
  "title": "The Best Yorkshire Pudding",
  "full_text": "The Best Yorkshire Pudding\nJump to recipe\nPrep\n5 mins\nCook\n30 mins\nActive\n5 mins\nResting Time\n30 mins\nTotal\n65 mins\nServes\n8 Yorkshire puddings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\neggs\n(\n200\ng\n;\n7\nounces\n)\n150\ng\nall-purpose flour\n(\n5.25\nounces\n; about\n1\ncup\nplus\n2\nteaspoons\n)\n175\ng\nwhole milk\n(\n6\nounces\n;\n3/4\ncup\n) (see notes)\n2\ng\nkosher salt\n(about\n1/2\nteaspoon\n)\n25\ng\nwater\n(\n0.85\nounces\n;\n1\ntablespoon\nplus\n2\nteaspoons\n) (see notes)\n100\nml\nbeef drippings, lard, shortening, or\nvegetable oil\n(about\n1/2\ncup\n)\nDirections\nCombine eggs, flour, milk, water, and salt in a medium bowl and whisk until a smooth batter is formed. Let batter rest at room temperature for at least 30 minutes. Alternatively, for best results, transfer to an airtight container and refrigerate batter overnight or for up to 3 days. Remove from refrigerator while you preheat the oven.\nSerious Eats / J. Kenji López-Alt\nAdjust oven rack to center position and preheat oven to 450°F (230°C). Divide drippings (or other fat) evenly between two 8-inch cast iron or oven-safe non-stick skillets, two 6-well popover tins (see notes), one 12-well standard muffin tin, or one 24-well mini muffin tin. Preheat in the oven until the fat is smoking hot, about 10 minutes.\nTransfer the pans or tins to a heat-proof surface (such as an aluminum baking sheet on your stovetop), and divide the batter evenly between every well (or between the two pans if using pans). The wells should be filled between 1/2 and 3/4 of the way (if using pans, they should be filled about 1/4 of the way). Immediately return to oven. Bake until the yorkshire puddings have just about quadrupled in volume, are deep brown all over, crisp to the touch, and sound hollow when tapped. Smaller ones will take about 15 minutes, popover- or skillet-sized ones will take around 25 minutes.\nSerious Eats / J. Kenji López-Alt\nServe immediately, or cool completely, transfer to a zipper-lock freezer bag, and freeze for up to 3 months. Reheat in a hot toaster oven before serving.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nTwo 8-inch cast iron skillets\n, popover pan or\nmuffin tin\n(optional)\nNotes\nYorkshire puddings come out best when the batter has been rested for at least one night; however, they can be cooked immediately after forming the batter if time requires it. Form the batter as directed in step 1 and immediately proceed to step 2 without refrigerating it. The quantity of batter doesn't divide easily into standard 6-well popover pans, but you can scale up the recipe by 50% in order to make a full 12 popovers instead of 8. If using skim or low-fat milk, omit the water and increase amount of milk to 200g (7 ounces; 1 cup minus 2 tablespoons).\nRead More\nPopovers Recipe\nEggy Puds (Breakfast Yorkshire Puddings With Bacon and Fried Eggs) Recipe\nDutch Baby Recipe\nSides\nChristmas Sides\nBritish\nBaking\nSavory"
}