{
  "url": "https://www.seriouseats.com/thick-and-fluffy-pancakes",
  "image_url": null,
  "tags": [
    "Pancakes",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Thick and Fluffy Pancakes From Homemade Pancake Mix Recipe",
  "full_text": "Thick and Fluffy Pancakes From Homemade Pancake Mix Recipe\nJump to recipe\nPrep\n5 mins\nCook\n5 mins\nActive\nAbout 10 mins\nTotal\n10 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pancake Mix:\n4 1/2\nounces\nall-purpose flour\n, such as Gold Medal blue label (about\n1\ncup\n, spooned;\n125\ng\n)\n1/2\nounce\nsugar\n(about\n1\ntablespoon\n;\n15\ng\n)\n1/2\nounce\nmalted milk powder\n, such as Carnation or Hoosier Hill Farms (about\n2\ntablespoons\n;\n15\ng\n)\n1 1/2\nteaspoons\n(\n6.8\ng\n)\nbaking powder\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/4\nteaspoon\n(\n1.6\ng\n)\nbaking soda\n2 1/2\nounces\nrefined coconut oil\n, solid and firm, between 68°F and 72°F (about\n1/3\ncup\n;\n70\ng\n), see note\nFor the Pancakes:\n4\nounces\nmilk\n,\nany percentage will do\n, or non-dairy alternatives (about\n1/2\ncup\n;\n115\ng\n)\n1\nlarge\negg\n, straight from the fridge (\n1 3/4\nounces\n;\n50\ng\n)\n1/4\nounce\nvanilla extract\n(about\n1 1/2\nteaspoons\n;\n7\ng\n)\n1\nbatch\npancake mix\n, above (about\n1 1/2\ncups\n;\n8 1/4\nounces\n;\n233\ng\n)\nDirections\nFor the Pancake Mix:\nIn the bowl of a food processor, combine flour, sugar, malted milk powder, baking powder, salt, and baking soda. Process about 30 seconds to ensure the leavening agents are fully homogenized into flour.\nSerious Eats / Vicky Wasik\nAdd solid coconut oil and pulse only until it disappears into a dry and powdery mix, just a few seconds. It's important that the coconut oil is fully combined into the flour, while also remaining powdery and dry, so use caution and avoid over-processing, especially with larger batches. At this point, you can either continue with the recipe or transfer the mix to an airtight container and store up to one year at or below 74°F (24°C), or until the date stamped on the package of coconut oil.\nSerious Eats / Vicky Wasik\nFor the Pancakes:\nPreheat an electric griddle to 350°F (177°C), or heat a large, nonstick skillet to a similar temperature on the stovetop. In a large mixing bowl, whisk milk, egg, and vanilla extract until well combined. Add the prepared pancake mix, and whisk until relatively smooth, although a few flecks of coconut oil may dot the batter.\nSerious Eats / Vicky Wasik\nWith a large scoop, measuring cup, or piping bag, divide batter in 1/3-cup portions (or as desired), and griddle until golden brown on either side, and cooked through the middle, about 90 seconds per side. Serve immediately, with butter, maple syrup, fresh fruit, whipped cream, or whatever other toppings sound fun.\nTroubleshooting:\nThe timing and yield of this recipe will vary substantially depending on how the pancake batter is portioned as well as the exact temperature of the griddle itself. When pancakes are excessively browned but raw in the middle, the griddle is likely too hot; when the pancakes are cooked through but too soft and pale, the griddle may be too cool.\nSpecial Equipment\nFood processor\n,\nelectric griddle\n, 1/3-cup cookie scoop or other scoop for portioning (or a piping bag)\nNotes\nThis mix can be prepared with an equal amount of cold, unsalted butter to replace the coconut oil; however, this will eliminate its make-ahead qualities, and the mix will need to be prepared and used right away.\nMake-Ahead and Storage\nIn an airtight container, the pancake mix can be stored up to one year at or below 74°F (24°C), or until the date stamped on the package of coconut oil.\nRead More\nJust Add Milk and an Egg for the Easiest Homemade Pancake Mix\nPancakes\nMother's Day\nFather's Day"
}