{
  "url": "https://www.seriouseats.com/thick-and-juicy-home-ground-grilled-cheeseburgers",
  "image_url": "https://www.seriouseats.com/thmb/pUE9Dw4RjWKEG4JED7whaHoIzNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250523-SEA-ThickandJuicyCheeseburgers-LorenaMasso-HERO-68563a45a4184a0e82c5a8b9f68a719d.jpg",
  "tags": [
    "Burgers",
    "American",
    "Grilled Beef",
    "Beef Chuck",
    "Cheese"
  ],
  "title": "Thick and Juicy Home-Ground Grilled Cheeseburgers",
  "full_text": "Thick and Juicy Home-Ground Grilled Cheeseburgers\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nFreezing Time\n20 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\n(680 g)\nbeef chuck\n, cut into 1-inch cubes (see note)\nKosher salt\nand freshly ground black pepper\n4\nslices\ncheese\n4\nhamburger buns\nToppings\nas desired\nDirections\nTo Grind With a Meat Grinder:\nPlace grinding shaft, feed tube, plate, die, and screw of a meat grinder into the freezer. Spread beef chunks evenly in a single layer on a large plate or rimmed baking sheet. Place in freezer and freeze until starting to get firm around edges but still malleable, about 20 minutes. Set up meat grinder with 3/8-inch plate. Grind meat into a cold bowl. Working quickly, grind meat again using 1/4-inch plate. If grinder or meat begins to get too warm during grinding process, return to freezer for 10 minutes before continuing to grind.\nTo Grind With a Food Processor:\nSpread beef chunks evenly in a single layer on a large plate or rimmed baking sheet. Place in freezer and freeze until starting to get firm around edges but still malleable, about 20 minutes. Working in 3 batches, place meat cubes in the work bowl of a food processor. Pulse until finely chopped, about 15 to 20 short pulses. Transfer to a bowl and repeat with remaining beef.\nSerious Eats / Lorena Masso\nForm beef into 4 patties about 1/2-inch wider than the burger buns with a slight depression in the center to account for bulging as they cook. Season generously with salt and pepper and refrigerate until ready to cook.\nSerious Eats / Lorena Masso\nLight one chimney full of charcoal.\nWhen all the charcoal is lit and covered with gray ash, spread evenly over one side of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes.\nClean and oil\nthe grilling grate.\nSerious Eats / Lorena Masso\nPlace burgers directly over hot coals, cover with vents open, and cook, turning occasionally, until well charred and center of burgers register 110°F (43°C) on an instant-read thermometer, about 5 minutes. Place cheese on top of burgers and continue to cook until cheese is melted and burgers register 125°F (52°C) for medium-rare or 135°F (57°C) for medium, 1 to 2 minutes longer. Transfer burgers to a large plate.\nSerious Eats / Lorena Masso\nToast buns over center of grill until golden brown and warmed through. Top burgers as desired, place in buns, and serve.\nSerious Eats / Lorena Masso\nSpecial Equipment\nGrill\n,\nchimney starter\n,\ninstant-read thermometer\n,\nmeat grinder\nor\nfood processor\nNotes\nFor better flavor, use a combination of short rib, brisket, and sirloin in place of the ground chuck. For our favorite premium blend, see this\nblue label burger blend recipe\n.\nRead More\nWhat's The Best Way To Grind Beef?\nThe Principles of Topping Burgers\nThe Blue Label Burger Blend Recipe\nHow to Get Started Grilling\nBurgers\nAmerican\nGrilled Beef\nBeef Chuck\nCheese"
}