{
  "url": "https://www.seriouseats.com/thin-and-crispy-chocolate-chip-cookies",
  "image_url": null,
  "tags": [
    "Cookies",
    "American",
    "Chocolate"
  ],
  "title": "Tate's-Style Thin and Crispy Chocolate Chip Cookies Recipe",
  "full_text": "Tate's-Style Thin and Crispy Chocolate Chip Cookies Recipe\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n15 mins\nCooling Time\n90 mins\nTotal\n2 hrs 5 mins\nServes\n56 servings\nMakes\n56 cookies\nCook Mode\n(Keep screen awake)\nIngredients\n8\nounces\nlow protein\nall-purpose flour\n, such as Gold Medal blue label or Whole Foods 365 blue label (about\n1 3/4\ncups\n, spooned;\n225\ng\n)\n8\nounces\nlight brown sugar\n, not dark brown (about\n1\ncup\n, firmly packed;\n225\ng\n)\n3 1/2\nounces\nraw cane sugar\n, not white (about\n1/2\ncup\n;\n100\ng\n)\n2\nteaspoons\n(\n8\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1 1/2\nteaspoons\n(\n8\ng\n)\nbaking soda\n8\nounces\ncold,\nunsalted butter\n, cut into 1-inch chunks (about\n16\ntablespoons\n;\n225\ng\n)\n8\nounces\nassorted chocolate chips\n, preferably no darker than 70%, see note (about\n1 1/3\ncups\n;\n225\ng\n)\n1\nlarge\negg\n, straight from the fridge, well beaten (\n1 3/4\nounces\n;\n50\ng\n)\n1/2\nounce\nvanilla extract\n(about\n1\ntablespoon\n;\n15\ng\n)\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (175°C). In the bowl of a food processor, combine flour, light brown sugar, raw cane sugar, salt, and baking soda. Process until well-combined; add cold butter and pulse to form a dry and powdery mix; comparable results cannot be produced by hand or with a stand mixer. Add chocolate chips and pulse once or twice to combine. This mixture can be refrigerated up to one week in an airtight container or used immediately in the next step.\nSerious Eats / Vicky Wasik\nTransfer the cookie \"mix\" to a large bowl; add egg and vanilla, stir well; the mixture will seem alarmingly crumbly and dry at this stage. Once the wet ingredients have been absorbed, knead mixture by hand until it comes together like classic dough.\nSerious Eats / Vicky Wasik\nDivide into about 56 portions with a 1-tablespoon scoop. If you like, these can be transferred to a zipper-lock bag and refrigerated for up to 1 week or frozen for up to 3 months; soften to about 68°F (20°C) before baking.\nSerious Eats / Vicky Wasik\nArrange portions on a parchment-lined half-sheet pan (do not use a silicone mat), leaving about 2 or 3 inches between cookies to account for spread. Bake until thin and golden brown, with an even color from edge to center, about 16 minutes. Cool cookies directly on the baking sheet until room temperature. Transfer to an airtight container and continue cooling an hour more; the cookies will not be fully crisped until then. At cool room temperature, the cookies will keep at least 6 weeks in an airtight container.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n, 1-tablespoon cookie scoop,\nhalf-sheet pan\nNotes\nLook for commercial chocolate chips or chunks in the 60% range; those that don't list this information may be too sweet or mild. For the best flavor, try mixing and matching several brands. For specific recommendations, see\nmy review of widely-available chocolate chips\n.\nMake-Ahead and Storage\nThe prepared cookie \"mix\" can be refrigerated up to one week in an airtight container. The prepared cookie dough can be transferred to a zipper-lock bag and refrigerated up to 1 week or frozen up to 3 months; soften to about 68°F (20°C) before baking. The cooled cookies will keep in an airtight container up to 6 weeks at cool room temperature.\nRead More\n10 Supermarket Chocolate Chips for Better Cookies and Pancakes\nDavid Lebovitz's Chocolate Chip Cookies\nVegan Chocolate Chip Cookies\nCookies\nAmerican\nChocolate"
}