{
  "url": "https://www.seriouseats.com/toad-in-the-hole-recipe-11746714",
  "image_url": "https://www.seriouseats.com/thmb/AybLcr-tbPkBajI0MEs2tRzqsCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250529-SEA-ToadinTheHole-MelatiCitrawireja-Beauty1-12-859640a128914f7b8ac5d33636339a7c.jpg",
  "tags": [
    "Pork",
    "The Latest",
    "Sausages",
    "British"
  ],
  "title": "Toad in the What Now? This British Classic Deserves a Spot in Your Dinner Rotation",
  "full_text": "Toad in the What Now? This British Classic Deserves a Spot in Your Dinner Rotation\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nResting Time:\n30 mins\nTotal\n85 mins\nServes\n3\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Yorkshire Pudding Batter:\n3\nlarge\neggs\n4\nounces\nall-purpose flour\n(\n113\ng\n;\n3/4\ncups\nplus\n2\ntablespoons\n)\n4 3/4\nounces\nwhole milk\n(\n135\ng\n;\n1/2\ncup\nplus\n1\ntablespoon\n)\n1/2\nounce\nwater\n(\n15\ng;\n1\ntablespoon\n)\n1/2\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\nFor the Red Onion Gravy:\n2\ntablespoons\nbeef drippings\nor ghee (\n1\nounce\n;\n28\ng\n)\n1\nlarge\nred onion\n(\n11\nounces\n;\n310\ngrams\n) thinly sliced\n1/2\nteaspoon\nDiamond Crystal kosher salt\n, plus more to taste; for table salt, use half as much by volume\n1/4\ncup\ndry red wine\n(\n2\nounces\n;\n60\ng\n), such as Cabernet Sauvignon or Merlot\n1 1/2\ntablespoons\nall-purpose flour\n(\n1/2\nounce\n; about\n12\ng\n)\n1 1/2\ncups\nlow-sodium beef stock\n(\n12\nounces\n;\n360\ng\n), homemade or store-bought, see notes\n2\nteaspoons\nred wine vinegar\n(\n1/3\nounce\n;\n10\ng\n)\nFreshly\nground black pepper\n, to taste\nTo Assemble:\n1\npound\n(\n454\ng\n)\npork sausages\n1\nrecipe\nYorkshire pudding batter\n, see above\n4\ntablespoons\nbeef drippings\nor ghee (\n2\nounces\n;\n56\ng\n)\nDirections\nFor the Yorkshire Pudding Batter:\nIn a medium mixing bowl, whisk together eggs, flour, milk, water, and salt until well blended and smooth. (A few lumps are OK.) Let batter rest for 30 minutes at room temperature or up to 3 days in the refrigerator. (For best results, let batter rest for at least 24 hours.)\nSerious Eats / Melati Citrawireja\nFor the Gravy:\nIn a large stainless steel, carbon steel, or cast iron skillet, melt beef drippings or ghee over medium-low heat. Add onions and salt and cook, stirring occasionally, until soft and lightly caramelized, 15 to 20 minutes.\nSerious Eats / Melati Citrawireja\nIncrease the heat to medium and add wine. Cook, stirring frequently, until nearly all liquid has evaporated, about 1 minute. Sprinkle flour over onions and toss to coat until no dry spots remain. Add stock, bring mixture to a boil, then reduce heat to low. Simmer, stirring occasionally to prevent sticking, until thick enough to coat the back of a spoon and slightly reduced, about 10 minutes. Remove from heat and stir in red wine vinegar and black pepper. Keep warm until ready to use.\nSerious Eats / Melati Citrawireja\nTo Assemble:\nAdjust oven rack to middle position and preheat to 450°F (230°C). Heat a large cast iron skillet over medium-high until hot, about 3 minutes.\nAdd 1 tablespoon of beef drippings or ghee to the pan. Add sausages and cook until wellbrowned, 3 to 5 minutes per side. Add the remaining 3 tablespoons of beef drippings or ghee. When fat has melted, arrange the sausages throughout the pan. Stir Yorkshire pudding batter to reincorporate and pour around sausages, tilting pan as needed to distribute the batter throughout pan. Immediately transfer the pan to the hot oven and bake until well-puffed and deep golden brown, 15 to 18 minutes.\nSerious Eats / Melati Citrawireja\nSerious Eats / Melati Citrawireja\nThe toad in the hole will deflate rapidly as it cools down; this is normal. Slice into wedges and smother each portion in onion gravy. Serve immediately.\nSerious Eats / Melati Citrawireja\nSpecial Equipment\n12-inch\ncast iron skillet\nNotes\n1 1/2 cups water mixed with 1 1/2 teaspoons beef bouillon paste, such as Better Than Bouillon, can be used in place of beef stock.\nMake-Ahead and Storage\nThe Yorkshire pudding batter can be made up to three days in advance and stored in an airtight container in the refrigerator.\nStore leftover toad in the hole in an airtight container in the refrigerator for up to three days. Reheat in a 350°F (180°C) oven, air fryer, or microwave until warmed through.\nPork\nThe Latest\nSausages\nBritish"
}