{
  "url": "https://www.seriouseats.com/toasted-white-sesame-tart-chocolate-ganache",
  "image_url": null,
  "tags": [
    "Desserts",
    "Baking",
    "Chocolate",
    "Sesame & Tahini",
    "Fall Desserts"
  ],
  "title": "Toasted White Sesame Tart With Bittersweet Chocolate Ganache Recipe",
  "full_text": "Toasted White Sesame Tart With Bittersweet Chocolate Ganache Recipe\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n15 mins\nFreezing and Cooling Time\n70 mins\nTotal\n2 hrs 5 mins\nServes\n12\nto 14 servings\nMakes\n1 tart\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Ganache:\n2\nounces\nbittersweet chocolate\n, about 60%, chopped (\n1/3\ncup\n;\n60\ng\n)\n2\nounces\n(\n1/4\ncup\n;\n60\ng\n)\nheavy cream\n1/2\nrecipe\npâte sucrée\n, blind-baked per directions\nFor the Custard:\n1\nounce\ntoasted white sesame seeds\n(\n1/4\ncup\n;\n30\ng\n), plus more for sprinkling on top\n2\nounces\ngranulated sugar\n(\n1/4\ncup\n;\n60\ng\n), plain or toasted\n1 1/2\nteaspoons\nall-purpose flour\n, such as Gold Medal\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\nounces\n(\n4\ntablespoons\n;\n60\ng\n)\nunsalted butter\n, melted\n1/2\nounce\n(\n1\ntablespoon\n;\n15\ng\n)\nhoney\n1/2\nounce\n(\n1\ntablespoon\n;\n15\ng\n)\ntahini paste\n1\nteaspoon\nvanilla extract\n1\nlarge\negg\n(\n1 3/4\nounces\n;\n50\ng\n)\n1\nlarge\negg yolk\n(\n3/4\nounce\n;\n20\ng\n)\n2\nounces\n(\n1/4\ncup\n;\n60\ng\n)\nsour cream\n6\nounces\n(\n3/4\ncup\n;\n170\ng\n)\nheavy cream\nDirections\nAdjust oven rack to center position and preheat oven to 325°F (163°C).\nFor the Ganache:\nPlace chocolate in a small, heatproof bowl. In a 1-quart stainless steel saucier, heat cream over medium-high heat until it has reached a simmer and started to bubble hard around the edges. Immediately pour hot cream over chocolate and let stand 1 minute. Using a spoon, stir until smooth.\nUsing the same spoon, scrape the ganache into the blind-baked tart shell. Using the back of the spoon, spread ganache in a smooth, even layer that covers the inside bottom of tart shell.\nTransfer tart shell to a rimmed baking sheet and place in the freezer until ganache is firm, about 10 minutes.\nMeanwhile, for the Custard:\nIn a blender or spice grinder, process sesame seeds until coarsely powdered, about 5 seconds.\nIn a medium bowl, whisk together powdered sesame seeds, granulated sugar, all-purpose flour, and salt.\nAdd melted butter, honey, tahini paste, and vanilla extract to dry ingredients. Whisk until thoroughly combined.\nWhisk in egg and egg yolk, followed by sour cream, until mixture is smooth with no visible lumps.\nWhisk in heavy cream until well combined.\nRemove baking sheet from freezer and place on a level surface. Pour custard into prepared tart shell, then sprinkle sesame seeds evenly on top. Carefully transfer baking sheet with filled tart shell to oven. Bake until custard is slightly puffed at the edges and the center is just set, about 35 minutes.\nSet baking sheet with finished tart on a wire rack to cool to room temperature, about 1 hour. Slice and serve.\nSpecial Equipment\n1-quart stainless steel saucier,\nblender\n,\nspice grinder\n,\nrimmed baking sheet\n,\nwire rack\nNotes\nThe custard can be prepared ahead of time and then refrigerated in an airtight container for up to 24 hours. When you are ready to bake the tart, remove the custard from the refrigerator and whisk well before pouring into the prepared tart shell.\nVicky Wasik\nMake-Ahead and Storage\nCovered with foil or plastic, the tart will keep for up to 1 day at room temperature.\nDesserts\nBaking\nChocolate\nSesame & Tahini\nFall Desserts"
}