{
  "url": "https://www.seriouseats.com/toasted-barley-salad-kombu-pepitas",
  "image_url": "https://www.seriouseats.com/thmb/OCJLdB43XK6a8B3eZv5MmT7EJdY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201015-banchan-thanksgiving-barley-vicky-wasik-1-2-37173691b9ba45df83db4f918159b928.jpg",
  "tags": [
    "Grain Salads",
    "Stovetop",
    "Pumpkin Seeds",
    "Barley",
    "Quick Salads"
  ],
  "title": "Toasted Barley Salad With Kombu and Pepitas Recipe",
  "full_text": "Toasted Barley Salad With Kombu and Pepitas Recipe\nClose\nJump to recipe\nActive\n15 mins\nTotal\n40 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n200\ng\n)\nhulled barley\n1\nounce\n(\n28\ng\n)\nkombu\n(about\n4\n4- by 8-inch pieces\n)\n1/2\ncup\n(\n56\ng\n)\nstore-bought\nor\nhomemade\nroasted and salted pumpkin seeds\n(a.k.a.\npepitas\n)\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n(see notes)\nDirections\nIn a dry 3-quart saucepan, toast barley over medium-low heat, stirring frequently, until the barley turns deep golden brown, puffs slightly, and takes on a deep, nutty aroma, about 10 minutes.\nAdd kombu and 3 cups (710ml) water to saucepan and bring to a simmer over medium-high heat. Adjust heat to maintain a simmer, cover, and cook, stirring occasionally, until most of the water has been absorbed, barley is just cooked through but still firm, and kombu is softened, 15 to 20 minutes.\nRemove saucepan from heat, use tongs to transfer kombu to cutting board, and set saucepan aside to allow barley to cool in remaining cooking liquid.\nUsing a sharp knife, cut kombu into 1/2-inch pieces. Fold kombu pieces back into the barley, along with pumpkin seeds and olive oil. Taste and adjust seasoning with salt and pepper, if necessary. Divide between individual small serving bowls and serve; the barley can be served warm or at room temperature. If not serving right away, barley can be refrigerated in an airtight container for up to 3 days; bring to room temperature before serving.\nSpecial Equipment\n3-quart saucepan with lid\nNotes\nFor best results, use a mild-flavored olive oil that won't overwhelm the flavors of the toasted barley and kombu.\nMake-Ahead and Storage\nBarley salad can be refrigerated in an airtight container for up to 3 days; bring to room temperature before serving.\nThis Recipe Appears In\nCelebrate the Sides With a Korean-American Banchan Thanksgiving\nGrain Salads\nStovetop\nPumpkin Seeds\nBarley\nQuick Salads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/toasted-barley-salad-with-kombu-and-pepitas-recipe.webp?"
}