{
  "url": "https://www.seriouseats.com/toasted-kasha-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/JIVKFjqoJlEPm5UpKWYlrUFPFCk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__09__20150902-tomato-kasha-salad-vicky-wasik-9-22af5fa7a06b42b28ee8076fbd1fca2c.jpg",
  "tags": [
    "Quick Salads",
    "Vegan Salads",
    "Scallions"
  ],
  "title": "Green Salad With Tomatoes, Scallions, and Toasted Kasha Recipe",
  "full_text": "Green Salad With Tomatoes, Scallions, and Toasted Kasha Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n5 mins\nActive\n15 mins\nCooling Time\n5 mins\nTotal\n15 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\nextra virgin olive oil\n1/4\ncup\ntoasted\nkasha\n(see note)\nKosher salt\n3\nquarts\nloosely packed torn\nlettuce\nleaves (about\n2\nmedium\nheads\nlettuce\n; see note)\n1\npint\nmixed\ncherry tomatoes\n, quartered\n2\nscallions\n, white and light green parts only, cut into thin slivers on a bias and soaked in ice water for 15–30 minutes, then drained\nSimple vinaigrette\nDirections\nIn a medium skillet, heat oil over medium-high heat until shimmering. Add kasha and cook, stirring, until lightly toasted and fragrant, about 30 seconds. Transfer to a paper towel–lined plate to drain and season with salt. Let cool completely.\nSerious Eats / Vicky Wasik\nIn a large bowl, combine lettuce, tomatoes, and scallions. Sprinkle a few pinches of toasted kasha on top and season with salt. Drizzle with just enough vinaigrette, gently tossing with clean hands to lightly coat lettuce leaves. Serve right away. Reserve extra kasha for another use (such as a garnish for other dishes).\nSerious Eats / Vicky Wasik\nNotes\nThe kasha is sold as \"toasted\" kasha, but you'll be toasting it again in the skillet with oil.\nUse any variety of tender green lettuces you can find, or a single variety if that's what's available.\nRead More\nMarinate Tough Greens, Use Fresh Herbs, and More Pro Tips for Better Salads\nHow to Make a Mixed-Green Salad Like You Actually Care\nWinter Greens Salad With Flax Seeds, Shaved Beets, and Radishes Recipe\nGreen Salad With Pickled Mushrooms, Cucumbers, Onions, and Pecorino Recipe\nQuick Salads\nVegan Salads\nScallions"
}