{
  "url": "https://www.seriouseats.com/toisan-style-joong-zong-zi-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zIfV2s_4ex9DjSxSmVG_wMuMdDo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110518-joong-pillow-shaped-primary-06d7976d8019474ea5f7da23cf56fab5.jpg",
  "tags": [
    "Rice & Grains",
    "Chinese",
    "Stovetop",
    "Pork Belly"
  ],
  "title": "Toisan-Style Joong",
  "full_text": "Toisan-Style Joong\nClose\nJump to recipe\nPrep\n3 hrs 15 mins\nCook\n3 hrs 55 mins\nSoaking Time\n24 hrs 15 mins\nTotal\n31 hrs 25 mins\nServes\n15 joong\nCook Mode\n(Keep screen awake)\nIngredients\n1 (\n12\n-\nounce\n) package\ndried joong leaves\n(see notes)\n3 links of\nChinese sausage\n, about\n6\nounces\ntotal (Cantonese: lap cheong)\n1/2\npound\ncured pork belly\n(\nrecipe\n)\n8\nraw salted duck egg yolks\n(\nrecipe\n, see notes)\n1/4 cup\ndried baby shrimp\n, about\n1\nounce\ntotal (Cantonese: ha mai, see notes)\n4\ndried scallops\n, about\n1\nounce\ntotal (Cantonese: ghown bhoy, see notes)\n2 1/2\npounds\nglutinous rice\n(Cantonese: loh mai, see notes)\n1 (\n14\n-\nounce\n) package\ndried split hulled mung beans\n(see notes)\n2\nteaspoons\nvegetable or\ncanola oil\n4\nteaspoons\nkosher salt\nDirections\nFor the Joong Leaves:\nPlace at least half of the package of joong leaves in a large container and cover completely with cool water. Soak leaves for 24 hours, changing water twice.\nPlace joong leaves in large stockpot or Dutch oven. Cover with water and place on stove over high heat. Bring to a boil, reduce heat to medium and cook for 30 minutes. Drain leaves and rinse with cold water. Using a vegetable brush, take one leaf and scrub each side and rinse again under running water. Trim off stem using kitchen shears and discard. Repeat until all the leaves are scrubbed, rinsed and trimmed. Put leaves in colander, cover with a damp kitchen towel, and set aside.\nFor the Lap Cheong:\nRinse lap cheong under cold running water and drain. Cut each lap cheong in half crosswise. Split each half lengthwise twice into quarters (you should get 8 pieces out of each lap cheong). Set aside.\nFor the Cured Pork Belly:\nRinse pork belly under cold running water to remove excess salt. Pat dry with paper towels and slice into 1/2-inch wide strips lengthwise. Cut each strip into 1-inch pieces. Set aside.\nFor the Salted Duck Egg Yolks:\nIf using cooked salted duck egg yolks, cut each yolk in half and set aside.\nIf using raw salted duck egg yolk, separate whites from yolks. Reserve whites for another use (they will keep for 1 month in the refrigerator). Cut yolks in half using lightly oiled kitchen shears.\nFor the Dried Shrimp and Dried Scallops:\nPlace shrimp and scallops in separate small bowls. Wash 3 times in cold water and drain. Cover completely with water and let soak for 15 minutes. Drain and set aside. Shred scallops into strips and set aside.\nFor the Rice:\nPlace rice in fine-mesh strainer. Rinse under cold running water until water runs clear. Transfer to large bowl and cover completely with cold water. Allow to soak 15 minutes. Drain well and transfer to large bowl.\nFor the Mung Beans:\nPlace beans in fine-mesh strainer. Rinse under cold running water until water runs clear. Add vegetable oil and salt and mix well. Add mung beans to rice and toss to combine.\nTo Assemble:\nTake 2 whole joong leaves of approximately the same size. Make sure there are no tears or rips in leaves. Leaves should curve in same direction. Take one joong leaf in each hand holding it horizontally in front of you while making sure the ends match each other. Overlap edge of one leaf onto center spine of other leaf. Hold overlapping leaves together with your thumb in the center of the leaves and fold in half.\nFold bottom half inch of leaf upwards and tuck under thumb to create pocket inside leaves for joong. Hold the folded leaves in one hand and then use the other hand to open the leaves to make the pocket inside.\nHolding leaves firmly, place 3 tablespoons rice mixture in pocket. Add 1 piece cured pork belly, half an egg yolk, 3 shrimp, 3 strands scallops and 1 piece lap cheong to center of rice. Cover filling with another 3 tablespoons rice.\nAdd third joong leaf by wrapping it around top of the two leaves in order to extend the height of the joong. You will be using this leaf to close everything up. Take outer edge of third leaf and fold it towards the center, sealing the joong. The joong should now be sealed at one end and open at the other.\nSmooth out leaves towards open end and then gather all the ends, fold them towards the center and hold down with your thumb. Be firm, but do not rip or tear leaves. If leaves tear, start over. Secure with kitchen twine by making several loops around joong and securing with a knot. Pat finished joong with hands on both sides to compact. Repeat until joong leaves and filling are finished. Excess joong leaves can be dried at room temperature on a wire cooling rack and reused.\nLayer finished joong in a large stockpot and cover with water. Place on stove over high heat, cover, and bring to a boil. Reduce heat to medium. Cook for 2 1/2 hours, topping up pot with boiling water to keep joong submerged and rotating joong every hour to promote even cooking.\nRemove joong and drain in colander set in sink. Allow to rest for 10 minutes. Cut open parcels and serve immediately with soy sauce. Extra joong can be stored in refrigerator for up to 1 week or in freezer for several months. To reheat, place in simmering water until heated through.\nNotes\nFor the joong: Boiling the leaves in step 4 is very important. It will remove the impurities on the leaves that can cause the joong to spoil during storage.\nPackaged, cooked salted duck egg yolks can be used instead of salted duck eggs you've prepared yourself, but the cooked duck egg yolk will not have a creamy, rich consistency in the finished joong. Rather, it will have a crumbly, sandy texture.\nDried shrimp: Purchase the baby shrimp that are the size of a split green pea. Make sure to smell before buying; they should have a pleasantly fishy, briny aroma. If there is an off odor or no smell at all, do not buy it. Also, do not buy ones that are extremely bright orange; this means they were most likely treated with food dye and aren't good quality.\nDried scallops: Dried scallops are an expensive ingredient, but for joong there's no need to purchase the top quality. Purchase a middle grade; never buy the lowest grade of any dried preserved ingredient because it's a waste of money. Smell your dried scallops before purchasing and check for the savory, almost meaty smell. Remember, no smell means they'll have no taste. Make sure you buy whole scallops and not ones that are broken or have dried edges.\nGlutinous rice: I prefer\nKoda Farms Sho-Chiku-Bai Premium Sweet Rice\nbecause the rice cooks up firmer than other brands.\nYou can find these items in large Asian supermarkets in most major cities or online. In New York, my go-to place is\nPo Wing Hong\nin Manhattan's Chinatown because they have a good inventory of quality products at a reasonable price and a staffed dried preserved food section. A plus is that all the non-perishable ingredients are listed above so it offers one stop shopping. The packaged, cooked salted duck egg yolks are available at Po Wing Hong as well.\nGather your family and friends. This recipe is quite a bit of work for one person, so we encourage turning it into a group project.\nSpecial Equipment\n1 large stockpot (or similar sized pot with lid), 1 ball of kitchen string, large container to soak joong leaves in (you may also soak them in your clean kitchen sink)\nRead More\nCured Pork Belly Recipe\nSalted Duck Eggs Recipe\nRice & Grains\nChinese\nStovetop\nPork Belly"
}