{
  "url": "https://www.seriouseats.com/tom-yam-noodle-soup-with-minced-pork-recipe-8410816",
  "image_url": "https://www.seriouseats.com/thmb/74h5lyqDcKHGswmEVHFF8robIbs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231205-SEA-GuaydtiaaoTomYamMooSaap-AmandaSuarez-hero-450f7307a9dc4ca6b12fa06e606e8a01.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Noodles",
    "Thai",
    "Pork"
  ],
  "title": "Guaydtiaao Tom Yam Moo Saap (Tom Yam Noodle Soup With Minced Pork)",
  "full_text": "Guaydtiaao Tom Yam Moo Saap (Tom Yam Noodle Soup With Minced Pork)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nSteeping Time\n30 mins\nTotal\n65 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Wonton Crisps:\nCanola oil\nor other neutral oil, for frying\n5\nwonton\nwrappers\nfrom\n1\npack\nfresh Hong Kong–style square\nwonton wrappers\n, sliced in half diagonally into triangles (see notes)\nFor the Minced Pork:\n5\nounces\n(\n142\ng\n)\nground pork\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\n1\nteaspoon\n(\n5\nml\n) Thai\noyster sauce\n1\npinch\ngranulated sugar\nFor the Chile Vinegar:\n1\ncup\n(\n240\nml\n) distilled\nwhite vinegar\n1\npinch\nkosher salt\n4\nmedium\nred\nchiles\n, such as Holland, Fresno, or Cayenne (\n2 1/2\nounces\n;\n70\ng\n), stemmed and thinly sliced crosswise\nTo Assemble and Serve:\n3\ncups\n(\n710\nml\n)\nNam Cheua Gradook Moo (Thai\nPork Stock)\n12\nstore-bought\nfrozen pork\nballs\n(about\n11\nounces\n;\n312\ng\n), see notes\n1/4\ncup\n(\n60\nml\n)\nfish sauce\n, plus more for serving\n1/4\ncup\n(\n45\ng\n) roughly chopped dry\nroasted peanuts\n, plus more for serving\n1/4\ncup\n(\n45\ng\n)\ngranulated sugar\n, plus more for serving\n2\ntablespoons\nplus\n2\nteaspoons\n(\n40\nml\n) fresh\nlime juice\n, plus more for serving\n4\nteaspoons\n(\n12\ng\n) roasted\nThai chile flakes,\nplus more for serving\n2\ntablespoons\nplus\n2\nteaspoons\n(\n40\nml\n)\ngarlic oil\nfrom\n1\nrecipe\nCrispy Fried Garlic and Garlic Oil\n, plus crispy fried garlic for serving\n8\nounces\n(\n226\ng\n)\ndried rice stick noodles,\nsuch as Erawan or Asian Best, from\n1\n(1-pound) package\n4\nsprigs\nmorning glory\n(\n50\ng\n), cut into 2-inch segments (see notes)\n2\ncups\n(\n140\ng\n)\nmung bean sprouts\n3 to 4\nsprigs\ncilantro\n, sliced into 1/4-inch lengths\n3\nscallions\n, green parts only, thinly sliced crosswise\n2\nlarge\nsoft-boiled eggs\n, halved\nDirections\nFor the Wonton Crisps:\nLine a rimmed baking sheet with paper towels. In a wok or 2-quart saucepan, heat 2 inches of oil to 375°F (190°C) over medium-high heat. Working in batches, add wontons and cook, flipping once or twice, until crispy, 10 to 15 seconds. Using a wire skimmer, transfer to paper towel–lined baking sheet. Set aside.\nSerious Eats / Amanda Suarez\nFor the Minced Pork:\nIn a mixing bowl, thoroughly mix together pork, fish sauce, oyster sauce, and sugar. In a medium saucepan, bring 1 quart (1L) water to a boil. Add ground pork and cook, using chopsticks or a wooden spoon to break it up into small pieces, until no pink remains, about 30 seconds. Drain and transfer to a large heatproof bowl.\nSerious Eats / Amanda Suarez\nFor the Chile Vinegar:\nIn a small saucepan, bring vinegar and salt to a boil over high heat. Remove from heat and add chiles. Let steep for at least 30 minutes (vinegar will be best after 1 day).\nSerious Eats / Amanda Suarez\nTo Assemble the Bowls:\nIn a medium saucepan, combine pork stock and pork meatballs and bring to a boil, covered, then lower heat and keep hot. Bring a large pot of water to a boil.\nSerious Eats / Amanda Suarez\nMeanwhile, add fish sauce, peanuts, sugar, lime juice, and chile flakes to the cooked minced pork and stir to combine.\nSerious Eats / Amanda Suarez\nAdd garlic oil to a large heatproof bowl. In the large pot of boiling water, cook rice noodles according to package directions. Drain noodles and transfer them to the bowl with the garlic oil, tossing with chopsticks until noodles are coated. Divide noodles among 4 individual serving bowls.\nSerious Eats / Amanda Suarez\nReturn now empty pot of water to a boil and blanch the bean sprouts and morning glory until morning glory is crisp-tender and bean sprouts have softened slightly, 5 to 10 seconds. Drain and divide among serving bowls with noodles.\nSerious Eats / Amanda Suarez\nAdd the minced pork mixture to the hot pork broth and meatballs and stir to combine. Divide the seasoned broth, meatballs, and minced pork among the serving bowls. Garnish each bowl with a couple pieces of fried wontons, soft-boiled egg halves, cilantro, scallions, and a pinch of fried garlic. Serve immediately, allowing guests to season their bowls with additional fish sauce, peanuts, sugar, lime juice, chile flakes, and chile vinegar to taste.\nSerious Eats / Amanda Suarez\nNotes\nHong Kong–style wonton wrappers are an egg based dough that are often light yellow in color. Wrap remaining unused wonton wrappers tightly and refreeze, or reserve for another use.\nA Holland chile and Fresno chile will have a similar mild heat level balanced with a sweet finish, while a fresh Cayenne chile will be spicier. A jalapeño chile may also be substituted in this recipe.\nFrozen pork balls from any Asian grocer will work in this recipe.\nMorning glory is also sold as ong choy or water spinach. In a pinch, you could substitute Chinese broccoli, spinach, even broccoli rabe, though rabe will be more bitter.\nMake-Ahead and Storage\nThe chile vinegar can be refrigerated in an airtight container for up to 2 months.\nThe crispy wontons can be fried up to 1 day in advance and stored in an airtight container at room temperature.\nThe minced pork can be cooked up to 2 days in advance and refrigerated in an airtight container.\nRead More\nGuaydtiaao Moo Nam Sai (Thai Clear Pork Noodle Soup With Pork Meatballs)\nThai Tofu and Pork Soup Recipe\nSoups\nThe Latest\nNoodles\nThai\nPork",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/guaydtiaao-tom-yam-moo-saap-tom-yam-noodle-soup-with-minced-pork.webp?"
}