{
  "url": "https://www.seriouseats.com/tom-yam-pla-thai-spicy-and-sour-soup-with-fish-recipe-6741505",
  "image_url": "https://www.seriouseats.com/thmb/YsfGyfLpZTUO5vKgyQ8U4Eu-GA4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220913-TomYamPla-vicky-wasik-04-79f1c21793084b31a3c451f4b7256c02.JPG",
  "tags": [
    "Thai",
    "Seafood Mains",
    "The Latest",
    "Snapper"
  ],
  "title": "Tom Yam Pla (Thai Spicy and Sour Soup with Fish)",
  "full_text": "Tom Yam Pla (Thai Spicy and Sour Soup with Fish)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nChilling Time\n20 mins\nTotal\n75 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Fish:\n2 1/2\npounds\n(\n1.1\nkg\n)\nhead-on whole red snapper\n, scaled, gutted, filleted, and fillets cut into 2-inch pieces (reserve head and bones for stock; see note)\n2\nteaspoons\nfish sauce\nFor the Fish Stock:\n1\ncup\ngrape tomatoes\n(\n5 1/2\nounces\n;\n160\ng\n)\n2\nstalks\nlemongrass\n, bottom 6 inches only, outer leaves discarded, tender core lightly smashed and cut into 2-inch lengths (about\n80\ng\n)\n1/2\nmedium\nwhite onion\n(\n4\nounces\n;\n115\ng\n), peeled and sliced in half\n1\n(4-inch) piece\nfresh\ngalangal\n(\n50\ng\n), peeled and roughly smashed in a mortar and pestle\n10\nfresh or frozen\nmakrut lime\nleaves\n(\n6\ng\n), roughly torn\n1\ntablespoon\n(\n15\nml\n)\nfish sauce\nFor the Soup:\n10 to 15\ndried Thai\nchiles\n(\n5\ng\n), stemmed\n1/2\ncup\ngrape tomatoes\n(\n2 3/4\nounces\n;\n80\ng\n)\n1\n(\n4-inch) piece\nfresh\ngalangal\n(\n50\ng\n), peeled and thinly sliced\n4\nstalks\nlemongrass\n, bottom 6 inches only, outer leaves discarded, tender core lightly smashed and cut on a bias into 2-inch lengths (about\n160\ng\n)\n4\nsmall\nshallots\n(\n50\ng\n), peeled and roughly smashed in a mortar and pestle\n10\nfresh or frozen\nmakrut lime\nleaves\n(\n6\ng\n), middle ribs removed (see note)\n5 to 7\nfresh green Thai\nchiles\n(\n6\ng\n), stemmed and roughly smashed in a mortar and pestle\n1/4\ncup\n(\n60\nml\n)\nfish sauce\n1/4\ncup\n(\n60\nml\n)\nfresh lime juice\nfrom\n2\nlimes\n5\nsprigs\n(\n12\ng\n)\nfresh culantro leaves\nand tender stems, cut into 1/2-inch pieces (see note)\nCooked jasmine rice\n, for serving\nDirections\nFor the Fish:\nPlace snapper in a medium bowl, add fish sauce, and toss to coat. Cover tightly with plastic wrap and refrigerate for at least 20 minutes or up to 4 hours.\nSerious Eats / Vicky Wasik\nFor the Fish Stock:\nMeanwhile, in a large pot, combine tomatoes, lemongrass, onion, galangal, lime leaves, fish sauce, and 2 quarts (1.9L) water and bring to a bowl over high heat. Add reserved head and bones, then lower heat to maintain a simmer. Cook, skimming any scum that accumulates on the surface, until liquid is reduced by half, about 30 minutes. Strain liquid through a fine-mesh strainer set over a 2-quart saucepan (you should have about 1 quart; 945ml) and set aside. Discard head, bones, and aromatics.\nSerious Eats / Vicky Wasik\nFor the Soup:\nHeat a 10-inch cast iron skillet or carbon steel pan over high heat until lightly smoking. Add dried chiles and cook until lightly charred on one side, making sure to move them around to avoid burning, 20 to 30 seconds. Transfer chiles to a small bowl. Add tomatoes to pan and cook over high heat until charred on all sides, making sure to move them around to avoid burning, about 3 minutes. Transfer to the bowl with chiles and set aside.\nSerious Eats / Vicky Wasik\nBring reserved fish stock in saucepan to a boil over high heat. Add galangal, lemongrass, and shallots, along with charred chiles and tomatoes, and allow aromatics to infuse stock, about 1 minute. Add snapper, making sure it is submerged in the stock, and cook until snapper is opaque and just cooked through, about 2 minutes. Add lime leaves, fresh chiles, and fish sauce, and remove from heat. Stir in lime juice (the color of the stock will turn opaque) and culantro.  Serve immediately with cooked jasmine rice.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nMortar and pestle, 2-quart saucepan, 10-inch cast iron skillet or carbon steel pan\nNotes\nWhile I call for\nfilleting the snapper\nyourself, you can ask your fishmonger to do it for you. Just make sure to ask for the head and bones so you can use them to make the fish stock.\nCulantro\n, also known as sawtooth coriander, is a common addition to\nlaab moo Isan\n, a minced pork salad. It adds a peppery and slightly bitter herbal note to the soup. Culantro can be found in Southeast Asian, Central American, and Caribbean markets. If you cannot find culantro, feel free to substitute with cilantro, or if you have it, Thai holy basil (not Thai sweet basil), which is a common and delicious pairing for this style soup.\nMake-Ahead and Storage\nThe fish stock can be prepared ahead of time and refrigerated in an airtight container for up to 1 day.\nTom yam pla can be refrigerated in an airtight container for up to 3 days. You can reheat it in the microwave or on the stovetop, adding freshly squeezed lime juice as needed to brighten the flavor.\nThai\nSeafood Mains\nThe Latest\nSnapper",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tom-yam-pla-thai-spicy-and-sour-soup-with-fish.webp?"
}