{
  "url": "https://www.seriouseats.com/tom-kha-gai-6741858",
  "image_url": "https://www.seriouseats.com/thmb/KDPHUB5VVZ6xwx_09Ff8ELoIwn4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220913-Tom-Kha-Gai-vicky-wsik-Step1-Hero01-f034bd4eb374444582768d9d5fadea8a.JPG",
  "tags": [
    "Thai",
    "Chicken",
    "Soups",
    "The Latest"
  ],
  "title": "Tom Kha Gai (Thai Chicken Soup with Coconut and Galangal)",
  "full_text": "Tom Kha Gai (Thai Chicken Soup with Coconut and Galangal)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Galangal Stock:\n1\ncup\n(\n240\nml\n)\nhomemade\nor store-bought\nchicken stock\n(see note)\n1\n(4-inch) piece\nfresh\ngalangal\n(\n50\ng\n), peeled\nFor the Soup:\n2 2/3\ncups\n(\n620\nml\n)\nhomemade\nor store-bought\nchicken stock\n(see note)\n1\n(4-inch) piece\nfresh\ngalangal\n(\n50\ng\n), peeled and thinly sliced\n3\nstalks\nlemongrass\n, bottom 7 inches only, outer leaves discarded, tender core cut on a bias into 2-inch lengths (about\n120\ng\n)\n2\nmedium\nshallots\n(\n40\ng\n), peeled and roughly smashed in a mortar and pestle\n1/4\ncup\n(\n60\nml\n)\nfish sauce\n, divided\n1020\ng\nboneless skinless chicken thighs\n10\nfresh or frozen makrut\nlime\nleaves\n(\n4\ng\n), middle ribs removed\n5 to 9\nfresh Thai red\nchiles\n(\n5 to 9\ng\ntotal), stemmed and lightly smashed\n1\ncup\n(\n240\nml\n) full-fat\ncoconut cream\n, such as Aroy-D (see note)\n1/4\ncup\n(\n60\nml\n) fresh\nlime juice\nfrom\n2\nlimes\nCilantro leaves\n, for garnishing\nDirections\nFor the Galangal Stock:\nIn a granite mortar and pestle, add galangal and pound until a coarse paste forms, about 30 seconds. Set aside.\nSerious Eats / Vicky Wasik\nIn a 2-quart saucepan, bring chicken stock to a simmer over medium heat, then remove from heat. Pour one-third of the warmed chicken stock over galangal in mortar, then with the pestle, press on galangal to extract its flavor into the stock, about 1 minute. Repeat process with remaining chicken stock, pressing on galangal each time to continue to express its flavor, then set aside to let the galangal infuse the stock.\nVicky Wasik\nFor the Soup:\nMeanwhile, in the now-empty saucepan, add chicken stock, galangal, lemongrass, shallots, and 1 tablespoon fish sauce, and bring to a boil over high heat. Add chicken, return to a boil, then lower heat to maintain a simmer. Cover and cook until chicken is tender and cooked through, about 20 minutes.\nSerious Eats / Vicky Wasik\nPour galangal stock through a fine-mesh strainer into saucepan, pressing on solids to extract as much liquid as possible before discarding the fiber. Stir in makrut lime leaves, fresh chiles, and coconut cream then remove from heat. Stir in lime juice and remaining fish sauce.\nSerious Eats / Vicky Wasik\nTo serve, divide between warmed soup bowls and garnish with cilantro.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nGranite mortar and pestle, 2-quart saucepan\nNotes\nI prefer using homemade chicken stock made with only chicken and no aromatics. To do so, you can follow\nthis recipe\n, making it with just chicken and water and no aromatics. If you’re using store-bought stock, look for one that is unsalted and includes minimal aromatics.\nCoconut cream has higher fat content than coconut milk. If using boxed or canned coconut cream, make sure to stir the cream well before using since it will likely have a separate fat layer on top. If you cannot find coconut cream, coconut milk will work, the soup will just be a little less rich.\nMake-Ahead and Storage\nThis dish is best served right away to preserve the freshness and sharpness of the ingredients. If you want to serve it the next day, you can reheat it in the microwave or on the stovetop, adding freshly squeezed lime juice as needed to brighten the flavor.\nThai\nChicken\nSoups\nThe Latest"
}