{
  "url": "https://www.seriouseats.com/tomato-chutney-recipe-8656022",
  "image_url": "https://www.seriouseats.com/thmb/C1P4XYQyBNsopcxtQaiYENa-ClI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240526-SEA-TomatoChutney-KanikaandJatinSharma-hero-a52d8f68831447c6a07699af8d2a2383.jpg",
  "tags": [
    "Hot Sauces",
    "The Latest",
    "Indian",
    "Tomato",
    "Tomato Sauces"
  ],
  "title": "Sweet and Spicy Tomato Chutney",
  "full_text": "Sweet and Spicy Tomato Chutney\nClose\nJump to recipe\nPrep\n5 mins\nCook\n50 mins\nCooling Time\n30 mins\nTotal\n85 mins\nServes\n6\nto 8\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ntablespoons\ngrapeseed or\nsunflower oil\n1 1/2\nteaspoons\nblack\nmustard seeds\n1\nteaspoon\nground turmeric\n1/8\nteaspoon\nasafoetida,\noptional (see notes)\n1/2 to 4\nfresh\nThai chiles,\nsliced and seeded, if desired, or\n1/2–2\nteaspoons\nred Indian chile powder (such as kashmiri red chile) (see notes)\n2\ngarlic\ncloves\n, minced\n1\nteaspoon\ngrated\nginger\n15\nwhole\ncurry leaves\n, rinsed and patted dry, divided (see notes)\n1\npound\nripe tomatoes\n, cored and cut into 1-inch pieces, juice from the cutting board reserved\n1\nteaspoon\nDiamond Crystal\nkosher salt\nor more to taste; if using table salt use half as much by volume\n1\nteaspoon\nground cumin (optional)\nDirections\nIn a medium saucepan, heat the oil over medium-high heat until shimmering, about 1 minute. Keep a lid/screen handy.\nSerious Eats / Kanika and Jatin Sharma\nReduce heat to low and test the oil with one mustard seed. If it pops right away, the oil is ready for the spices; if not, return heat to medium-high for 1 additional minute and retest. When ready, quickly add the remaining mustard seeds to the saucepan and cover quickly with the lid/screen. The mustard seeds will pop, making a sound like popping corn for about 30 seconds.\nSerious Eats / Kanika and Jatin Sharma\nOnce the popping reduces, uncover the pan and add turmeric, stir briefly, then add asafoetida.\nSerious Eats / Kanika and Jatin Sharma\nTurn the heat up to medium and stir in Thai chiles, garlic, and ginger. If using red chili powder, stir it in after the garlic and ginger. Cook until mixture is aromatic but garlic is not browning yet, 15 to 30 seconds. Add 7 curry leaves and stir to combine with the other ingredients.\nSerious Eats / Kanika and Jatin Sharma\nStir the tomatoes into the spiced oil and cook, stirring occasionally until the tomatoes begin to break down and start to release their juices, 8 to 10 minutes.\nSerious Eats / Kanika and Jatin Sharma\nPour the reserved tomato juices into the pan. Stir in the salt and ground cumin, if using. Cook chutney, stirring occasionally, until the liquid has evaporated and the tomato pieces have softened and reduced in size, 30 to 35 minutes. At this stage the chutney should be spreadable, like a compote. Season with salt to taste. Add the remaining 8 curry leaves and remove from heat. Stir to mix the curry leaves into the hot chutney to release their flavor. Cool the chutney to room temperature before serving.\nSpecial Equipment\nMedium saucepan with lid or splatter screen\nNotes\nThis recipe can be easily doubled.\nAsafoetida can be found at most Indian grocers. It’s also available to purchase online. I recommend the powder sold in small jars or plastic containers because they hold the aroma. You will smell an onion-garlic aroma from the asafoetida when you open the container. Keep it tightly shut between uses, otherwise the smell will pervade your entire kitchen. While it adds a distinct assertive garlic and onion-like flavor to the chutney, you can omit it if unavailable, but the chutney will be less aromatic.\nUse fresh curry leaves, not dried. The dried ones do not have the intense flavor of the fresh. They are usually available at Indian stores.\nArbol chiles can be substituted for Thai bird chiles.\nMake-Ahead and Storage\nThe chutney can be refrigerated in an airtight container for up to 1 week or frozen for up to 2 months. It can be enjoyed cold from the refrigerator or at room temperature.\nHot Sauces\nThe Latest\nIndian\nTomato\nTomato Sauces"
}