{
  "url": "https://www.seriouseats.com/tomato-jam-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rmscaOgfJle3gEhD8HPN8UAvgd8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__08__20120820-tomato-jam-primary-d0db45af1e9b43f4896e8efc37ed2d7b.jpg",
  "tags": [
    "Tomato",
    "Jams & Jellies"
  ],
  "title": "Tomato Jam",
  "full_text": "Tomato Jam\nClose\nJump to recipe\nPrep\n5 mins\nCook\n3 hrs 5 mins\nActive\n60 mins\nCooling Time\n6 hrs\nTotal\n9 hrs 10 mins\nServes\n24 servings\nMakes\n3 half-pints\nCook Mode\n(Keep screen awake)\nIngredients\n3\npounds\nbest quality\ntomatoes\n, cored and chopped\n2\ncups\ngranulated sugar\n1/4\ncup\nfreshly squeezed lemon juice\n1\ntablespoon\nfreshly grated\nginger\n2\nteaspoons\nred pepper flakes\n1\nteaspoon\nsalt\n1/2\nteaspoon\ncinnamon\n1/4\nteaspoon\ncumin\n2\ntablespoons\nliquid pectin\n(optional)\nDirections\nIf you are going to preserve jam, prepare jars and lids: place 3 half-pint jars on a rack in a large pot. Add enough water to cover jars, and bring to a boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.\nCombine tomatoes, sugar, lemon juice, ginger, red pepper flakes, salt, cinnamon, and cumin in a large, heavy-bottomed pot and bring to a boil over medium-high heat, stirring frequently. Reduce heat and simmer until mixture reaches a thick, jam-like consistency, about 2 1/2 hours. Stir in pectin (if using) and simmer for 1 minute more.\nLadle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 15 minutes. Turn off heat, uncover pot, and allow jars to rest in water for 5 minutes. Remove jars from pot and allow them to rest undisturbed on countertop for 6 hours or overnight.\nRead More\nA Beginner's Guide to Canning\nFrom Jam to Jerky: Water Activity and the Science of Preservation\nTangy and Sweet Tomato-Bacon Jam With Onion and Garlic\nTomato-Roasted Garlic Freezer Jam\nBLT Sandwiches with Candied Bacon, Lettuce, and Tomato Jam\nTomato\nJams & Jellies"
}