{
  "url": "https://www.seriouseats.com/tomato-coconut-soup-recipe-11698600",
  "image_url": "https://www.seriouseats.com/thmb/VQp28njqxIz5SbO9jTTh0UBVzEA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250127-SEA-TomatoCoconutSoup-KanikaandJatinSharma-Beauty1-3aef57ca9f65476babd1113bd6d8bdab.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "Indian",
    "Tomato"
  ],
  "title": "Tomato-Coconut Soup",
  "full_text": "Tomato-Coconut Soup\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nTotal\n15 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(28-ounce)\ncan\n(\n794\ng\n)\npeeled tomatoes\nin their juice, preferably Italian San Marzanos\n1 1/2\ncups\n(\n360\nml\n)\nwater\n, divided\n2\ntablespoons\n(\n30\nml\n) ghee or\navocado oil\n, plus melted ghee for serving\n2\nsmall\nshallots\n(about\n1\nounce\n;\n28\ng\n), minced\n2\nteaspoons\ngrated peeled\nfresh ginger\n1 1/4\nteaspoons\ncumin seeds\n3/4\nteaspoon\nred kashmiri chile powder\n2\nteaspoons\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n1\n(13.5-ounce)\ncan\nfull-fat coconut milk\n, divided\nGranulated sugar\n, to taste (optional)\n1/4\ncup\nfinely chopped fresh\ncilantro\n, for serving (optional)\n1\nrecipe\ncooked\nbasmati rice\nfor serving\n, optional\nDirections\nAdd tomatoes to a blender jar with their juices. Rinse out now-empty tomato can with 1 cup water, swish it around to collect more tomato flavor in the water, then add water to the blender. Blend tomatoes on high speed into a very smooth puree, about 1 minute.\nSerious Eats / Jatin Sharma\nSet a fine-mesh strainer over a bowl and pour tomato puree through strainer. Add remaining 1/2 cup (120 ml) water to now-empty blender and blend briefly to gather any remaining tomato liquid; pour that liquid through strainer. Using the back of a metal ladle, press tomato puree through strainer;scrape the puree  that collects on bottom of strainer into bowl. Set strained puree aside and discard any remaining pulp left in strainer.\nSerious Eats / Jatin Sharma\nIn a 6-quart saucepan or Dutch oven, heat ghee or oil over medium heat until just shimmering. Add shallot and cook, stirring frequently, until softened, 4 to 5 minutes.\nSerious Eats / Jatin Sharma\nAdd ginger and cumin and cook, stirring frequently, until aromatic, about 30 seconds.\nSerious Eats / Jatin Sharma\nStir in strained tomato puree, chile powder, and salt, then cook until it just comes to a boil, 5 to 7 minutes.\nSerious Eats / Jatin Sharma\nReduce heat to medium-low to maintain a gentle simmer, then vigorously shake can of coconut milk to combine fats and liquids before opening. While stirring constantly, slowly pour coconut milk into simmering soup. Raise heat to medium-high heat and return soup to a simmer. Once simmering, immediately remove from heat. Do not let soup boil, as this may cause fat in coconut milk to separate. Taste soup: Season to taste and, if too tart, add sugar to taste.\nSerious Eats / Jatin Sharma\nServe in a bowl as-is or pour over hot white Basmati rice. Drizzle with melted ghee and sprinkle with cilantro (if using) before serving.\nSerious Eats / Jatin Sharma\nSpecial Equipment\nBlender, fine-mesh strainer, 6-quart saucepan or Dutch oven\nMake Ahead and Storage\nThe soup can be refrigerated for up to 1 day. To serve, warm it over low heat on the stovetop. Do not bring to a boil, as this might cause the soup to separate.\nSoups\nThe Latest\nIndian\nTomato"
}