{
  "url": "https://www.seriouseats.com/tomato-ricotta-tart-recipe-8674075",
  "image_url": "https://www.seriouseats.com/thmb/rzLbSgNTFf2XQBWiUs3QJN4VXP0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/tomatohero-10-5a2f6e8bd5984d32b0850b083d09d535.jpg",
  "tags": [
    "Tomato",
    "The Latest",
    "Summer Snacks & Appetizers",
    "Ricotta"
  ],
  "title": "Easy Tomato Tart With Whipped Ricotta",
  "full_text": "Easy Tomato Tart With Whipped Ricotta\nClose\nJump to recipe\nPrep\n10 mins\nCook\n35 mins\nCooling and Salting Time\n105 mins\nTotal\n2 hrs 30 mins\nMakes\n1 11- by 15-inch tart\nCook Mode\n(Keep screen awake)\nIngredients\nAll-purpose flour\n, for dusting\n2\nsheets\nfrozen\npuff pastry\nfrom\n1\n(17.3-ounce)\nbox\n, thawed until pliable and cool\n1\npound\ntomatoes\n(\n454\ng\n; about\n3\nlarge\n), sliced 1/4 inch thick\n1 1/4\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\n1\ncup\nwhole milk ricotta\n(\n8\nounces\n;\n227\ng\n)\n1\ntablespoon\n(\n6\ng\n) finely chopped\nfresh parsley leaves\nFreshly\nground black pepper\nCoarse\nsea salt\nsuch as Maldon or fleur de sel\nFresh\nbasil leaves\n, torn\nBalsamic vinegar\n, to taste\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (205°C). Line a rimmed baking sheet with parchment paper. On a lightly floured surface, place one sheet of puff pastry directly on top of the other. Using a rolling pin, roll pastry into a 11- by 15-inch rectangle. Transfer pastry to prepared baking sheet and, using a fork, poke pastry all over. Cover the pastry with a sheet of parchment and place another rimmed baking sheet on top. Bake until pastry is light golden brown, about 25 minutes.\nDebbie Wee\nRemove from oven, and remove the top baking sheet and parchment. Increase oven temperature to 450°F (230°C).  Return pastry to oven and continue to bake until crisp and deeply browned, 5 to 10 minutes. Remove from oven and allow pastry to cool completely on baking sheet, about 1 hour 30 minutes.\nDebbie Wee\nMeanwhile, line a second rimmed baking sheet with a double layer of paper towels or a clean kitchen towel. Once pastry is nearly cool, arrange tomato slices in a single layer on prepared baking sheet and sprinkle with 3/4 teaspoon salt. Set aside for 15 minutes, then use additional paper towels or a second clean kitchen towel to blot excess liquid.\nDebbie Wee\nIn the bowl of a food processor, combine ricotta and remaining 1/2 teaspoon salt r and process until smooth and creamy, about 1 minute. Add parsley and pulse to combine. Using an offset spatula, spread ricotta mixture evenly over puff pastry, leaving a 1/2-inch border on all sides. Arrange tomato slices evenly over ricotta mixture. Season with pepper and sea salt, drizzle with balsamic vinegar, and sprinkle with basil. Cut into portions and serve.\nDebbie Wee\nSpecial Equipment\nRolling pin\n, rimmed baking sheets, parchment paper,\nfood processor\n, small offset spatula\nNotes\nUse the ripest tomatoes you can find. When tomatoes aren’t in season, use smaller plum, grape, or cherry tomatoes.\nMake-Ahead and Storage\nThe tart is best eaten the same day.\nThe whipped ricotta can be made ahead of time. Store in an airtight container and refrigerate for up to 1 week.\nTomato\nThe Latest\nSummer Snacks & Appetizers\nRicotta",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-tomato-tart-with-whipped-ricotta.webp?"
}