{
  "url": "https://www.seriouseats.com/tomato-tonnato-salad-recipe",
  "image_url": "https://www.seriouseats.com/thmb/8AE3FMikLOgIAI3RoOyLfjL0pX4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190809-tomato-tonnato-salad-vicky-wasik22-1c5fc90d14594703924c0920fa652493.jpg",
  "tags": [
    "Summer",
    "Gluten-free Salads",
    "No-Cook Salads",
    "Tuna",
    "Tomato"
  ],
  "title": "Summer Tomato Tonnato Salad",
  "full_text": "Summer Tomato Tonnato Salad\nClose\nJump to recipe\nPrep\n15 mins\nActive\n15 mins\nTotal\n15 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Tonnato:\n1\nlarge\negg\n1/4\ncup\n(\n60\nml\n)\nfresh lemon juice\n(from\n2\nwhole\nlemons), divided\n2\nanchovy\nfillets\n(about\n1/4\nounce\n;\n7\ng\n)\n1\nteaspoon\n(\n5\nml\n)\nDijon mustard\n1\nteaspoon\n(\n5\ng\n)\ncapers\n, drained\n1/2\ncup\n(\n120\nml\n)\nvegetable oil\n4\nounces\n(\n113\ng\n)\noil-packed tuna\n, such as Ortiz, drained\n1/2\ncup\n(\n120\nml\n)\nextra-virgin olive oil\nKosher salt\nand freshly ground black pepper\nFor the Salad:\n2\npounds\n(\n900\ng\n) mixed ripe\ntomatoes\n(see note)\n2\ntablespoons\n(\n30\ng\n) chopped\nCalabrian chiles\nToasted black sesame seeds and\ncoarse sea salt\n, for serving (optional)\n15 to 20\nfresh basil\nleaves\n, large leaves torn and small leaves left whole\nDirections\nFor the Tonnato:\nPlace egg, 2 tablespoons (30ml) lemon juice, anchovies, mustard, and capers in the bottom of an immersion blender cup or another tall-sided container that just fits the head of your immersion blender. Pour vegetable oil on top and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and turn it on high speed. Do not pulse or move the head. As mayonnaise forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified; this should take between 30 and 45 seconds.\nSerious Eats / Vicky Wasik\nTurn off blender and remove from blender cup. Scrape down sides of cup using a rubber spatula, then add tuna and remaining 2 tablespoons (30ml) lemon juice. Return blender head to blender cup and blend just until tuna is thoroughly incorporated into a smooth sauce, 15 to 30 seconds. Avoid over-blending, as this can cause the sauce to become grainy.\nSerious Eats / Vicky Wasik\nTransfer sauce to a medium mixing bowl and slowly drizzle in olive oil while whisking constantly to emulsify. Season to taste with salt and pepper. Refrigerate sauce until ready to serve (see note).\nSerious Eats / Vicky Wasik\nFor the Salad:\nUsing a sharp\nchef's knife\nor\nserrated knife\n, cut tomatoes into an assortment of slices, wedges, and bite-size pieces.\nUsing a large spoon, spread tonnato in an even layer on a large serving plate or individual serving plates. Arrange tomatoes on top of tonnato, then dollop with small spoonfuls of Calabrian chiles. Sprinkle sesame seeds and sea salt (if using) over tomatoes, followed by basil leaves. If not using sea salt, season tomatoes with kosher salt. Serve immediately.\nSpecial Equipment\nImmersion blender\n, sharp\nchef's knife\nor\nserrated knife\nNotes\nThis salad is meant to celebrate peak tomato season and won't be nearly as good if made with out-of-season tomatoes. The amount of tomato for the salad can easily be adjusted to accommodate the number of people you are serving.\nThis recipe makes about 1 1/2 cups of tonnato, which will leave you with extra sauce if you're serving four people.\nMake-Ahead and Storage\nThe salad is best enjoyed immediately. The tonnato can be made ahead and refrigerated in an airtight container for up to three days.\nRead More\nSummer Tomato Salad With Spicy Tonnato Recipe\nEnsalada de Tomate con Ventresca de Atún (Spanish-style Tomato and Ventresca Tuna Salad) Recipe\nTomato-Watermelon Salad Recipe\nHoriatiki (Greek Salad) Recipe\nPasta al Tonno (Pasta With Tomatoes and Tuna) Recipe\nSummer\nGluten-free Salads\nNo-Cook Salads\nTuna\nTomato",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/summer-tomato-tonnato-salad.webp?"
}