{
  "url": "https://www.seriouseats.com/tonkatsu-chicken-pork-katsu-japanese-breaded-cutlets-recipe",
  "image_url": "https://www.seriouseats.com/thmb/HDqcye0uVz0epNLTqD3g2hCJr60=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312PorkTonkatsu-FredHardy-08-26a58d83d15845d998763548d6b4f796.jpg",
  "tags": [
    "Japanese",
    "Fried Chicken",
    "Chicken Breast",
    "Chicken Mains",
    "Pork Mains"
  ],
  "title": "Tonkatsu (Japanese Breaded Pork Cutlets)",
  "full_text": "Tonkatsu (Japanese Breaded Pork Cutlets)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nboneless pork sirloin cutlets\n,\n4 to 5 ounces (110 to 140 g\n) each\nKosher salt\nand freshly ground black pepper\n8\n(1-inch-thick) slices\nday-old Japanese milk bread\n(see notes) or\n1 1/2\ncups\ndried Japanese-style\npanko breadcrumbs\n(about\n5\nounces\n;\n140\ng\n)\n1\ncup\nall-purpose flour\n(about\n5\nounces\n;\n140\ng\n)\n3\nlarge\neggs\n, thoroughly beaten\nVegetable, canola, or\npeanut oil\n, for frying\nTo Serve:\nFinely shredded green cabbage\nLemon wedges\nCooked short-grain white rice\nJapanese-style pickles\n(sunomono), optional\nHomemade\nor store-bought\ntonkatsu sauce\nDirections\nPlace cutlets, one at a time, in a heavy-duty zipper-lock bag and pound gently to 1/4-inch thickness using a meat pounder or the bottom of a heavy 8-inch skillet. Season generously with salt and pepper.\nSerious Eats / Amanda Suarez\nIf using slices of fresh Japanese milk bread:\nUsing a sharp or serrated knife, trim crust from milk bread; discard trimmings. Cut trimmed bread lengthwise into 1 1/2-inch-thick batons. Using a food processor fitted with the grater attachment, process bread into coarse flakes.\nSerious Eats / Two Bites\nFill 3 wide, shallow bowls or high-rimmed plates with flour, beaten eggs, and panko, respectively. Working with one cutlet at a time, dredge in flour with your first hand, shaking off excess. Transfer to egg dish, then turn cutlet with your second hand to coat both sides. Lift and allow excess egg to drain off, then transfer to breadcrumb mixture. With your first hand, scoop breadcrumbs on top of cutlet, then gently press, turning to ensure a good layer of crumbs on both sides. Transfer cutlet to a clean plate and repeat with remaining meat. If this is done properly, your first hand should touch only dry ingredients, while your second hand should touch only wet, making the process less messy.\nSerious Eats / Fred Hardy\nFill a large cast iron or stainless steel skillet with 1/3 inch oil. (To speed things up even more, use 2 skillets simultaneously.) Heat over high heat until shimmering and just shy of smoking, about 350°F (175°C) on an instant-read thermometer.\nSerious Eats / Fred Hardy\nUsing tongs or your fingers, gently lower cutlets into hot fat, laying them down away from you to prevent hot fat from splashing toward you. (Work in batches if necessary.) Fry, gently swirling pan and rotating cutlets for even browning, and adjusting heat as necessary for a steady, vigorous bubble (around 300 to 325°F; 150 to 160°C), until bottom side is set, about 1 1/2 minutes. Flip cutlets and fry until other side is set, about 1 1/2 minutes longer. Continue cooking, swirling frequently and flipping occasionally, until well browned on both sides, about 3 minutes longer. Transfer to paper towels to drain and season with salt right away. Repeat with remaining cutlets.\nSerious Eats / Fred Hardy\nSlice tonkatsu into thin strips and serve immediately with shredded cabbage, lemon wedges, white rice, Japanese pickles (if desired), and tonkatsu sauce.\nSerious Eats / Fred Hardy\nNotes\nIf you can’t find Japanese milk bread, you can substitute it with thick slices of white bread or pain de mie.\nSpecial Equipment\nMeat pounder\n, Large\ncast iron\nor\nstainless steel\nskillet,\ninstant-read thermometer\nJapanese\nFried Chicken\nChicken Breast\nChicken Mains\nPork Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tonkatsu-japanese-breaded-pork-cutlets.webp?"
}