{
  "url": "https://www.seriouseats.com/topik-armenian-chickpea-and-potato-dumplings-recipe-8686873",
  "image_url": "https://www.seriouseats.com/thmb/qMc9aHopsDFiyxe-BsSQbAbj9qs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240731-SEA-Topik-VyTran-hero-95384739ec2942168e470dca00dc02a7.jpg",
  "tags": [
    "Chickpeas",
    "The Latest",
    "Vegetarian",
    "Russet Potatoes",
    "Armenian"
  ],
  "title": "Topik (Armenian Chickpea and Potato Dumplings)",
  "full_text": "Topik (Armenian Chickpea and Potato Dumplings)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n45 mins\nChilling Time\n2 hrs\nTotal\n3 hrs 15 mins\nServes\n4 dumplings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n1 small\nyellow onion\n(about 5 ounces;\n140\ng\n), thinly sliced\n1/2 cup (\n120\nml\n)\nwater\n1 tablespoon (\n17\ng\n)\ndried currants\n2 teaspoons (\n10\nml\n)\nextra-virgin olive oil\n1 medium clove (\n5\ng\n)\ngarlic\n, minced\n3/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\nground allspice\n3/4\nteaspoon\nground cinnamon\n1/4\nteaspoon\nground black pepper\n1/8\nteaspoon\nAleppo pepper\n(or a pinch of cayenne)\n3 tablespoons\ntahini\n(2 ounces;\n60\ng\n)\n1/4 cup\nwalnuts\n(about 1 ounce;\n28\ng\n), lightly toasted and chopped, divided\nFor the Dough:\n227\ng\n(8 ounces)\nrusset potatoes\n(about 1 medium potato), peeled and cut into 1-inch chunks\n1 3/4\nteaspoons\nDiamond Crystal\nkosher salt\n, divided; for table salt, use half as much by volume\n2 cups (\n370\ng\n) cooked, drained\nchickpeas\n(from dried chickpeas or two 14-ounce cans, see notes)\n1/4\nteaspoon\nbaking soda\n1/4\ncup\ntahini\n(2 1/4 ounces; 64g)\nTo Assemble:\nTopik\ndough\n, from above\nCheesecloth\nKitchen twine\n2 tablespoons (\n30\nml\n)\nextra-virgin olive oil\n1/2\nteaspoon\nground cinnamon\nDirections\nFor the Filling:\nIn a medium saucepan, combine onion, water, dried currants, olive oil, garlic, and salt. Bring to a simmer over medium-high heat. Cover, reduce heat to medium, and cook, stirring occasionally, until onions are translucent and soft, about 10 minutes. Remove lid, increase heat to medium-high, and cook, stirring frequently, until water has evaporated and mixture begins to sizzle, 2 to 4 minutes. Add allspice, cinnamon, black pepper, and Aleppo pepper, and cook, stirring constantly, until mixture is fragrant, about 30 seconds. Transfer the mixture to a medium bowl, add tahini and 2 tablespoons walnuts, and stir until uniform. Set aside to cool, about 10 minutes. Rinse saucepan.\nSerious Eats / Vy Tran\nFor the Dough:\nIn the now-empty saucepan, combine potatoes, 1 teaspoon salt, and 3 cups water and bring to boil over high heat. Reduce heat to medium-low, partially cover, and cook until potatoes are tender when pricked with a paring knife, 10 to 12 minutes. Using a colander, drain potatoes. Transfer potatoes to a bowl and set aside. Rinse saucepan.\nSerious Eats / Vy Tran\nIn the same saucepan, combine chickpeas, baking soda, and 2 cups water and bring to a boil over high heat. Reduce heat to medium-low and simmer, stirring occasionally, until chickpea skins start to slough off and liquid turns cloudy, about 10 minutes. Using a colander, drain chickpeas. Return drained chickpeas to saucepan. Cover with cold water by at least 2 inches, then gently swish chickpeas between your fingers until skins begin to float. Strain liquid and skins into colander, leaving chickpeas in saucepan. Repeat soaking, swishing, and draining four to five more times, until the water runs clear and most of the skins have been removed. Discard skins, then transfer chickpeas to colander and allow to drain completely. (See notes.) Rinse saucepan and set aside.\nSerious Eats / Vy Tran\nIn the bowl of a food processor, blitz chickpeas until a smooth paste forms, scraping down sides of bowl as needed, about 2 minutes. Transfer to a large bowl. Alternatively, if using a ricer for the potatoes, skip this step and rice the chickpeas with the potatoes in step 5.\nSerious Eats / Vy Tran\nIn a medium bowl, use a potato masher to mash potatoes until completely smooth. (Alternatively, set ricer over a medium bowl and pass potatoes through with chickpeas.) Add mashed potatoes to the bowl with chickpeas, along with tahini and remaining 3/4 teaspoon salt. Using a flexible spatula, stir until dough is uniform.\nSerious Eats / Vy Tran\nTo Assemble:\nCut cheesecloth into four 8-inch squares and cut twine into four 8-inch long pieces; set aside. Using wet hands, shape dough into a 6-inch by 1-inch disc on a cutting board and, using a knife, divide into quarters, about 125g or 4 1/2 ounces each. Shape each piece into a ball.\nSerious Eats / Vy Tran\nWorking with one ball of dough at a time, make a 2-inch wide indentation with your thumb, gently pressing dough to an even thickness throughout. Lightly pack about 3 tablespoons of the prepared onion filling into the indentation, then pinch the dough to completely cover the filling. Roll the dough into a smooth ball, set it seam side down on the cutting board, then gently press the ball into a 3-inch wide, 1-inch tall patty. Transfer the dough ball to center of 1 piece of cheesecloth, gather overhanging corners of cloth to form a bundle, then tie the bundle together with twine to secure. Repeat with remaining dough balls and filling.\nSerious Eats / Vy Tran\nIn a medium saucepan, bring 6 cups water to boil. Gently add the assembled topik, reduce heat to maintain a gentle simmer, and cook until slightly plumped, 8 to 10 minutes. Transfer to a wire rack set in a rimmed baking sheet and allow topik to cool to room temperature, about 30 minutes.\nSerious Eats / Vy Tran\nTransfer to an airtight container and refrigerate until chilled and slightly firmed, at least 2 hours or up to 3 days.\nSerious Eats / Vy Tran\nTo serve, allow topik to come to room temperature, about 30 minutes. Remove topik from cheesecloth and transfer to a platter, tied side down. Drizzle with olive oil, sprinkle with cinnamon, followed by reserved walnuts, and serve.\nSerious Eats / Vy Tran\nSpecial Equipment\nColander, food processor, wire rack, rimmed baking sheet, food ricer or potato masher, cheesecloth, twine.\nNotes\nThe recipe can easily be doubled if desired.\nWhen separating the skins from the chickpeas, it is not necessary to remove every last one; just repeat swishing and straining until the water is mostly clear, 3 or 4 changes.\nIf using dried chickpeas:\nIn a medium bowl, combine 150g (about 5 1/4 ounces) chickpeas and 2 tablespoons (18g) Diamond Crystal kosher salt. Cover with 4 cups (960ml) cold water and stir to dissolve salt. Let stand at room temperature overnight. Drain and rinse chickpeas, then transfer to a large saucepan, along with 4 cups (960ml) water and 2 teaspoons Diamond Crystal kosher salt. Bring to a boil over high heat, then reduce to a simmer. Cover loosely with a lid and cook until tender, about 1 hour. Add baking soda and continue to cook until skins loosen, about 10 minutes.\nUsing a colander, drain chickpeas. Return drained chickpeas to saucepan. Cover with cold water by at least 2 inches, then gently swish chickpeas between your fingers until skins begin to float. Decant liquid and skins into colander, leaving chickpeas in saucepan. Repeat soaking, swishing, and draining three more times, until the water runs clear and most of the skins have been removed. Discard skins, then transfer chickpeas to colander and allow to drain completely.\nIf you have a ricer, you can skip processing the chickpeas in a food processor and pass them through the ricer with the potatoes instead.\nWhen shaping the topik, do your best to seal the filling inside the dough completely, but don’t worry too much about surface cracks, they will disappear once the topik are poached.\nMake-Ahead and Storage\nThe filling and dough can be stored in airtight containers and refrigerated for 24 hours before using.\nChickpeas\nThe Latest\nVegetarian\nRusset Potatoes\nArmenian",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/topik-armenian-chickpea-and-potato-dumplings.webp?"
}