{
  "url": "https://www.seriouseats.com/torrijas-caramelizadas-spanish-french-toast",
  "image_url": "https://www.seriouseats.com/thmb/5BFzPIRWB8NnHj82jCA3cfxbigI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__12__20201222-torrijas-sasha-marx-24-c640c3d78e0f4675a4c4787bed404a3b.jpg",
  "tags": [
    "French Toast",
    "Spanish",
    "Breakfast & Brunch",
    "Easter",
    "Mother's Day"
  ],
  "title": "Torrijas Caramelizadas (Spanish-Style Caramelized French Toast) Recipe",
  "full_text": "Torrijas Caramelizadas (Spanish-Style Caramelized French Toast) Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n65 mins\nActive\n30 mins\nCooling and Steeping Time\n35 mins\nTotal\n2 hrs\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n11\nounces\n(\n320\ng\n) pullman or\nbrioche bread\n(about one-third to one-half of a loaf)\n1 1/2\ncups\n(\n375\nml\n)\nwhole milk\n1\ncinnamon\nstick\nor pinch ground cinnamon\n1/2\nvanilla\nbean\n(\n2\ng\n), split and scraped or\n1/4\nteaspoon\nvanilla extract\n2\n(3- by 1-inch) strips\norange zest\nfrom\n1\nlarge\norange\n1/8\nteaspoon\nkosher salt\n7\ntablespoons\n(\n88\ng\n) plain or\ntoasted\nsugar\n, divided\n5\nlarge\negg yolks\n(\n75\ng\n)\n2\ntablespoons\n(\n28\ng\n)\nunsalted butter\nDirections\nIf using fresh bread, adjust oven rack to middle position and preheat oven to 225°F (110°C). Set a wire rack in a rimmed baking sheet. Using a bread knife, remove crusts from bread, then cut into four rectangular pieces that are 2 inches thick and about 1 1/2 inches wide and 4 inches long (the width and length of the pieces can be determined by the size of your loaf of bread; it's the thickness of the pieces that is most important). Arrange bread pieces on prepared baking sheet, leaving at least 1 inch of space between each piece, and bake, flipping pieces over halfway through, until lightly toasted and dry on their surface, 30 to 45 minutes. Transfer baking sheet to a heatproof surface to cool slightly, and increase oven temperature to 375°F (190°C). If using stale bread, you can skip the toasting step; cut the bread into pieces as described and preheat oven to 375°F.\nMeanwhile, in a 2-quart saucier or saucepan, combine milk, cinnamon, vanilla, orange zest, and salt. Set over medium-low heat and cook, stirring frequently with a rubber spatula, until milk registers 190°F (88°C) on an instant-read thermometer, 3 to 5 minutes. Remove from heat, cover, and set aside to steep for 30 minutes.\nWhile the milk steeps, whisk together 1/4 cup (50g) sugar and egg yolks in a medium bowl until sugar is dissolved and mixture turns pale yellow, 2 to 3 minutes. Set a fine-mesh strainer over bowl with egg mixture, and slowly pour one-third of milk mixture into yolk mixture to temper, whisking constantly to prevent yolks from curdling. Add remaining milk mixture, whisking constantly until well-combined; set aside but don't clean strainer; wipe out saucepan.\nAdd bread to custard base and soak, turning pieces occasionally to ensure they are coated on all sides, until fully saturated and soft (they should barely hold together, so handle with care), 5 to 6 minutes. Using a small spatula, carefully transfer bread pieces to a plate, allowing excess liquid to drip back into the bowl of custard base; set bread pieces aside.\nStrain custard base through fine-mesh strainer into now-empty saucier; you should have between 3/4 to 1 cup (175 to 240ml) of liquid. Return to stovetop; once again set aside but don't clean strainer, and wipe out bowl. Cook over medium-low heat, stirring constantly with a rubber spatula or wooden spoon to prevent egg yolks from curdling, until mixture registers 175°F (79.5°C) on an instant-read thermometer and thickens slightly so that it coats the back of a spoon, 3 to 5 minutes. Working quickly, remove from heat and pour crème anglaise through fine-mesh strainer back into now-empty bowl. Place piece of plastic wrap directly on surface of crème anglaise to prevent skin from forming, and refrigerate until ready to use.\nIn a medium cast iron skillet, melt butter over medium-high heat until just foaming. Sprinkle 2 tablespoons (25g) sugar in an even layer over butter, then add bread pieces to skillet. Cook, carefully turning pieces occasionally, until lightly browned on all sides, 4 to 5 minutes. Transfer skillet to oven, and bake until bread pieces are heated through at the center, about 5 minutes.\nRemove skillet from oven, and carefully flip bread pieces over so that bottom sides that were in contact with the pan are facing up. Sprinkle remaining 1 tablespoon (13g) sugar evenly over bread pieces. If using a blowtorch, ignite torch and caramelize sugar by sweeping flame 2 inches above bread pieces, until sugar is bubbling and deep golden brown. If not using a blowtorch, simply serve with the sprinkled sugar on top.\nDivide crème anglaise between individual serving plates, followed by bread pieces. Serve immediately.\nSpecial equipment\nRimmed baking sheet\n, wire rack, 2-quart saucier,\ninstant-read thermometer\n,\nfine-mesh strainer\n, kitchen blowtorch\nMake-Ahead and Storage\nThis dish is best enjoyed immediately. Crème anglaise can be refrigerated in an airtight container for up to 3 days.\nFrench Toast\nSpanish\nBreakfast & Brunch\nEaster\nMother's Day"
}