{
  "url": "https://www.seriouseats.com/tortang-talong-eggplant-omelette-5189762",
  "image_url": "https://www.seriouseats.com/thmb/tDrSfqVUMb2Q1hX6oNb9-OS8ktA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210617-tortang-talong-vicky-wasik-seriouseats-seriouseats-27-1a0dcec900f94826a2f3b6b7d12fb25e.jpg",
  "tags": [
    "Filipino",
    "Breakfast & Brunch",
    "Vegetable Sides",
    "Eggplant",
    "Mains"
  ],
  "title": "Tortang Talong (Filipino Eggplant Omelette)",
  "full_text": "Tortang Talong (Filipino Eggplant Omelette)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n65 mins\nCooling Time\n20 mins\nTotal\n100 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nmedium\nJapanese eggplants\n(about\n1 1/2\npounds\n;\n680\ng\ntotal), see notes\n2\ntablespoons\n(\n30\nml\n) plus\n3/4\ncup\n(\n175\nml\n)\nvegetable oil\n, divided, plus extra as needed\n1\nsmall\nyellow onion\n(\n4\nounces\n;\n113\ng\n), finely chopped\n1\nmedium\ngarlic clove\n(\n5\ng\n), minced\nKosher salt\nand freshly\nground black pepper\n8\nounces\n(\n227\ng\n)\nground pork\n1\ntablespoon\n(\n15\nml\n)\noyster sauce\n1 1/2\nteaspoons\n(\n8\nml\n)\nfish sauce\n1 1/2\nteaspoons\n(\n8\nml\n)\nsoy sauce\n5\nlarge\neggs\n, divided\nCooked white rice\n, for serving\nKetchup\nor\nbanana ketchup\n, for serving\nDirections\nAdjust oven rack to middle position and preheat oven to 350°F (180°C). With the tip of a sharp knife, poke four 1/2-inch slits in each eggplant. Place eggplant on a rimmed baking sheet lined with parchment paper or aluminum foil and roast until fully tender, offering little to no resistance when pierced with a knife, about 30 minutes. Set aside until cool enough to handle, about 15 minutes.\nVicky Wasik\nPeel eggplant as best as you can, leaving stems attached; discard skin. With the back of a fork, press down firmly to flatten each eggplant along its length until it resembles a large teardrop in shape; set aside.\nVicky Wasik\nIn a 12-inch stainless steel, cast iron, or nonstick skillet, heat 2 tablespoons (30ml) vegetable oil over medium-high heat. Add onion and garlic, season lightly with salt, and cook, stirring frequently, until soft and translucent, about 5 minutes. Add ground pork and cook, stirring occasionally and breaking up any large pieces, until cooked through and lightly browned, about 4 minutes. Add oyster sauce, fish sauce, and soy sauce and continue to cook, stirring frequently, until liquid is absorbed, about 1 minute. Remove skillet from heat, and set aside to let cool slightly.\nVicky Wasik\nIn a medium bowl, beat 3 eggs until homogenous and frothy. Add ground pork mixture and stir to combine; set aside. In a wide, shallow dish, beat remaining 2 eggs until homogenous and frothy, season with salt and pepper, and set aside. Clean skillet and return to stovetop.\nVicky Wasik\nAdjust oven temperature to 200°F (95°C). Set a wire rack in a rimmed baking sheet and line with a double layer of paper towels. In the cleaned skillet, heat 3/4 cup (175ml) vegetable oil over medium-high heat until shimmering. Working with one eggplant at a time, hold eggplant by stem, and evenly coat on all sides with beaten egg mixture. Allow excess egg to drip off, and carefully add to skillet. Repeat coating process with second eggplant and add to skillet. Top each eggplant with a heaping 1/4 cup (60g) of ground pork mixture, evenly pressing mixture down along the length of each eggplant to ensure it adheres to the surface. Cook, shaking pan occasionally, until bottom side is golden brown and crisp, about 3 minutes. Using a slotted spatula, carefully flip eggplant and continue to cook until golden brown on second side, about 1 minute 30 seconds.\nVicky Wasik\nTransfer eggplant to prepared baking sheet, then transfer to oven to keep warm. Repeat coating and cooking process with remaining eggplant, adding more oil to skillet as needed.\nVicky Wasik\nTransfer to individual plates and serve immediately with white rice and ketchup.\nVicky Wasik\nSpecial Equipment\n12-inch stainless steel skillet\n,\ncast iron skillet\n, or\nnonstick skillet\nNotes\nIf you can't find Japanese eggplant, you can substitute Chinese eggplant. The cooking time may take up to 10 to 15 minutes longer, just be sure to roast the eggplant until it's fully tender.\nTo enjoy a vegetarian version, you can omit the ground pork mixture, and skip step 3. In Step 4, whisk two eggs with salt and pepper in a wide, shallow dish, then proceed as directed in Step 5.\nMake-Ahead and Storage\nTortang talong are best enjoyed immediately.\nFilipino\nBreakfast & Brunch\nVegetable Sides\nEggplant\nMains"
}