{
  "url": "https://www.seriouseats.com/tourshi-armenian-pickled-vegetables-recipe-7152277",
  "image_url": "https://www.seriouseats.com/thmb/uQeEIawswJk3hopfN3pWBYGlZac=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230314-SEA-Tourshi-VickyWasik-hero-b897b4ac0afb459fa5e95b67549d1997.JPG",
  "tags": [
    "Vegetables",
    "The Latest",
    "Pickling"
  ],
  "title": "Tourshi (Armenian Pickled Vegetables)",
  "full_text": "Tourshi (Armenian Pickled Vegetables)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n5 mins\nFermentation and Chilling Time\n144 hrs\nTotal\n144 hrs 20 mins\nServes\n16\nto 20 servings\nMakes\n4 1-quart jars\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n12\ng\n) yellow or\nbrown mustard seeds\n, or a combination\n1\ntablespoon\n(\n6\ng\n)\ncoriander seeds\n1 1/2\nteaspoons\n(\n5\ng\n)\nwhole black peppercorns\n1\nteaspoon\n(\n3\ng\n)\nallspice berries\n1/2\nteaspoon\nAleppo pepper\n(see note)\n2\nbay leaves\n, lightly crushed\n8\nounces\n(\n227\ng\n) each of\ncarrots\n, cauliflower, celery, green cabbage, green tomatoes, and turnips, or any combination of these totaling at least\n3 1/2\npounds\n(\n1.6\nkg\n)\n4\nounces\n(\n113\ng\n) sweet, long, tender-skinned\npeppers\n, such as\nAnaheim\n, cubanelle, banana, stemmed, seeded, and cut into 1/2-inch-wide strips, or pepperoncini, stemmed\n4 to 8\nfresh\nhot peppers\n, such as cayenne, serrano, red jalapeño, or cherry peppers, stemmed and cut into 1-inch pieces (optional, to taste; see note)\n8\nmedium\ngarlic cloves\n, peeled, divided\n8\nsprigs\nflat leaf parsley\n, divided\n4\nwhole\ncloves\n8 1/3\ncups\n(\n2\nL\n)\nwater\n3 1/3\ncups\n(\n800\nml\n)\ncider vinegar\n1/2\ncup\n(\n66\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\nDirections\nIn a small bowl, combine mustard, coriander, peppercorns, allspice, Aleppo pepper, and bay leaves. Stir until evenly combined, then set spice mixture aside.\nSerious Eats / Vicky Wasik\nOn a clean work surface, cut vegetables into uniform pieces. For carrots, peel and cut into 1/2-inch sticks about 2 or 3 inches long. For cabbage, cut into quarters, remove core and tender outer leaves, and cut into 3/4- to 1-inch wide wedges lengthwise. For cauliflower, remove stem and cut into large florets. For celery, trim ends and cut into 1/2-inch sticks about 3 or 4 inches long. For green tomatoes, cut into 1-inch cubes. For turnips, peel and cut into 1/2-inch sticks about 2 to 3 inches long.\nSerious Eats / Vicky Wasik\nIn the bottom of each clean, wide-mouth 1-quart canning jar, place 2 garlic cloves, 2 sprigs parsley, 1 clove, and 2 teaspoons of the spice mixture, then divide the remaining spice mixture evenly among the jars. Add vegetables, sweet peppers, and hot peppers, a few pieces at a time, to the jars, rotating between them, until each jar is filled to within 1/2 inch of rim, packing them as tightly as possible without crushing the contents. (You will have leftover vegetables; save remainder for another use.)\nSerious Eats / Vicky Wasik\nIn a nonreactive stainless-steel pot or enameled Dutch oven, combine cider vinegar, water, and salt and bring to boil over high heat. Pour brine into jars until vegetables are covered; discard any remaining brine). Using a spoon, push contents of jars down into brine to ensure everything is submerged, then seal tightly, and invert jars. Let sit at room temperature for 5 days, turning jars over once a day. Refrigerate jars for at least 1 day before serving.\nSerious Eats / Vicky Wasik\nServe as a snack, as part of a mezze spread, or as a side alongside a main course of your choosing.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n4 wide-mouth 1-quart canning jars with lids and bands\nNotes\nAleppo chile peppers\n, which have been cultivated in Syria for centuries, are quite mild in terms of heat, with a hint of raisin-y, sun-dried tomato sweetness. Due to the ongoing civil war, true Aleppo pepper from Syria is no longer available for import, but chiles grown in neighboring Turkey are. You can find Aleppo pepper at Middle Eastern markets, or online. Korean gochugaru or 1/4 teaspoon red pepper flakes can be substituted for the Aleppo pepper in this recipe.\nTake care when adding hot peppers to tourshi, especially if they are on the spicy side; it’s better to err on the side of caution and add more next time around if you want more heat.\nYou can also make this recipe in 2 half-gallon jars, if desired.\nMake-Ahead and Storage\nTourshi can be refrigerated for at least 6 months and up to 1 year, though they will be at their best in the first 6 months: the vegetables will slowly soften over time but will remain edible throughout.\nVegetables\nThe Latest\nPickling"
}