{
  "url": "https://www.seriouseats.com/traditional-irish-bacon-cabbage-parsley-sauce-recipe",
  "image_url": "https://www.seriouseats.com/thmb/3ZCOlxPoRx9PRQ63I2PodQ5txs4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100317irishbaconandcabbage-a82c53b65bd7479fa5fda5df4fbb859e.jpg",
  "tags": [
    "Bacon",
    "Irish",
    "Cabbage",
    "Parsley",
    "St. Patrick's Day"
  ],
  "title": "Traditional Irish Bacon, Cabbage, and Parsley Sauce Recipe",
  "full_text": "Traditional Irish Bacon, Cabbage, and Parsley Sauce Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n4 hrs\nTotal\n4 hrs 5 mins\nServes\n12\nto 15 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Bacon and Cabbage:\nAbout\n5\npounds\nloin, collar thick-cut bacon\n1\nSavoy cabbage\n4\ntablespoons\nbutter\nFreshly ground black pepper\nFor the Roux:\n8\ntablespoons\nbutter\nScant\ncup\nall-purpose flour\nFor the Parsley Sauce\n2\ncups\nwhole milk\nA few\nparsley stems\n1\nsprig\nof\nthyme\nA few\nslices\nof\ncarrot\n(optional)\nA few\nslices\nof\nonion\n(optional)\nSalt\nand freshly ground black pepper\nAbout\n4\ntablespoons\nfreshly\nchopped curly parsley\nDirections\nCover bacon in cold water in a large pot and bring slowly to a boil.\nIf bacon is very salty there will be a white froth on top of the water, in which case it is preferable to discard the water and start again.\nIt may be necessary to change the water several times, depending on how salty the bacon is. Finally, cover bacon with hot water, place a lid on the pot, and simmer until bacon is almost cooked, allowing 20 minutes for every 1 pound.\nMeanwhile, trim the outer leaves of the cabbage and cut it into quarters, removing core. Discard core and outer leaves. Slice cabbage across the grain into thin shreds. If necessary, wash it quickly in cold water. About 20 minutes before the end of cooking the bacon, add shredded cabbage to the pot of simmering bacon.\nStir, cover, and continue to boil gently until both cabbage and bacon are cooked, about 1 3⁄4 hours.\nTo make roux, melt butter in a pan and cook flour for 2 minutes on low heat, stirring occasionally. It will keep for two weeks in the refrigerator.\nTo make the sauce, add cold milk to a saucepan and add herbs and vegetables (if using). Bring mixture to simmering point, season with salt and pepper, and simmer for 4-5 minutes. Strain milk, bring it back to a boil, and whisk in 4 tablespoons roux until sauce is a light coating consistency. Season again with salt and pepper. Add chopped parsley and simmer over very low heat for 4 to 5 minutes. Taste and adjust seasoning if necessary.\nBacon\nIrish\nCabbage\nParsley\nSt. Patrick's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/traditional-irish-bacon-cabbage-and-parsley-sauce-recipe.webp?"
}