{
  "url": "https://www.seriouseats.com/traditional-toum",
  "image_url": null,
  "tags": [
    "Condiments & Sauces",
    "Middle Eastern",
    "Dairy-free Snacks & Appetizers",
    "Gluten-free Snacks & Appetizers",
    "Garlic"
  ],
  "title": "Traditional Toum (Lebanese Garlic Sauce)",
  "full_text": "Traditional Toum (Lebanese Garlic Sauce)\nJump to recipe\nPrep\n20 mins\nActive\n20 mins\nTotal\n20 mins\nServes\n32 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\ngarlic cloves\n(\n4 1/2\nounces\n;\n130\ng\n2\nteaspoons\nDiamond Crystal kosher salt\n(for\ntable salt\n, use\n1\nteaspoon\n)\n1/4\ncup\n(\n60\ng\n)\nfresh lemon juice\nfrom about\n2\nlemons\n, divided\n1/4\ncup\n(\n60\ng\n)\nice water\n, divided\n3\ncups\n(\n600\ng\n) neutral oil, such as grapeseed or\ncanola oil\n, divided\nDirections\nUsing a paring knife, split each garlic clove in half lengthwise. With the tip of the knife, remove the germ from each garlic clove half.\nSerious Eats / Vicky Wasik\nFood Processor Method:\nPlace the de-germed garlic and kosher salt in the bowl of a food processor. Pulse garlic in short bursts until finely minced, occasionally removing the lid to scrape down the sides of the bowl with a flexible rubber spatula. Add 1 tablespoon lemon juice and continue processing until a paste begins to form. Add another tablespoon lemon juice and process until completely smooth and slightly fluffy.\nSerious Eats / Vicky Wasik\nWith the food processor running, slowly drizzle in 1/2 cup oil in a very thin stream, followed by 1 tablespoon lemon juice. Repeat with another 1/2 cup oil and remaining 1 tablespoon lemon juice. Continue the process, alternating 1/2 cup oil and 1 tablespoon water, until all the oil and water have been incorporated. Transfer toum to a container and store in the fridge for up to 1 month.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nMortar and Pestle Method:\nDepending on the size of your mortar, you may need to make the recipe in smaller batches, halving or quartering the ingredient amounts. In the mortar, combine garlic and salt and grind until it becomes a smooth paste. Work oil into paste 1 teaspoon at a time. After adding 1 tablespoon oil, work in a few drops of lemon juice. Repeat until all the oil, lemon juice, and water have been incorporated.\nSpecial Equipment\nFood processor\nor\nmortar and pestle\n,\nparing knife\nNotes\nFor the ideal light and fluffy texture, stick with either the food processor or mortar-and-pestle method described here. Trying to make the toum in a blender or with an immersion blender will result in a thin and dense texture closer to that of a mayonnaise or dressing than traditional toum.\nIf the emulsion breaks, it can easily be brought back together with the help of an egg white. Combine 1 egg white with 1/4 cup of the broken emulsion in the bowl of a food processor until fluffy. With the food processor running, slowly pour in the remaining broken emulsion.\nMake-Ahead and Storage\nToum may be refrigerated in an airtight container for up to 1 month.\nRead More\nModern Spanish-style Allioli (Olive Oil and Garlic Mayonnaise)\nTwo-Minute Aioli\nTahini Sauce With Garlic and Lemon\nAll About Labaneh\nCondiments & Sauces\nMiddle Eastern\nDairy-free Snacks & Appetizers\nGluten-free Snacks & Appetizers\nGarlic"
}