{
  "url": "https://www.seriouseats.com/traditional-french-cassoulet-recipe",
  "image_url": "https://www.seriouseats.com/thmb/zCvw3_JKa3h8JbSMRde7LRzyUp0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-001-498130da7d5f4023b0bc50f631c891e0.jpg",
  "tags": [
    "French",
    "Braising & Stewing",
    "Braised & Stewed Beans",
    "Braised & Stewed Sausages",
    "Chicken Thighs"
  ],
  "title": "Traditional French Cassoulet",
  "full_text": "Traditional French Cassoulet\nClose\nJump to recipe\nPrep\n10 mins\nCook\n4 hrs\nActive\n60 mins\nSoaking and Cooling Time\n8 hrs 30 mins\nTotal\n12 hrs 40 mins\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\n(\n454\ng\n)\ndried cannellini beans\n3\ntablespoons\n(\n27\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n5\ncups\n(\n1.2\nL\n) homemade or store-bought\nunsalted chicken stock\n, divided (see notes)\n3\npackets\nunflavored gelatin\n(\n3/4\nounce\n;\n21\ng\n), such as Knox (optional, see notes)\n2\ntablespoons\n(\n30\nml\n)\nduck fat\n(optional)\n8\nounces\n(\n227\ng\n)\nsalt pork\n, cut into 3/4-inch cubes (about\n1 1/4\ncups\n)\n8\nounces\n(\n227\ng\n)\nboneless pork shoulder\n, cut into 1-inch cubes\n4\nskin-on, bone-in\nchicken\nthighs\n,\n4\nfresh\nduck\nlegs\n, or\n4\nprepared\nduck confit\nlegs\nFreshly ground black pepper\n1\npound\n(\n454\ng\n)\ngarlic sausage\n(divided into 2-4 segments, if sausage is large)\n1\nlarge\nonion\n(\n12\nounces\n;\n340\ng\n), finely diced (about\n1 1/2\ncups\n)\n1\nmedium\ncarrot\n(\n4\nounces\n;\n113\ng\n), unpeeled and cut into 3-inch sections\n2\nribs\ncelery\n(\n6 1/2\nounces\n;\n188\ng\n), cut into 3-inch sections\n1\nwhole head\ngarlic\n(\n2 3/4\nounces\n;\n80\ng\n)\n4\nsprigs\nflat-leaf\nparsley\n2\nbay leaves\n6\ncloves\nDirections\nIn a large bowl, cover beans with 3 quarts (2.8L) water and add salt. Stir to combine, then let stand at room temperature overnight. Drain and rinse beans; set aside.\nSerious Eats / Fred Hardy\nAdjust oven rack to lower-middle position and preheat oven to 325°F (160°C). Place 4 cups (946ml) stock in a large liquid measuring cup and sprinkle gelatin, if using, over top. Set aside. In a large Dutch oven, heat duck fat (if using), salt pork, and pork shoulder and cook over high heat, stirring occasionally, until browned all over, about 9 minutes (if not using duck fat, cook pork with no additional fat). Using a slotted spoon, transfer to a large bowl, leaving rendered fat in Dutch oven, and set aside.\nSerious Eats / Amanda Suarez\nSeason chicken or duck thighs with pepper (do not add salt) and place skin side down in Dutch oven. Cook without moving until well-browned, 6 to 8 minutes. Transfer to a plate and let cool to room temperature.\nSerious Eats / Fred Hardy\nAdd sausages to Dutch oven and cook, turning occasionally, until well-browned, about 2 minutes per side. Transfer to bowl with salt pork. Drain all but 2 tablespoons fat from pot.\nSerious Eats / Fred Hardy\nAdd onion to Dutch oven and cook, stirring and scraping up browned bits from bottom of pot, until onion is translucent but not browned, about 4 minutes. Add drained beans, carrot, celery, garlic, parsley, bay leaves, cloves, and stock/gelatin mixture. Bring to a simmer over high heat. Reduce to low, cover Dutch oven, and cook until beans are slightly softened but retain a bite, about 20 minutes.\nSerious Eats / Fred Hardy\nCover cooled chicken or duck and transfer to refrigerator. Using tongs, remove carrots, celery, parsley, bay leaves, and cloves from pot and discard. Add pork and sausages to pot and stir to incorporate. Beans should be almost completely submerged. Transfer to oven and cook, uncovered, adding remaining 1 cup (237ml) stock halfway through by pouring it carefully down side of pot as necessary to keep beans mostly covered, until a thin crust forms on top, about 1 hour 30 minutes.\nSerious Eats / Fred Hardy\nBreak crust with a spoon and shake pot gently to redistribute. Nestle chicken or duck into the Dutch oven, skin side up. Return to oven and continue cooking, stopping to break and shake crust every 30 minutes, until crust is deep brown and thick, an additional 1 hour 30 minutes. Serve immediately.\nSerious Eats / Fred Hardy\nSpecial Equipment\nDutch oven\nNotes\nIf you are using homemade chicken stock that already has lots of gelatin (i.e., it should thicken and gel when chilled), you can omit the unflavored gelatin here; if your stock is store-bought, or if it's homemade but watery even when chilled, the\nunflavored gelatin\nis an essential ingredient.\nMake sure not to use a salted, or even low-sodium, chicken broth, especially if opting for duck confit, lest the dish end up too salty.\nRead More\nFrench Onion Soup\nSous Vide Duck Confit\nTraditional Duck Confit\nFrench\nBraising & Stewing\nBraised & Stewed Beans\nBraised & Stewed Sausages\nChicken Thighs"
}