{
  "url": "https://www.seriouseats.com/traditional-scottish-style-oatmeal-with-butter-recipe-8636424",
  "image_url": "https://www.seriouseats.com/thmb/W02r45WkUkSqMjkMBmUg9NlBxNo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240426-SEA-ScottishOatmeal-VickyWasik-1debe60129ba406aa207a03933090ebd.jpg",
  "tags": [
    "Oatmeal",
    "The Latest",
    "Breakfast & Brunch",
    "Scottish"
  ],
  "title": "The Simple Trick for Ultra-Creamy Oatmeal",
  "full_text": "The Simple Trick for Ultra-Creamy Oatmeal\nClose\nJump to recipe\nCook\n25 mins\nTotal\n25 mins\nServes\n2\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n180\ng\n)\nsteel-cut oats\n(also sold as pinhead or Irish oats; see note), such as Bob's Red Mill\n3\ncups\n(\n700\nml\n)\ncold water\n, plus more if needed\nKosher\nor\nsea salt\nUnsalted butter\nor\ncream\n, for serving (optional)\nFlaky sea salt\n, for sprinkling (optional)\nDirections\nIf you prefer a deeper, more complex flavor, dry-toast the oats in the cooking pot over high eat, stirring and tossing constantly, until lightly roasted and fragrant, then remove from heat. If making overnight oats, combine toasted or untoasted oats and water in a medium saucepan or 3-quart saucier and let stand, covered, overnight. If not making overnight oats, combine toasted or untoasted oats and water in the saucepan and proceed with cooking immediately.\nSerious Eats / Vicky Wasik\nBring oats and water to a simmer over medium-high heat, seasoning lightly with a pinch of salt. Reduce heat to maintain a gentle simmer and cook uncovered, stirring frequently but slowly, until porridge is well thickened but still flows slightly, about 5 minutes for overnight oats and 20 minutes for un-soaked oats.\nSerious Eats / Vicky Wasik\nIf oats are still too firm to your taste, stir in additional boiling water 1/4 cup (60ml) at a time and continue cooking until desired texture of oats is reached. Scoop porridge into warmed bowls and top with a pat of butter and/or a splash of cream. Sprinkle flaky salt on top, if desired. Serve.\nSerious Eats / Vicky Wasik\nNotes\nMost steel-cut oats work best with the overnight method as described here, but we have found some artisan brands that have a slightly more powdery texture; those do better if you pour off the soaking water, rinse the grains lightly, then add fresh water to cook them. If your overnight oatmeal is overly thick and starchy, you may want to try that soaking-and-rinsing method instead.\nOatmeal\nThe Latest\nBreakfast & Brunch\nScottish"
}