{
  "url": "https://www.seriouseats.com/tres-leches-cake-recipe",
  "image_url": "https://www.seriouseats.com/thmb/GqnePRf6n_zUKbcuu3uiGqsQg-k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110316-127677-Serious-Sweets-Tres20Leches-PRIMARY-a92f3a58b014405899ae6d26cbff8856.jpg",
  "tags": [
    "Mexican",
    "Sheet Cake",
    "Condensed Milk",
    "Evaporated Milk",
    "Heavy Cream"
  ],
  "title": "Tres Leches Cake Recipe",
  "full_text": "Tres Leches Cake Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nActive\n30 mins\nCooling and Chilling Time\n3 hrs 35 mins\nTotal\n4 hrs 30 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\nall-purpose flour\n4\nteaspoons\nbaking powder\n6\nlarge\neggs\n, separated\n1\nteaspoon\nsalt\n2\ncups\nsugar\n1/2\ncup\nmilk\n2\nteaspoons\nvanilla extract\n2\n(\n12-ounce) cans\nevaporated milk\n2\n(\n14-ounce) cans\nsweetened condensed milk\n3\ncups\nheavy cream\n1\nteaspoon\nunflavored gelatin\n(see note)\n2\ntablespoons\nwater\n(see note)\n1/4\ncup\ncream cheese\n, softened (see note)\n1/2\ncup\nconfectioners' sugar\nDirections\nAdjust oven rack to middle position and preheat oven to 325°F (160°C).\nCombine flour and baking powder in a small bowl; set aside.\nIn the bowl of a stand mixer, beat egg whites and salt with whisk attachment on medium-low speed until whites begin to froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes. Slowly add the sugar and continue beating until stiff peaks form, 2 to 3 minutes. The mixture may look a bit thick.\nAdd egg yolks and beat just until combined. Decrease speed to low and add flour in 3 additions, alternating with the milk, scraping sides and bottom of bowl as necessary. Add vanilla and beat just until combined.\nScrape batter into an ungreased 13- by 9-inch baking dish. Bake until cake tester inserted in center comes out clean, 30 to 35 minutes (see note). Transfer cake to cooling rack and cool completely in pan, 60 to 90 minutes.\nOnce cooled, poke cake all over with fork. Combine evaporated milk, sweetened condensed milk, and 1 1/2 cups heavy cream in large bowl. Pour mixture evenly all over cake. While cake soaks, make whipped cream.\nCombine gelatin and water in a small bowl. Microwave until gelatin dissolves, about 20 seconds. Cool to room temperature, about 5 minutes.\nIn the clean bowl of stand mixer, beat cream cheese, confectioners’ sugar, and cooled gelatin with whisk attachment until soft and whippy, about 2 minutes. Add remaining 1 1/2 cups cream and beat to soft peaks, about 2 minutes.\nSpread whipped cream over cake and refrigerate until thoroughly chilled, at least 2 hours (see note). Serve.\nSpecial Equipment\nStand mixer\n,\n13- by 9-inch baking dish\n,\ncooling rack\nNotes\nThe whipped cream in this recipe is stabilized with unflavored gelatin and cream cheese—feel free to omit those ingredients if you expect the cake to go in one sitting.\nBe sure to thoroughly chill the cake prior to serving. I sometimes pop it in the freezer for 20 to 30 minutes right before serving.\nThis recipe can be halved. If doing so, bake the cake in an ungreased 8-inch square baking dish and reduce the baking time to 25 to 30 minutes.\nRead More\nTres Leches de Coco (Coconut Tres Leches Cake)\nPío V (Nicaraguan Christmas Cake)\nThai Tea Cake with Condensed Milk Custard Sauce\nWhat to do With Leftover Condensed Milk\nMexican\nSheet Cake\nCondensed Milk\nEvaporated Milk\nHeavy Cream",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/tres-leches-cake-recipe.webp?"
}