{
  "url": "https://www.seriouseats.com/trippa-alla-romana-braised-tripe-with-tomato-herbs-and-parmesan-recipe",
  "image_url": "https://www.seriouseats.com/thmb/87QIOTXJAGS95HJJZUjTL2WjXPw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20120403-nasty-bits-trippa-alla-romana-plate-primary-1f72ca169d904431b15b787721c6220d.jpg",
  "tags": [
    "Italian"
  ],
  "title": "Trippa alla Romana (Braised Tripe With Tomato, Herbs, and Parmesan) Recipe",
  "full_text": "Trippa alla Romana (Braised Tripe With Tomato, Herbs, and Parmesan) Recipe\nClose\nJump to recipe\nActive\n30 mins\nTotal\n2 hrs\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\npounds\ntripe\n1/2\ncup\nwhite distilled vinegar\n3 to 4\ntablespoons\nolive oil\n1\nonion\n, thinly sliced\n3\nmedium\ncloves garlic\n, grated on a microplane grater or pressed through a garlic press (about 3 teaspoons)\n1\ntablespoon\ntomato paste\n1 (\n28\n-\nounce\n) can\nwhole peeled tomatoes\n, drained, and crushed by hand or through a food mill\nKosher salt\nand freshly ground black pepper\n1/3\ncup\nfresh mint\n, basil, or parsley leaves, finely chopped\n2\nounces\nPecorino or\nParmigiano-Reggiano cheese\n, finely grated (about 1/2 cup)\nDirections\nIn a large pot, combine tripe and vinegar. Add enough water to cover tripe by 2 inches. Bring to a boil, reduce to a simmer and cook until tripe is very tender, about 1 1/2 hours. Add more water as needed to keep tripe submerged. Drain tripe, reserving cooking liquid, and allow to cool. Slice tripe into 1-inch strips.\nHeat olive oil in a large skillet over medium-high heat. Add onion and cook, stirring frequently, until onion is softened but not browned, about 4 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add tomato paste and stir to coat. Add tomatoes and stir to combine. Add tripe along with about 1/2 cup of the tripe cooking liquid. Bring to a boil, reduce to a simmer and cook, covered, until sauce is lightly reduced and flavors marry, about 30 minutes. Season to taste with salt and pepper. Stir half of herbs into sauce.\nWhen ready to serve, divide tripe evenly among 4 to 6 warmed bowls and top with grated cheese and remaining herbs.\nNotes\nThe difference between honeycomb tripe and rumen tripe is that the latter has a shaggy carpet-like appearance. They're merely different parts of the stomach and both are adept at sopping up sauce.\nItalian"
}