{
  "url": "https://www.seriouseats.com/trout-almondine-recipe-8728416",
  "image_url": "https://www.seriouseats.com/thmb/7P5yAXc4eY6v1LKu1GzrvzRTiIM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241015-TroutAlmondine-AmandaSuarez-19-61a67c9578cd41c38a789f1a9ca8bb1b.jpg",
  "tags": [
    "Fish",
    "The Latest",
    "French",
    "Trout"
  ],
  "title": "Trout Almondine",
  "full_text": "Trout Almondine\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nTotal\n15 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFour\n4- to 6-ounce (113 to 140g)\nskin-on,\nboneless\ntrout fillets\nor other thin white-fleshed fish fillets\n1 1/2\nteaspoons\nDiamond Crystal\nkosher salt,\ndivided; for table salt use half as much by volume\n1/2\nteaspoon\nfreshly\nground black pepper\n3 tablespoons\n(24\ng)\ncornstarch\n8 tablespoons\n(113\ng)\nunsalted butter,\ncut into 8 pieces\n1/2 cup raw\nsliced almonds\n(2 ounces;\n56\ng)\n1 teaspoon grated lemon zest plus\n4\nteaspoons\njuice\nfrom 1 lemon\n2\ntablespoons\nfinely chopped flat-leaf\nparsley\nleaves and tender stems\nDirections\nPat trout fillets dry with paper towels. Sprinkle all over with 1 teaspoon salt and pepper. In a shallow dish such as a pie plate, spread cornstarch in an even layer. Working with 1 fillet at a time, dredge both sides in the cornstarch, pressing gently to adhere. Shake off excess cornstarch and transfer to a large plate.\nSerious Eats / Amanda Suarez\nIn a 12-inch nonstick or cast iron skillet, heat 1 tablespoon butter over medium heat until just melted and beginning to bubble. Carefully place 2 fillets, skin side down, in skillet and use a thin spatula to gently press flat into the skillet; cook until lightly browned and crispy on the bottom, 2 to 4 minutes. Using 2 thin spatulas, gently flip fillets flesh side down and cook until flesh is opaque and bottom begins to turn golden, about 1 minute.\nSerious Eats / Amanda Suarez\nTransfer cooked fillets to a large serving platter, flesh side up. Repeat cooking with 1 more tablespoon butter and remaining 2 trout fillets.\nSerious Eats / Amanda Suarez\nAdd remaining 6 tablespoons butter to the now-empty skillet. Cook, stirring frequently, until butter is light golden brown with a nutty, toasty aroma, 1 to 2 minutes. Stir in almonds and cook, swirling and stirring often, until almonds are deep golden brown and milk solids in butter have turned a hazelnut color, about 2 minutes.\nSerious Eats / Amanda Suarez\nImmediately remove skillet from heat and quickly but carefully swirl and stir in lemon zest, juice, parsley, and remaining 1/2 teaspoon salt, scraping up any browned bits from bottom of pan. Pour sauce over trout fillets. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n12-inch nonstick skillet or cast iron skillet\nFish\nThe Latest\nFrench\nTrout",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/trout-almondine.webp?"
}