{
  "url": "https://www.seriouseats.com/turkey-ssam-recipe-8749227",
  "image_url": "https://www.seriouseats.com/thmb/laIHhI0_-IQ05eA7SLIB9htSY6U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__11__20201015-banchan-thanksgiving-group-vicky-wasik-1-10-1078b1091be741c5b403f30dfa1d7f69.jpg",
  "tags": [
    "Thanksgiving",
    "Korean",
    "Turkey Breast",
    "Thanksgiving Turkeys"
  ],
  "title": "Turkey Ssam",
  "full_text": "Turkey Ssam\nClose\nJump to recipe\nTotal\n2 hrs 30 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Squash Ssamjang:\n1\npound\n(450g) honeynut or similar winter\nsquash\nsuch as\nbutternut\n, acorn, or kabocha (1 small squash)\n1\ntablespoon\n(15ml)\nvegetable oil\n4 medium\ngarlic cloves\n(about\n20\ng\n), finely chopped\n3\ntablespoons\n(30g)\ntoasted sesame seeds\n2\ntablespoons\ndoenjang\n(30ml; 30g)\n2\ntablespoons\ngochujang\n(30ml; 30g)\n2\ntablespoons\nhoney\n(30ml; 40g)\n2\ntablespoons\n(30ml)\ntoasted sesame oil\n1 tablespoon (\n8\ng\n)\ngochugaru\nOne 1-inch piece\nfresh ginger\n(about\n20\ng\n), peeled and finely chopped\n1 teaspoon (\n4\ng\n) freshly\nground black pepper\nFor the Turkey and Jujube Relish:\n12\ntablespoons\n(1 1/2 sticks; 170g)\nunsalted butter\n, softened\n1\ntablespoon\n(9g)\nground cinnamon\n2\nteaspoons\n(8g)\ngarlic powder\n1 teaspoon (\n4\ng\n) Diamond Crystal\nkosher salt\n; for table salt use half by volume or the same weigh\n1 teaspoon (\n4\ng\n) freshly\nground black pepper\n2\ntablespoons\ndoenjang\n(30ml; 30g)\n1 (\n6- to 7\n-\npound\n; 2.7 to 3.2kg)\nbone-in turkey breast\n(aka crown),\ndry-brined for at least 12 hours following these instructions\n(see note)\n5 1/4 ounces (\n150\ng\n)\ndried jujube dates\n(about 40 small dates), soaked in hot water for 1 hour, then pitted\n1\ntablespoon\n(15ml)\ncider vinegar\nFor Serving:\nAssorted\nlettuces\nand chicories, separated into individual leaves, and perilla leaves (see note)\nDirections\nFor the Squash Ssamjang:\nAdjust oven rack to middle position and preheat oven to 425°F (220°C). Cut squash in half lengthwise and scoop out seeds; discard seeds or set aside for\nroasting\n.\nIn a 10-inch cast iron skillet, heat oil over medium-high heat until shimmering. Place squash halves in skillet, cut side down, and cook until squash flesh just begins to lightly brown, about 2 minutes.\nTransfer skillet to oven and roast squash until completely tender and flesh offers no resistance when pierced with a paring knife, 25 to 30 minutes. If cooking turkey crown the same day, don't turn off the oven after removing squash, and wipe out skillet. Let squash cool to room temperature, then scoop out flesh into a medium bowl; you should have about 1 cup (8 ounces; 225g) flesh. Discard squash skins. Using a spoon or fork, mash squash flesh until smooth, about 30 seconds.\nStir in garlic, sesame seeds, doenjang, gochujang, honey, sesame oil, gochugaru, ginger, and black pepper. Mix until ingredients are thoroughly incorporated into a thick sauce. If serving the ssamjang the same day, transfer to a serving bowl, cover, and set aside at room temperature until ready to serve. If making ssamjang in advance, transfer to an airtight container and refrigerate for up to 1 week. Bring to room temperature before serving.\nFor the Turkey and Jujube Relish:\nPreheat oven to 425°F (220°C). In a small bowl, stir together butter with cinnamon, garlic powder, salt, and black pepper until thoroughly combined. Using clean hands, spread doenjang all over interior cavity of the turkey. Spread cinnamon butter mixture evenly all over turkey skin.\nTransfer turkey to 10-inch cast iron skillet, with skin side up and back directly in contact with the pan. Add jujubes to skillet, spreading in an even layer around the turkey.\nRoast turkey until jujubes begin to darken around the edges and sugar begins to caramelize in the pan, about 20 minutes. Using a spoon, carefully transfer jujubes to a small heatproof bowl, and return turkey to oven. Continue to cook until skin at the lower part of the breast turns golden brown, about 20 minutes.\nUsing tongs, carefully reposition turkey crown so lower part of breast and the cavity are in contact with the skillet. Baste skin with drippings, and return turkey to oven. Continue to cook until the thickest part of the breast registers 150°F (65°C) on an instant-read thermometer, about 30 minutes longer. If skin begins to get too dark before turkey has reached the proper internal temperature, reduce oven temperature to 350°F (175°C). Once turkey is cooked, transfer crown to a cutting board and allow to rest for 20 minutes before carving. Strain drippings from skillet through a fine-mesh strainer into a small saucepan.\nRoughly chop reserved jujubes and add to saucepan with drippings, along with cider vinegar and 2 tablespoons (30ml) water. Cook over low heat, stirring occasionally, until jujubes are softened and mixture forms a thick relish, 2 to 3 minutes. Transfer to a small serving bowl.\nFor Serving:\nCarve turkey breast into thin slices and transfer to a serving platter. Serve, passing jujube relish, ssamjang, and lettuces at the table.\nSpecial equipment\n10-inch cast iron skillet\n,\nfine-mesh strainer\n, small saucepan\nNotes\nWhole, bone-in turkey breast is also known as a crown, and can be purchased individually at supermarkets and butcher shops, or you can purchase a whole bird and\ndo the butchering yourself\n.\nSturdy leafy lettuces such as red and green leaf lettuces work best for ssam. Perilla leaves (sometimes sold as \"sesame leaves\") can be found at Korean markets such as HMart, or at farmers markets in summer months.\nMake-Ahead and Storage\nRoast turkey is best enjoyed right away, but leftovers can be refrigerated in an airtight container for up to 5 days. Ssamjang can be made in advance and refrigerated in an airtight container for up to 1 week; bring to room temperature before serving. Leftover jujube relish can be refrigerated in an airtight container for up to 1 week.\nThis Recipe Appears In\nCelebrate the Sides With a Korean-American Banchan Thanksgiving\nThanksgiving\nKorean\nTurkey Breast\nThanksgiving Turkeys",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/turkey-ssam.webp?"
}