{
  "url": "https://www.seriouseats.com/turkey-bacon-broccoli-rabe-shooters-sandwich-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/EFz98FbWxlpDolptqdFWeEjeRlY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__03__20140307-broccoli-rabe-turkey-cheddar-bacon-shooter-recipe-20-b959db419f1e413b8436a16c3a746b8a.jpg",
  "tags": [
    "Sandwiches",
    "British",
    "Bacon",
    "Turkey",
    "Broccoli Rabe"
  ],
  "title": "Turkey, Bacon, and Broccoli Rabe Shooter's-Style Sandwich Recipe",
  "full_text": "Turkey, Bacon, and Broccoli Rabe Shooter's-Style Sandwich Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n30 mins\nActive\n45 mins\nResting Time\n4 hrs\nTotal\n4 hrs 45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nloaf\nhearty pumpernickel or other\nrye bread\n, un-sliced\n8\nslices\nthick-sliced\nbacon\nKosher salt\n1\nbunch\nbroccoli rabe\n, trimmed and washed\n1/4\ncup\nextra virgin olive oil\n16\ncloves garlic\n, thinly sliced\nPinch\nred pepper flakes\n1/4\ncup\nwhole grain\nmustard\n1\npound\nhand-sliced roast\nturkey breast\n1/2\npound\nsliced extra-\nsharp cheddar cheese\nDirections\nAdjust oven rack to center position and preheat oven to 400°F. Slice off the top 1 to 1 1/2-inches of the loaf of bread using a bread knife. Cut around the perimeter of the interior crumb, making sure not to break through the bottom crust, then use your hand to lift out the excess bread from the inside, leaving you with a hollow bread boat.\nLine a rimmed baking sheet with heavy duty aluminum foil. Place four slices of bacon on baking sheet side to side running perpendicular to the edge of the counter. Fold down the top halves of 1st and 3rd slices. Place a slice of bacon across the top of the folds, running perpendicular to the first 4 slices, then unfold the bacon so that the new slice is woven over and under every other slice. Fold down the 2nd and 4th slices and lay another slice of bacon across the top of the fold. Unfold the slices. Repeat until all 8 slices of bacon have been laid on the baking sheet in an interwoven pattern. Place baking sheet in oven and cook until bacon is crisp, about 25 minutes.\nMeanwhile, bring a large pot of salted water to a boil. Add broccoli rabe and cook until bright green, about 1 minute. Drain and run under cold water until chilled. Spin dry in a salad spinner and set aside.\nHeat olive oil in a large pot over medium heat until shimmering. Add garlic and cook, stirring, until pale golden, about 1 minute. Add red pepper flakes and stir to combine. Add drained broccoli rabe and cook, stirring and tossing until well-coated in oil and garlic and thickest part of stalks are tender to the bite, about 2 minutes. Transfer to a large bowl and set aside.\nWhen ready to assemble, slather bottom of bread with half of mustard. Add half of broccoli rabe followed by half of cheese, half of sliced turkey, and the bacon weave (trim bacon so it fits the bread). Top with remaining turkey, remaining cheese, remaining broccoli rabe, and remaining mustard. Close sandwich.\nWrap sandwich tightly in aluminum foil or burtcher's paper, then place in between two stiff cutting boards. Place a heavy weight on top (about 40 pounds), press down firmly to flatten sandwich, then let rest under the weight for at least 4 hours and up to overnight (keep an eye on the sandwich to ensure that it is pressing evenly).\nWhen ready to eat, remove weights, slice sandwich into four wedges through paper or foil with a bread knife, unwrap, and serve.\nThis Recipe Appears In\nThe Food Lab: How to Make a Turkey, Bacon, and Broccoli Rabe Shooter's-Style Sandwich\nSandwiches\nBritish\nBacon\nTurkey\nBroccoli Rabe"
}