{
  "url": "https://www.seriouseats.com/turkey-chintan-ramen",
  "image_url": "https://www.seriouseats.com/thmb/fbRwLWgAmTmsV5jq4K3O2YHtEIU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__10__20191007-leftover-turkey-ramen-vicky-wasik-4-7d90b6a6c6954a01be18d5f450671b37.jpg",
  "tags": [
    "Turkey",
    "Japanese",
    "Dairy-free Mains",
    "Pressure Cooker",
    "Ramen"
  ],
  "title": "Turkey Chintan Ramen Recipe",
  "full_text": "Turkey Chintan Ramen Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n80 mins\nActive\n15 mins\nTotal\n85 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n4\npounds\n(\n1.8\nkg\n)\nturkey bones\n, reserved from a roast turkey (see note)\nFor the Tare:\n1\ncup\n(\n200\nml\n)\nsoy sauce\n(see note)\n1/4\ncup\n(\n60\nml\n)\ntamari\n1/4\ncup\n(\n60\nml\n)\nmirin\nFor the Brussels Sprouts Topping:\n1\ntablespoon\n(\n15\nml\n)\ncanola oil\n, or other neutral oil\n3\nmedium\nBrussels sprouts\n, divided into individual leaves\nKosher salt\nFor Serving:\n4\nservings\nramen noodles\n, either store-bought or\nhomemade\n1/2\ncup\n(\n120\nml\n)\nrendered turkey fat\n(see note)\n2\nscallions\n, white and green parts divided and thinly sliced\nFreshly\nground black pepper\nApple cider vinegar\n, to taste\n4\n(\n1/2-inch-thick\n)\nslices\nroast turkey breast\nDirections\nFor the Broth:\nPlace turkey bones in a pressure cooker and cover with 6 1/4 cups (1.5L) water. (No matter what, be sure not to exceed the max-fill line of your cooker.) If using stovetop pressure cooker, cover pressure cooker and place over high heat until cooker comes to pressure, then reduce heat to medium-low and cook for 1 hour. If using an electric pressure cooker, cover pressure cooker and cook on high pressure for 1 hour. Allow pressure cooker to depressurize naturally. Strain broth through a fine-mesh sieve into a large mixing bowl. At this point, broth can be transferred to a saucepan to be heated back to boiling and used immediately, or it can be cooled and refrigerated.\nFor the Tare:\nIn a small bowl, stir together soy sauce, tamari, and mirin until well-combined. Set aside.\nFor the Brussels Sprouts Topping:\nHeat oil in a large skillet over high heat until lightly smoking. Add Brussels sprouts leaves. Season to taste with salt and cook, tossing frequently, until bright green and charred in spots, about 2 minutes. Transfer to a bowl and set aside.\nFor Serving:\nBring a large pot of water to a boil over high heat, and cook noodles according to packaging or recipe instructions. Spoon 2 tablespoons of tare, 1 tablespoon rendered turkey fat, 1/4 sliced scallions whites, and a grind of black pepper into each warmed serving bowl. Add 1 1/2 cups (360mL) boiling broth to each bowl, along with several drops of vinegar, to taste. Add noodles to bowls, top with sliced turkey breast, seared Brussels sprouts leaves, and sliced scallion greens. Serve immediately.\nVicky Wasik\nSpecial Equipment\nStovetop or electric\npressure cooker\n;\nfine-mesh strainer\n; noodle baskets (optional)\nNotes\nThe best parts of a roast turkey for broth-making, in order, are the back, the wing tips, the wings, the leg bones, and the rib cage. You can also use any leftover meat from the breasts or legs that you are sure you will not eat.\nWe strongly suggest you use a blend of good-quality soy sauce in the tare; doing so will add much-needed layers of complexity to the broth. We recommend blending Yamasa Organic Marudaizu soy sauce and Kishibori Shoyu.\nChicken fat or schmaltz can be substituted for the turkey fat, as can rendered pork fat, although pork fat will change the flavor profile significantly.\nMake-Ahead and Storage\nThe broth can be cooled and refrigerated in an airtight container for one week or frozen in an airtight container for up to three months. The tare can be refrigerated in an airtight container for up to two weeks. Rendered poultry fat can be kept in an airtight container in the refrigerator for up to one week or frozen for up to six months.\nTurkey\nJapanese\nDairy-free Mains\nPressure Cooker\nRamen"
}