{
  "url": "https://www.seriouseats.com/turon-filipino-fried-banana-rolls-5189025",
  "image_url": "https://www.seriouseats.com/thmb/lzEl9bbd9AAQymYV-gzXWkz1_Sw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210617-turon-vicky-wasik-seriouseats-seriouseats-30-ed4fcc2e4a58487dadb92f810d0ab52a.jpg",
  "tags": [
    "Filipino",
    "Desserts",
    "Banana",
    "Frying",
    "The Latest"
  ],
  "title": "Turon (Filipino Fried Banana Rolls)",
  "full_text": "Turon (Filipino Fried Banana Rolls)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n15 mins\nCooling Time\n5 mins\nTotal\n35 mins\nServes\n12 turons\nCook Mode\n(Keep screen awake)\nIngredients\n12\n(\n8-inch) square\nspring roll (\nlumpia\n)\nwrappers\n(see notes)\n5\nounces\nlight brown sugar\n(\n2/3\ncup\n;\n140\ng\n)\n6\nripe\nSaba bananas\n, peeled and halved lengthwise (see notes)\n2\npieces ripe\njackfruit in syrup\n(\n2\nounces\n;\n70\ng\n), patted dry with paper towels and cut into 1/8-inch thick slices (optional)\nVegetable oil\nor other neutral oil, for frying\nDirections\nFill a medium shallow bowl with the brown sugar and a small bowl with water. On a work surface, position one spring roll wrapper so it resembles a diamond with a point facing you.\nVicky Wasik\nToss one banana slice in the sugar until coated on all sides. Set the sugar-coated banana slice horizontally in the center of the wrapper. Top with two slices of jackfruit, if using.\nVicky Wasik\nStarting with the point closest to you, fold the wrapper over the banana, tucking the point underneath the banana. Fold the right and left points of the wrapper over the banana like an envelope (they will overlap slightly) and roll tightly away from you, leaving about 2 inches of the top point exposed. Dip your finger into water, moisten the point, then finish rolling to seal. Repeat with the remaining wrappers and banana slices; do not let rolled turon sit for more than 1 hour before frying. Reserve remaining brown sugar (you should have about 4 ounces; 115g left).\nVicky Wasik\nSet a wire rack in a rimmed baking sheet. In a 12-inch cast iron skillet, heat 1/2 inch of oil over medium heat to 350°F (177°C). Using tongs, add half of turon rolls to the oil in a single layer. Fry turon, flipping occasionally, until golden brown all over, about 3 minutes; adjust heat as needed to return to and then maintain a frying temperature of 350°F (177°C). Transfer turon to prepared wire rack. Return oil to 350°F (177°C) and repeat with remaining turon.\nVicky Wasik\nAdjust heat to increase oil temperature to 375°F (190°C). Add reserved brown sugar to the oil, stirring with tongs to spread it out evenly (it will begin to melt and turn slightly darker in color). Working quickly, use the tongs to return turon to the skillet, moving them around constantly and flipping once halfway through, until turon are glazed all over in caramel, about 1 minute.\nVicky Wasik\nUsing tongs, return turon to the wire rack and cool slightly until the caramel has set, about 3 minutes. Serve immediately.\nVicky Wasik\nSpecial Equipment\n12-inch\ncast iron skillet\n,\nrimmed baking sheet with wire rack\n,\ninstant-read thermometer\nNotes\nSpring roll wrappers can be found at most Asian supermarkets. They're made with wheat flour and are often labeled as “spring roll pastry.” Chinese or Vietnamese wrappers will work as long as they are meant for frying. Do not use dried rice paper wrappers. If you cannot find square wrappers, round wrappers work well, too. To defrost the spring roll wrappers, transfer to the refrigerator the night before, or let them sit at room temperature for 30 minutes prior to using.\nFresh or frozen Saba bananas are sold at most Asian supermarkets; if using frozen Saba bananas, defrost in the refrigerator overnight. Fresh ripe plantains (\"maduros\"), that are primarily black with spots of yellow, can also be used as a substitute. Peel 2 plantains and cut them in half crosswise; after this, cut each half lengthwise into thirds for a total of 6 pieces.\nMake-Ahead and Storage\nFreeze uncooked turon on a parchment-lined baking sheet until firm, then transfer to a zipper lock bag and store in the freezer for up to 2 months. Fry frozen turon for about 5 minutes.\nFilipino\nDesserts\nBanana\nFrying\nThe Latest"
}