{
  "url": "https://www.seriouseats.com/two-minute-foolproof-aioli-recipe",
  "image_url": "https://www.seriouseats.com/thmb/6NplzVAorjdp0lIjXQ1vGdZPBCg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__06__20150608-foolproof-aioli-cdffb37319ba49f0ba66fb970615828b.jpg",
  "tags": [
    "Garlic",
    "Dipping Sauce"
  ],
  "title": "Two-Minute Aioli",
  "full_text": "Two-Minute Aioli\nClose\nJump to recipe\nPrep\n5 mins\nActive\n2 mins\nTotal\n5 mins\nServes\n16 servings\nMakes\n1 cup\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole egg\n4\nmedium\ncloves\ngarlic\n, minced\n2\nteaspoons\njuice\nfrom\n1\nlemon\n1/2\ncup\ncanola\n, vegetable, or light olive\noil\n1/2\ncup\nextra virgin olive oil\nKosher salt\nand freshly ground black pepper\nDirections\nPlace egg, garlic, and lemon juice in the bottom of an immersion blender cup. Pour canola (or vegetable or light olive) oil on top and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and switch it on. As aioli forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified. (For food processor instructions, see note).\nTransfer aioli to a medium bowl. Whisking constantly, slowly drizzle in extra-virgin olive oil. Season to taste with salt and pepper. Store in a sealed container in the refrigerator for up to two weeks.\nSpecial Equipment\nImmersion blender\nwith a cup that just fits its head\nNotes\nUse the best quality extra virgin olive oil you can find but do not be tempted to add it directly to the hand blender cup—it will turn bitter. If you don't have an immersion blender with a cup, you can make the aioli in a food processor. Combine the egg, garlic, and lemon juice in a food processor. With the machine running, slowly drizzle in the canola or light olive oil, scraping down the sides as necessary. Transfer the half-finished aioli to a bowl and proceed with step two.\nRead More\nGrilled Asparagus With Aioli Is the Ultimate Backyard Finger Food\nRamp Compound Butter\nClassic Tuna Salad Sandwiches\nGarlic\nDipping Sauce"
}