{
  "url": "https://www.seriouseats.com/ube-halaya-purple-yam-jam-5195583",
  "image_url": "https://www.seriouseats.com/thmb/GTljQs8oAo-PilSrDKbknAUTkd8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210723-Ube-Halaya-Rezel-11-97c9044512804b9584494829adb96f98.jpg",
  "tags": [
    "Filipino",
    "Desserts",
    "Yams",
    "Stovetop Vegetables",
    "The Latest"
  ],
  "title": "Ube Halaya (Purple Yam Jam)",
  "full_text": "Ube Halaya (Purple Yam Jam)\nClose\nJump to recipe\nCook\n50 mins\nCooling and Chilling Time\n90 mins\nTotal\n2 hrs 20 mins\nMakes\n3 cups\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(16-ounce; 454 g) pack\nfrozen, grated ube (\npurple yam\n), thawed (see note)\n5 1/2\nounces\ngranulated sugar\n(\n155\ng\n;\n3/4\ncup\n)\n1\n(13.5-ounce; 400 ml) can\ncoconut milk\n2\nounces\nunsalted butter\n(\n60\ng\n;\n4\ntablespoons\n), cut into 1/2-inch cubes (see note)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nDirections\nIn a 4-quart saucepan, heat ube over medium-high heat. Cook, stirring occasionally, until ube has started to deepen in color and any excess water has been cooked off, about 3 minutes.\nSerious Eats / Rezel Kealoha\nAdd sugar and coconut milk and stir to combine. Bring mixture to a boil, then lower heat to maintain a gentle simmer. Cook, stirring and scraping frequently to prevent the ube from sticking to the saucepan, until the mixture has thickened to a jammy consistency, about 30 minutes.\nSerious Eats / Rezel Kealoha\nAdd butter and salt and continue to cook until mixture is dark purple in color and has reduced to a viscous, paste-like consistency, about 15 minutes.\nSerious Eats / Rezel Kealoha\nTransfer to a heatproof medium bowl and let cool completely, about 30 minutes. Cover and refrigerate until cold.\nSerious Eats / Rezel Kealoha\nSpecial Equipment\n4-quart saucepan\nNotes\nTo thaw frozen ube, defrost in the refrigerator overnight.\nTo use fresh ube, first wash it thoroughly, then cover with water and boil until tender, between 30 to 40 minutes. Peel off skin and cut into 1/2-inch cubes (make sure you have 16 ounces; 454g). In Step 2, use a potato masher or immersion blender to smooth it out when you’re cooking it. Fresh boiled ube can be frozen in an airtight container for up to 3 months; defrost before using.\nSubstituting vegan unsalted butter for unsalted butter by weight will make this vegan.\nMake-Ahead and Storage\nUbe halaya can be refrigerated in an airtight container for up to 2 weeks or frozen for up to 3 months.\nRead More\nPurple Yam and Halo-Halo: The Delicious, Contradictory World of Filipino Dessert\nUbe (Purple Yam) Ice Cream\nHalo-Halo (Filipino Shaved Ice Dessert) Recipe\nFilipino\nDesserts\nYams\nStovetop Vegetables\nThe Latest"
}