{
  "url": "https://www.seriouseats.com/ube-ice-cream-5195591",
  "image_url": "https://www.seriouseats.com/thmb/KcxRfcvv6V7p4ps26HfXuDKBNkw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210723-Ube-Ice-Cream-Rezel-12-8f4cc7d9989b421d86f72124ddaf08ab.jpg",
  "tags": [
    "Filipino",
    "Summer Desserts",
    "Ice Cream",
    "Yams",
    "The Latest"
  ],
  "title": "Ube (Purple Yam) Ice Cream",
  "full_text": "Ube (Purple Yam) Ice Cream\nClose\nJump to recipe\nPrep\n4 hrs 10 mins\nCook\n10 mins\nFreezing Time\n5 hrs\nTotal\n9 hrs 20 mins\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\n(\n355\nml\n)\ncoconut cream\n3/4\ncup\n(\n175\nml\n)\nfull-fat coconut milk\n2 3/4\nounces\nturbinado sugar\n(\n1/4\ncup\nplus\n2\ntablespoons\n;\n75\ng\n)\n2\nounces\nlight corn syrup\n(\n3\ntablespoons\n;\n60\ng\n)\n2 1/4\ncups\n(\n610\ng\n)\nube halaya\n(see note)\n2\nteaspoons\n(\n10\nml\n)\ncoconut\nor\nunflavored vodka\n3/4\nteaspoon\nDiamond Crystal kosher salt\n; for table salt, use half as much by volume\n3/4\nteaspoon\nube extract\n(see note)\nDirections\nIn a 2-quart saucepan, whisk together coconut cream, coconut milk, sugar, corn syrup, and ube halaya. Cook over medium heat, whisking frequently, until mixture comes to a simmer. Remove from heat and stir in vodka, salt, and ube extract.\nRezel Kealoha\nTransfer mixture to a blender and process until smooth, about 30 seconds (alternatively, use an immersion blender to purée mixture directly in saucepan). Strain mixture through a fine-mesh strainer set over a large heatproof bowl. Let cool to room temperature, then cover and refrigerate until no warmer than 40°F (4°C), about 4 hours.\nRezel Kealoha\nChurn in an ice cream machine according to the manufacturer’s directions, until thick and fluffy (about 10 minutes, but the timing will vary depending on the type of machine).\nRezel Kealoha\nTransfer to an airtight container and freeze until ice cream is firm enough to scoop, about 5 hours.\nRezel Kealoha\nSpecial equipment\n2-quart saucepan,\nice cream maker\n,\nimmersion blender\n, or\ncountertop blender\nNotes\nStore-bought ube halaya is available at Filipino and Asian specialty markets and online. Choose one that has no more than two or three ingredients and is primarily made from ube and sugar, with minimal preservatives.\nUbe extract, a great source for adding or increasing ube flavor, is available at Asian specialty markets and online. For a deeper ube flavor and color, you can add an additional 3/4 teaspoon ube extract to the ice cream mixture.\nMake-ahead and Storage\nUbe ice cream can be frozen in an airtight container for up to 2 weeks.\nFilipino\nSummer Desserts\nIce Cream\nYams\nThe Latest"
}