{
  "url": "https://www.seriouseats.com/ugali-cornmeal-porridge-recipe-8690802",
  "image_url": "https://www.seriouseats.com/thmb/4tWLftVBDWztunWtWD8Tr2RDITk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240806-SEA-Ugali-MaureenCelestine-14-833dce8dc17844f292c92925b827ac15.jpg",
  "tags": [
    "Rice & Grain Sides",
    "The Latest",
    "Cornmeal",
    "Kenyan"
  ],
  "title": "Ugali (Savory Kenyan Cornmeal Porridge)",
  "full_text": "Ugali (Savory Kenyan Cornmeal Porridge)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nResting Time\n20 mins\nTotal\n35 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n4\ncups\n(\n960\nml)\nwater\n2\nteaspoons\n(\n6\ng\n) Diamond Crystal\nkosher salt;\nfor table salt use half as much by volume\n2\ntablespoons\n(\n28\ng)\nbutter\nor ghee\n2\ncups\n(\n320\ng\n) fine\nwhite cornmeal\n, such as Albers White Corn Meal (see notes)\nDirections\nIn a medium (3-4 quart) saucepot, bring 4 cups of water to a boil over medium-high heat. Add kosher salt. Reduce heat to medium-low and stir in 2 tablespoons of butter or ghee until melted.\nSerious Eats / Maureen Celestine\nWhile continuously whisking to prevent lumps from forming, gradually pour in fine white cornmeal. Once all the cornmeal is added, switch to a wooden spoon and stir the ugali, using the spoon to break up any lumps against the side of the pot as needed. Cook, stirring continuously until the water is absorbed and the ugali thickens, about 5 minutes. Continue to cook until the ugali forms a film along the bottom and sides of the pan and is firm enough to hold its shape, 4 to 5 minutes. The texture should be much thicker than polenta or grits and the ugali should hold its shape when pressed with the spoon. Use the wooden spoon to smooth it into an even layer and continue to cook for 1 to 2 minutes.\nSerious Eats / Maureen Celestine\nRemove from heat and run a small offset spatula or butter knife along the sides of the pot to loosen the ugali. Hold a large serving plate flush to the pot, then invert the ugali onto the plate. The ugali should easily release from the pot onto the plate. If it doesn’t easily release, return it to the stove top and continue to cook for a few more minutes. Once flipped out, keep it covered with the pot or a large bowl until ready to serve, up to 20 minutes.\nSerious Eats / Maureen Celestine\nCut the ugali into wedges, and serve.\nSerious Eats / Maureen Celestine\nSpecial Equipment\nMedium saucepan (3-4 quarts), whisk, wooden spoon (preferably flat)\nNotes\nMake sure to use fine white cornmeal that has not undergone nixtamalization for this recipe. Coarse cornmeal or polenta or nixtamalized cornmeal (such as masa harina) will not achieve the same texture. Albers White Corn Meal is what my family has successfully used in the USA for years.\nUgali can be kept warm by covering it with the pot it was cooked in until ready to serve.\nMake-Ahead and Storage\nUgali is best enjoyed fresh, but leftovers can be stored in an airtight container in the refrigerator for up to 3 days. Reheat by microwaving wedges covered with a damp paper towel to retain moisture.\nRice & Grain Sides\nThe Latest\nCornmeal\nKenyan",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ugali-savory-kenyan-cornmeal-porridge.webp?"
}