{
  "url": "https://www.seriouseats.com/ultimate-blt-sandwich-bacon-lettuce-tomato-recipe",
  "image_url": "https://www.seriouseats.com/thmb/HY30T7e4d2_4-QCDDOZqfg0KSfg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-_ultimate-blt-sandwich-bacon-lettuce-tomato-recipe-AmandaSuarez-heros-d01e6b359b054dd1a63733733ea229b4.JPG",
  "tags": [
    "Sandwiches",
    "The Latest",
    "Bacon",
    "Iceberg Lettuce",
    "Tomato"
  ],
  "title": "The Best BLT Sandwich",
  "full_text": "The Best BLT Sandwich\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n20 mins\nTotal\n15 mins\nServes\n1 serving\nMakes\n1 sandwich\nCook Mode\n(Keep screen awake)\nIngredients\n3\nstrips\nthick-cut, naturally cured bacon\n(see note)\n2\nslices\nhigh-quality sandwich bread\n, such as shokupan\n2\ntablespoons\n(\n30\nml\n)\nhomemade\nor store-bought\nmayonnaise\n(see note)\n1\ncup\nfinely shredded\niceberg lettuce\n(from about a quarter head; see note)\n2 to 4\nthick\nslices\nripe\ntomato\n(see note)\nCoarse sea salt\n, such as fleur de sel or Maldon\nFreshly ground black pepper\nDirections\nPlace a griddle or skillet over medium-low heat. Add bacon and place a bacon press, skillet, or masonry trowel on top of it to keep it flat as it cooks. Cook until lightly browned on first side, about 5 minutes, then flip, cover again, and continue cooking until bacon is browned on both sides and fat has rendered, about 3 minutes longer. Transfer bacon to a paper towel–lined plate and set aside.\nSerious Eats / Amanda Suarez\nPlace bread on same skillet or griddle and toast in bacon fat over medium-low heat, swirling occasionally, until evenly browned on first side. Flip and brown second side.\nSerious Eats / Amanda Suarez\nLay toasted bread on a work surface and spread mayonnaise on both top faces. Divide lettuce evenly between both pieces of bread. Layer tomato slices on 1 piece of bread and sprinkle generously with coarse salt and freshly ground pepper.\nSerious Eats / Amanda Suarez\nBreak bacon slices in half and layer them onto the sandwich in 2 layers of 3 half slices each, alternating the orientation of bacon in each layer for more structural stability. Close sandwich and cut in half diagonally. Serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nGriddle\nor\nlarge cast iron skillet\n,\nbacon press\nor masonry trowel\nNotes\nThis recipe can easily be scaled up. To cook bacon for a larger crowd, preheat the oven to 400°F (200°C). Lay bacon strips on a rimmed baking sheet lined with parchment paper, top with a second sheet of parchment paper, and place a second tray on top to keep the bacon flat while baking. Transfer the sandwiched bacon slices to the oven, and bake until well rendered and crisp, 20 to 25 minutes. Reserve the bacon drippings, and brush onto slices of bread before toasting in the toaster or on a griddle.\nI strongly recommend using an immersion-cured bacon, such as Nueske's or Wright bacon, for this sandwich. Many typical supermarket brands inject brine into the bacon for faster curing, which waterlogs it and causes it to spatter more and cook unevenly. To avoid this type of bacon, look for ascorbate or sodium erythorbate on the ingredients label—antioxidants required by law to\nstem the formation of nitrosamines\nin injected bacon.\nHomemade mayonnaise is easy to make\nusing our technique\n, but mayonnaise preference is personal, so use whatever your favorite mayonnaise is. I know better than to get between someone and their Duke's.\nFinely shredded iceberg lettuce is my lettuce of choice, unless you can find super-fresh, young, crisp leaf or romaine lettuce at the farmers market.\nUse only the best summer tomatoes. How many slices you pack onto your sandwich will depend on the size of the tomato, which can vary quite a bit by variety.\nSandwiches\nThe Latest\nBacon\nIceberg Lettuce\nTomato"
}