{
  "url": "https://www.seriouseats.com/ultimate-homemade-diy-mcrib-recipe",
  "image_url": null,
  "tags": [
    "Sandwiches",
    "Grilling",
    "Pork",
    "Pork Mains",
    "Summer Mains"
  ],
  "title": "The Ultimate Homemade McRib (Smoked Rib Sandwich)",
  "full_text": "The Ultimate Homemade McRib (Smoked Rib Sandwich)\nClose\nJump to recipe\nPrep\n35 mins\nCook\n4 hrs 40 mins\nActive\n5 hrs\nChilling and Cooling Time\n6 hrs 15 mins\nTotal\n11 hrs 30 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\n(2-pound; 900 g) racks\nbaby back ribs\n1/2\nrecipe\neasy all-purpose\nbarbecue rub\n, divided (see notes)\n1 1/2\npounds\n(\n700\ng\n)\nboneless pork shoulder\n, cut into 1-inch cubes\n4\nteaspoons\n(\n12\ng)\nDiamond Crystal\nkosher salt\n; if using table salt, use half as much by volume or same weight\n1\ntablespoon\n(\n15\ng\n)\ngranulated sugar\n1\nrecipe\neasy all-purpose barbecue sauce\n1\nrecipe\ncemita buns\n, split open (see notes)\n1\nrecipe\nquick dill pickles\n(see notes)\n1/2\nsmall\nwhite onion\n, thinly sliced\nDirections\nFor Smoking the Ribs:\nPlace ribs, bone side up, on a cutting board. Using paper towels to grip, pull the transparent membrane off the bones. It should come off easily in one large strip (see photo for reference). Rub ribs generously on all surfaces with barbecue rub, then split them into 4- to 5-rib sections with a sharp chef's knife or boning knife. Transfer to a covered container and refrigerate for at least 4 hours and up to overnight.\nSerious Eats / Jen Causey\nMeanwhile, in a large bowl, combine pork shoulder, salt, and sugar and toss to coat. Transfer to a zipper-lock bag and refrigerate for at least 4 hours or up to overnight.\nSerious Eats / Michelle Yip\nOpen bottom vent of a charcoal grill completely.\nLight large charcoal chimney starter\nfilled 1/3 of the way with charcoal briquettes (about 2 quarts). When top coals are partially covered with ash, pour evenly over half of the bottom grill grate. Place a few wood chunks directly on top of charcoal. Set cooking grate in place, cover, and open lid vent completely. Heat until 275°F (135℃), about 5 minutes.\nClean and oil cooking grate\nthen arrange ribs, bone side down, on cooler side of grill. Cover, with vents over ribs. Smoke, covered, adjusting vents as needed and adding more coals as needed to maintain a grill temperature between 225°F to 275°F (105℃  to 135℃),  and adding a wood chunk every 45 minutes, until ribs show a gentle bend when you lift them and show only slight resistance when a toothpick is inserted between the bones and an instant read thermometer inserted in thickest portion registers between 190°F to 200°F, 4 to 5 hours.\nSerious Eats / Michelle Yip\nBrush tops and sides of ribs with barbecue sauce, cover, and continue smoking for 10 minutes. Repeat process 2 more times (about ½ cup sauce total), then transfer to a cutting board. Let cool slightly, about 15 minutes.\nSerious Eats / Jen Causey\nFor Making the McRib Patties:\nOnce cool enough to handle, twist bones out of ribs and discard bones. Roughly chop the meat. Spread on a large plate in a single layer and refrigerate until thoroughly chilled, about 2 hours.\nSerious Eats / Jen Causey\nIn a food processor, pulse 1/4 of the chilled rib meat with ¼ of the pork shoulder until roughly ground, about 12 pulses. Transfer to a large bowl and repeat the pulsing process with the rib meat and shoulder meat in 3 batches, keeping the meat refrigerated until ready to pulse. Toss the pulsed meat together with hands to evenly mix.\nSerious Eats / Jen Causey\nSet a double layer of parchment paper measuring 9-by 18-inches on work surface. Transfer meat mixture to the center of parchment paper. Cover mixture with parchment paper, then, using your hands over the parchment, spread mixture out to form a 9- by 18-inch rectangle.\nSerious Eats / Michelle Yip\nUsing a sharp chef's knife and cutting through the parchment paper, cut the large rectangle into 8 individual patties measuring 4 1/2 by 4 1/2 inches each. Slide the patties with the parchment to a rimmed baking sheet and refrigerate until ready to use. (Patties can be stacked with their parchment paper intact and stored in the refrigerator for up to 3 days, or in a freezer bag in the freezer for several months. If freezing, cook directly from frozen.)\nSerious Eats / Jen Causey\nOpen bottom vent of charcoal grill completely. Light large charcoal chimney starter filled with charcoal briquettes (6 quarts). When top coals are partially covered with ash, pour evenly over bottom grill grate. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot, about 500°F (260℃), about 5 minutes. Cover and allow to preheat for 5 minutes.\nClean and oil cooking grate. Transfer prepared patties to grill and sprinkle with remaining spice rub. Cook, flipping once halfway through, until well charred, about 2 minutes per side. Brush patties with barbecue sauce (about 1 cup sauce total), cover, and cook until patties are cooked through and barbecue sauce forms a lacquered glaze, 1 to 2 minutes. remove from grill and transfer to plate. Toast cut sides on grill until golden brown, 1 to 2 minutes.\nSerious Eats / Jen Causey\nFor Assembling the Sandwiches:\nPlace one patty on each bun bottom. Brush with remaining sauce, and top with pickles, onion, and bun top. Serve.\nSerious Eats / Michelle Yip\nSpecial Equipment\nCharcoal grill\n, charcoal briquettes, hickory or mesquite wood chunks,\nfood processor\n,\nrimmed baking sheet\n,\nparchment paper\nNotes\nYou can use your favorite store-bought or homemade barbecue sauce, rub, pickles, and buns in place of the suggested recipes, if you desire.\nIf making your own buns, follow the recipe for\ncemita buns\n, omitting the sesame seeds and dividing the dough into 8 buns instead of 6 before baking.\nThe ribs can also be cooked sous vide instead of 100% on the barbecue. For sous vide ribs, follow the recipe through the end of step 2. Instead of steps 3, 4, and 5, follow steps 4, 5, 6, and 10 in\nthis recipe\n, omitting the liquid smoke, then continue starting from step 6 in this recipe.\nMake-Ahead and Storage\nRib patties can be stacked with their parchment paper intact and stored in the refrigerator for up to 3 days, or in a freezer bag in the freezer for several months. If freezing, cook directly from frozen.\nRead More\nCopycat Shamrock Shake\nAir-Fryer Bake and Shake \"Doritos\"\nHomemade Chick-fil-A Sandwiches\nHomemade McDonald's-Style Eggnog Shake\nSandwiches\nGrilling\nPork\nPork Mains\nSummer Mains"
}