{
  "url": "https://www.seriouseats.com/ultimate-beef-stroganof-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Z16YKiURjKl0N6J_Mgy03eJHYX0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__12__20150110-beef-stroganoff-food-lab-28-c02205e4bcc64a1bb5c92c6e3262dc76.jpg",
  "tags": [
    "Beef Mains",
    "Braised & Stewed Beef",
    "Tenderloin Steak",
    "Egg Noodles",
    "Winter Mains"
  ],
  "title": "The Ultimate Beef Stroganoff Recipe",
  "full_text": "The Ultimate Beef Stroganoff Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n45 mins\nActive\n45 mins\nTotal\n55 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\n(0.25 ounce) packets\nunflavored powdered gelatin\n(about\n5\nteaspoons\n)\n2\ncups\n(\n475\nml\n)\nhomemade\nor store-bought\nlow-sodium chicken stock\nKosher salt\nand freshly ground black pepper\n2\ntablespoons\n(\n6\ng\n)\nmild paprika\n4\n(1 1/2- to 2-inch thick)\nbeef tenderloin steaks\n,\n6 to 8 ounces\neach (see note)\n3\ntablespoons\n(\n45\nml\n) canola or\nvegetable oil\n12\nounces\n(\n340\ng\n)\nbutton mushrooms\n, quartered\n8\nounces\n(\n225\ng\n)\npeeled pearl onions\n(about\n24\nonions\n, see note)\n3\ntablespoons\n(\n45\ng\n)\nunsalted butter\n, divided\n1\nmedium\nshallot\n, thinly sliced (about\n1/4\ncup\n)\n4\nsprigs\nfresh thyme\n1\nteaspoon\nsoy sauce\n2\nteaspoons\nWorcestershire sauce\n1\nteaspoon\nAsian fish sauce\n2\nteaspoons\nDijon mustard\n1\ncup\n(\n235\nml\n)\ndry white wine\n1\ncup\n(\n225\ng\n)\nsour cream\n, plus more for serving\n1\npound\n(\n455\ng\n) dried\negg noodles\n1/4\ncup\n(\n20\ng\n) minced\nfresh parsley\nleaves\nDirections\nSprinkle gelatin over chicken stock in a small bowl or liquid measuring cup. Set aside. Bring a large pot of salted water to a boil.\nSerious Eats / J. Kenji López-Alt\nCombine 1 tablespoon salt, 1 teaspoon pepper, and half of paprika in a small bowl. Season steaks generously on all sides with mixture (you may not need all the mixture) and press with the flat of your hand to adhere. Heat half of vegetable oil in a large skillet or sauté pan over high heat until lightly smoking. Add meat and cook, turning occasionally, until well-browned on both sides and center of steaks register 115°F (46°C) at the thickest part for rare or 125°F (52°C) for medium-rare. Remove from pan, transfer to a plate, and set aside.\nSerious Eats / J. Kenji López-Alt\nAdd remaining vegetable oil to the same pan and add the mushrooms. Return to medium heat and cook, stirring and tossing frequently, until mushrooms have released their liquid and are just starting to brown, about 8 minutes. Add 1 tablespoon butter and pearl onions and continue to cook, stirring, until onions and mushrooms are softened and well-browned, about 6 minutes longer.\nAdd shallots, thyme, and remaining paprika, and cook, stirring, until fragrant. Add soy sauce, Worcestershire sauce, fish sauce, and mustard and cook, stirring, until mostly evaporated, about 30 seconds. Add any collected juices from the plate with the meat, followed by white wine. Cook until reduced to just a few tablespoons.\nSerious Eats / J. Kenji López-Alt\nAdd broth/gelatin mixture and bring to a heavy simmer. Carefully pour off liquid into a heatproof cup or liquid measuring cup. Add sour cream to a medium bowl. Whisking constantly, slowly pour hot liquid over sour cream and whisk until fully homogeneous.\nSerious Eats / J. Kenji López-Alt\nReturn sour cream mixture to pan along with remaining 2 tablespoons butter. Bring to a boil over medium-high heat and season to taste with salt and pepper. Return steaks to pan until barely warmed through, about 1 minute. Remove from heat.\nSerious Eats / J. Kenji López-Alt\nCook noodles according to package directions. When cooked, drain and return to pot, reserving 1 cup of pasta cooking water. Transfer steaks to a cutting board and pour the sauce, mushrooms, and onions over the noodles. Stir to coat pasta, adding pasta cooking water as necessary until it reaches a loose, creamy consistency. Stir in half of minced parsley.\nThinly slice steaks. To serve, divide pasta and cream sauce evenly between 4 hot serving bowls. Top with sliced steak, spooning a little extra sauce over them. Add a dollop of sour cream, sprinkle with remaining parsley, and serve, advising guests to remove large thyme sprigs as they find them.\nNotes\nAny tender steak cut can be used in place of tenderloin. I recommend hanger steaks or flap meat (sometimes labeled sirloin tip in the Northeast). If using an alternative steak cut, I advise cooking to medium-rare instead of rare.\nFrozen pearl onions can be used in place of fresh, though\nfresh will have better flavor and texture\n. Peel pearl onions by trimming the ends, cutting a small X into the ends of each one, submerging in boiling water for 30 seconds, and peeling under cold running water. The skins will slip right off.\nWatch this video for details.\nBeef Mains\nBraised & Stewed Beef\nTenderloin Steak\nEgg Noodles\nWinter Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-ultimate-beef-stroganoff-recipe.webp?"
}