{
  "url": "https://www.seriouseats.com/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe",
  "image_url": "https://www.seriouseats.com/thmb/vICHAu16XWhAc-WLQV-7avihHKY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe-hero-2-7637732f8c174bc59f9b84e7b6e6b660.jpg",
  "tags": [
    "Snacks & Appetizers",
    "Fried Potatoes",
    "Cheddar Cheese",
    "Russet Potatoes"
  ],
  "title": "The Ultimate Poutine Recipe",
  "full_text": "The Ultimate Poutine Recipe\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n2 hrs\nSoaking Time\n60 mins\nTotal\n100 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Gravy (See Notes):\n1/4\ncup\nunsalted butter\n1/4\ncup\nall-purpose flour\n1\ntablespoon\nrice vinegar\nKosher salt\n3\ncups\nPressure Cooker Beef Stock\n(see notes)\nFor the Fries:\n4\nlarge\nrusset potatoes\n(about\n2\npounds\n), cut into 1/4-inch sticks on a\nmandoline\n2\nquarts\npeanut oil\n12\nounces\nfreshly made\nwhite cheddar cheese curds\n(preferably not more than 24 hours old), either store-bought or\nhomemade\n, at room temperature and broken into bite-size pieces\nDirections\nFor the Gravy:\nMelt butter in a medium saucepan over medium-high heat until foaming. Whisk in flour and cook, stirring constantly, until golden blonde, about 2 minutes. In a steady stream, gradually whisk in stock. Bring to a boil, reduce to a simmer, and cook until reduced to 2 cups, 10 to 15 minutes. Remove from heat, stir in vinegar, and season with salt.\nSerious Eats / Eric Kleinberg\nFor the Fries:\nPlace potatoes in a large bowl and cover completely with cold water. Let soak for at least 1 hour, or, alternatively, drain water and rinse again, changing water until it runs completely clear. Drain potatoes and dry thoroughly with paper towels.\nSerious Eats / Eric Kleinberg\nHeat oil in a large Dutch oven or wok to 350°F (177°C). Working in batches, add potatoes and cook, stirring and turning frequently until pale blonde, about 5 minutes. Transfer potatoes to a paper towel-lined baking sheet. (For crispiest fries, see note about adding a freezing step.)\nSerious Eats / Eric Kleinberg\nHeat oil to 425°F (218°C). Add potatoes and cook, stirring and turning frequently, until deep golden brown, about 3 minutes. Transfer to paper towel-lined bowl and season with salt to taste.\nSerious Eats / Eric Kleinberg\nReheat gravy over high heat until hot. Place fries in a shallow bowl or dish, top generously with cheese curds, and ladle on gravy. Sprinkle with minced chives (optional). Serve immediately.\nSerious Eats / Eric Kleinberg\nNotes\nIf you want to go all-out on the stock, replace the five pound beef bones called for in the linked beef stock recipe with a combination of oxtail, beef bones, veal bones, and chicken bones, and replace the water with chicken stock. If you don't have a pressure cooker, you can make the same stock in a large pot on the stovetop, simmering it uncovered for three hours and adding liquid as necessary to keep solid ingredients just barely covered.\nFor the crispiest fries, freeze the potatoes after Step 4 by spreading them on an unlined baking sheet (before frying them a second time), then fry from frozen.\nSpecial Equipment\nStock pot\n,\nDutch oven\nor\nwok\n,\npressure cooker\nSnacks & Appetizers\nFried Potatoes\nCheddar Cheese\nRusset Potatoes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-ultimate-poutine-recipe.webp?"
}