{
  "url": "https://www.seriouseats.com/ultra-smashed-cheeseburger-recipe-food-lab",
  "image_url": null,
  "tags": [
    "Burgers",
    "The Latest",
    "American",
    "Stovetop Beef",
    "Beef Mains"
  ],
  "title": "The Ultimate Smash Cheeseburger",
  "full_text": "The Ultimate Smash Cheeseburger\nJump to recipe\nPrep\n5 mins\nCook\n5 mins\nActive\n5 mins\nTotal\n10 mins\nServes\n1 serving\nCook Mode\n(Keep screen awake)\nIngredients\n1\nsoft hamburger roll\n, buttered and toasted\nCondiments\nand toppings as desired, such as mayonnaise, mustard, shredded lettuce, onions, tomatoes, and pickles\n4\nounces\n(\n110\ng\n)\nfreshly ground beef chuck\n, divided into\n2\n(\n2-ounce\n;\n55\ng\n)\nballs\nKosher salt and freshly ground black pepper\n1\nslice\ngood melting cheese, such as\nAmerican\n,\ncheddar\n, or\nhomemade melting cheese\nDirections\nPrepare burger bun by laying toppings on bottom half of bun. Have it nearby and ready for when your burger is cooked.\nPreheat a large stainless steel sauté pan or skillet over high heat for 2 minutes. Place balls of beef in pan and smash down with a stiff metal spatula, using a second spatula to add pressure. Smashed patties should be slightly wider than burger bun.\nSeason generously with salt and pepper and allow to cook until patties are well browned and tops are beginning to turn pale pink/gray in spots, about 45 seconds. Using a bench scraper or the back side of a stiff metal spatula, carefully scrape patties from pan, making sure to get all of the browned bits.\nFlip patties and immediately place a slice of cheese over 1 patty, then stack the second directly on top. Immediately remove from pan and transfer to waiting burger bun. Serve.\nSpecial Equipment\nLarge straight-sided stainless steel sauté pan\n,\nstiff metal spatula\n,\nmetal bench scraper\nNotes\nThese burgers cook very fast, so it's best to make them one at a time. If making multiple burgers, keep them warm under a tent of foil while preparing subsequent burgers.\nBurgers\nThe Latest\nAmerican\nStovetop Beef\nBeef Mains"
}