{
  "url": "https://www.seriouseats.com/ultra-tropical-pina-colada-recipe-11749519",
  "image_url": "https://www.seriouseats.com/thmb/InNDUNHFlz5nEjmsiAgTJZnK2c0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230906-SEA-PinaColada-TwoBites-05-f9bdbe04d71447cea1822fe11fdf703e.jpg",
  "tags": [
    "Cocktails",
    "Recipes",
    "Fruit",
    "Summer Drinks",
    "Pineapple"
  ],
  "title": "This Frozen Drink Tastes Like the Tropical Vacation We All Need",
  "full_text": "This Frozen Drink Tastes Like the Tropical Vacation We All Need\nClose\nJump to recipe\nPrep\n10 mins\nFreezing Time\n60 mins\nTotal\n70 mins\nServes\n1 serving\nCook Mode\n(Keep screen awake)\nIngredients\n5\nounces\n(\n140\ng\n) very ripe peeled and cored\nfresh pineapple\n, frozen pineapple, or drained canned pineapple chunks (see note)\n1 3/4\nounces\n(\n50\nml\n)\nunsweetened coconut cream\n, shaken or stirred well to incorporate fat\n1\nounce\n(\n30\nml\n)\nsimple syrup\n(see note)\n3/4 to 1\nounce\n(\n20 to 30\nml\n) fresh\njuice\nfrom\n1\nlime\n2 1/2\nounces\n(\n75\nml\n) white or gold\nrum\n, kept in freezer until freezer-cold\n4\nounces\n(\n115\ng\n)\nice\ncubes\nPineapple slice and/or\nmaraschino cherry\n, for garnish\nPaper umbrella\nand straw, for serving (optional)\nDirections\nIn an airtight plastic container, combine pineapple, coconut cream, simple syrup, and 3/4 ounce lime juice, and transfer to freezer until frozen, at least 1 hour (the sugar in the mixture may prevent it from freezing solid; this is okay).\nSerious Eats / Two Bites\nIn a blender, combine frozen pineapple mixture with ice-cold rum and ice and blend until thick and slushy. Taste, then blend in the remaining 1/4 ounce lime juice, if desired. Pour into a large glass, garnish with pineapple and/or a cherry, and serve, with or without a paper umbrella and straw.\nSerious Eats / Two Bites\nIf you want to make multiple drinks, you can pre-batch up to a double recipe (a blender may not hold much more than that easily) in a single container, then divide after blending; for more than 2 drinks, use separate containers to hold more servings.\nSerious Eats / Two Bites\nSpecial Equipment\nBlender\nNotes\nOnly use fresh pineapple if you can find a truly ripe and sweet fruit; otherwise frozen or canned will be better.\nTo make simple syrup, combine equal volumes of granulated sugar and water, then stir until the sugar is completely dissolved; extra simple syrup can be refrigerated in an airtight container for up to 1 month.\nMake-Ahead and Storage\nThe pre-batched frozen ingredients can be assembled and kept in the freezer up to 12 hours before serving.\nCocktails\nRecipes\nFruit\nSummer Drinks\nPineapple"
}