{
  "url": "https://www.seriouseats.com/ultra-crispy-slow-roasted-pork-shoulder-recipe",
  "image_url": null,
  "tags": [
    "Pork Shoulder",
    "Dairy-free Mains",
    "Gluten-free Mains",
    "Roasted Pork",
    "Pork Mains"
  ],
  "title": "Ultra-Crispy Slow-Roasted Pork Shoulder",
  "full_text": "Ultra-Crispy Slow-Roasted Pork Shoulder\nJump to recipe\nPrep\n5 mins\nCook\n8 hrs 20 mins\nActive\n10 mins\nResting Time\n30 mins\nTotal\n8 hrs 55 mins\nServes\n8\nto 12 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nbone-in\n, skin-on\npork shoulder\n,\n8 to 12\npounds\ntotal\nKosher salt\nand freshly ground black pepper\nDirections\nAdjust oven rack to middle position and preheat oven to 250°F (121°C).\nLine a rimmed baking sheet with heavy duty aluminum foil (see notes) and set a wire rack inside it. Place a piece of parchment paper on top of the wire rack. Season pork on all sides liberally with salt and pepper and place on parchment paper. Transfer to oven and roast until knife or fork inserted into side shows very little resistance when twisted, about 8 hours total.\nSerious Eats / Julia Estrada\nRemove pork from oven and tent with foil. Let rest at room temperature for at least 15 minutes and up to 2 hours. Increase oven to 500°F (260°C) and allow to preheat. Return pork to the oven and roast until skin is blistered and puffed, rotating every 5 minutes, about 20 minutes total. Remove from oven, tent with foil and allow to rest an additional 15 minutes. Serve by picking in the kitchen or just bring it to the table and let guests pick meat and crispy skin themselves, dipping into sauce of their choice on the side (see notes).\nSerious Eats / Julia Estrada\nSpecial Equipment\nRimmed baking sheet\n,\nwire rack\nNotes\nTo make a pan sauce, skip the aluminum foil when roasting; when the pork's finished, drain off and discard the excess fat and deglaze the rimmed baking sheet by heating it over a single burner and adding two cups of white wine, chicken stock, or a combination of both. Scrape up browned bits, transfer to a small saucepan, season to taste, and whisk in two tablespoons butter off heat.\nRead More\nThe Food Lab Redux: 7 Pork Dishes for the Holidays\nRoast a Pork Shoulder and Feast For Days\nSous Vide Barbecue Pulled Pork Shoulder\n15 Pulled Pork Recipes\nPork Shoulder\nDairy-free Mains\nGluten-free Mains\nRoasted Pork\nPork Mains"
}