{
  "url": "https://www.seriouseats.com/uovo-in-raviolo-runny-egg-yolk-ravioli-ricotta-recipe",
  "image_url": "https://www.seriouseats.com/thmb/ET1SOrO7_kivmMpMlYb0c_PRKpY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__03__20150225-egg-yolk-ravioli-primary-niki-achitoff-gray201-16c146ffde264f49a941b4b3ad19c776.jpg",
  "tags": [
    "Pasta Mains",
    "Italian",
    "Ricotta",
    "Eggs",
    "Pastas"
  ],
  "title": "Uovo in Raviolo (Runny Egg Yolk Ravioli) Recipe",
  "full_text": "Uovo in Raviolo (Runny Egg Yolk Ravioli) Recipe\nClose\nJump to recipe\nPrep\n45 mins\nCook\n20 mins\nActive\n30 mins\nTotal\n65 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Ravioli:\n5\nounces\nfresh ricotta cheese\n(see notes)\n1\nounce\nfreshly\ngrated Parmesan cheese\nPinch\nfreshly\ngrated nutmeg\n1/2\nteaspoon\nfresh juice\nfrom\n1\nlemon\nKosher salt and freshly ground black pepper\n1/2\nrecipe\nclassic fresh egg pasta\n10\nlarge\neggs\nFor the Pan Sauce:\n2\nounces\npancetta\n, roughly chopped, divided\n1\nmedium\nshallot\n, finely chopped, divided\n1/2\ncup\ndry white wine\n, divided\n4\ntablespoons\nunsalted butter\n, divided\n2\nteaspoons\nfresh juice\nfrom\n1\nlemon\n, divided\n1\ntablespoon\nfinely\nchopped parsley\n, for garnish\nDirections\nFor the Ravioli:\nLay a clean kitchen towel or a triple layer of lint-free paper towels on a rimmed baking sheet. Spread ricotta evenly over surface of towels. Top with a second clean kitchen towel or triple layer of paper towels. Press with hands or a second rimmed baking sheet and let stand until excess moisture has been absorbed, 5 minutes. Transfer ricotta to a medium bowl (it should come right off the towels).\nStir Parmesan cheese, nutmeg, and 1/2 teaspoon lemon juice into ricotta. Season to taste with salt and pepper. With a spoon, transfer filling into a pastry bag fitted with a 1/4-inch round tip or a zipper-lock bag with a 1/4-inch hole cut from a bottom corner. Refrigerate.\nMeanwhile, divide dough into 2 even sections. Working one section at a time, with remaining section tightly wrapped in plastic, roll dough through machine until sheet is just under 1/16 of an inch thick (typically second-to-last setting on roller). For a detailed description of this process, see steps 5 through 10 of our\nfresh pasta recipe\n. Cut sheet in half to create 2 pieces of dough roughly 15 inches long and 5 inches across.\nSerious Eats / Niki Achitoff-Gray\nLay dough sheets out on a lightly floured surface. Using a 3 1/2-inch round cookie cutter, cut out circles as close together as possible; you should have 10 rounds of dough from the 2 sheets (if you don't, re-roll dough scraps and cut more circles). Cover 5 of the dough rounds with a kitchen towel to keep moist and discard any remaining dough scraps.\nSerious Eats / Niki Achitoff-Gray\nUse pastry bag to gently squeeze out a ring of filling approximately 1 1/2 inches in diameter onto each of the 5 uncovered dough rounds. Then pipe a second ring directly on top of each of the first ones.\nSerious Eats / Niki Achitoff-Gray\nSerious Eats / Niki Achitoff-Gray\nWorking one at a time, separate 5 egg yolks from whites and gently slide yolk into center of ricotta fillings.\nSerious Eats / Niki Achitoff-Gray\nRemove towel from the other 5 dough rounds, and, working one at a time and using a pastry brush dipped in water, very lightly wet the edge of each dough round. Set dough rounds on top of each raviolo, moistened-side down. Slowly working your way around each raviolo, press and stretch the top dough rounds to make the edges meet with bottom dough rounds. Press down gently on each filling to remove air bubbles, being careful not to press on yolks themselves, then press edges to seal. Transfer ravioli to floured parchment paper, cover with kitchen towel, and repeat Steps 3 through 7 with remaining portion of dough.\nSerious Eats / Niki Achitoff-Gray\nFor the Pan Sauce:\nBring unsalted water to a boil in a large pot. Meanwhile, in 2 large sauté pans, heat half of pancetta in each over medium-high heat, stirring occasionally, until fat is rendered and pancetta is lightly browned, about 4 minutes. Using a slotted spoon, transfer pancetta to a plate. Add half of shallot to each pan and cook, stirring, for 30 seconds. Add half of wine to each pan and cook, scraping up any browned bits, until wine is almost completely evaporated, about 1 minute. Remove from heat and return pancetta to each pan.\nWhen water is boiling, gently slide ravioli into pot. Boil for 1 minute 30 seconds (ravioli will be slightly undercooked). Drain, reserving 1 cup pasta water. Meanwhile, return skillets pan to low heat and melt half of butter in each. Evenly divide lemon juice, pasta water, and ravioli between both skillets. Swirl pans gently to until sauce is emulsified, approximately 1 minute.\nTransfer 2 to 3 ravioli to each plate and spoon pan sauce on top. Sprinkle with parsley and serve.\nSerious Eats / Niki Achitoff-Gray\nSpecial Equipment\nPasta machine\n, 3 1/2-inch round\ncookie cutter\n, 2 large\nskillets\nNotes\nLook for a high-quality ricotta that contains no gums or stabilizers, such as Calabro. If stabilizer-free ricotta is not available, you can make your own using\nthis technique\n.\nBecause these ravioli are large, it is necessary to finish the dish using two skillets, dividing the pan sauce ingredients and ravioli between them.\nRead More\nHomemade Fresh Pasta Recipe\nHomemade Ricotta Ravioli Recipe\nHomemade Butternut Squash and Blue Cheese Ravioli With Sage Brown Butter Sauce\nHomemade Mushroom Tortellini Recipe\nThe Best Tools For Making, Cooking, and Serving Pasta\nTaste Test: The Best Ricotta Cheese\nPasta Mains\nItalian\nRicotta\nEggs\nPastas"
}