{
  "url": "https://www.seriouseats.com/vanilla-cookie-jam-ice-cream-sandwiches-recipe-8680504",
  "image_url": "https://www.seriouseats.com/thmb/VD4vKeKd5YdzesTa_v_JQuoueRc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240718-SEA-Easy-Summer-Fruit-Ice-Cream-Sandwiches-Lozano_3x2_156-6c3d6fadb2bb44f8bad0780ebec9d8ce.jpg",
  "tags": [
    "Ice Cream",
    "The Latest",
    "Summer Desserts",
    "Cookies"
  ],
  "title": "Easy Fruit-Swirl Ice Cream Sandwiches",
  "full_text": "Easy Fruit-Swirl Ice Cream Sandwiches\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nFreezing Time\n4 hrs 15 mins\nTotal\n4 hrs 40 mins\nServes\n12 Servings\nCook Mode\n(Keep screen awake)\nIngredients\nCooking spray\n2 1/2\ncups\n(\n320\ng\n)\nall-purpose flour\n1 1/4\nteaspoons\n(\n4\ng\n)  Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1\nteaspoon\n(\n4\ng\n)\nbaking soda\n1 3/4\ncup\nplus\n2\ntablespoons\n(\n375\ng\n)\ngranulated sugar\n, divided\n3/4\ncup\n(\n175\nml\n)\npeanut\n,\ngrapeseed\n,\ncanola\n, or other\nneutral oil\n1\ntablespoon\n(\n15\nml\n)\nvanilla extract\n2\nlarge\neggs\n1 1/2\nquarts\nhomemade or store-bought\nvanilla bean ice cream\n3/4\ncup\nfruit preserves\n, such as blackberry, peach, and/or strawberry-rhubarb (\n6\nounces\n,\n180\ng\n)\nDirections\nPrepare the Vanilla Cookie:\nPreheat oven to 350°F (175℃). Spray the bottom and sides of an 18- x 13-inch rimmed baking sheet with cooking spray. Line bottom with parchment paper. Also, line a 13- x 9-inch baking pan with parchment paper, so 2 inches overhang on the long edges. Set both aside.\nSerious Eats / Robby Lozano\nWhisk together flour, salt, and baking soda in a medium bowl. Whisk together 1 3/4 cups sugar, oil, vanilla, and eggs in a large bowl until smooth and glossy, about 30 seconds.\nSerious Eats / Robby Lozano\nAdd flour mixture to sugar mixture and stir until just combined, about 30 seconds.\nSerious Eats / Robby Lozano\nSpread cookie dough on prepared baking sheet, spreading with an offset spatula dipped into warm water just to the edges. Sprinkle evenly with remaining 2 tablespoons sugar.\nSerious Eats / Robby Lozano\nBake until lightly golden, puffed, and dry on top, about 10 minutes. Remove from oven and let cool 15 minutes at room temperature before placing in the freezer at least 15 minutes and up to 24 hours.\nSerious Eats / Robby Lozano\nPrepare the Sandwich:\nWhen ready to assemble the sandwiches, place ice cream in the fridge to soften, about 30 minutes. Remove cookie baking sheet from freezer. Run an offset spatula or knife around the edges of the cookie to loosen it and transfer  to a cutting board. Remove parchment and cut cookie in half crosswise to yield 2 (12- x 8 1/2-inch) rectangles. Flip both of the cookie halves sugared-side down. Using your hands, gently press down the edges of both cookies to help flatten the edges. Place one of the cookie halves sugared-side down in the prepared parchment-lined 13- x 9-inch baking pan. Once ice cream has softened, spread over the flipped cookie. Use a spoon or offset spatula to spread ice cream into an even layer, pushing into the corners of the pan (for best results with homemade ice cream, use it immediately after it's finished churning in your ice cream maker).\nSerious Eats / Robby Lozano\nDollop desired jam over ice cream and use a knife or long skewer to swirl it into a marbled pattern throughout ice cream.\nSerious Eats / Robby Lozano\nPlace the cookie sugared-side up on top of the ice cream. Freeze uncut ice cream sandwiches in the pan, covered with plastic wrap, until ice cream is frozen and firm, at least 4 hours or up to 1 month.\nSerious Eats / Robby Lozano\nOnce fully frozen and ready to cut, hold the overhanging parchment to gently lift the uncut ice cream sandwich from the pan. Transfer to a cutting board. Using a large chef's knife, cut it into 12 (4 1/4- x 2-inch) rectangles. Serve immediately or freeze the sandwiches in an airtight container.\nSerious Eats / Robby Lozano\nSpecial Equipment\n18- x 13-inch rimmed baking sheet, 13- x 9-inch baking pan, parchment paper, offset spatula\nNotes\nIf you would like to individually wrap the sandwiches, here's how to do it:\nTo make your own waxed foil, simply take a large sheet of tin foil, shiny side up, and use a pastry brush or paper towel to coat it lightly with a neutral oil like safflower oil or coconut oil.\nPress a similarly sized sheet of parchment paper against the oiled surface of the foil. Use your fingers to smooth the parchment down, pressing out any air bubbles. We recommend using a bench scraping for removing air bubbles. Cut the newly formed waxed foil into 7-inch squares with scissors or a safety knife such as an exacto. Repeat until you have 12 squares altogether. Set aside until needed.\nTo wrap the ice cream sandwiches, remove half of the ice cream sandwiches from the freezer. Place each on the center of the foil or parchment square. Wrap much like you would a present: Fold the long sides to the middle. Then at each edge, fold the short sides to the middle. Then fold the long sides. The foil will crease and stay in place without tape. Return to the freezer, and repeat with the other half.\nMake Ahead and Storage\nThe cookie sheet can be baked and frozen (through step 5) up to 1 month before proceeding with the rest of the recipe.\nStore leftover sandwiches in an airtight container for up to 1 month.\nIce Cream\nThe Latest\nSummer Desserts\nCookies",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/easy-fruit-swirl-ice-cream-sandwiches.webp?"
}