{
  "url": "https://www.seriouseats.com/vanilla-rice-pudding-5189760",
  "image_url": "https://www.seriouseats.com/thmb/a9g9ev0rRecDdIP0B6Yc8Rb1ovE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210623-rice-pudding-debbie-wee-seriouseats-1-3-ae3d6e434d514e39b6d6adce2334340e.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "White Rice",
    "Milk",
    "Dairy Milk",
    "The Latest"
  ],
  "title": "Vanilla Rice Pudding",
  "full_text": "Vanilla Rice Pudding\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nTotal\n65 mins\nServes\n8 servings\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n3 1/2\nounces\n(\n1/2\ncup\n;\n100\ng\n)\nsugar\n1/2\nvanilla\nbean\n, split and seeds scraped (see note)\n4\ncups\n(\n950\nml\n)\nwhole milk\n, plus extra to adjust consistency (see note)\n7\nounces\n(\n1 1/3\ncups\n;\n200\ng\n)\ncooked\nlong- or medium-grain\nwhite rice\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nAdd-ins\nand flavorings, as desired (see \"Suggested Variations\" section above for tips and instructions)\nDirections\nIn a small bowl, combine sugar and scraped vanilla seeds (reserve remaining vanilla pods for another use), and rub sugar between fingertips to disperse vanilla seeds. Sift mixture into 3-quart saucepan to remove any fibrous remnants from the scraped vanilla pod. Add milk and whisk until sugar is dissolved. Stir in rice and salt.\nDebbie Wee\nBring mixture to a boil over medium-high heat, then immediately lower heat to simmer. Cook, stirring and scraping bottom and sides of pot every few minutes with a rubber spatula to prevent sticking and scorching, adjusting heat as needed to maintain gentle bubbling, until mixture begins to thicken, about 45 minutes. Continue cooking, stirring every minute, until rice pudding thickens to the consistency of yogurt and coats the back of a wooden spoon, about 10 minutes longer. Remove from heat.\nDebbie Wee\nIf serving warm:\nDivide rice pudding between individual serving bowls, and serve.\nIf serving cold:\nIn a large bowl, set up an ice bath by partially filling it with a combination of cold water and ice. Transfer rice pudding to a medium bowl, and set bowl inside prepared ice bath. Allow to cool to room temperature, stirring occasionally with a rubber spatula, about 30 minutes, then refrigerate pudding until completely chilled, about 2 hours (discard ice bath). When ready to serve, whisk or stir pudding until smooth, adjusting consistency as needed with up to 1/4 cup (60ml) extra milk. Serve.\nDebbie Wee\nSpecial Equipment\n3-quart saucepan\nNotes\nIf you don't have whole vanilla beans available, you can add 1/4 to 1/2 teaspoon\nvanilla extract\n(or to taste) at the end of cooking. For more on flavorings, see the Add-Ins section above.\nYou can use long- or medium-grain rice. If using medium-grain rice, the texture will be slightly thicker.\nTo make coconut rice pudding, substitute 1 cup of coconut milk for 1 cup of milk in recipe.\nMake-Ahead and Storage\nPudding can be cooked, cooled, and refrigerated for up to one week.\nCustards, Mousses & Puddings\nWhite Rice\nMilk\nDairy Milk\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/vanilla-rice-pudding.webp?"
}