{
  "url": "https://www.seriouseats.com/varenyky-recipe-8695992",
  "image_url": "https://www.seriouseats.com/thmb/UUM_LSNgJSt975DsRzplfHDhhoo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240813-Varenyky-Larisa-Niedle-24-63b32befaeda4cfa9aaa0d11aa8ede92.jpg",
  "tags": [
    "Cottage Cheese",
    "The Latest",
    "Vegetarian",
    "Eastern European"
  ],
  "title": "Ukrainian Varenyky",
  "full_text": "Ukrainian Varenyky\nClose\nJump to recipe\nPrep\n45 mins\nCook\n15 mins\nStraining Time\n12 hrs\nTotal\n13 hrs\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Filling:\n350g (\n12 1/2\nounces\n)\ncottage cheese\n1\nlarge\negg yolk\n1/4 teaspoon Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\nFor the Dough:\n285\ng\nall-purpose flour\n(10 ounces; about 2 1/4 cups), divided, plus more for dusting\n1/2\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n56\ng\nunsalted butter\n(about 2 ounces; 4 tablespoons), cut into 1-inch cubes, and softened to 65ºF or 18ºC\n1\nlarge\negg\n, lightly beaten\n1\ntablespoon\n(15ml)\nsour cream\n1/3\ncup\n(70ml)\nwater\n, room temperature\nTo Assemble and Serve:\n2\ntablespoons\n(20g) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n28\ng\nunsalted butter\n(about 1 ounce; 2 tablespoons), softened and cut into 4 pieces\nSour cream\nor crème fraîche, for serving\nSmall handful chopped\ndill\n, for serving (optional)\nDirections\nFor the Filling:\nLine a fine-mesh strainer with 4 layers of cheesecloth and set in a large mixing bowl. Place cottage cheese on cheesecloth and fold over and cover with overhanging cheesecloth. Place a heavy weight, such as a 28-ounce can tomatoes, on top. Refrigerate until cheese is slightly crumbly and no moisture remains, at least 24 hours or up to 48 hours.\nSerious Eats / Larisa Niedle\nUsing a wooden spoon or flexible spatula, press strained cottage cheese through a fine-mesh strainer set over a small bowl. In a separate small bowl, combine 300g (10 1/2 ounces) of the strained cottage cheese with egg yolk and salt. Using a flexible spatula, mix until no streaks of yolk remain. Refrigerate until chilled and firm, at least 30 minutes.\nSerious Eats / Larisa Niedle\nFor the Dough:\nIn a medium bowl, whisk 210g flour and salt to combine. Add butter, and use your fingers to press the butter into flour until you have a crumbly mixture and butter is fully incorporated into flour, about 1 minute. Using your fingers, make a well in the center of the mixture. Add egg, sour cream, and water, and, using a fork, mix until a shaggy dough forms. Dust a clean work surface with remaining 75g flour. Gently knead dough to gradually incorporate flour, until dough is soft, smooth, and all the flour has been incorporated, about 5 minutes. Return dough to medium bowl. Cover bowl tightly with plastic wrap and rest at room temperature until dough is soft and supple, about 20 minutes.\nSerious Eats / Larisa Niedle\nFor Shaping and Cooking:\nOnce dough has rested,\nturn out\nonto a lightly floured work surface. Using a rolling pin, roll dough into a roughly 19-inch circle about 1/16-inch to 1/8-inch thick. Using a 3-inch cookie cutter (or a glass), punch out 25 rounds of dough. Cover dough with a clean kitchen towel and rest for 10 minutes. Meanwhile, line a rimmed baking sheet with parchment, dust lightly with flour; set aside.\nSerious Eats / Larisa Niedle\nTo Fill the Dumplings:\nPlace half a tablespoon (11g) of filling in the center of each dough round. Working with one dough round at a time, fold dough over the filling to form a half-moon while distributing filling to fit within it, and firmly pinch edges to seal. Transfer the cheese dumplings to prepared baking sheet. Repeat with remaining dough and filling. You should have 25 dumplings.\nSerious Eats / Larisa Niedle\nTo Cook the Dumplings:\nIn a 6-quart pot, bring 4 quarts (3.8 liters) of water to a boil.  Salt boiling water with 2 tablespoons (about 3/4 ounces; 20g) kosher salt. Carefully add half of the dumplings to boiling water, gently stirring with a spatula or wooden spoon to prevent the dumplings from sticking to the bottom of the pot, and cook until dumplings float, about 2 minutes. Once floating, cook for 1 more minute to ensure the dough and filling are heated through. Using a spider skimmer, transfer the varenyky, shaking off excess water as needed, to a large bowl with 2 tablespoons (28g) butter. Gently toss to evenly coat varenyky. Repeat with remaining dumplings.\nSerious Eats / Larisa Niedle\nServe cheese varenyk with a dollop of cold sour cream and chopped dill.\nSerious Eats / Larisa Niedle\nSpecial Equipment\nFine-mesh strainer, cheesecloth, rolling pin, 3-inch cookie cutter or glass, 2 rimmed baking sheets, 6-quart pot, spider skimmer or large slotted spoon\nNotes\nThe fillings are easier to use cold and should be used straight out of the fridge. Do not let them warm up before using.\nThe recipe can easily be doubled if desired.\nTo prevent the dumplings from drying out as you fill and shape them, keep shaped varenyky covered with plastic wrap or a lightly damped kitchen towel so they don’t dry out.\nDressing varenyky in butter will prevent the dumplings from sticking and drying out.\nMake-Ahead and Storage\nThe cottage cheese can be strained to 2 days in advance and refrigerated in an airtight container. The cottage cheese filling can be made up to 24 hours in advance and refrigerated in an airtight container.\nShaped, uncooked varenyky can be frozen for up to 1 month. To freeze dumplings, place shaped varenyky on a rimmed baking sheet lined with parchment. Wrap baking sheet tightly with plastic. When dumplings are frozen, transfer them to a zip-top bag or airtight container.\nCottage Cheese\nThe Latest\nVegetarian\nEastern European",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/ukrainian-varenyky.webp?"
}