{
  "url": "https://www.seriouseats.com/veal-and-peppers-sear-braise-recipe",
  "image_url": "https://www.seriouseats.com/thmb/NvDnQJ5TME95EZqEntdxObDQApY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100219vealandpeppers-973538a4000d4f25a5308f09ffe3cfa1.jpg",
  "tags": [
    "Beef Mains"
  ],
  "title": "Veal and Peppers Recipe | Cook the Book",
  "full_text": "Veal and Peppers Recipe | Cook the Book\nClose\nJump to recipe\nCook\n95 mins\nTotal\n95 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nAbout\n5 1/2\ntablespoons\nextra-virgin olive oil\n3\ngarlic\ncloves\n, peeled and crushed\n5\nfresh sage leaves\nplus\n1\ntablespoon\nfinely chopped\nsage\n1 1/2\npounds\nboneless veal stew meat\nKosher salt\nand freshly ground black pepper\n3/4\ncup\ndry white wine\n1\ntablespoon\ntomato paste\nAbout\n3/4\ncup\nchicken broth\nor water\n2\ncups diced\nred or\nyellow peppers\n2\ncups\ndiced onions\n1\ntablespoon\nfinely chopped\nfresh rosemary\nDirections\nCombine 3 1/2 tablespoons oil, the garlic, and 5 sage leaves in a large skillet. Heat over high heat. When the garlic and sage begin to brown, about 5 minutes, remove them from the pan and reserve.\nWhile the oil heats, dry the meat on paper towels. Season the meat with salt and pepper and add about half of it to the pan. Cook, turning the meat, until it is browned on all sides, about 7 minutes. Transfer the meat to a bowl with a slotted spoon and brown the second batch.\nReturn the browned veal and reserved sage and garlic to the skillet. Add the wine and deglaze the pan, scraping up the fond (browned bits) as the wine simmers and reduces.\nWhen the pan is almost dry, add the tomato paste. Stir to coat the meat with the tomato. Cook for a couple of minutes, then add 1/2 cup broth. Reduce the heat, partially cover the pan, and simmer gently until the meat is almost tender, about 1 hour, adding more broth from time to time to prevent the pan from getting too dry.\nMeanwhile, heat a skim of oil, about 2 tablespoons, over high heat in another skillet. Add the peppers and onions, season with salt and pepper, and cook, stirring frequently, until the vegetables begin to soften and caramelize, about 7 minutes. Remove the peppers and onions from the heat.\nBeef Mains"
}