{
  "url": "https://www.seriouseats.com/veal-saltimbocca-roman-sauteed-cutlet-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LhSSr6DQLzbmKecPJqBISlAFBqQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20161212-veal-saltimbocca-vicky-wasik-27-3d92a49e41bf4c62be447f60fe061daa.jpg",
  "tags": [
    "Veal",
    "Italian",
    "Stovetop Beef",
    "Quick Dinners"
  ],
  "title": "Veal Saltimbocca (Roman Sautéed Veal Cutlets With Prosciutto and Sage) Recipe",
  "full_text": "Veal Saltimbocca (Roman Sautéed Veal Cutlets With Prosciutto and Sage) Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n35 mins\nTotal\n35 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n8\nveal\ncutlets\n(about\n1\npound\n;\n450\ng\n)\nKosher salt\nand freshly ground black pepper\n1\nbunch\nfresh sage\n, divided (about\n1/4\nounce\n;\n7\ng\n)\n8\nlarge\n, thin slices\nprosciutto\n(about\n1/4\npound\n;\n115\ng\n)\nCornstarch\n, for dredging (about\n1/2\ncup\n)\n3\ntablespoons\n(\n45\nml\n)\nextra-virgin olive oil\n, divided\n2\ntablespoons\n(\n30\ng\n)\nunsalted butter\n1/3\ncup\n(\n80\nml\n)\ndry white wine\nFresh juice\nfrom\n1\nlemon\n, to taste\n1\nteaspoon\nsoy sauce (\n5\nml\n), preferably usukuchi (\nlight soy sauce\n) (optional; see note)\nDirections\nArrange cutlets on a work surface, cover with a sheet or two of plastic wrap, and pound each with a meat pounder or the bottom of a small heavy saucepan or skillet until no more than 1/4-inch thick throughout. Season lightly on one side only with salt and pepper.\nSerious Eats / Vicky Wasik\nFlip veal cutlets so that the salted side is down. Pick eight of the largest sage leaves from your bunch and lay one in the center of each cutlet; if the sage leaves are small, use two per cutlet.\nLay a slice of prosciutto on top of each cutlet, sandwiching the sage leaves flat between them. Using two wooden toothpicks per cutlet, fasten the prosciutto to the cutlets (the easiest way to do this is to push the toothpicks down through the prosciutto and just into the veal, then back up through the prosciutto again, much like fastening them together with a safety pin).\nSerious Eats / Vicky Wasik\nPour about 1/2 cup of cornstarch into a wide, shallow bowl. Dredge the underside of each prosciutto-topped cutlet in the cornstarch, shaking off the excess.\nIn a large skillet or sauté pan, heat 2 tablespoons olive oil over high heat until shimmering. Add 4 of the cutlets, prosciutto-side up, and cook, swirling the pan occasionally, until the cutlets are lightly browned on the bottom and the last traces of pink are visible on top at the edges. Using a thin metal spatula, flip all of the cutlets prosciutto-side down, then flip them back immediately. Transfer to a clean platter. Lower heat at any time while cooking the cutlets to prevent burning.\nSerious Eats / Vicky Wasik\nAdd remaining 1 tablespoon olive oil to the skillet. Add remaining 4 veal cutlets and repeat as in Step 5, then transfer to the platter.\nLower heat to medium-low and add butter and a few sprigs of sage to the skillet and cook until butter is melted. Add white wine. Bring to a simmer over medium heat, stirring and scraping up any browned bits, then continue to cook, stirring and swirling constantly, until sauce is emulsified and slightly thickened (exact time can vary significantly depending on your skillet size and burner power; increase the heat at any time if it seems to be taking too long, or lower the heat if it's reducing too quickly).\nSerious Eats / Vicky Wasik\nSeason with salt and pepper, then stir in 1 teaspoon of lemon juice. Taste and add another teaspoon (or more) of lemon juice, if desired. Stir in soy sauce, if using. If the sauce breaks at any point, whisk in a tablespoon or two of water to bring it back together. Discard sage sprigs. Pour sauce all over veal cutlets and serve right away.\nSpecial Equipment\nWooden toothpicks,\nmeat pounder\nor small heavy saucepan or skillet, plastic wrap\nNotes\nSoy sauce is not traditional but it adds amazing depth and complexity to the pan sauce. If you have usukuchi (light) soy sauce, use that; it's saltier and less malty than regular dark soy, so it blends into the sauce excellently. If not, dark soy also works.\nRead More\nVeal Milanese with Arugula Salad\nGrilled Chicken and Peach Saltimbocca Skewers\nPork, Salt, Air, and Time: The Long Road to Prosciutto di Parma\nVeal\nItalian\nStovetop Beef\nQuick Dinners",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/veal-saltimbocca-roman-sauted-veal-cutlets-with-prosciutto-and-sage-recipe.webp?"
}