{
  "url": "https://www.seriouseats.com/vegan-crispy-potato-onion-mushroom-rosti-roesti-recipe",
  "image_url": "https://www.seriouseats.com/thmb/-FwgbAgm7yZftwDRWnj2dyC_opQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__20120129-rosti-1-14c16fdc34fd499fb7c5feb42f36b959.jpg",
  "tags": [
    "Dairy-free Breakfast & Brunch",
    "Gluten-free Breakfast & Brunch",
    "Vegan Breakfast & Brunch",
    "Vegetarian Breakfast & Brunch",
    "Stovetop Vegetables"
  ],
  "title": "Crispy Potato, Onion, and Mushroom Rösti Recipe",
  "full_text": "Crispy Potato, Onion, and Mushroom Rösti Recipe\nClose\nJump to recipe\nCook\n35 mins\nActive\n30 mins\nTotal\n35 mins\nServes\n2\nto 3 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\nmedium\nrusset potatoes\n(about\n1\npound\n;\n450\ng\n), rinsed and cut into 1/16-inch matchsticks or grated (see notes)\n5\ntablespoons\n(\n75\nml\n)\nolive oil\n1\nmedium\nonion\n, finely sliced (about\n1\ncup\n)\n4\nounces\n(\n115\ng\n)\nbutton mushrooms\n, finely sliced\n2\ncloves\ngarlic\n, grated on a Microplane grater\n1\nteaspoon\npicked\nfresh thyme leaves\nKosher salt\nand freshly ground black pepper\nDirections\nSpread potatoes on a large microwave-safe plate and microwave on high heat until hot all the way through and softened but still slightly crunchy, about 5 minutes.\nMeanwhile, heat 1 tablespoon (15ml) oil in a 10-inch well-seasoned cast iron or nonstick skillet over medium-high heat until shimmering. Add onion and mushrooms and cook, stirring and tossing occasionally, until softened and starting to brown, about 8 minutes. Add garlic and thyme and cook, stirring frequently, until fragrant, about 30 seconds. Season to taste with salt and pepper. Transfer to a small bowl and wipe out skillet.\nHeat 2 tablespoons (30ml) oil in skillet over medium heat until shimmering. Add half of potatoes and press into bottom of pan with a rubber spatula. Season with salt and pepper. Spread onion/mushroom mixture evenly over potatoes and top with remaining potatoes. Press down into an even disk shape using a rubber spatula. Season top with salt and pepper.\nCook, swirling and shaking pan occasionally, until deep golden brown and crisp on the first side, about 7 minutes. Carefully slide rösti onto a large plate. Set another plate on top of it upside down, grip the edges, and invert the whole thing so the rösti is now cooked side up. Heat remaining 2 tablespoons (30ml) oil in skillet and slide rösti back in. Continue cooking, swirling and shaking pan occasionally, until deep golden brown and crisp on the second side, about 7 minutes longer. Slide rösti onto a cutting board. Serve immediately with a side of\nvegan aioli\n.\nSpecial equipment\nMandoline with a 1/16-inch matchstick plate,\nfood processor\n, or box grater (see note); Microplane grater; 10-inch\ncast iron\nor nonstick skillet\nNotes\nFor best results, cut potatoes into 1/16-inch matchsticks by hand or on a mandoline. If you don't have one, the large shredding disk of a\nfood processor\nor large holes of a box grater will do fine.\nThis Recipe Appears In\nVegan Brunch: Crispy Potato, Onion, and Mushroom Rösti\nDairy-free Breakfast & Brunch\nGluten-free Breakfast & Brunch\nVegan Breakfast & Brunch\nVegetarian Breakfast & Brunch\nStovetop Vegetables"
}