{
  "url": "https://www.seriouseats.com/vegan-experience-crispy-tofu-broccoli-stir-fry",
  "image_url": null,
  "tags": [
    "Tofu Stir-fry",
    "Chinese",
    "Dairy-free Mains",
    "Vegan Mains",
    "Stovetop"
  ],
  "title": "How to Make Crispy Tofu (for Stir Fry)",
  "full_text": "How to Make Crispy Tofu (for Stir Fry)\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nActive\n30 mins\nTotal\n20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\nquarts\nvegetable or\npeanut oil\n1/2\ncup\nplus\n2\nteaspoons\ncornstarch\n, divided\n1/2\ncup\nall-purpose flour\n1/2\nteaspoon\nbaking powder\nKosher salt\n1/2\ncup\ncold\nwater\n1/2\ncup\nvodka\n1\npound\nextra-firm tofu\n, cut into 1/2- by 2- by 1-inch slabs, carefully dried (see note)\n1\npound\nbroccoli\n, cut into 1-inch florets\n1/4\ncup\nShaoxing wine\nor dry sherry\n1/4\ncup\nhomemade\nor store-bought\nlow-sodium vegetable stock\n2\ntablespoons\nsoy sauce\n1\ntablespoon\nfermented black bean sauce\n2\ntablespoons\nsugar\n1\ntablespoon\ntoasted sesame oil\n2\n(1-inch)\nsegments lemon peel, plus\n2\nteaspoons\nlemon juice\n4\ncloves\ngarlic\n, minced (about\n4\nteaspoons\n)\n1\ntablespoon\nminced or grated\nfresh ginger\n6\nscallions\n, white and light green parts only, finely chopped\n2\ntablespoons\ntoasted sesame seeds\n, divided\nDirections\nHeat oil in a wok to 350°F. Whisk together 1/2 cup cornstarch, flour, baking powder, and 1 teaspoon kosher salt. Add water and vodka and whisk until a smooth batter is formed, adding up to 2 tablespoons additional water if batter is too thick. It should have the consistency of thin paint and fall off of the whisk in thin ribbons that instantly disappear as they hit the surface of the batter in the bowl.\nAdd tofu slices and carefully turn to coat. Working one at a time, lift one piece and allow excess batter to drip off. Carefully lower into hot oil. Repeat with remaining tofu until wok is full. Fry, using a metal spider or slotted spatula to rotate and agitate pieces as they cook until evenly pale golden and crisp all over, about 6 minutes. Transfer to a paper towel-lined plate. Repeat until all tofu is fried. Carefully pour all but 1 tablespoon oil out of wok and reserve for another use.\nSerious Eats / J. Kenji López-Alt\nCombine wine, stock, soy sauce, bean sauce, sugar, sesame oil, lemon peel and juice, and remaining 2 teaspoons corn starch in a small bowl and whisk to combine. Set aside.\nReturn wok to high heat until lightly smoking. Add broccoli and cook, stirring and tossing frequently, until lightly charred on several sides but still firm. Add garlic, ginger, and scallions and cook, tossing constantly, until fragrant, about 30 seconds. Transfer broccoli and aromatics to a bowl.\nSerious Eats / J. Kenji López-Alt\nReturn skillet to high heat. Give the sauce mixture a quick whisk, then pour it into the wok. Cook, stirring, until thick and glossy, about 30 seconds. Return broccoli and tofu to pan. Add 1 tablespoon sesame seeds. Remove from heat. Turn with a wide spatula until all pieces are evenly coated. Season to taste with more salt as desired. Transfer to a serving platter, sprinkle with remaining sesame seeds, and serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nWok\nNotes\nTo dry tofu, line a rimmed baking sheet with paper towels. Place tofu slices on top in a single layer. Cover with another layer of paper towels and press gently to remove excess moisture.\nTofu Stir-fry\nChinese\nDairy-free Mains\nVegan Mains\nStovetop"
}