{
  "url": "https://www.seriouseats.com/vegan-chilaquiles-with-pepitas-charred-corn-and-black-beans",
  "image_url": "https://www.seriouseats.com/thmb/WzD4tB3lAheLYMRNksJUgWvOROE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__20110116-chilaquiles-pumpkin-seed-salsa-verde-1-73f62c933b2b4f3a9ff9e1737f2ef63d.jpg",
  "tags": [
    "Mexican",
    "Dairy-free Breakfast & Brunch",
    "Vegan Breakfast & Brunch",
    "Black Beans",
    "Tomatillo"
  ],
  "title": "Chilaquiles With Pepitas, Charred Corn, and Black Beans Recipe",
  "full_text": "Chilaquiles With Pepitas, Charred Corn, and Black Beans Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n45 mins\nActive\n30 mins\nTotal\n50 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\npounds\ntomatillos\n, peeled and cut in half\n6\ncloves garlic\n1\nsmall\nonion\n, roughly chopped\n1\nserrano or\njalapeno pepper\nKosher salt\n1\ntablespoon\nvegetable oil\n1\near\ncorn\n, kernels removed\n12\nounces\ncorn tortilla chips\n1\ncup\ncanned black beans\n(about\n1/2\nof a\n14-ounce can\n), drained and rinsed\n1\navocado\n, thinly sliced\n1\nsmall\nonion\n, thinly sliced, slices placed in a bowl of cold water for 10 minutes\n2\ntablespoons\nchopped cilantro\n1/2\ncup\ntoasted\npumpkin seeds\n(pepitas)\nDirections\nPreheat broiler to high. Place tomatillos, garlic, onion, and pepper on a foil-lined heavy-duty rimmed baking sheet. Broil without moving until well charred on top side, about 15 minutes. Flip vegetables with a spatula and continue broiling until well-charred and completely softened, about 15 minutes longer.\nTransfer vegetables to a food processor and process until roughly puréed. Season salsa verde to taste with kosher salt and set aside (see note).\nHeat oil in a medium skillet over high heat until smoking. Add corn kernels, toss to coat, and cook without moving until charred on one side. Toss and continue to cook, tossing occasionally until well charred all over, about 6 minutes total. Season to taste with kosher salt and transfer to a small bowl.\nHeat 1 1/2 cups salsa verde and 1 cup water in a large saucepan until simmering. Add tortilla chips and fold with a rubber spatula until all the chips are coated. Transfer chips to a large serving dish or individual serving plates. Top with charred corn, black beans, avocado slices, sliced onion, chopped cilantro, and toasted pumpkin seeds (see note). Serve immediately with a side of vegan refried beans if desired.\nSpecial Equipment\nRimmed baking sheet\n, aluminum foil,\nskillet\n, large saucepan,\nflexible spatula\nNotes\nPrep time can be significantly reduced if you use store-bought salsa verde. One 12-ounce jar is sufficient for this recipe. This recipe will produce more salsa verde than necessary. Extra salsa verde can be stored in the fridge in a sealed container for up to 1 week.\nThis recipe can easily be made vegetarian by adding a drizzle of Mexican crema, crumbled cotija cheese, or a fried egg.\nRead More\nVegan Migas (Mexican-Style Fried Tortillas With Tofu)\nThe Ultimate Fully Loaded Vegan Nachos\nChilaquiles con Rajas\nChilaquiles Verdes With Fried Eggs\nChorizo and Egg Chilaquiles With Salsa Verde\nMexican\nDairy-free Breakfast & Brunch\nVegan Breakfast & Brunch\nBlack Beans\nTomatillo"
}