{
  "url": "https://www.seriouseats.com/vegan-ramen-miso-creamy-vegan-vegetarian-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/S9t4IK0LnyJeXK3F9Is9C-JrDFM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150215-vegan-ramen-recipe-01-3fbc618f3cc845be81188529cf5bc2c3.jpg",
  "tags": [
    "Ramen",
    "Japanese",
    "Vegan Mains",
    "Maitake Mushrooms",
    "Noodle Mains"
  ],
  "title": "Ultimate Vegan Ramen With Miso Broth Recipe",
  "full_text": "Ultimate Vegan Ramen With Miso Broth Recipe\nClose\nJump to recipe\nPrep\n30 mins\nCook\n2 hrs 45 mins\nActive\n2 hrs\nTotal\n3 hrs 15 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Broth:\n1\nsmall\neggplant\n1\nmedium\nskin-on yellow onion\n, split in half\n2\nwhole heads\ngarlic\n1\n(\n4\n-\ninch\n)\nknob\nginger\n, cut into 1/4- to 1/2-inch slices lengthwise\n1\ntablespoon\n(\n15\nml\n)\nvegetable\nor\ncanola oil\n6\nounces\n(\n170\ng\n)\nfresh shiitake mushrooms\n, stems reserved and caps quartered and reserved for shiitake soy sauce (below)\n6\nounces\n(\n170\ng\n)\nmaitake\nor\nbeech mushrooms\n, stiff bottom stems reserved and caps and tender stems reserved for roasted mushroom and sweet potatoes (below)\n1\n(\n6\n-\ninch\n)\nsegment\nkombu\n(see notes)\n1/2\nounce\n(\n14\ng\n)\ndried porcini mushrooms\n1/2\nounce\n(\n14\ng\n)\ndried shiitake mushrooms\n6\nleaves\nnapa cabbage\n1\nleek\n, roughly chopped\n6\nscallions\n, roughly chopped\nFor the Roasted Sweet Potato and Mushroom Topping:\n1\nmedium\nsweet potato\n, cut into 1/2-inch dice\nCaps and tender stems from\nmaitake\nor\nbeech mushrooms\n(above)\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1\ntablespoon\nshichimi togarashi\n, plus more to serve (see notes)\nKosher salt\nFor the Shiitake-Soy Tare:\nQuartered caps from\nfresh shiitake mushrooms\n(above)\n1\n(\n6\n-\ninch\n)\nsegment\nkombu\n(see notes)\n1\n(\n4\n-\ninch\n)\nknob\nginger\n, cut into 1/4- to 1/2-inch slices lengthwise\n6\nscallions\n, very roughly chopped\n6\nmedium\ncloves garlic\n, unpeeled\n1/2\ncup\n(\n120\nml\n)\nsoy sauce\n1/2\ncup\n(\n120\nml\n)\nmirin\n(see notes)\nFor the Mushroom-Scallion Oil:\n1/2\nounce\n(\n14\ng\n)\ndried porcini mushrooms\n1/2\nounce\n(\n14\ng\n)\ndried shiitake mushrooms\n6\nscallions\n, very roughly chopped\n1/2\ncup\n(\n120\nml\n)\nvegetable\nor\ncanola oil\nFor the Charred Eggplant Topping:\n1\ntablespoon\ntoasted sesame seeds\nTo Finish:\n1/4\ncup\nwhite or yellow\nmiso paste\n3\ntablespoons\nJapanese sesame paste\nor\ntahini\n2\nmedium\ncloves garlic\n, finely minced\n4 to 6\nservings\nraw ramen noodles\n1\ncup\nvery thinly sliced scallions\nor\nTokyo negi\nDirections\nMake the Broth:\nAdjust rack to 4 to 6 inches below broiler element and preheat broiler to high. Toss eggplant, onion, garlic, and ginger with oil until coated on all surfaces. Transfer to a foil-lined broiler pan or rimmed baking sheet. Broil, turning vegetables occasionally until all vegetables are well charred on all surfaces and eggplant is completely tender (a knife inserted into it should meet no resistance around the stem or base). Remove from oven, lower rack to center position, and adjust oven temperature to 400°F (204°C). Wrap eggplant in aluminum foil and reserve for Charred Eggplant Topping.\nSerious Eats / J. Kenji López-Alt\nTransfer onions, ginger, and garlic to a large stock pot or Dutch oven. Add shiitake and maitake mushroom stems, kombu, dried porcinis, dried shiitakes, cabbage, leek, and scallions. Cover with water by 1 inch. Bring to a boil over high heat, reduce to a bare simmer, cover, and cook while making remaining toppings (about 1 1/2 hours).\nSerious Eats / J. Kenji López-Alt\nMeanwhile, make the Roasted Sweet Potato and Mushroom Topping:\nToss the sweet potato pieces and maitake or beech mushroom caps and tender stems in a large bowl with canola oil, togarashi, and a big pinch of salt. Transfer to a foil-lined rimmed baking sheet and roast until potatoes are tender and mushrooms and potato are browned around their edges, about 25 minutes. Remove from oven and let cool.\nSerious Eats / J. Kenji López-Alt\nFor the Shiitake-Soy Tare:\nCombine shiitake mushroom caps, kombu, ginger, scallions, garlic, soy sauce, and mirin in a small saucepan. Bring to a bare simmer, cover, and cook, stirring occasionally, until liquid is reduced by about half and mushrooms are very tender and flavorful, about 30 minutes. Discard kombu, ginger, scallions, and garlic. Strain mushrooms through a fine mesh strainer set in a liquid measuring cup. Reserve mushrooms and cooking liquid separately.\nSerious Eats / J. Kenji López-Alt\nFor the Mushroom-Scallion Oil:\nCombine dried porcini, dried shiitake, scallions, and oil in a small saucepan. Place over medium heat and cook, stirring, until scallions and mushrooms are releasing a thin, steady stream of bubbles. Remove from heat, cover, and set aside to infuse.\nSerious Eats / J. Kenji López-Alt\nFor the Charred Eggplant Topping:\nUnwrap eggplant and slit skin lengthwise. Use a spoon to scoop out the flesh and transfer it to a salad spinner. Discard the skin. Spin eggplant to remove excess liquid. Add eggplant liquid to the pot of stock on the stovetop. Transfer eggplant flesh to a small bowl and stir in sesame seeds and 1 tablespoon (15ml) of shiitake-soy tare. Season to taste with salt.\nSerious Eats / J. Kenji López-Alt\nFinish the Broth:\nStrain broth through a fine-mesh strainer into a clean pot. Reserve whole garlic heads and discard remaining vegetables. Cut the top off the garlic heads and squeeze out the cloves (they should be very tender). Discard skins. Transfer garlic and 1/2 cup of roasted sweet potato to the jar of a blender. Add 1 cup (240ml) of strained stock. Blend, starting on low and increasing to high speed, until completely smooth, about 1 minute. Whisk garlic/sweet potato mixture into the finished broth. You should have a little over 2 quarts (1.9L) of finished broth. Season broth to taste gently with salt. (We will be adding miso and soy sauce to it, so go very light on the seasoning.)\nSerious Eats / J. Kenji López-Alt\nTo Serve:\nIn a small bowl, stir together miso paste, sesame paste, minced garlic, and 6 tablespoons of shiitake-soy tare. Bring a large pot of salted water to a boil over high heat. Heat stock until just under a simmer on the stovetop. Preheat 6 serving bowls in the oven for 2 minutes. Remove from oven. Divide miso mixture evenly among the 6 bowls. Add 1 1/2 cups (350ml) hot broth to each bowl and stir gently to incorporate miso mixture. Taste and adjust seasoning with salt or more shiitake-soy tare if necessary. Cook ramen noodles in the boiling water for 90 seconds. Drain carefully and divide evenly between the bowls. Strain the mushroom-scallion oil into a separate bowl and discard the solids. Drizzle each bowl with 1 tablespoon (15ml) of the mushroom-scallion oil. Top with simmered shiitake caps, roasted sweet potato, roasted mushroom, eggplant mixture, and scallions. Sprinkle with more shichimi togarashi, if desired, and serve immediately.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nBlender\nNotes\nKombu is dried giant sea kelp. It can be found in any Asian supermarket or most well-stocked Western supermarkets. Look for kombu with lots of white powdery residue on its surface. Shichimi togarashi is a Japanese seven-spice blend that can be found in Japanese markets. If unavailable, substitute with 2 1/2 teaspoons chile powder and 1 teaspoon roasted sesame seeds. Mirin is a sweet Japanese cooking wine. If unavailable, substitute with 1/2 cup (120ml) sake and 1 tablespoon sugar.\nMake-Ahead and Storage\nEverything through step 8 can be prepared in advance and stored in the refrigerator until ready to assemble and serve.\nRamen\nJapanese\nVegan Mains\nMaitake Mushrooms\nNoodle Mains"
}