{
  "url": "https://www.seriouseats.com/vegan-chorizo-food-lab-recipe",
  "image_url": "https://www.seriouseats.com/thmb/TI-i9RltPnPedVver-kCf15QmtA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150225-vegan-chorizo-food-lab-recipe-tofu-tempeh-17-91311b3550c94f13893953d854ccec43.jpg",
  "tags": [
    "Homemade Sausages",
    "Dairy-free",
    "Vegan",
    "Vegetarian",
    "Lentils"
  ],
  "title": "Vegan Chorizo for Omnivores Recipe",
  "full_text": "Vegan Chorizo for Omnivores Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nActive\n60 mins\nFreezing Time\n15 mins\nTotal\n90 mins\nServes\n6 servings\nMakes\n1 1/2 pounds\nCook Mode\n(Keep screen awake)\nIngredients\n1\n(10-ounce) block\nof\nextra-firm cottony (non-silken) tofu\n, drained and cut into 1-inch slices\n1\nfresh\npoblano\npepper\n1\n(15-ounce) can\nblack or\nPuy lentils, drained and rinsed\n1\nwhole\nsweet\ndried chiles\nlike Costeño,\nGuajillo\n, or Choricero, stems and seeds removed\n1 to 2\nsmall\nhot dried chiles\nlike Arbol or Cascabel, stems and seeds removed (optional)\n1\nwhole\nrich fruity dried chile like Ancho, Mulatto, Negro, or\nPasilla\n, stems and seeds removed\n2\ntablespoons\nraisins\n1\nwhole\nchipotle chile in adobo sauce\nwith\n2\ntablespoons\nsauce from can\n2\ncups\nwater\n6\nounces\nplain\ntempeh\n1/4\ncup\nvegetable shortening or\ncoconut oil\n1\nmedium\nonion\n, diced (about\n1\ncup\n)\nKosher\nsalt\nand freshly ground black pepper\n3\nmedium\ncloves garlic\n, minced (about\n2\nteaspoons\n)\n2\ntablespoons\nminced\nfresh oregano leaves\n2\nteaspoons\ndried Mexican oregano\n1/2\nteaspoon\nground cinnamon\n1\ntablespoon\nfreshly toasted and\nground cumin seeds\n1\nteaspoon\nfreshly toasted and\nground coriander seeds\n3\nwhole\ncloves\n, toasted and ground\n1\ntablespoon\nyellow or\nred miso paste\n1\ntablespoon\nsoy sauce\n1/4\ncup\nred wine vinegar\nDirections\nLine a large plate with a double layer of paper towels. Place tofu on top in a single layer and transfer to freezer. Freeze for 15 minutes, then remove and let thaw while you prepare the other ingredients.\nAdjust rack to 4 inches below broiler element and preheat broiler to high. Line a rimmed baking sheet with aluminum foil and place the poblano on top. Broil, turning occasionally, until blackended on all sides, about 6 minutes total. Remove from oven, lift foil and wrap it around the poblano to form a tight seal, transfer to a plate and set aside. Reduce oven temperature to 325°F (160°C) and leave the door open to allow oven to cool slightly.\nLine rimmed baking sheet with a fresh piece of foil and spread lentils on top in a single layer. Transfer to oven and cook until mostly dry and crunchy, 20 to 30 minutes.\nSerious Eats / J. Kenji López-Alt\nMeanwhile, place dried chiles on a microwave-safe plate and microwave until toasted, about 30 seconds. Transfer to a glass liquid measuring cup. Add raisins, chipotle chiles and their juice, and water. Cover with plastic wrap and microwave until simmering, about 1 1/2 minutes. Remove from microwave and let stand 2 minutes. Transfer to a blender and blend until completely smooth. Set mixture aside.\nCut tempeh into 1-inch pieces. Working in batches, transfer to a food processor and pulse until chopped to the texture of ground meat, about 10 to 12 short pulses. Set aside.\nWhen cool enough to handle, carefully unwrap and peel poblano pepper, discarding skins and seeds. Finely dice cooked flesh. Melt shortening in a large saucepan over medium-high heat. Add onions and poblanos, season with salt and pepper, and cook, stirring, until softened, about 4 minutes. Add garlic, fresh and dried oregano, cinnamon, cumin, coriander, cloves, and cook, stirring, until fragrant, about 1 minute. Add miso paste, soy sauce, red wine vinegar, and chile mixture. Add crumbled tofu, tempeh, and dehydrated lentils. Stir to incorporate and season to taste with salt and pepper. For a moister, saucy texture, add a few tablespoons of water. For a dryer, crumblier, well-browned texture, add 2 tablespoons more oil and continue cooking until most of the excess liquid has evaporated and mixture is dark brown with crisp bits, about 15 minutes. Serve in tacos, burritos, mixed with eggs, on nachos, or in any recipe that calls for fresh Mexican chorizo.\nSpecial Equipment\nFood processor\n,\nblender\nMake-Ahead and Storage\nThe chorizo can be made in advance and stored in a sealed container in the refrigerator for up to one week or frozen for up to two months.\nRead More\nFully Loaded Vegan Queso Dip\nEasy Fresh Mexican Chorizo\nThe Best Vegan Nacho Cheese Sauce\nDried Olive and Miso Shake (The Best Vegan Parmesan Substitute)\nUltimate Vegan Ramen With Miso Broth\nHomemade Sausages\nDairy-free\nVegan\nVegetarian\nLentils",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/vegan-chorizo-for-omnivores-recipe.webp?"
}