{
  "url": "https://www.seriouseats.com/vegan-olive-oil-chocolate-chip-cookie-recipe",
  "image_url": "https://www.seriouseats.com/thmb/rNwdmDCvpd5OiNnNrcMzLFVP_7c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190709-olive-oil-cookies-vicky-wasik-24-2d958dd6cc5e480996695ab7e7f9ac02.jpg",
  "tags": [
    "Fats & Oils",
    "Christmas Cookies",
    "Chocolate",
    "Olive Oil"
  ],
  "title": "Olive Oil Chocolate Chip Cookies Recipe",
  "full_text": "Olive Oil Chocolate Chip Cookies Recipe\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nActive\nAbout 15 mins\nCooling Time\n5 mins\nTotal\n40 mins\nServes\n18 cookies\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Oat Slurry:\n1 1/2\nounces\nold-fashioned rolled oats\n(about\n1/2\ncup\nminus\n2 1/2\nteaspoons\n;\n42\ng\n), not quick-cooking or instant\n3\nounces\nwater\n(about\n1/3\ncup\nplus\n1\ntablespoon\n;\n85\ng\n)\nFor the Dough:\n6\nounces\nlight brown sugar\n(about\n3/4\ncup\n, gently packed;\n170\ng\n)\n3/4\nteaspoon\nbaking soda\n3/4\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/2\nteaspoon\nbaking powder\n1/8\nteaspoon\nground cinnamon\n4 3/4\nounces\nextra-virgin olive oil\n(about\n2/3\ncup\n;\n135\ng\n); see note\n2\nounces\nprepared oat slurry\n1/4\nounce\nvanilla extract\n(about\n1 1/2\nteaspoons\n;\n7\ng\n)\n6 3/4\nounces\nall-purpose flour\n(about\n1 1/2\ncups\n, spooned;\n190\ng\n)\n6\nounces\nassorted chocolate chips or\nchopped chocolate\n; see note\nDirections\nFor the Oat Slurry:\nIn a tall, narrow container just wide enough to accommodate the head of an immersion blender, combine rolled oats and water. Using an immersion blender, purée until thick and smooth, then strain through a fine-mesh strainer, pressing on the solids with a flexible spatula until they give up all their liquid. Discard the fibrous oat solids and reserve 2 ounces of the thick and gooey purée to use as directed below. This step should not be done in advance, as the oat slurry will continue to thicken over time, eventually becoming unusable.\nFor the Dough:\nAdjust oven rack to middle position and preheat oven to 350°F (180°C). In a large bowl, whisk brown sugar, baking soda, salt, baking powder, and cinnamon until very well combined and free of any major lumps, about 1 minute. Add olive oil, prepared oat slurry, and vanilla extract and whisk until smooth. Add flour and stir, using a flexible spatula, until well absorbed, then add chocolate chips and knead by hand to incorporate. The dough will seem a touch oily and strange; this is normal.\nPortion the Dough:\nUsing a 2-tablespoon cookie scoop, divide dough into about 18 pieces, firmly compressing each portion into the scoop using the palm of your hand or the edge of the bowl. (If you like, the portioned dough can be refrigerated in a heavy-duty zipper-lock bag for up to 1 week, or frozen for up to 6 months. Let stand at room temperature until quite soft, about 70°F/21°C, then bake as directed.)\nTo Bake:\nArrange portioned dough on a parchment-lined aluminum baking sheet, leaving 2 inches between portions. If you like, garnish with a few extra chocolate chips on each cookie. Bake until cookies are puffed and golden from edge to center and firm around the edges but still quite steamy and soft in the middle, about 15 minutes. Cool directly on baking sheet until the crumb has set. Enjoy warm or at room temperature. Store leftovers in an airtight container up to 3 days at cool room temperature.\nSpecial Equipment\nImmersion blender\n,\nnonreactive fine-mesh strainer\n, flexible spatula, 2-tablespoon cookie scoop (optional),\nhalf-sheet pans\nNotes\nThe flavor and aroma of these cookies depend entirely on the quality of the olive oil, so be sure to use a brand with a flavor you absolutely love. This recipe can be used as a showcase for any style of olive oil so long as it's one you enjoy, but for the most \"traditional\" chocolate chip cookie, try an extra-virgin olive oil with a mild and buttery profile, rather than one that's peppery or sharp. For more information, see our\nguide to buying olive oil\n.\nIf olive oil isn’t your jam, regardless of how mild it may be, this recipe works equally well with hazelnut oil—which you might have left over from making our\nhomemade Nutella\n.\nFor more information on selecting an assortment of chips, see our\nchocolate chip buying guide\nfor recommendations. Chopped chocolate bars can be used in place of commercial chips, a swap that gives the chocolate a more assertive presence in the dough; I recommend using a similar assortment of cacao percentages and styles. See our\ntop picks for supermarket chocolate bars\nfor more information.\nMake-Ahead and Storage\nThe portioned dough can be refrigerated in a heavy-duty zipper-lock bag for up to 1 week, or frozen for up to 6 months. Let stand at room temperature until quite soft, about 70°F (21°C), then bake as directed. Leftover cookies may be stored in an airtight container for up to 3 days at cool room temperature.\nThis Recipe Appears In\nOlive Oil Chocolate Chip Cookies: Just Pantry Staples, Totally Vegan\nFats & Oils\nChristmas Cookies\nChocolate\nOlive Oil"
}