{
  "url": "https://www.seriouseats.com/vegan-key-lime-pie-recipe-8673245",
  "image_url": "https://www.seriouseats.com/thmb/-veFQrfOojubgwpZEo_CGRDdlx0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/KEYLIME-Beauties-2-ac9d514eab384cc1b695fae65273a718.jpg",
  "tags": [
    "Tofu",
    "The Latest",
    "Pies",
    "Lime",
    "Coconut Milk & Cream"
  ],
  "title": "Vegan Key Lime Pie",
  "full_text": "Vegan Key Lime Pie\nClose\nJump to recipe\nPrep\n15 mins\nCook\n25 mins\nCooling and Chilling Time\n7 hrs 30 mins\nTotal\n8 hrs 10 mins\nMakes\n1 nine-inch pie\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Crust:\n8 3/4\nounces\n(about\n16\ncrackers\n;\n250\ng\n)\nvegan graham crackers\n(see note)\n3\ntablespoons\nsugar\n(\n45\ng\n)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n4\nounces\n(\n115\ng\n)\nvegan buttery sticks\nor spread, melted\nFor the Filling:\n12\nounces\n(\n340\ng\n)\nsilken tofu\n, drained\n1\n(7.4\nounce\n; 210 g) can\nsweetened condensed\ncoconut milk\n(see note)\n7\nounces\nsugar\n(about\n1\ncup\n;\n200\ng\n) (see note)\n1/4\nounce\nlime zest\n(about\n2\ntablespoons\n;\n7\ng\n), from about\n4\nsmall\nlimes\n(see note)\n5\nounces\nfresh\nlime juice\n(about\n2/3\ncup\n,\n140\ng\n), from about\n5\nsmall\nlimes\n(see note)\n3\ntablespoon\n(\n30\ng\n)\ncornstarch\n1/8\nteaspoon\nDiamond Crystal\nkosher salt\n(if using table salt, use half as much by volume)\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\n1/4\nteaspoon\nrosewater\n(optional)\nFor the Topping:\nVegan Aquafaba Meringue\nFrosting\n,\n1\nrecipe\n(see note)\n1\nteaspoon\n(\n5\nml\n)\nvanilla extract\nDirections\nFor the Crust:\nAdjust oven rack to lower-middle position and preheat to 375°F (190°C). Combine graham crackers, sugar, and salt in a food processor bowl and pulse until reduced to fine crumbs, 18 to 22 pulses. Add the melted fat and pulse until fully moistened and resembling wet sand. Pause to scrape down sides of the bowl with a rubber spatula, if needed.\nDebbie Wee\nScrape graham mixture into a 9-inch glass pie plate, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup; this will naturally push the crumbs up the sides of the pan. Press the glass around the pie plate to compress the crumbs along the sides to create a rim. Bake for 10 minutes or until the edges are golden brown. Set aside to cool.\nDebbie Wee\nFor the Filling:\nCombine tofu, sweetened condensed milk, sugar, lime zest and juice, cornstarch, and salt in a blender jar or food processor bowl. Blend on medium-low speed until completely smooth. Transfer to a 3-quart stainless steel saucier and bring to a boil over medium heat, whisking constantly, about 8 minutes. Continue cooking and whisking until mixture has thickened, about 1 minute. Remove from heat and stir in vanilla extract and rosewater (if using). Pour filling into prepared crust.\nDebbie Wee\nLet pie filling cool to room temperature, about 1 hour. Cover and refrigerate until filling is chilled and fully set, at least 6 hours or up to overnight.\nDebbie Wee\nFor the Topping:\nPrepare the vegan aquafaba meringue according to the directions in the recipe but omit cardamom; after reaching stiff peaks, mix in 1 teaspoon vanilla extract during the last step instead. Spread the “meringue” over the pie with an offset spatula, or place in a piping bag fitted with a large star tip and pipe decorative stars to cover the surface of the pie. Serve immediately.\nDebbie Wee\nSpecial Equipment\nScale, 9-inch glass pie plate, flexible spatula, food processor, blender, 3-quart stainless steel saucier, whisk, instant-read thermometer, stand mixer, offset spatula, pastry bag and tips (optional).\nNotes\nHoney is a common ingredient in graham crackers, but it isn't\nconsidered vegan compliant\n. If you can’t find vegan graham crackers (look for brands such as\nNabisco Original or Keebler Original\n), the recipe works equally well with Whole Foods Organic Vanilla Animal Cookies.\nThis recipe was tested with\nLet’s Do Organic Sweetened Condensed Coconut Milk\n; if using other brands, be sure to measure it out by weight, as they may be packaged in differently sized cans. Sweetened condensed coconut milk has a firm fat cap on the surface that needs to be gently broken through to reach the thinner contents underneath; empty the contents of the can over a bowl to catch any liquid that might squirt out.\nNot all refined white sugar is considered\nvegan compliant\n, but organic cane sugar always is. This recipe was tested with both, and the difference was only apparent in the aquafaba meringue, which has a reduced shelf life when made with organic cane sugar, owing to its natural molasses content. For that reason, a pie topped with aquafaba meringue should be made and served on the same day. The pie, bare or topped with white sugar frosting, can last in the refrigerator for 3 days.\nRead the notes sections of Stella Parks’s\nFresh and Creamy Lime Pie Recipe\nfor more information on prepping citrus ahead of time and nonreactive cookware.\nMake-Ahead and Storage\nThe semi-prepared pie can be covered and refrigerated up to 3 days before preparing the topping. After topping with “meringue,\" it’s best served right away.\nTofu\nThe Latest\nPies\nLime\nCoconut Milk & Cream"
}