{
  "url": "https://www.seriouseats.com/vegan-cheesy-baked-potatoes-with-broccoli-recipe",
  "image_url": "https://www.seriouseats.com/thmb/XzNyw0CXtkHmbUSYAwPaPE84_jI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/vegan-cheesy-baked-potatoes-with-broccoli-recipe-hero-01-d457efbaee044742a6f9d1160b0190e8.jpg",
  "tags": [
    "Dairy-free Sides",
    "Vegan Sides",
    "Vegetarian Sides",
    "Roasted Vegetables",
    "Broccoli"
  ],
  "title": "Vegan Cheesy Baked Potatoes With Broccoli Recipe",
  "full_text": "Vegan Cheesy Baked Potatoes With Broccoli Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n65 mins\nActive\n15 mins\nCooling Time\n5 mins\nTotal\n80 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n4\nlarge\nrusset potatoes\n1\ntablespoon\nolive oil\nKosher salt\n2\ncups\nsmall\nbroccoli florets\n1\nrecipe\nvegan nacho sauce\n8\nscallions\n, thinly sliced\nDirections\nAdjust oven rack to center position and preheat oven to 425°F (220°C). Scrub potatoes clean under cold running water and rub with oil. Using a fork or paring knife, puncture potatoes in several spots. Wrap potatoes individually in foil and place on a rimmed baking sheet. Bake until a skewer inserted into the potatoes through the foil meets some resistance about a half-inch under the surface, about 30 minutes. Remove from oven, carefully open foil, and place potatoes back on baking sheet on top of foil. Continue baking until a skewer inserted into the potato meets no resistance and the skin is crisp, about 30 minutes longer. Remove from oven and let cool 3 minutes.\nSerious Eats / Eric Kleinberg\nWhile potatoes bake, bring a medium pot of salted water to a boil. Add broccoli florets and cook just until tender-crisp, about 1 minute. Drain through a fine-mesh strainer and set aside.\nSerious Eats / Eric Kleinberg\nWhile potatoes cool, heat vegan cheese sauce in a medium saucepan, stirring constantly, until hot. Fold in broccoli. Split tops of potatoes with a paring knife and press inwards on the ends to open up the potatoes. Lightly fork the inside to fluff it up. Spoon broccoli and nacho sauce into each potato, top with scallions, and serve immediately.\nSerious Eats / Eric Kleinberg\nDairy-free Sides\nVegan Sides\nVegetarian Sides\nRoasted Vegetables\nBroccoli",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/vegan-cheesy-baked-potatoes-with-broccoli-recipe.webp?"
}