{
  "url": "https://www.seriouseats.com/vegan-oatmeal-pancakes-recipe-8685375",
  "image_url": "https://www.seriouseats.com/thmb/r3MZKZ-3a-yF-zkxSs0o6YV-Tuc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160324-aquafaba-pancake-oatmeal-vegan-40-ff19d0bd35784080baf418e6fb92dd3a.jpg",
  "tags": [
    "Pancakes",
    "Vegan",
    "Vegan Breakfast & Brunch",
    "Oats"
  ],
  "title": "Fluffy Vegan Oatmeal Pancakes",
  "full_text": "Fluffy Vegan Oatmeal Pancakes\nClose\nJump to recipe\nPrep\n5 mins\nCook\n25 mins\nTotal\n30 mins\nServes\n16 pancakes\nCook Mode\n(Keep screen awake)\nIngredients\n5\nounces\nrolled oats\n(about 3/4 cup; 140g)\n5\nounces\nall-purpose flour\n(about 1 cup; 140g)\n2\nteaspoons\n(8g)\nbaking powder\n1/2\nteaspoon\nbaking soda\n1\nteaspoon\n(4g)\nkosher salt\n4\ntablespoons\n(60ml)\nliquid from 1 can of low-sodium chickpeas\n(reserve remaining liquid and chickpeas for another use)\n4\ntablespoons\n(60g)\nsugar\n1 1/2\ncups\nalmond, rice, or\nsoy milk\n(about 12 ounces; 355ml)\n1/4\ncup\n(60ml)\nvegetable oil\n, plus more for cooking\n2\nteaspoons\n(10ml)\nvanilla extract\n2\nteaspoons\nzest from 1 lemon\n2\nteaspoons\n(10ml)\ncider vinegar\nor distilled white vinegar\nVegan butter substitute and\nmaple syrup\n, for serving\nDirections\nHeat oats in a medium skillet over medium heat, tossing and stirring frequently, until toasted and nutty, about 4 minutes. Transfer to the bowl of a food processor, let cool a few moments, and pulse until about half the oats are powdered but a few larger flakes remain, 10 to 12 short pulses. Add flour, baking powder, baking soda, and salt and pulse to combine.\nPlace chickpea liquid and sugar in the bowl of a stand mixer fitted with a whisk attachment. Whisk on high speed until stiff peaks form, about 6 minutes. Meanwhile, combine almond milk, vegetable oil, vanilla extract, lemon zest, and vinegar in a bowl. Add dry mix to wet mix and fold with a rubber spatula to combine (the mixture should remain lumpy). Fold in whipped chickpea liquid, being careful not to let it deflate too much.\nHeat a large, heavy-bottomed nonstick skillet over medium heat for 5 minutes (or use an electric griddle). Add a small amount of vegan butter or oil to skillet or griddle and spread with a paper towel until no visible butter or oil remains. Reduce heat to low. Use a 1/4-cup dry measure to place 4 pancakes in skillet and cook until bubbles start to appear on top and bottoms are golden brown, about 3 minutes. Carefully flip pancakes and cook on second side until golden brown and completely set, about 3 minutes longer. Serve pancakes immediately, or keep warm on a wire rack set on a rimmed baking sheet in a warm oven while you cook the remaining 3 batches. Serve with warm maple syrup and vegan butter.\nSpecial Equipment\nFood processor\n,\nstand mixer\n, or electric mixer,\ngriddle\nor wide nonstick pan\nPancakes\nVegan\nVegan Breakfast & Brunch\nOats"
}