{
  "url": "https://www.seriouseats.com/vegan-dan-dan-noodles-recipe",
  "image_url": "https://www.seriouseats.com/thmb/wey-6tMQGF7IOBz_XdY9HdViUJ4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130221-vegan-dan-dan-mien-noodles-1-a06c259c753d43e28b9c6ed740cba873.jpg",
  "tags": [
    "Noodles",
    "Chinese",
    "Vegan Mains",
    "Vegan Snacks & Appetizers",
    "Sesame & Tahini"
  ],
  "title": "Vegan Dan Dan Noodles Recipe",
  "full_text": "Vegan Dan Dan Noodles Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n20 mins\nActive\n15 mins\nTotal\n25 mins\nServes\n2 servings\nCook Mode\n(Keep screen awake)\nIngredients\n6\nounces\nwhite button mushrooms\n, quartered\n2\ntablespoons\nvegetable oil\n3\nteaspoons\nlight soy sauce\n2\nteaspoons\nChinkiang vinegar\n(see notes)\n1\ntablespoon\ntahini paste\n2\nteaspoons\nsugar\n4\ntablespoons\nroasted chili oil\nwith some chili sediment (see notes)\n1\ntablespoon\nfermented chili broad bean paste\n(see notes)\nKosher salt\n3\ntablespoons\nfinely chopped\npreserved Sichuan mustard root\nor stems (see notes)\n2\nmedium\ncloves garlic\n, finely minced\n2\ntablespoons\nShaoxing wine\n(see notes)\n8\nounces\nfresh Chinese wheat noodles\nChopped cilantro\nThinly sliced scallions\nDirections\nPlace mushrooms in the bowl of a food processor and process until pieces no larger than 1/2-inch remain, about 6 short pulses. Transfer to a small saucepan. Add vegetable oil and stir to combine. Place over medium-high heat and cook, stirring occasionally, until mushroom pieces shrink and are deep golden brown, about 8 minutes. Pour through a fine-mesh strainer set over a small bowl. Reserve mushroom pieces and discard all but 1 tablespoon oil.\nWhile mushrooms are cooking, combine soy sauce, vinegar, tahini, sugar, chili oil (with its sediment), and broad bean chili paste in a medium bowl. Set aside. Bring 1 quart of salted water to a simmer in a medium pot and keep hot.\nHeat reserved 1 tablespoon of mushroom oil in a large skillet or wok over high heat until shimmering. Add chopped Sichuan vegetables, fried mushrooms, and garlic. Cook, stirring and tossing constantly until fragrant, about 45 seconds. Add Shaoxing wine and stir to combine. Transfer mixture to bowl with sauce.\nReturn pot of water to a hard boil and add noodles. Cook, stirring regularly to prevent noodles from sticking to each other or the bottom, until barely cooked through with a springy bite, about 4 minutes. Drain, reserving 3/4 cup of cooking liquid. Add cooking liquid to bowl with sauce and stir to combine.\nPlace noodles in bowl and pour sauce with solids on top. Garnish with scallions and cilantro, and serve, stirring vigorously just before eating to pick up sauce.\nNotes\nChinkiang vinegar is a black vinegar that can be found in most Chinese grocers or online. When shopping for chili oil, look for a brand that contains chile sediment in the bottle, such as the Chiu Chow Chili Oil from Lee Kum Kee, or make your own. Fermented chili broad bean paste can be found in most Chinese grocers or online. Either preserved Sichuan mustard root (zhacai) or stems (yacai) can be used for this recipe. They are available in many Asian grocers in either bulk sections or canned, or online. Shaoxing wine can be found in most supermarkets. If unavailable, use dry sherry in its place.\nNoodles\nChinese\nVegan Mains\nVegan Snacks & Appetizers\nSesame & Tahini"
}