{
  "url": "https://www.seriouseats.com/vegan-lasagna-alla-bolognese",
  "image_url": "https://www.seriouseats.com/thmb/gUYBAC2s6iOyMo8YEO2fBtziAoA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__03__20180305-vegan-lasagna-bolognese-seitan-mushrooms-vicky-wasik22-d8d72353225b4955af5ccafdd95b17a5.jpg",
  "tags": [
    "Dairy-free Mains",
    "Vegan Mains",
    "Vegetarian Mains",
    "Savory",
    "Lasagna"
  ],
  "title": "Vegan Lasagna alla Bolognese Recipe",
  "full_text": "Vegan Lasagna alla Bolognese Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n60 mins\nActive\n45 mins\nResting Time\n20 mins\nTotal\n90 mins\nServes\n10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ncups\n(\n475\nml\n) unflavored,\nunsweetened almond milk\n1\nbay leaf\n5\nsprigs\nthyme\n10\nwhole\nblack peppercorns\n3\nmedium\ncloves garlic\n, crushed\n3\ntablespoons\n(\n45\nml\n)\nrefined neutral coconut oil\n(see notes)\n3\ntablespoons\n(\n25\ng\n)\nall-purpose flour\nGenerous\npinch\nfreshly grated\nnutmeg\nKosher salt\nand freshly ground white or black pepper\n1\nrecipe\nvegan seitan and mushroom ragù bolognese\n1\npound\n(\n450\ng\n)\ndry lasagna noodles (egg-free)\n, cooked about 2 minutes less than package instructions indicate, then drained and chilled in ice water\nDirections\nIn a small saucepan, combine almond milk with bay leaf, thyme, peppercorns, and garlic. Bring to a bare simmer, then lower heat to maintain a bare simmer for 20 minutes. Strain almond milk into a heatproof measuring cup and discard aromatics.\nSerious Eats / J. Kenji López-Alt\nIn a small saucepan, heat coconut oil over medium heat until melted. Add flour and cook, whisking, until raw flour smell is gone, about 2 minutes.\nWhisking constantly, add infused almond milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added.\nHeat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until béchamel sauce is thick enough to coat the back of a wooden spoon, about 3 minutes. Stir in nutmeg and season with salt and pepper.\nStir 1/2 cup (120ml) vegan béchamel sauce into vegan Bolognese sauce.\nPreheat oven to 425°F (220°C). Drain pasta well. In a 9- by 13-inch baking dish, lay down a single layer of lasagna sheets to cover the bottom of the dish. Spread a thin, even layer of Bolognese sauce on top, then drizzle lightly with some of the remaining béchamel sauce. Repeat in alternating layers of pasta, Bolognese sauce, and béchamel sauce until baking dish is full and/or any of the components is used up. The final layer should be Bolognese sauce with béchamel drizzled on top.\nSerious Eats / Vicky Wasik\nSet baking dish on a rimmed baking sheet and bake until lasagna is browned on top and bubbling, about 25 minutes. Let lasagna rest 20 minutes before serving. Cut individual portions and serve while still warm.\nSerious Eats / Vicky Wasik\nSpecial Equipment\n9- by 13-inch baking dish\n,\nrimmed baking sheet\n,\nfine-mesh strainer\nNotes\nMake sure to use refined neutral coconut oil, not a virgin oil that still smells and tastes of coconut.\nRead More\nVegan Seitan and Mushroom Ragù Bolognese\nDairy-free Mains\nVegan Mains\nVegetarian Mains\nSavory\nLasagna",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/vegan-lasagna-alla-bolognese-recipe.webp?"
}