{
  "url": "https://www.seriouseats.com/vegetable-qorma-5324131",
  "image_url": "https://www.seriouseats.com/thmb/jeX2VCq0HpTybTRMZvnFtfgG5NE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220509_Vegetable-Qorma-Amanda-Suarez_hero-69018555251845c9aeb9b05fb187e3bd.JPG",
  "tags": [
    "Indian",
    "Vegetable Mains",
    "Vegetarian Mains",
    "Braising & Stewing",
    "The Latest"
  ],
  "title": "Vegetable Qorma",
  "full_text": "Vegetable Qorma\nClose\nJump to recipe\nPrep\n5 mins\nCook\n65 mins\nTotal\n70 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Qorma:\n1/2\ncup\n(\n70\ng\n)\nwhole raw cashews\n1\ntablespoon\nwhite poppy seeds\n(khus khus) (see note)\n1/2\ncup\nboiling\nwater\n4\ntablespoons\n(\n60\nml\n)\nghee\nor neutral oil, such as grapeseed\n1\ncup\n(\n230\ng\n)\npaneer\n, store-bought or\nhomemade\n, cut into 1/2-inch (12mm) cubes (optional)\n2\nlarge\nwhite\nor\nyellow onions\n(\n455\ng\n), finely diced\n4\ngarlic\ncloves\n, peeled and grated\nOne\n2-inch (5 cm) piece\nfresh ginger\nroot, peeled and grated\n1\nteaspoon\nwhole\ncumin seeds\n1\nteaspoon\nwhole\nfennel seeds\n1/2\nteaspoon ground\ngreen cardamom\n1/2\nteaspoon\nground turmeric\n(optional)\nOne\n2-inch (5cm) piece\ncinnamon stick\n4\nwhole\ncloves\n1\nlarge\nbay leaf\n1\nblack cardamom\npod\n(optional)\n1/4 to 1/2\nteaspoon\ncayenne\n1\ncup\n(\n240\ng\n) plain, unsweetened\nwhole milk yogurt\n1\ntablespoon\ntomato paste\n1\nRusset potato\n(\n250\ng\n), peeled and diced into 1/2-inch (12 mm) cubes (see note)\n1/2\na\nsmall head\nof\ncauliflower\n(\n250\ng\n), separated into 1-inch (2.5cm) florets (see note)\n1\nmedium\ncarrot\n(\n200\ng\n), peeled and diced into 1/2-inch (12 mm) cubes (see note)\n1\nteaspoon\n(\n6\ng\n) Diamond Crystal\nkosher salt\n, plus more to taste; if using table salt, use half as much by volume\n1/2\ncup\n(\n60\ng\n)\npeas\n, fresh or frozen\nGarnish\n2\ntablespoons\n(\n30\nml\n)\nghee\nor a\nneutral oil\nlike\ngrapeseed\n2\ntablespoons\nwhole raw cashews\n2\ntablespoons\ngolden raisins\n2\ntablespoons\ncilantro leaves\n, torn\n1\ngreen chile\n, such as\njalapeño\nor\nserrano\n, thinly sliced\nDirections\nCombine cashews, poppy seeds, and boiling water in a high-speed blender and blend until completely smooth and milky. Transfer to small mixing bowl and set aside.\nSerious Eats / Amanda Suarez\nAdd ghee or oil to Dutch oven and heat over medium heat until shimmering. Add paneer cubes and cook, turning once or twice, until they turn golden brown all over, 4 to 5 minutes. Remove the paneer with a slotted spoon and transfer to a paper towel-lined plate. Alternatively, you can skip frying the paneer and add the cubes later along with the vegetables.\nSerious Eats / Amanda Suarez\nAdd onions to Dutch oven, stir, cover pot with a lid, reduce heat to low, and cook, stirring occasionally, until the onions become translucent and soft, about 10 minutes. There is no need to brown them. Stir in the garlic, ginger, cumin, fennel, green cardamom, turmeric, cinnamon, cloves, bay leaf, black cardamom, and cayenne, and cook until the spices become fragrant, 30 to 45 seconds.\nSerious Eats / Amanda Suarez\nIncrease heat to medium-high. Add 1/4 cup of yogurt and cook until water in yogurt evaporates and it takes on a grainy consistency and fat separates. Repeat with remaining yogurt; the process should take about 8 to 10 minutes. Stir in the tomato paste and reduce heat to low.\nSerious Eats / Amanda Suarez\nStir cashew-poppy seed mixture thoroughly and fold it into the yogurt-spice mixture. From this point forward, you'll want to watch the contents of the pot and stir it frequently, as the ground nuts can stick to the bottom of the saucepan and scorch.\nSerious Eats / Amanda Suarez\nAdd vegetables, paneer, salt, and 1/2 cup (120ml) water and stir to combine. Increase heat to medium-high, bring contents of pot to a boil, cover with a lid, reduce heat to low, and cook until the vegetables are cooked through and just tender, between 20 to 30 minutes, depending on the vegetables used. Add peas, frozen or fresh, and cook until peas are just cooked, about 5 minutes. The sauce should be thick; if it isn’t, increase heat to medium and cook, uncovered, stirring constantly, until the liquid reduces. Taste and season with salt. Transfer qorma to a serving dish.\nSerious Eats / Amanda Suarez\nTo Make the Garnish:\nHeat the oil in a small saucepan over medium heat until shimmering. Add cashews and cook until they turn golden brown on all sides, 3 to 4 minutes. Add raisins and cook until they plump up, about 30 to 45 seconds. Pour mixture over qorma. Garnish with cilantro leaves and sliced green chile, and serve hot or warm with rice or flatbread.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nDutch oven\nNotes\nIf you can't find white poppy seeds, you can use black poppy seeds, but the resulting purée will look speckled.\nIf you skip frying the paneer, you can reduce the amount of ghee or oil to 3 tablespoons (45ml).\nThis recipe has been tested with the vegetables listed in the ingredient list. However, this is a forgiving method, and you can substitute 4 cups of other mixed vegetables. You will, however, have to take into consideration their cooking times and cut them up accordingly. Hardier vegetables like carrots and potatoes benefit from being cut to a smaller size, while softer vegetables can be left in larger pieces. The cooking time will also vary.\nMake-Ahead and Storage\nThe qorma can be stored in an airtight container in the refrigerator for up to one week. Reheat gently on the stovetop or in a microwave before serving.\nIndian\nVegetable Mains\nVegetarian Mains\nBraising & Stewing\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/vegetable-qorma.webp?"
}