{
  "url": "https://www.seriouseats.com/venezuelan-style-arepas-recipe",
  "image_url": "https://www.seriouseats.com/thmb/pzqdbWkXtMlZicMdeMZ70WnJsgk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__04__20111214-bean-soup-arepas-pork-stew-primary-1b60146803ee4ef0ac6c4f8eec08b80f.jpeg",
  "tags": [
    "Venezuelan",
    "Corn"
  ],
  "title": "Venezuelan-Style Arepas (Arepas Rellenas) Recipe",
  "full_text": "Venezuelan-Style Arepas (Arepas Rellenas) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n25 mins\nActive\n25 mins\nResting Time\n10 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/2\ncups\nmasarepa\n(see notes)\n1\ncup\nwater\n, plus more as necessary\n1\nteaspoon\nvegetable oil\nKosher salt\n2\nteaspoons\nbutter\nFillings as desired, such as cheese, beans, shredded chicken, or\nPulled Pork\nDirections\nAdjust oven rack to middle position and preheat oven to 325°F (160°C). Combine masarepa, water, and vegetable oil in a medium bowl and knead with hands until a dough is formed. Take a small amount and flatten it between your palms. If the edges crack, knead in more water, 1 tablespoon at a time, until dough is supple and smooth but not sticky. Season dough to taste with salt, then cover and set aside for 5 minutes.\nDivide dough into 4 even pieces and roll into balls. Working on a wooden cutting board or a regular cutting board with a sheet of plastic wrap or parchment paper on top of it, flatten each ball down to a disk about 4-inches in diameter and 1/2-inch thick.\nMelt butter in a 12-inch cast iron or non-stick skillet over medium-low heat (see notes). Add arepas and cook, moving them around the pan and rotating them occasionally, until first side is charred in spots and a dry crust has formed, about 5 minutes. Flip arepas and cook on second side until a dry crust has formed, about 5 minutes longer. Transfer to a baking sheet and bake until cooked through, about 10 minutes longer. Remove from oven, let rest 5 minutes, split, fill, and serve.\nSpecial Equipment\n12-inch cast iron skillet\nor\nnonstick skillet\nNotes\nMasarepa is dehydrated cooked cornmeal. It is available in the Latin section of most supermarkets in either white or yellow varieties. This recipe calls for white, but they can be freely substituted. Popular brands include Goya and P.A.N.\nArepas can also be cooked on a greased panini press or a grill over low heat.\nRead More\nVenezuelan-Style Arepas With Pulled Pork (Arepas Rumberas)\nColombian-Style Arepas (Griddled or Grilled Corn Cakes)\nCheese-Stuffed Colombian-Style Arepas\nVenezuelan\nCorn",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/venezuelan-style-arepas-arepas-rellenas-recipe.webp?"
}