{
  "url": "https://www.seriouseats.com/vermicelli-noodle-bowl-recipe-8353057",
  "image_url": "https://www.seriouseats.com/thmb/FOiKpNpY2OjqvTT7VqJvIoQMfj0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231012-SEA-20231011VermicelliNoodleBowlwithImperialRollsVyTran844-9414fdb3d87a4cf5b7e23bf48223797b.jpg",
  "tags": [
    "Vietnamese",
    "The Latest"
  ],
  "title": "Vermicelli Noodle Bowl With Imperial Rolls",
  "full_text": "Vermicelli Noodle Bowl With Imperial Rolls\nClose\nJump to recipe\nPrep\n20 mins\nCook\n15 mins\nTotal\n35 mins\nServes\n6\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Nước Chấm:\n1/2\ncup\n(\n120\nml\n)\nwarm water\n1/4\ncup\n(\n50\ng\n)\nsugar\n2 1/2 to 3\ntablespoons\n(\n38 to 45\nml\n)\nfish sauce\n, plus extra as needed to taste\n1\ntablespoon\n(\n15\nml\n)\nfresh lime juice\n3\nmedium\ncloves garlic\n(\n15\ng\n), minced\n1\nbird’s eye chile\n, stemmed and thinly sliced\nFor the Vermicelli Noodle Bowls:\n12\nounces\n(\n345\ng\n)\ndried rice vermicelli noodles\n, such as Three Ladies Brand\n6\ncups\n(\n95\ng\n) picked\nVietnamese fresh herbs\n(leaves and edible tender stems), such as\nThai basil\n,\nVietnamese coriander\n,\nVietnamese perilla\n,\npeppermint\n,\ncilantro\n,\nfish mint\n, or a combination, torn into bite-sized pieces\n1\nsmall\nhead\nbaby butter lettuce\nor lettuce mix (little gem, green, and/or red leaf)(\n3 1/2\nounces\n;\n100\ng\n), leaves cut into thin 1/8-inch-thick ribbons\n2\nPersian cucumbers\n, trimmed and cut into thin matchsticks (1/8 by 2 inches) or thin ribbons (1/2 by 5 inches)\n1\ncup\n(\n50\ng\n)\nmung bean sprouts\n18\nImperial Rolls\n, cut into 3 pieces each (see note)\n2/3\ncup\n(\n125\ng\n)\nunsalted roasted peanuts\n, roughly chopped (optional)\nPickled daikon and carrot\n, for serving\nPickled leeks\n, for serving (see note)\nDirections\nFor the Nước Chấm\n: In a medium bowl, combine water, sugar, fish sauce, and lime juice and mix until sugar has fully dissolved. Stir in garlic and chile; set aside.\nSerious Eats / Vy Tran\nFor the Vermicelli Noodle Bowls\n: Bring a large pot of unsalted water to a boil over medium-high heat. Add noodles and boil until tender according to the package instructions (the cooking time depends on the noodle and the brand.) Check for doneness by pressing the noodles between your fingers: they should be soft and have some spring and not mushy. Drain in a colander, rinse with cold water, and set aside to cool.\nSerious Eats / Vy Tran\nFor Serving:\nDivide herbs, lettuce, cucumbers, and bean sprouts between large individual noodle serving bowls. Top with noodles followed by imperial rolls. Garnish with roasted peanuts, if using, and pickled daikon and carrot, and leeks. Serve with nước chấm.\nSerious Eats / Vy Tran\nNotes\nFor vermicelli rice noodles, I recommend the Three Ladies brand, which is available at most Asian supermarkets and online.\nThe most time-consuming part of this recipe is making the imperial rolls themselves. While store-bought options exist, I unfortunately have yet to find a brand that comes close to what I would call a good-quality product. These really are best when made at home. If you're not up for that, you can also top the vermicelli noodles in this recipe with some of the meats commonly served with broken rice, including the grilled pork and the shredded pork (instructions for both those meats can be found in\nthis broken rice recipe\n).\nPickled leeks, often labeled “pickled leeks in brine,” are available at most Asian supermarkets in the canned section. Their delicate aroma and sweet-and-sour finish make them a great pairing with these imperial rolls.\nMake-Ahead and Storage\nThe vermicelli rice noodles can be prepared up to 4 hours ahead and held at room temperature before assembling the bowl.\nNước chấm can be refrigerated in an airtight container for up to 2 days ahead. It may thicken as it sits; dilute with water as needed.\nVietnamese\nThe Latest"
}