{
  "url": "https://www.seriouseats.com/victoria-sponge-cake-recipe-8697708",
  "image_url": "https://www.seriouseats.com/thmb/RnnpFXemrn6xyvS-6Zaa4k3ExPs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240819-SEA-VictoriaSpongeCake-AmandaSuarez-07-c35cce94db5e453d8ea256d390e2ded4.jpg",
  "tags": [
    "Layer Cake",
    "The Latest",
    "Cakes",
    "Desserts",
    "British"
  ],
  "title": "Victoria Sponge Cake",
  "full_text": "Victoria Sponge Cake\nClose\nJump to recipe\nPrep\n15 mins\nCook\n28 mins\nCooling Time\n60 mins\nTotal\n103 mins\nServes\n8\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Cake:\n4\nlarge\neggs\n(200g), room temperature\n300\ng\n(1 1/2 cups)\ngranulated sugar\n192\ng\n(1 1/2 cups)\ncake flour\n, plus more for dusting\n1 1/2\nteaspoons\nbaking powder\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same amount by weight\n3/4\ncup\n(180ml) whole\nmilk\n1/4 cup (\n60\nml\n) neutral\noil\n, such as vegetable oil\nFor the Simple Syrup:\n1/4\ncup\n(60ml)\nwater\n1\ntablespoon\n(15ml)\nlemon juice\nfrom 1 medium lemon\n2\ntablespoons\n(30g)\ngranulated sugar\nFor the Filling:\n1/2\ncup\nstrawberry jam\n(6 3/4 ounce; 192g)\n1\ntablespoon\n(15ml)\nlemon juice\nfrom 1 medium lemon\n3/4\ncup\n(175ml)\nheavy cream\n1 1/2\nteaspoons\nconfectioners sugar\n, plus more for serving\n1/4\nteaspoon\nDiamond Crystal\nkosher salt; for table salt\n, use half as much by volume\n1/2\nteaspoon\nvanilla extract\nDirections\nAdjust rack to middle position and preheat oven to 350ºF (175ºC). Butter two 9-inch aluminum cake pans with unsalted butter, then dust with cake flour, shaking out excess.\nSerious Eats / Amanda Suarez\nIn a medium bowl, whisk together cake flour, baking powder, and salt; set aside.\nSerious Eats / Amanda Suarez\nIn a large measuring cup, combine milk with vegetable oil.\nIn the bowl of a stand mixer fitted with the whisk attachment, whip eggs and granulated sugar on medium-high speed until yolks are thick and pale yellow color, and doubled in volume, 5 to 7 minutes.\nSerious Eats / Amanda Suarez\nReduce mixer speed to low, and slowly pour in milk and oil mixture. Continue to whisk until combined, about 15 seconds.\nSerious Eats / Amanda Suarez\nWith the mixer on low speed, gradually add the dry mixture 1/4 cup at a time, until just incorporated, about 2 minutes. Using a flexible spatula, scrape down sides and bottom of the bowl to ensure there are no dry bits. (If any remain, use spatula to gently fold until incorporated.) Divide batter between prepared cake pans (about 455g each) and gently tap cake pans on kitchen counter to eliminate any large air bubbles.\nSerious Eats / Amanda Suarez\nBake, rotating halfway through, until cake has risen by about 1 inch, is light golden, and springs back when gently touched, 17 to 20 minutes. Transfer pans to a wire rack and allow cakes to cool in pans for 30 minutes.\nSerious Eats / Amanda Suarez\nRun an offset spatula or butter knife around the edges of cake, then carefully invert cake onto a parchment-lined baking sheet. Let cool completely, at least 30 minutes.\nSerious Eats / Amanda Suarez\nFor the Simple Syrup:\nIn a small saucepan, whisk water, lemon juice, and granulated sugar to combine. Bring to a simmer over medium heat and cook, whisking occasionally, until sugar is dissolved, about 4 minutes. Set aside.\nSerious Eats / Amanda Suarez\nTo Assemble:\nIn a medium bowl, whisk together strawberry jam with lemon juice; set aside.\nSerious Eats / Amanda Suarez\nIn the bowl of a stand mixer fitted with the whisk attachment, combine heavy cream, confectioners’ sugar, salt, and vanilla extract. Whip on medium-high speed until medium-stiff peaks form, about 2 minutes. (Alternatively, combine cream, sugar, salt, and vanilla extract in a large mixing bowl. Using a hand mixer fitted with the whisk attachment, beat on medium speed until medium stiff peaks form, about 3 minutes.)\nSerious Eats / Amanda Suarez\nPlace one cake on a large plate or a turntable. Using a pastry brush, brush cake with about 1 tablespoon simple syrup to moisten. Using an offset spatula, spread strawberry jam mixture evenly from edge to edge. Cover jam with all of the whipped cream, using an offset spatula to spread into an even and smooth layer. Top with second cake layer and gently press to adhere to whipped cream. Dust with powdered sugar, if using, and serve immediately.\nSerious Eats / Amanda Suarez\nSpecial Equipment\nTwo 9-inch cake pans, whisk, stand mixer, flexible spatula, parchment, rimmed baking sheet, wire rack, offset spatula or butter knife, small saucepan, large plate or turntable, pastry brush\nMake-Ahead and Storage\nOnce completely cooled,  cakes can be wrapped tightly in plastic wrap and stored at room temperature for up to 24 hours.\nThe jam mixture can be made up to 3 days ahead and refrigerated in an airtight container.\nOnce layered with jam and whipped cream, the cake can be loosely wrapped in plastic wrap and refrigerated for up to 3 days.\nLayer Cake\nThe Latest\nCakes\nDesserts\nBritish",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/victoria-sponge-cake.webp?"
}