{
  "url": "https://www.seriouseats.com/vietnamese-grilled-pork-chop-thit-heo-nuong-xa-recipe",
  "image_url": "https://www.seriouseats.com/thmb/pOZ7A1QnmhL9PwKbiq8VnrBdAWs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-vietnamese-grilled-pork-chop-thit-heo-nuong-xa-recipe-hero-ce03567886914fd4a0c931fbf09cea66.jpg",
  "tags": [
    "Vietnamese",
    "Grilled Pork",
    "Pork Chop",
    "Lemongrass",
    "Pork Mains"
  ],
  "title": "Thit Heo Nuong Xa (Vietnamese Grilled Lemongrass Pork Chops)",
  "full_text": "Thit Heo Nuong Xa (Vietnamese Grilled Lemongrass Pork Chops)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n10 mins\nActive\n30 mins\nMarinating Time\n30 mins\nTotal\n55 mins\nServes\n6 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Pork:\n2\nteaspoons\nwhole\nwhite peppercorns\n, or\n1 1/2\nteaspoons\nground white pepper\n(\n4\ng\n)\nPinch\nkosher salt\n3\nstalks\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced (about\n2\nounces\n;\n60\ng\nsliced lemongrass)\n1\nsmall\nshallot\n, roughly chopped (about\n1\nounce\n;\n30\ng\ntotal)\n4\nmedium\ncloves\ngarlic\n, roughly chopped (\n3/4\nounce\n; about\n20\ng\n)\n1/3\ncup\npalm sugar\n(about\n3\nounces\n;\n85\ng\n)\n1/4\ncup\n(\n60\nml\n)\nfish sauce\n2\ntablespoons\n(\n30\nml\n)\nvegetable oil\n1 1/2\npounds\n(\n680\ng\n)\nthin-cut pork chops\n, preferably blade end, with plenty of fat and marbling\nFor the Sauce:\n1\nrecipe\nbasic\nnuoc cham\n1/4\ncup\n(\n30\ng\n) very thinly julienned or\ngrated carrot\n(optional)\n1/4\ncup\n(\n30\ng\n) very thinly julienned or grated\ndaikon radish\n(optional)\nPinch\ncrushed\nred pepper flakes\n(preferably Thai or Vietnamese; optional)\nTo Serve:\nSteamed white rice\nSliced cucumber\nDirections\nFor the Pork:\nIf using whole white peppercorns, crush with salt in a mortar and pestle until roughly crushed. Add salt, lemongrass, shallot, garlic, palm sugar, and pre-ground white pepper (if using) to mortar and crush to a rough paste. You can continue crushing by hand at this point or transfer to a food processor to finish the job.\nSerious Eats / Qi Ai\nTransfer marinade to a bowl and whisk in fish sauce and vegetable oil. Add pork chops, turning them to coat all surfaces. Transfer pork to a gallon-size zipper-lock bag,\npress out the air, and seal bag\n. Marinate at room temperature, turning pork once or twice, for at least 30 minutes or up to 3 hours. Alternatively, transfer to refrigerator and marinate, turning once or twice, for up to 12 hours before proceeding.\nSerious Eats / Qi Ai\nFor the Sauce:\nPrepare\nnuoc cham\naccording to the recipe, then add carrot and daikon to the same bowl, if using. Add chile flakes to taste, if using. Extra sauce can be stored in an airtight container in the refrigerator for up to a month.\nSerious Eats / Qi Ai\nLight one chimney full of charcoal.\nWhen all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes.\nClean and oil\ngrilling grate. Grill pork chops directly over high heat, turning frequently and shifting to cooler side of grill if there are excessive flare-ups, until pork is charred and just cooked through, 4 to 6 minutes total.\nSerious Eats / Qi Ai\nTransfer to a serving platter and serve immediately with steamed white rice, sliced cucumber, and sauce.\nSerious Eats / Qi Ai\nSpecial Equipment\nGrill\n,\nmortar and pestle\nNotes\nI strongly suggest using a mortar and pestle to make the marinade, but if you prefer, you can make it in a food processor. Process the peppercorns until crushed, then add the remaining marinade ingredients, excluding the palm sugar, and process to a paste. Chop or crush the palm sugar chunks with the bottom of a heavy pan, add to the processor, and process until incorporated.\nVietnamese\nGrilled Pork\nPork Chop\nLemongrass\nPork Mains"
}