{
  "url": "https://www.seriouseats.com/vietnamese-sauteed-morning-glory-with-beef-recipe-7377977",
  "image_url": "https://www.seriouseats.com/thmb/VsyPGsOL15HxMzXpQtYgkw4PAAU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230411-SEA-SauteedMorningGlory-Vy-Tran-hero-ef40e0eea393435c9a3df8c1c7185bbb.jpg",
  "tags": [
    "Beef",
    "The Latest",
    "Vietnamese",
    "Greens"
  ],
  "title": "Rau Muống Xào Thịt Bò (Vietnamese Sautéed Morning Glory With Beef)",
  "full_text": "Rau Muống Xào Thịt Bò (Vietnamese Sautéed Morning Glory With Beef)\nClose\nJump to recipe\nPrep\n5 mins\nCook\n15 mins\nMarinating Time\n30 mins\nTotal\n50 mins\nServes\n3\nto 4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Beef:\n1\ntablespoon\n(\n15\nml\n)\noyster sauce\n, such as Panda brand\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n(see note)\n1\nteaspoon\n(\n4\ng\n)\nsugar\n1\nteaspoon\n(\n5\nml\n) neutral oil, such as vegetable or\ncanola oil\nFreshly\nground black pepper\n1/2\npound\n(\n227\ng\n)\nflank steak\n, sliced against the grain into 2-inch-long and 1/8-inch-thick strips\nFor the Stir-Fry:\n2\ntablespoons\n(\n30\nml\n)\noyster sauce\n, such as Panda brand\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\n, plus more if desired\n1\ntablespoon\n(\n15\nml\n)\nwater\n3\ntablespoons\n(\n45\nml\n) neutral oil, such as vegetable or\ncanola\n4\nmedium\ncloves\n(\n28\ng\n)\ngarlic\n, finely chopped\n1\nbunch\nmorning glory\n(\n1 to 1 1/2\npounds\n;\n450\ng\nto\n680\ng\n), stems and leaves separated, stems cut into 3-inch segments\nFreshly\nground black pepper\nSteamed\njasmine rice\n, for serving\nDirections\nFor the Beef:\nIn a medium bowl, whisk together oyster sauce, soy sauce, sugar, oil, and freshly ground black pepper. Add beef, tossing to coat, and let marinate for 30 minutes.\nSerious Eats / Vy Tran.\nFor the Stir-Fry:\nIn a small bowl, combine oyster sauce, soy sauce, and water. Set stir-fry sauce aside.\nSerious Eats / Vy Tran.\nIn a large stainless-steel skillet or wok, heat oil on medium heat until shimmering. Add garlic and cook, stirring occasionally, until golden, 2  to 3 minutes. Scrape garlic and oil into a fine-mesh strainer set over a heatproof bowl. Set garlic aside, then return 1 tablespoon (15ml) garlic oil to skillet (reserve any remaining garlic oil for another use, or discard).\nSerious Eats / Vy Tran.\nReturn skillet to high heat and heat until oil is shimmering. Add beef and its marinade in a single, even layer. Let cook, undisturbed, for 30 seconds; then, using a metal spatula, stir while continuing to cook until beef turns mostly gray with a few pink spots, 30 seconds longer. Transfer beef to a medium bowl.\nSerious Eats / Vy Tran.\nAdd reserved garlic oil to same skillet. Set over high heat, then add morning glory stems and half of stir-fry sauce. Cook until stems soften slightly, about 1 minute. Add morning glory leaves and remaining sauce and cook, stirring and tossing, until leaves wilt and lose half of their original volume, 2 to 3 minutes. Add beef and any accumulated juices and cook, stirring and tossing, until last traces of pink disappear and sauce coats vegetable and beef, about 1 minute.\nSerious Eats / Vy Tran.\nTransfer sautéed morning glory and beef to a serving dish. Season with additional black pepper and soy sauce, if desired, then top with fried garlic and serve immediately with rice.\nSerious Eats / Vy Tran.\nNotes\nMorning glory can be found in Asian grocery stores under different names: rau muống, ong choy, water spinach, kangkong. When shopping for these greens, choose bunches with perky leaves and uniformly thin stems that snap easily. Older ones have larger stems, which can be tough and fibrous.\nI've made this recipe with Vietnamese and Chinese soy sauces, and both work—the quantity used is small enough not to make a huge difference on the finished dish regardless of origin.\nYou can omit the beef entirely and make this a meatless dish.\nBeef\nThe Latest\nVietnamese\nGreens",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/rau-mung-xo-tht-b-vietnamese-sauted-morning-glory-with-beef.webp?"
}