{
  "url": "https://www.seriouseats.com/vietnamese-coffee-recipe-8672960",
  "image_url": "https://www.seriouseats.com/thmb/X6savAQTteBnacgsVVcbvjkRW0k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240702-VietnameseCoffee-VyTran-10-a5badfe0673e4d43865cca768cc8c527.jpg",
  "tags": [
    "Coffee",
    "The Latest",
    "Vietnamese",
    "Condensed Milk",
    "Drinks"
  ],
  "title": "Vietnamese Coffee",
  "full_text": "Vietnamese Coffee\nClose\nJump to recipe\nPrep\n2 mins\nBrewing Time\n15 mins\nTotal\n17 mins\nServes\n2\nCook Mode\n(Keep screen awake)\nIngredients\n3 tablespoons (\n18\ng\n) Robusta\ncoffee\ngrounds, such as Trung Nguyen Premium Blend, see notes\n1/2 cup (\n120\nml\n) freshly boiled filtered water or\nbottled water\n, see notes\n2 tablespoons (\n30\nml\n)\nsweetened condensed milk\n, Longevity Brand (Sữa Ông Thọ), see notes\n1 cup of\nice\n(4 ounces;\n113\ng\n) for serving, plus more as desired\nDirections\nRemove lid and metal screen from phin filter. Add ground coffee to brewing chamber and shake gently to distribute evenly. Gently push the screen back on until you meet some resistance. (Don’t push the screen all the way down, as it will take longer for coffee to drip and result in an extra strong brew.)\nSerious Eats / Vy Tran\nPlace lid underneath filter and set on a plate large enough to hold the filter and lid so it can catch any spilled coffee. Add 1/4 cup (60ml) hot water water and let steep until coffee grounds have absorbed all the water and turn black, about 5 minutes. While coffee steeps, place condensed milk into a glass big enough to hold 8 to 12 ounces.\nSerious Eats / Vy Tran\nPlace filter over glass containing condensed milk. Pour in remaining 1/4 cup (60ml) hot water and any coffee that seeped out during steeping process. Allow coffee to drip until all liquid has drained, 7 to 10 minutes. (If it stops dripping because the screen was screwed on too tightly, gently loosen the screen.) Remove filter. Stir coffee and sweetened condensed milk to combine. Add ice, stir, and serve immediately.\nSerious Eats / Vy Tran\nSpecial Equipment\n8- to 12-ounce phin filter\nNotes\nLook for inexpensive canned Vietnamese Robusta coffee or a blend of Robusta and Arabica, preferably 70% Robusta and 30% Arabica. If you prefer to grind your own coffee beans, go for a medium fine grind.\nFiltered water or bottled water is preferred for making Vietnamese drip coffee. Harsh water with all its mineral content will ruin a good cup of coffee. Though I’m not very particular about the temperature of the water, I recommend using just boiled water around 195ºF or 95ºC.\nMake-Ahead and Storage\nThe coffee with added condensed milk can be made 2 days ahead and refrigerated. Add ice when ready to serve.\nCoffee\nThe Latest\nVietnamese\nCondensed Milk\nDrinks"
}