{
  "url": "https://www.seriouseats.com/vietnamese-chicken-and-cabbage-salad-recipe-8414615",
  "image_url": "https://www.seriouseats.com/thmb/j4O8vgti6mGSfZBGhKniBV1Ddig=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231203-Vietnamese-chicken-cabbage-salad-VyTran-hero-4b81d86e71784327a910d4bde6092c9a.jpg",
  "tags": [
    "The Latest",
    "Mains",
    "Cabbage",
    "Chicken Breast",
    "Vietnamese"
  ],
  "title": "Gỏi Gà Bắp Cải (Vietnamese Chicken and Cabbage Salad)",
  "full_text": "Gỏi Gà Bắp Cải (Vietnamese Chicken and Cabbage Salad)\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nCooling and Resting Time\n80 mins\nTotal\n3 hrs 5 mins\nServes\n4\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Chicken:\n2\nquarts\n(\n2\nL\n)\nwater\n1\ntablespoon\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use half as much by volume or the same weight\n2\nskin-on, bone-in split\nchicken breasts\n(\n12 to 14 ounces; 340-400 g\neach), see notes\n2\nscallions\n, ends trimmed\n1\n(2-inch) knob\nfresh ginger\n(about\n2\nounces\n;\n55\ng\n), peeled and smashed\nFor the Pickled Red Onion:\n1/4\ncup\n(\n60\nml\n)\nwhite vinegar\n1/4\ncup\n(\n60\nml\n)\nwater\n2\ntablespoons\n(\n25\ng\n)\ngranulated sugar\n1/4\nmedium\nred onion\n(about\n2\nounces\n;\n56\ng\n), thinly sliced (about\n1/2\ncup\n)\nFor the Dipping Sauce (Nước Chấm):\n3\nmedium\ngarlic\ncloves\n, minced\n1/2\ntablespoon\n(\n6\ng\n) peeled and minced\nfresh ginger\n2\ntablespoons\n(\n25\ng\n)\ngranulated sugar\n1/4\ncup\nplus\n2\ntablespoons\n(\n90\nml\n) warm\nwater\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n1\ntablespoon\n(\n15\nml\n) fresh\nlime juice\nfrom about\n1\nlime\n1\nbird’s eye\nchile\n, stemmed and thinly sliced\nFor the Fried Shallots:\n1 1/2\ncups\n(\n355\nml\n)\nneutral oil\n, such as vegetable or canola oil, for frying\n3\nmedium\nshallots\n(about\n6\nounces\n;\n168\ng\n), sliced into 1/16-inch-thick rounds (see notes)\nKosher salt\nFor the Salad:\n2\ncups\nthinly shredded\ngreen cabbage\n(about\n5\nounces\n;\n135\ng\n); see notes\n2\ncups\nthinly shredded purple\ncabbage\n(about\n5\nounces\n;\n135\ng\n); see notes\n1\nmedium\ncarrot\n(\n70\ng\n), cut into matchsticks\n1/2\ncup\n(\n74\ng\n) unsalted\nraw peanuts\n(without skin)\n1/2\ncup\n(\n16\ng\n) chopped Vietnamese\ncoriander\n(rau răm)\n1/4\ncup\n(\n8\ng\n) chopped\nperilla\n(tía tô)\nDirections\nFor the Chicken:\nIn a large saucepan, combine water and salt, stirring until salt dissolves. Add chicken, scallion, and ginger and set over medium-high heat until water temperature reaches between 150 and 160°F (65 to 70°C) on an instant-read thermometer. Cook, adjusting heat to maintain water temperature in the 150–180°F (65–80°C) range, until the thickest part of chicken registers 150°F (65°C) on an instant-read thermometer, about 1 hour. Remove chicken from broth and let rest until cool enough to handle. Strain broth and reserve for another use. Remove and discard chicken skin, then shred meat with your hands and set aside.\nSerious Eats / Vy Tran\nFor the Pickled Red Onion:\nIn a non-reactive bowl, combine vinegar, water, and sugar, and stir until sugar dissolves. Stir in onion and let sit at room temperature for 1 hour.\nSerious Eats / Vy Tran\nFor the Ginger Dipping Sauce:\nMeanwhile, using a mortar and pestle, pound garlic and ginger together with sugar (alternatively, use the back of a knife to bruise the garlic and ginger then mince finely, and stir with sugar in a small bowl). Add warm water, fish sauce, and lime juice, then stir to combine. Transfer sauce to a serving bowl and set aside until ready to use.\nSerious Eats / Vy Tran\nFor the Fried Shallots:\nIn a small saucepan, heat oil to 300°F (150°C) over medium-high heat. Add the shallots and fry, stirring constantly for even cooking and adjusting heat as needed to maintain oil temperature between 250 and 275°F (120-135°C), until golden brown, 5 to 7 minutes. Use a slotted spoon to transfer the fried shallots to a paper-towel lined plate and season immediately with salt.\nSerious Eats / Vy Tran\nFor the Salad:\nOne hour before serving, thoroughly toss together shredded chicken with cabbage, carrots, and the reserved pickled onion with its pickling juice.\nSerious Eats / Vy Tran\nTo roast peanuts, preheat oven to 350°F (180°C). Place peanuts on a baking sheet lined with foil and roast until golden, 10-12 minutes; check frequently to make sure they don't burn. Allow to cool, then roughly chop.\nSerious Eats / Vy Tran\nWhen ready to serve, toss the chicken salad with the fresh coriander and perilla and top with the reserved fried shallots and roasted peanuts. Serve with the ginger dipping sauce.\nSerious Eats / Vy Tran\nSpecial Equipment\nMandoline, mortar and pestle, instant-read or deep-fry thermometer\nNotes\nUse a mandoline or the shredding disc attachment of a food processor for easier and faster slicing of the shallot and cabbage.\nA mandoline will also create the most even rounds of shallot for frying.\nI prefer a combination of green and purple cabbage for a vibrant mix of color in the salad. Feel free to use 5 cups of all green or all purple cabbage in the recipe instead of a combination of the 2 types of cabbage.\nThis salad is a great way to use leftover chicken you already have on hand. Omit step 4 and use 2 to 3 cups shredded chicken (dark or white meat will both work well).\nMake-Ahead and Storage\nThe dipping sauce can be refrigerated in an airtight container for up to 2 days.\nThe fried shallots can be stored in an airtight container at room temperature for up to 2 months.\nThe Latest\nMains\nCabbage\nChicken Breast\nVietnamese"
}