{
  "url": "https://www.seriouseats.com/vietnamese-pork-stuffed-tomatoes-recipe-11761186",
  "image_url": "https://www.seriouseats.com/thmb/9vQ40HkCihYnRbx3EcO545jWCgI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250624-SEA-Vietnameseporkstuffedtomatoes-VyTran-HERO-5330a7898a8145719a10119e872990d9.jpg",
  "tags": [
    "The Latest",
    "Recipes",
    "Recipes By Ingredients",
    "Vietnamese",
    "Summer Mains"
  ],
  "title": "Savory, Tangy, and Tender—These Vietnamese Stuffed Tomatoes Hit Every Note",
  "full_text": "Savory, Tangy, and Tender—These Vietnamese Stuffed Tomatoes Hit Every Note\nClose\nJump to recipe\nPrep\n35 mins\nCook\n20 mins\nTotal\n55 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\n10\nounces\n(\n284\ng\n)\nground pork\n, 10-20% fat\n18\ng\n(\n1\ntablespoon\n) dehydrated\nwood ear mushrooms\n2\nsmall\nscallions\n(\n16\ng\n) thinly sliced, green parts only (about\n1/4\ncup\n)\n1\nmedium\nshallot\n(\n21\ng\n), finely chopped (about\n2\ntablespoons\nchopped), divided\n4\ncloves\n(\n20\ng\n)\ngarlic, minced\n, divided\n1 1/2\nteaspoons\nDiamond Crystal kosher salt\n, divided; for table salt, use half as much by volume\n1\ntablespoon\nplus\n1\nteaspoon\nsugar\n, divided\n1/2\nteaspoon\nfreshly\nground black pepper\n, plus more for garnish\n7\nfresh ripe but firm\nmedium\ntomatoes\n(about 4 ounces per tomato, roughly 2.5 inches in diameter each), see notes\n3\ntablespoons\n(\n45\nml\n)\nneutral oil such as vegetable oil\n, divided\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n, see notes\n1\ntablespoon\nchopped cilantro\nfor serving\nSteamed white\njasmine rice\nfor serving\nDirections\nOn a medium plate lined with paper towels, set ground pork to absorb excess moisture for 5 to 10 minutes.\nIn a small bowl, soak wood ear mushrooms in hot water until softened, 10 minutes. Drain and squeeze out excess water from mushrooms. Chop mushrooms into small pieces. (You should have about 2 tablespoons chopped mushrooms.)\nSerious Eats/ Vy Tran\nIn a large bowl, combine pork, chopped mushrooms, scallions, 1 tablespoon shallot, half of the garlic, salt, 1 teaspoon sugar, and freshly ground pepper. Mix well with spoon or hands and set aside for 30 minutes.\nSerious Eats/ Vy Tran\nWhile the meat mixture sits, with a sharp knife, cut 6 tomatoes in half crosswise. Use a small metal spoon to gently scoop out pulp, seeds, and juice into a bowl. Chop pulp and remaining 1 tomato and add to bowl with seeds and juice. Dry insides of now-empty tomato halves with paper towels.\nSerious Eats/ Vy Tran\nUse a small metal spoon to scoop pork mixture into tomato halves and press firmly, making sure to get filling into crevices.\nSerious Eats/ Vy Tran\nIn a large nonstick skillet, heat 1 1/2 tablespoons oil over medium-high heat until shimmering. Add tomatoes, meat-side down, and sear, without moving, until the meat forms a golden-brown crust, about 5 minutes. Using a thin spatula, carefully remove tomatoes from pan and transfer to a large plate, meat-side up.\nSerious Eats/ Vy Tran\nLower heat to medium. Add remaining 1 1/2 tablespoons oil and remaining shallot to skillet and cook until softened, about 1 minute. Add remaining garlic and cook until fragrant, about 1 minute. Add tomato pulp, 1/2 cup water, fish sauce, and remaining 1 tablespoon sugar and bring to a boil over medium-high heat, about 3 minutes.\nSerious Eats/ Vy Tran\nTurn heat down to medium-low, add tomatoes back to pan, meat-side up. Simmer partially covered, occasionally spooning sauce over the tomatoes with a metal spoon, until pork filling is cooked through and registers at least 140℉ (60℃), 8 to 14 minutes. Tomatoes should be soft but maintain their shape. Use a thin spatula to carefully transfer cooked tomatoes to a serving platter.\nSerious Eats/ Vy Tran\nIncrease heat to medium and cook sauce until glossy and slightly thickened, about 5 minutes. Spoon sauce over tomatoes. Garnish with cilantro and freshly ground pepper, and serve with jasmine rice.\nSerious Eats/ Vy Tran\nSpecial Equipment\nLarge nonstick skillet, thin spatula\nNotes\nDehydrated wood ear mushrooms can be found in most Asian food markets.\nIt’s important to use tomatoes that are all roughly the same size to ensure a similar rate of cooking. If you’re using larger tomatoes, the cooking time will be slightly different. I recommend vine on tomatoes, such as Beefsteak, Cherokee purple, Ozark Pink, or Berkeley Tie-dye pink.\nFor the fish sauce, I recommend using 3 Crab or Red Boat brands.\nMake-Ahead and Storage\nThe filling can be made 2 days ahead and stored in a lidded container in the fridge.\nThe Latest\nRecipes\nRecipes By Ingredients\nVietnamese\nSummer Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/savory-tangy-and-tenderthese-vietnamese-stuffed-tomatoes-hit-every-note.webp?"
}