{
  "url": "https://www.seriouseats.com/vodka-pizza-recipe",
  "image_url": "https://www.seriouseats.com/thmb/5Str9Erg6_LQ2FaEzrXV_eUg_Wo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__04__20130320-vodka-pizza-2a-4518f3c690654147ac13cd3a93522aed.jpg",
  "tags": [
    "Pizza",
    "Italian-American",
    "Tomato Sauces"
  ],
  "title": "Vodka Pizza",
  "full_text": "Vodka Pizza\nClose\nJump to recipe\nPrep\n15 mins\nCook\n90 mins\nActive\n60 mins\nCooling Time\n5 mins\nTotal\n110 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\ntablespoons\nextra-virgin olive oil\n, plus more for drizzling\n4\nmedium\ncloves garlic\n, minced (about\n4\nteaspoons\n)\n1\nteaspoon\ndried oregano\n1/2\nteaspoon\nred pepper flakes\n1\n(28-ounce) can\nwhole peeled tomatoes\n, roughly broken up by hand\n1\ncup\nheavy cream\n1/3\ncup\nvodka\nKosher salt\nand freshly ground black pepper\n1\nrecipe\nbasic New York pizza dough\n, divided and risen at least 2 hours (see notes)\n1\npound\nfresh mozzarella\n(preferably buffalo milk), torn into rough 3/4- to 1-inch chunks and drained in a fine-mesh strainer set over a bowl\n12 to 16\nbasil\nleaves\nDirections\nHeat olive oil in a medium saucepan over medium heat until shimmering. Add garlic, oregano, and pepper flakes and cook, stirring constantly, until fragrant, about 1 minute. Add tomatoes. Increase heat to high, bring to a boil, then reduce to a bare simmer. Cook, stirring occasionally, until reduced by 1/4, about 20 minutes. Add heavy cream, increase heat to bring to a boil, reduce to a simmer, and continue to cook until reduced again by 1/4, about 20 minutes longer. Add vodka and cook for 7 minutes. Remove from heat and season to taste with salt and pepper.\nLet sauce cool slightly, then transfer half of sauce to the jar of a blender. Blend, starting on lowest speed and gradually increasing to high until completely smooth, about 2 minutes total. Strain through a fine-mesh strainer into a medium bowl. Repeat with remaining half of sauce. (For storing extra sauce, see Make-Ahead and Storage below).\nAt least 45 minutes before baking, place a baking stone or steel on an oven rack set to the top position and preheat oven to 550°F (290°C).\nTurn single dough ball out onto lightly flour surface. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough by draping over knuckles into a 12 to 14-inch circle about 1/4-inch thick. Transfer to pizza peel.\nSpread approximately 3/4 cup of sauce evenly over surface of crust, leaving 1/2 to 1-inch border along edge. Place 8 to 10 chunks of mozzarella evenly over surface of pizza and scatter with 4 to 5 basil leaves. Drizzle with about 1 tablespoon extra-virgin olive oil and sprinkle with salt. Slide pizza onto stone or steel and bake until cheese is melted and crust underbelly is spotty brown, 6 to 12 minutes total. Remove from oven with metal pizza peel, transfer to cutting board, slice, and serve. Repeat steps 3 and 4 with remaining ingredients to make 2 additional pizzas.\nSpecial Equipment\nBlender\n,\nfine-mesh strainer\n,\nbaking stone or steel\n,\npizza peel\nNotes\nStore-bought dough can be used in place of homemade. Use about 10 ounces of store-bought dough per pizza.\nMake-Ahead and Storage\nThis recipe will make more sauce than is needed for three pizzas. Extra sauce can be stored in a sealed container in the refrigerator for up to 1 week. Serve with pasta, if desired.\nRead More\nNew York-Style Pizza Recipe\nPenne alla Vodka Recipe\n11 Essential Tips for Better Pizza\nIt's Not Delivery, It's 24 Homemade Pizza Recipes\nPizza\nItalian-American\nTomato Sauces"
}