{
  "url": "https://www.seriouseats.com/waffle-iron-hash-browns-potato-recipe",
  "image_url": "https://www.seriouseats.com/thmb/LTRoS8taIcNde5295uzYOtjIdk4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-hero-04-0965f820669b44d790b1882d8725cc0e.JPG",
  "tags": [
    "Hash Browns",
    "Russet Potatoes",
    "Easter Side Dishes",
    "Mother's Day",
    "Father's Day"
  ],
  "title": "Waffle Iron Hash Browns Recipe",
  "full_text": "Waffle Iron Hash Browns Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n30 mins\nActive\n10 mins\nTotal\n40 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nrusset\n(baking)\npotatoes\n, about\n10 ounces\neach, peeled and shredded\n1/2\nteaspoon\nkosher salt\n3/4\nteaspoon\nfreshly\nground black pepper\n2\nteaspoons\nunsalted butter\nDirections\nPreheat waffle iron. If it has temperature controls, set it to medium.\nSerious Eats / Julia Estrada\nSqueeze shredded potato with a towel until it’s as dry as possible.\nSerious Eats / Julia Estrada\nIn a mixing bowl, combine shredded potato, salt, and pepper.\nSerious Eats / Julia Estrada\nUsing a silicone brush or paper towel, carefully grease both sides of waffle iron with butter.\nSerious Eats / Julia Estrada\nPile shredded potatoes into waffle iron, over-stuffing it a bit, and close lid. (The pressure of the lid will compress the potatoes and help them emerge as a cohesive, waffled unit.) Cook for 2 minutes, then press down on lid to further compress potatoes (be careful: lid may be hot).\nSerious Eats / Julia Estrada\nContinue cooking potatoes for 5 minutes longer, then begin checking them: They are ready when potatoes are golden brown all over, about 1 to 2 minutes longer. Serve hot with eggs or any other breakfast foods.\nSerious Eats / Julia Estrada\nSpecial Equipment\nWaffle iron\nNotes\nThe liquid squeezed from the potatoes can be reserved and used in place of water in bread dough to yield a softer, moister loaf. The times given are approximations: The actual cooking time will depend on the specific waffle iron you have, and the size of the grated potato shreds. Be sure to peek inside the waffle iron and remove the hash browns whenever they're browned outside and fully cooked within, regardless of whether that takes more or less time than the recipe states.\nHash Browns\nRusset Potatoes\nEaster Side Dishes\nMother's Day\nFather's Day"
}