{
  "url": "https://www.seriouseats.com/waffle-cone-recipe",
  "image_url": null,
  "tags": [
    "Summer Desserts",
    "Pastries",
    "Cookies",
    "Ice Cream"
  ],
  "title": "Waffle Cones",
  "full_text": "Waffle Cones\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\nAbout 30 mins\nResting and Cooling Time\n25 mins\nTotal\n60 mins\nServes\n8 cones\nCook Mode\n(Keep screen awake)\nIngredients\n3\nounces\negg whites\n(about\n1/3\ncup\nplus\n1\ntablespoon\n;\n85\ng\n), from\n3\nlarge\neggs\n1 3/4\nounces\nwhite sugar\n(about\n1/4\ncup;\n50\ng\n)\n1 1/4\nounces\nbrown sugar\n(about\n3\ntablespoons\n, not packed;\n35\ng\n)\n1\nounce\nhoney\n(about\n1 1/2\ntablespoons\n;\n28\ng\n)\n1\nounce\nroasted hazelnut oil\n(about\n2 1/2\ntablespoons\n;\n28\ng\n), see note\n1/4\nounce\nwater\n(about\n1 1/2\nteaspoons\n;\n7\ng\n)\n1/4\nounce\nrum\n, vanilla, or additional water (about\n1 1/2\nteaspoons\n;\n7\ng\n)\n1/4\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n1/4\nteaspoon\nbaking soda\n3\nounces\nbread flour\n, sifted (about\n2/3\ncup\n, spooned;\n85\ng\n)\nNeutral cooking spray\n, such as Pam Original, for greasing the iron\nDirections\nAt least 30 minutes in advance, plug in the waffle maker and preheat to 300°F (150°C); on machines that lack specific settings, start with the medium setting and adjust as needed along the way. If a machine does not allow for temperature control, the ideal time for a given amount of batter will need to be determined individually.\nIn a medium bowl, combine egg whites, sugar, brown sugar, honey, hazelnut oil, water, rum or vanilla, salt, and baking soda. With a balloon whisk, mix vigorously for a full minute to ensure the baking soda is perfectly homogenized into the batter. Undermixing at this stage can produce waffle cones with a very uneven color and texture.\nSerious Eats / Vicky Wasik\nSift in bread flour, and whisk until very well combined. With a flexible spatula, scrape and fold the batter several times to ensure perfect uniformity, paying particular care to the batter splashed up the sides. Rushing this step can produce waffle cones with an uneven texture. Let the batter stand 10 minutes before proceeding to the next step; if not briefly rested, the dough may be too thin, lacy, and brittle.\nSpritz the plates of the waffle iron with a neutral pan spray, then add approximately 1 1/4 ounces (2 tablespoons) batter onto the center. Close the iron firmly and cook until the wafer is uniformly golden brown, about 85 seconds to 2 minutes. The exact cooking time and temperature will vary drastically from machine to machine; the idea is to find a setting and time that will cook the wafer at a gentle pace, helping drive out moisture without browning too fast. When cooked too fast, the wafer will be brittle and difficult to shape. When cooked too slow, the wafer will be pale, and will not crisp fully once cool.\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nTo Shape a Waffle Cone:\nPlace a hot wafer on a relatively non-conductive work surface, such as a clean kitchen towel or a cutting board. Set the waffle cone form on top, so that its tip is about 1/4 inch from the edge of the wafer, around the 10 o'clock mark. Fold the upper portion of the wafer over the form, and press firmly at the tip to create a seal. Roll the form over, working bit by bit to keep the wafer tight against the form, until you reach the outer edge. Hold the waffle cone firmly in place, seam side down, until cool enough to maintain its own shape, 30 to 45 seconds. Shaping the waffle cone is a skill, and will require a certain degree of practice to master. Transfer shaped cone to a wire rack to cool completely, about 15 minutes.\nSerious Eats / Vicky Wasik\nTo Shape a Waffle Bowl:\nPlace a small bowl or ramekin, preferably one with smooth, rounded edges, upside down on a work surface, and have a second, identical bowl or ramekin at the ready. Immediately after griddling, place a hot wafer over the inverted ramekin, then place the second ramekin on top and gently press to nestle the two together. If desired, the excess wafer can be shaped by hand, to create a \"frill\" around the edges. When the wafer is cool enough to hold its own shape, remove from the ramekins (if left too long, it may stick to either ramekin).\nSerious Eats / Vicky Wasik\nSerious Eats / Vicky Wasik\nRepeat cooking and shaping procedure with remaining batter, spraying the iron with cooking spray in between each wafer. As soon as the waffle cones or bowls have cooled to room temperature, immediately transfer to an airtight container. The waffle cones and bowls are extremely susceptible to the effects of humidity, and can begin softening in as little as 15 minutes if left in the open. Likewise, if stored in a container while warm, the waffle cones and bowls may steam themselves and soften. But if properly cooked and well protected from air, the cones and bowls will keep for a week or more at cool room temperature. Small sandwich-sized zip-top bags are ideal for protecting and storing individual cones or bowls.\nSpecial Equipment\nElectric waffle cone maker and form, 2-tablespoon\ncookie scoop\n(optional), 2 small ramekins (optional)\nNotes\nIf the wafer seems splotchy or pale, the most common cause is an undermixed batter. Following that, uneven color can be caused by uneven heating in a poor quality machine, or by insufficient preheating. Stir the batter thoroughly, and give the machine additional time to heat. If the following wafer remains pale or soft, increase the heat setting on the machine. Conversely, if the wafer seems burned or excessively dark, reduce the heat before making the next waffle (or else briefly unplug a machine with no dial), or try cooking the next wafer for less time.\nRoasted hazelnut oil can be substituted with roasted walnut, pecan, pistachio, or sesame oils. You can also use a neutral cooking oil without impacting the integrity of the batter, but the cone's flavor will be less nutty and complex.\nAs with any new piece of gear, waffle cone makers can require some practice to find the perfect heat settings and time, so give yourself room to learn and make a test round or two before any special occasions. A neutral inexpensive cooking oil can be used in place of hazelnut oil for test rounds.\nScrap pieces and rejects will still be tasty; try grinding them up into crumbs to use like graham crackers in your favorite cookie crumb crusts. Or, dip the broken wafers in\nthe chocolate coating of a homemade Klondike bar\n, then freeze until the coating sets and stir the chocolate-coated waffle pieces into your next batch of ice cream.\nMake-Ahead and Storage\nAs noted earlier, whatever the shape, the waffle wafers are quite vulnerable to humidity. In a humid kitchen, the cooled wafers can begin to soften in as little as 15 minutes, so store them promptly. By that same token, don't rush the cooling process—warm wafers will steam themselves soft in an airtight container.\nProperly cooled and stored in a truly airtight container, the waffle cones or bowls will keep for about a week at cool room temperature. To hedge your bets consider dividing them between a few different containers.\nRead More\nSugar Cone Ice Cream\nOur Favorite Ice Cream Recipes\nSummer Desserts\nPastries\nCookies\nIce Cream"
}