{
  "url": "https://www.seriouseats.com/warm-and-creamy-banana-pudding",
  "image_url": "https://www.seriouseats.com/thmb/Zqo-bVkipmY-D37qBgNPfLdH8vA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__12__20181127-banana-pudding-vicky-wasik-beauty1-7b36099e388b4774a6d70aa91bd6c8f2.jpg",
  "tags": [
    "Custards, Mousses & Puddings",
    "Banana"
  ],
  "title": "Creamy Banana-Flavored Pudding",
  "full_text": "Creamy Banana-Flavored Pudding\nClose\nJump to recipe\nPrep\n0 mins\nCook\n35 mins\nActive\n30 mins\nResting Time\n4 hrs\nTotal\n4 hrs 35 mins\nServes\n8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n28\nounces\nmilk\n,\nany percentage will do\n(about\n3 1/2\ncups\n;\n790\ng\n)\n16\nounces\npeeled, ripe\nbanana\nfrom about\n5\nmedium\nbananas, sliced into 1/2-inch pieces (about\n3\ncups\n;\n455\ng\n)\n1\nempty\nvanilla bean\npod\n, left over from another project, optional\n7\nounces\nplain or\ntoasted\nsugar\n(about\n1\ncup\n;\n195\ng\n)\n1 1/4\nounces\ncornstarch\n(about\n1/3\ncup\n;\n35\ng\n)\n1/2\nteaspoon\n(\n2\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\n1/8\nteaspoon\n(\n0.5\ng\n)\nground cloves\n5\nounces\negg yolk\n(from about\n10\nlarge\neggs\n;\n140\ng\n)\n1/4\nounce\nvanilla extract\n(\n1 1/2\nteaspoons\n;\n7\ng\n)\nDirections\nInfuse the Milk:\nCombine milk, sliced banana, and empty vanilla bean pod (if using) in 3-quart stainless steel saucier and bring to simmer over medium heat, stirring from time to time with flexible spatula to prevent scorching along bottom. When dairy comes to simmer, remove from heat, cover, and let stand until cooled to room temperature, about 4 hours. Proceed to next step or refrigerate up to 24 hours to extract stronger banana flavor. The exact timing will depend on both personal preference and convenience.\nMake the Custard:\nReturn banana milk to simmer over medium heat, stirring as before; then strain through a fine-mesh sieve into medium bowl. Press gently on banana pulp to release liquid, but don't allow pulp to pass through sieve. The pulp can be refrigerated to use in muffins, pancakes, or smoothies, but it will not benefit the custard. If using vanilla pod, scrape out the flavorful milk inside each half with flexible spatula before discarding.\nUsing same 3-quart saucier as before (no need to wash), whisk sugar, cornstarch, salt, and cloves together until well combined, followed by egg yolks. Whisk in infused milk. Return to stovetop and warm over medium-low heat, whisking gently until custard is steaming hot, about 5 minutes.\nIncrease heat to medium and continue cooking until custard thickens, about 5 minutes longer. When it begins to bubble, set timer and continue whisking for 90 seconds. This step is important to neutralize starch-dissolving protein found in egg yolks. Off heat, stir in vanilla extract and season to taste with additional vanilla, salt, or cloves, as needed. If desired, strain custard through same sieve as before (again, no need to wash) to remove bits of chalazae that may remain or any accidentally curdled custard.\nPortion warm custard into parfait dishes and serve immediately, plain or topped with toasted nuts, cocoa nibs, fresh fruit, unsweetened whipped cream, or whatever toppings you desire.\nSpecial Equipment\n3-quart stainless steel saucier\n,\nfine mesh sieve\n,\nflexible spatula\n,\nwhisk\nRead More\nHow Banana Pudding Became a Southern Icon\nLight and Silky Banana Crémeux Recipe\nBanana Cream Pie Recipe\nCustards, Mousses & Puddings\nBanana"
}