{
  "url": "https://www.seriouseats.com/wedge-salad-iceberg-blue-cheese-bacon-recipe",
  "image_url": null,
  "tags": [
    "Green Salads",
    "Blue Cheese",
    "Bacon",
    "Iceberg Lettuce",
    "Tomato"
  ],
  "title": "The Fully Loaded Iceberg Wedge Salad",
  "full_text": "The Fully Loaded Iceberg Wedge Salad\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nActive\n25 mins\nTotal\n20 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n2\nsmall\ntomatoes\n(about\n8\nounces\ntotal), diced\nKosher salt\n1\nsmall\nred onion\n, minced\nWhite wine vinegar\n, for soaking onion (see notes)\n4\nounces\nbacon\n, cut into 1/2-inch pieces\n2\nounces\n(about\n1/2\ncup\n)\nfresh bread crumbs\nFreshly ground black pepper\n1\nhead\niceberg lettuce\n, outer leaves discarded, quartered through core so that each quarter holds together\nButtermilk blue cheese dressing\n(you may not need the full recipe)\nMinced chives\n, for garnish\nDirections\nSet a fine-mesh strainer over a bowl and add diced tomatoes. Sprinkle liberally with salt and toss to combine. Place onion in a small bowl and pour enough vinegar on top to cover. Let tomatoes and onion stand while you prep the other ingredients.\nIn a small skillet, cook bacon over medium-high heat, stirring occasionally, until crisped, about 5 minutes. Using a slotted spoon, transfer to a paper towel–lined plate to drain. You should have about 2 tablespoons (30ml) rendered fat in the skillet. Add bread crumbs and cook over medium heat, stirring frequently, until browned and crisp, 3 to 4 minutes. Transfer to a paper towel–lined plate to drain and season liberally with salt and pepper.\nSerious Eats / Vicky Wasik\nArrange iceberg wedges on plates and spoon dressing over each. Drain quick-pickled onions and sprinkle all over salads, along with drained tomatoes (discard any extracted liquid), bacon, toasted bread crumbs, and chives. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFine-mesh strainer\n,\nslotted spoon\nGreen Salads\nBlue Cheese\nBacon\nIceberg Lettuce\nTomato"
}