{
  "url": "https://www.seriouseats.com/white-bean-tuna-salad",
  "image_url": "https://www.seriouseats.com/thmb/JW5-SSm1mDdLVylQRDyeNl-oYWU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__05__20200506-tuna-white-bean-salad-sasha-marx4-9f750beff5c040e59eb45beb0dbe3493.jpg",
  "tags": [
    "Southern European",
    "Italian",
    "White Beans",
    "Canned Fish",
    "Tuna"
  ],
  "title": "White Bean and Tuna Salad",
  "full_text": "White Bean and Tuna Salad\nClose\nJump to recipe\nPrep\n10 mins\nActive\n5 mins\nSoaking and Marinating Time\n20 mins\nTotal\n30 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\nmedium\nred onion\n(about\n4\nounces\n;\n116\ng\n), cut into 1/8-inch thick slices\n1\ntablespoon\n(\n15\nml\n) Champagne, white wine, or\nred wine vinegar\nplus extra for drizzling\nKosher salt\nand freshly ground black pepper\n3\ncups\n(\n1\npound\n6\nounces\n;\n625\ng\n) cooked dry white beans, drained, or\n2\n(15-ounce; 425 g) cans\nlow-sodium\nwhite beans, drained and rinsed\n(see note)\n5.6\nounces\n(\n160\ng\n)\nolive oil-packed tuna\nfrom\n2\n(3.88-ounce; 110 g) cans\n, preferably ventresca (tuna belly; see note), drained and gently flaked into 2-inch pieces\n1\nmedium\ngarlic clove\n(\n5\ng\n), minced or finely grated\n1\ntablespoon\n(\n15\nml\n)\nbean cooking liquid\n, from a pot of beans cooked from dry (see note if using canned beans)\n1/4\ncup\n(\n60\nml\n)\nextra-virgin olive oil\nplus extra for drizzling\n1/4\ncup\n(\n1/2\nounce\n;\n16\ng\n) finely chopped\nfresh parsley\nleaves and tender stems\nDirections\nIn a small bowl, combine red onion and enough ice water to cover. Using clean hands, gently scrunch and squeeze the onion slices, taking care not to crush or break them. Let onion slices sit in ice water for 15 minutes, then drain and discard ice water, and return red onion to now-empty bowl. Add vinegar and 1/4 teaspoon (1g) salt and toss and gently massage onions to evenly coat with vinegar and salt. Set aside for 5 minutes to allow onion slices to marinate.\nMeanwhile, combine beans and tuna in a large bowl. Once onions have marinated for 5 minutes, squeeze onion slices to release moisture into the bowl that they marinated in, then transfer onion slices to large bowl with beans and tuna; set large bowl aside.\nThere should be at least 1 tablespoon (15ml) of vinegar-onion juice liquid left in the small bowl. Add garlic, bean cooking liquid (or, if using canned beans, 2 teaspoons [10ml] water plus 1 teaspoon [5ml] Dijon mustard), and 1/4 teaspoon ground black pepper, and whisk to combine. Whisking constantly, slowly drizzle in olive oil. Stir in parsley and season to taste with salt.\nTransfer dressing to large bowl with bean-tuna mixture, using a rubber spatula to scrape all of the dressing into the large bowl. Gently toss salad to evenly coat with dressing, taking care not to crush tuna or beans in the process. Season to taste with salt and pepper. Divide salad between individual serving plates or one large serving platter, drizzle lightly with olive oil and a splash of vinegar, and serve.\nNotes\nBecause this dish is comprised of just a few ingredients, it's at its best when made with high-quality products. Cooked dried beans (and their cooking liquid) have much better flavor and texture than canned beans, so we highly recommend using them in this recipe, if possible.\nThe quality of the tuna you use will make a difference here. We recommend oil-packed ventresca tuna, which comes from the richer, fattier belly; it's moister and more flavorful than other canned or jarred tuna. We like the ventresca from both Ortiz and Tonnino.\nIf using canned beans, substitute bean cooking liquid with 2 teaspoons (10ml) water and 1 teaspoon (5ml) Dijon mustard. The flavor of the dish obviously won't be exactly the same, but mustard provides similar emulsifying properties as the bean cooking liquid for the dressing.\nMake-Ahead and Storage\nThis salad is at its best the day it's made, but can be refrigerated in an airtight container for up to 2 days. Bring to cool room temperature before serving.\nRead More\nEnsalada de Tomate con Ventresca de Atún (Spanish-Style Tomato and Ventresaca Tuna Salad) Recipe\nNorth African Tuna and Rice Salad Recipe\nBean Salad Recipe with Radicchio, Radish, Pickled Onions, and Marcona Almonds Recipe\nWarm Spanish-Style Giant-Bean Salad With Smoked Paprika and Celery Recipe\nQuick-Marinated White Bean Salad and Feta Lettuce Cups Recipe\nSouthern European\nItalian\nWhite Beans\nCanned Fish\nTuna",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/white-bean-and-tuna-salad.webp?"
}