{
  "url": "https://www.seriouseats.com/white-chili-with-chicken-best",
  "image_url": "https://www.seriouseats.com/thmb/I-0rWqlqYEkdllAwEVp5WiX3pLk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-SoupsandStewsMPP-BestWhiteChiliwithChicken-GregDupree-a02bf937d51c4ce3a9eec3bcc83807c9.jpg",
  "tags": [
    "Braised & Stewed Chicken",
    "White Beans",
    "Chicken Breast",
    "Poblano Peppers",
    "Chicken Mains"
  ],
  "title": "The Best White Chili With Chicken",
  "full_text": "The Best White Chili With Chicken\nClose\nJump to recipe\nPrep\n10 mins\nCook\n110 mins\nActive\n75 mins\nSoaking Time\n8 hrs\nTotal\n10 hrs\nServes\n6\nto 8 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\npound\ndried\nsmall white (Navy) beans\n,\nGreat Northern beans\n, or\ncannellini beans\n(see note)\nKosher salt\n2\nfresh poblano\nchiles\n4\nfresh Anaheim\nor Hatch\nchiles\n2\njalapeño\nchiles\n1\nmedium\nonion\n, peeled, trimmed, and split in halt from top to bottom\n8\nmedium cloves\ngarlic\n3\ntablespoons\nvegetable\nor\ncanola oil\n, divided\n1\nquart\nhomemade\nor store-bought\nlow-sodium chicken stock\n1\nwhole\npickled jalapeño pepper\n, plus\n2\ntablespoons\npickling liquid\nfrom the can\n1\ntablespoon\nground cumin\n1\nteaspoon\nground coriander seeds\n4\n(\n8-ounce\n)\nboneless skinless chicken breast\nhalves\n1\npound\nshredded pepper Jack cheese\n, divided\n2\ntablespoons\nfresh juice\nfrom\n2\nwhole\nlimes\n, plus\n1\nwhole\nlime\ncut into wedges for serving\n1\ncup\nroughly chopped fresh cilantro\nleaves, divided\n4 to 6\nscallions\n, white and light green parts only, thinly sliced\nDirections\nCover beans with 1 gallon (4 quarts) water. Add 1/4 cup salt and stir until dissolved. Cover and let rest at room temperature at least 8 hours and up to 24. Drain and rinse beans.\nAdjust broiler rack to 8 inches below broiler element and preheat broiler to high. Place poblanos, Anaheims, jalapeños, onion, and garlic on a foil-lined rimmed baking sheet. Toss with 1 tablespoon oil using your hands to coat. Season with salt. Place under broiler and broil, turning peppers and rearranging vegetables occasionally, until peppers are blackened on all sides and skins are wrinkled all over, 15 to 20 minutes total. Gather up foil and form a sealed pouch. Let chiles rest for 5 minutes.\nSerious Eats / J. Kenji López-Alt\nPlace chiles and chicken stock in a large bowl. Peel chiles under the chicken stock, leaving skins and seeds behind. Transfer chile flesh to the cup of a hand blender or a standing blender. Add broiled onion, broiled garlic, and the canned jalapeño (do not add jalapeño pickling liquid). Blend until a smooth purée is formed. Set aside.\nSerious Eats /J. Kenji López-Alt\nHeat remaining 2 tablespoons oil in a large Dutch oven over medium heat until shimmering. Add cumin and coriander and cook, stirring, until fragrant, about 30 seconds. Add chile purée and cook, stirring, until incorporated. Strain chicken stock into pot, pressing on skins and seeds to extract as much liquid as possible. Discard skins and seeds.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nAdd soaked beans and chicken breasts to pot, adding water as necessary until beans and chicken are fully submerged. Bring to a boil, reduce to a bare simmer and cook, stirring occasionally, until chicken breasts register 150°F (66°C) on an instant-read thermometer, about 15 minutes.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nTransfer chicken breasts to a bowl and let rest. Continue simmering broth and beans until beans are fully tender, about 1 hour total. Remove 1 1/2 cups of beans and their liquid and transfer to a standing blender or the work cup of an immersion blender. Blend until completely smooth. Stir back into pot.\nSerious Eats / J. Kenji López-Alt\nShred chicken into bite-size pieces and stir back into stew. Stir in half of cheese until melted. Stir in jalapeño pickling liquid, lime juice, and half of cilantro. Season to taste with salt.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nServe immediately with extra shredded cheese, lime wedges, cilantro, and scallions.\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nDutch oven\n,\nimmersion blender\nor\ncountertop blender\n,\ndigital thermometer\nNotes\nThis recipe can be made with canned beans in place of soaked. Use four (15-ounce) cans of drained, rinsed cannellini beans. Start from step 2 and reduce simmering time in step 4 to 30 minutes.\nRead More\nCrispy Braised Chicken With White Beans and Chile Verde Recipe\nWhite Chili With Roast Turkey or Chicken Recipe\nChile Verde With Pork Recipe\nOur Favorite Chili Recipes\nBraised & Stewed Chicken\nWhite Beans\nChicken Breast\nPoblano Peppers\nChicken Mains",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/the-best-white-chili-with-chicken.webp?"
}