{
  "url": "https://www.seriouseats.com/white-chocolate-cheesecake-cherry-topping-recipe",
  "image_url": "https://www.seriouseats.com/thmb/qXyKBXp9XnvjKPLqP6HsPu40_f4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__02__20120205whitechocolateresized-f1b26c2a6da74737b04d0a8a9bb568fc.jpg",
  "tags": [
    "Cheesecakes",
    "Chocolate",
    "Cherry",
    "Cakes"
  ],
  "title": "White Chocolate Cheesecake with Cherry Topping",
  "full_text": "White Chocolate Cheesecake with Cherry Topping\nClose\nJump to recipe\nPrep\n15 mins\nCook\n95 mins\nActive\n30 mins\nResting and Chilling Time\n5 hrs\nTotal\n6 hrs 50 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\nNonstick baking spray\n8\nounces\ngraham crackers\n, finely crushed\n7\ntablespoons\nunsalted butter\n, melted\n12\nounces\nwhite chocolate\n, finely chopped\n1\npound\ncream cheese\n, softened\n1/2\ncup\ngranulated sugar\n3\nlarge\neggs\n2 1/2\ncups\nsour cream\n2\ntablespoons\nfresh lemon juice\n1\nteaspoon\npure\nvanilla extract\n1\n(15-ounce) can\ncherry pie filling\n(see notes)\nDirections\nAdjust oven rack to middle position and heat oven to 350°F (180°C). Lightly spray inside of 9-inch springform pan with nonstick baking spray. In medium bowl, stir together graham cracker crumbs and butter to moisten. Firmly press into bottom of springform pan. Bake until edges are just starting to turn golden, about 15 minutes. Remove pan from oven. Reduce oven temperature to 325°F (160°C).\nIn heatproof bowl set over pan of barely simmering water, gently heat white chocolate until melted. Remove from heat. Be careful to not let any water get into the chocolate, and don't overcook it.\nIn standing mixer fitted with paddle attachment, cream cream cheese and sugar on medium speed until smooth, about 2 minutes, turning off mixer and scraping down paddle and sides of bowl as necessary. Add eggs, one by one, until smooth, scraping bowl as necessary. Mix in sour cream, lemon juice, and vanilla until smooth. Mix in melted white chocolate until smooth.\nWrap outside of springform pan with foil to create a waterproof seal. Pour batter into springform pan and set into large roasting pan. Place roasting pan in oven and fill with 1 inch hot water.\nBake until edges are set and center jiggles just slightly, 60 to 75 minutes. Turn oven off and let cheesecake sit 1 hour. Remove cheesecake from roasting pan and chill in refrigerator until completely cold and set, 4 to 6 hours.\nRun a sharp knife around the inside of the springform pan and remove ring. Spoon cherry topping over cheesecake and serve, dipping a knife into hot water for easy slicing.\nSpecial Equipment\n9-inch springform pan, large roasting pan, aluminum foil, standing mixer fitted with paddle attachment\nNotes\nIf canned cherries aren't your thing, they can be replaced with any kind of berry (raspberries, blackberries, blueberries), white chocolate shavings, or just left plain.\nRead More\nLemon-Ricotta Cheesecake\nNo Bake Greek Yogurt Cheesecake\nThe Best Easy Cherry Pie\nCheesecakes\nChocolate\nCherry\nCakes",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/white-chocolate-cheesecake-with-cherry-topping.webp?"
}