{
  "url": "https://www.seriouseats.com/white-sesame-pistachio-crunch-ice-cream-recipe",
  "image_url": "https://www.seriouseats.com/thmb/uNf9fUfyYBG248D6t3Aslwtzh28=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130211-white-sesame-ice-cream-0757c2f4778a4fac8150f722712a9f4a.jpg",
  "tags": [
    "Ice Cream",
    "Pistachios",
    "Sesame & Tahini"
  ],
  "title": "White Sesame Pistachio Crunch Ice Cream Recipe",
  "full_text": "White Sesame Pistachio Crunch Ice Cream Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n20 mins\nActive\n60 mins\nChilling Time\n6 hrs\nTotal\n6 hrs 35 mins\nMakes\n1 quart\nCook Mode\n(Keep screen awake)\nIngredients\n1/2\ncup\nfreshly toasted\nwhite sesame seeds\n1\ncup\nmilk\n2\ncups\ncream\n6\nmedium\negg yolks\n3/4\ncup\nsugar\n2\nteaspoons\norange zest\n1/2\nteaspoon\nvanilla extract\n1\nteaspoon\nsalt\n, to taste\n1/2\ncup\n(\n2\nounces\n) freshly toasted\npistachios\n, chilled in freezer\nFor Serving:\n1/4\ncup\npomegranate molasses\nDirections\nGrind freshly toasted sesame seeds in blender on medium speed for 10 seconds, until they are mostly pulverized. Pour in about 1/2 cup milk and blend for another 10 seconds until a fine paste forms. Add remaining milk and cream and blend on high for 30 seconds, until well combined.\nIn a medium heavy-bottomed saucepan, whisk together egg yolks and sugar until pale in color and lightly thickened. Pour in dairy, whisk to combine, and cook on medium heat, whisking frequently, until a custard forms on the back of a spoon and a swiped finger leaves a clean line. Strain custard into an airtight container, pressing on sesame solids to extract all liquid.\nStir in orange zest and vanilla extract, then salt to taste. Chill at least 6 hours or overnight in refrigerator, then churn the next day according to manufacturer's instructions. In the last minute of churning, add pistachios.\nTransfer churned ice cream to airtight container and chill in freezer for at least 4 hours before serving. To serve, top each bowl with 1 to 2 teaspoons of pomegranate molasses.\nSpecial equipment\nblender, ice cream maker\nNotes\nYou can find pomegranate molasses in Middle Eastern groceries, likely near the rose or orange blossom water. It's an optional topping for this ice cream, though highly recommended.\nIce Cream\nPistachios\nSesame & Tahini"
}