{
  "url": "https://www.seriouseats.com/white-chocolate-and-raspberry-frozen-mousse-bombes-recipe",
  "image_url": "https://www.seriouseats.com/thmb/lSYg2T9-N5x9-lzHR8Dyj6jYwPI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__02__20120127-188620-mousse-bombes-610x458-21-7ca1a9ca5b724af8bb9644837cc54674.jpg",
  "tags": [
    "Cakes",
    "Pastries",
    "Chocolate",
    "Raspberry"
  ],
  "title": "White Chocolate and Raspberry Frozen Mousse Bombes Recipe",
  "full_text": "White Chocolate and Raspberry Frozen Mousse Bombes Recipe\nClose\nJump to recipe\nPrep\n35 mins\nCook\n65 mins\nActive\n60 mins\nCooling Time\n4 hrs 45 mins\nTotal\n6 hrs 25 mins\nServes\n6 bombes\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Shells:\n4\nounces\nwhite chocolate\n, melted and tempered\nFor the Cake:\n8\nounces\nbutter\n10\nounces\nsugar\n2\neggs\n3\nyolks\n2\nounces\ncocoa\n8.25\nounces\nall-purpose flour\n1/2\nteaspoon\nbaking soda\n1/2\nteaspoon\nbaking powder\n1/2\nteaspoon\nsalt\n8.5\nounces\nbuttermilk\nFor the Mousse:\n5.25\nounces\nwhite chocolate\n2\nounces\nheavy cream\n1\nteaspoon\ngelatin\n, bloomed in\n2\ntablespoons\nwater\n1\npinch\nsalt\n2\negg yolks\n6\nounces\nheavy cream\n, whipped to soft peaks and chilled\nFrozen raspberries\nfor the center\nFor the Raspberry Sauce:\n16\nounces\nfrozen raspberries\n4\nounces\ngranulated sugar\nDirections\nTo Prepare the Molds\n: Place dome mold sheet onto a sheet pan. Using a pastry brush, paint melted, tempered chocolate evenly on surface of each mold cavity, making sure chocolate goes straight to the edge. Place molds into fridge to set.\nTo Prepare the Cake\n: Preheat oven to 350°F (180°C). Make an X with butter on surface of a rimmed baking sheet, then line it with parchment. In the bowl of a stand mixer fitted with paddle attachment, cream butter and sugar on high speed until light and fluffy, scraping down sides of bowl periodically. Add eggs and yolks one at a time, mixing well after each addition. Sift dry ingredients together. Turn mixer down to low speed and add half of the dry ingredients, followed by half the buttermilk. Mix on low until just incorporated, then add rest of the dry ingredients and buttermilk and mix until just incorporated. Remove bowl from stand mixer and finish mixing by hand with a large rubber spatula. Pour batter into prepared pan and spread it out evenly with an offset spatula.\nBake cake for 15 to 20 minutes, rotating halfway through, until tester inserted into center comes out clean and cake begins to pull away from sides of pan. Allow cake to cool for 15 minutes in pan, then run paring knife around edges. Place a piece of parchment on cake, followed by an inverted sheet pan, then turn cake upside down. Gently peel back top parchment from cake and allow cake to rest for 10 minutes before punching out circles with round cutter the same size as mold cavities.\nTo Prepare the Mousse:\nIn a large bowl set over simmering water, melt white chocolate. Add the 2 ounces of cream a little at a time, stirring until mixture becomes smooth and warm to the touch. Melt bloomed gelatin in microwave (stop every 15 seconds to check) and stir into chocolate mixture. In a separate bowl, whisk together egg yolks and salt, then gradually whisk it into chocolate mixture. Continue whisking chocolate mixture for 1 minute over double broiler, then remove bowl from heat. Place bowl in fridge to cool to room temperature (mixture should be neither warm nor cold, about 20 minutes). Whisk firmed chocolate mixture to smooth it out. Stir 1/4 of the chilled whipped cream into chocolate mixture to lighten it, then gently fold in remaining cream.\nTo Assemble the Bombes:\nPlace mousse in a piping bag and pipe it into each chilled chocolate mold, taking care to only fill just to the top. Place a raspberry or two into each bombe and smooth mousse over top. Place a circle of cake over each mold and gently press cake into mousse. Place sheet pan of molds in freezer and allow them to set for at least 4 hours.\nTo Make the Sauce:\nPlace frozen raspberries and sugar in a saucepan over low heat, stirring occasionally. As raspberries begin to melt, stir to help break them up. When fruit begins to simmer, remove from heat. Press fruit pulp and juice through a fine-mesh strainer. Discard seeds and chill sauce.\nTo Serve:\nPlace a tablespoon of sauce onto each plate. Create a design by dragging the back of a spoon through sauce. Loosen edges of bombes, then turn each cavity inside out to unmold them. Let bombes sit for 20 minutes to allow cake time to thaw, then carefully place bombes onto prepared plates and serve.\nSpecial Equipment\n3-inch silicone dome molds,\nrimmed baking sheets\n,\nstand mixer\n, 3-inch round cutter, piping bag, saucepan\nNotes\nThe cake recipe is meant to fit in a standard jelly roll pan, and you will have leftovers. If you have a half-sized sheet pan, you may cut the recipe in half.\nRead More\nChocolate Mousse\nThe Best White Chocolate\nThe Best Way to Temper Chocolate\nCakes\nPastries\nChocolate\nRaspberry",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/white-chocolate-and-raspberry-frozen-mousse-bombes-recipe.webp?"
}