{
  "url": "https://www.seriouseats.com/whole-roasted-fish-oregano-parsley-lemon-recipe",
  "image_url": null,
  "tags": [
    "Seafood Mains",
    "Gluten-free Mains",
    "Roasted Seafood",
    "Fish",
    "Oregano"
  ],
  "title": "Whole Roasted Fish With Fresh Herbs and Lemon Recipe",
  "full_text": "Whole Roasted Fish With Fresh Herbs and Lemon Recipe\nJump to recipe\nPrep\n20 mins\nCook\n20 mins\nActive\n15 mins\nResting Time\n5 mins\nTotal\n45 mins\nServes\n4 servings\nCook Mode\n(Keep screen awake)\nIngredients\n3\ntablespoons\nDiamond Crystal\nkosher salt\n(\n1 ¼\nounces\n;\n36\ng\n), plus more for seasoning; for table salt use half as much by volume or the same weight\nTwo\n1- to 2-pound\n(\n450 to 900\ng\n) head-on,\nwhole white-fleshed fish\n, such as sea bass, snapper, branzino, or porgy, scaled and gutted\nFreshly\nground black pepper\nExtra-virgin olive oil\n, for rubbing and drizzling\n1\nlemon\n, sliced thinly crosswise into rounds, for stuffing the cavity\nFresh herb\nsprigs\nsuch as parsley, tarragon, or oregano, for stuffing the cavity\nDirections\nFill a large bowl with 2 quarts (1.9L) room-temperature water and add salt, stirring to dissolve. Add fish and let soak for 10 minutes. Drain fish and pat dry inside and out with paper towels.\nPreheat oven to 400°F (205°C) and position rack in center of oven. Line a rimmed baking sheet with parchment paper. Season fish inside and out with salt and pepper and rub inside and out with olive oil. Stuff belly cavity lemon slices and herb sprigs.\nRoast fish until an instant-read thermometer inserted into thickest part registers 135°F (57°C), about 20 minutes for 1-pound fish and 25 minutes for 2-pound fish, depending on dimensions of fish. Alternatively, roast until fins come right off when pulled and flesh can be felt to flake under the skin when you press on it. Let rest 5 minutes. Serve, following\nour guide to filleting a whole cooked fish\n. Drizzle with additional olive oil, if desired.\nSpecial Equipment\nInstant-read thermometer\n,\nrimmed baking sheet\nThis Recipe Appears In\nHow to Carve and Serve Whole Cooked Fish\nSeafood Mains\nGluten-free Mains\nRoasted Seafood\nFish\nOregano"
}