{
  "url": "https://www.seriouseats.com/whole-roasted-suckling-pig-recipe",
  "image_url": "https://www.seriouseats.com/thmb/g2PyHmP61A9zXGxTHsHrOSelt0c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20111204-suckling-pig-08-31a246ea62824f1793626138def0f3ed.jpg",
  "tags": [
    "Pork",
    "Roasted Pork",
    "Pork Mains"
  ],
  "title": "Whole Roasted Suckling Pig",
  "full_text": "Whole Roasted Suckling Pig\nClose\nJump to recipe\nPrep\n5 mins\nCook\n4 hrs 30 mins\nActive\n60 mins\nResting Time\n30 mins\nTotal\n5 hrs 5 mins\nServes\n12\nto 16 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nsuckling pig\n, about\n20\npounds\n(see note)\nKosher salt\nand freshly\nground black pepper\n20\nwhole\ncloves garlic\n(see note)\n1\n(\n6-inch) piece\nfresh ginger\n, cut into 1/2-inch slivers (see note)\nDirections\nPreheat oven to 300°F (150°C). Have a large work table ready and lined with plastic to make cleanup easier. Season pig inside and out with plenty of salt and pepper. Fill cavity with garlic and ginger. If pig fits on a single rimmed baking sheet or roasting pan, place it on the baking sheet back-side-up and transfer to the oven. If pig is too large, remove a rack from the oven and place on your range. Overlap 2 rimmed baking sheets so that they fit on the oven rack and line the whole thing with foil. Transfer the pig to the overlapped baking sheets then lift the whole oven rack and return to the oven so that the pig is in the center.\nSerious Eats / J. Kenji López-Alt\nRoast until an instant-read thermometer inserted into the deepest part of the shoulder blade registers at least 160°F (71°C), about 4 hours. If ears or tail begin to burn, cover with foil and continue roasting.\nSerious Eats / J. Kenji López-Alt\nIncrease oven temperature to 500°F (260°C) and cook until skin is crisp all over, about 30 minutes longer (see note). Remove pig from oven, tent with foil, and allow to rest for 30 minutes. Serve by tearing skin into serving-sized pieces and removing flesh with your fingers and piling it onto a serving platter.\nSerious Eats / J. Kenji López-Alt\nSerious Eats / J. Kenji López-Alt\nSpecial Equipment\nRimmed baking sheet\n,\ninstant-read thermometer\nNotes\nYou can order suckling pigs from your local butcher or from online resources. Plan on 1 1/2 pounds per person.\nYou can feel free to substitute the garlic and ginger with any aromatics of your choice such as herbs, other vegetables, or fruit.\nYour pig can be removed from the oven and left at room temperature tented with foil for up to 2 hours after step 2 and before proceeding with step 3 if you need to do so for timing purposes.\nRead More\nHow to Roast a Pig on a Spit\nCuban-Style Roast Pork Shoulder With Mojo Recipe\nUltra-Crispy Slow-Roasted Pork Shoulder Recipe\nGarlic- and Herb-Roasted Pork Loin With Crackling and Spiced Apple Chutney Recipe\nPork\nRoasted Pork\nPork Mains"
}