{
  "url": "https://www.seriouseats.com/wild-rice-salad-recipe-8728350",
  "image_url": "https://www.seriouseats.com/thmb/YBmPXaPo0QwmDF12dojsCqkjvkg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__10__20180913-wild-rice-side-dish-vicky-wasik-14-4f2c7867bcab4216b9afe598a1d4ccb3.jpg",
  "tags": [
    "Rice & Grain Mains",
    "Vegetarian",
    "Fall Mains",
    "Fall Sides",
    "Gluten-free Salads"
  ],
  "title": "Wild Rice Salad With Cranberries and Apples",
  "full_text": "Wild Rice Salad With Cranberries and Apples\nClose\nJump to recipe\nPrep\n5 mins\nCook\n60 mins\nTotal\n65 mins\nServes\n6\nto 10\nCook Mode\n(Keep screen awake)\nIngredients\n14\nounces\nwild rice\n(396g; about 2 1/3 cups)\nChicken stock, vegetable stock, or\nwater\n, for cooking the rice (see notes)\nKosher salt\nand freshly ground black pepper\n6 ounces (\n350\ng\n) crisp\napple\n(about 1 medium), cored and diced\n1\ncup\n(240ml)\nwhite wine vinegar\n1/4\ncup\n(50g)\nsugar\n, divided\n4\nounces\nunsweetened\ndried cranberries\n(113g; 1 cup)\n4 tablespoons\nunsalted butter\n(2 ounces;\n57\ng\n)\nOne 8-ounce (\n226\ng\n)\nred onion\n, cut into 1/4-inch dice\nThree 2-ounce (\n55\ng\n)\nribs\ncelery\n, cut into 1/4-inch dice\n4\nsprig\ns\nthyme\n2\ntablespoons\nminced flat-leaf\nparsley\nleaves and tender stems\n1\ntablespoon\nminced\nfresh tarragon\n1\ntablespoon\nminced\nchives\n8\nounces\n(226g)\npecans\n, toasted then roughly crumbled\nDirections\nIn a large pot, combine wild rice with enough stock and/or water to cover by at least 2 inches. Season lightly with salt. Bring to a simmer, then continue to cook at a simmer until rice grows tender and many of the grains have ruptured, about 50 minutes; add more water at any point as needed to keep rice covered.\nMeanwhile, in a medium saucepan, combine white wine vinegar with 1 cup (235ml) water, 2 tablespoons (25g) sugar, and 1 teaspoon (4g) kosher salt. Bring to a simmer over medium-high heat, stirring to dissolve sugar and salt.\nPlace apples in a stainless steel mixing bowl nested in a larger mixing bowl full of ice water. Pour hot vinegar brine over apples, stirring to chill rapidly. Once cool, press a clean paper towel against the surface to fully submerge apples. Set aside or refrigerate for up to 3 days.\nIn a separate heat-resistant bowl, pour about 1 cup boiling water over cranberries. Stir in remaining 2 tablespoons (25g) sugar until dissolved. Set aside.\nIn a medium skillet, heat butter over medium-high heat until foaming. Add onion, celery, and thyme sprigs, and cook, stirring, until tender but not browned, about 4 minutes. Discard thyme and set aside.\nUsing a fine-mesh strainer, drain wild rice well; let cool to near room temperature. Transfer to a large bowl and mix with sautéed vegetables. Drain cranberries and add to rice. Using a slotted spoon, transfer pickled apples to wild rice, reserving the pickling brine.\nAdd parsley, tarragon, chives, and pecans to rice. Stir to combine. Season with salt and pepper. Mix in 1 tablespoon reserved pickling brine at a time until salad tastes bright and flavorful. Serve.\nNotes\nYou need enough liquid to cover the rice sufficiently, the exact amount of which will depend on the dimensions of your pot; if using stock, 1 or 2 quarts (1 or 2 liters) will be sufficient, as you can always top it up with additional water as needed.\nMake-Ahead and Storage\nThe entire salad can be mixed together, except for the pickled apples and herbs, and refrigerated up to 1 day in advance. The pickled apples can be made separately and held in the brine, refrigerated, up to 3 days in advance. Bring to room temperature, or warm slightly, before mixing in the pickled apples and herbs and completing the salad.\nRead More\nWild Rice Salad With Mushrooms, Celery Root, and Pine Nuts\nBaked Acorn Squash With Wild Rice, Pecan, and Cranberry Stuffing\nClassic Chicken and Wild Rice Hotdish From 'The New Midwestern Table'\nA Comprehensive Guide to Rice Varieties\nRice & Grain Mains\nVegetarian\nFall Mains\nFall Sides\nGluten-free Salads",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/wild-rice-salad-with-cranberries-and-apples.webp?"
}