{
  "url": "https://www.seriouseats.com/winter-squash-panang-curry-recipe-8749394",
  "image_url": "https://www.seriouseats.com/thmb/iObPuxqa_M2xWuPVk3Fl03GjwqY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241119-SEA-WinterSquashCurry-DeliStudios-Step3B-45-71822a26882f4bcf9b0f0732f3a3eee4.jpg",
  "tags": [
    "The Latest",
    "Thai",
    "Fall",
    "Winter Squash",
    "Kabocha Squash"
  ],
  "title": "Winter Squash Panang Curry",
  "full_text": "Winter Squash Panang Curry\nClose\nJump to recipe\nPrep\n10 mins\nCook\n15 mins\nTotal\n25 mins\nServes\n4\nto 6\nCook Mode\n(Keep screen awake)\nIngredients\nOne 13.5-ounce can (\n400\nml)\ncoconut cream,\nsuch as Savoy brand (see notes), divided\n2 to 3 tablespoons (33g to\n50\ng\n) store-bought\npanang curry\npaste like Mae Ploy (or Maesri for vegetarian) or\nhomemade\n(see notes)\n1\nsmall\nkabocha\nor red kuri squash, about 1 1/2 to 2 pounds (0.7 to 1kg), stemmed, halved, seeded, and cut into 1-inch cubes\n1/2\ncup\n(118ml)\nwater,\nplus extra water as needed\n3 tablespoons (\n38\ng\n) grated\npalm sugar\nor light brown sugar\n2 tablespoons (\n30\nml)\nfish sauce\nThai long red chili\n(25\ng)\nor Fresno\nchili\n(30g), stemmed, seeded, and cut lengthwise into thin strips\n3\nmakrut lime leaves\n(\n1\ng\n), deveined and cut into chiffonade\n1/2 cup\n(12\ng\n) Thai\nsweet basil leaves\n2 tablespoons (\n18\ng\n)\nroasted peanuts\nfinely chopped or crushed in a mortar and pestle\nDirections\nIn a 2-quart saucepan, heat 1/4 coconut cream over medium-high heat until it breaks and looks oily. Add 2 tablespoons curry paste for a milder curry or 3 tablespoons for a spicier curry. Stir until paste deepens in color and is fragrant, about 2 minutes.\nSerious Eats / Deli Studios\nAdd squash, remaining coconut cream (reserve 2 tablespoons to drizzle on top for presentation if you’d like), water, palm or brown sugar, and fish sauce. Stir, bring to a boil, reduce heat to medium, cover, and cook until squash is fork-tender, about 10 minutes. Peel should be sturdy and flesh should still hold its shape. Simmer uncovered until curry is thickened to the consistency of a bisque, about 3 minutes.\nSerious Eats / Deli Studios\nRemove from heat, stir in half the red chili and basil leaves, and transfer to a large serving bowl or individual serving bowls. Top with makrut lime leaves, peanuts, remaining chiles, and a drizzle of reserved coconut cream, if desired.\nSerious Eats / Deli Studios\nSpecial Equipment\n2-quart saucepan\nNotes\nRecipe can easily be doubled.\nTo make this dish vegetarian, use thin (light) soy sauce instead of fish sauce and use a curry paste without shrimp paste, such as Maesri brand.\nFresno, serrano, or jalapeño can be used in place of Thai long chili. For mild curry, use 1/4 red bell pepper.\nUse a premium unsweetened coconut cream, such as Savoy brand, that is pure coconut cream. Avoid using brands with added thickeners such as guar gum, as these won't thicken well.\nMake-Ahead and Storage\nMake curry through step 2, let cool, cover, and keep refrigerated overnight. Reheat curry on the stove over medium heat and continue with step 3 before serving.\nKeep leftovers covered in refrigerator for up to 3 days. Reheat gently on stove. Coconut milk curries should not be frozen as the texture will be affected.\nThe Latest\nThai\nFall\nWinter Squash\nKabocha Squash",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/winter-squash-panang-curry.webp?"
}