{
  "url": "https://www.seriouseats.com/winter-apple-pie-dried-fruit-recipe",
  "image_url": "https://www.seriouseats.com/thmb/Q_fRWamKJoV0po_Wqh5xzxMv7BQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120301-195206-apple-dried-fruit-pie-610x458-1-db40db276db94c518b518a8336be7519.jpg",
  "tags": [
    "Pies",
    "Baking",
    "Apple",
    "Winter Desserts"
  ],
  "title": "Winter Apple and Dried-Fruit Pie Recipe",
  "full_text": "Winter Apple and Dried-Fruit Pie Recipe\nClose\nJump to recipe\nPrep\n15 mins\nCook\n80 mins\nActive\n60 mins\nCooling and Chilling Time\n2 hrs 40 mins\nTotal\n4 hrs 15 mins\nServes\n8\nto 10 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nrecipe\nEasy Pie Dough\n, one half shaped and chilled in a pie plate, the other rolled out flat and chilled on a floured sheet pan\n8\nmedium\nGolden Delicious\n, Braeburn, or other baking apples peeled, cored, and sliced into 1/4-inch slices\n10\nounces\ndried fruits\n(a combination of dried cherries, chopped dried figs, dried cranberries, currants, raisins)\n1\ntablespoon\nzest\nfrom\n1\nwhole\nlemon\n6\nounces\ngranulated sugar\n(adjust to taste, depending on sweetness of apples and dried fruits)\n1/2\nounce\ncornstarch\n1\nteaspoon\ncinnamon\n1\npinch\ngrated\nnutmeg\n1\nlarge\nwhole egg\n, lightly beaten\nSanding sugar\nfor top (optional)\nDirections\nAdjust oven rack to lower position and preheat oven to 425°F (220°C). Place apple slices in a large bowl or pot. Pour boiling water directly over top. Cover and set aside at room temperature for ten minutes. Drain apples well and transfer to a large bowl. Allow to cool for 20 minutes, tossing occasionally. Transfer to a large bowl and toss with dried fruit. Whisk together sugar, starch, and spices and add to apple mixture. Toss until well-coated. pour contents of bowl into chilled pie shell. Cover with top crust, either by cutting chilled top crust into strips and weaving a lattice, or by covering pie with whole crust. Crimp sides and chill pie for 15-20 minutes.\nWhen ready to bake, brush top with egg wash and sprinkle with sanding sugar. If you've covered pie with a whole top crust, cut slits in the top. Bake for 20 minutes, then turn down heat to 375°F (190°C) and bake for additional time: for non-lattice, approximately 40 minutes, for lattice, approximately 50, both rotating halfway through. Crust should be golden brown and filling should be bubbling. If parts of crust start to look too dark, cover darker parts with small patches of foil to protect them from heat.\nAllow pie to cool completely before serving. You may make this pie in advance, but it is best served the same day that you bake it.\nSpecial Equipment\n9-inch pie plate\nPies\nBaking\nApple\nWinter Desserts"
}