{
  "url": "https://www.seriouseats.com/xo-mazemen-recipe",
  "image_url": "https://www.seriouseats.com/thmb/83exdczLr1dzRuBTyleCnZeDgDo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190530-mazemen-ramen-vicky-wasik-13-fe0eae5e68ce48baaf29a76e06f84248.jpg",
  "tags": [
    "Ramen",
    "Japanese",
    "Stovetop Noodles",
    "Noodle Mains",
    "Summer Mains"
  ],
  "title": "XO Mazemen (Broth-less Ramen With XO Sauce) Recipe",
  "full_text": "XO Mazemen (Broth-less Ramen With XO Sauce) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nActive\n1 min\nTotal\n15 mins\nServes\n1 serving\nCook Mode\n(Keep screen awake)\nIngredients\n1\nportion\nramen noodles\n, store-bought or\nhomemade\n(see note)\n2\ntablespoons\n(\n30\nml\n)\nXO sauce\n, store-bought or\nhomemade\n(see note)\n2\ntablespoons\n(\n30\nml\n)\nrendered pork fat\nor other oil (see note)\n1\ntablespoon\n(\n15\nml\n)\nrice vinegar\n1\ntablespoon\n(\n15\nml\n)\nsoy sauce\nFor Serving:\nSliced scallions\n1\nonsen egg\n(optional; see note)\n5 to 6\nblanched\nsugar snap peas\n(optional)\nSmall\nbunch\nof\nradish sprouts\n(optional)\nDirections\nBring a small pot of water to a boil. Add noodles and cook according to package directions or recipe directions.\nIn a large mixing bowl, stir together XO sauce, rendered pork fat, rice vinegar, and soy sauce.\nSerious Eats / Vicky Wasik\nWhen noodles are cooked, drain briefly, then add to mixing bowl. Using tongs or chopsticks, immediately toss and stir noodles vigorously in the liquid at the bottom of the bowl, until the liquid turns creamy, about 30 seconds.\nSerious Eats / Vicky Wasik\nTransfer noodles to a serving bowl, using a rubber spatula to scrape any remaining sauce over the top. Garnish with sliced scallions and any of the other suggested toppings (onsen egg, snap peas, or radish sprouts) you desire. Serve.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nLarge mixing bowl\n,\ntongs\nor cooking chopsticks\nNotes\nIf you want to make this dish for more than one person, we recommend making each individual portion separately, as it is significantly easier. If you're making this recipe for a crowd, we strongly suggest making only two portions at a time and wiping out the bowl before making each subsequent two-portion batch.\nYou can use either fresh or dried ramen noodles for this recipe. A single portion of fresh noodles weighs roughly 4 to 5 ounces (110 to 150g).\nThis recipe was developed using Serious Eats'\nXO sauce recipe\n. Store-bought XO sauce may have a higher or lower level of salt; if you use a store-bought XO sauce, we suggest that you add the soy sauce to taste after mixing.\nAny kind of oil or rendered fat can be used in this recipe, but a more flavorful fat, like rendered pork fat or chicken fat, will yield a superior result. You can also use a blend of oils, such as a mix of olive oil, sesame oil, and unrefined peanut oil, to alter the flavor profile.\nWhile optional, the onsen egg serves to temper the rather aggressive seasoning in this dish. A\npoached egg\nwould work just as well, as would a\nfried egg\nor even a raw egg yolk set on top of the noodles.\nRead More\nVegetarian Mazemen With Beans and Egg Recipe\nPasta With Burst Cherry Tomatoes and XO Sauce Recipe\nChinese Cold Noodle Salad with Sesame Dressing Recipe\nGuide to Ramen Varieties\nRamen\nJapanese\nStovetop Noodles\nNoodle Mains\nSummer Mains"
}