{
  "url": "https://www.seriouseats.com/yam-khai-do-thai-fried-egg-salad",
  "image_url": "https://www.seriouseats.com/thmb/1F-GHJnerDY4ha-iXd1UuPHJiPU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__07__20200720-yam-kai-dow-thai-egg-salad-main-photo-derek-lucci-7fa90d0b9dfd461f91f931240a33f371.jpg",
  "tags": [
    "Thai",
    "Fried Eggs",
    "Stovetop Eggs",
    "Salads",
    "Eggs"
  ],
  "title": "Yam Khai Dao (Thai Fried Egg Salad) Recipe",
  "full_text": "Yam Khai Dao (Thai Fried Egg Salad) Recipe\nClose\nJump to recipe\nPrep\n5 mins\nCook\n5 mins\nActive\n10 mins\nTotal\n10 mins\nServes\n1\nto 2 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dressing and Fresh Aromatics:\n3\ntablespoons\n(\n45\nml\n)\nfresh lime juice\nfrom\n2\nlimes\n2\ntablespoons\n(\n30\nml\n)\nfish sauce\n2\nteaspoons\n(\n15\ng\n)\npalm sugar\n, softened (see notes)\n1\nsmall\nshallot\n(\n15\ng\n), thinly sliced (see notes)\n1\nmedium\ngarlic clove\n(\n5\ng\n), thinly sliced\n1\nstalk\nlemongrass\n, bottom 4 to 5 inches only, outer leaves discarded, tender core thinly sliced into rounds (about\n10\ng\nsliced lemongrass)\n2 to 4\nfresh Thai chiles\n(\n2\nto\n4\ng\ntotal), stemmed and thinly sliced into rounds (see notes)\n3\nsprigs\ncilantro\nincluding stems (\n5\ng\n), cut into 1/2-inch pieces, plus extra leaves for garnish\n1\nscallion, green part only\n, sliced into 1/8-inch-thick rings (about\n5\ng\n)\nFor the Fried Eggs:\n2\nlarge\neggs\n5\ntablespoons\n(\n75\nml\n)\nvegetable oil\n(see notes)\nFor Serving:\nCooked jasmine rice\nDirections\nFor the Dressing and Fresh Aromatics:\nIn a small mixing bowl, stir together lime juice, fish sauce, and palm sugar until palm sugar is fully dissolved, about 15 seconds.\nAdd shallot, garlic, lemongrass, Thai chiles, cilantro sprigs, and scallion to dressing. Gently stir to combine and evenly coat solids with dressing. Set aside.\nFor the Fried Eggs:\nLine a plate or small tray with paper towels. Crack eggs into a small, shallow bowl. In a wok or 8-inch carbon steel or cast iron skillet, heat oil over high heat until it just begins to smoke. Holding the bowl closely above the oil, carefully slip the eggs into the oil in one swift and smooth motion to prevent oil from splattering; the egg whites should immediately puff and bubble around the edges. Cook undisturbed for 20 seconds, then begin swirling the pan to prevent eggs from sticking. Continue to cook, swirling pan constantly to promote even cooking of the whites, until the inner part of the whites close to the yolks are fully set, and the edges are wispy, golden brown, and crisp, about 1 minute. Using a large spoon or wok spatula, baste the yolks 2 to 4 times with hot oil until they just turn opaque and look like yolks on American-style, over-easy fried eggs. Using a slotted or wok spatula, carefully lift eggs out of oil, draining off as much excess oil as possible, and transfer to prepared paper towel–lined plate.\nFor Serving:\nGently transfer fried eggs to a serving plate. Spoon the aromatics, herbs and dressing over the eggs, and garnish with cilantro leaves. Serve immediately with cooked jasmine rice on the side.\nSpecial Equipment\nCarbon steel wok\nor 8- or 10-inch\ncarbon steel skillet\nNotes\nPalm sugar can be found in Thai markets, as well as some nation-wide supermarkets like HMart, and also online. At room temperature, palm sugar is a solid mass and needs to be softened so that it can be incorporated into the dressing. You can soften palm sugar in the following ways: microwave at full power in a microwave-safe bowl for approximately 15 seconds; combine with the fish sauce in the recipe in a small saucepan and warm over low heat until dissolved; or pound in a mortar and pestle, gradually adding lime juice and fish sauce until palm sugar dissolves. If you can't find palm sugar, you can substitute with 1 teaspoon (4g) white sugar.\nIf possible, use smaller, round Thai shallots for this recipe. As with onions, make sure to slice shallots\npole-to-pole\nto minimize cell wall damage and consequent pungent allium aroma.\nAdjust the amount of Thai chiles in the salad to your personal taste.\nFor frying the eggs, it is important to use enough oil to properly shallow fry them, which is dependent on the size of your chosen cooking vessel. 5 tablespoons (75ml) of oil is sufficient when cooking in a wok or 8-inch carbon steel or cast iron skillet. If using a 10-inch skillet, increase oil amount to 6 tablespoons (90ml) and proceed with recipe instructions as written. Leftover oil can be saved for future egg-frying; allow to cool, strain through a fine mesh strainer, and refrigerate in an airtight container.\nMake-Ahead and Storage\nYam khai dao is best enjoyed immediately.\nThai\nFried Eggs\nStovetop Eggs\nSalads\nEggs"
}