{
  "url": "https://www.seriouseats.com/yam-woon-sen-glass-noodle-salad-5206676",
  "image_url": "https://www.seriouseats.com/thmb/8_3sXHI7fG4mRV-1srREAdzSqqs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210928-yam-woon-sen-thai-glass-noodle-salad-vicky-wasik-29-ca742631b53241399c6281a08b81982f.jpg",
  "tags": [
    "Thai",
    "Noodles",
    "Noodle Mains",
    "Pork",
    "Shrimp"
  ],
  "title": "Yam Woon Sen (Thai Glass Noodle Salad With Shrimp)",
  "full_text": "Yam Woon Sen (Thai Glass Noodle Salad With Shrimp)\nClose\nJump to recipe\nPrep\n10 mins\nCook\n10 mins\nSoaking Time\n10 mins\nTotal\n30 mins\nServes\n2\nto 4 servings\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Dressing:\n3\ncilantro roots\n(\n10\ng\n), cleaned (see note)\n2\nfresh red\nThai chiles\n, stemmed (see note)\n1\nsmall\ngarlic clove\n(\n4\ng\n), peeled\nkosher salt\n1\ntablespoon\nplus\n1 1/2\nteaspoons\n(\n20\ng\n)\nsugar\n1/4\ncup\n(\n60\nml\n) fresh\nlime juice\nfrom\n2 to 3\nlimes\n1/4\ncup\n(\n60\nml\n)\nfish sauce\nFor the Salad:\n2.8\nounces\n(\n80\ng\n)\nThai mung bean glass noodles\n(see note)\n8\nlarge\nshrimp\n(about\n5\nounces\n;\n140\ng\n) peeled and deveined\n3.5\nounces\n(\n100\ng\n)\nground pork\n3\nfresh red\nThai chiles\n, stemmed and thinly sliced into rounds (see note)\n1\nplum tomato\n(about\n150\ng\n), cored, seeded, and cut lengthwise into 1/4 inch-wide strips\n1\nmedium\nshallot\n(\n50\ng\n), thinly sliced\n2\ntablespoons\n(\n40\ng\n)\nroasted unsalted peanuts\n, roughly chopped\n3\nsprigs\nfresh cilantro\nincluding tender stems (\n5\ng\n), cut into 1-inch pieces\n5\nsprigs\n(\n10\ng\n) Chinese\ncelery\nincluding tender stems, cut into 1-inch pieces, or\n1\nsmall\ncelery\nrib\n, thinly sliced (see note)\nDirections\nFor the Dressing\n: In a granite mortar and pestle, combine cilantro roots, chiles, garlic, and a pinch of salt, and pound into a fine paste, about 2 minutes. Add sugar and work pestle in a circular motion against mortar until sugar is fully dissolved, about 1 minute. Add lime juice and fish sauce and stir to thoroughly combine. Transfer dressing to a large bowl and set aside.\nVicky Wasik\nFor the Salad\n: Place glass noodles in a medium bowl and cover with room temperature water. Allow noodles to hydrate until pliable, about 10 minutes. Drain, and set aside.\nVicky Wasik\nMeanwhile, in a small saucepan, bring 1 cup (240ml) lightly salted water to a boil over high heat. Add shrimp, stir to ensure they are fully submerged, and then remove from heat. Allow shrimp to poach, undisturbed, until they change color and are just cooked through, about 1 minute. Using a slotted spoon, immediately transfer shrimp to bowl with dressing, leaving poaching water in saucepan.\nVicky Wasik\nReturn water to a boil over high heat and add pork. Cook, using a spoon to stir and break up any large clumps of meat, until cooked through, about 1 minute. Using a slotted spoon, immediately transfer to bowl with dressing.\nVicky Wasik\nReturn water to a boil over high heat, add glass noodles and more water as needed until noodles are submerged. Cook, stirring frequently until noodles swell and become translucent, about 2 minutes. Using a fine-mesh strainer, drain noodles, shaking strainer to get rid of excess moisture, and transfer to bowl with dressing.\nVicky Wasik\nUsing a large spoon or tongs, toss noodles, shrimp, and pork with dressing until evenly coated. Add sliced chiles, tomato, shallot, and half of the peanuts and continue to toss until well combined and most of the dressing has been absorbed by the noodles. Add cilantro and Chinese celery and toss to combine. Transfer to a large serving platter or divide between individual serving plates, sprinkle with remaining peanuts, and serve.\nVicky Wasik\nSpecial Equipment\nGranite mortar and pestle\n, fine-mesh strainer.\nNotes\nThe roots of fresh coriander (a.k.a. cilantro) provide a slight herbal note to curry pastes, but are unfortunately hard to find in the US, as they are often cut off from the stems before going to market (though local farmers markets in the summer and fall often have coriander with the roots still attached). Coriander roots can also be found at Southeast Asian markets. If you cannot find coriander roots, substitute with stems from 10 sprigs of fresh cilantro, cut into 1-inch pieces, or omit entirely.\nYou can adjust the spiciness of this salad to suit your taste by reducing or increasing the amount of fresh Thai chiles in the dressing and in the salad.\nGlass noodles can be found in Southeast Asian markets and online. They are often labeled as cellophane noodles, mung bean threads, mung bean noodles, bean vermicelli, bean threads, green bean thread, or broad bean threads. For this recipe, seek out a Thai brand that lists mung bean starch as the only ingredient, with noodles portioned into 1.4-ounce (40g) bundles. They will keep indefinitely in your pantry.\nMake-Ahead and Storage\nThe glass noodles can be hydrated up to 1 day in advance and refrigerated in an airtight container. The finished salad is best enjoyed immediately.\nThai\nNoodles\nNoodle Mains\nPork\nShrimp",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/yam-woon-sen-thai-glass-noodle-salad-with-shrimp.webp?"
}