{
  "url": "https://www.seriouseats.com/yeast-raised-doughnuts-make-at-home-glazed-recipe",
  "image_url": "https://www.seriouseats.com/thmb/YPht8ncpBrSCAYH0hvCeFEmH1MY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230811-SEA-GlazeYeastedDonuts-RobbyLozano-002-ae1b11bff58a44c08c9312ed6ccfc1e3.jpg",
  "tags": [
    "Doughnuts",
    "Frying",
    "Mother's Day"
  ],
  "title": "Yeast-Raised Doughnuts",
  "full_text": "Yeast-Raised Doughnuts\nClose\nJump to recipe\nPrep\n30 mins\nCook\n30 mins\nActive\n2 hrs\nProofing Time\n60 mins\nTotal\n2 hrs\nMakes\n15 doughnuts\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Doughnuts:\n1 1/8\ncup\n(\n265\nml\n)\nwhole milk\n, warmed to 90°F (32°C)\n1/2\ncup\nsugar\n2 1/4\nteaspoons\n(\none\npackage\n)\nactive dry yeast\n2\nwhole\neggs\n, beaten, at room temperature\n3/4\ncup\nunsalted butter\n, melted and cooled (\n6\nounces\n;\n170\ng\n)\n4\ncups\nbread flour\n(\n18 1/4\nounces\n;\n520\ng\n)\n1\nteaspoon\nDiamond Crystal\nkosher salt\n; for table salt, use half as much by volume\n2\nquarts\nfrying fat\n(lard, crisco, or neutral\noil\n)\nFor the Glaze:\n1/4\ncup\n(\n60\nml\n)\nwhole milk\n2 1/2\ncups\nconfectioners sugar\n(\n9 1/2\nounces\n;\n273\ng\n)\n1\nteaspoon\nvanilla extract\n1\npinch\nkosher salt\nDirections\nFor the Doughnuts:\nIn a small bowl, whisk to combine the warm milk and sugar. Stir in the yeast and let mixture sit until it begins to foam on top, about five minutes.\nSerious Eats / Robby Lozano\nIn a separate bowl, whisk together the egg and melted butter and set aside. In the bowl of the stand mixer, combine the flour and salt.\nSerious Eats / Robby Lozano\nFit stand mixer with dough hook, add the milk mixture, and mix on low speed until the flour is hydrated, about 2 minutes.  Increase the speed to medium and mix until a dry-looking dough forms, about 2 minutes. Reduce speed to low, then slowly pour in the egg mixture and mix until combined. Increase speed to medium-high and continue to mix, scraping down bowl as needed, until dough is smooth and elastic and clears sides of bowl, about 10 minutes. As it mixes, the dough should make a slapping sound against the edge of the bowl. Transfer dough to a lightly greased large bowl. Cover the bowl with plastic wrap and refrigerate overnight.\nSerious Eats / Robby Lozano\nTurn the cold proofed dough out onto a floured work surface and lightly dust the top of the dough. Using a rolling pin, press to flatten and roll the dough to a uniform 1/2 inch thickness.\nSerious Eats / Robby Lozano\nLine 2 rimmed baking sheets with plastic wrap  or silicone mats. Using a 3-inch round cutter dipped in flour, cut out rounds. Using a 1-inch round cutter dipped in flour, cut a hole out of center of each round. Transfer doughnuts and holes to prepared sheet, spacing doughnuts about 1 inch apart to accommodate expanding during proofing. Gather dough scraps, and gently reroll 1 time, repeating cutting procedure. You should have about 15 doughnuts. Place doughnuts in a  warm, moist environment to proof until they are very puffy and fragile to touch, 45 minutes to 1 hour. (See note.) If you do not live in a hot, moist place, preheat the oven to its lowest setting to warm it for proofing, then turn it off.\nSerious Eats / Robby Lozano\nTo Prepare Frying oil and Glaze Setup:\nPlace a large, heavy pot on the stove and clip the digital thermometer to the side of the pot. Pour in the oil and heat oil to 375ºf (190ºc)  over medium heat. Set a wire rack inside a rimmed baking sheet and line rack with a double layer of paper towels. Set tongs, spider skimmer, or chopsticks aside until ready to fry.\nSerious Eats / Robby Lozano\nFor the Glaze:\nOn another burner, warm the milk in a small saucepan set over low heat until the milk begins to steam. Remove from heat and add the confectioner's sugar, pinch of salt, and vanilla, and whisk until smooth. Pour the glaze into a heat-proof bowl and set the bowl over a small saucepan of water; set aside.\nSerious Eats / Robby Lozano\nTo Fry the Doughnuts:\nGently place 3 risen doughnuts into 375°F oil and fry until donuts are golden brown on bottom side, 1 to 2 minutes. Using tongs, spider skimmer, or tongs, gently flip doughnuts and continue to fry until golden brown on the other side, 1 to 2 minutes longer (if they are getting too dark, turn them earlier). Transfer the doughnuts to the prepared rack. Break one open to check that it is cooked. If undercooked, return doughnuts to the hot oil for an additional minute. Adjust frying time for remaining donuts as needed. Return oil to 375 degrees and repeat with remaining doughnuts and doughnut holes. Let doughnuts sit until cool enough to handle, about 10 minutes.\nSerious Eats / Robby Lozano\nTo Glaze the Doughnuts:\nPlace the pot of water with the bowl of glaze set over it over low heat and stir until it returns to a pourable glaze consistency. Remove from heat and use your fingers to carefully submerge each of the doughnut in the glaze. Place the glazed doughnuts on a clean cooling rack to dry. The glaze will become more translucent as it dries. For best flavor, serve immediately.\nSerious Eats / Robby Lozano\nSpecial Equipment\nDeep fat frying thermometer, round cutters, mixer with dough hook attachment\nRead More\nChocolate Cake Doughnuts\nDoughnuts\nFrying\nMother's Day",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/yeast-raised-doughnuts.webp?"
}