{
  "url": "https://www.seriouseats.com/yeasted-pumpkin-bread",
  "image_url": null,
  "tags": [
    "Yeast Breads",
    "Pumpkin",
    "Breakfast & Brunch",
    "Fall Breakfast & Brunch"
  ],
  "title": "Yeasted Pumpkin Bread",
  "full_text": "Yeasted Pumpkin Bread\nJump to recipe\nPrep\n15 mins\nCook\n45 mins\nActive\n20 mins\nProofing Time\n4 hrs\nTotal\n5 hrs\nServes\n8\nto 10 servings\nMakes\n1 loaf\nCook Mode\n(Keep screen awake)\nIngredients\n16\nounces\nbread flour\n(about\n3 1/2\ncups\n, spooned;\n455\ng\n)\n2 1/4\nteaspoons\n(\n9\ng\n) Diamond Crystal\nkosher salt\n; for table\nsalt\n, use about half as much by volume or the same weight\n1/4\nounce\ninstant dry yeast\n, such as SAF (about\n2\nteaspoons\n;\n7\ng\n); not RapidRise or active dry\n12\nounces\npumpkin purée\n, canned or\nhomemade\n(about\n1 1/2\ncups\n;\n340\ng\n)\n2\nounces\npure\nmaple syrup\n(a shy\n1/4\ncup\n;\n55\ng\n)\n2\nounces\nunsalted butter\n, melted (about\n4\ntablespoons\n;\n55\ng\n), or\n1 1/2\nounces\nneutral\noil\nor roasted pumpkin seed oil (about\n3\ntablespoons\n;\n42\ng\n)\nDirections\nMaking the Dough:\nIn the bowl of a food processor, pulse bread flour, salt, and instant yeast together to combine. Add pumpkin purée, maple syrup, and melted butter (or oil), and process until dough comes together in a smooth, pliable ball; timing can vary depending on the size and power of a given food processor, but expect about 75 seconds from start to finish. To test dough, tear off a small piece and stretch gently in all directions; when dough is ready, it can be pulled into a thin, translucent sheet (called a windowpane).\nSerious Eats / Vicky Wasik\nProofing the Dough:\nLightly grease a medium bowl, then add dough. Cover and proof at room temperature until doubled in bulk. This will take about 2 hours at around 72°F (22°C); the process will move faster at warmer temperatures, and slower when it is cool. To test dough, poke it gently with a flour-dusted fingertip; when dough is ready, it will retain a shallow impression that springs back after a few minutes. If dough is firm and springs back right away, continue proofing until dough retains a shallow impression.\nSerious Eats / Vicky Wasik\nShaping the Dough:\nTurn dough onto a work surface with just the barest sprinkling of flour, and knead for a few seconds to deflate; this creates a more uniform crumb in the loaf by eliminating large pockets of air. Pat dough into a 7-inch square, and form into a tight log, sealing dough together with the heel of your hand. Nestle into a lightly greased loaf pan, seam side down, then cover and proof as before (for dinner rolls, see notes on shaping below). Dough will be ready when it's puffy and light, and risen about 2 inches above the rim of the pan. This will take about 2 hours at around 72°F; the process will move faster at warmer temperatures, and slower when it is cool; the dough's readiness can be tested as before. Near the end of this period, adjust oven rack to lower middle position and preheat to 350°F (177°C).\nSerious Eats / Vicky Wasik\nWhen dough is ready, uncover and bake until well-risen, golden brown, and hollow sounding when thumped; about 45 minutes, or to an internal temperature of approximately 205°F (96°C). Immediately turn loaf out onto a wire rack, and cool completely before slicing. The loaf will keep up to a week at room temperature in a bread box or paper bag.\nSerious Eats / Vicky Wasik\nSpecial Equipment\nFood processor\n,\n8-inch aluminized steel loaf pan\nor\n10-inch cast iron skillet\n,\nwire cooling rack\nNotes\nFor dinner rolls, make and proof dough as directed, then divide into approximately 12 even pieces (approximately 2 1/2 ounces or 70g each). Cup each portion of dough beneath your hand and an unfloured work surface, pinning it with your fingertips on one side and the heel of your palm on the other. Roll the dough around in quick, circular motions until the dough forms a ball, then continue until the dough is pulled smooth in a tight skin, with only a tiny seam along the bottom. If the seam is large or irregular, continue rounding until the bottom is nearly smooth. Arrange portions in a 10-inch cast iron skillet, then cover, proof, and bake as directed, reducing the amount of time to approximately 35 minutes.\nMake-Ahead and Storage\nThe loaf will keep up to a week at room temperature in a bread box or paper bag.\nYeast Breads\nPumpkin\nBreakfast & Brunch\nFall Breakfast & Brunch"
}