{
  "url": "https://www.seriouseats.com/young-radish-greens-yeolmu-kimchi-recipe",
  "image_url": "https://www.seriouseats.com/thmb/BlC07NmkxsSi3kaQJooswepsvZg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__09__20180822-yeolmu-kimchi-radish-greens-liz-clayman-4-530449226c4f4b61818d069d990ce52f.jpg",
  "tags": [
    "Vegetable Sides",
    "Korean",
    "Gluten-free Sides",
    "Fermentation",
    "Radishes"
  ],
  "title": "Yeolmu Kimchi (Quick-Fermented Young Radish Greens) Recipe",
  "full_text": "Yeolmu Kimchi (Quick-Fermented Young Radish Greens) Recipe\nClose\nJump to recipe\nCook\n105 mins\nActive\n2 hrs\nFermentation Time\n24 hrs\nTotal\n25 hrs 45 mins\nServes\n48 servings\nMakes\n3 quarts\nCook Mode\n(Keep screen awake)\nIngredients\nFor the Porridge (Pul, 풀):\n2\nmedium\nrusset potatoes\n(about\n1\npound\n;\n450\ng\n), peeled and cut into large pieces (avoid waxy, high-moisture potatoes)\nFor the Greens:\n4\nbunches\nyeolmu\n(열무; Korean young\nradish greens\n, with small roots attached), about\n2.5\npounds\nor\n1.1\nkg\n1\nbunch\neolgari baechu\n(얼갈이 배추; young, green winter cabbage), about\n2.5\npounds\nor\n1.1\nkg\n(see notes)\nCoarse sea salt\nFor the Seasoning Paste:\n15\nto\n20\nmedium\nspicy\nfresh red chiles\n(about\n10\nounces\n;\n280\ng\n)\n2\nKorean cheongyang chiles (or\njalapeños\n)\n1\nlarge\nwhite onion\n(about\n1\npound\n;\n450\ng\n), roughly chopped\n8\nmedium\ncloves garlic\n(about\n2 3/4\nounces\n;\n80\ng\n)\nOne\n1 1/2–inch piece\nginger\n, peeled and sliced\n1/4\ncup\nsaewoojeot (\nsalted shrimp\n), optional (see notes)\n1/4\ncup\ngochugaru\n(Korean chile flakes), optional (see notes)\n1 to 2\ntablespoons\nmyeolchi aekjeot (\nKorean anchovy sauce\n), optional (see notes)\nDirections\nFor the Porridge:\nAdd peeled potatoes to a saucepan and cover with enough water to submerge. Bring to a simmer and cook until soft enough to pierce with a fork, about 20 minutes. While potatoes are hot, break up with a fork. Using an immersion blender or countertop blender, purée potatoes with the cooking water until smooth. Set aside to cool to room temperature.\nSerious Eats / Daniel Gritzer\nTo Prep the Greens:\nUsing a paring or\ntourné knife\n, clean the yeolmu by trimming any fibrous stems and damaged leaves and scraping the radish roots clean while keeping them attached to the leaves. Pay extra attention to the top part of the roots, where a lot of soil tends to hide. Wash radish greens well of any dirt or sand; allow to drain, but do not spin dry.\nThoroughly clean and trim any roots, woody bits, or damaged leaves from the cabbage. Wash cabbage well of any sand and dirt; allow to drain, but do not spin dry. Cut the cleaned radish greens and cabbage into 2-inch pieces.\nIn a very large bowl, lay down one layer of greens, then sprinkle a handful of salt on top. Repeat until all your greens have been layered with salt. (If you want to weigh the salt, you should use about 15% of the weight of the greens, though the amount of salt doesn’t need to be perfect, as it will be rinsed away soon. The more salt you use, the faster the greens will wilt, and vice versa.) Toss the leaves gently a couple of times; be careful not to bruise the leaves while tossing. Let stand at room temperature until wilted, 1 to 2 hours.\nRinse a piece of cabbage or kimchi and taste it. If you taste a little saltiness, it’s ready. The radish stems should also bend gently when you hold them upright, while still maintaining some crunch. Rinse the wilted greens gently in cold water and drain again.\nMeanwhile, Make the Seasoning Paste:\nRoughly chop red and green chiles into 1/8-inch pieces. In a blender, purée chiles with onion, garlic, ginger, saewoojeot (if using), gochugaru (if using), and myeolchi aekjeot (if using) until smooth.\nMix the room-temperature porridge into chile-onion paste. If saewoojeot and myeolchi aekjeot have been omitted, season to taste with salt. Taste the paste; it should be about as salty as a well-seasoned soup, and no more so. Season with additional salt only if needed.\nTo Make the Kimchi:\nAdd well-drained greens to a large fermentation crock or nonreactive container and pour the chile mixture over the top.\nCombine 2 quarts (1.9L) water with enough salt to make a mild brine. If your chile paste was too salty, you should make a brine that tastes about as salty as tears (about 2% salt by weight); if your chile paste wasn’t salty enough, make your brine as salty as the ocean (about 3% salt by weight). Pour brine over greens and paste, then press greens down. There should be enough brine to cover all the greens; if not, make more brine and add it until there's enough to cover.\nPress greens down to fully submerge them, then seal with an airtight lid. You can use a plate, a fermentation weight, or plastic wrap to keep the greens submerged. What's important is that the greens are not exposed to the air.\nAllow mixture to stand at room temperature until you begin to see signs of fermentation (a slightly funky smell and little bubbles of gas on top of the kimchi), about 1 day. Transfer to refrigerator. You can start eating kimchi right away, but it tastes best after about 7 to 10 days.\nSpecial Equipment\nImmersion blender\nor\ncountertop blender\n.\nNotes\nIf you don’t have eolgari baechu, either use the tender yellow cores from Napa cabbage or halve the rest of this recipe and add the juice from 1/4 of an Asian pear.\nIf you prefer a cleaner, less fishy flavor, you can skip the optional saewoojeot and myeolchi aekjeot and season only with salt. But if you're a fan of deep umami flavor, use either or both of those ingredients. For spicier kimchi, add the gochugaru; for less spicy kimchi, omit it.\nVegetable Sides\nKorean\nGluten-free Sides\nFermentation\nRadishes"
}