{
  "url": "https://www.seriouseats.com/youtiao-5207508",
  "image_url": "https://www.seriouseats.com/thmb/3-lRMOeHe8pPalUzCnMJ1R4MfC4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20211014-Youtiao-Tim-Chin_hero_2-f6f4c1f5412b46b48523d6488fa5663b.jpg",
  "tags": [
    "Breakfast & Brunch",
    "Chinese",
    "Frying",
    "The Latest"
  ],
  "title": "Youtiao (Chinese Fried Dough Sticks)",
  "full_text": "Youtiao (Chinese Fried Dough Sticks)\nClose\nJump to recipe\nPrep\n30 mins\nCook\n25 mins\nChilling and Resting Time\n15 hrs 10 mins\nTotal\n16 hrs 5 mins\nMakes\n10 pieces\nCook Mode\n(Keep screen awake)\nIngredients\nIngredients\n1/2\ncup\n(\n120\nml\n) filtered\nwater\n1\nlarge\negg\n2 1/4\ncups\n, spooned (\n10\nounces\n/\n285\ng\n)\nall-purpose flour\n, such as Gold Medal Unbleached\n1\ntablespoon\n(\n12\ng\n)\nbaking powder\n1\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n2\ntablespoons\n(\n1\nounce\n/\n28\ng\n) cold,\nunsalted butter\n, cut into\n4\npieces\n8\ncups\nvegetable oil\n, for frying\nDirections\nIn a medium bowl, whisk water and egg until smooth and well combined; set aside. In the bowl of a stand mixer, whisk flour, baking powder, and salt until thoroughly combined, about 30 seconds. Add butter and egg mixture. Set bowl onto stand mixer and, using a dough hook, mix on low speed until liquids are absorbed and no dry flour remains, about 3 minutes.\nTim Chin\nIncrease speed to medium-low and mix until butter is fully incorporated and dough starts to clear sides of bowl, 10 to 12 minutes. Transfer dough to a bare work surface, knead for 30 seconds, and shape into a 9-inch log. Press log flat to 3/4-inch thickness. Wrap log in plastic wrap and refrigerate for at least 12 hours or up to 24 hours.\nTim Chin\nTo shape the dough and prepare for frying:\nRemove dough from refrigerator and bring to room temperature, somewhere between 68° (20°C) and 72°F (22°C), around 2 to 3 hours. Unwrap dough and transfer to a well-floured work surface. Roll dough into a 10-inch by 6-inch rectangle. Using a pizza cutter or bench knife, divide dough into ten 1-inch by 6-inch strips. Cover dough loosely with a damp paper towel.\nTim Chin\nWorking with one strip at a time, cut in half crosswise to form two 3-inch strips. Brush the unfloured top side of one 3-inch strip lightly with water, then layer the second 3-inch strip, unfloured side down, directly on top. Lay a chopstick lengthwise along the middle of the layered dough strip and press firmly to seal the strips together and form a groove. Repeat with remaining strips of dough and cover loosely with plastic wrap. Let dough strips rest for 10 minutes. Meanwhile, heat oil in a Dutch oven over medium-high heat until it registers 400°F (204°C) on an instant-read thermometer; adjust heat as necessary to maintain this frying temperature. Set a wire rack on a rimmed baking sheet, and have a spider or chopsticks and salt (and/or other seasonings) nearby.\nTim Chin\nTo fry the youtiao:\nWorking with one dough strip at a time, hold both ends of dough and stretch to 8 to 10 inches in length. Carefully lower dough into heated oil, gently laying the strip away from you, then immediately stretch a second strip of dough and add it carefully to the oil. Cook until dough sticks begin to float, about 10 seconds. Using chopsticks or a slotted spoon, flip dough sticks and cook for 10 to 15 seconds longer, then continue flipping dough sticks in 10- to 15-second intervals until dough is puffed and golden brown, about 90 seconds total. Using a spider, transfer fried dough to the wire rack set in the rimmed baking sheet. Sprinkle with kosher salt. Return oil to 400°F and repeat with remaining dough. Serve immediately.\nTim Chin\nSpecial Equipment\nStand mixer, Dutch oven or wok, digital thermometer.\nNotes\nBottled or filtered water works best, since extreme changes in pH can affect the extensibility of the dough.\nIn place of salt, the youtiao can also be sprinkled with sugar, or cinnamon sugar, to taste.\nMake-Ahead and Storage\nYoutiao are best served straight from the fryer.\nBreakfast & Brunch\nChinese\nFrying\nThe Latest"
}