{
  "url": "https://www.seriouseats.com/yum-jin-gai-norther-thai-style-chicken-soup-recipe",
  "image_url": "https://www.seriouseats.com/thmb/VFxhaXyO3jBaIZJR83noJtq19nc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__09__20140707-small-house-thai-cooking-school-yum-jin-gai-5-752d22681ce442eba1a342b278a904bd.jpg",
  "tags": [
    "Whole Chicken",
    "Thai",
    "Dairy-free Mains",
    "Stovetop Chicken",
    "Soups"
  ],
  "title": "Yum Jin Gai (Spicy Northern Thai-Style Chicken Soup) Recipe",
  "full_text": "Yum Jin Gai (Spicy Northern Thai-Style Chicken Soup) Recipe\nClose\nJump to recipe\nPrep\n10 mins\nCook\n95 mins\nActive\n30 mins\nCooling Time\n10 mins\nTotal\n115 mins\nServes\n4\nto 6 servings\nCook Mode\n(Keep screen awake)\nIngredients\n1\nwhole\nsmall chicken\n(about\n2 1/2\npounds\n), legs and breasts removed, carcass reserved\n2\nsmall\ndried hot chiles\n1/4\nteaspoon\nwhole\ncoriander seed\n1/4\nteaspoon\nwhole Sichuan\npeppercorns\n1\nwhole\nlong pepper\n(see note)\n1/4\nteaspoon\nwhole cloves\n1\nstar anise\npod\n1\n(1/4-inch\npiece\n)\nmace\n, or\n1/4\nteaspoon\nground nutmeg\n1/2\ncinnamon stick\n4\npods\nThai black cardamom, inner seeds only, or\n1\npod\ngreen cardamom\n1/4\nteaspoon\nwhole black\npeppercorns\n1\ntablespoon\nThai shrimp paste\n3\nthin slices\ngalangal\n(or ginger if galangal is not available)\n1\nstalk\nlemongrass\n, bottom 4 inches only, bruised multiple times with the dull side of a knife blade\n2\nwhole\nshallots\n, thinly sliced\n1\ntablespoon\nvegetable or\ncanola oil\n4\nounces\nbutton mushrooms\n, cut into quarters\n1/4\ncup\nroughly chopped cilantro\nFish sauce\nKosher salt\nDirections\nCover chicken pieces (including carcass) with cold water by 2 inches. Bring to a boil over high heat. Reduce to a simmer and cook until center of chicken breasts registers 145°F on an instant-read thermometer, about 15 minutes. Remove chicken breasts. Continue cooking until legs are completely tender, about 45 minutes longer, adding more water as necessary to keep chicken submerged. Transfer legs to bowl with chicken breasts and allow to cool. Discard carcass.\nWhile broth cooks, combine hot chiles, coriander, Sichuan peppercorn, long pepper, cloves, star anise, mace, cinnamon, cardamom, and black pepper in wok. Heat over medium heat, stirring and tossing constantly, until toasted and fragrant, about 2 minutes. Transfer to a mortar and pestle or a spice grinder and grind into a fine powder. Wipe out wok. Add shrimp paste to spice mix and blend with a fork until homogenous.\nWhen chicken is cooked, add galangal and lemongrass to broth and simmer for 15 minutes. Strain broth through a fine mesh strainer and set aside. Pick chicken meat into bite-sized pieces and discard bones.\nHeat oil in the now-empty wok over high heat until shimmering. Add mushrooms and cook, stirring occasionally, until lightly browned, about 8 minutes. Add shallots and spice mix and cook, stirring constantly, until fragrant, about 30 seconds. Add strained broth and chicken pieces. Bring to a simmer, stir in cilantro, and season to taste with fish sauce and salt. Serve immediately.\nNotes\nLong pepper can be ordered via Amazon. Canned low-sodium chicken broth can be used in place of the whole chicken carcass. If using canned broth, simmer the chicken legs and breasts as directed in the first part of step 1. Proceed immediately to step 2.\nThis Recipe Appears In\nRecipes From Chiang Mai: Yum Jin Gai (Spiced Chicken Soup)\nFour Essential Northern Thai Dishes to Make Right Now\nWhole Chicken\nThai\nDairy-free Mains\nStovetop Chicken\nSoups",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/yum-jin-gai-spicy-northern-thai-style-chicken-soup-recipe.webp?"
}