{
  "url": "https://www.seriouseats.com/zaatar-recipe-6375053",
  "image_url": "https://www.seriouseats.com/thmb/TY9M04a5h9yyXsDeo0eS0w3wnKI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221506-zatar-MaiKakish-Hero-7b4e527ef34146cdbb4f3bc9e14f3194.jpg",
  "tags": [
    "Nuts & Seeds",
    "The Latest"
  ],
  "title": "Za'atar (Middle Eastern Herb Blend)",
  "full_text": "Za'atar (Middle Eastern Herb Blend)\nJump to recipe\nPrep\n5 mins\nCook\n10 mins\nCooling Time\n15 mins\nTotal\n30 mins\nServes\n96 servings\nMakes\n1/2 pound (250g; roughly 2 cups)\nCook Mode\n(Keep screen awake)\nIngredients\n1\ncup\n(\n6\nounces\n;\n180\ng\n) unhulled\nwhite sesame seeds\n(see note)\n2\ncups\n(\n1 1/2\nounces\n;\n45\ng\n)\ndried za’atar leaves\n, firmly packed (see note)\n1\ntablespoon\n(\n7\ng\n)\nsumac\n3/4\nteaspoon\n(\n3\ng\n) Diamond Crystal\nkosher salt\n; for table salt, use about half as much by volume or the same weight\nDirections\nIn an 8- or 10-inch stainless steel skillet, heat sesame seeds over medium-low heat, stirring continuously to avoid scorching, until aromatic and starting to pop, about 8 minutes. Transfer toasted sesame seeds to a bowl to cool completely.\nSerious Eats / Mai Kakish\nUsing a blender or spice grinder, and working in batches if necessary, grind za’atar leaves and one-third of the toasted sesame seeds to a fine powder. Transfer mixture to a large bowl, then whisk in the remaining sesame seeds along with the sumac and salt until well combined. Transfer to an airtight container, then store at room temperature for up to 3 months, in the refrigerator for up to 6 months, or in the freezer for up to 1 year.\nSerious Eats / Mai Kakish\nSpecial Equipment\nA powerful blender (like a Vitamix or a Thermomix) or a spice grinder\nNotes\nThe actual za’atar plant is not very easy to find in the US, although some specialty purveyors or international markets might carry it in the spring and early summer. Oregano is the most suitable substitute: For the best results, start with fresh oregano leaves and dry them according to the directions below (commercially dried oregano will be older and less flavorful). You can also mix in some marjoram and/or thyme leaves, but oregano should be the most prevalent herb (a ratio of 3 parts oregano to 1 part marjoram and/or thyme works best).\nTo get 1 1/2 ounces (45g) of dried oregano leaves you will need 250 to 300g fresh oregano leaves, from about 1 to 1 1/2 pounds (500 to 700g) oregano stems (once dried and rubbed to a fine consistency, this will yield about 1 1/4 cups). To dry the oregano, first taste the fresh leaves and make sure they are not so bitter, peppery, or astringent that it feels unpleasant in your mouth (some varieties of oregano can be especially intense and are best not used for this; most of the fresh oregano I've bought in the US is fine, but it's worth confirming before proceeding with the drying process). Spread oregano stems on towel-lined baking sheets and set in a well ventilated but clean area until completely dry (next to a sunny window is ideal). This can take from a few days to a couple of weeks depending on climate and batch size. Alternatively, use a dehydrator set to 100°F (38°C) until completely dry, about 36 hours. You will know the leaves are dry when one easily crumbles between your fingers.Rub dried leaves off of stems and discard stems, then proceed with recipe.\nMake-Ahead and Storage\nZa’atar can be kept in an airtight container at room temperature for up to 3 months, refrigerated for up to 6 months, or frozen for up to 1 year.\nNuts & Seeds\nThe Latest",
  "generated_image_url": "https://ideswdhtrmrqesmfbybh.supabase.co/storage/v1/object/public/recipe-images/zaatar-middle-eastern-herb-blend.webp?"
}