{
  "url": "https://www.seriouseats.com/zucchini-tart-cream-cheese-mozzarella-5197867",
  "image_url": "https://www.seriouseats.com/thmb/kdUqugzwSeqZDQuSDsD1MkIfMjI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/zucchinihero-2-301df89684204ee7a9ea17e0b31b7044.jpg",
  "tags": [
    "Zucchini & Yellow Squash",
    "Pastries",
    "Snacks & Appetizers",
    "The Latest"
  ],
  "title": "Zucchini Tart With Cream Cheese, Mozzarella, and Thyme",
  "full_text": "Zucchini Tart With Cream Cheese, Mozzarella, and Thyme\nClose\nJump to recipe\nPrep\n15 mins\nCook\n40 mins\nResting Time\n30 mins\nTotal\n85 mins\nMakes\n1 11- by 15-inch tart\nCook Mode\n(Keep screen awake)\nIngredients\n1 1/4\npounds\nzucchini\n(\n570\ng\n; about\n2\nmedium\nzucchini\n), cut into 1/8-inch-thick rounds\n1 1/4\nteaspoons\nDiamond Crystal\nkosher salt\n, plus more to taste as needed; for table salt, use half as much by volume\nAll-purpose flour\n, for dusting\n2\nsheets\nfrozen\npuff pastry\nfrom one 14-ounce box, thawed until pliable but cool\n4\nounces\n(\n113\ng\n) full-fat\ncream cheese\n, softened\n1\ntablespoon\n(\n15\ng\n)\nDijon mustard\n1 1/2\nteaspoons\nchopped\nfresh thyme\nleaves, plus additional leaves for garnish\n1\nmedium\ngarlic clove\n(\n5\ng\n), minced (optional)\n4\nounces\nshredded low-moisture\nmozzarella\n(\n113\ng\n; about\n1\ncup\n)\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\nFreshly\nground black pepper\nFinely\ngrated zest\nof\n1\nlemon\nDirections\nAdjust oven rack to middle position and preheat oven to 400°F (204°C). Line a rimmed baking sheet with a double layer of paper towels or a clean kitchen towel. In a colander set over a large bowl, toss the zucchini with salt. Let drain for 30 minutes.\n[Photograph: Debbie Wee].\nDebbie Wee\nPress zucchini firmly with a rubber spatula to squeeze out moisture. Transfer zucchini to prepared baking sheet and spread evenly over towels; discard accumulated liquid and wipe out bowl. Use additional paper towels or a second clean kitchen towel to blot zucchini, ridding them of as much excess moisture as possible. Return zucchini to now empty bowl and set aside. Discard paper towels used to line rimmed baking sheet; line now empty baking sheet with parchment.\n[Photograph: Debbie Wee].\nDebbie Wee\nOn a lightly floured surface, place one sheet of puff pastry directly on top of the other. Using a rolling pin, roll pastry into a 11- by 15-inch rectangle. Transfer pastry to prepared baking sheet. Poke pastry all over with a fork. Cover the pastry with a sheet of parchment and place another rimmed baking sheet on top. Bake until pastry is pale and firm to the touch, about 15 minutes. Remove from oven and remove the top baking sheet and parchment. Increase oven temperature to 445°F (230°C).\n[Photograph: Debbie Wee].\nDebbie Wee\nIn a medium bowl, combine cream cheese, Dijon mustard, thyme, and garlic (if using) and stir together until well combined. Using an offset spatula, spread cream cheese mixture in an even layer over puff pastry, leaving a 1/2-inch border on all sides. Sprinkle evenly with mozzarella.\n[Photograph: Debbie Wee].\nDebbie Wee\nAdd olive oil to bowl with reserved zucchini and toss to coat. Shingle zucchini in even rows over the mozzarella and season with freshly ground black pepper.\n[Photograph: Debbie Wee].\nDebbie Wee\nBake tart until zucchini is tender and puff pastry is crisp and deeply browned at the edges, about 20 minutes.\nDebbie Wee\nGarnish tart with thyme leaves and lemon zest. Season with salt to taste. Cut into portions and serve immediately.\nDebbie Wee\nSpecial Equipment\nRimmed baking sheets, parchment paper,\nrolling pin\n,\nruler\n,\nchef’s knife\nor\nmandoline\n, small offset spatula\nNotes\nIt’s best to use medium zucchini that are similar in size and shape.\nMake-Ahead and Storage\nThis tart is best eaten immediately.\nThe cream cheese mixture can be made ahead of time. Store in an airtight container and refrigerate for up to 1 week.\nZucchini & Yellow Squash\nPastries\nSnacks & Appetizers\nThe Latest"
}