{
  "url": "https://www.seriouseats.com/zuppa-toscana-olive-garden-recipe-8788253",
  "image_url": "https://www.seriouseats.com/thmb/687cyV3UuhBU0iiZ1w22Zd_cYfg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250207-SEA-Zuppa-Toscana-AmandaSuarez-hero-6a668e643a4c4abdbada6f35392e3bac.jpg",
  "tags": [
    "Soups",
    "The Latest",
    "American",
    "Italian-American"
  ],
  "title": "Zuppa Toscana",
  "full_text": "Zuppa Toscana\nClose\nJump to recipe\nPrep\n15 mins\nCook\n75 mins\nTotal\n90 mins\nServes\n6\nto 8\nCook Mode\n(Keep screen awake)\nIngredients\n1\ntablespoon\n(\n15\nml\n)\nextra-virgin olive oil\n1 1/2\npounds\n(\n680\ng\n) mild or\nspicy Italian sausage\n, removed from casing\n2\nmedium\nonions\n(\n8\nounces\n;\n227\ng\neach), finely chopped\n3\nmedium\ncloves garlic\n(\n1/2\nounce\n;\n15\ng\n), finely chopped\n3\nmedium\ncelery ribs\n(about\n5 3/4\nounces\n;\n165\ng\n) with leaves, finely chopped\n1\nmedium\nfennel bulb\n(\n8\nounces\n;\n226\ng\n), finely chopped\n1 1/2\nteaspoons\nfennel seeds\n1/4\nteaspoon\ncrushed red pepper flakes\n10\ncups\n(\n2.4\nL\n)\nhomemade chicken stock\nor store-bought low-sodium broth\n1 or 2\nParmigiano-Reggiano cheese rinds\n(optional), plus\nGrated Parmigiano-Reggiano\n, for serving\n6\nounces\n(\n170\ng\n) lacinato or curly\nkale\n, stemmed and cut or torn into roughly 2-inch pieces\n1\nrusset potato\n(\n12\nounces\n;\n340\ng\n), peeled and cut into irregular chunks about 1/2 inch thick (read about\nthis potato cutting method\nfor more details)\n1/2\ncup\n(\n120\nml\n)\nheavy cream\nDirections\nIn a 5-quart soup pot or Dutch oven, heat olive oil over medium heat until shimmering. Add sausage and cook, stirring to break up the meat and scraping bottom of pot, until well browned, 6 to 8 minutes. Using a slotted spoon, remove sausage from pot; set aside. If meat has rendered an excessive amount of fat, use a metal or other heat-safe spoon to ladle most of it out, leaving 2 to 3 tablespoons in the pot. (If, conversely, you have less than about 2 tablespoons of fat left, add extra olive oil.) Add onion, garlic, celery, fennel, fennel seeds, and crushed red pepper flakes, and cook, stirring and scraping bottom of pot, until vegetables are softened and release some moisture, about 8 minutes.\nSerious Eats / Amanda Suarez\nSlowly pour in stock or broth along with Parmesan rind(s) (if using). Bring to a boil over medium-high heat. Add kale and simmer until kale has softened slightly, about 10 minutes.\nSerious Eats / Amanda Suarez\nAdd potato and continue to simmer, stirring occasionally, until kale is very tender and potato is fully cooked through and its exterior has sloughed off (the potato nubbins should be rounded and smaller and the soup should be thickened with the released potato starch), about 30 minutes (if the potato is slow to wear down, stir more to agitate it and help it along).\nSerious Eats / Amanda Suarez\nReturn sausage to soup and simmer until flavors have melded, skimming any excess fat that pools on the surface, about 10 minutes. Remove soup from heat and stir in heavy cream. Season to taste with salt and pepper; if soup is too thick, thin with additional warm stock until proper consistency is reached. Divide into bowls and serve with grated Parmigiano-Reggiano to sprinkle on top at the table.\nSerious Eats / Amanda Suarez\nSpecial Equipment\n5- or 6-quart soup pot or Dutch oven\nMake-Ahead and Storage\nLeftovers can be refrigerated in an airtight container for up to 4 days. Gently reheat soup in a pot over medium-low heat until warmed through, then serve.\nSoups\nThe Latest\nAmerican\nItalian-American"
}